{
  "AuthorID": "lrwells50",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
  "Posts": [
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Mar 15, 2017 09:52AM lrwells50 wrote: my daughter bought me a couple of what I would call nail belts, very similar to what waiters and waitresses wear, at Home Depot. $.77 ea",
      "MessageIndex": 236,
      "PostDate": "15/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Mar 25, 2017 10:32AM lrwells50 wrote: I really haven't been doing a lot, but maybe I'm reaching too far for things, like clothes in the dryer. It doesn't hurt when I do it, but maybe that's it",
      "MessageIndex": 422,
      "PostDate": "25/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Mar 28, 2017 04:18PM lrwells50 wrote: Found out today that rather than IDC I had ILC with ductal features. Was quite a surprise. ER+/PR+, HER2-. Oncologist ordered an oncotype test, and a CT. Saw the breast surgeon today, and he said if the MO suggests chemo, to call him first. Still have 2 drains putting out a lot of fluid. PS flushed today with an antibiotic, gave me a Bactrim Rx, and I go back Friday to have the drains removed. He said three weeks is as long as he'll leave them in since I have tissue expanders. Lynn",
      "MessageIndex": 510,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 18, 2017 02:23PM lrwells50 wrote: 2FUN, a Seroma is fluid that collects in a pocket. I've been producing fluid like crazy, and after the PS took out my drains at 3 weeks (his rule) they've aspirated fluid 5 times. It's finally slowing down, 2 months after my BMX. Yours may be more compact, but I could tell because my loose skin under the TEs would jiggle like Jello.",
      "MessageIndex": 932,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Mar 14, 2017 02:57PM lrwells50 wrote: Had my SNB on 2/24, results were clean, so no radiation. I only had a 7 mm invasive ducal cell carcinoma, and could have gone the lumpectomy and radiation route, but I'm 66, and have a family history of breast cancer, so I had bilateral mastectomies on 3/8, and was home the night of 3/9. I can't believe it's such a short stay! Haven't been on much in the way of pain medication since the 11th. I think I'm more likely to need a sleeping pill. I have trouble with that anyway. I have four drains, and 2 of them rarely have anything in them starting Sunday. Am definitely swollen under my arm, but dont have a lot of pain, and have good arm movement. I don't go back to the plastic surgeon until the 21st (spring break, I bet) but if the swelling continues, I'll call the breast surgeon. lrwells50 ",
      "MessageIndex": 221,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Mar 25, 2017 08:46AM lrwells50 wrote: I had two drains out last week, but the last two are still draining a lot, so I'm betting I don't get them out next Tuesday like I'd hoped. I'm guessing as much as they are still draining, that without the drains that would translate into swelling, which I have plenty of anyway. I'm 17 days post BMX, and PS says I can't take a shower until the drains are out, and I'm REALLY tired of sponge baths and washing my hair in the kitchen sink. I live two hours away from my docs, and plan to drive myself to my appointments on the 28th. I don't think I'll have any issues, but can rest at my daughter's before going home if I need to. Really hope they take the drains out - it will make dressing so much easier. If they are going to leak, though, I'd rather keep the drains. Good luck to everyone who is about to undergo surgery, and speedy healing to the ones recovering from surgery ",
      "MessageIndex": 419,
      "PostDate": "25/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Mar 28, 2017 04:59PM lrwells50 wrote: I am 3 weeks post BMX, and my BS told me today deodorant is fine, and his nurse suggested an electric razor. Because I'm still somewhat numb I was afraid to use a razor",
      "MessageIndex": 511,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Apr 8, 2017 08:04AM lrwells50 wrote: I'm also waiting for results of a CT and my Oncotype score. See the MO Monday afternoon. I'm really hoping no chemo. The PS removed my last two drains even though they were still producing a lot of fluid, because he didn't want to court infection. When I went for my first fill last Tuesday, they aspirated as much fluid as they put saline in the expanders! They didn't seem alarmed, but I can tell they'll have to aspirate more when I go again Tuesday. On the plus side, no pain from the fill",
      "MessageIndex": 696,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 27, 2017 04:20PM lrwells50 wrote: My BMX was 3/9, and I went back to work about 3 weeks later, 20-30 hours a week. I'm still a combination of numb and can feel light pain on the sentinel node biopsy scar when I bathe. The other side is still slightly numb, but no pain. My TEs have been fine. They filled me with 120 ccs each time, and I had no pain at all. After my last chemo 7/21, I'm to call my PS and set up an appointment to see if I need any more fills, and to set up my exchange surgery. it's daughter #1s turn to come cook and clean for a week, so I'll have to coordinate the surgery with her schedule",
      "MessageIndex": 977,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 2, 2017 06:39PM lrwells50 wrote: Dafne, my 36 year old niece was diagnosed with triple negative IDC, and had genetic testing. She had mutations on two genes. My mother, her grandmother, had breast cancer twice, but died at 86 of complications from COPD. Would have been nice to know more about her cancer, but it was 30 years ago, and even if I'd thought to ask, I doubt that she would have known many details. I have a mutation on BARD1, which isn't either of the ones my niece tested for. Also, my BC is ILC, unlike hers. The thought is her mutations come from her mother's side, not my brother's. It has been recommended that both of my daughters, 40 and 34, be tested as well, and they are okay with that. I think the more you know, the more you can help yourself.",
      "MessageIndex": 952,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 1, 2017 03:01AM lrwells50 wrote: I can't remember how many injections I received before my sentinel node biopsy, but only one hurt, and it was very brief, but maybe a 7 on a scale of 10. He did give me some lidocaine first",
      "MessageIndex": 986,
      "PostDate": "01/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 12, 2017 10:30AM lrwells50 wrote: I had my implant onlyexchange surgery 10/18. Got my first drain out two weeks later, but had to keep the other one for another week. I’ll still need to wear a padded bra, or one with prosthetics because of my large stomach, but need to wait another couple of weeks to be fitted. If I’d lose 75 pounds, the boobs would probably be exactly the right size, so I’m working on that. I found the pain from the exchange surgery different than that from the BMX. I didn’t have much trouble at all raising my arms, but it hurt at first to bend over. I think it may have been due to the liposuction needed to “contour” the breasts. Wasn’t too bad, anD my daughter was her for about 10 days to help out. I’m still glad I didn’t do the flap surgery that the PS recommended. At 66, 67 now, I just thought it was asking for more complications.",
      "MessageIndex": 1025,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Apr 2, 2017 02:03PM lrwells50 wrote: The funny thing for me, is that the burning pain is in my right thigh! Don't know if it was a little traumatized or what. Hasn't been unbearable so far, and only happens when I'm in bed. ",
      "MessageIndex": 582,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Apr 8, 2017 02:11PM lrwells50 wrote: So sorry for all of you with infections. One of my incisions is kind of rosy, but am hoping it's the sports bra I'm wearing while at the office. I had my sentinel node biopsy on 2/24, and my armpit is still mostly numb, with a ridge of (I guess) scar tissue. I was just at the PS Tuesday, and they saw everything and said it was coming along well, so I'm trying not to borrow trouble.",
      "MessageIndex": 707,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 23, 2017 07:24AM lrwells50 wrote: Happy Thanksgiving! We are in Dallas, and I realized this morning I forgot my make-up bag, so not much in the way of eyebrows until I get to my daughter’s where I have some makeup. While my brows are coming in pretty well, they aren’t nearly as coarse as before, and I have to use lot of brow powder to have them show up much. I had my exchange surgery on October 18, got one drain out after two weeks, and the third was still putting out 40 cc’s a week later, so I lied and said it was 25. I’ve been down this road before. I can’t tell it caused any swelling on that side. I to fitter for a mastectomy bra and prostheses, as I just had implants, and they aren’t really big enough without some. This was my choice, as he wanted to do lat flaps and use larger implants. At 67, I just didn’t think it was wise. I can live with the prostheses, and if I’d lose 75 pounds, I might be the right size anyway. So far I’m pretty even, but I didn’t have radiation, so that may be the difference. Because of the holidays, I don’t see the PS again until the first week in January. Good luck to everyone, hope you “even out.”",
      "MessageIndex": 1039,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 15, 2017 10:33AM lrwells50 wrote: Kaso, I also had a speculated mass, which my radiologist (also a good friend) said was IDC, and I could have a lumpectomy, radiation, anti-hormone pills, and be finished with it. He was right on everything except the IDC, which after the surgery labs turned out to be ILC. I ended up deciding on a BMX, due to my age and family history. My OncotypeDX score was also higher than anticipated, so I'm doing chemo. You never know exactly what's going to happen, and I've just tried to roll with the punches.",
      "MessageIndex": 21,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727544",
      "Title": "Spiculated Mass joanmac52 Moderators"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 24, 2017 06:02PM lrwells50 wrote: My PS said he could do my exchange surgery 6 weeks after my last chemo, so I guess it's pretty standard",
      "MessageIndex": 228,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 10, 2017 02:06PM lrwells50 wrote: I couldn't drive until after my drains were out, and that was at three weeks. I could do laundry and cook after 2, though I had my husband carry the laundry in to the laundry room. My kids as 8 year olds would have been smart enough to help, I bet yours are too. It's not like they're toddlers. I was back at work part time at 4 weeks, and pretty much full time after that, and I'm 66. I'm sure you're in much better shape than I am! ",
      "MessageIndex": 303,
      "PostDate": "10/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 22, 2017 12:43AM lrwells50 wrote: I think my MO wanted a CT because I have frequent indigestion, and he was afraid of mets. My abdomen was negative for mets, but did show that I have a small hiatal hernia, which explains the indigestion. Although I had no node involvement, my postsurgery labs showed I had ILC instead of IDC, and an intermediate OncotypeDx score, so I just today finished my last chemo. I go back in three weeks for the Arimidex prescription. Good luck with your future treatment.",
      "MessageIndex": 21,
      "PostDate": "22/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856380",
      "Title": "Diagnosed 1 week ago with IDC Mykidsmom65 lrwells50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 16, 2017 04:09PM lrwells50 wrote: I knitted my own, and took out stuffing each time I had my TEs filled",
      "MessageIndex": 9,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/851997",
      "Title": "Knitted knockers BethHG lrwells50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 27, 2017 12:32PM lrwells50 wrote: That page of my report had a blank for the percentage with 5 years of tamoxifen plus chemo, and my doctor wrote 6%>.",
      "MessageIndex": 26,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856330",
      "Title": "Oncotype score vs recurrence risk - please help Rubyroo lrwells50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jan 7, 2018 10:18AM lrwells50 wrote: My radiologist is a friend, and he too called me back for an ultrasound and told me it was a spiculated mass, and he felt sure it was IDC, and that I could have a lumpectomy and radiation and be finished with it. That is indeed what the biopsy showed, but when I saw the BS, he gave me a lot more options, and because of a family history of BC, my age, and huge breasts, I opted for BMX. Everyone is correct - this is the worst part. Once you’ve decided what to do and have a plan, you’ll feel much more in control. As it turned out, my surgical labs changed to ILC, and my OncotypeDX was 24. A lot of people with this score choose not to do chemo, but I knew I’d worry constantly if I didn’t, so did 4 rounds of TC. I was only in the hospital overnight with the BMX, no real trouble at all with it, and had a pretty easy time with chemo. Finished that in July, and my hair is a couple of inches long. No radiation necessary, no lymph node involvement. I don’t say this to frighten you, but to assure you that you’ll get thru this, and you’ll really feel much more in control once you have a plan",
      "MessageIndex": 11,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/861402",
      "Title": "Told I have cancer without even a biopsy tld2017 Micmel"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 27, 2017 10:10AM lrwells50 wrote: I know y'all are discouraged with your hair growth, but it makes me feel better. My last chemo is 7/21, and your pictures give me some hope that I'll have enough by Christmas to ditch the wig. I wore my hair pretty short anyway, which will help. My third treatment is Friday, and I still have a bunch of 1\" standing-straight-up hair, as well as some that either came in just before or just after my first treatment. I'm surprised to still have any left, frankly. I'm hoping the blasted hairs on my chin come back dark so I can have them lasered, but with my luck they'll be gray.",
      "MessageIndex": 25473,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Dec 1, 2017 11:26AM lrwells50 wrote: I ditched the wig today, couldn’t stand it any longer",
      "MessageIndex": 25994,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jan 7, 2018 09:26AM lrwells50 wrote: My radiologist friend that found the tumor on mammo, warned me that MRIs generate a lot of false positives. Thinking about having oneevery 6 months decided me on BMX instead of lumpectomy.",
      "MessageIndex": 28,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861268",
      "Title": "MRI Results: Completely the Last Thing I Expected! ILikeCats ILikeCats"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 4, 2017 11:08AM lrwells50 wrote: Mine has always been a little wavy, although it's not noticeable because I keep it so short, but now that I've cut it to 3/4\" so it's not so gross when it falls out, I can see how many cow licks I have. Really hope mine comes back curly, or it's going to look weird for a long time",
      "MessageIndex": 25406,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Aug 18, 2017 05:44PM lrwells50 wrote: I'd be thrilled with that, seq24, I usually wear mine shorter than that! I was probably 35-40% gray before, (hard to tell exactly because I colored it,) so my fear is that it will be gray, and will take even longer to tell I have any hair at all. Whatever it comes in like, I do know I'll take the opportunity to stop coloring it",
      "MessageIndex": 25631,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 12, 2017 08:19PM lrwells50 wrote: T-Sue, There’s no gray because I had it colored last week",
      "MessageIndex": 25898,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 12, 2017 09:50PM lrwells50 wrote: I had maybe 5% that I never lost, I looked like a baby ostrich. I’d say it started growing about 3 weeks after my last chemo, which makes sense. My hairdresser buzzed the nape of my neck pretty short, which is how I wear it anyway. She also cut the front, some, because that is the hair that felt kind of fuzzy. For the most part it all feels pretty soft. Sure feels weird to have these tight little waves, though.",
      "MessageIndex": 25900,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Dec 1, 2017 11:33AM lrwells50 wrote: I’m not sure some of the thinning on the sides isn’t due to my CPAP mask. My hairdresser had mentioned it prior to all of this BC mess ",
      "MessageIndex": 25995,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 30, 2017 09:19AM lrwells50 wrote: I colored mine whether it was long enough or not. It was so much whiter in the front and on the sides, that you could see the white sideburns under my wig, and I couldn’t stand it. Now that it’s colored, I can see the growth rate, and especially in front, it’s a lot slower than before chemo, but it’s growing.",
      "MessageIndex": 25990,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 7, 2017 12:25PM lrwells50 wrote: mistyeyes, my MO told me the same. He also said he only had 1 patient that had any permanent neuropathy. He's not much younger than I am, so he's been at this a lot of years, so I'm encouraged by that. I only have about 5-10% of my hair left. I wish my hair was darker. The hair that isn't already gray is a light brown, so I'm thinking I won't look like I have any even once it comes in until months out. Maybe the chemo will make my hair come back dark and curly with no gray! I can always dream!",
      "MessageIndex": 25417,
      "PostDate": "07/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 21, 2017 08:49PM lrwells50 wrote: I'm going with whatever color it comes back as. I'd already been wondering how I was going to slowly start going gray. It will be so much easier to not color.",
      "MessageIndex": 25459,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 25, 2017 03:22PM lrwells50 wrote: Pre-chemo I used a product called Vaniqa, prescribed by my GYN, but you have to use it morning and evening, and it's expensive and not covered by insurance. I only had to use it on my chin, so it lasted a year, but was over a $100 a tube. If they come back dark enough, I'll have them lasered",
      "MessageIndex": 25465,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 1, 2017 06:17PM lrwells50 wrote: Well, got my hair buzzed this afternoon, and I'm here to tell you 3/4\" is short! I haven't colored it in 2 months, so all that was cut off. It's not as gray as I was afraid it would be, so when it grows back I'll stop coloring it",
      "MessageIndex": 25396,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 6, 2017 08:32AM lrwells50 wrote: My hair will probably be totally gone in a couple of days, which will be a blessing, as the itching has been driving me crazy. I'm just praying that it comes back, as permanent hair loss is a possibility with Taxotere",
      "MessageIndex": 25415,
      "PostDate": "06/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Oct 29, 2017 05:53PM lrwells50 wrote: I’m 14 weeks PFC, and my hair is coming in fairly well. There are still some thin patches, but I’m hoping they fill in. My biggest problem is how WHITE I am. I guess this is what happens when you’ve colored your hair for the last 15 years. I have a lot of cowlicks, so it’s hard to tell if it’s going to be curly, but I think it will be. I’d say it’s about 1/2” long, maybe. I’ve always worn my hair short, and the people at the office didn’t realize I was wearing a wig. So now I have to decide whether to go salt and pepper (and it’s more salt) after no gray the last time everyone but family saw me, or color it like I had been, and figure out how to go gray more naturally. I’ve made an appointment for 12/5, and guess I’ll have decided which way to go by then.",
      "MessageIndex": 25850,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 12, 2017 06:47PM lrwells50 wrote: This is today, 16 weeks PFC. I don know why there’s a red blob on the right. My hair is growing pretty fast, but was a lot grayer than I knew, since I’ve been coloring it for about 15 years. I’m still more comfortable wearing the wig, and my “sideburns”were so gray I had my hairdresser dye it Thursday. I wear glasses, and that pushed the wig out far enough to be able to see the gray, which looked pretty tacky. It’s also coming in very wavy, which I assume will be curls when it’s longer. I think I have another month in the wig before I’ll feel comfortable without it. ",
      "MessageIndex": 25896,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 23, 2017 03:02PM lrwells50 wrote: I’m 18 weeks PFC, and my hair is coming in pretty thickly, but it’s so curly, I think it will be another few weeks before I can stop wearing the wig. I’m taking biotin, which my MO said was okay, and my nails and hair are growing fast. I lost most of my eyebrows and all of my eyelashes about 4-5 weeks post chemo. My eyelashes have come back in, but they aren’t growing as fast as my hair. My eyebrows have come back, but they are much finer than before, and I have to use some powder to fill in. I hope if I was going to lose the brows and lashes again, I would have already done so",
      "MessageIndex": 25938,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 27, 2017 10:13PM lrwells50 wrote: I’m 18 weeks PFC, and I’d say my hair is about an 1-1/2” long, except in the front, where it’s more like 3/4” Pre-chemo I had a haircut every 4 weeks, so mine is growing slowly, but I think it’s picked up since I started taking Biotin.",
      "MessageIndex": 25946,
      "PostDate": "27/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 25, 2017 01:23AM lrwells50 wrote: I am very lucky in that the radiologist that reads my mammos is married to a good friend. I hadn't even gotten dressed before he told them to bring me back to show me the tumor. He came in the next day on his day off to do the biopsy. Unfortunately it was Friday, so I had to wait until Monday for the path report. He was shocked when the surgery labs came back ILC, because he said it looked like a typical spiculated IDC mass. He said he'd seen lots of reports that said IDC with lobular characteristics, but this was the first one that said lobular with IDC characterization",
      "MessageIndex": 26,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 15, 2017 08:30PM lrwells50 wrote: True, Kicks, you were snarky to LuckyNumber47.",
      "MessageIndex": 24,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856007",
      "Title": "Can you drive yourself to chemo? Autum1031 lrwells50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 15, 2017 05:50PM lrwells50 wrote: Kind of a snarky comment, Kicks. MinusTwo doesn't post a lot of unsubstantiated stuff.",
      "MessageIndex": 21,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856007",
      "Title": "Can you drive yourself to chemo? Autum1031 lrwells50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 17, 2017 12:02PM lrwells50 wrote: I think it's more like days 7-10. I've been working week one",
      "MessageIndex": 210,
      "PostDate": "17/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 9, 2017 08:53PM lrwells50 wrote: Everybody told me I wouldn't need chemo, but my labs said ILC instead of IDC, and more likely to recur, and my OncotypeDx was 24, right in the middle of the intermediate range, so I'm doing chemo",
      "MessageIndex": 5,
      "PostDate": "09/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/856782",
      "Title": "Oncotyping scores susie_2017 QuinnCat"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 25, 2017 07:39PM lrwells50 wrote: I was ER and PR positive, but had a score of 24. I'd want to know if it were me",
      "MessageIndex": 4,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857327",
      "Title": "Oncotype Test Not Covered... worth it to pay out of pocket? JennD Traveltext"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 16, 2017 08:29AM lrwells50 wrote: I have a 2 hour drive home, and after the first infusion, I would have been fine. We even stopped for dinner on the way home. The second one, though, he gave me 500 ccs of saline, because he didn't t like my creatinine levels. Saline shouldn't have made any difference, and it may have been because I was retaining water or something, but I felt \"off\" after #2. I probably would have been fine, but I was glad Paul was there. In my case, even though I could probably have called my sister who lives fairly close to take me home, there would have been the problem with my car stuck in Dallas and having to get it back to Paris. I think you should have a backup plan if you drive yourself, just in case. Kicks, it just struck me that you were automatically making the assumption that it couldn't have been the chemo that caused the woman's seizure. We don't know. And I agree that texting has caused way too many wrecks, but we should all be cautious, and not assume that just because one person was okay to drive themselves home from chemo, that we all would be every time. My last chemo, one of the women fainted coming back from the bathroom, and that kind of freaked me out. I think hers was more a long standing uncontrolled high blood pressure issue, but it was still scary.",
      "MessageIndex": 30,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856007",
      "Title": "Can you drive yourself to chemo? Autum1031 lrwells50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 21, 2017 09:38PM lrwells50 wrote: I think I'm hitting the side effect wall. I slept 9 hours last night and could probably have slept more. Taste buds starting to feel weird, not hungry. Went to the grocery store this morning and that about wiped me out",
      "MessageIndex": 1,
      "PostDate": "21/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 22, 2017 04:39AM lrwells50 wrote: rdsm, no cold capping. The do it yourself was too much for us, and the Paxman system won't be at Baylor until June or July. Will just have to take my chances. On the positive side, I've had no nausea, and had spaghetti and meat sauce for dinner with no ill effects",
      "MessageIndex": 4,
      "PostDate": "22/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 20, 2017 07:26PM lrwells50 wrote: laurieellenb, my lack of scarf tying skills is why I haven't bought any! I haven't found the wig too irritating, but then I haven't been outside for any appreciable time yet either. If my head sweats, I predict it will be very unpleasant, we'll see. I still have some hair about an inch long all over my head, and what looks like new, very short hair all over. I'm guessing I'll start losing that tomorrow, since it will be 13 days post second chemo. I haven't seen anyone else taking Taxotere talking about still having any hair left, so not sure what's going on with mine. Even though I had buzzed mine to 3/4\" before I started losing it, it was still depressing to see how much came out in the shower each day. Finally I just stayed in the shower shampooing it until everything that was loose came out. I don't know if I'd say I was more tired after this one, but I do have more trouble concentrating, and a LOT more trouble WANTING to go to work. I guess if I wasn't married to my boss I would have more motivation. I've watched a lot of shows on the DIY network.",
      "MessageIndex": 87,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 30, 2017 03:04PM lrwells50 wrote: Had my third treatment today. If this one follows the last one, I'll feel fine tomorrow, sleepy the 3rd day (and I need Aleve to go along with Claritin to ward off Neulasta pain) and at work the 4th. I can't complain at all, and hope this one goes the same way",
      "MessageIndex": 102,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 5, 2017 10:24AM lrwells50 wrote: Eschofi, chemo prevents your body from healing, so the PS probably doesn't have any choice but to wait until you have healed",
      "MessageIndex": 49,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 25, 2017 06:06PM lrwells50 wrote: I still haven't been told that. They gave me a sheet about Cytoxin and Taxotere, but I don't think it said a thing about alcohol",
      "MessageIndex": 300,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 2, 2017 09:04PM lrwells50 wrote: I'm almost 3 months post BMX with tissue expanders, and I'm still pretty numb",
      "MessageIndex": 18,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/848760",
      "Title": "Numbness after mastectomy and lymph node biopsy :( Momandwife36 lrwells50"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Apr 27, 2017 02:41PM lrwells50 wrote: I start in a couple of weeks. I've had lots of fluid from my bilateral on 3/8, and they have been aspirating it when I go for my fills. It's finally starting to slow down, so after another fill, and maybe aspiration, week after next, I'll start the chemo. The local MO sent off for an OncotypeDx, and it came back a 24, smack dab in the middle of the intermediate range. He wanted to do AC + Taxol, 8 treatments, but my second opinion MO at Baylor Dallas said he thought that was overkill, and said they do 4 treatments of Cytoxin and Taxatore over 9 weeks, so the local MO agreed to that. I'm glad it was amicable, because I really didn't want to have a two hour drive to get home from Dallas after a treatment. Have to call today to set up the port placement. If I'd gone to the Dallas guy first, he wouldn't have done the Oncotype, and we wouldn't be having this discussion. It's hard not to resent that, but the cancer is clearly nastier than they first thought, and I think if I'd chosen no chemo, I'd just be worrying about it all of the time. I really dread it, but I only live 5 minutes from the cancer center, and I'm 66, so I don't have kids at home to worry about, and I don't have to worry about my job, because I work for my husband, a CPA. We got past tax season, and this is the slowest time at work, so I'm good there. I'll have to shop for a wig, because I won't be comfortable with just scarves. The only real dread I have is any permanent neuropathy or baldness, and I guess I'll just have to hope for the best",
      "MessageIndex": 35,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 27, 2017 05:51PM lrwells50 wrote: Msrobin58, I wish not much sounded good to me! Everything sounds good to me, and other than my premeds, no steroids here. Starting yesterday was the start of my low resistance period. I went in to the office for a conference call, and on the way home saw the fried pie food truck. All I could think about was cherry pie, and I had decided I should only eat home cooked food this weekend. I made my husband go to Kroger and find pie cherries (which are hard to find here nowadays\"), and made a cherry pie. 🍒🍒🍒🍒🍒",
      "MessageIndex": 370,
      "PostDate": "27/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 4, 2017 11:44AM lrwells50 wrote: My MO doesn't require a blood test except before each chemo, so I'm guessingthey just assume most people will need it.",
      "MessageIndex": 423,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 4, 2017 01:37PM lrwells50 wrote: I have a blood draw before each chemo, so I'm assuming my WBC was low enough that I needed it",
      "MessageIndex": 429,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 5, 2017 08:16PM lrwells50 wrote: My hair started shedding day 13, and it's now day 17, and I've maybe lost 50% of my hair. I wish the rest would come out, because the itching is driving me crazy",
      "MessageIndex": 440,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 12, 2017 02:27PM lrwells50 wrote: I napped and laid around yesterday for the first time, and still slept 8 hours last night. No bone pain though, so staying on top of it with Tylenol seems to have helped.",
      "MessageIndex": 481,
      "PostDate": "12/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 15, 2017 04:51PM lrwells50 wrote: Have started having taste issues after chemo #2 - nothing tomato based tastes good, even stuff like thousand island dressing. Had tacos last night though, and they tasted great, as did the hot sauce. Maybe tomato with the vinegar in the hot sauce makes it okay. I also seem to be craving salt, which I know I shouldn't use a lot of. I've noticed water and tea tasting kind of nasty, too. Better with lemon, which I normally don't like in my water. Makes me worry about what's behind chemo door #'s 3 and 4.",
      "MessageIndex": 490,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 20, 2017 11:27AM lrwells50 wrote: Can't say I'm starving the day after. Had my usual breakfast, and am planning steak and baked potatoes for dinner. No funny tastes yet",
      "MessageIndex": 276,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 21, 2017 09:32PM - edited May 21, 2017 09:32PM by lrwells50 About 24 hours exactly after the Neulasta I'm definitely having joint pain. It's not awful, but kind of moves around.",
      "MessageIndex": 294,
      "PostDate": "21/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 23, 2017 09:21PM lrwells50 wrote: I know my Neulasta worked, because I have the bone pain to prove it! There are worse things, though",
      "MessageIndex": 332,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 28, 2017 02:48PM lrwells50 wrote: Angel, I've had no nausea at all on TC, but I haven't vomited in 40 years, so I'm not sure I'm the one to ask. For a few days during the first week I had abdominal cramps every time I had a bowel movement, which was weird. No diarrhea or constipation, just the cramps. Very odd, but it seemed to stop on day 8. A lot of people seem to have a poor appetite, but that hasn't been true for me, and I could use a few days of not being hungry. I'm having my hair buzzed to a half inch on day 14. It's been miserably humid here, so I don't know if I'll be able to stand the wig, we'll see. Good luck with your chemo. I'm hoping my second treatment goes as well as the first",
      "MessageIndex": 380,
      "PostDate": "28/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 7, 2017 12:15PM lrwells50 wrote: MomAngel, my worst problem the last two weeks are occasional neck pain and headache, but it doesn't have anything to do with the chemo. I've had the problem for a couple of years, and the PT gave me excercises for it, but it's hard to remember to do them if it doesn't hurt, but it hurts to much to do them when I do have pain. Guess I'll have to set an alarm on my phone as a reminder. He said the problem was that my shoulder muscles weren't strong enough, and that's where the problem really is, not the neck. Wish I still had my rowing machine!",
      "MessageIndex": 458,
      "PostDate": "07/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 8, 2017 04:49PM lrwells50 wrote: MoodyBlues and Hope1970, my hair started coming out day 12-13, and once it started it was like an avalanche over the next 5 days. I'm on day 20, and still a little came out in the shower this morning, but still have a few of these really unattractive 1\" long wisps left. (I had it shaved on day 12.) As for the Neulasta, I'm also going to be more proactive with pain meds this time around. I also had the weird abdominal cramps without accompanying diarrhea, and I'll ask about that when I see the MO tomorrow. I hope my side effects after #2 are as bearable, as I feel like I've gotten off pretty easy so far. Good luck to everyone",
      "MessageIndex": 468,
      "PostDate": "08/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 16, 2017 10:35AM lrwells50 wrote: Both of my girls started drinking carbonated water when they were in Europe, but it still tastes awful to me.",
      "MessageIndex": 497,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Nov 24, 2017 09:46PM lrwells50 wrote: notanisland, I think the decision to have any kind of mastectomy depends on so many factors. I had a much smaller tumor, but I’m 67, my mother had breast cancer twice (not a recurrence), and I wore a 44G bra. My breast surgeon didn’t recommend removing just the affected breast, because of the difficulty of making me look even due to my size. After going thru 2 MRIs and an MRI biopsy, I saw a lot of the same in my future if I opted for a lumpectomy. I decided on a BMX and reconstruction. I didn’t have any trouble with the tissue expanders, although I know a lot of people do. I had my exchange surgery 10/18, and haven’t had any trouble with that, either, although I declined the lat flap the PS wanted to do. Good luck making a difficult decision",
      "MessageIndex": 729,
      "PostDate": "24/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 7, 2017 06:04PM lrwells50 wrote: Laurieellenb, I have my second chemo Friday, and I'm just trying not to think about it too much. We live 2 hours away from Dallas, where I'm receiving my chemo, and I have a follow-up with my BS on Thursday afternoon, so we're spending the night and my whole family (minus daughter #2 that lives in Indiana,) is going to Benihanas for dinner Thursday night. Probably not a great idea to have what is due to be a lot of salt the night before, but what the heck! I've been drinking a lot of water trying to plump up my veins. The hair thing has bothered me a lot more than I thought it would. Mine started shedding a little the afternoon of day 12, and I had it shaved to 3/4' on day 13, which was pretty traumatic. Since then it's been driving me crazy hurting and shedding like crazy. By today, day 19, I'd say I have maybe 5-10% left, and it's really hard on the ego to look at, so I try not to. I've not been wearing anything on it when home, because it's been shedding and itching more when I do, but the wig hasn't been too bad today, I'm guessing because there's not much left to itch! My scalp is the color of my off white bathroom sink....really lovely. I've had it so easy as far as side effects go compared to others, that I'm dreading #2 a little, but hoping that it goes as smoothly as #1.",
      "MessageIndex": 54,
      "PostDate": "07/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 8, 2017 03:42AM lrwells50 wrote: laurieellenb, I have a good cancer center 5 minutes from my house, but the Dallas MO was my second opinion doc, and didn't want to put in a port for just four doses, and the MO here wanted me to get a port. It's no problem for my husband to drive me over and back, and I thought the port would be just one more chance to get an infection. Now if I don't have an easy time of it with chemo 2-4, I may regret it! Thanks for your thoughts and prayers",
      "MessageIndex": 56,
      "PostDate": "08/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 11, 2017 03:16AM lrwells50 wrote: laurieellenb, my Neulasta is injecting now, hoping it doesn't hurt as much as last time. I felt a little different after my infusion yesterday, but haven't been nauseated. I did take a nap this afternoon, which I never do. We'll see what tomorrow brings",
      "MessageIndex": 66,
      "PostDate": "11/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 16, 2017 03:13PM lrwells50 wrote: I think my taste problems are lessening, except the catsup thing. It has helped me eat way fewer fries. I've always looked on fries as the means to eat catsup, which I normally love. For the last two days, I've eaten Mexican food. The hot sauce even tastes good, maybe the vinegar in it overcomes the yucky tomato taste. Try squeezing some lemon in your water, LeesaD. I normally don't like that, but have been doing that this week to get more water down. My creatinine levels were off last time, and he said no ibuprofen, so I used Tylenol for the Neulasta pain, and it seems to have worked better anyway. Bone pain was much less this time. Glad you're back to normal today, laurieellenb!",
      "MessageIndex": 74,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 20, 2017 02:35AM lrwells50 wrote: BreastlessBeth, as the topmost part of our nails are layers of dead skin, it's odd that anything done to them could do anything to moisturize them. Not questioning you, but maybe the American Cancer Society. I'd think keeping the cuticles and skin around the nails would help more",
      "MessageIndex": 83,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 1, 2017 03:32AM lrwells50 wrote: JuliaJazz, I don't work full-time, and I'm an accountant that works for my husband, so if I only work 20-30 hours a week it's not an issue, especially this time of the year. Our biggest problem was in January we had to begin converting 200+ accounting clients to a new general ledger program, so everyone except me was working 60+ hours a week, and a felt guilty, then my surgery 3/9, right in the middle of tax season. Maybe after my exchange surgery things will be more normal. We are doing Christmas sans gifts with my husband's extended family in Perdido Key this year, so that's something to look forward to",
      "MessageIndex": 104,
      "PostDate": "01/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 19, 2017 01:12AM lrwells50 wrote: My last chemo is Friday. This time I've had a lot of swelling in my legs and feet, and I have absolutely no stamina, and feel kind of weak. I'm hoping some of it is the sweltering weather, but I really don't think it is.",
      "MessageIndex": 129,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 6, 2017 08:29AM lrwells50 wrote: MoodyBlues, I had the exact same cramping - nothing else, just the cramping. Very weird. I have a small hiatal (sp?) hernia, so I've had stomach issues for a while, but more like eat at least 2-3 hours before bedtime, I'm never nauseated. And I've only ever had abdominal cramps with diarrhea, but no diarrhea with these cramps. No taste changes, though, and unfortunately, hungry like usual. I have had bone and joint pain with the Neulasta, but ibuprofen took care of it except a couple of nights I took a hydrocodone at bedtime",
      "MessageIndex": 70,
      "PostDate": "06/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 10, 2017 09:24AM lrwells50 wrote: My hair started coming out on day 13, but that seems a few days earlier than most people",
      "MessageIndex": 123,
      "PostDate": "10/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 18, 2017 09:48AM lrwells50 wrote: Thailinh, we seem to have ignored you. My tumor was 1.2 cm, no node involvement, and I was also told not to worry, because I wouldn't need chemo. Unfortunately, it was also ILC, and I had an Oncotype score of 24, right in the middle of the intermediate range. Because ILC tends to hide and recur later, I am doing the chemo, and will be starting some time next week. Can say I'm looking forward to it, but I'm on Medicare and have a good supplement, so am not worried about the bills, and work from home, which I may do a lot once I've lost my hair. I know I'm too self-conscious to go bald in public. I'll need to buy my wig next week, so they can match it to my hair. At least I've worn my hair short the last 40 years, so it won't take long to grow back. I just have to hope I'm one of the lucky ones that doesn't have any permanent hair loss from the Taxotere. I'm more worried about neuropathy, but am hoping for the best there as well.",
      "MessageIndex": 246,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 18, 2017 12:30PM lrwells50 wrote: DodgersGirl, sure am glad you posted that about taking an extra shirt, because I never would have thought of it. It must not happen often, or someone here would have mentioned it, but it can't hurt to have it. msrobin58, glad you are feeling better. My hair is pretty short to start with, but I'll me shaving in a couple of weeks, I imagine. Will be buying a wig and some scarves tomorrow. I hate scarves around my neck because they get in the way, and I only have ones that will keep me warm.",
      "MessageIndex": 250,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 18, 2017 04:55PM lrwells50 wrote: I got an automated message yesterday confirming my appointment with my MO at 8:30 Friday am, and I hadn't been told I had one. Left a message for the nurse, and find out at 2:00 pm today that I start chemo tomorrow! 😳 I guess maybe it's best that I don't have too much time to think about it. We live 2 hours from the cancer center, so are going to Dallas tonight and stay over. Would like to get a good nights sleep before it starts",
      "MessageIndex": 256,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 19, 2017 12:44PM - edited May 19, 2017 12:45PM by lrwells50 Saw my doctor at 8:30, then waited an hour and a half for them to take back to chemo. Had premeds of steroids and some antinausea med, and now they've started the Taxotere. Said it should take 15 minutes, then the Cytoxin. The chair is comfy, and has a heater and vibrator",
      "MessageIndex": 267,
      "PostDate": "19/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 22, 2017 09:50AM lrwells50 wrote: Claritin doesn't seemed to have helped me, either, rdsm. Mine seems to be worse in my hips. Hopefully I can walk it out.",
      "MessageIndex": 300,
      "PostDate": "22/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 2, 2017 06:47PM - edited Jun 2, 2017 08:55PM by lrwells50 My hair started coming out a LOT on yesterday, day 13. I had already made an appointment to get my hair buzzed, but the stubble does hurt, even worse than when it was just a little longer, but it was coming out so fast I thought it would be better at about 3/4\". I guess time will tell. I wore a wig to the grocery store then to work this morning, but it did itch off and on. Sometimes I'd not even notice it, then I'd just want to take it off and scratch everywhere. Made it to about 3:00 and called it quits. Maybe once everything that's going to come out has come out, I won't have the mild pain/itching thing and the wig will be bearable. Definitely the worst side effect so far by a long shot",
      "MessageIndex": 412,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 19, 2017 02:30PM lrwells50 wrote: Hope1970, my hair follicles hurt as well until what wanted to fall out fell out. What's left (maybe 10%) isn't anchored very securely, and comes out if I tug, but it doesn't hurt any more, and it's easier to wear the wig. I sleep with a CPAP, and it was really uncomfortable when my hair hurt. I'm wondering if at day 13, like last time, the rest of my hair will come out.",
      "MessageIndex": 506,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 25, 2017 10:34AM lrwells50 wrote: Isis02, ask the PS (or maybe a different PS) about Exparel. It's a non-narcotic analgesic that they put in the wound, and lasts several days after surgery. I think it made a big difference in how much pain medication I took. There is also some sort of nerve block that my orthopedist told me to ask for, which I didn't, but probably should have at least explored. At the time he told me, I was two days away from surgery, so I didn't bring it up. That said, I'm not one of those (and not saying this is a good thing...) that doesn't want to take what pain medication is offered. I didn't see any reason to make do with ibuprofen if I had hydrocodone available which worked better. I do, however, think I COULD have made it with very little prescription pain meds if I'd had to, and I think the Exparel was one reason. I was lucky that my bed raises and lowers, making it easy to get out of bed, and my daughter came and stayed for two weeks and cooked. I wouldn't have needed her that long, but she lives in Indiana, and we don't see her often.",
      "MessageIndex": 23,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/853643",
      "Title": "BS won't send me home with pain medication Isis02 Kicks"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 15, 2017 05:48PM lrwells50 wrote: FWIW, Runor, my OnctotypeDX was 24, and I had a 16% chance of recurrence with Tamoxifen alone. It should say on your report what your recurrence percentage is with Tamoxifen on the report. I was told chemo would get my recurrence percentage down to below 10%, and maybe as low as 7%. Mine was ILC, and it's sneaky, so I took that into consideration also in deciding on chemo, and I'll also take the AI when chemo's over.",
      "MessageIndex": 145,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/829335",
      "Title": "Stage 2-recurrance percentage % risk? ThinkingPositive runor"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 23, 2017 05:36PM lrwells50 wrote: Diagnosed at 66",
      "MessageIndex": 749,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 24, 2017 08:27PM lrwells50 wrote: I've been able to work thru mine for the most part. My infusions were on Fridays, and I was at work on Monday until this last one. My feet and lower legs were very swollen this last week, so Saturday I kept my legs elevated. Sunday I slept most of the day, which was new, and I've been home today with my legs elevated, and they're nearly back to normal. I'll go in tomorrow, and stay as long as I don't have much swelling. I've got some stuff I have to get done this week, so I may have to figure out how to work with my legs elevated",
      "MessageIndex": 19,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856900",
      "Title": "Did you work through chemo? Autum1031 sweetp6217"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 10, 2017 07:25AM lrwells50 wrote: My MO just told me to not eat raw fruit and vegetables on the days my resistance is low, like days 7-10. And I don't cook much, so I've definitely been eating out. My Neulasta pod is on my stomach as well. I will say that when I looked at the EOB for the first chemo, the Neulasta pod was $14,000. I'm 2 hours away, and have Medicare and a supplement that pays everything, but if I was paying out of pocket that would be a killer. It would be interesting to know how much the shot is. Day 10 for me after TC#3. Couldn't taste salt last week, and catsup was gross again, but that seems to have gone away as of today, thank goodness. One more to go, and then exchange surgery sometime in the future",
      "MessageIndex": 477,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 19, 2017 08:36PM lrwells50 wrote: I'll let you know tomorrow, lovepugs77",
      "MessageIndex": 273,
      "PostDate": "19/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 22, 2017 12:05PM lrwells50 wrote: Nadir is the depths - the opposite of zenith. As far as yoga goes, I'd have to do chair yoga! I've gotten the treadmill out, and will walk on it. Our streets are kind of wonky, and I think I'll be better off if I'm on the treadmill. We also have a TV in that room, and I can watch all of the home remodeling shows my husband hates! If I have joint pains it tends to be in my knees, one of which I had replaced 13 years ago. I still have the pains kind of circling around all of the joints, but that's not really bad. The only one that I really notice is the hips. lovepugs77, aren't people crappy sometimes? I remember 20 years ago seeing an older man in Las Vegas at a craps table, that had on cotton gloves and a surgical mask, and I thought at the time that there probably couldn't be a more germ-filled place, but I guess on reflection, a child care facility would do it! ",
      "MessageIndex": 307,
      "PostDate": "22/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 23, 2017 10:32PM lrwells50 wrote: I have been working from about 9-4, and go home when the bone pain starts. I won't work Friday, since that's when my resistance will be low. I work for my husband, so I don't have any pressure there. Also, I can work from home if I need to",
      "MessageIndex": 334,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 25, 2017 06:00PM lrwells50 wrote: My employer is walking a fine line, because its my husband. He doesn't want me to overdo it, but if I felt like working a 48 hour week he'd be happy as a clam",
      "MessageIndex": 354,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 30, 2017 10:00PM lrwells50 wrote: NCBeachGirl, Azo Urinary Pain Relief, worth its weight in gold!",
      "MessageIndex": 390,
      "PostDate": "30/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 4, 2017 11:13AM lrwells50 wrote: Be sure and take the Claritin, because while my pain wasn't bad, it wasn't fun, either. Mostly controllable with ibuprofen",
      "MessageIndex": 420,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 6, 2017 05:54PM lrwells50 wrote: MomAngel, Don't borrow trouble, you may be one of the lucky ones. I haven't had one moment of nausea. I took a Compazine like they told me when I went to bed after the first chemo, but I didn't need it, and I haven't taken any more. I had the weird abdominal pain sans diarrhea or constipation that someone else mentioned, but it certainly was bearable, just very odd. The Neulasta pain I had I treated with ibuprofen, except two nights that I took a hydrocodone before bed. I found moving around actually hurt less than just laying in bed. The second day the tip of my tongue felt funny, and I thought maybe that was the start of a SE, but I think I'd just burned it drinking some too hot coffee, because it was gone the next day. Drink lots of water. I hadn't really paid a lot of attention to the fact that they gave me saline with my premeds AND the chemo, and everyone had been pushing me to drink a lot of water. Got up to go pee about 6 times the first night. Friday is my 2nd treatment - I hope I get off as lightly as I did after #1. Lynn",
      "MessageIndex": 448,
      "PostDate": "06/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 10, 2017 04:09PM lrwells50 wrote: Had treatment #2 yesterday, and it went about like #1, except when we got out of the elevator there was a woman sitting on the floor that nurses were monitoring, and a woman in my chemo room fainted on the way back from the bathroom. The second woman's blood pressure was 220 over something, so that explained her faint, probably, but all in all it was anxiety producing. On the way home (2 hour drive) I felt maybe a little more \"off\" than last time, but the MO didn't like my creatinine levels, so I had 500 ccs of saline, and I was obviously retaining water, so that may have been it. Still can't get one of my rings off, which is kind of scary. I'm trying to be more proactive about the pain mess before and after the Neulasta injection, but he told me no NSAIDS, so I'm stuck with Tylenol this time around. No taste changes yet, which is great, and no nausea, although I took a compazine before I went to bed, just in case. I tend to go back and forth from loose stools to constipation anyway, but I took a stool softener last night and so fa so good this morning. Maybe TC is less likely to be diarrhea producing than AC? I'm still swishing with the soda and salt solution and no mouth sores yet. Honestly, the hair thing has been the worst SE so far. I have two wig, that both look like my hair did before, so I don't think most people would know it was a wig, but I'm dreading it as the temp gets higher. Good luck to everyone fighting this",
      "MessageIndex": 474,
      "PostDate": "10/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 22, 2017 05:05PM lrwells50 wrote: I have either a small clot or scar in the vein they used for the infusion, although it's beginning to resolve. They'll have to use a different one next week. My bowels have been sort of loose this week, which is odd 11-13 days out, but lots better than constipation! If it gets worse, I'll take some Immodium. Today for the first time, I'm really retaining water in my feet and ankles, which I rarely do. I haven't been given any steroids other than what they gave me pre-chemo, and haven't eaten a lot of salty stuff in the last few days. Trying to drink lots of water. ",
      "MessageIndex": 510,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 3, 2017 09:13AM lrwells50 wrote: I've been thinking about the possibility of permanent hair loss with Taxotere (which my MO did warn me of,) and after talking to the Dallas MO again, have decided to have my treatment there, and try the Paxman Scalp Cooling system they have. Means a 2 hour drive both ways, but I'd like to give the Scalp Cooling a try. The MO said yesterday that since I was only getting 4 treatments, no Adriamycin, and my veins look good, he doesn't want me to have a port! Woo hoo! Now I have to call my local MO and tell him I'm not doing the chemo here",
      "MessageIndex": 80,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 20, 2017 01:02PM lrwells50 wrote: Same here, rdsm, first infusion yesterdau",
      "MessageIndex": 280,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 20, 2017 04:17PM lrwells50 wrote: rdsm, I thought it went very well. I'm doing my chemo at the Sammons Cancer Center at Baylor, Dallas, so it was very crowded in the waiting room, and we were about 1 1/2 hours later than our appointment. We were taken to one of many infusion rooms, and the nurse explained exactly what she was doing. It was VERY cold in the room, but the recliners were heated, and they had heated blankets ready. They gave me steroids and an anti-nausea med. Then they started the Taxotere, which they ran slowly, because it's the one you are most likely to have an allergic response to. Then she ran the Cytoxin over an hour, because she said it can cause a sinus-type headache. She said next time they would run it faster. I don't think I mentioned that I don't have a port, which is nice. The MO thought my veins were okay since I'd only have 4 treatments and no AC. They had eight treatment chairs in each chemo area, with chairs down the middle for family. Also a room with snacks like crackers and granola bars, and a fridge with ice, juices and pudding. After it was finished I went to their store and bought a wig and caps that I'll need before I go back, and we headed home, which is almost two hours away. Had a bland dinner, drank a lot of water, and took a compazine at bedtime. I hadn't given much thought to the fact that they ran saline alongside the meds, but those, plus the water I drank, caused about 6 trips to the bathroom during the night. Today I ate my normal breakfast, and more bland stuff at lunch, but I've had absolutely no nausea. I rarely do, so maybe that's why. I'm now T-2 hours until the Neulasta injection, so keeping my fingers crossed for no bone pain. Lynn ",
      "MessageIndex": 283,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 21, 2017 10:32PM lrwells50 wrote: I took some Advil, and I have some Hydrocodone, but it's not bad enough for that",
      "MessageIndex": 297,
      "PostDate": "21/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 23, 2017 12:12PM lrwells50 wrote: MsLin, have you looked into rose gauntlets for gardening? They won't be cool, but you can get them that cover almost to your shoulder. Mine are elbow length. They're leather, so not necessarily cheap, either. If the Claritin helped my bone pain, I'd hate to see what it was without it! I did read that Aleve is better for this, and we didn't have any, so I've taken some of that. It was definitely at it's worse 48 hours after the timed release. Better today, but not gone.",
      "MessageIndex": 320,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 1, 2017 04:29PM lrwells50 wrote: msrobin58, I wish I could give you my nausea meds that I haven't needed. From what I've read on these boards, TC must be less likely to cause nausea. Of course that's not to say I won't need them after chemo #2, but I think the Red Devil must really be hard on people.",
      "MessageIndex": 405,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 18, 2017 09:25PM lrwells50 wrote: I've worn gel nails for years, because mine split and peel if I dont. During my chemo info session, the NP did say no polish, so I've done that, but I don't think the chemo nurses have really looked at mine. So far my nails look normal",
      "MessageIndex": 79,
      "PostDate": "18/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 21, 2017 02:32AM lrwells50 wrote: Liblib81, what type of cancer was it? My OncotypeDx was 24, and even with 5 years of Tamoxifen, I had a 16% chance of recurrence. Chemo reduces that to 6 to 10%, so I felt I needed to do it. I was actually more worried about permanent neuropathy with Taxotere than I was about permanent hair loss, but I'm 66. By the 13th day after my first treatment, I started losing hair by the handful. I'd say I've lost 90 - 95%, but there also seems to be peach fuzz everywhere else. I'm 12 days post my second chemo, so shortly I'll see if the rest of it goes. If you'll put your diagnosis and other details in your profile, it might help us give a more informed opinion",
      "MessageIndex": 90,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 24, 2017 01:37AM lrwells50 wrote: Still have a good bit of swelling, and I've slept most of the day, which is definitely unusual for me. Since my feet didn't start swelling until the week before round 4, I hope i don't have it to look forward to again. I have been taking the Neulasta every round, and my WBC was almost at the top of the normal range Friday. I still try to not eat fresh fruit r vegetables days 7-10",
      "MessageIndex": 138,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 22, 2017 04:29AM lrwells50 wrote: Chemo #4 in the books! My MO didn't seem too concerned about the swelling in my legs and feet, and said it was the Taxotere. He said if it had been on one leg, he would have been concerned about a blood clot. Lots of sitting with my legs elevated, and cut down on salt. Stopped at the Cheesecake Factory for dinner n the way home, to enjoy one last meal before the latest weird taste side effect. Until the swelling, I had been really lucky, with no nausea, just fatigue and some weird yucky tastes that went away after a few days. We'll see what the cumulative effects are after #4 during the next couple of weeks.",
      "MessageIndex": 133,
      "PostDate": "22/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 25, 2017 02:28AM lrwells50 wrote: Did everyone on TC lose all of their hair? I still have a minute amount left that's a little over an inch lon, but just had my 4th and last infusion. I don't think I've lost much since my second infusion.",
      "MessageIndex": 140,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 25, 2017 03:18AM lrwells50 wrote: My eyebrows were pretty thick, so the losses there aren't too noticeable, and I never had very thick eyelashes to begin with, so can't tell much difference there. Still have the damn leg hair, though.",
      "MessageIndex": 142,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Aug 21, 2017 01:11PM lrwells50 wrote: suthrngrl, my MO said lasix doesn't help this swelling, and it can take 6 weeks to resolve. I'm 4 weeks PFC and my legs and ankles are better, but not normal yet. My lower legs are very tight feeling, can't wait for it to go away. I'm still lacking stamina, and am not sleeping well.",
      "MessageIndex": 159,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 2, 2017 03:07AM lrwells50 wrote: MomAngel, no nausea at all. I know everyone is different, but other than permanent hair loss and neuropathy, this was my biggest fear. I just hope the next 3 treatments go as well. My doctor gave me plenty of anti-nausea meds, I just haven't needed them",
      "MessageIndex": 29,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 10, 2017 01:50AM lrwells50 wrote: I'm on my way home from my second infusion. I told the MO about the abdominal cramps, and he told me to take probiotics. We'll see if that helps. I'm going to be more proactive on the Neulasta, but he said to lay off the ibuprofen, because he didn't like my creatinine levels, so Tylenol it is. And drink more water. I think I slacked off the water this week.",
      "MessageIndex": 64,
      "PostDate": "10/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 20, 2017 03:33PM lrwells50 wrote: Actually, my manicurist uses an autoclave, so I'm not really too worried, although she's been very careful. She actually has several clients going thru chemo currently. My memory, never very good, has been even worse, although part of that could be from the anesthesia for the BMX. My commute is only 5 minutes, so I can't complain about that. I don't really like to work at home anyway.",
      "MessageIndex": 94,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Sep 21, 2017 08:05AM lrwells50 wrote: JadeShiva, 1. i had a hysterectomy 20 years ago due to ovarian cysts. 2. 66 at time of treatment. 3. My hair has always been pretty thick, but I've been coloring the gray for so long I really didn't know how much gray I had. My hair has always been medium to light brown. 4. I'm 9 weeks PFC, and lost my hair about 13 days after the first chemo. Once I started losing it, I had my hairdresser buzz it to about 1/2\". Don't shave it, in case you have ingrown hairs when it comes back. I had a very small percentage of hair that I never lost. Mine started coming back in a couple of weeks ago, but is fine down like a newborn. It's VERY white on the top and sides, but dark in the back. It's very likely it was that gray before, but because I colored mine every 4 weeks it was hard to tell. I always hated sitting with color on my hair for thirty minutes, so will try to just leave it natural. My hair has always grown very fast, and I wear it short, so I'm guessing it will be long enough in 4 - 6 weeks to cover my scalp and ditch the wig. It's hard to tell at this point whether I have any thin or bald spots, but it doesn't look like it. I've worn a wig since I buzzed my hair, and am still wearing it. I bought scarves and hats, but am not comfortable wearing them. I'm going to a tailgate and football game in the wig Saturday, and the forecast is 93 and sunny. If it's bad enough I'll resort to the scarf. FWIW, my MO said he's only had 1 person have permanent hair loss on Taxotere, although there are several posters here that have had it. I was a lot more worried about neuropathy on Taxol, which the first MO I went to wanted to prescribe ",
      "MessageIndex": 11,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858813",
      "Title": "Questions for those who completed taxotere treatment. JadeShiva SueRobbo"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 22, 2017 04:40AM lrwells50 wrote: Also feeling joint pain, 24 hours after the Neulasta",
      "MessageIndex": 5,
      "PostDate": "22/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "May 23, 2017 11:22PM lrwells50 wrote: I guess since my taste buds are okay and I have no nausea, the Neulasta is going to kick my butt. Wasn't too bad this morning, but pretty painful now. It is kind of bouncing around from place to place. Knees the worst currently",
      "MessageIndex": 11,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 14, 2017 02:01AM lrwells50 wrote: I am 4 days post chemo #2, and am definitely having taste issues for the first time. I can't really feel cold things much, which is pretty strange, and catsup tastes bleh. Hope that's it for taste. Bone pain is much better this time. Water also tastes blah, which makes it hard to drink a lot of it",
      "MessageIndex": 71,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 3, 2017 09:05AM lrwells50 wrote: I'm having the occasional hot flash, but I can't say it's any worse than normal. I'm 3 days post 3rd TC, and this time I can't taste salt. Even the stuff they have me gargle with that has a lot of salt in it, doesn't taste salty. No bone pain from the Neulasta so far, have been diligent about taking the Aleve. Water tastes blah, what sounds good is a margarita!",
      "MessageIndex": 110,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jul 4, 2017 03:45AM lrwells50 wrote: I think the only SE I have that continues to worsen is I'm more tired each time, and have more difficulty forcing myself to get moving. Still have taste issue, they're just different this time. The one that's going to be with us for a long, long time is the hair. Luckily mine is usually only a couple of inches long anyway, so here's hoping it's long enough for me to go \"topless\" by Christmas",
      "MessageIndex": 114,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Aug 26, 2017 06:50AM lrwells50 wrote: Suthrngrl, I don't know what helps the swelling. I'm 5 weeks PFC, and strangely my feet are better, but my ankles thru my knees are still swollen. The MO said walking would help, but to put my feet up afterward. I haven't had any arm swelling that I've noticed, other than my fingers off and on, and that would happen before chemo. My legs are better when I get up in the morning, but that makes sense. Can't spend weeks in bed, though",
      "MessageIndex": 162,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Aug 19, 2017 11:49PM lrwells50 wrote: I'd be happy with six months, but I'm betting it's still very short",
      "MessageIndex": 154,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Jun 14, 2017 12:09PM lrwells50 wrote: My surgery was three months after my diagnosis, and the doctor said I needn't be in a rush about my decision.",
      "MessageIndex": 1,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856132",
      "Title": "Just Diagnosed - Surgery Timing purplestargazer purplestargazer"
    },
    {
      "AuthorID": "lrwells50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246650/profile",
      "Content": "Mar 29, 2017 02:42PM lrwells50 wrote: My only problem with the breast MRI is that there are a high number of false positives. In my case, it made the surgeon order an MRI biopsy, and it was all benign. That said, my breasts aren't dense, and it wasn't the radiologist that ordered it, it was the breast surgeon. The thought of that cycle every 6 months made me decide on BMX.",
      "MessageIndex": 7,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853766",
      "Title": "Why is Breast MRI Needed? Michele327 Michele327"
    }
  ]
}