{
  "AuthorID": "lsugirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88630/profile",
  "Posts": [
    {
      "AuthorID": "lsugirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88630/profile",
      "Content": "Sep 11, 2009 03:07PM lsugirl wrote: I'm so glad I found this topic - it really has helped me in my decision to do the bi-lateral MX.  I was dx with DCIS and even though it's not invasive, it's still pretty big I think at 3.5cm.  I guess it's a lesion and not a tumor since it's not invasive but how long before it would become invasive?  I don't want to take a chance on that so hopefully I will have my surgery in the next 3-4 weeks.  I am chosing to have the DIEP reconstruction - I know it's a hard and long procedure recovery but I just feel that it would be the best thing for my having as close to \"natural\" breasts as I can.  Has anyone else had the DIEP procedure?  Are you happy with your choice or do you wish you would have just had implants?  I still have some doubt on the DIEP vs. implant scenario mainly I don't want to look \"fake\" as I have always been a C-D cup.  I'm 40 and have no kids and most likely will never be able to.  Waiting on my BRAC test results next week but doubt it will be positive as my maternal aunt tested negative.  Thanks for your help and blessings to all of you wonderful and inspiring women!!!  Kim",
      "MessageIndex": 18,
      "PostDate": "11/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739956",
      "Title": "What made you decide . . . Mantra Mantra"
    },
    {
      "AuthorID": "lsugirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88630/profile",
      "Content": "May 3, 2012 01:31AM lsugirl wrote: Hi Ladies - I've been reading all of your posts and boy - talk about courageous and amazing - you are all \"the bomb.com\"!!    I am praying for you all!!  Another question I hope you could help me with.  My friend is at her 2nd treatment today getting the lovely cocktail of taxol and gemzar but she has to meet with a neurologist first b/c her MRI from Monday showed a lot of spots in her brain; her onc said it could be nothing or it could be tumors so that's why he's having her meet with the neuro first.  She has a \"lazy/droopy\" eye and that's why he ordered the MRI.  Could it really be \"nothing\" or if it is in her brain - how much more chemo/torture does she have to endure?  I hate to admit that she might not beat it b/c she is a fighter but I'm afraid the chemo treatments will do more harm than good and I'd rather she have quality time then sick you know??  She has a 13 y.o. son and 7 y.o. daughter so alot to think of.  I know she will do whatever her onc tells her but I'd like to have some research/info that I could at least share with her to help.  I've never lost or watched a friend die (I'm 43) so this is very hard but I want to be strong for her and her family; that's why I turn to you wonderful women - you give me strength for her b/c of your courage and all you've endured.  Thank you for your assistance, information and prayers.  God bless you all!!!",
      "MessageIndex": 265,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "lsugirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88630/profile",
      "Content": "Apr 18, 2012 05:53AM lsugirl wrote: Hi ladies - me again!  I just talked to my BFF and she said her blood counts were good today so she will have her gemzar infusion tomorrow for 30 minutes.  Her regiment this time is: Day 1 (taxol + gemzar) - 4 hours  Day 8 (gemzar only) - 30 minutes Has anyone done this combo?  I was just curious as to the side affects that might occur?  She feels really good today but she has noticed a \"drooping eye\" over the last few day.  Her dr. had her do a CT scan of her head today and now we wait to see if it shows anything that could explain the \"lazy/droopy\" eye.  Of course we hope it's a side affect but given that she has masses near her thryoid and in the C4/C5 area, the eye symptom/issue could be related to the tumors??  Any help or reference is very much appreciated.  She does not want to know more than she can handle so I am trying to help her but doing this \"behind the scenes\" research.  I want to be aware of EVERYTHING so I can help her if she needs reassurance or whatever - that's why I depend so much on this site and you brave and inspiring women!!  Thank you -",
      "MessageIndex": 198,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "lsugirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88630/profile",
      "Content": "Apr 17, 2012 02:23AM lsugirl wrote: Thank you for setting up this thread as I really am in need of positive news/encouragement for my best friend.  This is her 3rd time with cancer - unfortunately twice in the last 3 years and this time she has mets on her liver, pancrease, lung and now a large mass on her neck lymph node that is pushing on her thryoid which is pushing on her layrnx so she is having a hard time swallowing normally.  The spots they have found on her liver and pancrease are mm size but still there and the mass on her pancrease was called a \"hypermetabolic\" something - not sure what this is or means.  She was DX in January and has had 2 brief chemo treatments but they weren't responding as quickly as her oncologist wanted so now she has started a new regiment.  Last week (day 1) she did a combo of taxol with gemzar for 30 minutes of the 4 hour treatment then this week (day 8) she will do gemzar for 30 minutes only.  I believe she will be off for 14 days then start again - not sure?  She said within a few hours she had PAIN in her tumor areas - has anyone had this affect this soon?  I really am worried for her but don't want to show it or share that with her so I'm hoping that I can find some support/strength here from you brave ladies!!  My friend is not like me who surfs the internet for information - she just does what her doctor says so I'm hoping I can have some info if and when she's ready. Thank you all for any help and PRAYERS!!  I will be a 3 year survivor this summer but would gladly take this from her and carry as she has a 7 y.o. daughter and 13 y.o. son.  If you would like to PM with any info or other research, I'd appreciate it.  God bless you all! Kim",
      "MessageIndex": 189,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "lsugirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88630/profile",
      "Content": "lsugirl wrote: Hi everyone.  I am waiting on my genetic test results this week (will be 2 weeks on Thursday) and am wondering if my father having prostate cancer at 54 could be a possible link to my getting BC at 40?  My maternal grandmother had DCIS in one breast at 76 and then a more aggressive type at 81 - she died of stomach cancer at 83 but NO relation to the BC.  My maternal aunt had DCIS in both breasts at 48 and opted for a bi-lateral MX.  She tested NEGATIVE for the BRCA gene.  We have a lot of cancer on my mom's side including my mother with bladder cancer but she has not had BC.  My paternal great aunt had BC when she was 48 and died 5 years later after it spread.  Should I be worried that there is a chance I could be a carrier inheriting from my father's side?  None of my cousins on my dad's side have had BC - they are all under 50 still nor my aunt.  She is the only sister of my dad's siblings.  Anyway - just trying to understand this better and read somewhere that prostate cancer could be connected the mutation. Thanks!!  Kim Dx 8/19/2009, DCIS, 3cm, Stage 0, Grade 3, 0/3 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/740359",
      "Title": "BRCA and prostate cancer?? lsugirl lsugirl"
    },
    {
      "AuthorID": "lsugirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88630/profile",
      "Content": "Sep 14, 2009 03:09PM - edited Apr 28, 2010 05:04PM by lsugirl Hi Mutd, thanks for the response.  Yes, I did meet with the genetics counselor and looked over my \"flow chart\" of cancer - mostly on my mom's side.  My father's side was only my grandmother - lung cancer (non-smoker), her sister (my great aunt) who died of BC and my dad with prostate cancer early.  My mom said my dad has had polyps removed from colonoscopies but no colon cancer in the family - whew!!  My uncle (dad's younger brother) had testicular cancer so I just found that out after my meeting.  Anyway - I would have thought with my grandmother (maternal) having BC in both breasts and my maternal aunt having the DCIS/IDC in both her breasts I would be at a bigger risk but the genetic counselor said not really - even with my aunt testing negative.  Like you said, it could come down from my father's side so we'll see.  Hopefully it will be negative but if not then my brother will have to get tested to see if he is a carrier b/c he has 2 precious little girls (5 and 7 mos.). Regardless of the test results, I'm having a bi-lateral mastectomy b/c I don't want to live on pins and needles and testing every 6 months to only have a nervous nelly radiologist call me back for biopsies.  My MRI showed a 3.5 cm \"area of enhancement\" and a new area 6 mm that couldn't be ruled either a mammary lymph node or new malignancy in my left breast - right breast was clear....as far as we know.  3.5 cm sounds big to me and even though it's still \"in situ\" - I'm still worried I have some invasiveness they haven't found.  So the genetic test would only cause me to have my ovaries removed which I guess I could wait as long as I can so I don't go into menopause.  I am ER/PR+ by the way so hormone replacement I guess is out.  Thanks for your response and I will definitely keep you posted as this is a great way for people to hear scenarios that might be like their own - it's comforting to find support in those that are or have gone through this journey.  I'm just anxious to hear the results.....they said it might be shorter than 2 weeks so we'll see. Have a great day and all the best to you!",
      "MessageIndex": 2,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/740359",
      "Title": "BRCA and prostate cancer?? lsugirl lsugirl"
    }
  ]
}