{
  "AuthorID": "luckylegs64…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209204/profile",
  "Posts": [
    {
      "AuthorID": "luckylegs64…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209204/profile",
      "Content": "Aug 27, 2016 07:29AM luckylegs64 wrote: Hi Jiffrig, You must be in the midst of chemo now...hang in there and I\"m sorry you are having to go through all of this. My mastectomy was subcutaneous/nipple sparing in 2011. I woke up feeling like an elephant had sat on my chest all night - surgery was 7 hours. I did not have any tummy surgery as you will. However, I am a PT and I would strongly encourage you to ask your surgeon for a referral for PT as soon as you are able. I am 5 years post surgery and wish I had done more to keep my shoulder range of motion and core strength. You have the addition of the stomach surgery, so I would recommend considering this as you feel up to it! You've got a long life ahead of you, so rehab that body!! Bless you!",
      "MessageIndex": 7,
      "PostDate": "27/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847368",
      "Title": "Questions on Nipple Sparing BMX with tummy tuck Jiffrig Jiffrig"
    },
    {
      "AuthorID": "luckylegs64…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209204/profile",
      "Content": "Dec 21, 2014 06:31PM luckylegs64 wrote: Thank you for the feedback! I'm encouraged to hear your experience. My mastectomy was nipple sparing, so it's true that the general surgeon could be worried about the small amount of breast tissue remaining. I would gladly give those nipples up if they could leave the implants, if for no other reason than to keep the skin at length during radiation. I am okay with some shrinkage and not a perfect looking reconstruction. Incidentally, my PET, breast MRI are negative. The discouraging thing for me is that my RO examined me and exclaimed that she felt like I had lots of breast tissue left after my mastectomy. My Plastic surgeon is the best in town for breast cancer recon and I trust her. She assures me that my skin is tissue thin and she got as much as she could. I think a second opinion is definitely in order...",
      "MessageIndex": 7,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827122",
      "Title": "Safe to radiate the chest wall through a silicone implant? luckylegs64 texas94"
    },
    {
      "AuthorID": "luckylegs64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209204/profile",
      "Content": "luckylegs64 wrote: Hello, I underwent bilateral mastectomies with reconstruction using silicone implants in 2011 for DCIS of the left breast. I was diagnosed 3 years later ( September of 2014) with stage III c breast cancer. The cancer was found in 30/35 lymph nodes under my right arm, but otherwise scans were clean. Initially, my general surgeon said we need to radiate the chest wall on the right and therefore would need surgery to repeat the mastectomy and take down the silicone implant on the right. My plastic surgeon is questioning this as she says it is common to have radiation through silicone to treat the chest wall. I would love to think I don't have to have a repeat mastectomy! Does anyone have any experience or knowledge of this? Thanks in advance :-) The blessing of God is not what He gives us, the blessing of God is that He is with us. Dx 12/14/2010, DCIS, Left, Stage 0, 0/1 nodes, ER+ Surgery 2/22/2011 Lymph node removal: Left, Sentinel; Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left); Reconstruction (right) Dx 9/22/2014, ILC, Stage IIIC, 30/35 nodes, ER+/PR-, HER2- Surgery 10/7/2014 Lymph node removal: Right, Underarm/Axillary Chemotherapy 10/26/2014 AC + T (Taxol) Hormonal Therapy 3/23/2015 Aromasin (exemestane) Radiation Therapy 4/3/2015 Dx 6/10/2015, DCIS, Left, Stage 0, ER+ Dx 11/7/2017, Stage IV, metastasized to bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827122",
      "Title": "Safe to radiate the chest wall through a silicone implant? luckylegs64 texas94"
    },
    {
      "AuthorID": "luckylegs64…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209204/profile",
      "Content": "Dec 21, 2014 12:16PM luckylegs64 wrote: thanks a bunch, I'll check it out",
      "MessageIndex": 2,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827122",
      "Title": "Safe to radiate the chest wall through a silicone implant? luckylegs64 texas94"
    },
    {
      "AuthorID": "luckylegs64…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209204/profile",
      "Content": "Dec 21, 2014 05:44PM luckylegs64 wrote: Thank you for the feedback, I will keep asking questions of the doctors!",
      "MessageIndex": 5,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827122",
      "Title": "Safe to radiate the chest wall through a silicone implant? luckylegs64 texas94"
    }
  ]
}