{
  "AuthorID": "luckymother",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
  "Posts": [
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Feb 9, 2014 10:39AM luckymother wrote: I had a core needle biopsy in that 6 cm area and came back ADH . I have no family history of BC. MRI was clean. Doctor said that If he had to bet on she would think I do not have BC, but just in case she says and left the decision to me. I am REALLY SCARRED AND CONFUSED over this SNB.",
      "MessageIndex": 18,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817818",
      "Title": "ADH, next will have double masectomy, q is about LYMPH nodes luckymother luckymother"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Feb 9, 2014 04:48PM luckymother wrote: Dear Ballet12, We already know I have several ADH (after 5 core needle biopsy, 2 on left, 3 on right), my breasts are covered with microcalcifications and atypical cells. On top I have an extremely dense breast, I feel like a bomb about to go off.",
      "MessageIndex": 21,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817818",
      "Title": "ADH, next will have double masectomy, q is about LYMPH nodes luckymother luckymother"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Oct 8, 2014 03:36PM luckymother wrote: Hi, So sorry for the late reply. I had MRI before my surgery which came back clean. I did not let them remove any node. Because there was no reason. My biopsy came back clean, I had too much of ADH and ALH. If you want to talk to me, please let me know. Best,",
      "MessageIndex": 25,
      "PostDate": "08/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817818",
      "Title": "ADH, next will have double masectomy, q is about LYMPH nodes luckymother luckymother"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Oct 8, 2014 03:37PM luckymother wrote: Hi, So sorry for the late reply. I had MRI before my surgery which came back clean. I did not let them remove any node. Because there was no reason. My biopsy came back clean, I had too much of ADH and ALH. If you want to talk to me, please let me know. Best,",
      "MessageIndex": 26,
      "PostDate": "08/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817818",
      "Title": "ADH, next will have double masectomy, q is about LYMPH nodes luckymother luckymother"
    },
    {
      "AuthorID": "luckymother",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "luckymother wrote: Hi everyone, I really would like to hear from other ladies with a similar experience. I am completely confused/scarred now. My brief history is; I am a 48 mother of two who diagnosed with several multiple atypical ductal hyperplasia in both breasts. I have no family history. After consulting with 3 surgeons I decided to have bilateral mastectomy. 2 surgeons were for it one was against it. I have no family history. My MRI came back clean. I am having the surgery next week. The surgeon recommends that I ought to have her remove not more that 3 lymph sentinel  nodes from each side. I have read and discovered some unpleasant possible side effects of the procedure. She is not saying I must but just to be on the safe side. On my left breast the area with ADH is about 6 cm. Entire area is ADH. On the right side I have one  ADH and  2, atypical cells. Would you please share your experience of the procedure? Have you had any side affects? I do not want to end up with a life long side affect because of an unnecessary treatment All the best Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817818",
      "Title": "ADH, next will have double masectomy, q is about LYMPH nodes luckymother luckymother"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Feb 8, 2014 11:49AM luckymother wrote: Hi Farmerlucy, Are you saying that your surgeon fallowed the approach of pinklotus or some other way?  Thank you so much for sharing this information. I am going to discuss with my surgeon immediately on Monday. nalan",
      "MessageIndex": 4,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817818",
      "Title": "ADH, next will have double masectomy, q is about LYMPH nodes luckymother luckymother"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Feb 8, 2014 06:54PM luckymother wrote: Dear Sarah, In my case I have no lumps, it is all on cell level.",
      "MessageIndex": 14,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817818",
      "Title": "ADH, next will have double masectomy, q is about LYMPH nodes luckymother luckymother"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Feb 8, 2014 09:50PM luckymother wrote: I did not have excisional (surgical) biopsies on both breasts. I had onlu needle biopsy. On left breast I have an area of 6 cm, they took random 2 samples came back ADH, on right I have 3 spots, one of those spots came back ADH 2 others are jut atypical.",
      "MessageIndex": 16,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817818",
      "Title": "ADH, next will have double masectomy, q is about LYMPH nodes luckymother luckymother"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Jan 20, 2014 09:48AM luckymother wrote: Hi everyone, Anyone out there with multiple ADH? Am I glad to find you all? :-) I am a 48 year old mother. I have two kids (11 and 14). During my annual mammogram last December (2013), they found several-several microcalcifications on my both breasts. At the end, I had to have 5 core needle biopsy, 3 on right,and 2 on left (left one actually is 6 cm large area). It lasted 3 hours with one doctor and 3 nurses. I have no BC in my family. Result: All are atypical cells, on right one Atypical Ductal Hyperplasia, on left both (the entire area) ADH. I also have EXTREMELY dense breast with tons of microcalcifitions. I have seen 3 surgeons, First two strongly recommended bilateral mastectomy due to number of ADH I have, dense breast have a much higher risk of getting BC sometime, of they would do wired excisional biopsy. Third surgeon this \"non-sense\" said. She wants to an excisional biopsy on the large area on my left side and go from there.. I may already have stage 0 DCIS on left and she will figure out treatment, right breast will be monitored no additional biopsy even though I have one ADH. If everything is only ADH then I will have to see her next 5 years every 6 months and use tamoxfin. I AM COMPLETELY CONFUSED NOW. I know that I do not want to leave in fear and go through this every 6 months. I do not feel my breasts define who I am, and already pre-menopuse,. Can you please share your own experience and choice with me? All the best,",
      "MessageIndex": 288,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Jan 21, 2014 08:40PM luckymother wrote: Thank you momcat. I was hoping to find other ladies in my situation but no luck (it is actually good :-). I have not see anyone with multiple ADH at the same time. I will probably go with BMX, and let you know my final desicion. All the best,",
      "MessageIndex": 290,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "luckymother wrote: Hi everyone, Am I glad to find you all? :-) I am a 48 year old mother. I have two kids (11 and 14). During my annual mammogram last December (2013), they found several-several microcalcifications on my both breasts. At the end, I had to have 5 core needle biopsy, 3 on right,and 2 on left (left one actually is 6 cm large area). It lasted 3 hours with one doctor and 3 nurses. I have no BC in my family. Result: All are atypical cells, on right one Atypical Ductal Hyperplasia, on left both (the entire area) ADH. I also have EXTREMELY dense breast with tons of microcalcifitions. I have seen 3 surgeons, First two strongly recommended bilateral mastectomy due to number of ADH I have, dense breast have a much higher risk of getting BC sometime, of they would do wired excisional biopsy. Third surgeon this  \"non-sense\" said. She wants to an excisional biopsy on the large area on my left side and go from there..  I may already have stage 0 DCIS on left and she will figure out treatment, right breast will be monitored no additional biopsy even though I have one ADH. If everything is only ADH then I will have to see her next 5 years every 6 months and use tamoxfin. I AM COMPLETELY CONFUSED NOW. I know that I do not  want to leave in fear and go through  this  every 6 months. I do not feel my breasts define who I am, and already pre-menopuse,. Can you please share your own experience and choice with me? All the best, Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817105",
      "Title": "Atypical Dectual Hyperplasia (5)in both breasts extremly dense luckymother sunnyat12"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Feb 8, 2014 01:52PM luckymother wrote: Hi everyone, I really would like to hear from other ladies with a similar experience. I am completely confused/scarred now. My brief history is; I am a 48 mother of two who diagnosed with several multiple atypical ductal hyperplasia in both breasts. I have no family history. After consulting with 3 surgeons I decided to have bilateral mastectomy. 2 surgeons were for it one was against it. I have no family history. My MRI came back clean. I am having the surgery next week. The surgeon recommends that I ought to have her remove not more that 3 lymph sentinel nodes from each side. I have read and discovered some unpleasant possible side effects of the procedure. She is not saying I must but just to be on the safe side. On my left breast the area with ADH is about 6 cm. Entire area is ADH. On the right side I have one ADH and 2, atypical cells. Would you please share your experience of the procedure? Have you had any side affects? I do not want to end up with a life long side affect because of an unnecessary treatment All the best",
      "MessageIndex": 297,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Mar 28, 2014 08:06PM luckymother wrote: Hi Ladies, I did IT :-), last week, on March 19th, I had my surgery (double mastectomy)  along with free tram reconstruction, so far I am okay. My biopsy came back cancer free. I am completely aware that I choose the most drastic solution for my situation (multiple ADH and atypical cells in both breast, extremely dense) but knowing that I will have one less worry seems worth it.  I wish everyone the best in their choice of treatment and HEALTH,",
      "MessageIndex": 351,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "May 3, 2014 09:57PM luckymother wrote: Hi Collen, I never heard of that. My initial mammogram showed several  microcalifications and I had 5 biopsies on the same day (result was tons of ADH on both breasts), then saw the surgeon had MRI couple of days later then in March, over 6 weeks ago, I had my double mastectomy and reconstruction. During this journey my cycle was never mentioned. I am 48 by the way.  My MRI was clean, biopsy after the surgery came back clean as well. The urgeon did not remove any lymph nodes, my reconstruction was free tram, PS removed fat my my tummy. If you want to talk further please let me know. Best",
      "MessageIndex": 363,
      "PostDate": "03/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Feb 9, 2014 08:53PM luckymother wrote: My BS said that that's my choice. She does not think I have BC, however, she says :\"I ought to\". I will have to have on my both arms not one. Everyone I talked to has told me that I can not use my arms for blood pressure, and blood drawn. My BS did not explain to me this, I kind of pulled out of her mouth. How many they took from you? Can you get you blood pressure and blood work done? Best, nalan",
      "MessageIndex": 299,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Mar 11, 2014 09:15PM - edited Mar 12, 2014 01:18AM by luckymother I have diagnosed back in December of 2013 with multiple ADH on both breasts and decided to have a double mastectomy (no family history, MRI came back clean, 48 yrs.) and feeling pretty good about my decision.My surgery is next week on March 19th., I decided not to get any lymph nodes removed.  Reconstruction will be done at the same time. the surgeon is going to use my stomach fat..  I do not want to deal with medication next 5 to 10 years, fallow ups every 6 months about 5 years so on.   That's my story. Good luck to you.",
      "MessageIndex": 330,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Mar 31, 2014 10:09PM luckymother wrote: Thank you Jerupe, I am in complete peace, my biopsy report found very large area, about 6cm, ADH, microcalcifications, dense breast, fibrosistic  breast, atypical cells on left, and on my right in addition to all those I also had ALH.  They did not remove any lymph node, and my recovery is great, my breasts look natural (free tram style, fat was put from my stomach).  Wish everyone the best,",
      "MessageIndex": 354,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Jan 21, 2014 10:15PM luckymother wrote: Cinvee, I read your other posting, thank you.  I also have FEA in my both breasts, That's why first 2 surgeons and the radiologist who ordered my 5 biopsies think that I am destiny to develop BC.  Wish you the best,",
      "MessageIndex": 292,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Apr 15, 2014 07:36PM luckymother wrote: Hi Renee, I just sent you a private message. Please give me a call. Yes, I am completely happy/relief of my decision. My reconstruction was free tramp and VERY successful, as time goes by, clearly some manor cosmetic issues are appearing and my PS told me that after 2 months he will correct everything in office surgery.  Before the surgery my initial needle biopsy indicated that I had ADH on both breasts, however, after surgery biopsy came back AHD on left ALH on right, and TONS of atypical cells. Let's talk, feel free to call me.",
      "MessageIndex": 360,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Jan 21, 2014 05:41PM luckymother wrote: Hi, I have tons of microcalcifications. I had 5 biopsies on both breasts last December (2 on left, 3 on right). They all came back + for atypical and 3 atypical ductal hyperplasia. I have no BC in my family. I had seen 3 surgeons, 2 recommended masectomy and 1 recommended excisional biopsy on left and watch right closely. On left the area I have is about 6 cm., so they are pretty suspicious  that I may have stage 0 inductal cancer. Anyway, I have been thinking about my options, and leaning towards more completely removal. I do not want to live my life with fear, tamoxfin, more biopsy, radiation. That's my story. I am glad to hear that your wife's is much better prognoses. All the best,",
      "MessageIndex": 7,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816923",
      "Title": "Cluster of microcalcifications rajchat rajchat"
    },
    {
      "AuthorID": "luckymother…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194818/profile",
      "Content": "Jan 22, 2014 12:00PM luckymother wrote: What have you been doing last 3 years?",
      "MessageIndex": 295,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    }
  ]
}