{
  "AuthorID": "luckypupof2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214154/profile",
  "Posts": [
    {
      "AuthorID": "luckypupof2…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214154/profile",
      "Content": "May 19, 2015 09:46PM luckypupof2 wrote: I'm late to this post but that's the exact bra I got and I concur......perfect!! And comfortable.",
      "MessageIndex": 2,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829203",
      "Title": "Great Bra for after biopsy! Wrinklequeen momto3sons"
    },
    {
      "AuthorID": "luckypupof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214154/profile",
      "Content": "luckypupof2 wrote: I had my excisional biopsy yesterday. I feel pretty good today, a little soreness but bearable. One strange thing though, I'm walking around my house today and as I'm walking I'm hearing a noise, sounded like water in a bottle or like that. Kept hearing it, thought maybe it was my stomach and I was hungry. Then I realized it was coming from my right breast. Talk about something weird, I go up to my husband and ask which ear he could hear better from then I shake my boob in his ear! LOL He could hear it too! Should I call my dr. and at least alert her to it? Thanks!!!   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/831645",
      "Title": "Seroma luckypupof2 Jerseygirl927"
    },
    {
      "AuthorID": "luckypupof2…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214154/profile",
      "Content": "May 19, 2015 08:20PM luckypupof2 wrote: Well, I'm not sure that is what it is.....you know the good ol' internet and reading too much. It sounds as though it might be that. It doesn't seem inflamed, it's not overly sore, warm or red. I'm going to wait till tomorrow and call my dr. But I could seriously hear it when I was walking. I thought I was going crazy. LOL Thanks so much Artsee and Kicks for your replies.",
      "MessageIndex": 3,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/831645",
      "Title": "Seroma luckypupof2 Jerseygirl927"
    },
    {
      "AuthorID": "luckypupof2…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214154/profile",
      "Content": "May 20, 2015 05:20PM luckypupof2 wrote: Oh Artsee, I hope I didn't offend you. It's just the way I deal with things. I've been thru many, many trials in my life like everyone else. I've lost a son, dealt with a high risk pregnancy, premature births, infertility, job losses, life on welfare, no insurance, my husbands strokes and other health issues and hospitalizations, deep depression, bankruptcy, caring for ill parents and relatives, caring for a mother-in-law who lived with us until she died and her care was in my hands alone and many other issues. Over time I've learned I've got to laugh to stay sane. Laughter is the best medicine and keeps me linked to reality. I haven't been diagnosed and the waiting is driving me nuts, but I refuse to let it take any more days away from me than I already wasted worrying about other things in my life I couldn't control. My thoughts and prayers are with you.",
      "MessageIndex": 7,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/831645",
      "Title": "Seroma luckypupof2 Jerseygirl927"
    },
    {
      "AuthorID": "luckypupof2…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214154/profile",
      "Content": "May 19, 2015 08:40PM luckypupof2 wrote: Thanks!! I felt like I had a water balloon in my bra!! I think it will be fine, but I will mention it to the dr. Sometimes you have to laugh at things to keep yourself sane. Good luck to you! Thanks.",
      "MessageIndex": 5,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/831645",
      "Title": "Seroma luckypupof2 Jerseygirl927"
    }
  ]
}