{
  "AuthorID": "luckeme",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
  "Posts": [
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Aug 6, 2010 04:13PM luckeme wrote: Hi Everyone, I had my last zap on July 21, my skin was great throughout treatment.  It definitely started looking worse a few days after, but still felt okay.  About a week after, I noticed some spotting on my camisole along the scar line as the peeling began.  It wasn't milky like pus, but it was like a blister had popped.  I had more each day until this past Monday when I went in to have the nurse take a look.  She said it was normal, but I was wearing really lightweight poofy-boobies in my camisole to fill out my shirts, and she said the friction from those was irritating the scar line - my last 5 rads were concentrated on the scar so it got fried a lot more.  She gave me some \"bandaids\" called Mepilex, they are spongy and stick on your chest but don't irritate.  They have been a nice protective layer for my scar line skin to heal underneath.  I ditched the poofy boobies and have come to work flat chested (rufffly, flowery shirts are great camoflage!).  Every morning in the shower, I let the Mepilex get soaked with water and it comes off gently so it doesn't pull on the peeling skin, then I put a new one on.  My skin is looking better every day, but here I am over 2 weeks past my last rad.  I thought it would look a ton better by now, but the doctor said it is really looking great for having 33 zaps.  Remember, if you had a mastectomy, your nerves were cut and may not be signalling pain to you so you really have to pay attention to how your skin looks, not just how it feels.  I can't even feel hot and cold there, so I really have to be careful in the shower and remember that this is burned skin that shouldn't have any more heat on it for awhile. I hope this is helpful, at least maybe you can all be ready for it.  I didn't know it would get worse, and it would have been nice to be prepared for it, but it is all manageable. Have a great weekend! Jennifer",
      "MessageIndex": 222,
      "PostDate": "06/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Jul 26, 2010 06:51PM luckeme wrote: Snuz, I feel foggy in the head, too - I also think it is from everything we've been through up to now. I am sure it will clear up.  Some people say they can feel their chemo working, too - I thought I did.  I never felt the radiation as it was happening, but felt a little warm afterwards.  Since I went at the same time every day, I made friends with the 3 ladies in the time slots around mine.  I hope you find similar support - we are all in this together. Even in your first couple of weeks of radiation, you may not see much skin change, but use the stuff your doctor tells you to use on your skin.  I used my aloe vera and emu oil from the very beginning instead of waiting for the pink to show and my skin did really well.   Before you know it, radiation will be behind you!  good luck! Jennifer",
      "MessageIndex": 136,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Jul 26, 2010 05:15PM luckeme wrote: Hi Kim, My name is Jennifer and I just finished my rads last week -  28 \"full\" sessions followed by 5 that focused on the mastectomy scar.  I used Aloe Vera gel a lot. I put it on 2-3 times a day.  They also gave me Emu Oil, which sounds gross, but I smeared it on at night and slept in an old tee-shirt because it is greasy and may not come out completely in the wash.   I started getting a rash about 5 weeks into it, and some small blisters around session #30, but I pushed through and finished.  I don't know if anyone else has already discussed Emu Oil, but it may be what helped me the most.  When the rash showed up, I also put some Emu oil on in the morning after my shower and just wore a cheap tank top to protect my clothes. I finished last Weds. and my skin is just starting to peel and look better.  Are you the one who asked about deodorant also?  I was told not to use any, and especially no body product with aluminum - most deodorants have that as the main active ingredient. I am not an expert, this is just what they told me to avoid.  This is my first post but I wish I had been involved here through chemo and surgery, too. I hope it all goes well for you, Jennifer",
      "MessageIndex": 134,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Aug 7, 2010 10:23AM luckeme wrote: Kim,  this foggy feeling has to be normal, I hear so many women talk about it.  I don't know how much of it is from radiation, or if it is a cumulative thing - I feel like it has been medical overload on my brain keeping track of what to do, what to expect, appointments, etc.  I sure miss last summer when I was golfing, shopping, and enjoying the sunshine - but this is just a bump in the road.  Hindimetfan, we also had a neighborhood party to celebrate, and I felt funny, too.  I don't know when I will ever feel like it is really behind me, but it will get better. I am at a clinic that has a counselor and a nutritionist on staff.  Some of you probably have the same anxiety I have about what to eat and what not to eat to keep cancer from coming back.  So many people tell me to avoid sugars and soy, and there is an entire discussion group on estrogen in cosmetics and body products, it is making me paranoid.  I will look forward to having the nutritionist from the cancer clinic give me some pointers because she deals with cancer patients every day and hopefully understands our frame of mind.  I seem to worry more about skin spots on the rest of my body and less about the radiation zone, because at least I know the radiation is causing that.  But lately every pimple and freckle has me googling \"skin cancer\".  Probably just more after-cancer paranoia, I'll just go to a dermatologist to get it all looked at and get peace of mind, but I wish my clinic had a dermatologist on staff, I bet I'm not the only one who worries about this. I am sure our fog will lift, too  Enjoy the weekend! Jennifer",
      "MessageIndex": 230,
      "PostDate": "07/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Aug 23, 2010 01:58PM luckeme wrote: Happy Monday! Patty, I got my breast binder tube tops at a shop here in Spokane, WA called The Essential Woman.  I don't know where they get them from, but they have a website and you could order or call them, they are super helpful. I have a question for everyone who says they are having armpit sensitivity issues, when did that come on after surgery?  I had my double mx surgery in April and am still completely numb in both armpits, but especially the left side where I had over 20 lymph nodes taken, too.  I am worried now that anything I buy now is going to bug me in a few months.  I love to shop, but don't love bra, jean or swimsuit shopping either, so I would be disappointed to have to replace my new Coobies - at least the Ebay ones are cheap.  I don't love low or loose armpits because I don't want to give anyone a scar peep show.  I have a sewing machine in my basement that hasn't even been used - my last experience was also 8th grade - but the way all of my clothes fit differently now has tempted me to break it out of the box and see what I can do with it.  You ladies have inspired me, and now I can check out YouTube for help - I had no idea! I know shoes aren't really the thread we are on, but I love shoe shopping and I also have very high arches and suffered from plantar fasciitis a few years ago and the Josef Seibel brand has become a favorite of mine for comfort shoes, even their flip flops are comfy, but their clog and slip on styles were all I would wear around the house and on weekends.  Unfortunately they don't look the part for my office wear - I wear a lot of Sofft brand shoes at work.  I should be getting my Coobies and my foobies this week - I am so excited!!! Jennifer",
      "MessageIndex": 61,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/755767",
      "Title": "New Bra jbau Aug242007"
    },
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Sep 10, 2010 09:59PM luckeme wrote: JanetinVirginia - yes that is the same binder, and I thought it was cute, too.  I got one in pink and one in light blue so I would always have a clean one on, I just had to do a small load of laundry each day, but since you aren't supposed to lift anything heavy after surgery a small load is perfect. Isn't it crazy how many of us plan our annual appointments around our birthday - I guess it is easier for us to remember that way, but boy can it ever change up your celebration.  A year from now, you won't believe how fast it actually all went.  I remember thinking 8 rounds of chemo 3 weeks apart, followed by surgery, followed by 6 1/2 weeks of radiation all sounded like an eternity, and yet here I am hardly believing how quickly it all passed by.  My advice, read up on the potential side effects of each treatment so you are prepared for them to happen, but don't sit around waiting for them to happen or dreading them because your mind is a powerful thing.  Not to say if you suffer from side effects it is all in your head, but for me, being prepared made it all less scary for me - sounds like you are off to a good start getting ready for surgery.  Good luck to you.  I will be thinking of you at the end of the month. Jennifer",
      "MessageIndex": 79,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/755767",
      "Title": "New Bra jbau Aug242007"
    },
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Sep 10, 2010 03:55PM luckeme wrote: My surgeon did not provide the binding garment, the hospital gave me a big Ace bandage, but it had to be wrapped around and around, not easy right after surgery especially without help.  I got my tube tops at a local shop called The Essential Woman, in Spokane WA.  They do have a website, but I bet you could find them closer to you.  I looked for those on the TLC website, but they didn't have them - and when I googled breast binders, it brought up a lot of things for tomboys or transgender and I decided not to look there.  See what your surgeon says and whet they may have to offer.  I would think it wouldn't be too bad if you are small chested.  The TLCdirect.org does carry the microbead foobies under \"mastectomy products\" then \"non-silicone lightweight breast forms\". I see you were diagnosed on Sept 1st, my birthday.  I got the call about my abnormal mammogram on Sept. 1, 2009 - a birthday I will never forget.   Starting a web page on Caring Bridge.org saved my sanity! Good luck, let me know if I can help any more. Jennifer",
      "MessageIndex": 76,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/755767",
      "Title": "New Bra jbau Aug242007"
    },
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Sep 10, 2010 03:23PM luckeme wrote: To JanetinVirginia, I didn't wear a compression bra after surgery (double mx), but I absolutely did wear a \"binding garment\" which is like an elastic tube top that velcros on.  This was better for me than wrapping an ace bandage around and around since it went on with one shwoop.  I had my husband help velcro it in the back which was the most comfortable, but when he wasn't available, I just velcroed it in the front.  This garment kept the fluid from building up in one place and I think that had a lot to do with me getting my tubes out pretty quickly.  I don't know if you hare having a single or double, if it is a single mx, I don't know if the tube top would be as comfortable on your \"keeper\" breast.  Once my tubes were out, I stopped wearing the binder. I also highly recommend the camisoles with the kangaroo pockets for holding your drain tubes.  I got two of them so I always had a clean one.  I got mine locally but they are available at a better price online - I think at TLCdirect.org - still a lot of money for a camisole, but in my opinion money well spent unless you can sew pockets onto cheaper camis yourself.  They do come with a lightweight breast form, but the forms that came with mine didn't have a realistic shape - they were okay but not a long term solution. I haven't posted since I got my Coobie Bras and my microbead foobies, but I absolutely love both of them.  For me, the Coobie is super comfortable, but my armpits are still numb so I don't feel any discomfort there that some other women have posted about.  I got the original Coobie, but am also considering the Ebay knock offs for variety.  I got the microbead breasts in size 5 (about a B-C Cup) and I think they look great in the Coobie.  I like them so much that I am actually considering not having reconstruction.  These are so lightweight I don't even know I have them in, and my husband and daughter both think they look very realistic. It could be different in a different bra or in a different size, but these work great for me. Hope this helps, Jennifer",
      "MessageIndex": 74,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/755767",
      "Title": "New Bra jbau Aug242007"
    },
    {
      "AuthorID": "luckeme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105797/profile",
      "Content": "Aug 18, 2010 06:56PM luckeme wrote: I have been getting ready to shop for new bras since I had my bilateral mx in April and just finished radiation last month.  I am definitely going to order the Coobies based on all of the reviews.  I had to crack up though when I went to the website to check them out - those models have huge boobs!!! I am going to take all of your words for it that they will fit us girls with smaller foobies - mine are about a B cup.  I also appreciate the tips on the microbead foobies from TLC, I don't have those, I have some others that came with a camisole that I call my poofy boobies because they are light like cotton balls, but they don't have a very realistic shape. Patty, good to hear you are preparing before surgery.  I was so glad that I did some of that shopping ahead of time.  I recommend, if you haven't already, that you get 2 of the camisoles that have a kangaroo pocket inside for the drain tubes.  I always had one on and one in the wash, but it was so great to have those for the drain tubes.  2 of my drains stayed in for 2 weeks but the other 2 stayed in for 5 weeks.  I bought my camisoles at a local boutique for $72 ea. but now I see they are available at the TLC website for $45 ea.  Still, they were worth every penny to me for how they kept the tubes contained.  I also bought 2 tube tops/breast binders to help cover my dressings and compress the area, and I don't know what I would have done without those either - plus they were cuter than Ace bandages so I felt pretty feminine for a girl without boobs! Because of radiation, I am not a candidate for reconstruction until next May, but I am glad to have this time to think about it anyway.  I love reading all of the comments from other people like me so I can weigh those opnions along with my own feelings and come up with a plan that feels right. Thanks for all of the tips! Jennifer ",
      "MessageIndex": 44,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/755767",
      "Title": "New Bra jbau Aug242007"
    }
  ]
}