{
  "AuthorID": "lucky32",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3258/profile",
  "Posts": [
    {
      "AuthorID": "lucky32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3258/profile",
      "Content": "Apr 8, 2008 01:19PM lucky32 wrote: Hi, Mary, I'm like you. The whole anesthesia part of surgery is what scares me the most. I had a lot of surgeries in childhood and early adulthood, but anesthesia has come a really long way since then. My last surgery (that I had to be knocked out for) was a laparoscopic oophorectomy 4 years ago. It was like night and day, compared to all the earlier ones. So much better. This was my experience: I refused pre-op Valium. Although I'd been extremely nervous leading up to the surgery, I was doing fine that day. After I said I didn't want it, the anesthesiologist said that I would probably wake up better if I didn't have it. That sealed the deal for me. (However, if you need it, take it! This would be something to discuss with your doctor.) I hate having that thing put over my face, so they said they'd put it on my chest for a few seconds first. That way, I'd be breathing in some of the knockout gas, just enough to make me sort of woozy. It worked! I do remember them putting it over my face, but by then I didn't care. And it only lasted for a second or two before I was out. Wakeup was not bad at all. (This had always been the hardest part for me, too.) I remember every detail of it. I woke up in recovery; they were calling my name and telling me it was time to wake up. I was still sleepy and didn't really want my nap interrupted, but no such luck! You will probably have a nurse monitoring just you for a while after you wake up. I did get the shakes, which they said was not unusual for people coming out of anesthesia. They gave me some Demerol in my IV and that took care of it. I had to wait in recovery a long time because the lady in the room I was supposed to go to would not go home. I still can't understand that! Eventually they gave up and sent me to a room on the orthopedic floor. My husband was thrilled because my room had a view of the helicopter hangar, and guess what. . .there was an ACTUAL HELICOPTER in it at the time! I guess it doesn't take much to make 'em happy sometimes, does it? They let my husband come back to see me in recovery, but I forgot to ask him to leave my glasses with me. Later, one of the nurses was showing pictures of her honeymoon, and they asked if I wanted to see them. I said I'd love to, but not a chance without my glasses. It's funny the things you remember. I tend to get nauseated, so I told them that and they must have given me something wonderful, because I never had any problem with that at all. The grogginess wore off almost completely about 4 hours after I woke up. The worst of it was gone in about 2 hours, probably. I am considering bilateral mastectomy for LCIS, so will probably be seeing you girls in this forum some more. Mary, I hope you will have a good experience with your surgery. It really is so very much better than it used to be. When the anesthesiologist comes to talk to you, be sure to tell him/her all of your concerns. They have so many ways to make you comfortable. I wish you the best.",
      "MessageIndex": 25,
      "PostDate": "08/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703502",
      "Title": "Waking up after Surgery maryjaneFL SandyinSoCal"
    },
    {
      "AuthorID": "lucky32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3258/profile",
      "Content": "Apr 9, 2008 03:04AM lucky32 wrote: Hello, trumum, and welcome. This is a great site with lots of knowledgeable and supportive ladies. Like you, I have LCIS. I'm in a research study which monitors cellular changes. The results from my last few tests have not been good, so my oncologist has referred me to a breast surgeon to talk about bilateral mastectomy. If I decide to do it, I will not be at all surprised if DCIS shows up when pathology gets the tissue. There are just too many cells behaving badly in there. I think it is quite normal for us to feel sad about losing our breasts. This isn't a hangnail, for goodness' sake! My husband is saying the same thing yours is, and I believe him, but it is still an extremely difficult thing. Because I do not want reconstruction, I have found the site breastfree.org to be very helpful. My husband has agreed to look at some \"after\" pictures on the site with me, but said that it would be hard for him. I am not pushing it. We have some time and I don't want to rush him. (I've already looked at them.) Since I don't have DCIS, I am not sure of all the treatment options for it. I believe that mastectomy is standard, but it certainly wouldn't hurt for you to get another opinion. We all need to be as comfortable as possible with our decisions. There is a DCIS board on this site, so you might want to look there as well. I wish you the very best.",
      "MessageIndex": 7,
      "PostDate": "09/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703581",
      "Title": "MASTECTOMY FOR DCIS thetrumumshow Noni"
    }
  ]
}