{
  "AuthorID": "lucylou",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
  "Posts": [
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 22, 2010 12:50AM lucylou wrote: Wishing all the gals this week the best. And sending you all blessings and of course BIG (((HUGS)))",
      "MessageIndex": 316,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 28, 2010 03:56PM lucylou wrote: Hi just wanted to say I wish all you ladies the best of luck and (((((HUGS))))) all around. I'm sure you will do great. Before surgery is hard with all the waiting. Much better on the other side. I just wanted you all to know that i will be thinking of each and everyone of you. Lucy",
      "MessageIndex": 451,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "May 31, 2010 08:29PM lucylou wrote: MistyJ, I also have LCIS and I know what you mean by never wanting to face invasive BC. I say take them off and lower the risk. I'm not one of those people that can go through all of the testing every 6 months. I would die from the stress of all of that. Not that facing BMX is not stressful. In 2 days from now my breast will be gone. It at times is so hard to think of my breasts not be there. And then at other times i think of all of the fear and stress i have gone through over the years and think it will be a relief to know that i have done all i can do. This website has meant so much to me and helped me through some really dark hours. Love and strength to all of my gals in there fight. Lets kick it.",
      "MessageIndex": 63,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jul 11, 2010 11:56AM lucylou wrote: Hi Everyone, Hope all is going well for all of you. I'm going to th BS on Tuesday for my 6 week check up. I cannot believe how fast it has gone by. I'm looking forward to getting my RX for my mastectomy bra's and foobs. I have not liked wearing  the starter cami. I'm to hot blooded for that thing. I told my DH the other day. I cannot believe I don't miss my boobs. I would never have thought I would have said that. But it's true. I have alot more piece of mind now. I hope all of us have alot more piece of mind. For those of you that did recon. I hope you are all healing nicely. I just want to say that you all have meant alot to me. I don't post much but know that you are all in my thoughts and prayers. Take Care Lucy",
      "MessageIndex": 666,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "May 30, 2010 06:35PM lucylou wrote: I'm having a BMX June 2. Starting to feel really uptight about it. I'm not doing any recon for now. I just need to get past this part for now. My surgery time is 1:00 PM I hope they call and move it up. I hate the thought of waiting all morning. I think I might jump out of my skin. One minute i'm fine, the next i'm just about to lose it. Hope all goes well for all of you.",
      "MessageIndex": 51,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 10, 2010 07:39PM lucylou wrote: JSMILEY Just wanted to say I will thinking of you and praying for you. Know that you are doing the right thing, the surgery is not bad at all. Lets us know when you can how you are doing. BIGS HUGS COMING YOUR WAY Lucy",
      "MessageIndex": 174,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 1, 2010 10:29PM lucylou wrote: Well it's the day before surgery and what a day it has been. I work part time for walmart and they fired me today. I have worked there for over 3 yrs. They said I didnot have enough hrs for a leave of absence. All I wanted was a few weeks off no pay. Well I guess I will get that and alot more. I should be getting pack to go to the hospital but I can't seem to get it together today. Really feeling very scared right now.",
      "MessageIndex": 77,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Dec 11, 2011 11:23PM lucylou wrote: It has been a very long time since i was last here. But hope that all of you June 2010 gals are doing well. And I just wanted to wish you all a Merry Christmas and a Happy New Year!!!!!",
      "MessageIndex": 1479,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 21, 2010 03:19AM lucylou wrote: Hi sounds like everyone is coming along pretty well, I think of all of you often. For those ofyou that have your drains out. Do you get fulid build up? And does anyone know how long this goes on. I have been trying to wear my after surgery cami, but sometimes it seems to be uncomfortable. Just wondering how long until this fluid keeps coming. Take Care Lucy",
      "MessageIndex": 299,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 9, 2010 08:04AM lucylou wrote: Hi everyone, Recovery is going pretty good. Have not had any pain meds since last friday night. I went to my BS on 'Tuesday. My path. came back with no new surprizes so I was so happy about that. He said I should be able to get my drains out on Thursday. I will be glaf to get rid of those. JSMILEY I hope your surgery goes well. And I will be thinking of you. Cry if you need to cry or freak out or whatever you need to do to get through this we all get through things differently. Just know on the other side will be much better than the waiting side. I will keep you in my thoughts and prayer.  About the sex thing I wanted to before surgery, it was bitter sweet. But I wanted to try and remember what normal felt like, before i find my new normal. And i will find it. Thinking and prayer for all of you. Lucy",
      "MessageIndex": 151,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 29, 2010 04:46PM lucylou wrote: Dear Jeanne, Sorry you are feeling down. It does sound like you have had a very hard year. It took about 3 weeks after my surgery until I felt more like myself. Don't be to hard on yourself. Sounds like you have some good family and friends. I'm sure they don't mind helping you out. I know its hard to keep asking for help. But just remember that if they ever need help you will be there to help them. I hope your doctors appt. go well. I can't remember if you had reconstruction or not, if you did it just may take alittle longer to get back into the swing of things. Don't give up just keep moving forward, even If its little steps at a time. I live in Van Wert Ohio, so thats only 1 1/2 hrs from you. Maybe someday we could meet halfway and have lunch or something? Take Care Lucy",
      "MessageIndex": 477,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 30, 2010 02:25AM lucylou wrote: Dear Laurie, Sending you  best wishes and big ((((((HUGS)))))) your going to do great. Lucy",
      "MessageIndex": 488,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jun 21, 2010 06:29AM lucylou wrote: 47, Stage 0 LCIS I chose PBX,",
      "MessageIndex": 507,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Dec 7, 2010 09:18PM lucylou wrote: Very saddened by her passing. What a great woman and mother and friend. She will be missed greatly. Her couarage always amazed me.",
      "MessageIndex": 102,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761600",
      "Title": "Elizabeth Edwards jleigh Lowrider54"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "lucylou wrote: I'm trying to decide on reconstruction or not. Leaning more on the not side. But I was hoping that some of you ladies ould share some of your thoughts on why you decided to opt out of reconstruction. I have LCIS and need to make my decision soon. Any and all thoughts would be nice. Thank you. Dx 2/25/2010, LCIS, <1cm, Stage 0 Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/752236",
      "Title": "What made you decide not to recon lucylou 3jaysmom"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "May 7, 2010 08:28AM lucylou wrote: Thank you to all of you gals that gave me your thought and opinions. The reason I say i need to decide is that i hope to be getting a job as a bus driver this next school year. And I would like to have this surgery before then and hopefully healed by the time the next school year starts. I just really want to move on with my life. I have been thinking of all most nothing else. I seem to be stuck. I no what i need to do, but am having a hard time making the final decision. Thank you all so much again. I have gained so much hope from this website.",
      "MessageIndex": 9,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/752236",
      "Title": "What made you decide not to recon lucylou 3jaysmom"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "lucylou wrote: Hi, I had a double mx in June. On my right side i can feel a little round ball about the size of a pea. I can roll it across my chest. It goes up and down. Any ideas what this could be. It is really odd that it rolls all over the place. I did not have reconstuction. But the surgeon did a skin sparing mx. Any input would be welcome. Thanks Lucy Dx 2/25/2010, LCIS, <1cm, Stage 0 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/757697",
      "Title": "little round ball lucylou lucylou"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "lucylou wrote: I'm trying to decide on reconstruction or not. Leaning more on the not side. But I was hoping that some of you ladies ould share some of your thoughts on why you decided to opt out of reconstruction. I have LCIS and need to make my decision soon. Any and all thoughts would be nice. Thank you. Dx 2/25/2010, LCIS, <1cm, Stage 0 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/752236",
      "Title": "What made you decide not to recon lucylou 3jaysmom"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "May 22, 2010 09:49AM lucylou wrote: Just wanted to say thanks again, to all that gave me your thoughts on this subject. I made my decsion not to reconstruct. My PBM will be on June the 2nd. It's at 1:00PM I was hoping for an early morning surgery. I don't like the thought of waiting around half a day to go into surgery. I hope they give me some good mellow me out drugs when I get to the hospital. Because I will be bouncing off the walls. Take Care and I will see you on the flat side. Sorry sometimes my sense of humor could use an adjustment.",
      "MessageIndex": 22,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/752236",
      "Title": "What made you decide not to recon lucylou 3jaysmom"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Sep 9, 2010 10:51AM lucylou wrote: Well i finially got ahold of the Drs office. I told them what i was feeling and they went and spoke with the dr. and he said it was normal for that to happen. I said what does he think it could be and they said he just said it was normal but if it got any bigger to contact them right away. I'm not sure how comfortable i'm with that. Just leaves me wondering hummmm!!!! Thanks again for getting with me it helped me not to worry so much. Lucy",
      "MessageIndex": 5,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/757697",
      "Title": "little round ball lucylou lucylou"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Oct 20, 2010 09:22PM lucylou wrote: I went to my family doctor, for other female problems and told her about my rolling ball. So she sent me for an ultrasound. And they want to do a needle asperaition, probably did not spell that right. I think I should talk  to my BS first. They said it looks like a cyst???? Not sure if I should just let them asperate it or not. Would like any input. Please. Thank you.",
      "MessageIndex": 8,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/757697",
      "Title": "little round ball lucylou lucylou"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Sep 7, 2010 01:03PM lucylou wrote: I called the surgeons office this morning and the machine said that they were still out of the office for the Labor Day Holiday. I will try again in the morning. Thanks again for the input. Lucy",
      "MessageIndex": 3,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/757697",
      "Title": "little round ball lucylou lucylou"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Sep 9, 2010 08:52PM lucylou wrote: Yes it really freaked me out. Because you think to yourself there's nothing that should be there. So I guess if it does not get any bigger I will try to remain. calm. LOL And thats really hard for me to do.",
      "MessageIndex": 7,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/757697",
      "Title": "little round ball lucylou lucylou"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jan 18, 2012 10:18PM lucylou wrote: GNC Whey protein. Very good!!",
      "MessageIndex": 5,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781027",
      "Title": "Which Whey Protein is Best? theBCavenger newfmama"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "Jan 9, 2012 10:45PM lucylou wrote: Thank you for sharing, it always helps to know your not alone.",
      "MessageIndex": 33,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/766752",
      "Title": "I started a blog, with photos Turtletots lucylou"
    },
    {
      "AuthorID": "lucylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98523/profile",
      "Content": "lucylou wrote: Hi just wanted to drop in and say i got my new \"GIRLS\". And I really like them. Very happy that I didnot reconstruct. My surgeon left me extra skin in case i wanted to do recon. But I think next summer i will have the extra skin removed. I don't ever see myself doing recon.  I have found not have breasst to being a freeing experience. Some of my friends don't get it. But I don't care. I ordered some of those micro bead ones and they came I thought they were to flat. I ordered the same size i have in silicone but they seemed way to small. So i think i shall try and my some myself. I want to thank all of you that helped me early on in my journey. I meant alot to me.  Lucy. Dx 2/25/2010, LCIS, <1cm, Stage 0 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/755876",
      "Title": "I got my new girls.... lucylou franie"
    }
  ]
}