{
  "AuthorID": "lulu70",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
  "Posts": [
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Dec 10, 2013 06:39AM lulu70 wrote: I have been having problems with my left breast beginning in October with spontaneous nipple discharge. I also have extremely dense breasts, saw my PCP right away, and was sent for mammo and US. I was told that there were no significant new findings since my annual mammo in April. If the discharge continued, go to Breast Surgeon. I waited about 2 weeks and still having discharge...I made the appt. with the BS that had done an excisional biopsy on my left breast about 2 years ago. Problem being ,I had no confidence in him, I think mainly because I tried to discuss different issues ( like my dense breasts) and he didn't want to discuss it. So I looked for a Breast Care Center that specializes only in breast care...I went to George Washington University Hospital Breast Care Center in DC. They had a full page of info on \"breast density\". Dr. Teal ordered a bilateral breast MRI, which I'm scheduled for Dec.18th. It's a 2 hour drive instead of 30 minutes, but feeling better with my choice to go to another facility. Since this all started, the large firm mass from the outer side of my breast the whole way to my nipple is painful. I get sharp, searing pains that have woke me from sleep. I have two small pea-size nodules at the outer edge of my breast on my rib area, they however do not hurt. Shoulder pain and pain right below my collar bone. Breast has increased slightly in size and my nipple is turning down a bit. I'm having a really hard time concentrating on the holidays for fear of \"bad news\", but I can also say that if I have something wrong I want to know \"yesterday\" so I can just know...if that makes any sense. This \"sinking\" feeling is awful! Hugs to you!! My advice is to do whatever gives you peace of mind.",
      "MessageIndex": 14,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815516",
      "Title": "Biopsy before or after the holiday? birad 4b, scared naturegirl11 Nora5"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "lulu70 wrote: Just had follow up breast MRI (6 month) and once again have gotten Birads 4...that I understand and will discuss with my Breast Specialist on 8/6/14 at follow up appt.   WHY in paragraph \"Impresssion\" would radiologist say \"With persistant area of enhancing renal lesion on MRI, mamagement based on MRI reccomendations would be beneficial, which possibly would be surgical consultation regarding the biopsy under MRI guidance.\"???   Anyone understand why/how the word renal is on radiology report for a bilateral breast MRI?   I searched for alternate meanings for \"renal\"...just can't figure this one out. I know I can always wait and ask BS, which I will...but that's 2weeks. Input or ideas...anyone?   Thanks, Laurie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823039",
      "Title": "Can someone explain this? lulu70 JacquiW"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Aug 2, 2014 04:38PM lulu70 wrote:   Got a phone call from the receptionist at my Breast Specialist's office yesterday. My follow up appointment had already been set up to discuss breast MRI and ultrasound with my doc, just routine. She told me the doc asked her to call me and reschedule at his other office, where the radiologist is located, because the doc wants the radiologist to accompany him at my appointment to dicuss the findings.   Okay...REALLY stressing now!!! My doc is a Breast Specialist, so if I simply needed a biopsy dealing with the breast, my doc would be able to handle that, he's an intelligent man.    I'm trying not to let my thoughts of this \"renal lesion\" mentioned and the possibilties get the best of me...my appt. is next Friday. This is scaring the crap outta me!!   ",
      "MessageIndex": 2,
      "PostDate": "02/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823039",
      "Title": "Can someone explain this? lulu70 JacquiW"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Jan 13, 2014 12:36PM lulu70 wrote: idunno...let me start by saying that we have a few things in common. I too live in Pa., also for the last 17 years have been a Family Living Provider for Keystone Human Services for adults with developmental disabilities ( meaning I am their primary caregiver and the individual lives with me, my husband, and my children)...and let me tell you I am going through some \"trying\" times right now and one of the things I worry about the most is the fact that I have always taken care of others. THAT has been a big deal for me...hoping the day won't come that I can't continue to do the work that I love so much. I will be seeing another doc for a second opinion for my breast issues...as the most recent one made me feel \"dismissed\" and I felt defeated after the short phone call I received from her, and even second guessed if I was important enough to continue on to get answers, and I realized YES! Though,I am not in the position you are, I am married with 2 amazing kids...I have come here to chat, ask questions, and to \"vent\" because I don't want to burden my family. This has been a great place for support!! I've prayed for you a few times since I saw your post this morning and will continue to do so! Love and hugs from Mercersburg Pa.! Laurie",
      "MessageIndex": 17,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816795",
      "Title": "sad, alone and confused Idunno Hortense"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Dec 12, 2013 08:02PM lulu70 wrote: @ carolliin...I've only had one appt. with Dr. Teal, it's great to hear first-hand from another patient of hers that she \"knows her stuff\"...it's very reassuring to know I'm in good hands! Thank you!! @ Wren44...If I get results that quickly, I'll be thankful. I was thinking more like a week or more. I will most definately post results...thanks!!!",
      "MessageIndex": 12,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815392",
      "Title": "Waiting...trying to stay positive lulu70 curlyowl"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Dec 5, 2013 06:54PM lulu70 wrote: Thanks for the words of wisdom Ladies! @ sarahjane7374...I am the same way. Curiosity gets the best of me, so I look it up. The docs seem so reluctant to discuss things sometimes,so I just look for answers myself. I surely realize that even with all of the \"issues\" that keep popping up day after day recently,that I haven't been diagnosed with anything yet, and it could be any number of benign conditions. @ ziggypop...thanks for the advice about keeping a log and taking pics...though I got a good giggle because I suck at taking \"selfies\"! The discharge is spontaneous, I don't go near that nipple. I do wear cami's with shelf bras in them when I'm at home. Let me tell you though when I take my bra off, it's like I have a weight hanging from my left breast. It feels so heavy and like it's being pulled on, even with my bra on,I feel pulling. Exhaustion/fatigue is a BIG problem for me right now too. Can I ask, did either of you have a breast MRI? This is my first time...I'm ok with lying still, but had a small bout with vertigo about 3 years ago and movement around me tends to make me feel nauseated sometimes. Thanks again to you both for responding!",
      "MessageIndex": 3,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815392",
      "Title": "Waiting...trying to stay positive lulu70 curlyowl"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Dec 15, 2013 01:59PM lulu70 wrote: Well, Ladies...the radiology center called me late in the day on Friday and said that there was going to be an emergency in their department on Weds.( the day I'm scheduled to have my bilateral MRI ). I had called the Breast Center earlier that morning to be sure that pre-certification/approval for my MRI was approved and had gotten a call back saying \"yes\"...needless to say I was thrilled that I didn't have to haggle with my insurance company over this test. I was at our local hospital at the time the radiology department tried to call my cell (my husbands uncle is very ill) and they didn't let a message. By the time I listened to my house messages, it was after hours there. They said they had an opening on Monday, so I'm calling 1st thing in the morning. PRAYING that they still have that opening tomorrow. Between physical discomfort and anxiety...I think I may go bonkers if I have to wait too much longer! I'll keep you posted. HUGS to all!!!",
      "MessageIndex": 13,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815392",
      "Title": "Waiting...trying to stay positive lulu70 curlyowl"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Dec 16, 2013 08:09PM lulu70 wrote: Hi Ladies! First of all...THANK YOU ziggypop for the idea of leaving a message!!! After much back and forth and disappointment because the reception I talked to 1st thing this morning told me they couldn't get me in until 12/31...I accepted the appt, got off the phone and prayed. Not too much later the woman that had left me the message Friday called and said if you can make it today, we can still work you in. My husband rearranged his work day and off to DC we went, I had my MRI...the tech said my doc should have the results by the middle of next week. Hoping I get them sooner than that, BUT am so thankful that I was able to get the MRI done!!! Will post (hopefully with B9) results...HUGS to all!!",
      "MessageIndex": 17,
      "PostDate": "16/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815392",
      "Title": "Waiting...trying to stay positive lulu70 curlyowl"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "lulu70 wrote: Hello, Ladies! I'm new here and I suppose I'm looking for someone to chat with about all that's going on with me, because I don't want to stress my family out unnecessarily. So,I'm 43 years old. I've been having mammos and US since I was about 38, due to lumps and bumps that have so far been benign. (thank goodness!) I also have extremely dense breasts. Two years ago I had an excisional biopsy of the 12 o'clock area of my left breast, because the Breast Specialist thought it suspicious. He removed a section of a large firm mass-like area and results were benign. Both my breasts had the same area of firmness at the top. Fast-forward to Oct 2013, one night I was getting changed into my PJ's and happened to glance down and noticed two beads of discharge on my left nipple, one greenish and the other clear. Never having this \"issue\" before,I called my PCP and saw him the next day and he set up a mammo and US. Both tests came back with \"no significant new findings\" from my annual mammo in April 2013. I was told if symptoms persisted to see BS. I waited about 2 weeks and still having the spontaneous discharge, so made appt. with BS in my area that had done biopsy 2 yrs. earlier. I just couldn't get past this feeling of not wanting to go back to him...Besides doing breast surgeries he's also a general surgeon and I felt \"herded through\" previously and wanted to find a facility that deals only with breasts. So, I did just that. I found George Washington University Breast Care Center, Though it's a 2 hr. drive I made the appt. with Dr. Teal...gathered all of my films and radiology reports to take with me. My breasts have always been tender. Due to extremely heavy periods, I had a D&C and Novasure endometrial ablation done 5 years ago with no periods since ( yeah,me!) A few months after the biopsy on my left breast I noticed alot of pain above the scar and realized there was an indentation there kinda like there is a hole in the tissue under my skin, that still causes me pain today. I am very good about doing self exams. It seems like since the discharge started, it has \"opened a can of worms\" so to speak. My lumps are always tender, but I found an area on the outer side of my left breast that has 2 pea-sized lumps that are not painful (that's a little scary) Also my breast has gotten larger and the lump has alot of small lumps on it. SO much pain from my outer breast area to my nipple. It hurts for ANYTHING to brush against my nipple ,even my 4 lb. Yorkie. In the last week I have been having what feels like a deep itch that I can't scratch enough to get relief from. The pain has woke me up at night gasping for air because it fells like someone stabbed my boob with a hot knife. I have had left shoulder pain, which may be stupid to even mention. And the area below my collar bone hurts like crazy. My nipple is starting to point down a little. Though gravity has already taken it\"s toll on my \"girls\", they've always looked pretty much the same. Not now. I've had my consult appt. with Dr. Teal and she ordered a bilateral MRI that is scheduled on December 18th. I know I am on the right track and I feel a sense of empowerment for finding a new Breast Care Center. I just need to chat...the \"unknown\" is freaking me out a bit! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815392",
      "Title": "Waiting...trying to stay positive lulu70 curlyowl"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Dec 11, 2013 07:16PM lulu70 wrote: Thank you so much for sharing your MRI experiences with me and giving me insight of what to expect! I think if I have something to focus on outside of the MRI and hopefully some music in the room or headphones, I'll be okay. One more week then wait for the results. :( How long does it usually take to get results?",
      "MessageIndex": 9,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815392",
      "Title": "Waiting...trying to stay positive lulu70 curlyowl"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Dec 15, 2013 06:43PM lulu70 wrote: GREAT idea ziggypop!!! I'll do that right now...thank you! :) I'll update tomorrow.",
      "MessageIndex": 15,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815392",
      "Title": "Waiting...trying to stay positive lulu70 curlyowl"
    },
    {
      "AuthorID": "lulu70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192766/profile",
      "Content": "Dec 18, 2013 11:28PM lulu70 wrote: Hi ladies...only 2 days and the radiologist called this morning with the MRI results. The left breast (the one making me totally miserable) showed fibrocystic but benign changes. ( YEAH!) On the other hand, to my surprise he said that they found an area that is about 6mm in my right breast that is suspicious with increased blood flow and needs further evaluation. Made the call as soon as I got off of the phone with him and and set up for a right breast ultrasound...it's not the usual ultrasound with a probe, I think the machine is ABUS Ultrasound. My appt. is next week, Dec 26th. Taking each day as it comes and trying not to stress, I realize that MRI's are very \"sensitive\", so the \"finding\" in the right breast may also be benign...but it kind of caught me off guard. Hoping all of you are well and wishing you all a Merry Christmas!",
      "MessageIndex": 18,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815392",
      "Title": "Waiting...trying to stay positive lulu70 curlyowl"
    }
  ]
}