{
  "AuthorID": "Lumposcar3yrs",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82770/profile",
  "Posts": [
    {
      "AuthorID": "Lumposcar3yrs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82770/profile",
      "Content": "Lumposcar3yrs wrote: My w. had an r.B. lumpectomy late 2005.  No treatment at all. A year after, a recurrence on the same B. surgery bed/suture, P. report showed all the same as original. On Tamox. For some 10-12 months.  After, because of possibility of recur., started Avastin+Xeloda (pills); it worked greatly by completely disappeared lump on the same B.  Even though, in short term, had ups and downs in stationary, mild progression, overall in longer term, everything remained somehow progression free.  This new treatment and conditions lasted over a year; while all remained the same, some 3-4 months ago the suture/stitch of the lumpectomy started to \"retreat\" (pulled back/inside) into the breast/surgery bed.  This gradually started to appear as if there was a hole/opening in the same size and place of few inches of suture.  The breast has become completely very tender and now completely hard.  At the beginning it was very sensitive, and with pain, specially, when pressed up/down. Suture is on the mammary fold towards outer lower quadrant-the site of the tumor and recur.s.  MRI was, practically, inconclusive between scar/tissue remodeling/recur.  Now the pain and sensitivity has almost gone; except for the \"hole/opening\" portion. Treatment has been stopped since this process started (around March-April).  She is Ok in all senses, fatigue reminisce cent of treatment and hand & ft side effects are almost completely gone. The questions are: 1-The process is a side effect of Avastin+Xeloda (pills) combination or just either one?  2-Recurrence 3-Combination of all above in the form of Necrosis and similar process?  The skin around the suture is pulled in, but no indication of an open wound into the breast.  Any experience/comment/doctors suggestions? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740177",
      "Title": "All Hard Rock R.Breast Lumposcar3yrs TXBadboob"
    },
    {
      "AuthorID": "Lumposcar3yrs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82770/profile",
      "Content": "Lumposcar3yrs wrote: I had a lumpectomy Dec.2005/inferior armside right breast .  I did not accept any treatment.  Almost the same time it first appeared, I had a recurrence on scar bed.  Some 6-8 months on Tamoxefin and Ovarie sleep injection.  It was effective.  Again it started in the same place.  it became a visible lump right on the scar bed and line.  Mets were controlled/gone/establized. I started Xeloda + Avestin.  The lump gone completely in a matter of few months (weeks).  I have been on this treatment for some one and half year. It has been effective again the same way above -some small ups and downs, but overall \"healthy\" and active with my some 10 hrs responsible position.  In the last few weeks again the activity started.  This time, there is no lumps seen outside. Tenderness, heaviness, pain with touch, ichiness, sometimes sharp shooting pain, generally uncomfortability.  Scar line started being sucked in (retraction..?), and now is a 2-3 inch opening as if there was originally a hole.  My Dr. Onc. believes it is active again and suggested a treatment change.  My PET/CT basically shows the same situation that I had during the recurrence period -ups and downs, but overall stability.  The only difference is that regading the scar area (right armside inferior right breast) it shows high activity in PET/ and architectural distortion with no change in mopholog in CT.  I have read while there could be the cancer growing as a \"by default\" core issue, but there have been cases where the scar+treatment effectiveness created such a codition, and even it was seen in TM ca27-29 - which has always had floctuations in short 16-30 days basis, but still remaining stable on longer periods - by \"leaps\" of 20 points in the last three months, passing the usual and highest ceiling I had (96+) to 150. My question is could some other \"conditions\" other than re-activated cancer be the reason?  No mass has been seen, and by touch the feeling is not a hard whatsoever mass, rather a medium to high tenderness.  Shape and size do not show the condition so enphatically; pulled up, the \"hole\" is seen, and no other changes. I have the pictures too.  I have had routine twice monthly dr.onc. visit and my treatment/3-4 months apart PET/CT and blood and urine during every visit since  around end of 2006(first recurrence).  My CA 27-29 is in the way for having the result by the end of this week Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733040",
      "Title": "Any similar experience? Lumposcar3yrs Lumposcar3yrs"
    }
  ]
}