{
  "AuthorID": "lurkingnomore",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200144/profile",
  "Posts": [
    {
      "AuthorID": "lurkingnomore",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200144/profile",
      "Content": "lurkingnomore wrote: Hi all, I have decided to take a leap and get started on the boards here.  I have followed Chickadee for a while and was so saddened at her passing. On a bright side, I have loved Ebru's great threads and especially the one with the hair styles.  After seeing everyone's pictures, it just felt like a place I should be. Was first diagnosed in 2008, got the mets call at the end of 2012.  (bones, but now a bit in the lungs and lympe nodes. )   Looking forward to joining the group! Lisa IDC in 2008. Did the usual, lumpectomy, chemo , radiation and anti hormonals. Mets to bone in December 2012 resulting in fractured pelvis. Now mets to lung, liver, and lymph nodes. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820891",
      "Title": "Moving from lurking to being a true member lurkingnomore chris1959"
    },
    {
      "AuthorID": "lurkingnomore",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200144/profile",
      "Content": "lurkingnomore wrote: Hi all, I have decided to take a leap and get started on the boards here.  I have followed Chickadee for a while and was so saddened at her passing. On a bright side, I have loved Ebru's great threads and especially the one with the hair styles.  After seeing everyone's pictures, it just felt like a place I should be. Was first diagnosed in 2008, got the mets call at the end of 2012.  (bones, but now a bit in the lungs and lympe nodes. )   Looking forward to joining the group! Lisa IDC in 2008. Did the usual, lumpectomy, chemo , radiation and anti hormonals. Mets to bone in December 2012 resulting in fractured pelvis. Now mets to lung, liver, and lymph nodes. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820891",
      "Title": "Moving from lurking to being a true member lurkingnomore chris1959"
    },
    {
      "AuthorID": "lurkingnomore",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200144/profile",
      "Content": "lurkingnomore wrote: Hi again, Since I got such a warm welcome, I would love anyone's feedback on these scan results.  As background, I work with an old line doctor at Stanford.  Great guy who looks at quality of life.  When these results came in, he said it wasn't a big deal, as the newer imaging picks up things at a much lower level than before.  Thus, no change in treatment or any biopsies.   If I start having symptoms we will change treatment from the the arimidex and zometa that I am currently on.  But, to tell you the truth the results look concerning.  What do you think? Impression IMPRESSION: 1. MULTIPLE NEW SMALL BILATERAL PULMONARY NODULES MEASURING UP TO 8-MM CONCERNING FOR PULMONARY METASTATIC DISEASE. 2. MULTIPLE NEW ILL-DEFINED HEPATIC LESIONS CONCERNING FOR HEPATIC METASTATIC DISEASE. 3. NEWLY ENLARGED BILATERAL HILAR AND MEDIASTINAL LYMPH NODES. 4. FINDINGS OVERALL CONCERNING FOR SLIGHT PROGRESSION OF OSSEOUS METASTATIC DISEASE AS EVIDENCED BY SEVERAL NEW RIB LESIONS AND POSSIBLE SLIGHT INCREASE IN SIZE OF OTHER PRE-EXISTING LESIONS. MANY OF THE PRE-EXISTING MIXED SCLEROTIC-LYTIC OSSEOUS METASTASES ALSO HAVE AN INCREASINGLY SCLEROTIC APPEARANCE, WHICH MAY REFLECT INTERVAL TREATMENT RESPONSE VERSUS PROGRESSION. 5. PATHOLOGIC FRACTURE EXTENDING THROUGH THE LEFT ILIAC BONE AND LEFT ACETABULUM, ASSOCIATED WITH LARGE MIXED LYTIC SCLEROTIC LESION IN THE LEFT ILIAC WING, LEFT ACETABULUM AND LEFT ISCHIUM, WITH SIMILAR REPORTED FINDINGS ON PRIOR PLAIN RADIOGRAPH OF MARCH 6, 2013. IDC in 2008. Did the usual, lumpectomy, chemo , radiation and anti hormonals. Mets to bone in December 2012 resulting in fractured pelvis. Now mets to lung, liver, and lymph nodes. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820925",
      "Title": "Would these results worry you? lurkingnomore Sherman3480"
    }
  ]
}