{
  "AuthorID": "Luuc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275301/profile",
  "Posts": [
    {
      "AuthorID": "Luuc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275301/profile",
      "Content": "Luuc wrote: I found a lump back in April, then I found a doctor who set me up to get a diagnostic & ultra sound mammogram. Then last Thursday I have 3 biopsies done, 2 on the right breast & 1 on the left. Saturday morning my doctor calls & tells me I have breast cancer in the right one, the left is negative for cancer. She then tells me the name of a surgeon & an oncologist and tells me they will be calling me on Monday as I need to have surgery as soon as possible to have the mass removed and then she starts talking about a mastectomy and I should do both so I don't have to worry in the future. WOW! I'm in shock & I'm scared. Dx 6/9/2018, DCIS/IDC, Right, 2cm, Stage IIB, Grade 3, ER-/PR-, HER2- (DUAL) Surgery 6/29/2018 Mastectomy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865136",
      "Title": "Me too Luuc Meow13"
    },
    {
      "AuthorID": "Luuc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275301/profile",
      "Content": "Jun 12, 2018 08:44AM Luuc wrote: How do I find those threads?",
      "MessageIndex": 10,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865136",
      "Title": "Me too Luuc Meow13"
    },
    {
      "AuthorID": "Luuc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275301/profile",
      "Content": "Jun 18, 2018 11:06AM Luuc wrote: Triple Negative in Colorado, are there any others? Trying to get surgery scheduled for the 29th of this month for removal of both breasts & I've decided to go flat. Oncologist said at this point she does not know if chemo will be needed, won't know until surgery is over. If chemo is needed she said 5 months, twice a week for the 1st 2 months, then once a week for the last 3 months. OMG!!! Trying really really hard to stay strong, stay focused and stay positive. Some minutes are easier than others.",
      "MessageIndex": 2599,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Luuc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275301/profile",
      "Content": "Jun 11, 2018 11:10AM Luuc wrote: It's crazy insane and something I never ever ever thought about. You know, it won't happen to me (kind of thing). Thank you for you thoughts and suggestions. I'm in a waiting mode for oncologist & surgeon people to contact me and start to make a plan. I don't think I'm interested in reconstruction. But I don't know??",
      "MessageIndex": 3,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865136",
      "Title": "Me too Luuc Meow13"
    },
    {
      "AuthorID": "Luuc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275301/profile",
      "Content": "Jun 11, 2018 09:12PM Luuc wrote: I have an appointment with a surgeon and then another one on Thursday. Also will be meeting with an oncologist on Friday. My PC wants me to get in quickly as the cancer is a fast growing one and is one that makes me not eligible for hormone therapy. They tell me more than likely I will be having the chemo talk with the surgeon. I'm not a fan of chemo. Does anyone have any information on alternative cancer treatments? IE: holistic/natural",
      "MessageIndex": 6,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865136",
      "Title": "Me too Luuc Meow13"
    }
  ]
}