{
  "AuthorID": "luv_gardeni…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
  "Posts": [
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "May 12, 2012 04:08AM luv_gardening wrote: Srrme, it's probably benign, but you're doing the right thing getting it checked.  Breasts can be lumpy just before or during a period so bear that in mind.  I hope all turns out well for you.",
      "MessageIndex": 7,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787253",
      "Title": "22 years old & I found a lump Lamigo luckykitkat09"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Jun 24, 2011 01:40AM luv_gardening wrote: Hi MBJ, I guess I've had this for my whole life too.  When I first went to the site you mentioned a week ago my temperature was 35.8C / 96.4F and the next morning it was the same temp.  I've always had a low temp, BP and a slow pulse, usually 60bpm while resting. I don't suggest anyone else try using will power alone as I have no idea how it works, but I do believe that a lot more of our health could be affected by our stress levels, attitude, beliefs and more, but it's a very hard thing to study as even I don't even know how I'm bringing my temperature up. It could return to the usual low levels tomorrow for all I know. Note well, this does not mean I believe we negatively thought our way to BC which I find a very blaming, offensive idea when anyone dares to say that to cancer patients. ",
      "MessageIndex": 73,
      "PostDate": "24/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770606",
      "Title": "Low Body Temperature anyone? MBJ mapat"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Jun 23, 2011 07:51PM luv_gardening wrote: Since I was not able to use the hot shower, coffee, heater etc method to raise my almost always low temperature, yet the next day it was 37C all day despite not doing anything, I decided I could probably raise my temperature through will power alone.  Call it Biofeedback if you like, the feedback being the thermometer. In the past I have experimented with changing different things with limited success, mostly because I lose interest.  One area that always worked for me for decades was waking myself in the morning, even as early as 5am to get to the airport.  I would set an alarm to go off 5 minutes later as a backup then turn it off when I predictably woke on time.  I always woke on time when I worked after I started this method. So now I have declared my intention to experiment with raising my temperature through willpower alone, hopefully I won't lose interest as I feel it's important for health in so many ways. Today I've been on 36.6 all day which is closer to normal than my usual 36C, so I'm getting there. ",
      "MessageIndex": 71,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770606",
      "Title": "Low Body Temperature anyone? MBJ mapat"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "May 11, 2012 09:54PM luv_gardening wrote: The biopsy is the only thing that counts. Everything else is guesswork.  Waiting is always scary as our minds wander to the worst outcome and it is statistically more likely not to be cancer. While waiting for my biopsy, I convinced myself it was nothing, though due to other symptoms I was sure deep down it was going to be bad news.  Yet I realised that no amount of worrying would change the outcome.  Strangely, when I received the phone call that I needed an urgent follow up appointment and knew the news would be bad, that calmness remained with me.  All fingers and toes are crossed that you get good news.",
      "MessageIndex": 7,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787339",
      "Title": "Diagnosed with a 5 cm solid mass in left breast cspiritl Fergy"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Jun 15, 2011 12:00AM luv_gardening wrote: Elizabeth is no longer with us.  See the new thread. So sad.",
      "MessageIndex": 743,
      "PostDate": "15/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Feb 24, 2010 08:55AM luv_gardening wrote: I'm 59 and found out recently I have osteoporosis.  I'm trying to avoid any bisphosphonates.  So far they don't seem to have any effect on progression for post-menopausal women though some studies are in progress.  I'm doing lots of exercise and will probably opt for tamoxifen while I try to build up my bones.  ONJ scares me as well as the oesophagal effects of the oral version.  Does Zometa really have a half life of 10 years?  They don't seem to know if the SE's continue to be a risk after the infusions stop.  Progression scares me even more but no point on taking the risk unless there is a clear advantage. So many confusing decisions.",
      "MessageIndex": 10,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748810",
      "Title": "No Zometa for Me...Yet NancyD pupfoster1"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Feb 15, 2010 01:17AM luv_gardening wrote: Thank you Jessica for saying what I wanted to say about survival rates being the big difference between stages, not just treatments.  My statistics for 10 years are pretty dismal too which is why stage III is called advanced. Since this is the stage III forum I do prefer to know I'm chatting with others in the same stage, otherwise we may as well just have one general forum where everyone joins in.  At the same time I appreciate hearing from anyone with their experience or thoughts if they are helpful, no matter what their stage. I ask that people just show the respect and compassion they would like for themselves.  I appreciate that many are under incredible stress and so I just say to please do whatever it takes to find peace in your life. Hugs to all of you who are stirred up, angry or distressed, this is a rough road we're all on.  (((((((((((((Big Group Hug)))))))))))))",
      "MessageIndex": 166,
      "PostDate": "15/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Jan 5, 2011 01:56AM luv_gardening wrote: http://www.breastcancer.org/symptoms/diagnosis/staging.jsp wherever axillary lymph nodes are mentioned for the stages they distinguish whether they \"are clumped together or sticking to other structures\", otherwise they just say axillary nodes without mentioning any specific number of nodes, so it seems it's the progression of cancer in the nodes rather than the number that affects prognosis and treatment. Stage IIb `... and has spread to the axillary lymph nodes.\" Stage IIIa `... and has spread to axillary lymph nodes that are clumped together or sticking to other structures.\" When the tumour is larger than 5cms it belongs in IIb if there are no nodes and IIIa if nodes have \"clumped or stuck\" but then there is nowhere when nodes have not \"clumped or stuck\" with a tumour greater than 5cms. Of course there are other reasons for staging not affected by the nodes. I assume these changes are the result of prognostic statistics gathered from many studies and wonder why they haven't been more widely publicised. I know one of my cancerous nodes had ruptured but have no idea whether that puts me in stage II or III.",
      "MessageIndex": 15,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Jan 5, 2011 11:59PM luv_gardening wrote: I copied and pasted to a different font and it is a lower case L.  1 I and L can be confusing.",
      "MessageIndex": 41,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "May 15, 2012 01:52AM - edited May 15, 2012 01:55AM by luv_gardening The Decemberists - \"Calamity Song\" on Austin City Limits ",
      "MessageIndex": 6,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/787391",
      "Title": "Just saw LE sleeve on TV garnet131 dressager"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Jan 5, 2011 03:54AM luv_gardening wrote: Margie, yes, I was told it was stage 3 but I don't know whether I should be stage 2 with the new rules.  They probably have different criteria here in Australia anyway but if the prognosis has now been improved I'd love to be stage 2 for my own peace of mind.  Tammy, that's what my pathology said, extracapsular extension, but I don't know what it means or if it fits the new category for stage 3.  I suppose I could see if adjuvant online gives me different statistics now if they take into account the new information but the thought of going to that site gives me the creeps.",
      "MessageIndex": 19,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Jan 5, 2011 09:37PM luv_gardening wrote: What we need is more research into the methods used by the cancer to hibernate, how to detect if it's hiding or whether we're clear, and ways to intervene so we can all be sure it's behind us. Lago and Maryanne, I agree it's not helpful to concentrate on the worst scenario rather than to assume we're free to get on with our lives, otherwise we will live a miserable life and in the end we only have the present moment so why not make the most of it. Beesie, I welcome your comments which were well informed and impressively put and I've found this an interesting discussion. It's a juggling act trying to, on the one hand express our grief and fear and on the other hand try to keep upbeat and enjoy our lives without too much fear.   When one expresses fear and another is trying to look ahead to a long happy life we clash but in the end we've all been on both sides of the fence and we need to acknowledge our sisters feelings whatever their stage or outlook. In the end we're on the same journey. Love and hugs to all my wonderful sisters. (Said with tears in my eyes, literally).",
      "MessageIndex": 39,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Jan 1, 2011 08:32AM luv_gardening wrote: Meg, those cancer monthly statistics look wrong to me.  If there were 216,000 Invasive BC cases in 2004 then since over 5 years have passed, there should be around 100,000 deaths each year.  The death rate has stabilised at about 40,000.  In similar countries, UK, Canada and Australia there are consistently around 4 to 5 diagnosed cases to every death each year. If more elderly women get it than younger then there may be a percentage of women dying from other causes after getting mets which would upset the statistics, but surely not by such a huge amount. One in 4 or 5 looks much more likely and a lot less scary.",
      "MessageIndex": 41,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762100",
      "Title": "Stage 1 and Mets mari65 barbe1958"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Aug 6, 2011 10:21PM luv_gardening wrote: Did you consider going to the Gawler retreat in Melbourne? I did inquire but it's rather expensive.  I found the book written by different people who used his methods incredibly inspiring.  It's called Surviving cancer, edited by Paul Kraus.  I still read a chapter at a time, over and over, for the \"hope\" part of my plan, as well as some of the inspiring stories from the women here who are still cancer free after many years. ",
      "MessageIndex": 5,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772748",
      "Title": "New here - natural therapies instead of chemo and radiation kazza7 SusansGarden"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Aug 6, 2011 10:03PM luv_gardening wrote: Hi, welcome Kazza from another Aussie who has similar beliefs but did have some adjuvant treatments.  There was a similar question asked in February in a thread called \"Survivors who have used only alternative treatments\" in the alternative section. Click on that link to go to the start and you'll see what sort of reception your question may attract.  82 pages, nearly 2500 posts of sometimes heated discussion.  I'm sure you've heard it all before. If you click on the name of the originator of that thread, wornoutmom, look for the link to send her a message and you'll find her a lovely person who has a lot in common with you who can answer some of your questions. The Alternative section has just been started and you're welcome to ask the same question over there. Unfortunately your title will attract a lot of people when it shows on the Active Topics every time anyone replies and most will be fearful for your wellbeing, but as 13 months have passed it's too late for chemo etc now anyway.  If you start a new thread you might want to give it a different title though it's a shame we alternative ladies need to do that.  Feel free to send me a personal message any time. Joy - 10:30pm eastern Australia time. ",
      "MessageIndex": 4,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772748",
      "Title": "New here - natural therapies instead of chemo and radiation kazza7 SusansGarden"
    },
    {
      "AuthorID": "luv_gardeni…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86428/profile",
      "Content": "Feb 25, 2010 05:07AM luv_gardening wrote: There is an excellent and very long thread for venting about anything at all in the section, Recovery, Renewal and Hope / Moving Beyond Recovery / I'm Bitchy, I moan, I groan... Anyway http://community.breastcancer.org/forum/7/topic/701893?page=1",
      "MessageIndex": 8,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748532",
      "Title": "Please stop everyminute sas-schatzi"
    }
  ]
}