{
  "AuthorID": "luvdsny",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223999/profile",
  "Posts": [
    {
      "AuthorID": "luvdsny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223999/profile",
      "Content": "Nov 18, 2015 05:37PM luvdsny wrote: Welcome tlb01! So sorry you have had to take this crazy roller coaster ride but happy to hear you got good news! Thank you for sharing your story and your recovery. I have been wondering about recovery time frame. Did your doctor mention anything about lifting? My surgery is Monday and wondering about planning for a Thanksgiving dinner (which I am cooking).",
      "MessageIndex": 12,
      "PostDate": "18/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829933",
      "Title": "Intraductal Papilloma with Calcifications jcjeffery Supportive"
    },
    {
      "AuthorID": "luvdsny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223999/profile",
      "Content": "Nov 11, 2015 06:40PM luvdsny wrote: I know this is an older thread but I would love some follow up from posters. I had a biopsy for a calcification in my right breast which were benign. However I am being referred to a surgeon for an Inductal Papilloma, I too am confused to know if I am \"out of the woods\" for malignant cells. Would love to hear about results or information on removal surgery. Thanks!",
      "MessageIndex": 4,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829933",
      "Title": "Intraductal Papilloma with Calcifications jcjeffery Supportive"
    },
    {
      "AuthorID": "luvdsny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223999/profile",
      "Content": "Nov 13, 2015 12:44PM luvdsny wrote: Thank you Liza12345 for your reply. Everything I am reading says it's \"standard protocol\" for a lumpectomy with these papillomas. My biopsy pretty much removed my calcification, so that is good. Not looking forward to a surgery but ready to put this behind me. I will report back, these boards have been so helpful!",
      "MessageIndex": 6,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829933",
      "Title": "Intraductal Papilloma with Calcifications jcjeffery Supportive"
    },
    {
      "AuthorID": "luvdsny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223999/profile",
      "Content": "Nov 17, 2015 11:58AM luvdsny wrote: To follow up, I met with my breast surgeon today. She is wonderful and answered so many of my questions I had. I will be having an excisional surgery on Monday. I was told a pathologist will be present and if they see anything in the cells taken they will then do a lumpectomy while I am under sedation. I should have some finding Monday and final pathology report due on Tuesday. If no cancer is found I will be done and will have a follow up 6 month mammogram. If cancer cells are found (she explained a very small percent) we will discuss options at that time. Ready for this to be over! What a roller coaster ride this has been. My heart goes out to all those dealing with this, the waiting is awful!",
      "MessageIndex": 10,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829933",
      "Title": "Intraductal Papilloma with Calcifications jcjeffery Supportive"
    }
  ]
}