{
  "AuthorID": "luvmywife",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
  "Posts": [
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Apr 28, 2011 07:10PM luvmywife wrote: Wow, My beautiful wife just fought that battle. In feb it was two brain mets, very small, then we found it in the lungs- i/we didn't stop there trying to figure this out- we were days from wbrt beginning when our third or 4th opinion said a spinal tap would be in order. Most dr's felt my wifes brain mets were too small for the horrible headaches she was having. As bad luck would have it, the cancer was in the spinal fluid as well. My wife never wanted to know prognosis. She wanted to fight and she was going to kick this craps Ass! We had an omaya port installed in brain- and chest port to get on with the fight. (Once it was in spinal fluid- we were told wbrt was not a good option) (may be a difference between spinal lesions and cells in fluid). The pain and nausea was horrible and one treatment of chemo to brain- I asked my wife if getting rid of pain and nausea would be better than this hell and going home (forget the dam cancer)- she said \"now that's a fight worth fighting for. Three days later the pain mgmt team, nurses, and her and I worked together to carefully balance pain meds with allowing her dignity and ability to communicate. When she woke me at 5 am (I was sleeping in hospital in her room on the couch)- she said - its a miricle- no pain and no vomiting!! Am I cured? I told her yes it was a miracle, the cancer is still there - but let's go home! You never saw such a smile and so much love. For a period of time- all the pain and fear had faded into the background and my wifes beautiful \"spunk\" and \"Love was back\" I got her home- learned all her meds including her insulin and began taking care at home. 5 days later at 6:33 am, she had waited for me to wake up. I held her hand and let her know it was ok to go off to heaven and she quietly and peacefully went to heaven. Your doing the right thing. The decision is really your friends to make. The importants of dignity for the sick is so very very important. At least in our case- we found tHat precious miracal of no pain but it took a bit of a fight. Remember- miracles do happen!! I promised my wife and she said if I we simpy share our story and it helps someone else- the battle would not have been in vain. Good luck to you, your friend, your friend and prayers to each and everyone on this site. Such courageousness (sp) and friendships are so special",
      "MessageIndex": 18,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768073",
      "Title": "New here Is there a point where chemo does not make sense CGA luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jun 23, 2011 07:16PM luvmywife wrote: Now that's awsome news. Brovo for your onc. Seems like he is not afraid to use scans to track progress during treatment and as follow up. TN is a bad animal and requires significant testing. My humble opinion. I am so happy for you!! Keep the faith! Mark",
      "MessageIndex": 10,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770723",
      "Title": "Encouraging PARP news nmiller1978 bottkota"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jul 23, 2011 01:41PM luvmywife wrote: Cathy- I am not a sister but do have sig knowledge as my wife also had brain mets 12 month after orig BC diag. 2 month later she was an Angel looking over us all. Her mets were \"too small for her horrible headaches\" which eventually resulted in MRI to see the spots. Further tests revealed spots on Amy's lungs. We were given decadron- steroid over weekend. Radiologists and neurologist felt cyber knife was way to go- zap the two spots and be done with it. Our onc argued we need to do WBR, he said the ins co would not pay to monitor brain for future mets given existance of lung mets. Our 4th opinion dr- said nonsense- cyber knif is done all the time- BUT he too believed brain spots were too small for Amy's pain. He said do a spinal- if spinal is positive for mets- whole treatment plans would change. C was in the spine- I. Now pray every day our experience will help someone kick this stuff. I'll be damed if one of my wifes friends emailed me last sunday and told me she has TNBC like Amy- I think we are all partners in this fight. Good luck and pm me for more details. Mark",
      "MessageIndex": 5,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772042",
      "Title": "Searching for Brain Mets sisters Cathy1964 chainsawz"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "May 7, 2012 09:28PM luvmywife wrote: From my Angel Amy- \"Everything Happens for a Reason\". Usually followed by - \"This too shall pass\". Mark",
      "MessageIndex": 33,
      "PostDate": "07/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786999",
      "Title": "Please post your favorite or an inspiring quote BarbRocks marymoir"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: Thanks to all the kind wishes, prayers, thoughts about my wife Amy's and our battle with TN BC. Her love for fishing and the fla Keys began on our honey moon when a Norwegion Capt Joe Johanson took us tarpon fishing. (Up to 100 lbs or more). I had known Capt joe for 20 yrs prior. Being new to this sport, but so willing to learn- she felt a bit intimdated by Capt Joe 15 yrs later, her wish was to have her Ashes laid to rest next to Capt Joe who also fell to cancer two yrs ago. We laid Joe's ashes (he was my best friend) to rest on Thanksgiving two yrs ago. Last year, Joes wife passe from a brain tumor and once again we laid her ashes to rest at Thanksgiving which we shared together deep frying a turkey each year. When Amy made the comment to me, I am going to be next, aren't I? We had an honest, tearfull coversation and she made it clear, she wanted her ashes to be spread in same spot as Capt Joe. Last Tuesday, rather than Thanksgiving, in the middle of the Tarpon season, our son, brother in law, and I and Twenty five friends on 5 boats laid her to rest. A beautiful prayer was said by another close Capt \"Big Wave Dave\" who also became part of our family in the last 6 yrs. Two beautiful songs were played (one our wedding song by Brian Adams- Everything I do I do it for you-our wedding song). So many flowers and a wreath were laid on the water they spread 100 yards. In the days preceeding the ceremony, we fished Amy's favorite \"tarpon hole\" and we caught four tarpon, one for me, one for Capt Big Wave Dave, one for our son, and one for her Brother!! I know she was smiling with this!! Then we had her celebration of life immediately afterwards. Now Amy is at peace where she so loved. Boy what emotions and thoughts went through my mind. I know she and Capt Joe were looking down from above with great joy. Thanks again to all who have been so supportive on this site and my prayers go out to all who need them from this ugly disease. I too, like Yan, would like to continue to update as my life adjusts and where I may be able to help some with our experience. Mark Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770302",
      "Title": "Finally at rest luvmywife irish22"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jun 19, 2011 10:11PM luvmywife wrote: Thanks to all for the kind words. This is such a wonderful place! After returning from this trip, a short delay occurred when I had to jump into the middle of my 83 year old mothers healt care, (colon cancer two yrs ago, successfull reversal and currently ned. But she had horriffic abdominal pains and the ER sent her home. I took her back the next day and said I wasn't leaving till I saw her Primary care Dr. (Sat/sun/mon- no matter, I would wait. They admitted her- did mri/Ct and finaly an edoscopy which revealed souce of pain with gastritis. Point is- any patient must have good advocate or thIngs can just get swept along in the system. Got back just in time to home to do my colonoscopy! Thanks all.",
      "MessageIndex": 39,
      "PostDate": "19/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770302",
      "Title": "Finally at rest luvmywife irish22"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: Thanks to all the kind wishes, prayers, thoughts about my wife Amy's and our battle with TN BC. Her love for fishing and the fla Keys began on our honey moon when a Norwegion Capt Joe Johanson took us tarpon fishing. (Up to 100 lbs or more). I had known Capt joe for 20 yrs prior. Being new to this sport, but so willing to learn- she felt a bit intimdated by Capt Joe 15 yrs later, her wish was to have her Ashes laid to rest next to Capt Joe who also fell to cancer two yrs ago. We laid Joe's ashes (he was my best friend) to rest on Thanksgiving two yrs ago. Last year, Joes wife passe from a brain tumor and once again we laid her ashes to rest at Thanksgiving which we shared together deep frying a turkey each year. When Amy made the comment to me, I am going to be next, aren't I? We had an honest, tearfull coversation and she made it clear, she wanted her ashes to be spread in same spot as Capt Joe. Last Tuesday, rather than Thanksgiving, in the middle of the Tarpon season, our son, brother in law, and I and Twenty five friends on 5 boats laid her to rest. A beautiful prayer was said by another close Capt \"Big Wave Dave\" who also became part of our family in the last 6 yrs. Two beautiful songs were played (one our wedding song by Brian Adams- Everything I do I do it for you-our wedding song). So many flowers and a wreath were laid on the water they spread 100 yards. In the days preceeding the ceremony, we fished Amy's favorite \"tarpon hole\" and we caught four tarpon, one for me, one for Capt Big Wave Dave, one for our son, and one for her Brother!! I know she was smiling with this!! Then we had her celebration of life immediately afterwards. Now Amy is at peace where she so loved. Boy what emotions and thoughts went through my mind. I know she and Capt Joe were looking down from above with great joy. Thanks again to all who have been so supportive on this site and my prayers go out to all who need them from this ugly disease. I too, like Yan, would like to continue to update as my life adjusts and where I may be able to help some with our experience. Mark Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770302",
      "Title": "Finally at rest luvmywife irish22"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jun 22, 2011 12:30PM luvmywife wrote: The pallative Care is awsome. Those that can focus on your pain, is great. It wasn't offered to Amy until the end was near but that was when pain was worst. Just like all care, it takes complete envolement with care giver, patient, and PC team. The balance of pain med can be real tricky to allow quality of life vs 2nding up in \"outer space\". Everyone is different- so one dose of a med may be just fine for one person- and another person could put you in lala land. That being said, when my wife woke up in hospital one morning at 5 am and said- \"its a miracal- I have no pain\". \"Have you cured me- \". No we wern't cured- it was then that PC proved invaluable and I took amy home the very next day. That's awsome if you get that kind of attention! Best of luck Mark",
      "MessageIndex": 8,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770636",
      "Title": "Palliative/ supportive care K-Lo luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Dec 3, 2011 05:17PM luvmywife wrote: Cynsister- I am sorry for what sister is enduring. She sounds so strong like my wife. I just found your posts. My wife Amy, had very similar situation. (Now my Angel Amy). Amy also had horrible headaches. (Two small brain mets- too small for the severe pain) that's why they did the lumber puncture to determine source of pain. Yes, once they found it in spinal fluid, we to did the intrthecal- chemo to brain through an omaya port. We did one tx before Amy decided it was time to focus on getting rid of pain and coming home. Amy had diabetes where the decadron they gave her caused wild blood sugar flutcuations too. We had lung mets too. The dr's/nurses did a great job with pain mgnt and I had my Amy home for just 5 days. (Without the horrible pain). I hope your sisters treatment goes better than what we experienced. The headaches amy had were a 12 - 15 on scale of one to ten. I wish our experience were diifferent. My Amy never wanted to know the prognosis- she too wanted too fight with everything she had. That she did. God bless Mark",
      "MessageIndex": 9,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778588",
      "Title": "lumbar puncture and brain mets angelsister luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: My wife and best friend has just found spinal c cells in addition two two small brain mets and several small lung mets. Knock us right out of a perfect PARP trial. Our aggressive treatment will likely fight mets on two fronts- lung through chest port chemo and spinal through omaya (sp) resevoir through skull. To boot we're tripple negative. On plus side, I am married to one tough determined mother and grand ma of two beautiful grand girls. The 2 year old visited us in ICU today from complications from port installations. Any worrd of advice- encouragement? Thanks to all Amy and husband Mark Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766154",
      "Title": "Intrthecal chemo- to brain- any experience? luvmywife EnglishMajor"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: My name is Mark. I lost my beautiful wife, Amy, on April 5, this year. Orig diag in feb 2010, clean scan in sept after lumpectomy, chemo, radiation. Dr told us we would \"visit\" surgeon in 3 month and onc 3 month later for first mamogram. No scans in plan. We asked what about scans and he said- oh if it comes back, it'll rear its ugly head in some physical way. How often and what type of scans, if any, should dr's be doing knowing we had tripple neg BC with 3 positive LN's out of 11? In my wifes case, 3 months after last radiation, she started getting headaches. Got treated for sinus infection first, the ct scan to head- showed no sinus infection.(Or anything else) Sent to neurologist who tried migrain meds but she said emergency MRI given BC history. MRI showed two brain mets but neurologist, radiologist all felt spots were too small for headaches my wife was having. So while we do brain MRI- they do Chest Ct scan- just as precaution. We find 8 mets to her lungs with evidence of fluid in lungs and ultmately C cells in plural fluid around the lung. My wife had no pain or physical symptons from lung mets. None- and still no idea what is causing her headaches. They gave her Decadron- steroid to lesson pain in head even though spots didn't show size to warrent. Headaches reduced partially not substatially. But still severe headches continued and whole brain radiation was being reccommended. I/we kept searching additional opinions. Find a great Parp Trial at lumbardie and finally got approved from our ins carrier. In the interim, sought one more opinion (4 th) from UVA. Long and short, this Dr was adamant wife's brain spots were too small for pain she was having. He suggested a spinal tap asap. If C cells were present there, treatment options change significantly. Spinal results take up to a week. We were at Georgetown to begin baseline test for trial when we find out cancer was in spinal fluid as well. So in early Feb (2011) We found brain mets only because of headaches cause by unknown sources. We found lung mets from precautionary scans (no physical pain or symptoms), on our own- we kept trying to find real cause for the headaches. Our ins co would not cover outside opinions. Unfortunately, our extensive and quick search for advice revealed a very difficult situation. At every step of the way, my wife took each set back with brave courage and unrelenting desire to not let this crap \"take her\". She never wanted a prognosis. She knew the fight was getting tougher at each step but she would not let these setbacks deter her will to fight and not leave her family. On April 5, God got my angel. Just 40 days after the brain met diagnosis- only a couple weeks from discovering the Cancer in the spinal fluid. She was 53 yrs old. I got her home. She was out of pain finally, she passed holding my hand looking into my eyes. We had a beautiful church service for her with so many friends and loved ones. Her/our passion was Tarpon fishing in the Florida keys. She wanted me to spread her ashes in the same spot where our best friend Capt Joe johansen and fishing guide for the past 15 yrs (beginning on our honeymoon) was laid to rest 2 yrs ago (also from cancer). God, I loved this women, her loss has been very tough for me, I know she wants me to move on while keeping all the beautiful memories close to my heart. I am blessed to have a great son, DIL, and two grandbabies. Laying her ashes to rest where she so loved to fish with capt Joe will be one last part of this very difficult journey for our family. We will have a party after laying her ashes to rest. That's what she wanted. All that being said, you'll note I joined this site in feb and did a lot of reading and research. I used private messaging with several who have been too kind with advice and comforting thoughts. My thanks and prayers go out to creators and members of this site it has been very helpful during this battle, which continues beyond my wife's passing. I promised my wife her death would not be in vain. I constantly wonder why regular scans after her last radiation- treatment were not part of treatment plan. I've heard protocol, I have heard it doesn't significantly change survival rate? Prayers to all Mark and Amy from above Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769678",
      "Title": "Tribute to my Wife and BC.org and its members luvmywife Mazy1959"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Nov 29, 2011 09:12PM luvmywife wrote: Thanks to all. I was so truly lucky to have my life with Amy. I keep trying to turn all those memories into smiles- In time and more and more every day they are. Good news- we'll have grandbaby #3- a boy to go with 2 girls. You know- the beutiful simple innocense if these little ones is such good medicine. When they say love you grandpa- or even more special- love granma Amy! You just know there is still such \"special\" things worth fighting for One of those will forever be fight for those struck by this darn disease.",
      "MessageIndex": 13,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778697",
      "Title": "Will it ever stop? luvmywife luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Dec 3, 2011 08:04PM luvmywife wrote: Steph- I would have traded spots with Amy in a heartbeat. But I am sure Amy wouldn't let me either. That was not in Gods plans. Amy did finally said if I could get her home without pain- that would be a fight worth living for. Then two - three days later after focusing on the pain and nausea- she woke up at 5 am and said Mark- Mark- its a miracle- I have no pain- have you cured me- no honey but we can go home now. She's home now. Stay strong for your Cyn! Cherrish those talks- you will always have them in your mind forever- Mark",
      "MessageIndex": 11,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778588",
      "Title": "lumbar puncture and brain mets angelsister luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Feb 13, 2012 02:07PM luvmywife wrote: Chainsawz- I am so sorry. You have been so supportive to so many. I am going to check in with my Amy up Above and we'll be working that special angle for your health. Prayers for sure. Big ole hugs from us. Mark",
      "MessageIndex": 120,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Dec 30, 2011 02:52PM luvmywife wrote: God bless you and your sister. Let's pray the pain goes away and your sister can make it home. When my Amy's pain went away, she was home in a day- I pray you and your sis have peace- no matter where you are. So tough- you are certainly not alone Mark",
      "MessageIndex": 33,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780030",
      "Title": "the next stage angelsister chrissyb"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: As many of you know, I lost my beautiful Amy to this disease in April. In June, I spread this wonderful women's ashes in the warm waters of the fla keys next to Capt Joe- also victem to cancer two years ago. Where we loved to fish. I am back in Fla for Thanksgiving to visit Amy and Capt Joe, his (Joe's) wife who we lost last year to brain tumor. For years we deep fried a turkey- Amy, Joe, his wife and kids next to the water. This year I visited Amy, joe, jane- by boat- Thanksgiving morning and prayed, cried, played Amy's and my wedding song and came back to begin honoring all of them by deep frying another turkey with capt Joe and Jane's Son! He lost both his mom and dad in under two yrs. Then What- I get the call that Amy's nephew's wife- all of thirty six- is now terminal with a ten year old son (ate up with this crap). Amy's brother and I shared these tears this morning after I lost my beloved wife and Tom- his sister only in April. I had such a beautiful Thanksgiving trying keep old loving traditions going- only to be reminded one more time just how unforgiving, ruthless, and widespread this disease is. Bless you all- Mark Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778697",
      "Title": "Will it ever stop? luvmywife luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jul 9, 2011 09:42AM luvmywife wrote: Thanks all, yesterday would have been Amy's and my 16 aniversary- I only wished her a happy anniversary 100 times. The first group went awsome on Thursday night. It is comprised of all surviving spouses! So many feelings we all had in common. 8 weeks of this should be very helpful.",
      "MessageIndex": 14,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771179",
      "Title": "Support Groups? luvmywife dhmeiser"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "May 30, 2011 02:52PM luvmywife wrote: This site has given me information and comfort wth the bave folks facing this nasty disease. The ability to communicate through the Private messages vehicle to develope a few close friendships that have bee so suppotive has been invaluable. The support and info, I used and coomunicated with my wife who in feb (when I joined) till she passed on Apri 5th. I continue to follow this site hoping what my wife and I learned could help someone else. Mark",
      "MessageIndex": 85,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747824",
      "Title": "Please share how breastcancer.org has impacted you.... Moderators BouncingBetties"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: This site is one heck of a support group. When my Amy was disgnosed with stage iv TN, we discussed taking part in a support group but given the severity of our situation, we were our own support group- me and her. No time to follow through. Boy what a leader of our little group Amy was!! This week is a perfect storm for me and my family. The 4th of July was a special beach week every year for us and our family! Tonight she and I would surely be hoisting a few coors light. Tomorrow, will be 3 months since Amy became an Angel. July 8th, this week would have been our 16th wedding aniversary. I have so much to be thankful for have her for the time we shared. I have found myself missing my beautiful Amy more and more each day. The \"experts\" have told me this is normal. This week, I will start a six week group for those who have lost their spouse. I wake every day thanking g-d for the blessing of the special years we had together. Everyone here is such an inspiration and I pray every day- a new angel doesn't appear or a new person doesn't join this special group. Sorry to be a bit of a downer tonight but the flashes of fireworks outside remind me of those beautiful sparkles in Amy's eyes I saw every day for 18 yrs. Mark Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771179",
      "Title": "Support Groups? luvmywife dhmeiser"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: I thought I would check in. On Monday this week my Amy was 6 months an Angel. She fell to TNBC. I so appreciated the kindness I found here both while she was sick and after she left this world. Thanks We were so blessed to have each other for 18 yrs- 15 of those married. We worked and played and shared so many wonderful times together. We were blessed with two beautiful grandbabies before she left us and a third is now on the way. Amy bought a swingset for these little girls- which didn't arrive until after Amy passed. Yet, now when the 2 and a half year old swings and asks me to push her higher, she points to the heavens and says \"thank you ma ma Amy- I love you\". Boy that sure touches me in so many ways. I've been blessed to still have family. It's been tough- I miss her greatly. I did a group grief counseling with others who lost their spouses. It was helpful to meet others going through similar feelings. I take things one day at a time. Then a new challenge! One of Amy's and my friends, only 34, emailed me with news that she had just been dx with the same TNBC that struck my Amy. I was stunned but felt maybe I could help her through this journey. She is proudly wearing all of my Amy's scarfs, hats, night caps with pride. She brings Amy's photo to Chemo in her Chemo Bag. I am so thankfull that Amy's and my experience has allowed me to help somehow make this scary journey a bit \"less scary\". As we all know- this journey is tough - I just know my Angel Amy is by our friend side. She's doing well, been through 6 chemos thus far. 2 to go. Then radiation and then surgery. Her tumor is shrinking and she called me \"tearfully\" when her dr said he's having a tough time finding it!! I pray that with her youth and strength and help from above- she'll have a long healthy life! Thanks for letting me come back and share my journey. The kindness here is very special. Mark Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776143",
      "Title": "My Amy- 6 months an Angel luvmywife MJLToday"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jun 17, 2012 12:56PM luvmywife wrote: I just happened to see this post. At the very beginning of my wifes dx- I found this site. During her battle- what great help and advice I/we found here (on this site) to begin our stage IV fight. Unfortunately, it only lasted 40 days from her dx as Stage IV, After she became an Angel- same awesome support from this site. Thanks from the bottom of my heart. even today- As a husband of an Angel- for me- my wife Amy was my best source for \"talk\" or assurance that this fight was \"our fight together\". Most of the time it was not words said- but those not said that provided the strength for both of us. We just \"knew\". Next to her- it was her brothers, my own brother and some close friends and coworkers. I didn't have to seek the ones to share with-(when I needed support) they were there for me when I needed it and I knew it. They made theselves available- I knew they were there for me. There is a tougher part to this fight, or at least in my situation. The hardest part was those family members who for some reason seemed to hold me responsipble for the pain my wife was suffering- this was the most difficult part of this fight- even to this day. To them- it was something I did or didn't do causing my wifes pain. What ever decision Amy and I made- was hers first with my advice and complete support. Every descision we made for her treatment was always hers- but I gave her every darn bit of information I could gather. Its so difficult to think and make descisions when you are so tired and feeling so lousy. Together we did our best to make informed descisions together. Yet as hard as it was for me to believe- some family members seemed to/wanted to hold me responsible in some way responsible for the suffering my wife and best friend was going through. It was the doctor we chose, the treatment she had, the .... Top it off- how about a family member steeling checks and forging them from their dieing sister. Cashing them the day she passed, the day after and up to a month after. I am doing well with my grief. My Angel is there for me every day and so are those who were there during the fight. I will always miss my Angel but I know she's safe. We made a deal- I will share this with you all!! When we knew we were not going to be together on this earth for much longer, Amy said to me- \"someone will live because of what I am going through.\" There is a reason I am taking so many hits ! \"Everything happens for a reason\" she would say. She took one hit after the other. As we were just approved for a trial at Georgetown Univ she said - maybe just maybe as I go through this medical trial- (never to happen as the two days later we found the cancer in her spine) some women will live!! You here on earth \"honey\", me in heaven, promise me- together we will not let this fight be in vain. Others will live because of what we are enduring!! Everything happens for a reason!! I love you and always will. Don't be sad!! Amy said... \"This too will pass\" Deal! Deal! As we both knew what was to come- yet never wanted to really acknowledge we were loosing our place together here on earth. We had important things yet left to do- me here on earth- her with God in heaven. The miracles began and still continue!! Hope this story helps! We all deal with this battle differently- God bless",
      "MessageIndex": 16,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788878",
      "Title": "Who does your significant other talk to about all this crap? lynne248 eric95us"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Oct 28, 2011 11:36AM luvmywife wrote: Great idea - so many beautiful reasons to get the flaslight out. Last Sunday, I visited my beautiful Angel Amy's resting spot in the waters of the Fla keys. It was so hard being there for the first time since we laid her to rest in June. As I approached the spot by boat, I could feel her love and kindness- also (same spot as our capt joe friend). I shut down the engine- and the wind blew a beautiful peacefulness. Yet my tears flowed as this disease has effected so many- efected so many lives... I am going back at Thanksgiving which Amy and I shared so many thanks together for 18 yrs. I'll get my flashlight out on saturday with you all in honor of all who have fallen to this horrible curse. If its ok, next Wednsday would have been Amy's Birthday. I think I'll send that light up again Wed night to let her know how much I still love and miss her!",
      "MessageIndex": 55,
      "PostDate": "28/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759846",
      "Title": "Pinktober: It's Not Over 'Til We Say It's Over... EnglishMajor cookie97"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jan 13, 2012 02:21PM luvmywife wrote: Dave, Very beautiful! Your kimberly sounds so special. May peace be with you and your family. Mark and my Angel Amy from above",
      "MessageIndex": 39,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780774",
      "Title": "Kimberly Obituary dhmeiser bdavis"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jan 30, 2013 09:51PM luvmywife wrote: Thanks All, Thanks so much.. So much love and support here- I was so blessed to have had a love that will truly live on forever. Yes her spirit contiues to live on and bless so many. She vowed that from her situation- others may just win this battle. I know that magic is working every day! I believe that through this painful experience we learned so much. Some how, what we learned may just be a comfort to someone else no matter if just beginning or contiuing this fight. Its not all about $. Yes that may help but.... I'll never forget one thing I learned to ask Amy every day- it wasn't how do you feel?- it was \"what do you feel?\". Keep the faith-",
      "MessageIndex": 9,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799656",
      "Title": "Its been a while...wth? luvmywife luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jun 25, 2011 10:26AM luvmywife wrote: Jen: My wife's best friend was celexa. It realy helped from first diagniosis to the final days. Absolutly, talk to your dr. My dr has given me xanax during this stressfull time. It allow me to function. Stres will also do you great harm over time. s",
      "MessageIndex": 25,
      "PostDate": "25/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770703",
      "Title": "How to stay more even .. anxiety meds? JeninMichigan jenn3"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: I hope I am not stepping where I shouldn't after almost two yrs- (this coming April 5th) loosing my beautiful Angel Amy. In short, NNN BC took her to heaven. She was and always will be a true example of true love and inspiration. She was and always be my best friend. For those who supported us and helped me/us with information, love, compassion-I /we will forever be greatfull. Thank you. Tonight I got a call for a donation for bc research. I said I had just given and they said- no you haven't. That must have been another group. I said- ok. Then they passed me on to the \"verifyer\". Something told me ask \"how Much is going to this cause\"?? She said we guarentee 10%. I was so upset. I told them, forget it, no way, don't call me back. Then I thought- check back with those who really care and ask nothing in return other than honesty and care. You wonder how many scams are out there! As I listened to the story they tell- then I tell them I lost my wife to bc- then you (I) was easy pickin. They knew, some list, I had given $ before. Something told me to ask!? It was silence when she told me at least 10%. So I came back here to say- thank you for the advice and emotional support and comfort both while Amy and I fought this horrible disease and after she had become an Angel. I know she still blesses this earth with her will to love and help those she can who continue to have this darn disease. God bless Mark Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799656",
      "Title": "Its been a while...wth? luvmywife luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: This is hard for me. This coming Saturday it will be three years t that my Amy became an angel.  But we received so much love and support from the site I couldn't help but to say hello and thank you and send my prayers your way. I can tell you all this , my Amy is looking down and doing everything she can help anybody affected by this horrible disease My Prayers go out to each and every one  of you going through and dealing with this horrible disease.  Big hello to those of you who may remember me and Amy.  For those of you who don't know Amy and I, triple negative breast cancer took my baby to become an Angel after 14 months after her diagnosis. She was one strong woman through it all.  She told me at one point,if  this fight I'm going through would help just one woman's life, it would all be worth it.  She loved to fish with me and worked with me. She lived life with all the spunk and spirit she had the day I married her 15 years earlier. When she went to heaven, we had two beautiful grandbaby girls that she got to see.  Just two days before her second year as an angel, a beautiful grandbaby boy was born. Our son said he had no idea how that happened!  There's some very powerful forces from up there to down here!!!  Thank you for letting me share these thought with you all.  I will be visiting Amy's spot in the waters off the Florida Keys next Saturday playing our wedding song.  I know she will be smiling and grinning like she always did here on earth! Mark Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819682",
      "Title": "Checking in! luvmywife ibcmets"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jan 12, 2012 07:06PM luvmywife wrote: That's what I/we love to hear. Way to go!! Mark and my beautiful Angel Amy from above!",
      "MessageIndex": 79,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780879",
      "Title": "Survivor Guilt - I am a lucky girl Fitztwins nancyh"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "May 29, 2011 05:19AM luvmywife wrote: Great advice for checking that site for this trial and so many more. With alll due respect, my wife's dr didn't know about a perfect trial for my wife and even told us we were aPprove for a trial- only to find out (when I contacted the trial administers personnally). he trial perameters had change the week before he told us we were alrealy approved. Do all you can for yourself if you can!! Make dr's scan regularly. Unfortunately, god took my angel from me in april. I promised my wife to try to help all I can in their fight to beat this ugly disease.",
      "MessageIndex": 1,
      "PostDate": "29/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769594",
      "Title": "results of Vaccine trail ma111 ma111"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Jul 4, 2011 06:44PM luvmywife wrote: Welcome Amy, I too want to tell you welcome. I am one of those husbands. My lovely wife's name is Amy and as soon as I saw your name, I had to say welcome- ask anything and everything and use the experience of all who love each other hear. My Amy will help you from heaven and believe me she will. Use the Private Message too when you need too. Happy 4th Mark",
      "MessageIndex": 11,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771165",
      "Title": "Hi, I'm new... ameliak steelrose"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Dec 3, 2011 08:21AM luvmywife wrote: Wow- my wife, now an Angel faced a similar choice. We had only two small spots in brain. One deep one on out side of cerebellum. At first- dr's advised cyber knife. Then they found it in her lungs- and said wbr. Yet I found other dr's saying zap the few spots with Cyber knife and monitor. That was before they found it in her spine as well. Perhaps an MRI is in order- if there is no evidence of mets elsewhere- monitor may be an option. I felt our onc had no interest in the monitor option as that requires regular MRI's which is expensive. That's just from our experience. One dr said wbr and another said, without multiple brain mets, go with cyber knife and monitor. In our case- with lung mets and finally spinal fluid mets- our choices were then reduced to chemo to brain through omaya port. I am so sorry you are facing this choice. Ultimately, its thhe patients choice. God bless",
      "MessageIndex": 10,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778775",
      "Title": "WBR or wait and watch..!!! bestfriend05 luvmywife"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Feb 20, 2011 09:32PM luvmywife wrote: Thanks so much for responding. God knows- my wife Amy and I have very lttle time to make the right descision for our Son and two beautiful gand girls and most of all- my wife. Whatever thoughs- medically or spiritually backed are welcome.",
      "MessageIndex": 7,
      "PostDate": "20/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765127",
      "Title": "tripple negative brain and lung METS luvmywife chainsawz"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "Feb 20, 2011 09:47AM luvmywife wrote: Thanks Chainsawz- when you had your two brain METs did you have lung mets at same time? Because we have active METS elsewhere there is a concern their may be unseen cells in the brain that we should probably do the whole brain radiation. Our brain mets are \"very small\". In fact so small- the neuro-oncologist/surgeons did not think my wifes headaches were causing the headaches. Only when one onconogist gave amy decodron and headachs lessened did we all get on same page that spots were at least contributing to headachs. When you refer to SRS- are you referring to cyber knife.",
      "MessageIndex": 4,
      "PostDate": "20/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765127",
      "Title": "tripple negative brain and lung METS luvmywife chainsawz"
    },
    {
      "AuthorID": "luvmywife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122992/profile",
      "Content": "luvmywife wrote: Finished chemo and radiation last fall after initial diagnosis. Began having bad headaches. We have two small spots on brain and spots on lung positive for BC METS. Anyone been through brain radiation/cyberknife- chemo for tripple negative METS to lung? Thoughts? suggestions? Advice? Needless to say- very concerned. And have several opinions being sought! Dx 2/14/2011, DCIS, Stage IV, 3/11 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765127",
      "Title": "tripple negative brain and lung METS luvmywife chainsawz"
    }
  ]
}