{
  "AuthorID": "LuvMy2Boys",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59355/profile",
  "Posts": [
    {
      "AuthorID": "LuvMy2Boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59355/profile",
      "Content": "LuvMy2Boys wrote: Hi again all! I have my lumpectomy/biopsy scheduled for Tuesday and I am so excited to have this journey over with!! My lump is expected to be a fibroadenoma which is great! My question is... I have been having some discomfort on the side of the affected breast and it seems to be that my lymph node is swollen and sore. Is it possible that I would feel the lymph nodes or could that be some infection? It progresses during the day and by the end of the day I can't wait to get my bra off!! :o) My doctor noticed some swelling during my pre-op on Monday but it wasn't there when I had my sonogram last month.   Thanks! Elaine Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696512",
      "Title": "lymph nodes question LuvMy2Boys Vannette"
    },
    {
      "AuthorID": "LuvMy2Boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59355/profile",
      "Content": "Dec 7, 2007 09:26PM LuvMy2Boys wrote: Hi irishsteph! I am having my lump removed and biopsied on Dec 11th, so I am right in your boat. I am 33 and this is my first lump. I am trying to stay calm, but the closer it gets the more worried I become. The worst part is, like you, I hate to talk about it to family and friends because ever since I was a teenager I have been joking that I had this kind of cancer or that kind of cancer any time I had an ache or pain. (As a kid you say stupid things...) Well, now my family is joking with me that I was right. Not so funny now! Well, good luck with it all. I will pray that we are both benign!! Elaine",
      "MessageIndex": 33,
      "PostDate": "07/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696300",
      "Title": "so scared irishsteph blackbird"
    }
  ]
}