{
  "AuthorID": "luvmygoats",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
  "Posts": [
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 14, 2012 03:42AM luvmygoats wrote: Kelly - I used Domeboro for just a short while 1 or 2 soaks. Mine was not too open/raw. I think the Silvadene is the best of the bunch though my RO was keen for the Domeboro. Silvadene antibacterial/soothing. Careful it can stain, skin who cares at this point comfort matters but your clothing might be different. Aquaphor as well though it is harder to spread on inflamed tissue. I'm sure someone else will chime in who had similar problems. Your RO sounds less than sympathetic and not sure what your \"less than healthy ways\" has to do with radiation. Even if you were an enthusiastic tanner under your arm is not where most people tan. Boosts will be directed to the scar so underarm will be spared. Tolerated boosts with no problem. Board just getting more active this evening after being quiet during the day. Hoping someone else jumps on board. Keep us informed. BCO is the best!!!  I care and so will others here.",
      "MessageIndex": 156,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 11, 2013 09:46PM luvmygoats wrote: Hey ladies - read this but very rarely respond.  One lady from our old group last year used very soft pieces of flannel under her rad breast to minimize that skin to skin contact.  She did very well.  I did sometimes use DH's hankies he never used.  Just threw them in a lingerie wash bag with bras.  I used Aquaphor, prescription cream (can't remember the name, made for radiation burns) and after tx used baby calendula cream from Target.  I did get a bit of a nip burn and used Domeboro soaks on it for a couple of days during the evening per RO. I have 3 tats but also had sharpie markings with sticky tabs for the weekly realignments. I bought cheap cami's and sports bras from Walmart.  Even the Aquaphor washed out well. Hope these suggestions help some.  Best of luck to all you ladies (and any guys that happen to be reading but not posting).",
      "MessageIndex": 230,
      "PostDate": "11/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 15, 2013 09:17AM luvmygoats wrote: Cindy - that is about the length of my zaps, too.  I got to where I would count so I would know when it was switching angles.  This link was great when I found it.  My RO was not the best at explaining this but this did the trick. http://www.breastcancer.org/treatment/radiation/types/ext",
      "MessageIndex": 236,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Sep 11, 2013 06:53PM luvmygoats wrote: JJ - I just keep my favorites tab open and refresh periodically. But Cindy is right about notifications/email. It might come off the Dashboard function. The box in upper L corner has it. Have you tried Aquaphor from the drugstore? Greasy but I learned to love it. I worked thru rads so had to wear a bra. I used a sports bra because the looser things rubbed more. The Aquaphor washed out very well; I still use the bras on occasion, none the worse for all the grease. I think I slept in a cami under my nightgown. I know I wore them under my scrubs. I thankfully had a female RO who was very sympathetic. Loved her. I had a weekly meet up with her and she or another RO was always available for consult as was the nurse. Cindy is right - the squeaky wheel gets the grease. Maybe the rads techs can advocate for you. Try on some phrases for size to use with your RO - like a practice run. I'm not so good at standing up for myself and find this helps tremendously. I've even written out talking points like a script - for myself of course. The more you say things the easier they get to say. Sounds like you're almost done. Do know that your symptoms will continue and may get worse up to 2 weeks post rads - at least that's the time I was quoted. Just like it takes time to build up it takes just as much time to go away. Not sure if they told you this and much better to know than think well OK, rads are done why the heck am I hurting/itching/etc. more.",
      "MessageIndex": 375,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 3, 2013 07:29PM luvmygoats wrote: I bought front closure Fruit of the Loom sports bras from WalMart. Those things are amazing. All the creams from rads just washed right out of them. I wore them 24 hours a day for months. Had no drains. Heard of pinning them to a lanyard. No tight bandaging either. Sent home in a very unsuitable bra provided by hospital. Thank goodness I'd already bought my own. I wore the sports bras to work not the most attractive look but then I wore scrubs. Had 2 \"better\" bras for church wear but went right home and put back on sports bras. Found the best way to put on front closure bras is to put them on like a vest. I would suggest putting a few of your dishes down low esp. if you will be alone during the day. I had trouble reaching up, even with good side but then I'm short. I got constipated and for goodness sakes I'm a nurse. I got DH to get me Senokot but Colace as Ruth suggests is great, too. Constipation is sneaky and by the time you realize you have it it well on its way to very uncomfortable. Yes, definite divot but I was happy did not have to back in to have margins redone. Divot has filled in underneath breast some with nice ugly stretch marks. Not so much on the side. I put small pillow under seatbelt on ride home but remember only bits of the ride. I did buy a sheepskin seat belt cover since mine on L side and still use. Button up front shirt and pull on pants. I still wear the flannel shirts I bought at Goodwill. I sat around for a couple of hours in pre-op little cubicle (tiniest room ever) and kept my pants and shoes on even to trips to nuclear med and for wire loc in mammo. dept. I did pack an overnight bag just in case per my BS instructions. SafiAnnie - time is the best healer for that SNB pain/creepy crawly feeling.",
      "MessageIndex": 14,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/804030",
      "Title": "Lumpectomy: Your tips for preparation & recovery? CassDugan carol57"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 5, 2012 03:25PM luvmygoats wrote: I don't know your answer but try BCBS anyway.  Found them open at 7:30 in the am.  Surprise.",
      "MessageIndex": 1,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/783688",
      "Title": "any insurance experts out there? onvacation onvacation"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Apr 11, 2016 08:57AM luvmygoats wrote: On the Hormonal Thread about taking AIs for 10 years the comment was made from a very knowledgeable contributor that specimens are held for 10 years as lekker found with her polyp held 12 years. Just thought I'd throw that in for general consideration since I did not know that.",
      "MessageIndex": 15,
      "PostDate": "11/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/843233",
      "Title": "Ki67 testing and BC risk momoschki MelissaDallas"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 2, 2013 06:16PM luvmygoats wrote: I would highly recommend Texas Oncology. They have a HEB branch. I live NW of Ft. Worth and was treated by Dr. Kathleen Shide at the office on 8th Avenue in Ft. Worth. A friend also used Dr. Harold Freeman but I think he is just at Harris SW way far away from Keller.  My MO is also at Texas Oncology. I have been very pleased with my care there.  Actually, after looking, they have several offices out in the HEB area. There is also a Texas group on here, not very active.  Just called \"Texas\" under forum of \"Get Togethers\". Might try on that too.  Best of luck to your aunt.",
      "MessageIndex": 1,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798306",
      "Title": "Anyone have a recommendation for a RO in Dallas/Ft.Worth area? Audrella ladyboss1997"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 4, 2012 06:06PM luvmygoats wrote: Thanks Kaara - I haven't met with my MO yet. Kinda know him/of him from working at same hospital 2 years ago.  Actually how I picked him from about 5 in area.  Told he is participant in tumor boards at local hospitals x 2.   No, no chemo without darned good reasons/expectations from him.  DH already much against it.  So will be one of the 1st questions I ask him Friday.   Now rads I am certainly expecting and as prepared for at this early state as I can be with much thanks to lots of time surfing the boards here.  As most have written already the waiting game is the worst.  And I need to go back to work soon.  To call BS on Wednesday to report in and hoping for 1/2 days as of 3/12. Thanks Sheila for the welcome.  Will visit Middle Aged Thread too.",
      "MessageIndex": 11783,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 17, 2016 03:05PM luvmygoats wrote: My patient portal does not post xray or scan results. Only lab tests. And this is for a large statewide onco group. Not sure why and never asked. Well, I'm sure my MO would have some flippant answer, prob. why I've never asked. And yes good to question MO on when they will call and what parameters they will call about.",
      "MessageIndex": 6,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/840348",
      "Title": "I'm \"afraid\" of my patient portal LifeAloft luvmygoats"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jun 24, 2012 11:31AM luvmygoats wrote: Lettie - I can't remember the exact reason for the sports bra but support is the aim.  My BS had no particular recommendations.  She referred me to the boutique at the breast center.  Not!!  I may go by there when I have my followup in July but tata is not it's normal size/feel so I think it's useless to spend much money now on something like professional fitting/prothesis if I ever even get that far.  I could not fasten a bra in back for weeks.  Yes, I wanted my cleavage to air out but the support felt much better.  I slept in a bra for at least a few weeks.  Jiggle of any kind was uncomfortable.  My old bras were (note were) all underwires and still cannot wear 'cause you know where the underwire hits.  Just went shopping for soft bras Friday. Hope this helps.  Have you gotten your path report yet?",
      "MessageIndex": 34,
      "PostDate": "24/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789227",
      "Title": "Overwhelmed Lettiegonz LittleMelons"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Aug 30, 2014 10:41PM luvmygoats wrote: Late jumping in. Now this was 2 years ago so not sure if they still have them. I bought front opening bras from WalMart. They washed beautifully and I wore them after my lumpectomy and during rads. Not expensive. I think these are the same ones SpecialK means. The seams were flat so no rubbing. More on the looks of a leisure bra; not a racer back. If you buy more than one try them on. I found that some I bought did not fit as well - even being the same size/style. More choices if you are smaller breasted. Like you I never slept in a bra - only when I was breastfeeding my one child. I felt much more comfortable somewhat smooshed than jiggly. I only had steri strips and a small bandage, no ace wrap. My biopsy was a spur of the moment after a repeat mammo so no planning on my part. Went on to work with the help of some Tylenol. Wishing you an easy time on Wednesday.",
      "MessageIndex": 9,
      "PostDate": "30/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/824084",
      "Title": "Post-biopsy care Hopeful82014 Hopeful82014"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jun 19, 2012 07:58AM luvmygoats wrote: Lorio - Yeah.  Sherree at Baylor All Saints.  I get a little letdown on the Fridays I don't get one.",
      "MessageIndex": 22,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789227",
      "Title": "Overwhelmed Lettiegonz LittleMelons"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jun 17, 2012 06:37PM luvmygoats wrote: Lettie - I would get that report as well as the final surgical path report.  Have seen some on here say they found differences.  I looked at my 2 today and they are essentially the same but each reported a little differently.  Used to be you had to drag reports/lab out of doctors.  They found out it was much smarter to give you your reports up front.  I wish I had the operative report just for the heck of it.  You might ask if the hospital has a breast health navigator or ask around to see if there is one at a close by hospital.  I don't think you need to be an active patient at the facility but I could be wrong about that.  If I had had much more done (chemo, mastectomy) I would have relied much more on her.  I get a comforting, cheery, encouraging email from her nearly every Friday. You will most likely be sleepy even without pain meds when you get home.  I don't remember much about the trip home (1 hour for me) or much about that night.  I could not pull the covers over me; DH had to do that.  If your daughter could stay with you or go to her house at least for 1 night I would think that would be good.  Then again I'm sure there are plenty of others who do go it alone from day one.  Slept OK.  Took my 1/2 Norco about twice/day for a few days.  I'm a wimp for pain.  I had no bandages or drains.  Surgical glue on both sites.  Some have steri strips.  Observe the site or bandages when you get the first chance.  That way you will know if there are any changes - that's the nurse in me. LE - you can get with just a few nodes removed but less likely.  My BS gave me no exercies or things forbidden to do.  I could not and would not raise my surg. arm over my head; too painful.  Had followup one week later.  I had driving restrictions for 2 weeks and I believe that is probably excessive.  I do drive all day for my job and was off nearly 3 weeks and then went back 1/2 time for a week. I'm a hospice nurse so see pts all around town.  She was concerned about my safety if I needed to make quick corrections.  You will have restrictions on how much you can lift, can't remember if 5#. Hope you have had a good day today.  Best of luck tomorrow.",
      "MessageIndex": 13,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789227",
      "Title": "Overwhelmed Lettiegonz LittleMelons"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jun 17, 2012 08:31AM luvmygoats wrote: Lettiegonz - I second reading the pre-surgery list.  I only found BCO after my lumpectomy (LX) while on medical leave.  You probably will go home after surgery but my BS said to plan as if I had to stay overnight; I went home that afternoon.  Shop now for things that are easy to get on.  It will be hard to get things over your head.  I had surg. during winter so shopped for button up front flannel shirts.  Might be easier with stretchy summery tops.  Goodwill/thrift stores are my choice.  Go thru your closet and pretend you can't straighten out your surgical side arm. My BS (there is a list on the main BCO pages of abbreviations) had no particular recommendations about bras.  I bought front fasten sport bras (fruit of the loom) at Walmart and still wearing them.  Not the most flattering look as they smoosh everything but jiggle is still not comfortable (42-44D). It took a long time before I could fasten in back and still cannot wear any of my old bras as they hit right at SNB site. One thing I read only in a few places the blue dye will turn your chest blue and you will urinate blue for a day or 2.  Perfectly normal.  Some BS don't use the dye only the nuclear scan injection.  Mine used both.  Yes, the inj. for the scan hurt some.  Endurable, very short took my breath away but just for a second.  Read there is a numbing cream but some BS won't use it and I can't remember why.  I didn't know of such stuff so just went with what was done to me, not a rant just the way it occurred. Have things you might need placed low for you.  Get comfy perch on couch, recliner ready.  Stock up on things you like to eat/drink ahead of time.  No problem with appetite next day.  Surg. day I ate light.  Watch out for constipation esp. if taking pain meds..  Took me by surprise and I'm a nurse.  Over the counter laxatives.  Prunes, raisins, whole wheat foods, regular cook-kind oatmeal.   Go slow on sodas as gas adds to const. misery. I still have pain in site, but just finished radiation.  Take an occas. 1/2 Norco. My BS does not do frozen sections so she just took 3 nodes knowing I might face additional surg. if they were positive or if she didn't get clean margins 1st time.  My sono. showed no nodal enlargement so she thought there would be no involvment which there wasn't and got clean margins.  She got close on one side of the tumor but then made an additional cut which cleared it well.  Yours is pretty small, too, at 1 cm.  The size will prob. change with the final report so don't be surprised. Let us know how your surgery goes.  Read the pre-surgery list.  I think that list was for a mastectomy so very extensive and she was traveling to have it done.  But it will certainly give you plans.  AND it will give you something to occupy yourself with today.  I found my BS was not good at what we nurses call anticipatory guidance. About the type it will take a few days for the complete path report.  And yes get copies of everything.  Your path report is already partially filled in from your biopsy.  Your BS has that and, I'll say this gently, should have informed you of what he/she knows already.  I do know final DX can change as the surgical path report is much more detailed. Ask away.  I'll mark this as favorite and check back after church. TTYL I wish I had known about BCO before my surgery!",
      "MessageIndex": 8,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789227",
      "Title": "Overwhelmed Lettiegonz LittleMelons"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 21, 2013 02:15PM luvmygoats wrote: Oh, Dakota, I agree, you look adorable in your short wig.  Hope pest exterminator gets back to you soon; sorry she cancelled on you.  So sorry with question about working in the school.  I guess because he is IN the school you would prefer not to go back there.  Just thought it might help with school schedules.  Hope you have other support nearby but sounds like you must since you're going for big girl sleepover.  WOOHOO!  You getting the storm?  We had sleet, sleet, rain yesterday, thunderstorms this morning but not severe.  Lovely afternoon. I see \"Tim Hortons\" as sponsor on hockey games. Know I know what they sell.  OK, what is a \"roll up the rim\" cup?  Only coffeeplaces much here are Starbucks.  Only know of 1 Duncan Donuts.  I want a milk frother but don't know why.  Only have plain old coffeemaker and DH not big coffee drinker.  Guess I need to get more squirt whipped cream. Caitlin, in your pocket for #2.  What # is Carla on? Get to go with DH to his eye doctor appt tomorrow.  Then shopping at Lowes.  Need new paint for den - white of some variation but not the stark white the remodeler painted it 10 years ago.  Would love to redo BRs as Edi, but don't think in budget.  Might could piecemeal but don't think DH would handle torn up BR forever. This is a transition year for us to see what we can afford.  DH has put in for early retirement which might be good as fearful his hours will be cut in the fall to part-time with Obamacare. Websister - Hope rads went smoothly for 1st day. Nihahi - Alien boob behaving today? Traii - My DD loved penguins so much she declared she was going to be a scientist in Antarctica.  We went to San Antonio to Sea World to see them.  Then for several years the Ft. Worth zoo had a penguin exhibit.  We bought a yearly pass and would go after school even for just a little bit.  Think they still have 1-2 for special programs.  We had every penguin program that came on saved on tape. As usual I know I missed lots of members.  Hope all are having a good SE free day.  One year anniversary of my surgery.",
      "MessageIndex": 2394,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 26, 2013 08:21AM luvmygoats wrote: Edi - Good to get #6 done.  Are you done with chemo land?  I'm thinking not yet.  Hope you talk DH into dancing again.  And loo almost done; new place of refuge.  We have started some on house.  Found shutters on sale last week so DH getting to replace the rotting ones; decorative only but house front too plain to leave them off.  Painting next. Traii - Great that bloods were good.  Don't know about lymphocytes. Ready for a pocket party.  WOOHOO.  My polish colors are pretty bland compared to Nihahi's.  Snacks ready too.  We will celebrate big time!!! Dakota - Good luck with cockroach.  At least you are not in same school with D(not)H.  My husband's niece is an echo tech in  western KY.  She's done it for a long time, one of the first in the hospital there.  She must be about 50. Websister - so today must be rads 4???  Gosh, rads class.  We did not have such a thing and I went to a very large cancer center.  They did, of course, have a chemo class I saw on the schedule.  And what about that paying to park?  Even when I go to breast center for mammo I get a sticker to skip paying. Nihahi  - How's the alien behaving? Off to internist today, what we use for a GP.  Glaucoma doc tomorrow.  Went to big city Friday and Sat. last week.  Went Fri. with DH to his eye doc appt and shopping for those shutters.  Sat. I took him to work and shopped (well a lot of road time to get where I wanted to go), then picked him up and went out with friends for great Mex. food.  Made for a long day.  Can't wait for Thur. when I don't have to be anywhere. Welcome Moviemaniac - Sounds like you've had a rough go.  Hope the cough syrup and Mucinex is holding your cough at bay. Caitlin, Carla, Liefie Luv, Foxey, Keemo, Bevlee, Bearcub and all other I have missed a shout out for a good Tuesday.  Off to ladies Bible study in OH!! 40 minutes.  Better get my you know what up and moving.  Then off to doc. Benny, WHERE ARE YOU?  Thinking of you lots and hope you are busy in a good busy way.",
      "MessageIndex": 2497,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 5, 2013 09:40AM luvmygoats wrote: I'm here.  Hibernating with a nasty cold.  Haven't been sick in over a year (well, not counting BC).  Seems I read and want to post but just don't. Traii - I get all confused on times.  I think it must be about 3:30 am your time so I guess your last chemo is done.  WOOHOO.  OK I admit I had to cheat and look at a world time clock.  Hope date for surgery doesn't get changed.  So Liefie is getting TE's exchanged.  I forget what you are having. Sheryl - Your last chemo is wow, like next week.  Congratulations. Liefie - sorry about the sore back.  Hope you get back to your yoga soon.  Love living in the country but so far to get to anything.  My cancer center has yoga on Tuesday nights 6 pm but it's prob. like an hour drive that time of day.  We have a fitness center in town but I don't think they do anything specialized, just equipment.  And I am a SLOTH.  No sense paying money for something I would prob. never make myself get up and do. Websister - Love your new avatar.  I have read part way through your blog up through the early part of this year.  You and Liefie need to get together and write something.  How is your mom doing?  Sorry, have lost count but you must be more than 1/2 way thru rads. Dakota - Hope the new crazy is an improving crazy.  Congrats on lock change.  Hope not DH is not the source of crazy but bad suspicion he is. Edi - I have been living on hot tea/toast.  Can't stand coffee when I'm sick and usually drink several cups.  DH needed a small item to complete his Amazon order to get free shipping.  I had him order 180 (Yes 180) Yorkshire gold teabags.  That ought to keep me in tea for a while.  Though I did have to switch to herbal last evening.  Yuck.  So - getting tats for rads.  Doesn't that sound like a rap song?  Repeat over several times to a snappy beat.  When is your chemo done?  Loved pics of new redecorated bedroom.  OOOH-LA-LA.  Lovd GD's picture on \"proper horse\".  She's adorable. Caitlin - Reading back is see you're due another round on Thursday??  In your pockets, girl. Nihahi - Out enjoying the landscapes?? Scottie - How's is your son doing?  When is he to wear the monitor?  In US we generally call them Holter monitors (I'm sure Holter was a brand name that has become a generic term).  I had one years ago for 24 hours but a lady from church just had one for a week.  Yegads - I would itch to death from the leads by that time.  They did have what is called an \"event timer\" so pt could note unusual symptoms. Jennie - Welcome.  I think most will agree rads was annoying but do-able.  Esp. if you've already endured chemo.  Not minimizing that some women do have a very bad time with it but most don't.  Lube, lube, lube.  My RO loved Aquaphor which did wash out of everything; who'd have thought it would.  I used cheap cami's from dollar store. Still on baby goat watch.  No action yet. Benny - Hope you are out enjoying giant plush toy.",
      "MessageIndex": 2618,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 2, 2013 10:58PM luvmygoats wrote: Aw Edi, I will say a prayer for shedman.  Hope the tube placement works and he can get some relief with radiation. Hope you can sneak some nap time in today.",
      "MessageIndex": 3330,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 22, 2013 05:51PM luvmygoats wrote: Thanks all for thinking of us. We are safe here in North Texas. I was ready to head to tornado shelter Mon/Tues. Yesterday it was cloudy/cool and storms just could not get going. Had some heavy wind/rain then much cooler. Some had record lows today. DH had a dentist appt. yest. in Ft. Worth that got messed up on their end so he was home with me on his day off. Glad for it with the forecast. I have kept an Oklahoma City TV station on the internet and scarily watched the tornado live. Maria may know where this is. I've been to several goat shows at the Cleveland County Fairgrounds in Norman on Robinson St. Friends were there Sat/Sun holding a goat show. Heard that one family had home destroyed along with barns though they are safe. I fear the Dallas/Ft. Worth metro area is overdue for something like this and not as prepared as OK and Moore for sure. If you saw the video of some of the concrete shelters with steep stairs that is exactly what we have. Well - can't we just have a cul de sac to ourselves and all live there? I love all of you. Oh, Edi, win lots at bingo. Drats I/we did not win the PowerBall Saturday. I had a whopping 2 numbers but I think that is a high for me. Don't know about dream stark nekkid in shopping mall - you exhibitionist you. Yes, let's fire some mooseballs at the spoi sport at ED's job. Splat, there goes a mooseball. Forgot to tell you that picture of DGD was so cute as well as pics with friends. Movie - I'm sure you will love the food. I lived in Hawaii as child and loved Japanese/Chinese/Phllipino/Hawaiian food any and all (well except poi, never could stand that stuff). Soon you will be hot springs bathing and loving on your DD. Dakota - what a daughter to be proud of. I hope you've put that away in a safe place. And you go girl rockin' the topless look. Where are those young co-workers of yours instead of 70 y.o. patients??? Liefie - love your Avatar. How is kitty taking the forced absence? Maybe the presence of DD and sons just left has negated some of her miffedness. Don't know about your dreams either. Sounds like you are doing wonderfully well and sure your visit to PS on Friday will be uneventful. Just you and DD going or is DH going too? Handy he is a doctor so no office visit for you to get drains pulled. Was your original date the 24th? I want to come and visit with you and DD. How are the chickens? Never did figure out why her DH sold the 1st coup but at least she got a 2nd one. Improved design? I'm too chicken -LOL- to have chickens. UMM - fresh eggs. They are soo expensive here - well relatively, guess cause feed is more expensive. So sorry to hear about your cousin. Hope she has some good support in her decision - you! Nihahi - That is quite a selection of wildflowers. We have a few Indian paintbrushes left and few unidentified others but mostly thistles/dandelions. You are rocking right along post DIEP. WOW. I can't keep up. I can't keep up here either. Just came back in from -oh yum- worming a couple of goats and letting them into boys pen to eat some of their little bit of grass. All of them bawling because hay is already gone for the day. Piggies. This is a juggling act because boys have to get locked up; have to entice them into their pen with bread which girls all want too. Hot, sweaty. Think I need a cool drink. TTYL. Have a good night everyone exceptin' Traii for whom I think it is 9:48 am. You have a good day. Know I missed many. Will try better to keep up but prob. not tomorrow. Cleaning crew at Sunday School member's house then grocery.",
      "MessageIndex": 3656,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 30, 2013 11:27AM luvmygoats wrote: Gosh Nihahi and Traii - housework is so not my thing either but we need to paint all the inside (and outside for that matter but NOT my job). So it's clean out shovel out. I am a (yes I'll admit it) a newpaper hoarder. So I've been going thru piles, sending bunch to recycle but I cannnot not read the obits, living, even business. Now old sports goes right out and headlines get only cursory glance. Ladies I'll take your cold weather. I don't think my newpapers did this because I sorted them on Tuesday, think it's our rainy weather. Will not go barefoot and this is why. Sitting on couch and just leaned foot over a little and crunch. I though oh darn I've brought in a rock on my sneakers again. NOOO - nice big scorpion but he was well crunched. Made DH pick him up. I will do ones that I smack with flyswatter but not ones imbedded in the tile. We are getting greener. Some are starting to bale hay but the big round bales. Feed store says they have many weeds; I said send them to goaties. Getting ready to place ad for boys for new homes. Got to go; that would be 5 down. Edi - I hope you are feeling better today. I have times when I just have to have a good cry. Thankfully I have long days when DH is out of house. I think it is these AIs. I did not have any trouble with menopause but then that was pre BC. I also believe that the emotional release of tears is good so long as you, me, anyone is able to pick back up with life again. Sorry no bingo, know that's a good fun outing for you. Love pic of ED and GD. My DD is actually coming on Sat. She is such a loner but we aren't much better. She spent the 3 day holiday holed up in her apt. playing online computer game. She even called yest. but was for advice. Has eye that x3 has reddened, watered, little drainage. Took herself to MinuteClinic and NP said nothing she could treat. She has a PC doc and due to get lab work done tomorrow. Has OK insurance but one of those high deduc. health savings plans. I don't really understand those but at 26 catastrophic ins is prob. best even though she does take thyroid meds and has it monitored reg. I wish she would have gone to see her PC though NP said would send report to her. Her work doesn't seem to care if she comes in with reddened eye, always the same. DD says she thinks she had pinkeye as a kid (I don't remember). Asked her to get name of opthal. while she's in office tom. so she can check her provider list. Alive - Hope post surg. is treating you well. Thinking of you and hope drains are out of there soon. Wirdgirl - welcome here to this crazee bunch. Delvzy - welcome to you. Hope you get some assit. from Traii. She's a wealth of experience. WINK - WINK. Iceburg - hope your surgery is done and all is well. Good healing vibes to you. Be the queen and let the family wait on you. Let us know how you are. Movie - since it's 1 am or so over there is today bathing day???? Sounds like you have been super busy. I love sashimi. Love most Japanese/Chinese food. Bear, cougar scat. Holy you-know-what. I'ms with Nihahi. Would have to change me drawers straight away. We have raccoon and prob. deer. Know they are there but they don't bother anything of mine. They did eat peaches off the ground but no peaches this year. Freeze got them. Only a few plums. No roses which I know are a delicacy to them. Actually I'm surprised Liefie. Aren't there lots of plants for them to choose from? Now in a really bad drought year would be different. Statistically we are but not by looking outside. Lakes/stock tanks still wayyyy down. We would need a soaker hurricane to fill those. Drat - I need to read the tutorial. Have some new goatie pics but can't post and we don't have an outside host. I know DH did avatar without using outside host; she was one of my fav. goaties - Nellie. So he's off to outside and I'm going to find that tutorial. TTYL. Sorry for the novel.",
      "MessageIndex": 3787,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 13, 2012 09:50PM luvmygoats wrote: Benny - You looked adorable. I can see why the guys hit on you. Glad you sound so much better. The wig looked perfect. ",
      "MessageIndex": 997,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 28, 2012 04:24PM luvmygoats wrote: Edi - Buttermilk Scalloped Potatoes.  Lightly oil 8x8\" baking dish. Peel and slice thin 3 large russet (white) potatoes. Thin slice one onion. Boil both in large pot salted water just until barely tender about 5 minutes. Drain, rinse with cold water and set aside. Melt 3 TBS butter in saucepan. Stir in 3 TBS flour and cook stirring for 2 minutes until golden and well combined. Stir in 1 1/2 c warmed buttermilk and cook, stirring, until thickened 4-5 minutes.  Add salt and pepper to taste and I add a dash of ground nutmeg.  Dump drained potatoes/onion in baking dish and pour sauce over lifting potatoes so sauce goes in between.  Bake uncovered 325 degress 1 hours (I think mine took a little longer) or until lightly browned on top. This makes about 4 servings - I adapted it it was originally only for 2.  Potatoes are hard to size; I would rather have excess sauce than not enough. I sometimes put a little garlic salt in too and paprika on the top for pretty color.  I buy the tangiest buttermilk I can find. I could just eat these by themselves.",
      "MessageIndex": 1183,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 1, 2013 01:43PM luvmygoats wrote: Gosh Benny - You are a warrior. It was destined to be yours. So glad you've had such a good 2 days. Loved your pic from yesterday. Sun is finally out here for a bit. Happy New Year to sister warriors. The best to all having chemo/tests/other treatments this week.",
      "MessageIndex": 1247,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 10, 2013 01:14PM luvmygoats wrote: Benny - Here in the states Miralax, Clearlax is pretty routine with high dose narcotics, not saying yours are but maybe more than Senokot can handle. No experience with chemo use but sounds very logical. It's over the counter here WalMart etc. Miralax is the brand name most people recognize. Pts tolerated it very well. Most were so glad to have something that worked so well. So VERYYYY glad you got to talk to the dietician. Have had patients on Beneprotein but no personal experience. Google says it is a whey product. Are you lactose intolerant is that the reason for the almond milk not a milk allergy? Livestrong says its lactose free, OK. I think also there is no generic. Might try small pkg to see if you like it. I've seen it in individual packets rather than giant can course that was NH/hospital use rather than individual. You know, sugar is refined. I can see that our bodies were not made to have real sugar even though I guess you could squeeze sugar cane and get the juice. Google again says sugar bad for irritable colon so I see where's she's coming from. I never thought about it being an \"irritant\". So glad Diamond was a good girl yesterday. She probably sensed that you needed that. Bet the farrier liked working on her. What the heck are hemp hearts?? I think her autocorrect changed baby toes to baby ties. See Websister has posted while I've been composing. I like her suggetion to try both class and chemo.  I thought that might be you poking me, naughty girl.",
      "MessageIndex": 1433,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 14, 2013 11:40AM luvmygoats wrote: Traii - Just a quick post to you.  Your DS would have a blast on my street.  Trash pickup is by choice.  If you want it you contract with a company.  We have at least 3 trash pickups, ours is Monday, another one yesterday and a 3rd just came by.  \"Bin Day\" could be most weekdays.",
      "MessageIndex": 2242,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 6, 2012 05:45PM - edited Mar 6, 2012 05:46PM by luvmygoats I love plumeria (that's the picture).  Lived in Hawaii as a kid (early 1960s).  Thanks to everyone for the welcome.  Just waiting for MO appt. Friday.  Called today and verified they have all the records they need.  Now just to fill out all the new pt. paperwork. Hawk - my congrats too.  Luv the Happy Dance!",
      "MessageIndex": 11814,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 4, 2012 01:48PM luvmygoats wrote: Thanks so much.  I missed that part!",
      "MessageIndex": 11772,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 4, 2012 01:35PM luvmygoats wrote: Want to introduce myself.  Texas gal, age 59.  BC found on my yearly mammogram in mid Jan. 2012.  Called back for extra views/sono and radiologist worked in an on-the-spot biopsy; very frank about with her suspicious findings thus path report no surprise.  Results 2 days later.  If I could figure out how I would add path to bottom.  Lump with wire loc/SNB on 2/21.  IDC 1.1 cm, Stage 1, Grade 2, 3 nodes/all neg, ER+,PR+, HER2-.  Both (biop & surg) path reports show Grade 2. Took 4.7 x 5.2 x 1.8 cm spec (L outer breast).  All margins clean.  Both incisions about 3.5\" long.  Bigger incisions than I expected.  Had follow-up with BS; doing fine.  No clearance for work or driving yet.  Hospice nurse and I drive all the time.  MO appt. 3/9.  Not sure what to expect.  Don't think onco done.  BS hedges chemo questions, more so since surg. done.",
      "MessageIndex": 11770,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 5, 2013 06:41PM luvmygoats wrote: Well - I thought about an hour ago we were getting some action.  Making \"mama\" sounds.  They just sound different but nothing going on in the hind end.  Layed down a couple times and acted like she was pushing.  She's a 1st timer so who knows what she is feeling.  Penned her up in the kidding pen with some nice alfafa hay and left her quietly munching.  Monitor is right beside me and I hear not a peep from any of them and bet all 14 of the does are already in their chosen places in the barn.  So maybe a quiet night.  DH due home in about 2 hours but I don't think he wants to spend his night kidding goats then go to work tomorrow.  There is something to induce labor but you would have to know the exact breeding date and I only have a 3 week window for this one.  And the other one I saw bred could, no likely but could, have come back in heat and bred at the end of the 3 week window.  My calendar says should kid by 3/22 but again 2 weeks late is considered still on time.  Sounds like us ladies.  LOL.  So I wait on.",
      "MessageIndex": 2629,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 13, 2013 01:25PM luvmygoats wrote: Moviemaniac - So this is great news, right.  Make darned sure that wrong path report does not get incorporated into your file.  I would do this in person if possible.  With insurance, etc, all changing next year (well most changes will start slowly this fall) I would want it ABSOLUTELY (yes shouting) certain my file was correct. I have a left shoulder that doesn't work well in the am.  Kind of coming out of joint (I think that is called subluxating).  As I warm up, play bit on computer, it's good to go and able to go feed goats and carry partially full water bucket.  Rotten cold hanging on, hate snot.  DH wears headphone thingies when I start snotting.  It is getting better as easier to get ears to pop.  Sense of smell back some.  Made enchiladas last night and this morning could actually smell peanut butter on my bagel.  Small things.  Hope your sutures come under control. DH was off yesterday but I took the opp. to go shopping.  Will try to get pictures of goaties posted maybe this weekend.  The 2 belonging to the experienced doe are huge.  They're going out for the day in the dog run tomorrow to let pen air out.  Temp. says 68 degrees out, no wind.  Lovely.",
      "MessageIndex": 2750,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Apr 30, 2013 01:01PM luvmygoats wrote: Yes I'm concerned about Edi too.  Where are you????  OK, snooped a little bit.  Rest assured she has browsed the posts on 4/30.  Forgive me for snooping.  Love you.  Check in when you can.  YAYY for finishing chemo. Off to grocery and feed store very late 1 pm. TTYL. for Edi",
      "MessageIndex": 3290,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 2, 2013 10:34PM luvmygoats wrote: Edi - What the heck are you doing up this time of night? It's 10:30 here, what about 4-5 am your time?",
      "MessageIndex": 3328,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 29, 2013 11:54PM luvmygoats wrote: Sorry been MIA for a few days. Cleaning house and it's looking better. Iceburg - In you pocket for you lumpy tomorrow. I'll try to be quiet but you may hear a \"Yah\" when it's over. Benny - love hearing back from you. Sweet hugs to you. Rescue pigeon likes John Denver - me too. Rocky Mountain High. Get stronger so Diamond will recognize you da boss. Will post more tomorrow. Love you all. Off to night night.",
      "MessageIndex": 3769,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jun 2, 2013 07:37AM luvmygoats wrote: Just a quick check-in on Edi. See she has not posted. BUT I checked her profile and she was on 2 hours ago. Hopefully by the time I get home from SS/Church she will have checked in. Has anyone sent her a PM? But at least we know she's checking the postings.",
      "MessageIndex": 3825,
      "PostDate": "02/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 20, 2012 12:03PM luvmygoats wrote: Benny - You sound so great this morning. So you're a social worker, I'm an RN but gently retired (get it, not yet retirement age).  LOVED my SWs in my hospice job. They were awesome. Read that Neulasta is subcutaneous (SQ in med. terms) - that means shallow injection. The injection itself should not be that painful and probably would be much like insulin injection. Website says 27 gauge needle prefilled that's really small. Hoping SE from it are better than Neupogen were for you. I love my goats. Was out this morning warming water for them and it was only in the lower 30s. They are just for fun certainly not for making a profit. All I do is spend money on them. I have 17 I think (I try not to count too closely) but do have couple that need to move on. I may try milking one in the spring. She has a great udder but a crappy personality, not a people goat and she was born here. Lots of goats come from big herds where they get little people interaction but not here. Love and lotsa (((HUGS)))",
      "MessageIndex": 1065,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 21, 2012 01:08PM luvmygoats wrote: Benny - Onco might have just OK'd refills \"just in case\" so won't have to do it if you need it again.  Thinking positively!!",
      "MessageIndex": 1078,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 28, 2012 04:00PM luvmygoats wrote: Benny - Prayers are with you. Let us know. Wish I lived in Calgary to help you. Friends there for you?",
      "MessageIndex": 1181,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 2, 2013 12:03PM luvmygoats wrote: Benny - The codeine is also constipating so that may be why you get diarrhea when you go off. I would think 9 days is not much to be on it. How many/much are you taking? Codeine pain meds are not prescribed much in US. Hydrocodone much more prevalent; not so many allergic to it like codeine. Codeine pretty much only in cough syrup for cough suppression. I don't think I ever saw a hospice pt on codeine for pain. Oh, that's another thought. It is suppressing your cough so when you stop/cut back the codeine not only is your pain coming back but so is your cough (did you even have one?). It will be a trade off. But with some docs they will not give codeine for cough suppression esp. if it is productive. Only for dry, annoying, keep you up at night coughs. Have you had problems with GERD (stomach acid)? Might check out with dr. if you can take Omeprazole or such. Here in US it is OTC. Like I said b4 don't know much about mucositis. Hang in there girl. Edi - Love that song. All my sisters and me.!!! Websister - Glad your mom is doing better and out of isolation.",
      "MessageIndex": 1265,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 10, 2013 12:25PM luvmygoats wrote: Carla - Your bag feels so heavy with all of us in there. Whoever is poking me in the ribs quit it. You go girl. Thinking about you today even though I've not posted much last couple days. Caitlin - like Websister will hop in your pockets tomorrow. Traii - love your Avatar. Edit - glad the pipes are feeling better. I found a recipe for oat scones (using that leftover buttermilk from the scalloped potatoes) so will be making those. I'm sure I will like them, don't know about DH. Know scones are not lunch/dinner but what the heck. Dakota - WAYYYY too much energy for me. I'm ready for NHL ro restart. I actually got to go a Dallas Stars game 2 years ago. DD's company gets marketed to and the co. doing the marketing got a suite (SWEET!) to sell them on their services. I couldn't go last year due to my LX. Hoping they do it this year. Websister - What a great source of advice you've been for Benny. Hope your day is going good. I'm ready for spring but dread tornado season. Sun was out for a few minutes but at least it is warmer and PTL not raining today. We need the rain but please not that much in 2 days. Feeling a little moldy, lichen like. Nihahi - Wow, snowshoeing. I'm doing good to put one sneakered foot in front of the other. Bearcub - How are the rads going? Why does Websister say you didn't need to share so much snow? Is it because it hits you first? I apologize if I have any of you mixed up. I don't know how Websister can keep it straight like she does. I have 3 windows of posting page going back and forth reading/posting on here.  Sending this now if only partially complete.",
      "MessageIndex": 1430,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 12, 2013 01:00PM luvmygoats wrote: Benny and Edi - The tats for rads are tiny needle prick kinds. I have 3: one in center of chest between tatas, and one on each outer ribcage. Used for the laser to line up exactly the same each time. I have read of some refusing tats. Then I had super sticky tabs that were repositioned occasionally. I had 6.5 weeks and every Monday had X-rays to check the positioning and that's when they would reposition the tabs. Somewhere on BCO is a great discussion of angles of rads. I only had from 2 angles so catch all the breast tissue one from the right, then it crossed over to the left since I had no positive nodes though was surpised that they did radiate the SNB site. I had the tats; at my age I don't think nude beaches are in my future and I wanted the best shot at rads since it can't be repeated on the same breast. I had some breakdown on nip but not extreme and worked through it all. I did not have what I would call serious breakdown. Did resort one time to Domeboro's soak to the nip. Rads b4 work and most in my office never knew when I went as I was done most mornings about the time my office opened. Only missed one early telephone call throughout. I know the Canadian protocol is I believe 16 sessions more intense but delivering ultimately the same dose. My RO said coloring (fair, red head) has less to do with SE than how the skin had been previously overbaked shall we say in tanning. Did warn me my sternum area which had seen the sun might be worse but wasn't.  Except for the extra time in my day and the fatigue which did happen as I progressed thru rads it was not that bad. I see other postings on here of bad reactions so sure know they do happen even with excellent ROs. I would add one thing to BE SURE OF - yes caps. When they do your preplanning make sure they get a position you can be at least minimally comfortable in. My rads even with the extra Mon. xrays were very quick but with more involvement esp. Benny you may have a longer time on the table. I had a good friend who was a few months ahead of me in tx. Her comment was very apt - it took longer to dress/undress than the rads, a little bit exaggerated but darn close. Hers had a card swipe check in which I thought was neat, not at mine though her center was newer. Mine had lockers, put stuff it, take the key with you. I always left purse in car, that's just me since I with my job you know driving around and going in nursing homes/pt homes all day it was already buried in my car trunk (Oh Edi I do know the English boot! LOL). I had mostly the same techs throughout even though the rads place was quite big, freestanding center. Females except for one trainee that I was asked if I minded him being there. Creams/lotions - I used a prescription that RO insisted on Xclair. Expensive even with my insurance. Also Aquaphor, OTC product. I see Glaxol, Biafine, My Girls and others mentioned on here. I also used as I finished up a Calendula baby cream from Target and still put on itchy skin areas. It smells heavenly. I had sports bras from WalMart since I was just coming from surgery. And still use those when I feel the smooshing/support need. Even the Aquaphor washed out of them. I did put on cami's to protect my scrubs and they survived. No lotions/potions 2 hours b4 rads; since mine were early am just what was left there from the night b4. RO wanted me to cream up during the day. IMPOSSIBLE and it worked OK. I might not have had the breakdown I had maybe - and a big maybe - if I had been able to but it was not possible with my job. I was lucky to find decent bathrooms much less nice ones with room to strip down. Edi - did you catch that shepherd??  My scones were OK. I'm eating them. The buttermilk was sooo thick that I had to add extra milk and they are crumbly. Eating them with a fork. Only had 1 tsp of sugar in them; I add more like 1 TBS and put I think what you call Demara sugar on the top. Isn't that the one that looks like crystals? Whew, I'm out of breath.  TTYL - must do some chores. Dog needs bath, too.",
      "MessageIndex": 1477,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 15, 2013 07:09PM luvmygoats wrote: Benny - Brand name is Carafate. It's an old medicine but effective. You would fit right in here in Cowtown. Come on down. From what I have read Adriamycin is very rough and Liefie is right they don't call it the \"red devil\" for nothing. Hopefully you will have fewer symptoms this time around.  It's hard to tell on here but I think you made it through this one better. At least you come across here better, more hopeful. So don't count the taxanes out yet. Did you get to spend time with the plush animal today? We had a surprise snowfall overnight. Weatherman expected light amounts further east but it started just west of us. Goats do not like snow, even to walk on it as it had stopped by the time they got fed. Heated them up water buckets which they do like. Oh and I'm envious. I couldn't even throw one hay bale much less 32. Edi - sorry for the car troubles.  So glad you are SE free. Carla - Hope your SEs have stayed minimal. Websister - great your Muga scan was good. What can you do to build your hemoglobin? Eat spinach?  Hopefully your mom will get to go the lodge as planned. Bearcub - Yeah, half way done. Dakota - Treatment day tomorrow? In your pocket girl. Lesley - yeah for getting the last drain out. I can't imagine going snowshoeing. You and Nihahi must have legs of steel. Missing Traii, Caitlin who must be getting ready for her surg., Bevlee hey, I did some reading back and listened to the Cheers song? Yes, everybody knows your name, except me whom I'm sure has left someone off.",
      "MessageIndex": 1536,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 17, 2013 10:18PM luvmygoats wrote: Traii - Now it's a quarter after 10 pm. Showered and playing here a little bit b4 bedtime.  I'm being a hermit these days and trying to get my house in order.",
      "MessageIndex": 1589,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 27, 2013 03:12PM luvmygoats wrote: Edi - I had my surgery in Feb last year and spent most of my time off with my hand cold as it was in my shirt on my surg. sites. I agree with Nihahi that is most likely nerve regeneration. Unfortunately nerves grow verrryyyy slowly so you can expect to have more pains though not consistent. I have them and have pain above boob where radiation line went to. I think some of mine is not wearing a bra at home now after months of all day 5 days/week. I had to go back to some of your original posts to find your August surgery date. Good luck on bloodwork tomorrow and new chemo. We'll take your rains here. 73 degrees outside, humid and feels like April. And due for severe thunderstorms on Tuesday though they may be more east of us. Sounds like tornado threat may come early this year. Long range forecast through mid Feb. shows no real cold weather.  The Fort Worth Stock Show is going on now, started last weekend for about 3-4 weeks.  Traditionally have at least one icy period during it. \"Stock Show weather\" is famous around here. February is usually our worst month, go figure. Wind howling and would be worried about fire danger if it wasn't so humid. Wish someone had heard from Benny. Wonder if Websister has tried her. Dakota - Love your sweet Avatar. Not DH - tell him you know guys get BC too.  Whatcha think about that buddy boy??? I believe in Karma too, though not sure how that jives with my Christian beliefs. He'll get his one of these days. Nihahi - Moose licks! Do they ever climb on cars? Took DD when she was about 4 to wildlife park. Something molested our car slobbered all over the bumper, can't remember what it was.  Zebra??  Scared the c**p out of her. I've seen bears in Yellowstone as a child but nothing like a moose besides nearly skiing into it. Those were black bears hunting thru the trash; park ranger shooed them off. I bought the bag of peas but never used it. LOL Carla - good to hear from you again. Nice snuggling on a rainy day. Liefie - Good for you on the 2nd haircut. I like Pixie cuts personally. Easy to maintain. Traii - Guess we'll hear from you shortly. Car getting new tires on Tuesday, DH taking care of it. Great except for the expense. I have BS appt on Wednesday 10 am, kinda takes out much shopping by the time I finish there. Don't expect to go back to the \"big city\" again until the end of Feb. That is unless I traipse over to see DD on the other side of Fort Worth on a Saturday. If she's not otherwise occupied!! Not too productive here either. Went to Sunday School, worship service, grocery (I know bad on a Sunday but did't get out yesterday). Load of laundry on (DH's work shirts). Making knock off Olive Garden soup for dinner to use up the kale I bought. I buy this stuff and let it go to waste and just can't keep doing that. Last night's dinner was all from the freezer and pleased that I used some stuff up.  Everyone enjoy their Sundays or Traii and Bevlee must be almost Monday (??).",
      "MessageIndex": 1866,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 2, 2013 09:59AM luvmygoats wrote: Curveball - yes prednisone can disrupt sleep.  Just like the steroids for chemo.  Prednisone is a very good, useful steroid and tapering doses are protocol.  Your body needs to take back over the steroid production which is what tapering the dose does.  A spoonful of sherry does the trick? I don't think you'll get in much trouble with a spoonful. No, no word from Benny.  Our suspicions are that she is in hospital with no way to recharge phone or internet access.  Our prayers on here are all with her.  When I see new messages from this thread I always open it first hoping to see something from her.",
      "MessageIndex": 2001,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 23, 2013 11:12AM luvmygoats wrote: Granny - Don't post on here often but read every day.  Prayers for your dear son, you and for your family during this stressful time.  May God direct the surgeons' hands and be with them during this long surgery.  May you have caring staff around you for support and may God be with them as well.  Granny draw strength from all who are praying for your son.  Love/hugs/prayers from Texas.",
      "MessageIndex": 14338,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 10, 2013 10:26PM luvmygoats wrote: Mary - Feel the love of those surrounding you. May we meet again some day.  Pain free peace Apple.",
      "MessageIndex": 150,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798177",
      "Title": "Has anyone heard from Apple? marie5890"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Apr 19, 2012 12:30PM luvmygoats wrote: Shachar - Just a quick reply.  Off to work and sorry if someone said this already.  Ditto comments about ice, pushing sensation.  Had my core needle as a surprise with a followup mammo.  Radiologist said \"I can do it today\" and I agreed.  Mine was exactly where yours is 3 o'clock L breast.  Mine was approached from the bottom side of my breast angling inward.  I believe it was fairly deep though the track would have led me to believe more shallow.  I would have though straight in the side of the breast.   Weird.  And mine was US guided; non palpable mass found only on mammo.  Thank the Lord for a routine mammo and great radiologist.   My LX incision is exactly the needle track of the biopsy. Gotta go.  Rads in 1 hour.",
      "MessageIndex": 19,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/786045",
      "Title": "U/S guided core needle biopsy? Shachar Shachar"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 15, 2013 11:45AM luvmygoats wrote: Dakota - enjoy the hockey tournament, lobster pot and all (LOL).  I could do with some lobster.  Still eating leftover enchiladas I made the other day but on to shopping. DD coming tomorrow so Dad can do her taxes and to see goaty babies.  TTYL for sure have to get off.",
      "MessageIndex": 2775,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 17, 2013 02:05PM luvmygoats wrote: Liefie - so good to hear that everything went well. Waving like mad at you. Enjoy being waited on by staff, kids and DH. Love you bunches and lovely gentle (((HUGS))).",
      "MessageIndex": 3563,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 23, 2013 12:16AM luvmygoats wrote: Iceburg - I can't keep up and I don't have going on what you do. Don't stress. Just post with us, have fun, hang out and ask away. Don't want to lose you on here but there is also a \"lumpectomy lounge\" thread. I bought button up front shirts from Goodwill though I still wear mine (flannel for winter) oversize so comfy. Also comfy pull on pants, I think they are yoga pants. Lots of my shopping at Walmart - handy. I also bought front hook sports bras from Walmart - Fruit of the Loom. Still wear those too esp. if doing chores and don't want any jiggle.  No way could I fasten a bra in back then and you will want the support. You might go home with a drain so be prepared. Hosp. was prepared to send me home with something to hold it but I didn't have one. Most lumpectomy pts don't have one but it is not unheard of and my doc warned me. I also packed an overnight bag just in case I had to stay but did not. I remember very little of ride home -about 45 minutes. Dozed off/on rest of day and the next day. Benny (named after her cat) last we heard was finishing rads after chemo. And her computer had died. Websister is in touch with her occasionally and keeps us updated if she knows anything new. We hope our Benny comes back here eventually. BENNY WE MISS YOU. Hope giant plush toy is enjoying spring and fresh green grass. Night night. Off to bed.",
      "MessageIndex": 3663,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 30, 2013 10:20PM luvmygoats wrote: Nihahi - come live in rural Texas. LOL. I can tell one or two doozies too. Alive - drugs are good. Remember to take your stool softeners. Sneaks up on you. Edi - (((HUGS))) for you though I did sneak a peak at your profile and know you were on here today. Love from across the pond.",
      "MessageIndex": 3795,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 30, 2013 10:51PM luvmygoats wrote: What \"s\" word???",
      "MessageIndex": 3799,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 18, 2013 08:56AM luvmygoats wrote: Traii - Hope your are safe in your home but just googling fires around Craigieburn.  Prayers from here sweetie.  So scary.  Hope you, DH and DS are safe.  PLEASE let us know when you can. Nihahi and others - just busy around house.  Nothing special and nothing to report.  BUT I do read everyday just not posting so much. Dakota - a special shoutout for your last chemo day I misssed last week.  And a POX on not DH.  Any chance you can get a school job to be off when kiddies off? Will try to be more timely but I do love everyone on here.  One of my favorite threads and look at it first when I open up BCO.",
      "MessageIndex": 2318,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 18, 2013 09:03AM luvmygoats wrote: Benny - I second Nihahi's suggestion.  What's happenin' sister?",
      "MessageIndex": 2320,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 8, 2013 08:22PM luvmygoats wrote: Will catch up some more tomorrow. Nihahi - Read your post from 17 hours ago about me being up spooning curry in the goats.  17 hours ago I was actually asleep. Silly goats.  The short version is 1st goat (1st timer) kidded at 1245 Wed. morning (I think I put Tues. in a few places. Couldn't figure out where I lost a day LOL and LAS - lack of sleep).  DH up to help.  One tiny buck, one super tiny doe couldn't stand and unfortunately one dead buck.  Milked mom out some and bundled them in the house - had several warm nights but NOOO not Tues into Wed.  Fed them and put them in dog crate.  Got about 3 hours sleep b4 and after.  DH took personal day Wed. to help.  Bought goat formula - did I say mom is a super SNOT.  Milked her a little more for doe but boy went out with her - strong and well.  #2 goat - kidded at 7:30 Wed evening with a little help, marvelous mother, strong doe & buck, no problems.  Yesterday doe learning to walk, bottling well, peeing all over me at every chance.  Out to mom x 2 to nurse today.  Could prob. stay but mom believes she is an alien; doesn't smell like her so guess I have a bottle baby to raise.  Done it b4 when I lost mom to a C-section and at least her mom is out there to nurse, just have to tie her up.  Bitsey or Lillabet (Little Bit) I think is going to be her name.  DH has her pic, but I dare not bother him again to post it as he headphones on watching a movie.  She slept thru the night with only a couple of peeps; DH in guest room and baby in dog crate in our room.  And yes - Wednesday with all the excitement was our 37th anniversary.  All DH would like is a clean house.  I got what I wanted which was help with goaties.  Think this is it for babies.  Knees, back, shoulders, ankles creaking from kneeling.  TTYL.  Nap on couch b4 last feeding for the night.  Thinking good thoughts with minimal SEs for everyone. Missing you Benny.",
      "MessageIndex": 2686,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 15, 2013 11:33AM luvmygoats wrote: Sheryl - WOOHOO for last chemo.  I drove 45 minutes into work everyday and went to rads at 0740.  It will pass and though weather (except for storms) would not be a problem for you it is a lovely time to be out and about.  Do you get your pick of rads time?  Mine went smooth as clockwork, no machine breakdowns in and out by 0800 except on doctor day.  With neg. nodes your rads time will prob. be close to mine.  It was like two 45 second zaps. Dakota - What the heck is a lobster pot tournament?  Hope you get cost of exterminator figured out. Edi - Congrats on 44 years of wedded bliss.  I'm like you my DH is far from perfect (only one person I know fits that bill Jesus) and sure not me but I wouldn't trade him for anything.  At the moment he is out cleaning out 2nd stall that I was supposed to do.  Enjoy Chinese tonight. Off to slightly bigger town of west Ft. Worth (Kohls, Target, Marshalls, Ross).  DH has sent me on a shopping errand.  YAHOO!!  Kohls having big sale.  Better watch his wallet (per Edi).  Need Easter dress and prob. use same dress for June wedding. Benny, where are you??? TTYL.  It's 1130 and I'm not even dressed.",
      "MessageIndex": 2771,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 21, 2013 12:14PM luvmygoats wrote: HI all - I just found my last post on March 15.  Life does sometimes get in the way but in a good way.  DD came out for short visit last weekend mostly to get Dad to do her taxes.  BUT I am going to get to go the hockey game Sat.  DH has managed to get an early shift so he will be home to do baby goat duty Sat. night and then again very swiftly on Sunday morning b4 work.  I do owe him something.  Must get to house cleaning/shoveling out stuff.  Hopefully in another week or 2 this baby can go to an outside pen but cold this weekend maybe a freeze with my fruit trees blooming.  Wahhh. Nihahi - Hope the sleeping is better.  Me, too, and no reason for it.  I just have seasons when I don't sleep well.  I'm a night owl but need to get up early to help DH with goats (yes, my goats).  Have you tried sleeping in a different place, sofa maybe but maybe alien boob won't let you.  Loved the mountain pics.  No cornfields here, hay soon, but no corn.  Edi - Love the new bathroom.  And how in the world did you post the newspaper pic?  I managed to post one thing one one thread and could not get anything else.  It was a joke picture.  Have yet to get any goat pics. Dakota - Hang in there girl. Liefie - DD sounds lovely.  I bet you love having her around.  So soothing. Caitlin - Round 4 of how many?  Hope you have fewer SEs this time. Jennie - I can't imagine your onco saying that \"most women don't notice SEs from chemo\".  What the heck does she consider SEs????  Tamoxifen is a different matter and Liefie is right.  You'll see those on here who have SEs much more than those who take it with no problems.  So it kind of hijacks your thinking that all have nasty SEs which is not true.  I have very minimal from my Femara and so far no reason to even think about stopping it. Busy 4 days here.  Haircut this afternoon.  Shopping tomorrow (DH off to goat sit), to DD's on Sat. afternoon and back about mid afternoon Sun.  Easter musical at church Sun. night.  WHEW, I'm tired already. TTYL.  Going to wash goat smell off. Websister, thanks for letting us know about Benny.  Hoping we hear from her in person soon.",
      "MessageIndex": 2843,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 2, 2013 10:31PM luvmygoats wrote: Alive - I don't remember if I welcomed you or not. Rant away to us when you are ready. Investigate your options and take your time unless your doc saw some urgency. Go back and clarify with BS if you need to. Reread your intro and though I know you know I want to emphasize that BC treatments have advanced so much in the years since your mom passed. Most all kinds of surgery covered on just this thread not to mention on the rest of BCO. Edi - that soup sounds heavenly. We have Chinese here in town LOL combined with a donut shop. We call it of course Chinese Donuts. Not great but if I drive 15 minutes to the next town pretty good Chinese but I don't think either have that soup.  So funny I was watching Anthony Bourdain this morning and he was in Taipei and he had dumpling that had soup in them. Yummy looking and then came on and you talking about Chinese. Has shed man heard anything? Love the gorgeous warrior pic. Traii - you are the hero. My cleaning is WAYYY behind and I don't care. It is May2nd and we're getting a you know what freeze tonight. Been out covering up my tomato and pepper plants. Its only supposed to be 60 for a low this time of year. Nasty, windy, wet, feels like January. Liefie - the hospice cooking volunteer position sounds wonderful and perfect for you. Nihahi - hope the peas are on retirement permanently. Caitlin - Hope round 7 treats you gently.",
      "MessageIndex": 3327,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 15, 2013 05:13PM luvmygoats wrote: Liefie - WOW, sister. In your pockets big time for tomorrow. You will do fine, you are so prepared. Your kids will understand, who the heck would want to wait until October (BTW nice long maternity leave for your doc). Caitlin - in your pocket for Celebration time on Thursday. Don't hoist too many glasses but might make a special occasion for you. Edi - loved pic of you and DDs. All beautiful. So good to hear shed man is better. Movie - Sorry to hear about the face plant but good going protecting the girls. You may find the Japanese too polite to stare in the communal tubbing. Websister - Praying for boring results on your ultrasound and bone scan. Will add more. Want to get this off to Liefie and Websister.",
      "MessageIndex": 3524,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 18, 2012 04:43PM luvmygoats wrote: Edi - I'm sure it's the liquid. It's also a component in \"magic mouthwash\" for soothing mouth sores (prescription).  Makes sense - soothes the stomach, soothes the bum!  Some may use Maalox instead of Mylanta - pretty much the same thing. If you have one of them I would try it rather than buy something new.  \"Liquid anti acid\" you prob. having something similar in England. And generic would be just fine for \"bum\" use.  Wishing you minimal SEs.",
      "MessageIndex": 1040,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 27, 2012 05:17PM luvmygoats wrote: Benny - Glad the throat is better. Sounds like time to call the hot line again esp. the faintness.  I don't know symptoms of mucositis. I think alternate plans for touring the horse farm are in order for Saturday. Any way you can check the thermometer? Do you feel like you have a fever?",
      "MessageIndex": 1168,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 22, 2013 02:50PM luvmygoats wrote: Nihahi - In your pocket tomorrow. Make it nice and warm, pleeeze. Dakota - (((HUGS))) to you dear girl. What an a**  D(not)H is. Feb 14th can't come soon enough. 65andcounting - Welcome aboard this train.  Keep busy.  Get things arranged where you can reach them.  Make freezer meals.  Get button up the front shirts; easier to get into. I could not staighten arm out fully for several weeks and when I went back to work had to choose more loose fitting scrubs to be able to get into them. Check what kind of bra BS wants you to wear and shop for them.  Mine had no particular pref. so I bought front hook sports bras cheap at WalMart.  They were good for rads too as all the lotions/potions washed out of them.  The squishy look not so attractive but liked the support and still wear them for active wear.  Ask away; probably one of us has been there or can point you in the right direction. Bevlee - good to hear from you. How is treatment going for you? Traii - staying cool?  How is the arm? Bearcub - do I count only one more rad?  Going to celebrate tomorrow, I bet. Edi - Riding a camel??? Oh my.  Glad you're having the big thaw.  Nice afternoon here. Liefie - I previewed this and read your \"mooseballs\".  Just about spit out my tea on computer screen.  Does it taste like venison though I haven't had any in several years.  DH not a hunter/gatherer type more like a couch surfer type though he has been painting the patio on his vacation. But his time comes Friday. He gets the colonoscopy I went through in Dec. Benny oh Benny where are you????  Please post if just a word or two.  Websister or Nihahi have your heard from her?  Worried (see my big frowny face). Been absent. Had mammo yesterday one year from diagnosis.  Radiologist said see you in 6 months for leftie.  OK so had to go shopping afterwards to celebrate.  Catching up on chores today.  I need to keep my little notepad by keyboard to take notes on everyone.  Isn't that your secret Edi?  I saw Benny's coffee cup yesterday at Marshall's.  Keep calm and carry on.",
      "MessageIndex": 1733,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 25, 2013 08:22AM luvmygoats wrote: Liefie - sorry I have the wrong relative after reading again it was your niece just diagnosed.  Prayers from here for her. Does your niece live in Canada?",
      "MessageIndex": 1811,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 25, 2013 04:34PM luvmygoats wrote: UHH Traii - Thongs here are naughty girl underwear. But I grew up SW US and Hawaii and that's what we called them then. Flipflops now. Edi - I neglected to tell u how much I love your wig. And you are the naughty one. Liefie - I will get your relative's relation to you straight.  Hope your cousin has the private healthcare.  Egads - we think we have it bad when we have to wait for tests.  At least we don't have to cart our own bedding to hospital.  Congrats on the 2nd haircut.  I googled pics of Victoria, very beuatiful even if most I saw were definitely spring/summer.  How special. DH colonoscopy uneventful but slower to wake up than I was for mine in Dec.  He's on the 10 year plan now, nothing found.  He's napping the afternoon away on the couch.  Sun is finally out, yay!. I want my 79 degrees back, whine, whine, whine. Dakota - Soccer tonight?  Sorry about the singe on wig/lashes. Are you in for more snow? Nihahi - How was the snowshoeing? Websister - How are you feeling today after Herceptin? Bevlee - Don't stay away so long. Carla - Looks like Traii answered your question about your cough. Bearcub - What did you do today to celebrate? Benny Benny wherefore art thou Benny? Happy Friday to everyone.",
      "MessageIndex": 1824,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 28, 2013 09:23AM luvmygoats wrote: Nihahi - That's the 1st kale I've ever had, at least that I'm aware of. Ripped the wavy leafy ends off and slightly down the veins/stems and put it in the soup. It was off of Food.com called \"Olive Garden Copycat Zuppa Tosca\". DH had 2 bowls of it and have leftovers for tonight. I was very pleased with it. Used Italian sausage out of the casings and chopped up bacon. Wilted onions/garlic in the drippings. I did have to add some chicken bouillon as the flavor needed boosting even with the boxed chicken stock I used. I bookmarked other kale recipes to use it up but can't vouch for them. I tasted it b4 I put it in; it was OK as an additive to soup. Don't know I would want a bowlful even though I get the boxed/bagged salad mixes with the bitter greens. I'm not much of an iceberg lettuce girl. Know that I'm not working makes me want my garden back but DH graveled over it when I quit using it. At the rate Texas weather is going we'll have summer next week anyway. LOL. Spring comes Tuesday with severe storms so can summer be far behind. Oh yes and fire warnings for tomorrow. Yippe, storms and fire danger.",
      "MessageIndex": 1881,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 19, 2012 03:05PM luvmygoats wrote: Benny - Best thoughts with you and through the coming days.  Minimal SEs, OK??? Love your goaty girl Nancy.  My avatar is my Nellie, long gone and the sweetest goat I have ever owned or bred. Websister - You exemplify the true Christian spirit - giving selflessly.  Know you have so much in your own personal life and yet you took time to be there for our Benny.  Best Christmas wishes to you.  Hope you get some personal time.  Take care.  (((HUGS))) for both of you.",
      "MessageIndex": 1051,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 22, 2012 08:51PM luvmygoats wrote: Benny - Big (((HUGS))). Find some stupid funny movie to put on. Good you don't have sx from the Neulasta. Don't think it means a thing about it not working. Count yourself lucky. Love you.",
      "MessageIndex": 1099,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 24, 2012 10:16AM luvmygoats wrote: There is a prescription stuff called magic mouthwash.  Lidocaine, benadryl, maalox and some other stuff. But as you say the weather is nasty. Do you have any maalox?  It might be a little too minty but maybe just rinse out a little with it maybe diluted. Pureed stuff, very milky mashed potatoes, plain. Maybe (I know sounds terrible) baby foods maybe the ones for the older babies.  I've heard avocadoes suggested for their fat content. Light salt water rinse like for sore throat. Another thread has gone thru this recently from rxn to CT contrast. She is much better and getting chemo constantly for colon CA. On the Middle Aged Women 40-60ish.  But it has taken her a good 2 weeks but think she had an extra whammy from the contrast rxn too. Have you read \"tips and a shopping list for getting thru chemo\" on here? It's on my bookmarks as favorites if I ever need it. Look at your tongue b4 they call back. Is it normal/pink or white coated which would be oral yeast and need Nystatin prob. swish/swallow if throat that sore? Pasted off another website Saltwater Mouthwash Keep a bottle by bathroom and kitchen sinks. Rinse, gargle, and spit after meals, before bed, and anytime your mouth feels dry or sore. (((HUGS)))",
      "MessageIndex": 1134,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 25, 2012 03:42PM luvmygoats wrote: Benny - Checking in to see how your doing today. We've had about 2 inches of snow, I know not much by your standards. (((Lots of HUGS)))",
      "MessageIndex": 1144,
      "PostDate": "25/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 28, 2012 06:24PM luvmygoats wrote: Yeah for Benny!!!  Urgent Care sounds soooo worth it. Are you keeping up with your protein intake? That's what a meat craving might make me think or maybe your hemoglobin is a tad low but you most likely just had that checked with your chemo.",
      "MessageIndex": 1188,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 31, 2012 10:31AM luvmygoats wrote: Benny - So glad you're feeling better. Hug Diamond. Goats fed, lots of hay and warm water. Raining but no wind and 41 degrees. More coffee needed and some food!! Hugs all around to everyone. Here's to a better 2013.",
      "MessageIndex": 1228,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 14, 2013 08:19AM luvmygoats wrote: Nihahi - translated Hispi cabbage. What would I do without Google?",
      "MessageIndex": 1499,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 17, 2013 09:10PM luvmygoats wrote: Edi - Brushed up on my English geography. Did not know where the Mersey River was. That's all I remember about where you live. Sounds like everyone is ready to hibernate in the snow. Your GD is adorable. I have been on a horse a few times. My last semester in college Oh about 40 years ago I took horseback riding for fun. Benny - you sound so GOOD! Know the pics of Diamond will cheer you up. Lay low for a few days. Are you getting the cold blasts the East Coast is set to get? We are going to miss most of it as its going further east. Hope the \"pipes\" as Edi says are doing better this time. Loved the cowgirl up picture. Googled \"Booty Up\" jeans and found they are sold here. Said WalMart; I don't think so. Also western wear which I don't go to but might have. Don't know if they will fit my W-I-D-E booty. Nihahi - Chinese sounds wonderful. We have a place here in town oddly enough has donuts and Chinese food. We call it the Chinese Donut place. It's OK but not the greatest. I lived in Hawaii as a child so really spoiled. Place about 10 miles away has really quite good Chinese, but never get there. I've not been out of the house since Sunday but getting out tomorrow for haircut and pick up a few groceries. Websister - Not sure I'm ready for grandbabies and KNOW DD is not. I barely seem to know what I'm doing these days. Hope everyone is having a good evening. Traii I can't keep up what time of day it is for you. Are you just getting up? TTYL",
      "MessageIndex": 1587,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 22, 2013 03:25PM luvmygoats wrote: Liefie - Ah what a nice French word and so grown up - accoutrement. No, not looking forward to DH's colonoscopy.  But I guess I will keep him after 37 years. Thanks for the shoutout about the mammo and in your pockets for your's next week.",
      "MessageIndex": 1735,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 28, 2013 05:49PM luvmygoats wrote: Nihahi - I've used Chinese five spice powder in some things or use garlic salt for the salt in it. Or maybe go Mexican with something slightly spicy or BBQ flavoring? I bought kale because its supposed to the the \"vegie du jour\" these days with almost mythical properties.  DH will eat most vegies, loves brussel sprouts which I can just barely stand. I have 2 stems of the kale left. May try the chips or use it some other way. Staying fresh in hydrator. Unfortunately I found a stem on the counter this am I had not used. My goats usually get leftover raw vegies but kale is the wrong type of vegie for them. They just had 3 very dead bananas, stems and all. I'm just too lazy to freeze them for banana bread.  ABC news tonight did a story on the amount of food a family wastes. I suppose I don't consider it waste if they eat it at least. Sometimes I go to the day old bread and buy them \"dollar bags\" (sounds like a bad drug deal LOL) of ripped bags etc. Wish it were not so out of my way when I go to town. Spinach is milder but I didn't find it had that weird mouth feel spinach has. The bite I had raw was OK, bitter, tolerable but like bitter greens in the packaged spring mix we get. I think mine was about $1.89 so not so much money wasted if I didn't like it so much. I have bought it b4 and just let it go bad in refrigerator.",
      "MessageIndex": 1888,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 3, 2013 12:06PM luvmygoats wrote: Keemo - About mooseballs - I think it was Liefie making meatballs with moose meat given to her husband.  I \"misunderstood\" and thought for a moment they were eating the dangly parts of a moose.  Which led to a fun discussion of all the parts of meat families ate years ago.  I personally have never (not that I know of) eaten or even seen on a plate any male dangly parts. Edi - bet the 2 of them actually had a good time rebuilding the shed. Dakota - 2nd Nihahi on the how do you have the energy question.  Take some \"Dakota Time\", OK??? Traii - Thinking snowy, cool thoughts for you. Bevlee - same cool thoughts for you. jmevans - will be in your pocket tomorrow. Is tomorrow oncologist or surgeon appt?  As others have said as you build your team your confidence in decisions will grow. Feel free to join in this crazy bunch.  From all over, England, Canada, USA, Australia, where else ladies have I missed. Bearcub - Hope the cold is on the waning side. Knock on wood have not had one this year even when DH had one. Nihahi - your energy ain't too shabby girl.  Loved the trail pics while nice and warm here at home.  Made it to Sunday School but skipped out on church and went to grocery. Websister - hope your son is on the recovering side of wisdom teeth extraction. Carla - How is the headache going today?  Better I hope. Know I have missed several. Apologies. I have trouble keeping up between chores, cooking, dog messing on the floor!!!!, goaties. Everyone have a restful Sunday. Prayers for Benny.",
      "MessageIndex": 2031,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 21, 2013 02:18PM luvmygoats wrote: Sorry Bennie I missed you.  How are things?  Hope you are busy and that's why you're not on here.  Love you.",
      "MessageIndex": 2396,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 1, 2013 12:52PM luvmygoats wrote: Oh Benny - Love you girl.  Most everyone on here (and I read a lot of threads, way too many to get my housework done properly) has some doubt on the treatment they pursued.  I didn't want chemo and chose not to have Oncotype even though I have now read of others who had low grade BC and high Oncotype.  How do I know if I made the right decision?  Only time and in the meantime I live life as it comes.  I think you've done MARVELOUSLY and don't think I could have coped as well as you have considering your circumstances.  Eggs/cottage cheese and with broccoli/onions sounds like a positive step forward in diet.  Screw the potatoes.  May you never have to eat another potato until YOU WANT TO.  There's always other carbs.  (Shall we make that our mantra??)  Glucerna, too, maybe with some extravagant ice cream stirred in.  I bet fresh air will improve your appetite.  Hope your good weather holds.  Wishing you blue skies.  I have finally resorted to Omeprazole for my GERD. I identify with scratchy cereals. Love that you have great weekend plans.  Sounds so positive.  Sheep/dog/chicken sitting sounds lovely and hopefully peaceful/relaxing.  Early May is still 2 months away for your clinic.  I know you probably have to commit to it (meaning money down) but let's get out the flags and think positvely you will be at that trail ride clinic.  I think some saddle time even on a sleepy stable horse is therapeutic.  Does someone else exercise Diamond for you?  Never had a horse so just wondering. On baby goat watch.  Have baby monitor up in barn.  One has been making \"mama\" noises but nothing yet.  Other one can hardly be enticed away from the hay feeder.  No clue how many they will have.  1st one making the noises had 3 babies 2 years ago.  Other one is first timer but is huge.  Hoping for at least twins as they are easier to kid that way rather than one BIG baby. Will try to respond to others on here later.  Know everyone on here has something they are worrying about today even if its only a little back of the mind thing.  May your day be peaceful and productive and as one on another thread says \"Go find your happy today\". Liefie and Nihahi - You have both missed your calling as counselors.  Both of you very wise women.",
      "MessageIndex": 2576,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Mar 5, 2013 03:06PM luvmygoats wrote: Traii - OK, I had my days wrong too.  I believe according to my world clock it is 9:06 am.  In your pocket TODAY.  You go, girl. Edi - Enjoy the steroid high.  Or maybe not knowing the crash is coming. Just spent the last hour and a half off and on watching pair of red tailed hawks first in front yard, then in back.  Non-productive day.  Read the paper and laundry on.  Now that's no great feat as laundry is just the other side of dining room table.  Only 2 cups (large ones) of tea.  Of course, no tomato soup in house.  Just what I crave with a cold. Don't know what's holding up the babies.  First one could have kidded yesterday but 2 weeks either way of that date; I saw her bred.  Only know when I took Mr. Bucky Boy out of pen for the last one as they were like teenagers and sneaky.  See no imminent signs in either.  Have yet to miss a kidding and don't want to start but darn it could interfere with my life. DD has asked me to the Dallas Stars hockey game March 23.  Would have to spend the night at her apt.  Co. they do business with gets a suite with luscious food of course so they will do more business with them.  Didn't feel up to it last year but had much fun the year b4.  Darn goats, get with it.  Of course, DH was off this past weekend.  Will they do it when he is off to help??  NOOO. But he has been the goat midwife the last 2 years when I was at work.  He is off Friday so I still have a little hope.  At least warming up towards the end of the week.  I have heat lamps out there but they are minimal and usually replace with real lights so I can see.  So warmer is better.",
      "MessageIndex": 2626,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Apr 12, 2013 08:43AM luvmygoats wrote: Just popping in 4 a minute to wish Nihahi and Dakota all the best today!!!!!!  Busy day jumping pockets.  Dakota you must be already done or nearly so; caught 0730 time on quick read thru.  Not sure of your time Nihahi. Be well sisters. TTYL",
      "MessageIndex": 3094,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Apr 24, 2013 03:02PM luvmygoats wrote: Hi all - Most everything is fine here.  Thanks Edi for asking/missing me.  I know I'm a sporadic poster.  Just have a few weeks when all hell breaks loose around the house, then retreats again.  Goats all finally taken care of, dehorned and boys neutered.  BUT had to have my oldest goat put down yesterday.  She was the last of my original herd. Had a really bad coughing spell, DH described almost seizure like while trying to breathe.  It was time. Cold here again yesterday relative for Texas. 40s and misty.  Much nicer today, sunny 60s though heat on periodically in house and it might have gotten close to freezing last night.  AC was out last week when it was upper 80s so that was my job to sit/wait for service call all d**n day.  Then gyno visit on Friday, yearly, then shopping.  DD and I went to Ft. Worth on Sat. with friends out for Mexican food.  SOOO looking forward to some down/alone time after last week.  I actually see an almost free May coming up.  Though I did promise to take 2 goaties to my vet's on May 4th for a playday.  Do you think I can arrange discount services for that?  LOL. Edi - last chemo next week?  WOW and done with rads.  Love that DH bought cookies for techs.  Don't they surprise you sometimes.  DH was so sweet yesterday with goatie; so glad it was his day off.  I pulled back Saturday bathing dog and cleaning out her crate.  Just today able to get around a little better without muttering with every step. Traii - even though I'm only just reading along here I could tell you were not as vocal.  Hang in there dear sister.  Kick that PS office for me. Edi or Liefie - PLEASE send your DHs for yard cleanup.  DH thinks it means get on riding mower, end of story.  I have ragweed taking over in places as well as giant thistles and some alien cactus/thistle cross thing I've never seen b4.  Looks like it could take your leg with one bite.  Jealous of water feature in yard Edi.  I barely remember to occasionally fill up birdbath.  I've lost some seed packets in house I just bought.  Dare not ask DH if he has seen them. Carla - You're done tomorrow?  WOW, TOO.  Lots to celebrate on here. Maria - Welcome here.  Lovely bunch of ladies.  Chatty, nutty, naughty and lovely.  They are the best at encouraging. Dakota - Rain came at just the right time for you for nice evening off.  Sounds like you're recovering from exchange nicely.  Love the pretty avatar. Nihahi - bye-bye alien and it sounds like just in time.  Oweee!  Sounds like you too are recovering.  Love that you, Movie and Liefie can share surgery tips. Websister - sounds like you have an even busier time than usual coming up.  How is your mom getting on? Will try to keep up better taters (or bellies per Movie). Benny, we miss you.  Hope rads is treating you as well as can be expected.  And that you are getting lots of time with giant plushed toy.",
      "MessageIndex": 3223,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "May 17, 2013 05:21PM luvmygoats wrote: Websister - pulling for those \"nothing there so where do we go\" kind of appointments. Time for us to circle around you, hold hands and pray for those results. Like Nihahi's suggestions - busy yourself with grad plans with your wonderful son and other family matters. Hope Rod is attentive as usual. Read through last part of your blog. I've read parts but not consistently. Your writing style is lovely. Have a restfully busy glowy weekend.",
      "MessageIndex": 3574,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 24, 2012 12:30PM luvmygoats wrote: Ah - Dr. Google says similar to magic mouthwash (Dr Akabutu). One recipe says saline, Cortef (a cortisone), lidocaine, glycerin and Nystatin. I would not be swallowing any with lidocaine in it. But this might be enough to get you started. You still might need Nystatin prescribed for thrush. Just keep at it little bits at a time, milky sweet warm, not hot, tea. See if colder or warmer is better.  Any chance you can puree some of the lentil soup, thin with cream??  (((HUGS))) Edi - sorry DD/GD are sick but you're right, not what you need. DH has a cold but went on to work today (retail though doesn't have a lot of public contact). I've got some frozen pork steaks out thawing as well as some leftover ham. Making the yummiest buttermilk scalloped potatoes that I could just live on. Will have to find a vegie in the freezer; think I have some brussel sprouts. (((HUGS, TOO)))",
      "MessageIndex": 1143,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Dec 29, 2012 02:36PM luvmygoats wrote: Yeah Benny - I have on a loverly mix too. Mens plaid shirt, maroon pants not quit sweats, red plushy socks and some kind of old gray sweatshirt jacket over it all. Thank God my DH does NOT expect a fashion plate. The sun is out and its actually got to 48 degrees. Don't know about thermal socks. I do know I change socks, well actually rotate pairs, every couple hours cause my feet get cold/sweaty. Know about laundry, too. Need to strip bed linens since I just bleached a load of towels and usually send something not too colorful thru after that. Praises for amoxicillin. I would think eggs might go down good with your lowly white potatoes. And they don't need much dressing up. If you can't handle the yolks just use the whites. I think Edi is talking about potato pancakes. Nihahi - Welcome to this crazy group.",
      "MessageIndex": 1202,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 2, 2013 03:44PM luvmygoats wrote: Benny - If you can handle it, yogurt is always good. I think most of the common brands have active cultures now. Hope Websister replies to you about OTC probiotics you have there. She was a great source of advice to you with her earlier post. Enjoy - if that's the right sentiment considering the reason for it - the LGFB class. You're definitely one step ahead with your cute wig. I like Edi's fries with egg wash. Bet that is somewhat how they get seasoning to stick on fries. Know my fav. ShakeNBake says dip chicken in milk. The onions might have been the clincher in soup; gas producer. Ginger maybe not so much since it is supposed to soothe nausea. Edi - glad your gas fire is going again. Finally had a little sun today. I've just been in the window soaking it up like a lizard. I had the bundled look yesterday. Flannel shirt, sweatshirt jacket, DH fleecy jacket, beany cap and scarf inside the house (DH added the scarf). Finally got a little bit warmer. We keep house at 68 but living room end of house is much colder with poorer insulation (added on). I might have go get a little electric heater for my feet. Benny you have posted since I started this. Can you tell I get up in between to do stuff? Love the BR ditty. Humor is great and I love to see it. Do wish as Lesleyanne says you could trade 1/2-1/2 symptoms. I can't imagine just one cough with those stitches. Here's to better health in 2013. I have mammo on the 14th then BS appt end of the month. Don't think much going on. MO appt in December was a yawner; don't see him again until June.",
      "MessageIndex": 1277,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 3, 2013 05:57PM luvmygoats wrote: Benny - Get anything you tolerate that sounds even remotely good to eat. Packaged puddings (there is a rice pudding in a big tub ?Kosy Shack?), malted milk powder into warm milk, just anything.  I know, money is, could be a problem but not talking anything extreme. I agree I can't do Gatorade and must admit I fed my DD Pedialyte but never tasted it. It might be a little salty. Might be able to dilute with water/apple juice. The cheaper apple juices to me are more watery and less tart.  Good you at least got to visit the big plush toy.",
      "MessageIndex": 1299,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 17, 2013 10:34PM luvmygoats wrote: No Nihahi - Just no reason to be anywhere and being a hermit.  Besides if I go anywhere I just spend money we don't have. This is a year in transition since I quit my job in November. Not sure how the budget will play out.",
      "MessageIndex": 1592,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 20, 2013 08:02PM luvmygoats wrote: Benny ((((sweet hugs)))) my virtual sister.  I like what Nihahi says not a wasted moment on what if.  We all have them.  You have given it your best.  Healing from here on. Rest in the meadow and feel the quiet.",
      "MessageIndex": 1664,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 22, 2013 03:58PM luvmygoats wrote: Yeah Benny.  Positive thoughts on fleet hooves to you.  Your house probably is very dry from the heat. A little steam should help. I woke up with sore throat this morning but think it was from snoring.  Did your friend get to send you pics of Diamond?  Glad you got your med schedule all written out.  You have a gameplan in place.  You need to do a public service promo on the white potato's benefits. Edi - I think Liefie is making moosemeat meatballs.  I misread and thought she was making moose you-know-what's.  Remember I am a Texan though I have never seen nor eaten a moutain oyster.  That's one for you to look up.",
      "MessageIndex": 1739,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Jan 25, 2013 08:02AM luvmygoats wrote: OHHH - ya'll have a nice snowshoe. I'll have tea and scones waiting with a warm fire. I love strong English tea. Have several packets of Taylors of Harrogate. Benny - where are you?  Hope your absence means only that you internet is down again. Virtual (((HUGS))) sister warrior. Yaaaah - Bearcub for being done with the rads.  Don't be surprised if fatigue gets worse during the next few weeks.  Eat your protein to heal those cells.  Enjoy your new found freedom. Liefie - I'm sorry to hear about your cousin. You can be a source of info for her. I took HRT also but don't beat myself up about it. What it is is what it is. I took it because they thought it lowered heart disease risk and my dad had terrible heart disease. When they decided it offered no protection for heart disease I quit it but was on about 5 years. Then both my parents died from cancer though smoking related my dad from bladder cancer and my mom from either stomach or pancreatic cancer. Not much cancer in my family though my maternal GF did die from Hodgkins lymphoma. Dakota - soccer again this weekend? I forget where you live. Hope everyone is bundled up warm tight. It was 79 here yesterday but much cooler today. Sat on porch yesterday and sunned my lily white legs a bit until the bees started to buzz me. Didn't think I smelled all that good since hadn't showered yet. Off shortly for DH's colonoscopy. So far he's tolerated the prep pretty good with little complaints for a man.  TTYL",
      "MessageIndex": 1810,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Feb 4, 2013 09:58AM luvmygoats wrote: Oh Websister - thank you so much for letting us know about Benny.  We will welcome her back with open arms and try not to overwhelm her with our love.  At her own pace. Glad your son is better. Your semesters must run a little differently.  Some US schools do start new semester about this time and was surprised when a friend's daughter just started her semester last week and they live about 60 miles away.  Not real common I don't think in Texas. Your mom is going back to the lodge or a different place?  Lodge is not a US term.  Is that a term for assisted living?  I must admit it is more pleasant sounding than either AL or NH. Hope everyone having a good Monday with minimal SEs.  Off to do chores.",
      "MessageIndex": 2042,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Aug 8, 2015 12:48PM luvmygoats wrote: CAMommy - Miaderm cream? Google radiation therapy creams and you'll see all kinds OTC. Usually the drier/freer at home you can be the better. Cream/hydrate/eat protein for cell renewal. I also used DH's old cotton hankies underneath to lift/dry a bit. One hint though I never tried it was to turn stuff inside out, camis and even pull on bras so the seams were outside not rubbing. Keys - sounds like you are ready to go. Might look for a cami or 2 to go over bra - should be on sale this time of year. Yup same for me, flattened under my scrubs but not floppy tatas. I did use after I finished therapy some lovely Calendula cream - California Baby. DH recently absconded with my jar to this bathroom.",
      "MessageIndex": 10,
      "PostDate": "08/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834044",
      "Title": "My RO didn't say anything about bras? CAMommy hodgy"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Aug 8, 2015 11:35AM luvmygoats wrote: Keys-Plez - No rules here other than play nice which you are certainly. All questions welcome. Same with me C/D and I really did not like to bounce. I'm not a bra liker anyway, 1st thing I take off when I get home. I bought front close sports bras from WalMart I think about $6.00 but that was 3 years ago. Your MO should (though not always I've read on here) have suggestions for creams to use. Aquaphor over the counter is common. There are others to use that can be ordered online OTC. My RO wanted Aquaphor and prescription X-Clair cream. Howdy Cookie.",
      "MessageIndex": 7,
      "PostDate": "08/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834044",
      "Title": "My RO didn't say anything about bras? CAMommy hodgy"
    },
    {
      "AuthorID": "luvmygoats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146228/profile",
      "Content": "Aug 8, 2015 11:25AM luvmygoats wrote: CAMommy - I found underwire bras poked right into area of SNB. Still haven't tried them. I wanted less jiggly/bouncy all around so I wore lovely - not - sports bras from WallyWorld. I was wearing scrubs mostly and it was hot sticky so whatever made me comfy. I felt much better bound down. I had one nicer bra for church wear. Has the RO given you any cream suggestions for rads? Surely with your LX being so fresh he has some specifics and with Canadian protocol too. I will say that I wore cheap camis over my bra and even the Aquaphor I had to use washed out of everything. I put my bras in the lingerie washer bags with towels and they washed beautifully. Oh yes as labelle says \"free boobing\" when you can. I had some irritation under boob but most of mine was nip area. You'll want easy on/easy off stuff since most of your time will be dressing/undressing. Take a bag with your cream in it and put it on there. I had 7:30 rads and went on to work. I took a fanny pack with my cell, keys, creams into rads. We had tiny lockers for our stuff and the fanny pack or something similar helped to not lose stuff among bra/cami/scrub top.",
      "MessageIndex": 3,
      "PostDate": "08/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834044",
      "Title": "My RO didn't say anything about bras? CAMommy hodgy"
    }
  ]
}