{
  "AuthorID": "LW0919",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
  "Posts": [
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Oct 21, 2015 04:52PM LW0919 wrote: hi Jen. I'm sure sone others will be along soon. In the mean time, I can't tell you about my experience. I went into chemopause for over a year (14 months). My period came back with a vengeance. It was pretty scary. However, it turned out to be submucosal fibroids and endometriosis. No cancer. She can definately talk to her gyno and have them assess her. They can do a biopsy of her cervix and ultrasound to rule out any serious issues. We'll keep our fingers crossed that your sister's issue is nothing serious. ",
      "MessageIndex": 1,
      "PostDate": "21/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/835934",
      "Title": "Period back after 17 months? Jenwith4kids zayb"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "May 25, 2014 10:06PM LW0919 wrote: rayofsunshine:   I just wanted to chime in and say to never let any of these specialist make you feel intimidated.  You should never feel foolish for realizing something is wrong with your body and having it checked out.  It's their job and our right!  Never feel bad about pushing for tests or procedures when you don't feel quite right about something.  I wish you the best of luck with your biopsy and that it will be benign.  ",
      "MessageIndex": 9,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821356",
      "Title": "Planning for excisional biopsy... rayofsunshine Mouche"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "May 26, 2014 02:32AM LW0919 wrote: Due to sudden and extreme heavy bleeding after no period for 14 months, my OBGYN also recommended a hysterectomy.  I had 7 uterine fibroids, some were sub-mucosal.  Because of my recent BC diagnosis, it was recommended to remove my uterus, cervix, tubes and ovaries.  They didn't see anything suspicious during the surgery and it went pretty well.  I have been taking it easy so as not to undo anything.  My surgery was done laparoscopically and my cervix and uterus removal were vaginal assisted.  I have3 small incisions, one on either side and one in my belly button.  Other than a bowel movement earlier today that felt like childbirth, it hasn't been too bad.  The soreness is tolerable.  I'm supposed to be out of work for 6 weeks but at this point feel like I can go back after my 2 week checkup.   I'm 42 and had been in chemopause since Feb. of 2012 so have been experiencing hot flashes.  I'm not sure what to expect going forward.  I know what I've read but guess we will wait and see. Hopefully it will not be too bad.   They send off all of the tissue and fibroids for biopsy.  I was told it takes 5 days to two weeks for the final reading.  I'm a bit nervous about the wait but most likely it will all be fine.  Still, I want to see and hear its 100% benign.   PS.  My husband has been helping out too.  It's not as good as we would do it, but bless his heart he tries!",
      "MessageIndex": 4,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 28, 2013 01:35AM LW0919 wrote: I'm 7 1/2 weeks pfc and have about an inch of hair growth all over. It's pretty thick and is a lot darker than it used to be. I noticed there is a lot more grey too. Things did get a little stressful over the last 7 months so I guess I'm lucky it's not all grey. I'm excited that it has started growing over my ears a bit. When it gets a little longer, I'm going to try for extensions. The wig is starting to itch again now that my hair is growing back. Not to mention that its sliding around now too. I'm worried I'll have it on crooked one day and not know.",
      "MessageIndex": 19408,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Mar 8, 2014 12:11PM LW0919 wrote: AKJ:  I never did shave mine.  I let it fall out and it was terribly difficult.  I think it just depends on the person.  I was in denial, hoping that it wouldn't actually fall out and I didn't have the courage to shave it.  My scalp started feeling weird and started to really hurt by around day 10-12.  By day 15 after my first chemo it was falling out by the handfuls.  I did cut it to just under my chin because it does fall out everywhere.  Best to luck in whatever you decide to do.  Hang in there, it does get better!",
      "MessageIndex": 20102,
      "PostDate": "08/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "LW0919 wrote: I went a week ago this past Friday for my 6 month follow up mammogram.  After waiting for over an hour for the results, at 5:00 I was told that everything looked good and they would see me next time.  I was fully expecting to get an ultrasound because that has been the norm so assumed that everything must have been very clear with no question this time.  What a relief, I didn't have to think about breast cancer again for another 6 months.   However, yesterday I received a letter from the breast clinic that began with \"your mammogram showed findings that we believe to be benign.\"  Seriously?  \"We believe\" is not a definitive clinical diagnosis!  Way to cover your ass breast clinic.  If they weren't certain then I should have received an ultrasound for clarification.  Why didn't I, was it because it was 5:00 on a Friday and everyone wanted to go home?  I am so furious.  After all that I went through last year, they are going to expect me to be ok with, \"we believe\". I will be calling my oncologist on Monday demanding an ultrasound or MRI.   The letter also went on to say that my breast tissue was determined to be heterogenous.  I've done quite a bit of research in the last 24 hours and have found that nearly half of all breast cancers are missed by mammography when the breast tissue is dense.  Luckily, as of late July of last year, NC is now one of only 12 states that is now required by law to disclose these findings to women.  An MRI or ultrasound provides much more definitive findings than the \"we believe\" that I was given.  So that means there are 40 remaining states in which this doesn't have to be disclosed and when women are given the thumbs up from their mammogram, they're not given the whole story.  It's very misleading and can be dangerous, not to mention deadly.  I came across this great website for women with dense breast tissue, it's called areyoudense.org.  So very informative.  I recommend everyone go check it out and learn more.  We have to be our own advocates and ask questions and push for what we need rather than just trusting that the health care system is always looking out for our best interest.   So, as you can see...one year later, I'm still thinking about breast cancer and probably always will.  Life and my perspective on it has been changed forever!  I value it so much more now.   Oncotype 20 ~ Age 41 at diagnosis Dx 12/27/2012, IDC, Right, 1cm, Stage IIA, Grade 2, 1/3 nodes, ER+/PR+, HER2- Surgery 1/22/2013 Lumpectomy: Right Surgery 1/22/2013 Lymph node removal: Right, Sentinel Chemotherapy 2/20/2013 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 7/14/2013 Whole-breast: Breast, Lymph nodes Hormonal Therapy 9/16/2013 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 5/21/2014 Prophylactic ovary removal Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/816750",
      "Title": "Mammogram - Dense Breast Tissue LW0919 Beesie"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jan 22, 2014 08:37PM LW0919 wrote: My last chemo was in mid June of this past year (2013).  I've had one hair cut and now have about 3 1/2\".  I've always had really long hair, so the short pixie style is still something I'm trying to get used to.  It seems like it takes forever to grow especially in the beginning when you just want hair SO bad but when it starts, it fills in pretty quickly.  I've just started using a flat iron on it some now that it's just long enough that I won't burn my hands.  I love my flat iron, oh how I missed it!  I too have bald pics and took them all along the way as my hair fell out and started growing back.  When I look back on them, I feel so very grateful for making it through and it makes me realize how strong I was/am.  You all are too, it's hard to go through what we have all gone through but we've done it and still are doing it!  Hang in there, I'll keep being patient too! ",
      "MessageIndex": 19934,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jan 23, 2014 08:45PM LW0919 wrote: Thanks everyone!  I'm still a little self conscious about my hair so y'all have made my day!  I have been taking biotin every day.  I figured it couldn't hurt and maybe it has helped?  It didn't come back in the color that was in the pic, it came back almost completely white.  I colored it as soon as I had enough to cover my scalp, it only took a squirt of coloring and about 30 seconds to cover it all!  I've just started using a bottled keratin treatment after every other wash too.  Before chemo, I had laser hair removal on my face and bikini area and after chemo was over all of that hair started coming back too!  It's back to plucking and shaving.  You take the good with the bad I guess!  I'm always looking at others people hair too.  The worst is when people complain about how their hair looks as they are running their hands through their long luxorious mane of hair, I still have to bite my tongue!  ",
      "MessageIndex": 19947,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Sep 23, 2014 09:52PM LW0919 wrote: My eyebrows and eyelashes are still not to the volume they used to be.  I use a brow pencil by Anastasia, you can get it at Sephora.  It stays put and my brows look perfect.  As a matter of fact I used it when I had no brows and you couldn't tell.  Great product.  As for eyelashes, I'm excited that I just found a new product last week.  It's called younique and it's not in the stores, you had to buy from a distributor.  My hairdresser was selling them, that's how I heard about it.   It's amazing!  My eyelashes look like I've had lash extensions when I haven't.   As for hair I'm finally back to my natural hair color!  With a few low/highlights of course.   My avatar pic is me, 14 months PFC after 2 trims.  I'm finally feeling pretty good about my bangs.  It took awhile and went through some awkward stages but think I'm getting close to being content with it.  ",
      "MessageIndex": 21125,
      "PostDate": "23/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Mar 7, 2014 02:34PM LW0919 wrote:  Hi everyone.  This week marks a milestone for me.  Exactly one year ago, my hair started falling out from chemo.  I lost all of my hair with the exception of a few strands in the back.  I finished chemo at the beginning of June and have had one hair trim since.  I recently had coloring put in and this pic is me now.  Exactly one year after loosing my hair.  It's been a long, frustrating journey and I still have a ways to go but am finally happy with my hair and have started wearing my short pixie cut to work.  I bagged up all of my wigs, scarves, hats, etc and dropped them off at cancer services 2 weeks ago and the feeling was so liberating and then I cried like a baby.  I cried because I reflected back on it all and it was hard!  The hair loss was the hardest part.  To all of you just beginning the regrowth process, hang in there!  It will grow back!   Some of you mentioned eyebrows, I used a kit from Sephora made by Anastasia of Beverly Hills and it was great.  It was kind of pricey but to me it was worth it! ~Lori",
      "MessageIndex": 20093,
      "PostDate": "07/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Mar 8, 2014 12:01PM LW0919 wrote: Thanks y'all.  It never seems to come in fast enough!   Shoppygirl - I had a wiglet too that I wore up until a couple of weeks ago.  They are definately better than a full wig but the little clips would sometimes rub a little sore spot on my scalp but still felt better than the wig.   One thing I realized I always took for granted was how amazing it feels when I feel my hair move as the wind blows through it!  ",
      "MessageIndex": 20101,
      "PostDate": "08/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Sep 10, 2013 07:58PM LW0919 wrote: My hair started to really fall out just after 14 days from my first chemo. It was 98% gone by the 2nd chemo (mine were three weeks apart). I kept most of my eyebrows until just before the last treatment. I had a total of 6. The eyebrows and eyelashes all came of at the same time. I had maybe 3 or 4 eyebrow hairs left on each side but 0 lashes. I used Anastasia brow kit from Sephora. It was expensive but worked wonders. You couldn't tell I was brow less. I tried false eyelashes but that didnt work at all for me. Now, 12 weeks PFC, I have 2\" of thick full hair, all of my eyebrows and very thick but still short eyelashes. I had laser hair removal on my face and nether regions just a few months before chemo but when my hair started growing back it came back everywhere even the treated areas.",
      "MessageIndex": 19483,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jun 2, 2013 07:31PM LW0919 wrote: Did anyone do extensions when you're hair started growing back? I really miss my hair and it will be at least another year, maybe two before it gets back to its original length. I'm impatient already...I felt like I was going to have a heatstroke with my wig on yesterday and it was only 86 degrees. I have one more treatment so it will be a while before I can even plan for extensions but just wondering if anyone else had tried and had any luck with them?",
      "MessageIndex": 19297,
      "PostDate": "02/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jun 6, 2014 07:45PM LW0919 wrote: Hi everyone.  I had to log in today as it marks the one year anniversary of my final chemo.  Wow, I can't believe it's been a whole year.  In looking back it almost doesn't seem real.  I've been fortunate to not need any further chemo or radiation.  I did have to have a full hysterectomy (uterus, cervix, tubes, ovaries, the whole 9 yards) a couple of weeks ago and was again fortunate that all the results came back benign.  That's what this past year has been for me, a time to realize how fortunate I am and appreciate the blessings when they are received.  I've posted a pic I took today below of my hair growth exactly 1 year PFC.  I remember when I was going through chemo and was completely bald for what seemed like an eternity and I would stalk this board and other blogs to see exactly when other peoples hair would grow and how long it would take to get to a certain milestone.  For those of you at that stage, hang in there!   ",
      "MessageIndex": 20424,
      "PostDate": "06/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jun 13, 2013 10:29PM LW0919 wrote: I developed a fungal infection on my chest torso area after the 3rd and then again after the 4th treatment. I was given something oral but it wasn't steroids, it was some type of antibiotic. It finally cleared up. I was told to use triple antibiotic cream on the rash itself and it helped with the itching. I did have an allergic reaction during one of the infusions and was given Benadryl by IV and it calmed the reaction down. I hope you can find some relief. Being uncomfortable with no end in sight is the pits.",
      "MessageIndex": 11,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769465",
      "Title": "Itchy rash/hives from Taxotere??? mdg doxie"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 3, 2013 09:03PM LW0919 wrote: GWTF: that's too funny! What a great idea! Slv58: they are doing the right breast, axillary and armpit area because of the lymph node involvement. They told me that they expect to see scarring at the top of my lung afterwards. I guess that is to soften the blow, since they are stating that fact early on? Are you getting multiple areas done? I guess the larger the area they treat the greater the chance for a reaction. I'm a little worried about that. I don't want my skin to bust open! My RO is sending me to the lymphedemia clinic too. Hopefully it will be in vain!",
      "MessageIndex": 756,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 25, 2013 10:19PM LW0919 wrote: For me, it takes about 15-20 minutes. I had lymph node involvement so they do 3 different areas, the breast, under the arm pit and then the super clavicular area (collar bone). They come back into room to adjust the machine and punch in codes for each new setting before going back out and closing the metal door so it isnt like i was left alone for the entire time. It couldnt have been more than 5 minutes each time. I think I was just exhausted from a long week of working 10 hr days. Here's what I don't understand, the thing (machine) gets right up in your face so I asked if I should be wearing goggles. They said it was so precise that it pinpoints a certain area and is down to an exact science but then they all leave and shut the big metal door!! So I close my eyes (like that's going to help) thinking I'm doing something to protect me from going blind!! I must not be too worried though since I fell asleep with both boobs hanging out and radiation beaming out of a machine 6 inches away from my head!",
      "MessageIndex": 1155,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 28, 2013 06:22AM LW0919 wrote: I had my 8th treatment yesterday and today broke out in a rash under my treated breast. It is itching and I want to scratch it soo bad but think its probably not a good idea. I put hydrocortisone cream on it and it seems to help a little. Isn't this too soon to already have a skin reaction of any kind? I have some leftover hydrocodone too from prior surgeries...I'm keeping it on standby just in case things get rough!",
      "MessageIndex": 1180,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Sep 5, 2013 07:45PM - edited Sep 5, 2013 08:34PM by LW0919 I finished up on Tuesday! I have to say its been absolutely fantastic to just come home after work and not have to go for treatments. My skin held out. I didn't think it would. All in all, no major issues. I used tons of aquaphor and some udder cream along with corn starch. i stopped using deodorant all together around treatment 19 or so. It didnt work anyway, I needed industrial strength. I just want to say to you all still going through it or just beginning, hang in there, count them down and it will eventually be over. I feel so free now!!",
      "MessageIndex": 1467,
      "PostDate": "05/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Sep 5, 2013 08:46PM LW0919 wrote: Thanks Nancy! Drago: my RO asked that I wait a couple of weeks to start Tamoxifen to give my skin a chance to clear up. I'm ok with that! A couple of weeks of nothing...just being normal (except for the 2\" hair)! As for the genie bra...it would depend on the size of your breasts. There is absolutely no support with them. I'm a DD and a D after lumpectomy and had to keep wearing an underwire for support. I just wore it over a cami with another shirt on top or I would wear a piece of a cut up cotton tshirt up under my bra. If I wouldnt have worked, I would have just let the girls go free!",
      "MessageIndex": 1472,
      "PostDate": "05/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 25, 2013 09:13PM LW0919 wrote: Thanks that's a relief. All I could think of was that they screwed up and wanted to see how much damage was done! I fell asleep on the table today. I mean knocked slap out. I was awakened when one of the techs freezing cold hand touched my boob to pull the wedge out from under my right boob. I nearly jumped off the table. It scared both of us!",
      "MessageIndex": 1151,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Aug 12, 2013 12:19AM LW0919 wrote: My armpit area is really red with some places that are purple and and almost black. It looks like someone as punched me really hard in the armpit and is so sore and tender. Tomorrow will be 19 and I have a total of 33 planned. I'm really hoping I can hold out. Anyone else had these results this early?",
      "MessageIndex": 1286,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Oct 22, 2013 05:06AM LW0919 wrote: At around day 12 my scalp felt weird and tingly. Then within a day it was really sore. I remember being at work and seeing my hair lying on my desk. When it started it happened fast. The shower was where the real shedding happened. It was traumatizing for me, like someone had died. I think for me it was the worst part of the whole journey. I never shaved. I cut my hair to about chin length and let nature take its course. I still had a little on the sides and bottom and it would stick out from under my hat. I held on to it as long as I could. It's tough, my thoughts are with you.",
      "MessageIndex": 11,
      "PostDate": "22/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/813182",
      "Title": "How fast did your hair fall out? JennH8 JennH8"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Dec 26, 2013 07:54PM LW0919 wrote: Diagnosed one year ago tomorrow at the age of 42.",
      "MessageIndex": 183,
      "PostDate": "26/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Dec 28, 2014 07:55PM LW0919 wrote: Hi Hope40. I've had and still have joint pain and stiffness. My lower back is the most painful to me. I was diagnosed with arthritis at 43. Not sure if the chemo or tamoxifen had/has a hand in that diagnosis or not. I too am hoping to it gets more manageable in time. For now, I take lots of ibuprofen and use my mom and dad's hot tub for relief when I can. I hope you feel better soon!",
      "MessageIndex": 2,
      "PostDate": "28/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/827213",
      "Title": "Bone and joint pain Hope40 dunesleeper"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jun 14, 2014 10:21PM LW0919 wrote: Lisa:  so sorry to hear you were diagnosed but very glad you pursued the testing.  We know our bodies best and when something doesn't feel right.  Best of luck to you.  ~Lori",
      "MessageIndex": 6,
      "PostDate": "14/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821092",
      "Title": "Should I pursue an MRI mel147 LW0919"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jan 2, 2014 12:03AM LW0919 wrote: Hi Katie.  I'm so sorry you spent your Christmas with this heavy burden.  I had my biopsy on December 20th of last year and received the diagnosis on 12/27/12.  The holidays were extremely difficult and I barely tolerated them because of the building anxiety.  I had a lumpectomy on 1/23 which was almost 4 weeks later.  There are other tests that they may have you do that will help determine whether a lumpectomy or mastectomy is suggested.  The genetic testing usually is next  as well as MRI's and possibly a PET scan.  All of these tests along with your surgery and final pathology help determine a treatment plan.  The waiting is excruciating.  That and the not knowing was the worst part of it all.  I won't tell you not to worry because anyone would, we all do but will tell you that we all understand and are here for you.",
      "MessageIndex": 6,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816373",
      "Title": "Wait time between diagnosis and surgery katiegrey Pupcake"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 3, 2013 09:37PM LW0919 wrote: GWTF: are you a matchbox twenty/Rob Thomas fan? I saw your tag line and it reminded me of a Rob Thomas song \"Fire on the mountain\" with a slight change referencing the breast of course!",
      "MessageIndex": 763,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 17, 2013 11:38PM LW0919 wrote: How soon did y'all start wearing something other than a bra? I have DD's,well 1 DD and 1 D since the lumpectomy. I'm not sure a Cami is going to cut it. My MO suggested wearing my bra over a cotton shirt and then another shirt over that. It's so hot though. Just curious what everyone else has been doing?",
      "MessageIndex": 1010,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 18, 2013 10:16PM LW0919 wrote: Is there anyone on the board that found that Tom's deodorant worked for them?? Day 3 of wearing it and I can smell myself! I even tried reapplying several times today. Thank goodness I have a desk job and only get sweaty during hot flashes and tat I can wear regular deodorant on the left side. Does anyone have suggestions on how not to stink for the next 6 weeks?? Also should I already be itching under my treated boob after just the second treatment? I'm hoping its just a random itch and not already the beginning. I was hoping o have a little more time before I actually started feeling it. I'm going to try a sports bra. I work in the corporate world and don't think I can get by without a bra and 2 big boobs. Today I wore a camisole with my underwire bra on top of it and a shirt over that. I felt ridiculous!",
      "MessageIndex": 1026,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Aug 4, 2013 11:52AM LW0919 wrote: Patricia: Friday was round 13 for me...a little over 1/3 of the way through. I have woke up several times at night and in the AM with dry mouth, I assumed it was from the rads. What else could it be?? Sometimes I think our docs just say that it isn't an SE when clearly it is. I can't wait to be finished with the daily drive to the rads appt. everyday at 6pm. What I'm looking forward to the MOST is being able to wear regular deodorant! I'm so self conscious of how my right arm pit smells. I try to keep people on my left side (the pleasant side slathered in Secret clinical strength deodorant) when I'm talking to someone. I can smell myself now...uggghh!!",
      "MessageIndex": 1229,
      "PostDate": "04/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Aug 5, 2013 08:00PM LW0919 wrote: I had # 14 today and am a little worried because the rash under my breast started to bleed today. My RO thinks it is a yeast infection. The skin in my under arm area has cracked open in a couple of places. I'm not even half way through yet. I'm hoping my skin holds out.",
      "MessageIndex": 1237,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Aug 17, 2013 02:44PM LW0919 wrote: Has anyone had dark spots appear on their nipples? I just noticed they have popped up since last night. I'm hoping this is normal?? I've had 22 out of 33 so far.",
      "MessageIndex": 1338,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Aug 18, 2013 02:29PM LW0919 wrote: The spots do look like freckles. Last night, I began noticing that I couldn't lift my arm over my head. I have alternated gobbing on udder cream, aquaphor and aloe but it's still so tight it feels like my skin is going to split open if I lift it any higher. It even burns when i put the cream on. The only relief I get is from soaking a washcloth in cold water, rolling it up and putting it under my armpit for a bit. My armpit is all black now, what was purple turned to black. How will I do a treatment if I can't lift my arm up? Sleeping last night was such a fight, it's getting so uncomfortable. I am concerned that I won't be able to finish the treatments. I'm so ready to be done with it all!",
      "MessageIndex": 1346,
      "PostDate": "18/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Aug 20, 2013 10:14PM LW0919 wrote: GWTF: I've used a ton of udder cream, globed on aquaphor and recently started using aloe too. A wet washcloth rolled up and shoved under my arm feels fantastic. Oh and today I put the aloe in the fridge and it felt so good. My skin is starting to come off in a few places under the arm. Its so spraw. They adjusted the treatment field and moved it over slightly so that it wouldn't hit the same areas under my arm just to give that area a bit of a break. It's black and grey and looks horrible. Four more regular treatments plus 5 boosts left and I'm done!",
      "MessageIndex": 1355,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Sep 2, 2013 11:01PM LW0919 wrote: You're in the home stretch Tangles! Once the boosts started, everything else began to feel better. We did it and our heads didn't explode from all the chemo toxins and radiation!",
      "MessageIndex": 1447,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 3, 2013 07:57PM LW0919 wrote: Hi everyone. I've finally made my way over from the chemo boards. I went to see my RO today for mapping. Lots of people in the room looking at my boobs. I should be used to it by now but it was still a little awkward. The tattoos weren't too bad just a little uncomfortable. My first treatment is scheduled for next Wednesday. I am ready to get these 33 rounds over with! I hope it goes by fast.",
      "MessageIndex": 751,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 17, 2013 10:21PM LW0919 wrote: Hi everyone. I finally had my first treatment today. I thought I was supposed to start last week but I showed up and found I had the wrong date. Chemo brain again! So, I'm trying to get past the discomfort from lying there with my boobs on display while every one stands around and looks at them.",
      "MessageIndex": 1003,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 20, 2013 09:09AM - edited Jul 20, 2013 09:13AM by LW0919 Lorettaloretta: not sure who you were referring to when you mentioned having chemo but know it depends on many factors. Nodal involvement being a big one and also Onco score, grade and age too. Thanks for the suggestion Heart. It's worth a try. I'm off to purchase peach scented Toms deodorant. I noticed some of you referring to the sharpie marks. Do you keep them all the way through? I was told I could wash them off. I did get 6 tattoos that they use when lining the machine up. Do you have those too? I'm thankful to not haveyo keep those marks all the way up my neck!",
      "MessageIndex": 1057,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 25, 2013 09:01PM LW0919 wrote: I had a fantastic 6 week break after my 6th and final chemo before the actual rad treatments started. I felt like a normal person for a while, no weekly or daily dr visits. I enjoyed every minute of it. Back to the veins though, just had my 7th rad treatment...only26 more to go. Yesterday, the techs did X-rays again before starting the treatment. They said they do them every so often to make sure everything is going ok....? I keep thinking about that and the statement. Did any of y'all have more xrays throughout rads?",
      "MessageIndex": 1148,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Aug 31, 2013 09:59PM LW0919 wrote: I have 1 rad treatment left...yay! I go Tuesday for my final hurrah. I think I will run out of the building and high five everyone I see now that I can lift my arm again without it feeling like my skin is going to spilt. I have to say the boosts couldn't have come at a better time. My underarm was screaming at me.",
      "MessageIndex": 1445,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 3, 2013 09:29PM LW0919 wrote: I had my biopsy on 12/23 which was my Son's birthday, spent Christmas worried to death and then was diagnosed on 12/27, my Mom's birthday. Needless to say New Years was a bust. This year has definitely sucked! It's starting to get better now that chemo is over but I'm with you Jen987 we should all be awarded with a \"do over\"!",
      "MessageIndex": 760,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Aug 16, 2013 09:15PM LW0919 wrote: Today would have been #22 for me but got a phone call just before my appointment that the machine i was scheduled for was broken and needed to be repaired. I was SO happy to have the day off. My poor black and purple armpit needs a freaking break! So, it's a 3 day weekend for me. Earlier this week the bed got stuck in the \"up\" position. I wound up climbing down and using a chair to step on to get to the ground. I think it may be time for new equipment. In looking at my EOB's, my insurance co. alone has paid enough in to have bought some new equipment!",
      "MessageIndex": 1329,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "LW0919",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175577/profile",
      "Content": "Jul 18, 2013 10:36PM LW0919 wrote: The Neulasta shot caused some very uncomfortable spine pain for me. It would literally take my breath away. Taking Claritin helped alleviate the pain (hydrocodone helped too) but there was still some breakthrough episodes. Hope you find the cause and start to feel better soon.",
      "MessageIndex": 10,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/807916",
      "Title": "Pain on day 7 after 1st chemo treatment. What can I do Kathie100 vballmom"
    }
  ]
}