{
  "AuthorID": "LYCM85",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170276/profile",
  "Posts": [
    {
      "AuthorID": "LYCM85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170276/profile",
      "Content": "LYCM85 wrote: Hi! I found this board while looking for information! Glad I did! Two weeks ago, I found a lump in my right breast. It seems hard to me, but not like a rock. Last Thursday, I saw my cfnp, and she could also feel it, said it seemed like a 1.5cm mass, but to her it felt mobile and she thought that was a good sign. She said that my tissue is too dense for a mammogram. (I'm 27) She referred me for an ultrasound, and I went today for that. The lump is easiest found when I lay flat because it is near the center of my chest and fairly deep, close to my ridge. When I did my u/s today the girl marked it with an x, and then had me turn on my left side. She claimed she couldn't find anything. I'm assuming because when I rolled over to the left, it shifted tissue on top of the mass and it was too deep to find. I could see on the screen what looked like an irregular shaped black area, that was pushing up on my actual tissue. They didn't see anything wrong with that. I called my cfnp and she is referring me to the doctor that handled my moms breast cancer. I go in 10 days. I'm very confused! I don't understand why I can feel it, and my doctor can feel it, but it didn't show up. Has anyone else had this? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    },
    {
      "AuthorID": "LYCM85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170276/profile",
      "Content": "Feb 21, 2013 08:06PM LYCM85 wrote: What is snb? I know this particular doctor does core samples on the nodes, so if it comes back malignant, he will probably do test to make sure it's not anywhere else in my breasts or lymphs.",
      "MessageIndex": 23,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    },
    {
      "AuthorID": "LYCM85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170276/profile",
      "Content": "Feb 13, 2013 08:42PM LYCM85 wrote: I absolutely agree! Life is stressful enough. That's a burden no one should carry if they don't have to!",
      "MessageIndex": 12,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    },
    {
      "AuthorID": "LYCM85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170276/profile",
      "Content": "Feb 11, 2013 06:04PM LYCM85 wrote: They referred me to a BS and he will determine what else to do. I'm not clear as to why they didn't do a mammogram. The new doctor will probably do one, or try something different. The doctors dont think my insurance will cover a second u/s. Mine is at about 5:00, just underneath. I'm glad that so many of them are B9!",
      "MessageIndex": 3,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    },
    {
      "AuthorID": "LYCM85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170276/profile",
      "Content": "Feb 17, 2013 07:59AM LYCM85 wrote: Busy with five how did you know I was about to do laundry? Haha! I'm gathering it all up now. Kelley thanks for asking which b9s can become cancerous ad bdavis thank you for answering. I picked up my us films yesterdayand there is no lump to be seen anywhere although there is a great big section of tissue that is clearly being pushed up by something underneath. That's exactly what she said was that at my age its too dense. If I was five or ten years older they probably wouldn't hesitate. They said my moms cancer was not a hereditary kind, because there was no record of anyone else having it but now that she's had it I feel like its my duty to make sure I don't!",
      "MessageIndex": 17,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    },
    {
      "AuthorID": "LYCM85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170276/profile",
      "Content": "Feb 21, 2013 02:35PM LYCM85 wrote: Update! I met with the surgeon today, and he did a new ultrasound. Its a 2cm solid mass, and he said it doesn't look cancerous, but there is only one way to tell for sure. So, on April 5, I'm having it surgically removed. Bye bye lump!",
      "MessageIndex": 19,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    },
    {
      "AuthorID": "LYCM85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170276/profile",
      "Content": "Feb 13, 2013 07:47PM LYCM85 wrote: I'm definitely unclear as to why they didn't do the mammogram, but she did say she wants to have it taken out either way, and that makes me happy. Even if it's nothing, I don't want to keep finding it! I don't think I could stand having it for three years. I'm really set on the idea that I want them to move fast, because even though it could even be something silly like a lump of fatty tissue, my mom was stage 3 when she was diagnosed, but had they listened to her a year earlier when she said it hurt, her treatments may not have been so rough. (She had 3rd degree radiation burns, all the way to her face.) I'm all for the idea of \"do what it takes, just get it out!\" Mom is the only one who has had breast cancer but we have a big family history of cancer in general (throat, cervical, vulvar, kidney...), so I'm trying to stay on top of things. And bdavis, you said you had ADH and it increased your risk? I dont want to sound uneducated, but I dont know what adh is.",
      "MessageIndex": 9,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    }
  ]
}