{
  "AuthorID": "LymphActivi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
  "Posts": [
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Mar 7, 2014 11:34PM - edited Mar 7, 2014 11:35PM by LymphActivist It would be wise to not wait until it becomes \"full-blown lymphedema\". Prolonged swelling is accompanied by tissue changes which make subsequent treatment more difficult. A recent study found that early treatment by manual lymph drainage may even be able to prevent lymphedema. The experiment group was given manual lymph drainage from 2 days after breast surgery for six months, and had no swelling, while the control group had 10% excess lymph fluid at that same time. [Ref. Efficacy of manual lymphatic drainage in preventing secondary lymphedema after breast cancer surgery\", Zimmermann A, Wozniewski M, Szklarska, A. Lipowicz, A. Szuba A. Lymphology 2012;45:103-112]",
      "MessageIndex": 8,
      "PostDate": "07/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/818843",
      "Title": "Truncal lymphedema Mommyathome live_deliciously"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Nov 13, 2016 03:02PM LymphActivist wrote: Breast lymphedema is a common consequence of breast irradiation. You may read about this condition and its treatment on my web site at: http://www.lymphactivist.org/breast_lymphedema_for... Discuss it with your primary care physician and get a referral to a lymphedema trained therapist for an evaluation and treatment if appropriate.",
      "MessageIndex": 1,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/850027",
      "Title": "Breast Lymphedema or fibrosis maria26 LymphActivist"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jul 11, 2014 07:36PM LymphActivist wrote: Rubiayat: Call your therapist's office and find out what are the letters after her name? Does she show CLT or CLT-LANA? That is the only way to tell whether she has had a full training in lymphedema management. PT, OTR, PTA, OTA are not sufficient. Does your PT have a treatment plan? If so, how will progress be monitored and how will achievement of treatment goals be determined? Call your physicians' offices and request your medical records with a record of what the basis is of the physician's determination that you did not have lymphedema. Were any tests or imaging performed? You have to determine the competence of your medical providers before you take any action.",
      "MessageIndex": 3,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822690",
      "Title": "Lymphedema aggravated by PT - what to do? Rubiayat Rubiayat"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jul 5, 2014 09:54PM - edited Jul 5, 2014 09:55PM by LymphActivist I'd like to add another anecdotal case to hugz4u story about what is possible with conscientious care of BCRL. My dear wife Pearl is a breast cancer survivor of 22 years. She had 21/24 positive nodes and went through modified radical mastectomy, radiotherapy, chemotherapy and hormonal therapy--\"the works\". Five years of medical neglect and three misdiagnosed cellulitis events later we found the treatment, i.e. complex decongestive therapy (CDT), and have been practicing it since. I bandage Pearl almost every night after she performs her simple lymph decongestion (self-MLD). She exercises in her compression sleeve and gauntlet every day. Her new oncologist (Head of the Oncology Department, no less), when he first saw her arm 15 years ago commented \"But you have such a mild case\" she responded \"Dr. xxxx, That's like being a little pregnant.\" When Pearl related this story to her lymphedema therapist, she responded \"Did you tell him that it looks this good because you control it every day with CDT?\" He had no clue! But today, it is hard to tell she has lymphedema. It has somewhat localized pre-fibrotic areas that require extra work, and spills out into her trunk a bit, but it is under control. And what is most important, Pearl has the tools to self-treat when she detects that her arm is \"filling up\". You can meet Pearl on our web site at http://www.lymphactivist.org",
      "MessageIndex": 17,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822493",
      "Title": "Have trouble getting your Doctors to understand your Lymphedema? Meggy glennie19"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jul 5, 2014 09:23PM LymphActivist wrote: Interesting and valuable thread! Re Primary Care Physicians (PCPs): In addition to your trained therapist you need a primary care physician who treats your other medical problems and has a basic understanding of the pathophysiology of lymphedema. Lymphedema is being found to be intimately related to different body functions and systems, and your physician must make sure that your lymphedema treatment is coordinated with treatment for any other co-conditions you may have. Lymphedema is related to your heart and circulatory system, your immune system, your nervous system and your endocrine system and is not, as previously depicted, just a \"plumbing problem\" involving clogged or missing lymphatics. Since American-trained physicians are not trained in lymphology, you must find a physician who has picked up knowledge of the lymphatic system and its problems either through extra training courses or through experience with prior patients. Often it is the patient who must bring medical articles on lymphedema to their physicians. Re Importance of Early Care: You must be insistent on receiving early care of your lymphedema. In some recent small studies it has been indicated that lymphedema might be preventable with early intervention. The following is an abstract from my correspondence published in the Journal of the American College of Surgeons July 2013: \"Current medical and economic studies support early detection and prevention of disease as a cost-effective means of avoiding progression to harder-to- treat stages. The “prospective surveillance model” is a proposed lymphedema care delivery system that would define early-stage breast cancer-related lymphedema when swelling reached 3% during the first year after breast cancer treatment. Lymphedema detected with this criterion would be treated with an inexpensive 20- to 30-mmHg compression sleeve for 1-month periods [Stout Gergich NL, Pfalzer LA, McGarvey C, et al. Preoperative assessment enables the early diagnosis and successful treatment of lymphedema. Cancer. 2008;112:2809-2819] Maintaining the lymphedema at a sub-clinical stage during the first year will prevent or retard the destructive tissue changes in a swollen lymphedema limb that define the progression of lymphedema. Another lymphedema care delivery model based on lymphedema early detection and intervention would provide manual lymph drainage (MLD) to the limb of a breast cancer patient from the second day after treatment and throughout the first year. The 6-month study included trial groups undergoing sentinel lymph node biopsy (SLNB) and axillary lymph node dissection (ALND), with and without radiotherapy. The investigators measured percent excess arm fluid and provided intervention to all members of the intervention group. Although average excess fluid due to lymphedema in the women in the control group, who received no MLD, grew monotonically from zero to +10% at 6 months, the average excess fluid dropped monotonically in the MLD group from +1% to -1.5% [Zimmermann A, Wozniewski M, Szklarska A, et al. Efficacy of manual lymphatic drainage in preventing secondary lymphedema after breast cancer surgery. Lymphology. 2012;45: 103-112] The onset of lymphedema after surgical breast cancer treatment may not occur until 7 months (range 1 to 37 months). After a combination of surgery and radiotherapy, the onset of lymphedema may be a longer 12 months (range 1 to 52 months), and for radiotherapy only, 25 months (range 6 to 156 months) [Pierquin B, Mazeron J-J, Glaubiger D. Conservative treatment of breast cancer in Europe: Report of the Groupe Européen de Curiethérapie. Radiother Oncol. 1986;6:187-198]\"",
      "MessageIndex": 16,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822493",
      "Title": "Have trouble getting your Doctors to understand your Lymphedema? Meggy glennie19"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Apr 29, 2014 08:15AM LymphActivist wrote: Lia, Doppler studies image blood flow, and are usually used to determine whether swelling (edema) is due to obstructions or valve problems in the venous system. It is not useful for visualizing lymphatic flow. It is an important tool in differentiating whether the swelling is caused by venous or lymphatic dysfunction, and then guides the treatment and compression garment characteristics necessary for maintaining the swelling. An excellent and easy-to-read article on the use of various types of imaging to diagnose lymphedema may be found in \"Imaging of lymphatics, LE and lymphatic function\" by Prof. Neil Piller, Journal of Lymphoedema, 2011, Vol 6, No 2 I would suggest that you obtain a referral to a physical or occupational therapist who is trained or certified in lymphedema therapy (look for CLT or CLT-LANA after their name). They will be able to diagnose whether your problem is lymphatic in nature and provide you with a treatment plan.",
      "MessageIndex": 3,
      "PostDate": "29/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820629",
      "Title": "can doppler u/s rule out LE??? Lia13 purple32"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Apr 29, 2014 12:29AM LymphActivist wrote: It is interesting that Dr. Rockson does not mention what I believe to be the most common surgical techniques, that of including one or more lymph nodes from the tails of the inguinal area in the transplanted abdominal flap used in the breast reconstruction following breast cancer treatment. Patients that have arm lymphedema as a result of previous breast cancer surgery may also be candidates for Vascularized Lymph Node Transfer in combination with the DIEP flap procedure. This involves the transplantation of healthy lymph nodes from the groin to the underarm area (axilla) to replace the lymph nodes removed or damaged by previous axillary surgery. The procedure helps restore lymphatic drainage of the arm and can significantly improve lymphedema. - See more at: http://prma-enhance.com/breast-reconstruction/diep-flap#sthash.onamwAGu.dpuf",
      "MessageIndex": 5,
      "PostDate": "29/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820579",
      "Title": "Stanford University doesn't support surgery for LE kira Amoc1973"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Mar 10, 2014 03:08AM LymphActivist wrote: There is very much controversy and very little hard data on this subject, so I will make some suggestions based on my knowledge of lymphedema pathology and my wife Pearl's experiences over the last 20 years. We favor non-elastic containment over elastic for flying. In plain language that means that short-stretch bandaging or non- or low- elastic garments (e.g. Solaris Tribute, JoviPac, MedAssist, etc) are more effective than circular-knit elastic sleeves. Flat-knit custom sleeves are in between. This is for the same reason that you do not usually sleep in an elastic sleeve (too high a resting pressure, too low a working pressure) when your arm/leg is inactive for many hours. If you MUST wear an elastic sleeve when flying, then take along a stress ball, a sponge rubber ball that you squeeze periodically, to use your arm muscle pump to keep the lymph flowing.",
      "MessageIndex": 9,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/818866",
      "Title": "Flying cause lymphedema? peacestrength hugz4u"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jul 20, 2016 02:55PM LymphActivist wrote: Hi JerseyGirl, Yes, lymphedema can be a symptom of cancer if the tumor is blocking lymphatic drainage either within a node or lymph vessel, or pressing upon a lymph vessel. The Lymphedema PDQ for Patients says that lymphedema can be caused by \"A tumor that affects or blocks the left lymph duct or lymph nodes or vessels in the neck, chest, underarm, pelvis, or abdomen.\" Swelling of the breast (breast lymphedema) has even been proposed by one researcher as a potential indication of breast cancer.",
      "MessageIndex": 5,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/846056",
      "Title": "Is LE a symptom of breast cancer or result of treatment? JerseyGirl15 SusanRachel"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jul 20, 2016 03:03PM LymphActivist wrote: DocSR: The classification of lymphedema as being primary VS secondary has become very inexact as we learn more about lymphedema. Susceptibility to lymphedema given a precipitating trauma is being found to be somewhat genetically determined,possibly related to robustness of the genetically-determined lymphatic system development. Susceptibility may be related to an intrinsic lymph transport margin. The distinction of primary VS secondary lymphedema is becoming less and less clinically relevant.",
      "MessageIndex": 6,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/846056",
      "Title": "Is LE a symptom of breast cancer or result of treatment? JerseyGirl15 SusanRachel"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jan 17, 2016 06:48AM LymphActivist wrote: Lymphedema of the breast is one of the chief diagnostic symptoms of inflammatory breast cancer. A less common case is where unilateral arm swelling can be a diagnostic symptom of invasive breast cancer. This was described in a case study in the Journal of General Internal Medicine 2007;22:675-6 Breast Cancer Presenting as Unilateral Arm Edema by Zakaria S, Johnson R, Pockaj BA and Degnim AC. The conclusion of this case study was \"Breast cancer is a common disease that can have uncommon initial presentations, which divert attention from the underlying malignancy. In our patient, arm lymphedema resulted from extensive nodal involvement from breast cancer. This case report highlights the importance of having a high clinical suspicion for breast cancer in a patient who presents with unilateral arm lymphedema. Failure to recognize this presentation can lead to misdiagnosis or a significant delay in diagnosis and treatment.\"",
      "MessageIndex": 4,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/839933",
      "Title": "Lymphedema as a Symptom of Breast Cancer scrunchthecat cke14"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Aug 27, 2015 06:10PM - edited Aug 27, 2015 06:13PM by LymphActivist It sounds like breast lymphedema or delayed breast cellulitis. You may read more about this condition at: http://www.lymphactivist.org/breast_lymphedema_for... Concur with Binney's post above. Have your physician diagnose, and get a referral to a qualified, certified lymphedema therapist.",
      "MessageIndex": 4,
      "PostDate": "27/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/834557",
      "Title": "Is it lymphedema related Swede LymphActivist"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jul 11, 2016 03:17AM LymphActivist wrote: When lymphedema is usually discussed it is understood to be the swelling of the arm nearest the breast surgery. But lymphedema also affects the operated breast after a lumpectomy and the chest after a mastectomy. It also commonly affects the trunk, underarm and back for the same reasons--disruption of the lymph drainage from those areas with removal of as few as one lymph node, and radiation of the breast and/or axilla. Breast and truncal lymphedema are not widely recognized by the medical staff, but is well known by lymphedema therapists. Read up on breast and truncal lymphedema on my LymphActivist's Site at http://www.lymphactivist.org/breast_lymphedema_for_therapists.pdf",
      "MessageIndex": 12,
      "PostDate": "11/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845483",
      "Title": "Lymphedema symptoms? Rox30 LymphActivist"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Mar 13, 2016 06:25PM - edited Mar 13, 2016 06:27PM by LymphActivist paintThesky: Truncal lymphedema is a relatively un-recognized result of breast surgery and radiotherapy. Any disruption of the lymphatic drainage of the breast and upper torso, (e.g. by surgery, radiation or infection) can result in a build-up of fluids (lymph stasis causing lymphedema) in those regions. If not drained, the swelling can spread. Draining of this interstitial fluid, i.e. fluid in the tissue between the cells, is usually performed by a specially trained therapist, trained in the specialty called \"manual lymph drainage\" or MLD. Having first ruled out cancer, heart problems, infection and other medical causes, you should be seen by a trained and certified lymphedema therapist for evaluation and possible treatment. You do not want to allow the swelling to go, since there are tissue changes that take place that will cause it to get worse and result in permanent tissue changes that are much more difficult to treat. The therapist can also teach you self-MLD techniques which can slow down fluid accumulation, as can wearing of truncal compression garments as prescribed by your lymphedema therapist. For further information see http://www.lymphactivist.org/breast_lymphedema_for...",
      "MessageIndex": 6,
      "PostDate": "13/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/841124",
      "Title": "Truncal LE spreading to other side. paintThesky Binney4"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Mar 27, 2019 01:00AM LymphActivist wrote: Breast, chest, and torso lymphedema is an unfortunate, and all too common, result of nodal biopsy (even one!) or dissection and radiation. See the presentation on Breast and Truncal Lymphedema (the one for therapists) on my web site at www.lymphactivist.org. Then get a referral to a physical or occupational therapist who is certified in complex decongestive therapy (CDT) for an evaluation, possible therapy, and possible compression garments.",
      "MessageIndex": 4,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/870578",
      "Title": "Flank lymphedema cattledoglv Rah2464"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jul 5, 2014 10:22PM LymphActivist wrote: You've gotten good advice about finding a good lymphedema therapist. Whether their basic license is as Physical Therapist, Occupational Therapist or Massage Therapist they should have had additional training and certification in lymphedema management on top of their basic specialty. You also need a primary care physician who treats your other medical problems and has a basic understanding of the pathophysiology of lymphedema, because lymphedema is being found to be intimately related to different body functions and systems, and your physician must make sure that your lymphedema treatment is coordinated with treatment for any other co-conditions you may have. Lymphedema is related to your heart and circulatory system, your immune system, your nervous system and your endocrine system and is not, as previously depicted, just a \"plumbing problem\" involving clogged or missing lymphatics. Since American-trained physicians are not trained in lymphology, you must find a physician who has picked up knowledge of the lymphatic system and its problems either through extra training courses or through experience with prior patients. Often it is the patient who must bring medical articles on lymphedema to their physicians.",
      "MessageIndex": 3,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/822498",
      "Title": "Who to see for lymphedema? floaton glennie19"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jan 22, 2016 02:52AM LymphActivist wrote: Maiyre-- A couple of comments on your issue regarding diagnosis of truncal and breast lymphedema. These are typically diagnosed by either ultrasound or MRI measurements of skin thickness. Normal skin thickness is about 1.5-2.0 millimeters. Much more than that is usually an indication of excess interstitial fluid = lymphedema. See Johansson 2014 on my web site at www.lymphactivist.org/review-j... This technique is used in Europe. I believe that Dr. Emily Iker in Los Angeles uses it. Another method of lymphedema diagnosis is measurement of the fluid content of the skin at 2.5 mm depth. This can be done with a device called the MoistureMeter-D made by a Finnish company Delfin. I agree with your initial assessment that the truncal/breast lymphedema could have been related to your axillary breast tissue surgery. That region is rich with lymph nodes and lymph vessels which drain lymphatic fluid from the breast, back, and arm, and removal of as few as one node with the tissue, if it is in the drainage path of the breast or arm, would explain lymphedema. See Baker 2014 on my web site at www.lymphactivist.org/review-b... Scar tissue could also block the drainage path, and this might be treatable with low level laser treatments or skillful physical therapy.",
      "MessageIndex": 9,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/836523",
      "Title": "Diagnosing truncal lymphedema maiyre LymphActivist"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "May 16, 2016 04:03PM LymphActivist wrote: Treatment of breast lymphedema by manual lymph drainage is covered in my presentation found at http://www.lymphactivist.org/breast_lymphedema_for... As for LLLT, it has been found useful in treatment of upper extremity lymphedema, scar treatment, and as an adjunct to manual lymph drainage, but I don't believe it is covered by insurance.",
      "MessageIndex": 1,
      "PostDate": "16/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/844283",
      "Title": "Low level laser treatment of lymphedema, anyone use it? macb04 floaton"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Nov 20, 2013 06:53PM - edited Mar 23, 2014 04:31AM by LymphActivist Surgery produces swelling as the lymphedema pathways are disturbed and take some time to regenerate and absorb the excess fluid. This temporary \"post-surgical edema\" usually disappears as the lymphatics return to normal function. However, radiation retards reestablishment of the lymphatic network and it causes fibrosis of the irradiated nodes and filamentary structures that support and energize lymph vessels. The result is that whereas lumpectomy with sentinel lymph node dissection might result in a 6% risk of lymphedema, and lumpectomy with axillary clearance 24% risk, adding radiation might raise these risks to 15% and 40% respectively. There is a trade between reducing risk of local recurrence by radiating the breast VS accepting a chance of mostly salvageable recurrence VS increasing risk of lifelong lymphedema. See my LymphActivist's Site at www.lymphactivist.org for further information about breast lymphedema. Follow the tab RESEARCH --> Breast Lymphedema.",
      "MessageIndex": 2,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/814754",
      "Title": "Radiation and Lymphedema mcgis georgie1112"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Feb 10, 2010 03:19PM LymphActivist wrote: Binny wrote Re the circadian rhythm concept: \"Sure would be interesting if there were some studies done about this -- though I'm not sure it would have any practical application.\" It might be useful to know when the lymphedema peaks so that a daily course of self-massage could be scheduled to minimize the natural swelling. Pearl does her daily self-massage in the evening just before I wrap her for the night but she could perhaps schedule it at a different time if there were a time of daily maximum swelling. Bob ",
      "MessageIndex": 14,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747910",
      "Title": "Taking A Daiky Break From Compression Sleeves?? Katiejane kira"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Feb 10, 2010 03:12PM LymphActivist wrote: Katiejane: You sound like a \"poster girl\" for lymphedema treatment. Based on my spouse Pearl's experience (she's another poster girl)  she has been leaving her sleeve off some days and there have been no bad effects. The general advice I have been given (from JoAnn Rovig)  is that once you have the swelling under control, try backing off the compression until you detect a loss of control--then resume the compression. You want to find the MINIMUM daily treatment which will still work.",
      "MessageIndex": 13,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747910",
      "Title": "Taking A Daiky Break From Compression Sleeves?? Katiejane kira"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Mar 23, 2014 09:25AM LymphActivist wrote: Recent studies suggest that lymphedema can be retarded and perhaps prevented if treatment is started early enough. Stout Gergich et al Cancer 2008;112:2809–19. showed that wearing a compression sleeve when the arm exhibited a very small swelling (3% excess fluid) could prevent further growth and possible prevention of the fibrosis and fatty tissue generation that typify the later stages of lymphedema. And Zimmermann, et al Lymphology 45 (2012) 103-112 demonstrated that manual lymph drainage started as early as 2 days after surgery and continued for six months prevented any swelling.",
      "MessageIndex": 7,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/819375",
      "Title": "Question about preventing lymphedema alycallie LymphActivist"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "May 12, 2014 03:12AM LymphActivist wrote: Please have your primary physician refer you to a qualified lymphedema therapist for an evaluation, and treatment if necessary. Make sure that the therapist has \"CLT\" or \"CLT-LANA\" after their name, which means that they are certified lymphedema therapists. Were any lymph nodes removed as part of the spinal met surgery? That may be related.",
      "MessageIndex": 4,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820981",
      "Title": "Tired of hurting! Breast/Truncal Lymphedema??? steelrose glennie19"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Sep 28, 2017 12:02AM LymphActivist wrote: No, actually the risk of lymphedema continues to rise with time, although at a slower rate as time goes by. Roughly 75% is diagnosed after 3 years with cases recorded at perhaps another percent each subsequent year. But what is really important is that lymphedema is usually progressive--that is, once the changes start occurring in the skin tissue, even if there is no gross swelling, the condition will worsen with time. Lymphedema is an inflammatory condition which brings progressive structural changes to the skin. So it is important to start treating it early--before it moves to clinical stages when it is harder to reverse. See www.lymphactivist.org/review-z... and also Weiss R. Prevention of Lymphedema. J Amer Coll Surg. July 2013;217(1)168-9.",
      "MessageIndex": 15,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/858943",
      "Title": "Does Likelihood of Lymphedema Go Down Over Time? Jojobird dsteaparty"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Nov 13, 2016 06:03PM LymphActivist wrote: Breast and/or truncal lymphedema is a common consequence of breast irradiation. You may read about this condition and its treatment on my web site at: http://www.lymphactivist.org/breast_lymphedema_for... Discuss it with your primary care physician and get a referral to a lymphedema trained therapist for an evaluation and treatment if appropriate.",
      "MessageIndex": 3,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/850008",
      "Title": "Lymphedema 15 years out Tigre Jennie93"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Nov 28, 2008 06:44PM LymphActivist wrote: I've been reading the posts concerning lymphedema treatment problems at Kaiser Southern California, and can offer some help. My wife is a 16-year breast cancer survivor and we've been fighting with Kaiser in Redwood City (Northern California) and Woodland Hills (Southern California) for about 12 years now for proper care of her lymphedema. I offer the following comments: Concerning lymphedema therapy: Very few Kaiser therapists have had adequate training or certification in lymphedema treatment. The training of their staff is in the hands of their Physical Therapy Department Administrators who are in general not willing to send their staff for proper training, so most of the \"lymphedema therapists\" have had no more than a 22.5 hour North American Rehabilitation weekend course which is far less than the national certification requirements of 135 hours. They cannot handle anything more than a simple case of upper limb lymphedema, and their ability to do proper bandaging is spotty. We travel 40 miles from our home to qualified lymphedema therapists in Baldwin Park since the therapists in Woodland Hills are not qualified. Sunset used to have two qualified lymphedema therapists but both have moved on to Administration, and to my knowledge there are none there at present. Act quickly, since there is a Steve Norton 10-day course coming to Southern California in January, and if you can get your PT Department Administrator going this is an excellent opportunity to get their therapists a 135-hour course only missing one week of work. The course is two weekends and one work week. Chris Keller at Woodland Hills Kaiser has the brochure. Ask your Administrator to call Chris. If you have been diagnosed with lymphedema you have the right to demand a qualified therapist to treat you. If there is not one on staff at your facility then request that your PCP refer you to a qualified and certificated therapist out of network. This has been done when the patient is adament about receiving qualified medical care. If they refuse, file a complaint with Patient Services. If you do not get proper care then file a complaint with the state Department of Managed Health Care. On Bandages and Garments: Kaiser Southern California has been providing compression bandages and garments as part of lymphedema treatment since July 1, 2000. The allowable products and quantities are documented in a \"Durable Medical Equipment Formulary\" which they will not let you see (or even recognize its existence) even though it determines your coverage. The exact coverage depends upon your contract with Kaiser (Group, individual, Medicare-C, etc.) We get two sets of bandages and two compression garments (2 sleeves and 2 gauntlets) as medically required and prescribed by our PCP as often as every six months.   I'd be happy to help you through the Kaiser complaint system to receive qualified therapy and garments. If you give up and accept less-than-quality medical treatment then Kaiser Administration has no way of knowing there is a problem.And if they don't recognize a problem it will certainly not get fixed. By the way, can anyone who has seen the self instruction video tell me who produced it, the title, who gives the instruction, etc? Does it include MLD, bandaging, exercise? Upper and lower limb? Contact me privately at <LymphActivist@aol.com>",
      "MessageIndex": 4,
      "PostDate": "28/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/725079",
      "Title": "Problems with PT - Kaiser cgoody maxgirl"
    },
    {
      "AuthorID": "LymphActivi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75363/profile",
      "Content": "Jun 22, 2016 11:20PM LymphActivist wrote: Insect bites are to be avoided since any break in the skin of a lymphedematous limb can introduce or allow entry of bacteria. Watch for progression of red streaks from the area of the bites along the limb. If there is red \"streaking\" get to emergency since this could be \"lymphangitis\" or infection of the lymphatic system, which can progress very rapidly to generalized skin infection (cellulitis). My wife's favorite perfume is citronella to ward off insects.",
      "MessageIndex": 12,
      "PostDate": "22/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845327",
      "Title": "Lymphedema and insect bites (we think) Emilylaughed LewisThomas"
    }
  ]
}