{
  "AuthorID": "Lyndalysa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287828/profile",
  "Posts": [
    {
      "AuthorID": "Lyndalysa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287828/profile",
      "Content": "Apr 28, 2019 10:50PM Lyndalysa wrote: thank you so much for responding . It’s crazy how this breast cancer is so different to each one of us. I have aunts on both parents sides and cousins as young as 30 with breast cancer. My aunts are in their 60,70, 80’s. I worry too much or for the most part just want this done with. All this waiting drives me goofy . Also it’s unsettling when the doctors call with test results but tell you not to worry. I’ll get use to it as I go along .",
      "MessageIndex": 15790,
      "PostDate": "28/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Lyndalysa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287828/profile",
      "Content": "Apr 28, 2019 05:07PM - edited Apr 28, 2019 05:08PM by Lyndalysa I'm new and stage 1 . I'm waiting for my Oncotype results and I hardly see anyone on the forum that is grade 3 (3+3+3)with ER/PR positivity. I'm hoping for a low but I've been told it will probably be intermediate or high. My biopsy came back Her2 equivocal and after mastectomy the pathology came back Her2 equivocal but both times negative thank goodness. My Doctor told me on Oncotype that they won't test Her2 again, is that true?Also my tumor was upper inner quadrant and was wondering if anyone else had similar results? 1.5 cm was my tumor. I have family history but negative for the BRCA gene. Thank you",
      "MessageIndex": 15788,
      "PostDate": "28/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Lyndalysa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287828/profile",
      "Content": "May 1, 2019 02:50AM Lyndalysa wrote: my Oncotype came back at 39. Next week they have me scheduled for chemotherapy on Wednesday. I get something called a port put in this week. Im happy the wait is over and hope the next four months go by fast.",
      "MessageIndex": 15792,
      "PostDate": "01/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}