{
  "AuthorID": "Lynnbea",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148482/profile",
  "Posts": [
    {
      "AuthorID": "Lynnbea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148482/profile",
      "Content": "May 18, 2012 04:58PM Lynnbea wrote: This is TC#3. Been riding the D train all week. Glad to hear it's not C Diff or anything serious. Feeling pretty wiped out. Almost afraid to eat anything. Don't want that train to start up again. I've been using the tea tree oil on my nails at night. I got the one with eucalyptus but it still stinks like crazy. But...if it works, it works. ",
      "MessageIndex": 383,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Lynnbea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148482/profile",
      "Content": "May 23, 2012 08:41PM Lynnbea wrote: onvacation: Sorry to hear about your loss and your dad. Will be praying for your dad tomorrow. Just want you to know that we'll get through all this.  I buried my mother 2 weeks ago after a brief and sudden illness and my dad fell a week ago and fractured his hip almost clean through (taking a 3 hr surgery and 30 staples to repair).  Watch your stress level...I think mine sent me into a 10 day ride on the D train.  Funny thing...4 times this week I spent at least 5 hours at the hospital getting re-hydrated and not one single time was I able to give them a sample while there.  If you need to take an Ativan to relax.... I'm coming up on TC #4 (my last treatment) and so far I still have eyebrows...although they're quite thin.  I even have a little hair coming back. So far, it looks primarily gray. That'll be weird because before I cut if off, I only had gray temples and a barely noticeable gray hair here and there. StayShiny: a salmon burger sounds great...thanks for the idea. I think Whole Foods has them and they're right across the street from me.  Lezza: we should be finishing up around the same time. I think June 4th is my last treatment. Well, thanks all...so glad you're here, wish it were under better circumstances.  Thinking healing thoughts and just believing for a great holiday weekend and minimal SE's.",
      "MessageIndex": 446,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Lynnbea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148482/profile",
      "Content": "Jun 5, 2012 05:09PM Lynnbea wrote: I finished my final round of T/C yesterday. Got my last Neulasta shot today. And someone was there today from the Hospital Salon/Spa giving complimentary 15 minute chair massages, so I got a chair massage to boot.  Janiemomof2: Congratulations on final round of T/C. I didn't have to do rads this go round, but 3 years ago I did and it was manageable. I just had to remember not to over-exert myself.  When my body told me it was tired, I paced myself and made sure I got some rest. It forced me to change my sleeping patterns also. I was used to running on 5 or 6 hours of sleep.  I made myself take 8 hours. Melrosemelrose: Congrats on the halfway mark...I'm cheering you on. You can do this!  Blessings to each of you and minimal or no SEs to boot! ",
      "MessageIndex": 575,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    },
    {
      "AuthorID": "Lynnbea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148482/profile",
      "Content": "May 26, 2012 12:18PM Lynnbea wrote: Glad to see people are not letting treatment consume their lives and actually doing things like getting out, attending family events, going to the beach, etc. I've been feeling great and eating well the past 3 or 4 days. Thankful to be off the D train.  Looking into probiotics to see if that'll prevent a recurrence after treatment #4. Speaking of #4, my final treatment is coming up a week from Monday. I'll be sticking around afterward to offer whatever prayers and support I can to those still in treatment and those on this forum who haven't started. Being here has been invaluable. You've encouraged me on my lowest days. You've listened to me vent when I wasn't looking for a solution, just an ear. You're strong courageous women and I'm believing for long life and the best of days for each of you. ",
      "MessageIndex": 480,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784857",
      "Title": "March/April Chemo T/C x 4 Catherine22 Summer51"
    }
  ]
}