{
  "AuthorID": "Lynn06",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78067/profile",
  "Posts": [
    {
      "AuthorID": "Lynn06",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78067/profile",
      "Content": "Aug 4, 2009 07:07PM Lynn06 wrote: I am also starting this cocktail.  I started last Monday.  Had the Ixempra infusion, the onc. is holding off for a week on the xeloda to see if I have any reaction to the ixempra.  I had aloxi for nausea, tagamet and benadryl, and decadron before the ixempra, so plan on 4 hours for chemo. I am most worried about the neuropathy and hand/foot syndrome since I already have problems with my left hand and feet.  I have had navelbine, taxotere and carboplatin in the last 8 months, now this.  I have started putting Udderly smooth on already and the onc told me to take B6 every day.   Good luck to you.  Keep posting with your progress and I will do the same.",
      "MessageIndex": 2,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738409",
      "Title": "Lxempra / Xeloda MissyBraddy jeanne46"
    },
    {
      "AuthorID": "Lynn06",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78067/profile",
      "Content": "Mar 10, 2009 10:14PM Lynn06 wrote: I am on my 2nd port.  Had one 3 years ago when first had chemo.  It was removed a year later, now more chemo so had one put back in.  It is about 3 inches below my collarbone.  They can do blood draws and chemo with it and I would not do it any other way.  Slightly sore about a week after it was put in but no problems since.  Need to have it flushed periodically when chemo is done but no big deal.",
      "MessageIndex": 2,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730512",
      "Title": "Need some input on ports...please... pee wallflower"
    },
    {
      "AuthorID": "Lynn06",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78067/profile",
      "Content": "Jan 31, 2010 12:19PM Lynn06 wrote: I see my onc at least every 2 weeks.  I am on Taxol - 3 weeks on, one week off. Also Zometa. Mets to most bones and progression pretty much this entire past year.  Some tumors \"heal\" but are replaced by others so a never ending cycle.  Get Scans at least every 3 months. I have tried taxotere, carboplatin, navelbine, and now taxol (she wants to add Avastin but my blood pressure is to high) this past year.  Maybe Taxol will be the \"magic wand\".  Before progression I saw her every 2 months or so.",
      "MessageIndex": 23,
      "PostDate": "31/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747554",
      "Title": "how often do you see your oncologist? rkt Lynn06"
    },
    {
      "AuthorID": "Lynn06",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78067/profile",
      "Content": "Aug 29, 2009 10:33PM Lynn06 wrote: In the past year, I had rads, Navelbine, Taxotere and Carboplatin, now on Ixempra and xleoda. I have had 2 rounds of ixempra (every 3 weeks) and then 14 days of xleoda.  I just started the xleoda so I can't tell you about it but the Ixempra after 2 treatments I notice I am very tired 2nd day after then it gets better as the days pass, my hair is falling out but have not lost it all (yet). I do have more gas and constipation but I use Gas x and a stool softener which seem to help. I know that it is cumulative so may have more problems later.  We are trying a somewhat different protocol,  First week chemo, 2nd and third weeks the xleoda pills, then back to chemo, etc. She is hoping this may alleviate the \"hit\" from chemo and pills at the same time.   Good luck to you.  All I can say is that if it kicks these mets in the butt it will be worth it. I have mets to collarbone, spine, ribs, hips, and femur so any relief from pain will be heavensent. By the way, I am still working full time and must continue to do so, so hopefully you will too.  Lynn",
      "MessageIndex": 9,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739318",
      "Title": "Anyone on Ixempra - esp. TN? Duffymom kenzie57"
    },
    {
      "AuthorID": "Lynn06",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78067/profile",
      "Content": "Apr 12, 2009 08:27PM Lynn06 wrote: Lilac, I have been at this for 3 years now.  One medication after another.  But, first of all there are many good anti nausea meds - insist on trying them all!! Secondly, talk to onc about dose reduction or giving them over longer time period, sometimes adding fluids to chemo helps because it helps rid the body of toxins more quickly.  Ask about a chemo break. Also your SE may be because of the combo of the drugs, not an individual drug itself. I have so much pain from mets that doing without chemo would be a very difficult decision because when one does help with the cancer then the pain level goes down. I am very tired but I allow myself an hour nap in the am and another in the afternoon (no longer than that cause then I don't sleep well at night).  Part of this battle is trying different ways to handle the SE and the depression that goes with it.  It took 3 tries to find an anti nausea med that worked but now I have no problems with that.  I have 2 adult kids, and 6 grandkids and it is very frustrating not being able to do the things with them you would like to do so I do understand that part.  I have been trying to find things I CAN do. Today I sat on the side of the pool (we are in Florida) and while I used to swim with them we played dive for the rings that I threw and I \"judged\" a water volleyball game.  We went to Busch Gardens and I rented a mobility cart so I could walk the park.  While I could not go on the rides in case I would break a bone, we did go to several shows and played at the arcade.  When I got tired they left me parked in a rest area to catch a nap (which was a trick on that cart) and they went on the rides I could not.  It is not the way I would like to do these things but they seemed to have fun and I could share the experience with them. Getting the fatigue under control (some meds can help) and the nausea will go a long way to improving your QOL. Keep after your doc. until he can find something to help and I wish you good luck and many years of QOL that may be a compromise but better than nothing at all.",
      "MessageIndex": 22,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732302",
      "Title": "Thinking about quiting chemo Lilac Godsgal"
    },
    {
      "AuthorID": "Lynn06",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78067/profile",
      "Content": "Mar 16, 2009 10:59PM Lynn06 wrote: I was diagnosed with Stage IV in April 2006.  I have been on chemo, then oral medication, and now chemo again.  You are a good friend to try to help her cope as we all know the emotional issues are almost as difficult as the physical ones.  Encourage her to talk to her onc. about all her concerns.  She may want to join this discussion board and/or some others that will help with the feeling of being all alone in this fight. There are also support groups available at most hospitals and cancer centers.  We have all been through it.  There are many, many treatments available to her to fight this disease.  The longevity of cancer patients has been GREATLY improved as has the quality of life during treatments. Keep being the good friend you are, listen, hug her when she needs it, and help her keep a positive outlook because this can be done.",
      "MessageIndex": 2,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730811",
      "Title": "I need positive survivor stories for my friend! Please help! monicasfriend LuAnnH"
    },
    {
      "AuthorID": "Lynn06",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78067/profile",
      "Content": "May 31, 2010 08:19PM Lynn06 wrote: I am joining your \"rant\"  I was diagnosed Stage IV with bc mets in 2006.  Had a remission then in 2008 came back with a vengance.  I have been on chemo since Nov 2008 and just told my onc that I had to have a break.  I have to work but that is all I can do.  Go to work, come home, eat (sometimes) and go to bed.  Going to the grocery requires a 3 hour nap afterward and am exhausted even then.  I have 6 grandkids who are all active in sports, used to love to watch them participate but now I can't even go.  I am so tired all the time, diarrhea all the time, I use a walker or cane except in the house and have a transport wheelchair when I need it.  Clean the house? Sometimes I can clean the bathroom except the tub and dust the house.   I have to sit to even peel an onion or potatoes.  My DH is retired and is a wonder.  He cleans, does the laundry, cooks and takes care of the yard.  But he has had 3 heart attacks, one knee replacement, and thyroid cancer so I am not sure how long he will be able to do all he does. I am so tired of not having much of a life and feeling lousy all the time, so now I have added my rant to your rant.  Take care. Lynn",
      "MessageIndex": 9,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753330",
      "Title": "Ability to do what you used too do. pee pee"
    }
  ]
}