{
  "AuthorID": "Lynn1234",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
  "Posts": [
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Aug 15, 2014 07:41AM Lynn1234 wrote: Thank you Dr. Bach and thank you for posting the article. At stage 4, I wish all I had to do was try harder or fight better! Gee, if I would have only known! I am a member of Gilda's and I love my support group. Believe me there are many wonderful women out there who are just having to deal with this the best they know how- many with limited funds, few family members, etc. Gilda's Club helps by being a wonderful resource for support, health and nutrition education and making new friends who can relate and support one another.  Amy could have said so much more!",
      "MessageIndex": 16,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823637",
      "Title": "Oncologist Takes on Amy Robach's Pink Warrior Rhetoric EnglishMajor Marple"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Dec 12, 2015 08:25AM - edited Dec 12, 2015 08:29AM by Lynn1234 This will be my third last Christmas. The first one I felt very sad and mopey because i did not have the stamina, felt sick and was sure it would be my last one. The second was better. This year it's been a lot easier because I have more energy. I've put every decoration I have up, made 4different cookie doughs(to bake later-waaaay easier and less tiring), bought or made presents, all in advance to make things less stressful and overwhelming so I can hopefully enjoy the holidays. However-I do all this because in the back of my mind I still feel it may be my last Christmas and if so, then I feel that I need it to be the best one ever. I put so much pressure on myself to make sure my husband and kids have all of our usual traditions, so they'll remember the fun we've had at the holidays. I wish I could lighten up a little, but I have a lump in my other breast that has to be checked out on 12/22. Maybe this frenzy of The holidays is keeing my mind occupied in the meantime 😕",
      "MessageIndex": 29,
      "PostDate": "12/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837368",
      "Title": "On the subject of \"Last Christmas\" sueopp artistatheart"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Jun 6, 2015 02:48PM - edited Jun 6, 2015 02:54PM by Lynn1234 It could be that the radiologist is not as expert as you, that's why a second opinion would be best. The rate for false negative on 3D is still high. See below from Radiopaedia.org for Radiology professionals: Digital breast tomosynthesis (DBT) is an imaging technique that allows a volumetric reconstruction of the whole breast from a finite number of low-dose two-dimensional projections obtained by different X-ray tube angles, with a geometric principle very similar to that applied in stratigraphic technique. Despite direct digital mammography (FFDM - Full Field Digital Mammography) has improved the sensitivity of the method, especially in dense breasts, the number of false negatives (FN) is still high, largely due to the presence of dense tissue that may affect lesions conspicuity:",
      "MessageIndex": 7,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832370",
      "Title": "Am I being paranoid or do I need to pursue this? y1981m art15"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Jun 5, 2015 04:58PM - edited Jun 5, 2015 05:00PM by Lynn1234 You are absolutely not being paranoid-you're being smart and a good advocate for yourself! Get a second opinion. The radiologist said mine was \"just a cyst\" too. Turned out it was a 5.9 cm tumor and was stage 4. It had already spread to my spine and pelvic area with a compressed vertabra to boot! I don't mean to scare you but, it's better to be safe than sorry to use an old cliche. I really wish that I would have checked it out more thoroughly when they said \"just a cyst.\" May have been caught before it was stage 4. Take care, Lynn ",
      "MessageIndex": 1,
      "PostDate": "05/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832370",
      "Title": "Am I being paranoid or do I need to pursue this? y1981m art15"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Jun 6, 2015 06:00AM Lynn1234 wrote: 3D mammograms are not perfect and with the symptoms, I think it's important to get a second opinion.",
      "MessageIndex": 4,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832370",
      "Title": "Am I being paranoid or do I need to pursue this? y1981m art15"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Jun 6, 2015 08:20PM Lynn1234 wrote: Johns Hopkins ask an Expert is an awesome site. I've used it several times. Soglad that you're looking into this further. Take care, Lynn",
      "MessageIndex": 10,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832370",
      "Title": "Am I being paranoid or do I need to pursue this? y1981m art15"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 24, 2015 06:53AM - edited May 24, 2015 06:54AM by Lynn1234 Hi! I've been posting also-diagnosed in March 2013. I'd liketo add my name to the list. I appreciate your time and effort Mrs M! Thank you!",
      "MessageIndex": 665,
      "PostDate": "24/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Oct 28, 2013 01:36PM Lynn1234 wrote: I was diagnosed as Stage III in March 2013 and had a mastectomy and chemo. In June, I found out that I had several bone mets in spine and pelvis that were there before the surgery. I am mainly a \"lurker\" and have been inspired and learned a great deal, too.",
      "MessageIndex": 483,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Nov 24, 2015 01:54PM Lynn1234 wrote: I sm on Medicare and a supplemental plan F and a separate prescription policy. It's been great and I am pleasantly surprised! However, it is quite confusing when you are signing up and trying to figure it all out. I am under 65, so it was trickier. Ihad to read the booklet 10 times before it sunk in! I highly recommend an insurance broker. Mine did not charge anything and was so knowledgeable about all the different plans. She made sure the prescription plan covered all my meds and that all my doctors and hospitals were covered. Even if I had to pay a fee, it would have been worth it! Be sure to get a recommendation though. Take care, Lynn 1234",
      "MessageIndex": 18,
      "PostDate": "24/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/836895",
      "Title": "Medicare Kandy Lynn1234"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Nov 29, 2015 12:40PM - edited Nov 29, 2015 12:42PM by Lynn1234 Be wary of complacent doctors! They could be arrogant, lazy, too busy or plain ignorant. Be your own best advocate. Remember there is always one doctor who graduated last in his class!!! Make sure he's not yours. Many breast cancer patients have both blastic and lytic lesions. Bones scans show mainly blastic and CT show lytic. MRI's show both. Not sure about pet scans, never had one. I've always felt that having scans, waiting for results and trying to interpret what they mean is one of the most frustrating things about having cancer! Take care! Lynn1234",
      "MessageIndex": 29,
      "PostDate": "29/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789488",
      "Title": "Can bone mets be missed with regular CT and bone scans? foreverhopeful GoldenGirls"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Feb 20, 2016 01:15PM - edited Feb 20, 2016 01:16PM by Lynn1234 Thanks Bestbird! I had a feeling there was a study on de novo out there somewhere. I do wish that I would have had scans before my mastectomy. My PCP set me up with the breast surgeon and within a week I had the surgery. Only after that did I see the oncologist, who did scans. I had lots of bone mets in pelvis and back and a fractured vertabra Maybe I wouldn't have had the mastectomy. Some docs don't do mastectomy on stage 4. ",
      "MessageIndex": 40,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/841305",
      "Title": "Comparing Life Expectancy Statistics DivineMrsM Bliss58"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Feb 20, 2016 01:34PM Lynn1234 wrote: Ah well....I'm almost three years and still on first line treatment and no progression. So maybe it really didn't matter",
      "MessageIndex": 41,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/841305",
      "Title": "Comparing Life Expectancy Statistics DivineMrsM Bliss58"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Lynn1234 wrote: Hi everyone! I've been on Xgeva monthly for bone mets for going on 5 years and have developed a very small fracture on the shaft part of my right femur. I've read that Xgeva can cause this, though rarely. It is not very painful at all. It was discovered as a hot spot on a regular bone scan. I then had an xray and MRI to check to see if it was a met or impending fracture. My MO sent me to an Orthopedic Oncologist who knew right away that it was from the Xgeva and took me off the Xgeva for now. Have any of you had a fracture due to Xgeva? Dx 3/26/2013, IDC, Right, 5cm, Stage IV, metastasized to bone, 1/27 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863651",
      "Title": "Xgeva and femur fractures? Lynn1234 Bigbhome"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Mar 31, 2018 10:49AM Lynn1234 wrote: I'm trying to find out what to expect.",
      "MessageIndex": 3,
      "PostDate": "31/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863651",
      "Title": "Xgeva and femur fractures? Lynn1234 Bigbhome"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Mar 31, 2018 09:50PM Lynn1234 wrote: Thank you so much for everyone's replies. I appreciate your input!..... So far I have a small impending fracture and not much pain.Have to limit lifting over 10 lbs and climbing stairs, walking long distances. I have appts in a few weeks with the MO and then the Orthopedic Oncologist to see if there is improvement. I imagine that I'll probably have another xray or MRI to see if it is healing. But it sounds like that might be a little premature. I haven't had any progression since my diagnosis, I was stage 4 at diagnosis with mets to spine, pelvis and sacrum. All in my bones.",
      "MessageIndex": 6,
      "PostDate": "31/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863651",
      "Title": "Xgeva and femur fractures? Lynn1234 Bigbhome"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 22, 2015 04:15PM Lynn1234 wrote: Stage VI for two years. Hope to have many more! Feelin' fine so far",
      "MessageIndex": 19,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831838",
      "Title": "How long have you been Stage IV? goldie0827 dormouse"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 12, 2015 07:21PM Lynn1234 wrote: haha-did they end up getting married?",
      "MessageIndex": 6,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831397",
      "Title": "Cancer and Clustrophobia starbrightlyshines sandilee"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Mar 31, 2018 10:48AM Lynn1234 wrote: Do you have any side effects from coming off of the Xgeva? How about going back on? Are you on Arimidex also?",
      "MessageIndex": 2,
      "PostDate": "31/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863651",
      "Title": "Xgeva and femur fractures? Lynn1234 Bigbhome"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Jul 30, 2016 08:37PM Lynn1234 wrote: Shetland-I'm going to read your words to my support group at our next meeting....its exactly how I feel. ",
      "MessageIndex": 102,
      "PostDate": "30/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818107",
      "Title": "MBC is Not a \"Journey\" Bestbird cliff"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 27, 2015 09:05AM Lynn1234 wrote: I am not a medical person..... but 25% height loss on one of my vertebrae was reported on my first MRI two years ago. The doctor said it meant one of the vertebrae had a compression fracture with height loss due to a lesion. I had radiation on it and it eventually healed and now it's almost good as new.",
      "MessageIndex": 3,
      "PostDate": "27/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832033",
      "Title": "what does vertebra height loss mean ? crystalline00 Lynn1234"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Dec 16, 2015 10:18PM Lynn1234 wrote: I had stereotactic radiation to my T9 and my sacrum. No side effects at all. It really was a breeze! No worries-Good luck! Lynn1234",
      "MessageIndex": 4,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838596",
      "Title": "Stereotactic radiation to spine- anyone with any experience? JTilCT GG27"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 12, 2015 05:15PM Lynn1234 wrote: I am very claustrophobic and have had many MRI's, including a few brain MRIs. One MRI I had lasted one hour and 20 minutes. It was really hard-kept wanting to press that button to get out! However, I have a few things I do now that help me get through - hope they can help you too! 1. Try not to think about it in the days and hours before the MRI. Keep busy. Divert your thoughts to something else. 2. A thick wash cloth over the eyes helps a lot! 3. Bring a CD of music you can sing or hum to. (No moving or shaking though) ie....Beatles, Motown, a musical, etc. The tech should be able to play it for you during the scan. 4. Once the scan begins, try to meditate, sleep or concentrate on something other than the scan. I planned my daughter's entire wedding during that long one! 5. Get a prescription from your doctor for Ativan. I take two about 45 min before the scan. By the time I get on the table, I am pretty sleepy and usually fall asleep during the scan. Be sure to tell the tech you are going to take it -when you arrive for the scan. Hope this helps!!!",
      "MessageIndex": 4,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831397",
      "Title": "Cancer and Clustrophobia starbrightlyshines sandilee"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 14, 2015 09:05AM Lynn1234 wrote: That is too funny!!! LOL I very seldom post but read others' posts and had to let you know I got such a kick-still laughing! I have scans next week and of course every little ache or pain is another cancer spot to me-ugh!",
      "MessageIndex": 340,
      "PostDate": "14/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 19, 2015 09:46AM Lynn1234 wrote: CT scan and bone scan tomorrow. I have trouble focusing on anything in the meantime. I try to stay busy but my mind wants to dwell on the dark side.",
      "MessageIndex": 353,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 24, 2015 07:44PM Lynn1234 wrote: Or maybe a nearby hospital would have a meeting room?",
      "MessageIndex": 33,
      "PostDate": "24/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831603",
      "Title": "Anyone else need to vent? Rseman NYCchutzpah"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 24, 2015 07:37AM Lynn1234 wrote: DivineMrsM, Are you a psychologist? I love to read your posts, they are always so insightful, articulate and caring. I wish I had that gift",
      "MessageIndex": 25,
      "PostDate": "24/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831603",
      "Title": "Anyone else need to vent? Rseman NYCchutzpah"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 22, 2015 03:29PM - edited May 22, 2015 03:38PM by Lynn1234 I've been meeting my best friend for Saturday morning coffee together for over ten years. We've been friends for over 40 years. She's always been so helpful and we've shared our issues and kids problems etc. but, as close as we are, when she starts talking about not being able to choose between carpet colors or vacation spots, I get really depressed. Of course besides the Cancer there are the money issues that go along with it, so no vacation for us or remodeled rooms. I'm not looking forward to our coffees like I used to, sadly. My local Stage 4 support group is on the same wavelength fortunately, so we can let it all out and listen and help each other through this stuff. highly suggest joining a stage 4 group. Best thing I've done for myself since all this began.",
      "MessageIndex": 11,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831603",
      "Title": "Anyone else need to vent? Rseman NYCchutzpah"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 23, 2015 08:09PM Lynn1234 wrote: Sabel, I don't think there is anything to be done except limit your time with your friend. Unfortunately, in her mind illness is a weakness.",
      "MessageIndex": 23,
      "PostDate": "23/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831603",
      "Title": "Anyone else need to vent? Rseman NYCchutzpah"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "May 22, 2015 08:30PM Lynn1234 wrote: It makes total sense to me! I don't want to be the one everyone feels sorry for and talking about. I don't like being the center of attention anyway and now I feel like I'm under a microscope. Regarding food: It's very nice when someone brings food, but please I don't want your book club's leftovers that they wouldn't eat! Ugh. Call me unappreciative too.",
      "MessageIndex": 14,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831603",
      "Title": "Anyone else need to vent? Rseman NYCchutzpah"
    },
    {
      "AuthorID": "Lynn1234",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189011/profile",
      "Content": "Oct 19, 2015 12:22PM Lynn1234 wrote: When I was first diagnosed my tm was 13- with mets up and down spine and throughout pelvic area. Even had a fracture on my spine. So they had been there for a few months according to the doctor. Now it's down to 6, after chemo and radiation",
      "MessageIndex": 9,
      "PostDate": "19/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835813",
      "Title": "anyone have tumor makers that are low but still have mets? sophie786 sandilee"
    }
  ]
}