{
  "AuthorID": "lynnea",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
  "Posts": [
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 11, 2009 07:44PM lynnea wrote: Hi MM-The mammotome biopsy wasn't too bad for me. The worst part is being still on the table. Mine took about 11/2 hr total. I had 2 separate biopsies done. There is so much sensory stimulation between the table and the mammogram compression that its hard to pinpoint what they are doing, as you can't see anything. The table goes up and they are working underneath you as you lay on your stomach with your boob through the hole. One of the other ladies called it Jiffy Boob because it's like working on a car!! They give you lidocaine first and then the radiologist makes a small incision (1/4 inch) to insert the biopsy probe  I had titanium markers left in and then when they were done they took a mammo (soft compression) to check the markers. When I got home I put an ice pack on (off and on all day) to keep swelling down. After pain, I would imagine is similiar to the US biopsy you already had.  Hope this helps, and good luck.  Lynne",
      "MessageIndex": 1,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733999",
      "Title": "Mammotome on Thursday mmb1 mmb1"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Jun 16, 2009 07:48PM lynnea wrote: Hi-I'don't know the names of her doctors but if you read the 1st 2 pages of Calcification@and Cancer Incidence, Jude talks about her trips to NYC and the breast surgeon she saw there at the Weil-Cornell Institute. Or maybe you could PM (personal message) her. Her moniker is jpernot. Hope this helps. Lynne",
      "MessageIndex": 1,
      "PostDate": "16/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/736014",
      "Title": "Can't find a doctor menam patoo"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 15, 2009 12:33AM lynnea wrote: Kim  Hi I just wanted to reassure you that don't need to worry too much about your protein level. I am a medical tehnologist and an RN. Your result of 8.3 is just barely elevated. Normal ranges vary with average populations in your area, and if you were to go somewhere else you might even be in their normal range. Protein is a result of diet and your body's metabolism.If your diet is good, this just might be a reflection of that. Usually a low protien is more concerning than a high protein. The only time a protein is concerning is if it's very high--indicating your body is making some abnormal protein. In that case they  would do what is called a protein electrophoresis and determine which specific protein is elevated and that would tell the MD more info. So followup with the repeat testing and try to relax (I know it's easier said than done) I hope this helps a little.               Lynne",
      "MessageIndex": 1,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732502",
      "Title": "High protein levels? KP1970 lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Jun 26, 2009 06:36PM lynnea wrote: Maybe-if they were able to see the lump with the ultrasound they could do a wire localization using ultrasound. They usually use the method that best identifies the right location. I think if you're already under anethesia for one, you might as well have both at same time, if all parties are willing. Good luck.  Lynne",
      "MessageIndex": 2,
      "PostDate": "26/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/736523",
      "Title": "excisional biopsy questions Maybe484 Maybe484"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 15, 2009 12:50AM lynnea wrote: Geez-it seems like you are between a rock and a hard place. My first impulse was to pass on this reponse, but I thought, what if I were in your place? I can imagine your fear and anxiety at this point, the waiting for concrete news must be driving you crazy, I know it would me. Probably the outcome is somewhere between the best and worst case scenerios, but the reality is, that torturing yourself is not going to change that outcome. The only way to handle this is to be very gentle with yourself and try to take it one day at a time. I'm glad you have posted here because there are many people who have walked this road before and I'm sure they can offer you hope and strength. I'm sure you've read the 80% statistic for B9 results, but I wont insult your intelligence, because from what you've described, it seems like the docs think somthing is going on. Unfortunately until you get the biopsy report you can't know what that is--and you're right the waiting stinks. I pray that you get a B9 report, but if not, I pray that you have the strength to persevere what ever the outcome. If I were you ,I'd make every effort to land the job,especially if it's one you think you'd like.  I hope you get your report soon. Lean on us anytime. {{{HUGS}}} Lynne",
      "MessageIndex": 1,
      "PostDate": "15/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/734222",
      "Title": "Waiting for Biopsy Results... o2bhealthy lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 21, 2009 04:28PM lynnea wrote:",
      "MessageIndex": 5,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/734222",
      "Title": "Waiting for Biopsy Results... o2bhealthy lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 2, 2009 07:41PM lynnea wrote: Kathy, I'm sorry for your loss. And I too can relate to your not wanting to upset your parents. I take care of my ailing mother and I didn't tell her what was going on, I didn't want her to panic until I knew for sure what was wrong. I found this web site to be amazingly supportive. Take the time to read through some of the other questions and answers and a lot of your questions and fears will be alleviated by hearing about other people's experiences. My experience was a positive mammogram in jan.,with a call back to have further views and an ultrasound. They did find a suspicious lesion and the radiologist classified it a a BIORADS 4. He recomended stereotactic core biopsy because it was nonpalpable. My famly MD sent me to a surgeon, which at the time I didn't understand why because the radiologist recommended the core biopsy--and those are done by a radiologist also. But I think she just wanted me to meet the surgeon and get a 2nd opinion on how to proceed with the biopsy. I wound up having 2 core biopsies and both produced benign results. So don't jump to any horrible conclusions until you get the biopsy. No one-not your family doctor or the radiologist or the surgeon can know for sure that the lesion will be cancer, until the pathologist reads the slides!!!  Ater that then you can sit down with the surgeon and discuss your treatment options.  Not all breast cancers are the same and not all treatment is the same and a mastectomy is not the only option these days. Hope this helps. I pray that you get good news or the strength to persevere if not.      lynne",
      "MessageIndex": 9,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731827",
      "Title": "just feeling all alone Kathyi6re desdemona222b"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 5, 2009 11:22PM - edited May 5, 2009 11:22PM by lynnea Hi.There are 2 types of anemias: one is iron deficiency. You don't mention whether you are pre or post menopausal, and that makes a difference with iron deficiency. Usually if iron intake is sufficient postmenopausally and rbc count is low there may be an indication of bleeding (possibly from the GI tract) If you are premenpausal it is not uncommon to be iron deficient due to your menstral cycle. The other type of anemia , is Pernicious anemia. That is due to decreased B12 and folate, which is due to a decrease in intrinsic factor, which is necessary for you to absorb B12 from the GI tract. If B12 and folate levels are ok, then that's not your problem. Frankly, feb to april is not a lot of time to be on iron supplements. And even though your serum iron might now be in the normal range, it takes the rbc count a while to catch up. The average life span of a red blood cell is 3 months. So you need to give your body at least 6 mos to see a significant change in your rbc count. You don't specify what the counts are, so it's hard for me to speculate any significance, other than it's good that the rbc count did increase. As to the lymphocyte count-that has nothing to do with anemia or iron intake. Lymphocytes are elevated in viral infections and leukemias. Normally lymphocyte levels are on the low side. Very low lymphocye levels are associated with HIV infection. Again you did not mention what the % was so it's hard to make any assumptions. The more important count is the total wbc count ,thats all the white blood cells(neutrophils,lymphs ,monos,eosinophis and basophils) If that was normal, I wouldn't worry about the lymph percentage as \" normals\" are just a guidline,and may not necessarily be your normal. I'm assuming your doctor gave you the results-in which case they would be concerned enough to order more testing if necessary. If they didn't, ask for any more, then you'll have to trust  their judgement that you are ok for now. If you haven't discussed this with your doctor, (if you just got your lab results from the lab) then you might want to call them and ask them these questions. I don't think there is any rush though.  I hopes this helps, if you have more questions' feel free to ask. In case you're wondering I am a medical technologist and an RN.  Lynne",
      "MessageIndex": 1,
      "PostDate": "05/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733701",
      "Title": "I know you are not doctors, but...I don't understand blood tests mginger lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 23, 2009 10:19AM lynnea wrote: Hey Bonita-great poem, congrats on the 5 year anniversary MANY MANY MORE!! It looks like we are neighbors - have you had enough rain yet???  Take care   Lynne",
      "MessageIndex": 2,
      "PostDate": "23/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/734649",
      "Title": "Cancer Poem ABonitascarf lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 24, 2009 02:32PM lynnea wrote: Kelly I'm surfing the boards-you didn't mention them seeing another lump. The ultrasound follow up at 6 weeks seems kind of soon are you really healed from your excisional yet? I still have raw spot from the core biopsy in march and the area around the incisions are very hard. Maybe what they are \"seeing\" is just scar tissue or residual inflammation. Ask the surgeon about this. I hope it's nothing. The Circle Game Lynne",
      "MessageIndex": 9,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732928",
      "Title": "skip biopsy and remove lump dlogan momo3esb"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 1, 2009 02:08AM lynnea wrote:",
      "MessageIndex": 4,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733426",
      "Title": "brnign and thanking everyone tayreb patoo"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 6, 2009 09:29PM lynnea wrote:",
      "MessageIndex": 1,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733759",
      "Title": "worried kenziesmom22407 dm1991"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Jun 26, 2009 08:31PM lynnea wrote: Hi Annie- sometimes tumors cause more blood vessels to develop-it's called angiogenesis. Maybe the pattern of the blood vessels looked suspicious, that's why they want the biopsy to make sure. I got my biopsy results back on a friday (it was done on tues). Most places it's 2-3 to 5 days. Hang in there, we all know the waiting is murder!   Lynne",
      "MessageIndex": 3,
      "PostDate": "26/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/736572",
      "Title": "Nodule has a \"blood supply\" so biopsy is next. Anniebananie lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 28, 2009 01:32PM lynnea wrote: Hi Rosiesmom-I had a stereotactic mammotome biopsy in march. That one is on a hard table,face down with your breast hanging through a hole where a mammogram guides the core biopsy gun. If yours is being guided by ultrasound- you will be sitting up in a chair and the spot will be located by the ultrasound and a core biopsy gun will be used. Similar procedure just different guidance and position. First the radiologist injects some lidoacaine, which may burn a little, then they make a tiny slit in your skin for the core gun to be inserted. I'm not sure how big it is because I couldn't see it, but even though it made some noise, I never felt it taking the tissue sample. After they are done they will keep pressure until it stops bleeding and they put either steristrips or dermabond glue on it with a small bandage. Afterwards, I didn't feel anything until the liocaine started wearing off and mostly it was just sore. I iced it several times that first day. Some people say to wear a button down shirt-because depending on where the site is located it might be hard to lift your arms over your head. Also some suggest wearing a sports bra. I found my regular bra and tee shirt were fine. I did wear a sleep bra for some support when I was in bed. Hope this helps and everything goes smothly for you tommorrow. Hope you get good news too. Lynne",
      "MessageIndex": 1,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/734896",
      "Title": "Scheduled for an ultrasound mammotome biopsy rosiesmom lesjules"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 27, 2009 02:38AM lynnea wrote: Hi-Why don't you get a copy of your pathology report? That way you would know what the nurse was talking about. May be she was saying it was fatty tissue and not actual ductal breast tissue. Once you know what is on the report you can make a more informed decision. The surgeon is probably not trying to confuse you-he's just being proactive, and maybe trying to cover his butt a little. He just dosn't want you to have regrets down the road if it turns out to be something that is discovered later. Also keep in mind that fine needle biopsies are not always accurate-in three different ways. One-they don't always hit the right spot, Two the specimen sent to pathology is often too small and Three-the fine needle itself can distort the cells and sometimes makes it difficult for the pathologists to make a determination. This is why some surgeons want to do a larger core biopsy or an excisional biopsy which removes more tissue to evaluate. Unfortuately you do find yourself in this situation sometimes, where you don't have a definitive answer. I had a stereotactic core biopsy done in march after a suspicious mammo and ultrasound. Sometimes I'm not convinced they hit the right spot. In sept I will have a followup mammo and if they find anything additional, then I will request an excisional biopsy to be sure- for my peace of mind. If you're nervous about asking either dr for the path report, you can get it directly from the lab if you go in person with a picture ID. They'll ask you to sign a release and they will issue a copy. Hope this is helpful, let us know how it goes. Lynne",
      "MessageIndex": 1,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/734838",
      "Title": "Dont know whether to get a biopsy campaulmace lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 29, 2009 03:01AM lynnea wrote: Jamie-Hi. I think it would be unusual not to be anxious in your situation. It's hard enough on you mentally to go through the testing and waiting, let alone doing it in a foreign country away from family and friends. I had a similar experience when I went back for my diagnostic mammo and ultrasound. The ultra sound tech found something but she said, \"don't worry it's just a cyst\",little did I know she wasn't talking about the spot they saw on the magnified mammo. So for 4 days ignorance was bliss, until I went to work on fri and looked up my radiology report (I work in hospital) and found the radiologist reported \" Biorads 4 suspicious for malignancy-suggest stereotatic biopsy\". Then I had to wait weekend before I could ask any questions!! Come here any time you need support and good luck tommorrow. Lynne",
      "MessageIndex": 5,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733270",
      "Title": "Here I go again-now an MRI! number5 number5"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Jun 6, 2009 07:40PM lynnea wrote: Alenya Hi! I can relate to your feeling you got mixed messages. When I had my mammo I was recalled for more images and an ultrasound -sort of the opposit of you-However, they found spots on the enhanced mammo and then I had the ultra sound. The ultra sound tech said \"Oh it's just a cyst- don't worry about it\" So I went home thinking I was done, and relieved. Four days later I got a call from my dr saying she wanted me to go to a BS for a biopsy. Needless to say I was quite upset. It turned out the ultrasound tech was referring to what she saw, not to what she didn't see. In other words yes there was a harmless cyst but there were also stuff on the mammo that the radiologist wanted checked out. I did get it biopsied and it was B9. This is stressful stuff. Here's hoping that they are just being cautious and you too have B9 results.  Lynne",
      "MessageIndex": 3,
      "PostDate": "06/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/735424",
      "Title": "mixed messages!! alenya lvtwoqlt"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 22, 2009 07:33PM - edited May 22, 2009 07:36PM by lynnea Hi-welcome to the board. I don't know if you are aware that there is another thread on the Not Diagnosed but Worried  Forum on this topic. From what I have read on other people's post that there is no gaurantee that a duct excision will stop a discharge. Some one commented that that was what her surgeon told her. Hope this is helpful, please check it out,   Lynne",
      "MessageIndex": 1,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/734626",
      "Title": "Bloody nipple discahrge? msbek812 kmccraw423"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Jun 27, 2009 07:21PM lynnea wrote: Hi Annie, my biopsy results were B9. I have my 6 mos followup in sept. If there are any changes I'm going to request an excisional biopsy. I have a nagging feeling that they didn't hit the right spot when they did the first one. My first one was a stereotactic core biopsy in two separate locations. Good luck with yours whenever it is scheduled for.   Lynne",
      "MessageIndex": 5,
      "PostDate": "27/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/736572",
      "Title": "Nodule has a \"blood supply\" so biopsy is next. Anniebananie lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 23, 2009 04:14PM lynnea wrote:",
      "MessageIndex": 4,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732991",
      "Title": "Breast MRI nana2thegrls momo3esb"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 10, 2009 09:45PM - edited Apr 10, 2009 09:46PM by lynnea Danielle-I was so excited to see KIbbles results in her reply, that I forgot it was your post! I'm glad you got your biopsy done. To bad it was on a thursday and you have to wait the weekend. I'm praying you get B9 results,if not, that you're given the strength to persevere. A fatty tumor is called a lipoma and it's usually benign.Hope and prayers-lynne",
      "MessageIndex": 20,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "May 8, 2009 01:11AM lynnea wrote: Hi again-you sound frustrated with the responses you have gotten. Your symptoms of pain, nipple inversion and soreness can be anything- from something as simple as mastitis (an infection) to the worst case scenario--immflammatory breast cancer. There is no way to know until you see the doctor and have some diagnostic testing performed. You need to try and call the doc and see if you can move up your appointment, if 2 weeks is an unbearable amount of time to wait. We can only support you in the waiting and dealing with the anxiety-but no one can diagnose you except your doc. In your earlier post you asked about your abnormal pap smear. Generally that is handled by a gynocoligst. That person will do what is called a colpolscopy, which is a pelvic exam using a microscope. The doc coats the cervix with a dye and if there is a lesion(spot) they will do an actual biopsy. They cut out a tiny piece and send in to pathologist. If anything bad is found they can do a procedure where they freeze the cervix (I think someone mentioned this on the other post) I had the 1st procedure done several years ago (colpolscopy) and it was no big deal- it sounds scary,but the cervix dosn't have much in the way of nerves and it wasn't painful. I think the pap smear and the breast issue are totally unrelated, I hope this helps-feel free to ask any more questions you might have.    Lynne PS in case you are wondering a pap smear is just a random collection of cervical cells, when they reported abnormal cells it could be nothing. The cells change based on hormonal changes of your menstral cycle. And pap smears are very open to interpretation. That's why they do a colpolscopy and biopsy, because it's read by a pathologist-not a histologist, and is more exact.",
      "MessageIndex": 2,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733833",
      "Title": "sorry to bother everyone kenziesmom22407 kenziesmom22407"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 14, 2009 05:20PM lynnea wrote: ,Keryl and Tami thanks for posting back,more than anything it heps to \"vent\" and hear how others are dealing with this issue. I live in FL and we don't have respite care per se, but the local council on aging does do- day outs which is kind of like adult day care. The problem for me is that since mom is bedridden, it's hard to get her out.  I try to take my days off on a \"work\" day-so I'll have someone to stay with her, and give me a break. The only problem is that they are too few and far between!!!  Like many people now a days,her income is too much to qualify for medicaid and and yet not enough to hire full time help. It's a catch 22 that many are in, I'm sure. Keryl I'm sorry you lost both your parent and you still feel like you didn't do enough--I for one know that you can never do enough to make others happy. I'm sure you did above and beyond the call of duty and unless you are in this situation ,others can't imagine how hard it is emotionally to\" parent \" your parents. I have days when I feel guilt and anger and pity and shame and a hundred emotions in a day.. Most days I just try to take it one day at a time,sometimes one hour ant a time !The thing I have the hardest time with is patience, my mom is soooo slow doing everything and I just want to speed her up. So much to do ,so little time!!  Well I'm rambling so I better finish up. Thanks for listening ,it blows my mind that this web site is so helpful, I'm not much of a computer person-but I'm starting to get hooked on this spot. Ladies have a great day and know that you are truly an inspiration to me.      lynne",
      "MessageIndex": 3,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732425",
      "Title": "Are you a Caregiver for a parent? lynnea lynnea"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 11, 2009 06:34PM lynnea wrote: Danielle-I'm so happy for you that the dr. called with good news!!  Have a blessed Easter!   lynne",
      "MessageIndex": 23,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "Apr 10, 2009 05:00PM lynnea wrote: Kibbles-I've been checking to see how it's gone for you. I glad you got B9 results!! Have a blessed day and month and year !!!          lynne",
      "MessageIndex": 19,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "lynnea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80973/profile",
      "Content": "lynnea wrote: Hi-I,ve been reading posts here since jan,while I was going through all my testing for a suspicious mammo. Thankfully my biopsy was B9. I have been enjoying giving and getting support from all the wonderful people who chat here. My question is : how many of you are in the position of having to care for an elderly parent? Maybe this is an inappropriate topic for this forum-but I thought I'd throw it out there and see if anyone else wants to talk about their trials. I'm 54 ys old and I take care of my mom at home. I also work full time and find it very difficult to maintain friendships because I'm so busy with the day to day stuff of careing for her and 2 homes,etc...I've tried to get her enrolled in hospice because I think we could both use the support but she is adamently against it because my Dad was in hospice when he died in 2005. She calls them HOSTEL. How's that for freudian?   Any way if there's others out there please let me know.                                                                          thanks Lynne Yesterday is history. Tomorrow is a mystery. Today is God's gift--that's why it's called THE PRESENT ! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732425",
      "Title": "Are you a Caregiver for a parent? lynnea lynnea"
    }
  ]
}