{
  "AuthorID": "Lynn-Swims",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107736/profile",
  "Posts": [
    {
      "AuthorID": "Lynn-Swims",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107736/profile",
      "Content": "Jul 4, 2012 11:43AM Lynn-Swims wrote: My current onc won't answer the \"God questions\" and I love her for it. With mets in bones, belly, and liver, I have beat my surgeon's prediction that I'd never get out of the hospital. That was October 2011. I almost died in April but the chemo Halaven brought me back to life. Lately, I've been able to swim a mile a day. I have a great medical team of a liver specialist and two oncs. I may not feel great, but I am alive ... and I will never go back to the surgeon who gave up on me. ",
      "MessageIndex": 28,
      "PostDate": "04/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790072",
      "Title": "Expected Life SPAMgirl jocanuck1951"
    },
    {
      "AuthorID": "Lynn-Swims",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107736/profile",
      "Content": "Jun 28, 2012 01:45AM - edited Jun 28, 2012 01:55AM by Lynn-Swims I echo the replies of those who love their ports. I also loved the port surgery, believe it or not. I was semi-awake but had a very hip medical team and enjoyed their banter. Loved being loopy for a while afterward. Was sore only for a day or two.  I guess I appreciate my Power Port so much because I went through many chemo treatments and blood draws without one. I resisted until my veins were useless. I regarded getting the port as an unhappy concession to terminal cancer and was scared of the surgery. Now I realize that I was a blockhead to have waited so long.  You won't regret getting the port. It's a great thing. I don't feel it. Seatbelts don't irritate it. I do use Emla cream to numb the area before the port is accessed. Make sure you get a prescription for that. With Emla (lidocaine), you shouldn't feel the needle going into the port. It really helps while the area is still tender from surgery. The soreness goes away as the area heals. Good luck! ",
      "MessageIndex": 38,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789691",
      "Title": "Port Questions Lynn1 CelineFlower"
    },
    {
      "AuthorID": "Lynn-Swims",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107736/profile",
      "Content": "Feb 8, 2012 09:56AM Lynn-Swims wrote: Hi. I'm Lynn from Baltimore. Cancer stats are below. I lurk but seldom post. Found the site around the time I was originally diagnosed (6/08). Love the discussion boards, reading others' words of encouragement to those who need them. We all got a raw deal with mets. Mine were found on my 53rd birthday. They are all over and scary: bones from jaw to femurs, abdomen, omentum, colon, liver, ascites, all kinds of lymph nodes, and so on. Treatments have not worked so far. I'm on Taxol/Avastin but markers are still high and rising. More scans in two weeks. What then, I don't know.  I feel okay most days, which encourages my onc. My outward health seems to be much better than what he sees on the inside. Best sign: at least the disease volume in the liver is low. Like everybody else here, I'm hoping for a miracle. Today is a down day, though. Sorry for the kinda depressing post. I feel yucky from chemo and not sleeping well. And I hate, hate, hate the colostomy I had to have as a result of ILC thickening my colon.",
      "MessageIndex": 84,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "Lynn-Swims",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107736/profile",
      "Content": "Feb 25, 2012 05:54PM Lynn-Swims wrote: I have lobular and mets similar to yours--widespread in belly area and bones. If I still had ovaries, it would probably be there, too. My mets were discovered in October when I had a bowel obstruction: sneaky lobular had thickened the lining of my colon. I needed a colostomy. Awful. Awful. I, too, have felt like the medical community has no clue what to do with me because my case is so unusual. I had four months of progression (Tamox, Faslodex) before Taxol/Avastin started to work. Scans show improvement, but tumor markers are still high and rising. My onc has presented three options for when the A/T fails: Affinitor/Aromasin; a clinical trial with Femara and a study drug that has something to do with insulin growth factor, and no treatment at all. He classifies my disease as treatment resistant. Neoadjuvant chemo didn't work; Femara failed after 2.5 years and I became stage IV.  It's good you are still functional. Someone suggested Megace for the weight loss. My ins. case mgr. suggested that to me, but I am holding steady at a 20 lb. weight loss and am happy with current size. My tummy never feels good, which could be from chemo or disease. Eating and drinking are a crap shoot. Sometimes I take Pepcid or Prilosec. Sometimes the OTC drugs help. I understand your frustration and fear. I'm there, too. ",
      "MessageIndex": 5,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782416",
      "Title": "Lobular Blues rakulynda penny4cats"
    },
    {
      "AuthorID": "Lynn-Swims",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107736/profile",
      "Content": "Feb 26, 2012 06:24PM Lynn-Swims wrote: Rakulynda, It breaks my heart to hear about your physical pain and mental anguish. Plus, having a recurrence after 10 years is just wrong. I hope there's something docs can do to make you more comfortable. More than that, I hope docs can find some way to force the stupid ca to retreat from your belly. Boost saves me when I can't eat. Have you tried it? I have attributed the belly symptoms to chemo, but maybe it's the mets, too. Whatever it is, I hate it. Everybody in this discussion group got a bum deal. You sure did. There's no comfort in knowing that, is there?",
      "MessageIndex": 7,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782416",
      "Title": "Lobular Blues rakulynda penny4cats"
    },
    {
      "AuthorID": "Lynn-Swims",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107736/profile",
      "Content": "Jun 27, 2012 08:32PM - edited Jun 27, 2012 08:33PM by Lynn-Swims So sorry. Been there. At 53, giving up my beloved job was one of the hardest, saddest things I've ever done. I gave away all my cute work clothes and now live comfortably in t-shirts, shorts, and yoga pants.   Sometimes it feels like cancer takes away so much more than our health. I hope you make peace with your loss. After grieving for a while, you'll probably learn to enjoy a life with lots more leisure time. It's not so bad after a while. Best to you!",
      "MessageIndex": 6,
      "PostDate": "27/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789770",
      "Title": "I'm no longer a working woman :( CoolBreeze lilylady"
    }
  ]
}