{
  "AuthorID": "lynnieC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
  "Posts": [
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Dec 30, 2011 09:57PM lynnieC wrote: Just re read your posting and saw they did find it on a routine mammo. Thanks for the information. I appreciate it.",
      "MessageIndex": 81,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Jan 2, 2012 10:27AM lynnieC wrote: So tomorrow morning I have my diagnostic mammogram at 8:15am.  I am certain I was just called back because they need more clarity in establishing my baseline.  In fact, I feel so silly worrying about this because I'm sure nothing is wrong.  If only they hadn't said it was specifically for my left side, the side with the swollen lymph node in my armpit.  When I first noticed the tiny lump it was while training for the Chicago marathon and I figured it was from the strain of training.  A few days after the race, on a picture of me crossing the finish line with my arms raised, I saw that the swelling in that armpit was noticable.  This was about two years ago.  I called my OB and they sent me to get an Ultrasound.  Everyone in Chicago goes to the Northwestern Breast Center because it's great.  But the wait there for anything is SO long.  So I went to a different place for the ultrasound.  They confirmed there were two enlarged lymph nodes but they otherwise looked fine. And that was that.  It has never gone away over the past two years and remains tender when I push on it.  But they weren't concerned so I dropped it.  It often bugs me when it's sore but nothing I can't live with.  It never even occurred to me to mention this to the tech when I had my first mammogram a few weeks ago.  This time I was at Northwestern which means they woud not have the records from that ultrasound.  So here are my questions: 1.  When I go in tomorrow for the follow-up, should I tell them about the lymph node and prior ultrasound?  It's in my armpit so I doubt it would show up on a mammogram.  I know I shouldn't care what doctors think but I just hate to look like I'm over reacting.   2.  Also, I have really great insurance.  I've had lots of MRI's in the past due to running injuries and my insurance always covers 100% without so much as a phone call.  If they confirm that I have dense breasts, should I push for an MRI?  Again, I don't want to look stupid.   Thanks.  I know you all have so much more serious things to worry about so I really appreciate your patience with my silly obsessing! Lynn",
      "MessageIndex": 82,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Jan 2, 2012 05:55PM lynnieC wrote: Panmars, Thank you so much for responding.  I didn't think I would be this nervous when I know full well that it's probably nothing.  I'll post tomorrow -- they called to tell me it would probably take 3 hours and that they would tell me the results on the spot.  It's really nice of you to respond to these posts.  Lynn",
      "MessageIndex": 87,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Dec 30, 2011 04:08PM lynnieC wrote: I've been reading a lot of the posts and it seems like most women who have been diagnosed with BC had a palpable lump prior to diagnosis. I know that inflammatory BC usually does not present with a breast lump but what are the odds of having the other cancers without a palpable lump?",
      "MessageIndex": 78,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Dec 30, 2011 08:18PM lynnieC wrote: Thank you for the information. Did they find your lump on a routine screening?",
      "MessageIndex": 80,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Jan 3, 2012 01:22PM lynnieC wrote: Had diagnostic mammogram and ultrasound this morning the spot they found looks benign so no more worries.  Thank you so much for the support and I wish the very best to those of you who are still waiting. xo",
      "MessageIndex": 90,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Dec 21, 2011 10:11PM lynnieC wrote: I am so glad to find this conversation!  I am 41-years-old and after a year of having my mom (a breast cancer survivor) nag me to get my first mammogram I finally managed to schedule one in between all of kids activities.  I wasn't at all nervous and didn't really think anything of it.  In fact, I forgot to even mention that I have had a tender, palpable lump under my left armpit for the past year or so.  Three days later my doctor's office called to tell me thay my doctor wants me to go back for a diagnostic mammogram.  She said it probably wasn't anything other than dense breasts and they just want more pictures.  So, still not thinking anything about it, I called the breast center and made an appointment.  Of course living in downtown Chicago means Northwestern which means you always have to wait for an appointment so I won't be going until January 3.  About 10 minutes after making my appointment I got to thinking and called back the nurse at my doctor's office.  I asked her if they just needed more pictures in general or was there a specific spot that required more pictures.  Sure enough, she said my left breast - the one with the lump in my armpit.  So now I am worried.  My mom had breast cancer, my great aunt had breast cancer, I started my period at age 11, I didn't have my first child until I was older than 30, I didn't breast feed, blah blah blah!  It seems I have every risk factor in the book.  Logically I know the statistics say that it won't be anything at all.  But, despite the logic, I have a bad feeling in the pit of my stomach.  So glad I found you and that I am not alone.",
      "MessageIndex": 59,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Dec 22, 2011 04:25PM lynnieC wrote: Thanks for the kind words. I will keep you posted and will keep my fingers crossed for each of you. Cags, I am so sorry about your results. Sending prayers your way.",
      "MessageIndex": 70,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "lynnieC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141598/profile",
      "Content": "Jan 2, 2012 02:32PM lynnieC wrote: Hi SueJR.  I will be your waiting buddy.  My situation is different from yours but I will keep you company while we wait.  I go in tomorrow for a diagnostic.  I am sorry you have to wait so long.  That would make me nuts.",
      "MessageIndex": 85,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    }
  ]
}