{
  "AuthorID": "lyssa615",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186342/profile",
  "Posts": [
    {
      "AuthorID": "lyssa615",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186342/profile",
      "Content": "lyssa615 wrote: I had a baseline mammogram and u/s at age 35. Found some microcalcifications and multiple cysts in the left breast. Went for my 6 month follow up in September and the calcifications did not change but there were more cysts - \"some complicated\" - and the report said \"extremely dense fibrogladular tissues\". It was recommended I come back in 6 months to follow up for the calcifications but the radiologist did not seem concerned about the cysts, nor did the report say the cysts needed follow up. Is there any chance that these cysts could be cancer? Is it unusual to have multiple cysts only in one breast (my right breast was clear). I guess I am a little concerned after reading that some of the cysts are \"complicated\". I'd feel much better if they were just simple cysts. Should I seek a second opinion? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816935",
      "Title": "Complicated cysts but no follow up? lyssa615 lyssa615"
    },
    {
      "AuthorID": "lyssa615",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186342/profile",
      "Content": "Jan 15, 2014 04:52PM lyssa615 wrote: Thank you for the helpful info, Beesie!",
      "MessageIndex": 2,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816935",
      "Title": "Complicated cysts but no follow up? lyssa615 lyssa615"
    },
    {
      "AuthorID": "lyssa615",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186342/profile",
      "Content": "lyssa615 wrote: I am having difficulty deciding what to do. I also have a lot of anxiety about medical issues. I had my baseline mammogram in March 2013. They found extremely dense breasts and benign-looking calcifications, along with multiple cysts in my left breast (BI-RADS 3). They suggested a 6 month follow up which I had done last March, and the calcifications remained unchanged. There were additional cysts, but the radiologist recommended a 6 month follow up for the calcifications (not the cysts, I guess; they are noted as fibrocystic changes on the report).  Well, 6 months was this past March and I'm currently 15 weeks pregnant. My OB/GYN said no mammogram but to have an ultrasound of the left breast. From what I've read though, ultrasounds aren't very good at detecting calcifications. Should I go for the ultrasound anyway or is it pretty much pointless? I am also worried that they will find something that needs to be biopsied. What if I am diagnosed with BC while I am pregnant? If they do find something though, I know it's better to detect it earlier rather than later in October when the baby is born. This has been weighing on me since I was overdue for my follow up in March and I don't know what to do. If an ultrasound won't detect any potnetial changs in teh calcifications, then I don't know if I should put myself through the stress of having it done.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820275",
      "Title": "Pregnant and due for a follow-up mammogram lyssa615 Moderators"
    },
    {
      "AuthorID": "lyssa615",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186342/profile",
      "Content": "lyssa615 wrote: Hi, this is my first time posting here. I went for my baseline mammogram in March 2013 at age 35. After an ultrasound the tech said I have several microcalcifications in my left breast and I should return in 6 months because they have nothing to compare this mammogram to. It was categorized as BIRADS 3. Well, September will be 6 months and I have having a lot of anxiety because I am actively trying to get pregnant now. I just want to get it over with because I am afraid that if I do become pregnant, I will need to put this off for another 9 months. My question is, what are the chances of these microcalcifications becoming cancer in 6 months? Could this even be possible? If they are more numerous in this upcoming mammogram, should I request a biopsy for assurance? I wouldn't be too worried but it's the becoming pregnant thing I am anxious about. I just don't want it hanging over my head throughout the entire pregnancy.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809545",
      "Title": "Microcalcifications - worried about 6 month follow up lyssa615 Beesie"
    }
  ]
}