{
  "AuthorID": "lyzzysmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
  "Posts": [
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jan 1, 2015 10:46AM lyzzysmom wrote: I apologize for writing on the stage IV thread so will understand if it is deleted but this made me so angry and sad. The only things I can think of are possibly contacting a senator, congressman or local TV station to pressure the NWS into showing some compassion. I would only hope that that would not make things worse but it is all I can think of. You are in my prayers.",
      "MessageIndex": 4,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827303",
      "Title": "What Are We To DO? Freedomchild82 redwolf8812"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Aug 9, 2014 09:51PM lyzzysmom wrote: For early stage Hormone receptor + it can give you a number to indicate the chance of recurrence IF you take an AI or Tamoxifen. e.g my score was 12 and the chance is 8% provided I take one of those pills so chemo wold not make much of a difference.My test was ordered after the lumpectomy not immediately the surgery was done. You can always ask your MO if it may be appropriate for you and if it is still possible to use the tissue that was removed a while back.",
      "MessageIndex": 4,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/823515",
      "Title": "should I have had an oncotype test? glennie19 Mulligan"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "May 14, 2019 04:02PM - edited May 14, 2019 04:03PM by lyzzysmom I was told not to get any sun exposure on radiated area and purchased a Coolibar long sleeved (sun blocking)tee for swimming, excellent quality, does not feel heavy, and still in good condition after 5 years.",
      "MessageIndex": 9,
      "PostDate": "14/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870911",
      "Title": "Vacation after Radiation Therapy skirts keywestfan"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jun 2, 2014 05:23PM lyzzysmom wrote: I agree with Bevin .I think nobody should have to live with a lump for months, not knowing what it is whether they are 20 or 80. I so hope you are able to find a more understanding and empathetic doctor.  I had a number of lumps in my thirties and forties and they turned out to just be cysts but I still needed them to be checked out properly just for peace of mind.  I hope everything goes well. Good luck from me too!!",
      "MessageIndex": 2,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821595",
      "Title": "29, not taken seriously because \"I'm too young\" Sparkle2829 Lionesse2"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jun 2, 2014 09:52PM lyzzysmom wrote: This has been making me so mad. I just found the following quote on www.breastcancercolorado.org under the resources, Health and wellness, Breast Cancer Screening for young women \" Most importantly, do not allow anyone, even your doctor, convince you that you are too young for breast cancer. Misdiagnoses and delayed diagnoses are prevalent in young women. Be your own advocate and insist your concern be taken seriously or get a second opinion!\" Not trying to scare you at all but at least they are providing some argument if you doctor keeps ignoring you.",
      "MessageIndex": 10,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821595",
      "Title": "29, not taken seriously because \"I'm too young\" Sparkle2829 Lionesse2"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 10, 2014 07:01PM lyzzysmom wrote: Mischief, I think things do tend to vary by area and by surgeon. I notice your dx is not that dissimilar to mine but don't know how large an area of LCIS I had, also my BS in Boston is affiliated with the large centers in that area and is very \"into\" sentinel node biopsy methodology, hence I was fortunate to only have the one node taken. Also lumpectomy was suggested even with ILC so it all really does vary, although I never asked about mx. I did not mind the radiation at all apart from some fatigue. It really was OK for me. Hopeful, just wanted to add all my best wishes and hope for the very best possible results. The ER/PR+, HER2- sounds like very good news.",
      "MessageIndex": 60,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824304",
      "Title": "The news isn't good Hopeful82014 Hopeful82014"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jun 4, 2014 10:54PM lyzzysmom wrote: I am so sorry that you received this news. I too am recently diagnosed at 59. There are so many wonderful ladies here and lots of support and information for everybody wherever we may be with treatment.  Hugs from me too!",
      "MessageIndex": 11,
      "PostDate": "04/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821676",
      "Title": "Age and breast cancer pjc71 del4"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Aug 29, 2014 03:18PM lyzzysmom wrote: NellieDuck, I have played 9 holes (with a cart) a few times during treatment and have found a whole new range of excuses for why I whiff the ball off the first tee!! ",
      "MessageIndex": 170,
      "PostDate": "29/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 19, 2018 02:36PM lyzzysmom wrote: I think it is very important to speak up about pain before the biopsy. My core needle biopsy in 2014 really hurt a lot and my breast was black and blue so I was not looking forward to repeat BUT I recently had a stereotactic biopsy and told the doctor about this beforehand. It was completely painless and over quickly. She told me to let her know if I could feel ANY pain. The only thing was a little prick from the numbing shots, not even as bad as the numbing shot at the dentist. I had some sticky tape over the area for 5 days but no bruising at all. I actually went shopping then caught a train home afterwards.",
      "MessageIndex": 10,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867234",
      "Title": "I guess I am one of the worried ones Ann2018 Ann2018"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Nov 24, 2018 02:20PM lyzzysmom wrote: Did you also have an ultrasound too? My understanding as a layperson is that no sonographic correlate is good sign, more likely to be benign if the ultrasound does not pick up what was found on the mammo. I recently had a birads 4 in that situation and was given the option of 6 month follow up or biopsy. I chose biopsy as I had a prior diagnosis and it turned out benign. Birads 3 is even less likely to be anything bad and in that situation I would have been OK with the 6 month follow up, if that is any help.",
      "MessageIndex": 4,
      "PostDate": "24/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868509",
      "Title": "Birads 3 Anxiety Buddyrock Buddyrock"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jul 12, 2014 05:15PM lyzzysmom wrote: Sunshine, I was interested to see that your Mo said 8%/16% with oncotypeDX 12. Mine just told me the test didn't count if you don't do the hormones. I think he may have been worried I would not do them, which I will unless the SE are really bad. When we discussed the test originally I thought about it for just a few minutes as I wasn't sure about chemo. I was kind of tired and mumbling about being nearly 60, not 35 with kids. He was quite insistent. He also said if I was 35 he would have locked me in his office until I agreed to have it done.Lol. Funnily enough the 16% would actually match the tumor size of 1.6 cm. ",
      "MessageIndex": 15102,
      "PostDate": "12/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jul 12, 2014 06:01PM lyzzysmom wrote: BosumBlues, No thankfully I didn't have to do chemo. He just really wanted me to get the oncotype test done to rule it out. Actually I just found out something else about oncotypeDx that I didn't know. I didn't realize that my MO had put my results on the website where I can view all the reports and lab results. I had not logged on there for a few weeks. The oncotype results also showed the ER, PR HER2 scores that looked a bit different from the pathology report from the lumpectomy. The lumpectomy had me ER+(80%) PR- but the oncotypeDX showed PR+ based on their criteria (I am not sure what my pr score = 6.6 means but it is in their positive range). I did speak to the company that does the test in California once when they contacted me about billing. They were REALLY nice. They put me through to a tech to find out when it would be done. He volunteered to explain the test and answer any questions I may have and told me to call them if I had any more questions. Now I have the additional info on PR status I can ask the MO about it at my next appointment. My guess is that PR is just slightly positive but I am curious.",
      "MessageIndex": 15104,
      "PostDate": "12/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 2, 2014 01:40PM lyzzysmom wrote: Ganzgirl. My MO is at Dana Farber. They have the pathology reports on line for you to see if you login to Patient Gateway. It depends how recent they are but everything from my surgery was available once the doctor had spoken to me in person (Sometimes they show up with a date after which you can access them directly). That may help with some of the confusion. I tnk some refer to LCIS as precancer but other just as a marker for a higher risk of invasive cancer. You can always ask about the Oncotype test. My MO sent of for it a lttle while after my lumpectomy as they keep the tissue.",
      "MessageIndex": 15186,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 5, 2014 04:09PM lyzzysmom wrote: Marie, I am also in the MA area, south of Boston. You have had a rough year. wow! 2 broken ankles and then this.  I started on Tamoxifen on 8/20 and for the last 10 days or so have had diarrhea and cramps apart from 2 days when I took pepto bismol so I could go to work.  Now its back again. At the same time I am putting on weight and bloated which really upsets me as I was ok with my weight even when I started rads at end of June. If feels like its just one more thing I have no control over at the moment. I have been exercising and eating quite healthy although I have been hungrier than usual. I am seeing the fitness manager at the gym where I go on Monday to see if he can find a program to help me. Its difficult as I feel tired too. If there is no improvement I will try a week off the tamoxifen to see if that makes a difference. My MOs plan is 2 years followed by an AI for 3 to minimize hair and bone loss. I did the CancerMath and have a 15% chance of popping my socks in next 15 years from cancer with no pills and 8% of recurrence with pills based on oncotype score. I am going to keep up with the pills for a while but I will be nearly 75 in 15 years and do not want to spend the next 10 feeling lousy so I may eventually make a decision to discontinue as I would like to spend some time enjoying life.                    ",
      "MessageIndex": 15207,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jan 19, 2019 11:54AM lyzzysmom wrote: I like to listen to guided breathing or meditation on YouTube, also ASMR virtual head massage, head scratching or hair washing videos while wearing an eye mask and headphones. Super relaxing.",
      "MessageIndex": 19,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869375",
      "Title": "Need some advice with sleeping, anxiety, etc kec1972 lyzzysmom"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Nov 8, 2014 03:32PM lyzzysmom wrote: Painterwoman and Proudtospin, I am in Southern new England and find it easier to keep to a regular program if I go to the gym (although it may be back to the recumbent bike and DVDs in the basement if it gets too snowy) Where I go there are people of all ages, shapes and sizes, MANY in their 50s, 60s and 70s. They also offer physical therapy and individual training and some low impact classes. There are some who have physical challenges or disabilities so its definitely worth thinking about and looking into a gym to see what they may offer regardless of fitness level. I am nearly 60 and find the people at the gym so friendly and helpful.",
      "MessageIndex": 35,
      "PostDate": "08/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/825836",
      "Title": "Stage 1-recurrance percentage % risk? DXat32 Ygammyyet"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jun 2, 2014 12:46AM lyzzysmom wrote: The week after I turned 59",
      "MessageIndex": 281,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 9, 2014 10:09PM lyzzysmom wrote: I am hoping it will be OK on tamoxifen. Seem to hear more about the rapid aging on the AIs. Guess I will find out.Only real problem with tamox.so far, and its early days, seems to be the upset stomach.",
      "MessageIndex": 15226,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 10, 2014 06:38PM lyzzysmom wrote: I found that seatbelt covers helped with driving. Got some sheepskin ones from Amazon but there are also synthetic. Better than nothing. I finally took mine off for the first time today as they annoy DH. It was so helpful during rads although I only had a lumpy not mx.",
      "MessageIndex": 15229,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 12, 2014 03:40PM lyzzysmom wrote: Bosum, I know what you mean. At the time of my dx neither my primary care or myself could feel anything. It showed up on ultrasound and I could just about feel something with the gel on when the tech found it. My primary just took me on my word that I had had some prior swelling and scheduled ultrasound. I had a history of cysts and she never lets a concern go without getting it checked out, a lovely lady. With ILC I will always have a concern about the other side as it can be really difficult to feel, even when big. I will be turning 65 at the 5 year mark so hope I can get some followup after that through medicare. Don't know what the latest theories will be by then...",
      "MessageIndex": 15240,
      "PostDate": "12/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Dec 21, 2014 03:53PM lyzzysmom wrote: My breast surgeon also asked that I get my next mamo through her rather than the regular imaging center although I was surprised that it is not until April which will be a year since I was diagnosed.",
      "MessageIndex": 15298,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Oct 7, 2018 02:44PM lyzzysmom wrote: Dovely, so sorry that you are going through this worrisome time. A couple of months back I had a biopsy for an architectural distortion (Birads 4)just a couple of inches from my original cancer but it turned out to be B9. It was visible on 3D mammo but was not confirmed on ultrasound. My understanding as a layperson is that it it less likely to be cancer if they have an issue confirming it with ultrasound. Hang in there. Waiting is the worst. Hopefully all will be well. Crossing my fingers for B9.",
      "MessageIndex": 1,
      "PostDate": "07/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867657",
      "Title": "Architectural distortion/radial scar Dovely djmammo"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jul 26, 2014 12:09AM lyzzysmom wrote: Hello Darla, So sorry that you find yourself here and that you are going through this stressful waiting period. It can be confusing as there is so much info.at first but once you see your oncologist and can move forward with a treatment plan you will find that  there are ladies here who already have or will be having similar treatments along with you. They are always here to advise, listen and support each other. As Puffin said, education is power, so If you can it may be helpful to take somebody with you or take a notepad or recorder to the oncologist and maybe make a list of questions before you go. Its so easy to forget some of the things that you want to ask when they are explaining so much to you. Everybody is different so this is just my personal experience but  I found the initial core biopsy more painful than the lumpectomy. I had a lumpectomy for a 1.5 cm tumor and the surgeon only removed 1 node for testing . It was done under day surgery/general anesthetic and there was not a lot of pain afterwards. Based on the final pathology from the lumpectomy (positive for estrogen) they decided  it would be appropriate to send what they removed for an Oncotype test to evaluate the likelihood of a recurrence without chemo. Mine came back low so the plan was for no chemo, just radiation and then a daily pill as it was positive for hormones.. Radiation sounds scary but it isn't. I go for just 10 minutes in the morning apart from the first day when they did the simulation (set up) and most of that time is spent just getting into position on the table. It can make you feel tired as it goes along so I was told to eat plenty of protein for energy and try to exercise even if its just taking a walk.  Anyway I just want to wish you the very best!!  BCO is a great community for support and info. and there are some wonderful ladies here.",
      "MessageIndex": 6,
      "PostDate": "26/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823106",
      "Title": "New to site, recently diagnosed DarlaJ DC197"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Jul 12, 2014 07:34PM lyzzysmom wrote: Sometimes I think knowledge is power but it does also bring more questions. I was diagnosed with  ILC which is sneaky and sometimes occurs in both breasts. I understand that the chance of recurrence is low but I do wonder if another primary or LCIS could pop up or be hiding undiscovered on the other side. My understanding is that the hormones will reduce the chance of that too. Also the side where the cancer was found was the one that has had occasional problems with cysts and feeling a bit swollen over the years. The MO does not think its a problem for the left breast and neither did the surgeon who seems very up to date on things.She just wants my next mammo to be done at the hospital rather than have a routine screening.  I feel comfortable that I can live with the decision to just have the lumpectomy (MX never suggested) on the right side without stressing out too much over it but I can definitely understand why some would opt for BMX. ",
      "MessageIndex": 15105,
      "PostDate": "12/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 8, 2014 08:45PM lyzzysmom wrote: Bosum. I am taking a baby aspirin with the tamoxifen for the stroke factor. I am thinking I will try and stick with this and then have a rethink if my MO decides to switch me to an AI in a couple of years. I was clearing out a drawer I had not been in for years and found some pics from my mid 40s.I looked so young The difference between then and now is scary without additional problems of rapid aging and aching bones.  i would be prepared to take a little extra risk if it helps me look and feel less old. QOL is important and I just want to still feel like me. If the Tamox works out I may eventually ask about staying with it rather than switching to an AI if the difference in effectiveness is quite marginal, although like everything it comes with its own set of risks.... ",
      "MessageIndex": 15224,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 5, 2014 04:54PM lyzzysmom wrote: Bosum, I was expecting to be put on an AI as I went through menopause 10 years ago but due to an accident I was left with scar tissue, poor blood flow I guess, and thin hair on the top front of my head which got worse during menopause. My MO took one look at my hair when he first saw me and mentioned it. I didn't think it looked quite THAT bad LOL. He mentioned it again when deciding to put me on the Tamoxifen in spite of my age so I guess it may be less of a side effect.  Also its not as hard on the bones and they all seem to have their own ideas on treatment. As for the chance of recurrence without the pills he has never said anything. I just picked up on that through reading threads here and doing the calculation on CancerMath. I really have no idea how much is based on knowledge and how much is sheer guesswork.",
      "MessageIndex": 15208,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Sep 12, 2014 08:48AM lyzzysmom wrote: Nancy. I am so sorry you had such a rough time. The port sounds like nonsense to me. My mom had a port years ago for monthly blood transfusions but when she needed to be stuck there were certain nurses she would not allow to do it as they were quite simply no good at it and others she had no problems with. Some are definitely better than others. I have had no blood drawn since before rads and I finished a month ago.  I so hope things improve for you from here on out!!! On the premature aging. I will see how it goes but if its too bad then I will consider stopping the pills. I think not only your general sense of well being but also how you feel about your appearance affects QOL and with no children or grandkids to care about its me, DH who is 6 years older, and the dog so I am not that worried about living until I am 80+ to be honest. I would rather have 10 good years than 20 just hanging in there, buts that's just me.",
      "MessageIndex": 15238,
      "PostDate": "12/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Dec 21, 2014 04:16PM lyzzysmom wrote: Susug, You are right. I should. I have thought about it but I am a grand master at procrastination and denial! I am so bad and feel like I am on a cancer break until next tests but I WILL bring it up with my PCP who I really trust and without whom I suspect my cancer would not have been found so early.",
      "MessageIndex": 15300,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Dec 21, 2014 01:41PM - edited Dec 21, 2014 01:42PM by lyzzysmom I just downloaded The Emperor of All Maladies. It looks very interesting. As for me, I suspect its genetic. I would hazard a guess at CDH1 given my grandma and aunt died from cancers in their digestive systems in their 80s but who knows. I am not going to lose sleep (which I don't have anyway LOL) over it. Finding my ILC so early was a fluke so I feel fortunate and am not too concerned about why. If it should return I will worry about it then. For now I am just trying to eat reasonably healthy, exercise more and worry over my Patriots that are currently in a close game with the Jets.",
      "MessageIndex": 53,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "May 18, 2014 08:15PM lyzzysmom wrote: My post lumpectomy report said T1cN0. Mine measured 1.5cm but surgeon was still very pleased with that result",
      "MessageIndex": 7,
      "PostDate": "18/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821197",
      "Title": "Could somebody please help me out? T1bN0 Stage 1. goofytoo Moonflwr912"
    },
    {
      "AuthorID": "lyzzysmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199904/profile",
      "Content": "Dec 21, 2014 02:33PM lyzzysmom wrote: Amen to inclusion and diversity, and just letting everyone be who they are. Cancer does not care for sure.",
      "MessageIndex": 56,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    }
  ]
}