{
  "AuthorID": "Maakmezorge…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
  "Posts": [
    {
      "AuthorID": "Maakmezorge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
      "Content": "Sep 5, 2010 08:06AM Maakmezorgen wrote: Thank you all for the explanations! I did indeed celebrate and will keep on celebrating! I am so relieved!",
      "MessageIndex": 4,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/757624",
      "Title": "Results are good! Still have some questions... Maakmezorgen Maakmezorgen"
    },
    {
      "AuthorID": "Maakmezorge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
      "Content": "Apr 5, 2013 05:01AM Maakmezorgen wrote: Hi Kel44, I am sorry to hear that you feel alone on this forum. I have had the same feeling but the replies will come! It sometimes has to do with the fact that people might be in a different time zone. I don't have any answers to your questions but just wanted you to know that you are not alone! Try to keep positive and try not to google too much. I did the same, I was looking for someone with the exact same things going on as me and then realised that it just doesn't help. It just makes you go nuts! The wait is the hardest part but keep in mind that most things turn out to be benign. I am sure you will get more replies and actual answers to your questions, big hug!",
      "MessageIndex": 2,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802745",
      "Title": "Waiting for Biopsy results kel44 Moderators"
    },
    {
      "AuthorID": "Maakmezorge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
      "Content": "Aug 20, 2010 11:11AM Maakmezorgen wrote: Thank you seyla888. I have an appointment on Monday. Luckily I can go that soon, even though it's still feel like a loooong time.... Am sure it'll all be fine.",
      "MessageIndex": 9,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756961",
      "Title": "Microcalcifications and more exams Maakmezorgen reneedjones"
    },
    {
      "AuthorID": "Maakmezorge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
      "Content": "Aug 20, 2010 02:16PM Maakmezorgen wrote: Thank you for your replies Ivtwoqlt and dsj. You are completely right dsj, there is nothing that I can do this weekend that will change anything. Just have to wait and see. And like you said, if it is anything, it will be very early stage. If not, even better!",
      "MessageIndex": 12,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756961",
      "Title": "Microcalcifications and more exams Maakmezorgen reneedjones"
    },
    {
      "AuthorID": "Maakmezorge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
      "Content": "Aug 21, 2010 05:20PM Maakmezorgen wrote: Hi Makakilomeg, Thanks for your reply. Luckily I am getting more relaxed about the whole thing. I am now looking at it in a very simple way. I will have to see what happens on Monday, nothing I can do anyways. Not too worried about the pain or anything. Whatever needs to be done, needs to be done, whether it is painfull or not. I just have wait and see.... Doesn't mean I am not worried anymore. I am, but I also realize that it is what it is and there is nothing I can do to change anything. Just hoping it will all turn out to be ok.",
      "MessageIndex": 14,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756961",
      "Title": "Microcalcifications and more exams Maakmezorgen reneedjones"
    },
    {
      "AuthorID": "Maakmezorge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
      "Content": "Aug 19, 2010 09:33PM Maakmezorgen wrote: Hi CoolBreeze,  Thank you for your quick reply. I am not sure if it is called classification 0. As I live in Central America the results are in Spanish. But from what my doctor said and what I can find online it means that the assessment is incomplete. I am just hoping for the best and am trying to stay positive but it's a bit hard as I just lost my mom and am now being confronted with it again. The thought alone makes me very emotional, especially because I have a little son... Fingers crossed for next week!",
      "MessageIndex": 3,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756961",
      "Title": "Microcalcifications and more exams Maakmezorgen reneedjones"
    },
    {
      "AuthorID": "Maakmezorge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
      "Content": "Aug 25, 2010 08:48PM Maakmezorgen wrote: Update: Went to the doctor on Monday who referred me to an oncologist. He wanted to check everything and said we could wait and check again in 3 months and then again in 6 or do the biopsy. I decided to do the biopsy as I would just be stressed out for 6 months. Also because there would still be a chance of having to get the biopsy done. The biopsy was this morning and I was surprised by the amount of tissue they took out (about 4.5 cm by 1 or 2 cm). But he said they got the whole area so at least that is good. Now I \"just\" have to wait for the results, about 10 days.  I will give another update as soon as I know more. Not that the biopsy is done I have another question. Considering how much tissue was taken out, will this leave a big \"hole\" in my breast? I guess you will be able to see it but I just wonder how much you will see.",
      "MessageIndex": 16,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756961",
      "Title": "Microcalcifications and more exams Maakmezorgen reneedjones"
    },
    {
      "AuthorID": "Maakmezorge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107373/profile",
      "Content": "Sep 3, 2010 07:47PM Maakmezorgen wrote: Hello again, I just received the results and everything seems to be benign!!! The oncologist wants me to see him again in 4 months though. Not sure why. I do have some questions regarding the results. As it is the weekend now, I won't be able to ask him nor my doctor till Monday and I hope someone can explain some things. The conclusion was (the results are in Spanish so I hope I translated them correctly): Ductal microcalcifications associated with ductal hyperplasia non-atypical cribriform & apocrine micropapillary with associated fybrocystic mastitis. Thanks!",
      "MessageIndex": 19,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756961",
      "Title": "Microcalcifications and more exams Maakmezorgen reneedjones"
    }
  ]
}