{
  "AuthorID": "macprer",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248128/profile",
  "Posts": [
    {
      "AuthorID": "macprer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248128/profile",
      "Content": "Sep 18, 2017 11:48PM - edited Sep 19, 2017 12:50AM by macprer I finished radiation in May (shorter course Canadian style treatment my RO called it.) My skin did well using Calendula cream for a topical treatment and I still use it twice daily. I say well because it has been several months, but I am sure I thought my skin was on fire then. I was super tired 2-weeks into treatment, and exercise was grueling but I continued as I was able (30-45 minutes daily.) I lost a good 10 pounds during radiation but I was super vigilant about self-care and my diet. Now my skin is tan and a bit thicker. My right breast is also larger than it was originally which was unexpected given the lumpectomy. I was not aware until now that stiffness increases 3-6 months after radiation and now my pectoral muscle is super tight. I can deal with this for now doing stretches, but also I have a vein like thread that runs along my middle-lower ribs in a vertical direction that is causing pain. I have been doing cross friction massage and stretching which is not yet working. Anyone heard about a similar situation? I found only a single comment on the web with no subsequent responses about it. My cording resolved with home stretching, massage and swimming (side stroke.) The repetitive lengthening in the water with side stroke really helped to relieve my symptoms. My biggest frustration about all the treatment is the lack of information my medical team has provided about side effects. I knew nothing about cording, sentinel node removal pain, pectoral stiffness and hormone medication side effects: all which seem to be very common. I was given great information about skin care following surgery and radiation though. FYI: I have elected not to take Tamoxifen after trying it twice over the last 6 months and hope my self-care will be sufficient to prevent another diagnosis. I am super thankful for all who have gone before and share their experiences. We all have a very different and personal yet common journey. Best all. ",
      "MessageIndex": 457,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "macprer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248128/profile",
      "Content": "Sep 21, 2017 12:48PM macprer wrote: Hello; I am humbled to read about your individual journeys. Courage is marked by your words. Had I not gone through SOME of what many of you had, I would not have previously understood. The take-back from my experience is that health care providers forget to be present with each individual they meet. I too am a health care provider and my current situation has taught me empathy I could never know without my personal experience. I think it is good to REMIND them some how. I had words with my RO and techs about ways to make the terrible experience more tolerable. Please remember, radiation is something you need to do on a daily basis for several weeks, not just once, and telling you to just bear it is not okay. First, if you feel uncomfortable at your initial mapping, they CAN change things up to make it more comfortable! All modifications should be done at the initial mapping and carried out consistently after. They tell you, at your initial visit that all subsequent visits will be shorter, but that is not true! it is harder to fix it later. These are smart people who can fix it and one size does not fit all. As an example, when I went for a MRI, I told them I could not stay on my belly without rib padding, as the procedure lasted for 20-minutes. They added padding and I finished without misery. My sister, who is thinner than me, was refused this modification and she teared her way through. This is not right. You are going through a tremendous ordeal, and if possible, you should be offered all modifications as is possible, whether it is convenient or not. Best to you all.",
      "MessageIndex": 482,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    }
  ]
}