{
  "AuthorID": "macska-ma",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
  "Posts": [
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Jul 25, 2014 12:07AM macska-ma wrote: dear ladies, stage iv, dx 3 weeks ago.mets to liver.",
      "MessageIndex": 578,
      "PostDate": "25/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "macska-ma wrote: Dear ladies,  I was diagnosed with liver mets a month ago. First they used ceus (Contrast-Enhanced Ultrasonography) and ct and found multiple mets, two big (7 and 5cm) and 4 small ones (around 1 cm) and 2 bigger nodes, one near stomach, one near liver. Week after, on 15th of July  they did PET, and found 2 mets, 9 and 7 cm large, and some smaller ones, near the bigger one (the number was not mentioned in the finding) and also those suspicious nodes. On the 17. my chemo had started (gemzar/cisplatin), then continued on 24. 7.  On the 28. 7. they did MRI as a reference to the efficacy of the chemo. According to the docs it is the best method to scan liver mets. Ive got the MRI results: one is 6.8 cm with central necrosis, second is 4,5 cm, both in the left liver lobe, the 3th lesion is in the right lobe,  it is small and its probably a cyst. No other met had been found. MRI found nodes too. Pet scan is great method to find distant mets, but exact size of lesion can MRI scan much more better. So I can understand the discrepancy between size of two large ones.  But I dont understand, where are those little ones that CEUS and PET found. I asked my doc if there is a possibility, that my chemo (2 rounds so far) made those little ones disappear. She said it was not possible. But she didnt give me any explanation  for these differences in those findings. Anyway I will ask when I meet her (she called me yesterday).  Do you have similar experience, that is different scan methods bring so much different results?  And I would like to ask, if there is anybody, who would have similar lymph nodes in the abdomen? My doc told me, itis unusual for an advanced breast cancer.  Thank you so much Dx 2/2013, 2cm, Stage IIB, Grade 3, 0/1 nodes, ER-/PR-, HER2- Chemotherapy 3/4/2013 AT Surgery 9/6/2013 Lumpectomy: Right Radiation Therapy 9/25/2013 Breast Dx 7/7/2014, 6cm+, Stage IV, mets Chemotherapy 7/15/2014 Carboplatin (Paraplatin), Gemzar (gemcitabine) Chemotherapy 10/29/2014 Xeloda (capecitabine) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823316",
      "Title": "Discrepancies in PET/scan, MRI and CEUS findings macska-ma macska-ma"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Aug 6, 2014 08:19AM macska-ma wrote: thank you!  Today i am having biopsy of liver mets, so another ceus will be done. I will ask them to do biopsy of those 'suspicious' nodes too. We will see. Sending you hugs!",
      "MessageIndex": 5,
      "PostDate": "06/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823316",
      "Title": "Discrepancies in PET/scan, MRI and CEUS findings macska-ma macska-ma"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Nov 5, 2014 03:50PM macska-ma wrote: thank you all!! You are so precious to me, you are giving me Hope. Today was my pet, results maybe tomorow or next week. Woody, fingers crossed, let us know (((((hugs)))))",
      "MessageIndex": 747,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Nov 6, 2014 02:23PM macska-ma wrote: woody, its great news!!!!!! i am sure they will confirm that tomorow! We have so rude radiologists, they dont want to tell us anything before the report is done.  I've got the PET report today. They confirmed progression, but no other met in my body. Uffff. Extensive liver mets and two nodes (one of them has 50mm:( Do you have nodes involved? I have one near stomach and one near liver. I am afraid that huge mets and nodes dont give me a time to try treatments. We are asking doktors and insurance about y90. But they are afraid they are too huge for y90 too. They will let me know. ",
      "MessageIndex": 759,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Aug 7, 2014 04:05PM macska-ma wrote: Bon, thank you!",
      "MessageIndex": 8,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823316",
      "Title": "Discrepancies in PET/scan, MRI and CEUS findings macska-ma macska-ma"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Jul 25, 2014 02:54AM macska-ma wrote: Krystyna, sending you hugs and thinking of you. Waiting is the hard part of this struggle. Personally, it was my problem that i tried to manage for all my life, but now its much more difficult because I feel  helplessness sometimes. I am new here. I was diagnosed 3 weeks ago. after sudden big terrible pain in my abdomen that went to my shoulder,  we went to hospital. They told me i was bleeding to abdomen, from my liver mets. That was big shock. I was asymptomatic, no tumormarkers, feeling great. Month after my wedding. Two weeks after my onc. appointment, when she told me everything is ok.Dispite the fact she is the one of the best in tnbc field, she never send me to ct or ceus or pet.only before my first chemo. My fault too, anyway...its not about insurance in CR. It was just mistake i think. I was in risky group.Young, 31yrs old (90% proliferation), tnbc,and not responding to chemo (a/c resistant from begining, taxotere after 4.cycle). So after ceus, ct and pet they found 5 mets.two of them huge. Biggest one 9cm, necrosis inside of it.second one 5 cm.rest is small.Now on cisplatin/gemzar. Waiting for biopsy (will have in 2 weeks, they will send it to chemosenzitivity testing) and MRI on monday.So scared but starting to Cope it better i guess. I am not crying all the time.  one or two good cry a day and than trying to survive.My beloved husband, friends and great work help me, such a gift from God especially these days.also writing blog. My survive strategy was always to be in reality (prepare for various possibilities) but hope for best.Now its harder. I am scared because i have experience of chemo not working. Also, liver mets are too big. And i am preparing for the day when it spread to other area, because it is how tnbc behave. I am mourning too for not having kids... that has always been my greatest desire.  Maybe MRI will show something on monday, maybe not. Its too early i suppose. But now i am living in short time Intervals, it helps me. Now my interval is to next MRI. I try to live in present moment, that was my favourite thing before dx, but now its much more chalenging. Present moment after dx can have sometimes lots of pain. But still can handle it because good things are there(here)  too. i will do everything to survive the longest time I can, finally i must leave it in the Gods hands. I would like to thank you ladies. This forum helps me so very much. You are so wonderful and brave and caring and you give me lots of power. Also because of you i can cope this. Martina",
      "MessageIndex": 396,
      "PostDate": "25/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Jul 27, 2014 02:42PM macska-ma wrote: thank you so much for your wonderful words that make my sorow bearable at the moment. Leftfoot, i am so happy to hear your great news!!! <3",
      "MessageIndex": 407,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Nov 4, 2014 05:33AM macska-ma wrote: hello everyone! Im so scared. Results from MRI of liver: I have progression in liver after cispl/gemzar. Two hugest are +1 cm bigger (so now they are 8 and 6! And satelits) And new one appeared 29×19. All in right lobe. both nodes in abdomen are bigger. All with some central necrosis. I am so so sad and scared. I am afraid that i have so little time because of my resistance and size of lessions. We changed immidiately to xeloda. Tomorow i have scheduled PET/ct. Please do you have similar experience.",
      "MessageIndex": 739,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Aug 9, 2014 02:40AM macska-ma wrote: Kelly, its great that now you know more about possibilities of treatment, i can imagine it can give you a lot! I am sorry for silly question, but what is name of the test?  Hugs",
      "MessageIndex": 816,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "macska-ma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202765/profile",
      "Content": "Aug 9, 2014 05:30PM macska-ma wrote: thanks!  Your insurance covers it?",
      "MessageIndex": 818,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    }
  ]
}