{
  "AuthorID": "Maddog23",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177059/profile",
  "Posts": [
    {
      "AuthorID": "Maddog23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177059/profile",
      "Content": "Apr 24, 2013 09:51AM - edited Apr 24, 2013 09:55AM by Maddog23 Hello to all. I am very scared. Woke up Saturday morning and immediately felt pain in my right breast. As I walked to the bathroom I knew something was not right. I could feel my right arm rubbing on my right breast as I walked. So not only was my breast sore but also swollen. My right breast also felt warm to the touch. I stood before the mirror and noticed the right breast was larger than the left. Called my gyno first thing Monday morning at 8:00 am. I was sitting in the PA's office at 10:00 am for a breast exam. She prescribed 10 day antibiotic and ordered a diagnostic mammogram and ultra sound. Had mammogram at 2:00 pm and ultra sound immediately afterwards. As I waited for tech I looked at my breast again in the mirror. I now have a red patch on my right breast where the lump is at. Tech said they could feel the lump on my breast but nothing is showing on scans. Told me to go home and wait to hear from my doctor. Called my doctor's office after test and left word that I would like an MRI of breast. This afternoon I still have not heard from my doctor. After reading up on Internet my symptoms sound a lot like IBC. I called my doctor's office again asking to please have doctor call me. I know she is very busy but I'm scared and want answers quick! This morning I woke up and it looks like the redness has spread closer to my nipple. It's more pinkish than red. Still very sore..p>",
      "MessageIndex": 3,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803707",
      "Title": "Wish Drs could be a little more specific HumbledBug HumbledBug"
    },
    {
      "AuthorID": "Maddog23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177059/profile",
      "Content": "Apr 24, 2013 03:57PM Maddog23 wrote: Thanks HumbledBug. Finally heard from my doctors office this afternoon. I now have an appointment tomorrow morning with a breast surgeon.",
      "MessageIndex": 5,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803707",
      "Title": "Wish Drs could be a little more specific HumbledBug HumbledBug"
    },
    {
      "AuthorID": "Maddog23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177059/profile",
      "Content": "Apr 23, 2013 07:50PM Maddog23 wrote: Hello to all. I am very scared. Woke up Saturday morning and immediately felt pain in my right breast. As I walked to the bathroom I knew something was not right. I could feel my right arm rubbing on my right breast as I walked. So not only was my breast sore but also swollen. My right breast also felt warm to the touch. I stood before the mirror and noticed the right breast was larger than the left. Called my gyno first thing Monday morning at 8:00 am. I was sitting in the PA's office at 10:00 am for a breast exam. She prescribed 10 day antibiotic and ordered a diagnostic mammogram and ultra sound. Had mammogram at 2:00 pm and ultra sound immediately afterwards. As I waited for tech I looked at my breast again in the mirror. I now have a red patch on my right breast where the lump is at. Tech said they could feel the lump on my breast but nothing is showing on scans. Told me to go home and wait to hear from my doctor. Called my doctor's office after test and left word that I would like an MRI of breast. This afternoon I still have not heard from my doctor. After reading up on Internet my symptoms sound a lot like IBC. I called my doctor's office again asking to please have doctor call me. I know she is very busy but I'm scared and want answers quick!",
      "MessageIndex": 19,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798392",
      "Title": "Lump felt , but not visible on mammogram or ultrasound jabnee Maddog23"
    }
  ]
}