{
  "AuthorID": "maddie103",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58061/profile",
  "Posts": [
    {
      "AuthorID": "maddie103",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58061/profile",
      "Content": "Dec 12, 2007 08:23AM maddie103 wrote: Minette, Yes, you can get pain from liver mets.  My MIL has them and is currently doing Herceptin only (she's on a chemo break as well - since September - her body did not tolerate it at all) and even though her liver mets have shrunk somewhat, she still has pain from them and takes pain meds for it. Hope everything works out for you. Linda, PA",
      "MessageIndex": 7,
      "PostDate": "12/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696735",
      "Title": "Chemo break minette joanne1428"
    },
    {
      "AuthorID": "maddie103",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58061/profile",
      "Content": "Feb 8, 2008 04:05PM maddie103 wrote: My MIL had first been diagnosed with bc (stage 1) 3/03 and it was disovered she had bc mets to liver in 5/07.  She was having severe abdominal pain, bathroom problems, etc. She ended up being admitted to the hospital and they did an ultrasound and saw some spots on her liver.  They followed up with a liver biopsy and it was determined to be breast cancer spread to her liver.  She is currently on Herceptin only and as of her last scans, the cancer is not progressing.",
      "MessageIndex": 15,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699876",
      "Title": "how do you know if you have liver mets? jinky Denny123"
    },
    {
      "AuthorID": "maddie103",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58061/profile",
      "Content": "Dec 18, 2007 08:09PM maddie103 wrote: I'm very sorry for what you and your family are going through. I'm sure there are no words that can comfort you right now, but know that a lot of us are thinking of you and your family in our prayers. Linda",
      "MessageIndex": 43,
      "PostDate": "18/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697113",
      "Title": "Very advanced B.C.: Diane's final gift. Bimmer ilenee"
    },
    {
      "AuthorID": "maddie103",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58061/profile",
      "Content": "Nov 27, 2007 05:04AM maddie103 wrote: From a caregiver persepctive, please let me respond.  My MIL has bc to mets to liver (mets to liver since May 2007).  I have never thought she should be doing things if tired or got on her about her \"attitude\" even though she definitely frustrates me at times. For example, her eating habits are horrible and she does not have a varied diet at all (microwave cheddar baked potatoes, canned peaches and chocolate ice cream and candy).  I certainly don't think making better food choices will cure her but do think better food choices might give her better quality of life.  But instead of badgering her about it, her daughter asked her mom's doctor about it and he basically told us to let her eat whatever she can tolerate and hold down (she is extremely undeweight - only about 69 pounds). We did get on her about not returning our phone calls when she was in her very depressed state (she lives by herself and is elderly - 69 years old) so we weren't trying to get on her case but we need to know she is ok as this cancer is slowly taking away her independence.  I think the cancer, drugs and combination of old age are really taking their toll.  I don't think 69 years is old but if you would see her, you would think she was pushing 90 and not 70. So she has gotten to the other extreme of the phone calls.  She will call all of her family members six to ten times a day (she says she's lonely and bored) which I can understand but we do visit her, offer to bring her to our house, take her out and she does hang out in her apts community room.  The constant phone calls get annoying when you are at work trying to work, take care of small children, etc.  I never tell her that (sometimes I just don't answer her calls but always call her back later).  My hubby and I were at the movies Saturday evening (I told her earlier that afternoon we were going out) and she forgot and called us 3 times during the movie.  My cell was turned off and I didn't answer it but we could see the caller id.  I was pretty upset with her yesterday.  We had a great time going to a local craft show and she came to visit her grandchildren for a short while.  She was very tired but said it felt great getting out.  When I took her home, I had to go to the store to buy some groceries and we always ask her what she needs (she's on a fixed income and her children are her income supplement to her meager social security) and she had the nerve to ask me to buy her cigarettes.  Even though I've read that smoking cigarettes doesn't cause breast cancer - all I could keep thinking is you're battling Stage 4 bc and you want to smoke.  Plus the fact that my family works hard to support ourselves and our two children and are not about to support her bad habits.  Needless to say I told her no. Sometimes I feel guilty when she pushes my buttons because I think her time with us is limited and we probably shouldn't be arguing, etc. and getting upset over what's mostly petty stuff, but in spite of illness, etc. I guess there will be times when family just gets on your last nerve. I try my best to keep my emotions in check but it gets hard watching your parent turn child like.  I'm also dealing with a very sick mother (congestive heart failure, end stage renal disease) with the only thing keeping her alive is a ventilator and dialysis.  I think how can she continue to live like that (she is not in a coma but fully aware) but she does not want them to stop treating her (even though the doctor said she will never be off the ventilator - they tried several times weaning her unsuccessfully).  I'm dealing with the stress of my mom and wishing that God would just let her die instead of letting her suffer plus my MIL and her bc and the issues that go along with it. I did not mean to rant at all and it appears I got totally off the topic.  Just know as a caregiver/helper that we try to help our loved ones as best we can but are only human and may not always say or do the best thing.  I'm sure some people are just outright mean intentionally but I would hope that is not the case with most friends and family.",
      "MessageIndex": 10,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695919",
      "Title": "Have u ever encountered anyones attitude without BC? Ter EnergizerBunny"
    }
  ]
}