{
  "AuthorID": "magbrew",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217317/profile",
  "Posts": [
    {
      "AuthorID": "magbrew",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217317/profile",
      "Content": "Jun 24, 2015 09:09AM magbrew wrote: Hi Everyone, I have been diagnosed with Stage 2 Breast Cancer and starting Chemo therapy of T & C tomorrow morning. I'm scared and frighten, and looking for any positive information that you are will to share with me. I had a Radical Left Mastectomy on April 9, now Chemo.",
      "MessageIndex": 156,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "magbrew",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217317/profile",
      "Content": "Aug 13, 2015 10:20PM magbrew wrote: Thank you everyone I seriously thought I was the only one after seeing the nurse practitioner yesterday,she just looked at me like I had 3 heads. I'm seeing my surgeon tomorrow and will address her with whats going on, to hear what she has to say about it. I will back with her remarks. Again thank you. Blessing to everyone.",
      "MessageIndex": 393,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "magbrew",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217317/profile",
      "Content": "Aug 13, 2015 07:06PM - edited Aug 13, 2015 08:10PM by magbrew Hi Everyone, I have a question for anyone on T&C. Has anyone developed problems with their eyes twitching? This is driving me nuts, for I know its from the chemo. It started in one eye after 2nd round and now both after 3rd round. _________________________________________ Nails: Fill gallon size baggies up with crushed ice and put your hands in them during treatment, and use Nail Teak II",
      "MessageIndex": 389,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "magbrew",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217317/profile",
      "Content": "Jul 15, 2015 08:24PM magbrew wrote: Hi Everyone, I'm new to the group, my friend Badger on here refereed me to the Chemo in June forum. I'm not sure how to post on here, I hope I'm doing it correctly. I want to thank all you beautiful ladies you are a true inspiration. I started this journey on June 25th with my first round of TC, Nulasta shot the next day, I go in every Wednesday following chemo for blood work, then chemo on the 21st day following. My question is blood work. Has anyone had there red blood count drop? If so how many treatments have you had? It took about a week for my white count to come back up and two and half for my platelets. Any comments would be greatly appreciated. My second round of TC is tomorrow. P.S. You ladies look beautiful, I started loosing my hair on Thursday of this last week and I've have had a emotional time embracing it. You all are a huge inspiration for me to shave it off. _______________________________________________ Mags age 52, Oncotype dx 32Dx 03/03/2015, IDC, Left <2.8cm, Stage 2B, Grade 3, 1/9 nodes, ER+/PR+, HER2- (Surgery 04/09/2015 Radical Left Mastectomy with Axilery Lymph Node Removal No- Reconstruction / 1 Lyph node was full.Chemotherapy 6/25/2015 Cytoxan, Taxotere",
      "MessageIndex": 336,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    }
  ]
}