{
  "AuthorID": "magdalene51…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
  "Posts": [
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jul 14, 2016 10:07PM magdalene51 wrote: Hi. 2016.",
      "MessageIndex": 66,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 4, 2015 02:39PM magdalene51 wrote: Man I would love to be tranquillized beforehand! My rads machine is a combo ct/rads, makes a full circle scan which they use to check positioning. My worst days are when they don't get it right the first time and have to reposition and redo the scan. New person today, didn't get it right the first go round. I get cranky, even with a double dose of Percocet in me. And I'm getting cramps in the back of my hand from where it has to be. Grrr.",
      "MessageIndex": 1397,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 18, 2015 08:45PM magdalene51 wrote: RO told me I would have 28 tx plus 5 boosts. Today they did the set up for the boosts which are scheduled to start next Wednesday. As the RO is drawing on me she tells the techs, \"This area is the first week, and this area is the second week.\" I'm freaking out. 10 boosts? When was that decision made, and why wasn't I consulted, or at least informed? These people know I have to arrange rides, and my rides were told one more week, not two. I am not a happy camper. I'm hurting, and skin under arm started sloughing off today. Whole area very tender.",
      "MessageIndex": 1742,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 20, 2015 08:44PM magdalene51 wrote: LARock, I will have 36 total: 28 + 8 boosts. I was initially told 5 boosts, found out about the other 3 this week. Two regular tx left.",
      "MessageIndex": 1808,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 23, 2015 08:08PM magdalene51 wrote: Welcome, Jean! Always good to see a familiar face!",
      "MessageIndex": 1873,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 24, 2015 08:53PM magdalene51 wrote: Holy cow, Texas! Same thing here! I have arthritis, and hypothyroid, but the past week my arms have ached from the clavicle to the wrist. My bad knee is worse, and my bad shoulders are really bad. Today was #27 of 28, then 8 boosts.",
      "MessageIndex": 1905,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 1, 2015 02:13PM magdalene51 wrote: I don't know what the difference is between the areas that have shown major damage and those that haven't. My underarm area seems to have begun healing on it's own, but the area on my left clavicle and a couple of inches below the incision are really bad - raw and weeping. Been using silvadene 2x a day then covering with telfa pad. The area on my clavicle is about 2\" round, the other is about 2\" wide and about a foot long, from the sternum around to almost the back. I've been cleaning with just cool water on a cotton ball. Even that is teeth-gritting painful. 6 boosts left.",
      "MessageIndex": 2054,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 2, 2015 08:47AM magdalene51 wrote: As much pain as I had with my shoulders at the beginning, it's nothing compared to the pain of raw skin on my chest. To add insult to injury, it stinks to high heaven and seeps through my clothes. Even with telfa pads, I wake up in the morning with wet spots on my nightshirts. If some one had told me, when I was griping about the shoulder pain at the beginning, that by the time it was over I would be praying to have only that level of pain, I would have just walked away. I don't know of a percentage of \"cure\" possibility that would make it worth it. Your results may differ, of course.",
      "MessageIndex": 2079,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 2, 2015 09:06PM magdalene51 wrote: Oh sweet sisters, thank you so much for your encouragement and gentle hugs. This has indeed been the hardest trial of my life – and at 63 I've had some doozies. The worst thing for me (besides the pain) has been that I feel like I've become a self-centered whiner. One of my dear friends, who lost her mom last fall, is now losing her aunt to stage 4 lung cancer, multiple tumors in both lungs. I try to be faithful in prayer, but it has become harder and harder. It's been bad – but others have it so much worse, including some of you. You have been an oasis of caring in this desert of treatment. LARock, you are so right about us being cancer treatment survivors.",
      "MessageIndex": 2103,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 11, 2015 02:30PM magdalene51 wrote: Dacre, congratulations on winning this race! I am also a sharing type. Not everything always, but selectively, and certainly to those who care enough to ask. My incision looks and smells disgusting today, and my right arm aching so bad it hurts to type, even on iPad.",
      "MessageIndex": 2316,
      "PostDate": "11/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 27, 2015 09:24AM magdalene51 wrote: Mega grats for all the finishers! And to those who are dragging themselves to the finish line, you can do this! Don't know how many times I threatened to quit, but I managed. My wound area is down to one tiny scab which will probably come off in the shower today. Tomorrow marks one year since I found the lump, on the last day of a cruise. And two weeks later I will turn 64. Last year I spent my birthday getting a mammo and u/s and being told it was \"definitely malignant, but we will biopsy for dx\". Now I am NED.",
      "MessageIndex": 2598,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 3, 2015 10:02AM magdalene51 wrote: I'm 3 weeks out now, finally healed, and still haven't started my anastrazole. It's been sitting on my bedside table. As bad as my joints are now, I shudder to think... But I will start on Monday. I don't want to take a chance of it interfering with my Easter plans. Quiggy, I feel your pain. Literally.",
      "MessageIndex": 2684,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jun 19, 2015 09:18AM magdalene51 wrote:",
      "MessageIndex": 3050,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 16, 2015 07:37PM magdalene51 wrote: Today was just a hair better than yesterday. The positioning didn't take quite as long, and I'm hoping it will improve each time. I also got a chance to visit with the RO about the shoulder issue. She is adamant that the position is necessary in order to get a clear shot at the area. She feels that the rads are absolutely necessary because of the aggressive nature of the tumor. Even though my end of year PET scan was clear, that doesn't mean there aren't a whole bunch of cancer cells lurking about. The rads will reduce the chance of recurrence. So there's no way she's letting me off the hook. The problem with the shoulders, especially the left (cancer) side, has been around since 2005. In 2006 I had 2 surgeries to repair the rotator cuff, which had been sliced nearly in half by a bone spur. The 1st surgery failed due to over-aggressive PT. My current orthopedic specialist (who is not a surgeon) has told me that the only thing that can be done is complete shoulder replacements. There is no cartilage on the head of the humerus so every movement is bone on bone. You can actually hear it crunch. But I've not done anything about it because I didn't need to. When I talked to the pain doc the other day he said the only PT that might be helpful would be massage and light stretching. Not strengthening modalities. I've had years of PT with little improvement, finally just gave up. Shoulders – pfft! Who needs them?",
      "MessageIndex": 989,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 1, 2015 01:17PM magdalene51 wrote: There's a game today or something?",
      "MessageIndex": 1309,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 19, 2015 08:08AM magdalene51 wrote: As upset as I am about 10 boosts, what upset me most is how I found out about it – by hearing the RO tell the techs as she's drawing on my chest like I'm a slab of meat. I saw her the day before and she never said a word about it. And she knows I have to arrange for drivers. Grrr. When did she make that decision, and couldn't she have practiced some common courtesy by informing me rather than letting me find out by overhearing her instructions to the techs?",
      "MessageIndex": 1749,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 10, 2015 12:31PM magdalene51 wrote: Well now my next challenge. Weaning off the pain meds. I had actually been on a regular regimen before BC, but stopped after my surgery, so was very reluctant to go back on them. Yesterday I took my 2 before tx, then didn't take any more. Couldn't sleep, pain and restlessness. This morning just on edge. Realized cold turkey wasn't going to cut it. Took half a tab and settling down now. Just want to find a better way to deal with the pain of my \"normal\" life: arthritis, fibromyalgia, etc. On the rads front, my incision where I had the first five boosts is a mess. I have slathered it with silvadene and covered with telfa pads and a tshirt for now. I cannot describe the disgusting mess and smell. I hope you all will be able to breeze through without ever seeing anything like this. Oh, and I forgot to say, congratulations, Quiggy! Snoopy dances!",
      "MessageIndex": 2291,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 15, 2015 08:12PM magdalene51 wrote: I have had some fairly severe skin reactions - enough so that I am still slathering silvadene and covering with telfa pads. Tried securing with tape but lost skin when I removed it, so I am using an old sports bra to hold it in place. (I have no reconstruction.) I am six days out from final boost. I use one of the little pillows I was given at the hospital after surgery, about the size of a sheet of paper and a couple inches thick, very soft, between my arm & body when I lie on my non-rads side, and under my side when i sleep on my rads side. Mostly I am a tummy sleeper, but always start off on the rads side. My damage area is receding noticeably each day. Small spot starting at site of tumor bed, last 3 boosts. Hopefully won't get too bad.",
      "MessageIndex": 2408,
      "PostDate": "15/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 29, 2014 12:59PM magdalene51 wrote: I was thinking it was the combo of that and my 5.8cm lump. Who knows! I'm here. I have follow up with surgeon Wednesday and waiting for call with oncologist appointment. He's going over my paths now. Had a meeting with him pre-op but don't know when I'll start chemo, still need port installed.",
      "MessageIndex": 400,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Nov 23, 2015 10:03AM magdalene51 wrote:",
      "MessageIndex": 1055,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 29, 2014 11:16AM magdalene51 wrote: Until yesterday I was a IIb, then I got the path report and learn I've been upgraded to IIIa – and I didn't even ask for it! Can't say I'm truly delighted to be here , but will try to make the most of it. Ten days out from surgery, still mighty sore, tight, achy, numb spots everywhere but I got all three drains out yesterday and had my first shower, washed my hair, just band aids on my drain incisions now.",
      "MessageIndex": 398,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 17, 2015 10:59PM magdalene51 wrote: Welcome, Tuffy, tho I'm sure you'd rather not be here at all. To put your dx under your posts, go to the top of the screen and click on My Profile. Go to My Diagnosis and answer the questions as best you can. Then Save, and you can Make Public so we can see.",
      "MessageIndex": 746,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jul 9, 2015 01:13PM magdalene51 wrote:",
      "MessageIndex": 959,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Oct 21, 2014 08:11PM magdalene51 wrote: My original dx after biopsy and u/s was IIb, grade 2 IDC. I didn't find the PET scan to be scary, but after the bmx, it was upgraded to IIIb, the lump that was measured at 3.8 cm on u/s turned out to be 5.8 cm when removed, and invasive into the chest muscle, some of which was also removed. I had elected to have bilateral for several reasons, although the surgeon said she could do a lumpectomy, she could never have gotten clear margins and it would have had to be a mastectomy in the end. As it turned out, there were pre-cancerous cells in the right breast as well, and my oncologist told me yesterday that the right breast, had it been left, would almost certainly become cancerous in a fairly short time. So I'm glad I went with my gut on that. Also, there is a node that lit up behind my sternum, which they could not remove without splitting the chest, so they left it, and that is the reason I have been moved to Stage IIIc now. I'm being presented to the radiation board as a good candidate for proton therapy, partly because of that node, and partly because with my tumor being on the left, proton is much more heart-sparing. I had my last chemo yesterday.  So I guess that node behind the sternum was the bad news after the PET, but to be honest, it didn't really register until I met with the radiation oncologist a few weeks ago. Best of luck, and do check back here and let us know how it turns out.",
      "MessageIndex": 611,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Oct 22, 2014 06:17AM magdalene51 wrote: The important thing about the prep is to keep the sugar out of your system because the dye they use binds to sugar molecules and if you have consumed sugar it can give erroneous readings. But follow the protocols they give you closely and you should fly through it.",
      "MessageIndex": 614,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Dec 17, 2014 08:02PM magdalene51 wrote:  Dstar, it might be helpful for you to read back some of the chemo group threads to see how your protocol affected others. I didn't have DD, had TAC all together, but I did take the steroids as directed, and never threw up. I monitor the July chemo thread, and there are others who did your protocol, so you might find things that could ease your fears. Information is key, the more you know, the less there is to fear. All the best.",
      "MessageIndex": 647,
      "PostDate": "17/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Dec 26, 2014 10:01PM magdalene51 wrote: When i finished chemo, MO asked if I wanted the port out, I said Heck No! So I just have to go in every couple of months to have it flushed.",
      "MessageIndex": 669,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 17, 2015 09:11AM magdalene51 wrote: I also had a large tumor, but had surgery first. BMX with no recon, ever. Just wanted em gone. Don't miss em at all, and no one ever notices – although I was a 44DDD. Now I just need to figure out what to do with old bras.",
      "MessageIndex": 693,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jul 31, 2014 08:45AM magdalene51 wrote: Hey dancingdiva, I am also stage 3. We'll get through this.",
      "MessageIndex": 443,
      "PostDate": "31/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Sep 9, 2014 09:20AM magdalene51 wrote: My MO said that it takes a billion cancer cells to be detectable in a scan.",
      "MessageIndex": 566,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Dec 27, 2014 11:39AM magdalene51 wrote: Minus, the big reason I opted to keep mine is that my veins are so bad. So many years of donating blood has left my inner elbows scarred, and the veins roll. I've had several blown out this year, so I'm definitely keeping the port.",
      "MessageIndex": 672,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 21, 2015 10:54AM magdalene51 wrote: Don't think I'll have a problem with it riding up, as you can see.",
      "MessageIndex": 697,
      "PostDate": "21/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 19, 2015 08:44PM magdalene51 wrote: 2Tabbies, I would very much agree with that for most of the daily wear items, but the special ones – there's one I had just bought, special ordered it, wore it once to formal night on the cruise (the last day of which was when I found the lump). Very expensive, black, lace etc. Although now I think about it, since it has those formed cups, I could probably wear it without foobs and no one would be the wiser.",
      "MessageIndex": 695,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 22, 2015 06:35AM magdalene51 wrote: Minus – at least for one day I could say I was NED – exactly! My MO says it takes a billion – BILLION! – cancer cells to even show up on a scan. The chance that cells may have escaped the wrath of chemo or rads seems to me pretty good. I doubt I will ever agree that I am \"cured\", even if NED lasts for years. I've seen too many reports of recurrence many years out. I will always be looking over my shoulder.",
      "MessageIndex": 780,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 20, 2015 09:45PM magdalene51 wrote: Hi LadyB! Welcome!",
      "MessageIndex": 805,
      "PostDate": "20/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 7, 2015 03:48PM magdalene51 wrote: I have a similar background of childhood sexual molestation, and rape, but at age 63 I no longer have body issues as far as being handled and loss of control. I'm sure the 27 years of marriage to a man I can trust is helpful. My issue continues to be my shoulders, which my RO is treating with narcotics. It's not a good solution, as I can't just take them for rads, I have to take them regularly, because the positioning injures them all over again every day. I don't consider myself a litigious person, but I want someone to pay for this (not money, but some kind of consequences). I had no pain in my right shoulder before RO sent me to PT. Now the pain is a constant 8, peaking to 10 on occasion. I think the rotator cuff has been damaged. Our rads room does have a backlit sky scene on the ceiling, but I can't see it because my head is turned away and the table is moved to my right to radiate my left side. There is no music, nor offer of any. I am able to play music in my head, but what I've been doing lately is saying the Rosary. I'm not a Catholic now, but I've found the combination of prayer and repetition is helpful to lose track of time. Personal prayer didn't work as the pain was so distracting, but using the rosary as a kind of mantra has been helpful.",
      "MessageIndex": 1502,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 12, 2015 07:43AM magdalene51 wrote:  Dacre, I've been noticing the past few days that there are times my voice sounds very hoarse to me. I know with the swallowing problems I've had the RO told me they do radiate my neck, so the esophagus can be affected, I suppose the same can go with the voice box.",
      "MessageIndex": 1630,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 27, 2015 08:55PM magdalene51 wrote: not to gross y'all out, but... Rotting flesh stinks.",
      "MessageIndex": 1987,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 4, 2015 09:42AM magdalene51 wrote: If you use straight deodorant it shouldn't be a problem, but antiperspirant contains aluminum which you don't want to have where it will be radiated. Last main boost today, then 3 smaller ones to the tumor bed. The end is in sight.",
      "MessageIndex": 2145,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 15, 2015 10:00AM magdalene51 wrote: Coyote, you can now add me to your list. Today is my first session. Ladies, I agree Coyote is awesome! She was a linchpin on our July chemo thread and kept us going when we were on our knees crawling to the john. My rads have been delayed for one reason and another. First, I had a lump that needed bx, turned out just fat necrosis. Then they did the sim before Thanksgiving. I didn't know if I was going to make it. I have horrible arthritis in both shoulders, but the left one is worse, and that's the tumor side. They called me in for practice session before Christmas, but there was a snag (literally, the machine wouldn't pass my elbow) so they had to do some re figuring. In the meantime, that flared up the shoulder so badly I called them and said I wasn't going to go ahead, couldn't take that every day for weeks. RO was upset, asked if she could refer me to pain management, I said ok. The pm doc said he could do a nerve block and see how that works. So that was done yesterday, and the relief is immense. So I am scheduled for first tx in 2 hours. The nerve block is short term, so we will see how long. There is an additional thing he can do to make it last longer, but pointless to do it before we knew if it worked. I haven't read through the whole thread, but I'll try to catch up.",
      "MessageIndex": 965,
      "PostDate": "15/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 16, 2015 07:52AM magdalene51 wrote: Good morning, Winter Warriors. Yesterday I went for my first rads and learned that the nerve block doesn't fix the source of the pain from the positioning. I have to have my arm at 180° and there is a bone spur that hits when I'm in that position. Yesterday's session was nearly half an hour in that position so it was ice when I got home. They've gone ahead and scheduled the rads as if there were no issues, without even talking to me about it, which annoyed me. The pain doc did say that he could prescribe a lidoderm patch for local pain, so I'm going to ask for that. I have my second session this afternoon. Thank you for your kind words, Coyote, but as I recall you were the one who did the heavy lifting in the July thread as I slipped into chemo fog. You are the awesomest.",
      "MessageIndex": 980,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 26, 2015 09:29AM magdalene51 wrote: Hey Bippy! Check in with Hermits, they are asking after you.",
      "MessageIndex": 1155,
      "PostDate": "26/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 27, 2015 12:38PM magdalene51 wrote: Hi ladyb, I just asked my RO the same question. It's 28 tx followed by 5 boosts to the incision area, so 33 total. Glad you reminded me to ask.",
      "MessageIndex": 1170,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 9, 2015 07:20PM magdalene51 wrote: Varian This is my rads machine.",
      "MessageIndex": 1576,
      "PostDate": "09/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 12, 2015 08:43PM magdalene51 wrote: Dacre, today was #21. Starting to pinken up.",
      "MessageIndex": 1655,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 25, 2015 02:10PM magdalene51 wrote: Final regular tx today. Tomorrow 1st of 8 boosts. Skin damage is pretty bad.",
      "MessageIndex": 1919,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 9, 2015 10:05PM magdalene51 wrote: Can't believe I neglected to tell you, I did finish today, whoop whoop! ",
      "MessageIndex": 2280,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 25, 2015 08:32AM magdalene51 wrote:  Coyote, I just want to come and spend a week in your studio with my oil paints, ok?",
      "MessageIndex": 2562,
      "PostDate": "25/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 27, 2015 08:32PM magdalene51 wrote: Well, ladies, I learned there is another side effect, and I have it. I saw RO today and mentioned I've been having trouble swallowing. She quite matter-of-fact ly told me that they are radiating up into the neck and sometimes this is a side effect. She prescribed something (don't have it yet) that will numb the throat to relax it so I can swallow. There's actually a whole thread on this, apparently most ROs do not want to admit it can be rads related. Mine had no qualms. Today was awful, they had to reposition me so I was in there way longer and shoulders in so much pain.",
      "MessageIndex": 1183,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jun 18, 2015 10:14PM magdalene51 wrote:",
      "MessageIndex": 3048,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Dec 12, 2016 06:46AM magdalene51 wrote: DH's gram was Helen too! Gardening is what I miss most of all, with cooking a close second. ",
      "MessageIndex": 1755,
      "PostDate": "12/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 24, 2016 04:03PM magdalene51 wrote: Wow, Chevy! If I'm not mistaken, that is a Double Delight hybrid tea – one of the most fragrant roses you'll find. I have grown them and they are just that beautiful.",
      "MessageIndex": 746,
      "PostDate": "24/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 24, 2016 08:43AM magdalene51 wrote: Jazzy, Rosie, do you know that doves mate for life? We have a pair nearby. Here is my rose for Rose: ",
      "MessageIndex": 739,
      "PostDate": "24/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 1, 2014 11:52AM magdalene51 wrote: Hi Ladies I was dxed 4/16 with IDC and told it was grade 2 but nothing else. Knew there was at least one node positive from the biopsy, but MRI shows there are more. I don't have the path results in my hand but got a call with more results: ER+, Stage IIb. I see a surgeon next Tuesday. I'm preparing myself for BMX with no reconstruction. So I've joined this club, and no offense, I'd rather not have.",
      "MessageIndex": 2157,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 3, 2014 03:26PM magdalene51 wrote: I received my pathology report this morning and have been going over the details. I've updated my dx so it should show up below. One thing is the Ki-67 number. Looking at the pamphlet from the main site on understanding your pathology report, the only thing I could find on it is in the Word List. It says, \"Ki-67 test: A test that shows how fast cancer is growing\" Here's what my path report says: Ki-67 Percentage Positive 30% Clone 30-9 (<10%=Low; 10-20%=Borderline; >20%=High) Does this mean that my cancer is growing fast? Anyone know? The other thing is the staging. They are saying on this IIb-III.",
      "MessageIndex": 2162,
      "PostDate": "03/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 3, 2014 10:44PM - edited May 3, 2014 10:47PM by magdalene51 Placid, I put that in because the pathology report says metastasis. The node they biopsied is malignant. The MRI showed \"Int mammary nodes not usually seen on MRI\" whatever that means. I do not remember seeing any notation that \"mets\" was reserved to distant metastasis. Once it's on the move, does it matter so much to where? However, for the sake of harmony, I shall remove the designation. (By the way, the question in the dx section reads: \"If your breast cancer is not recurrent, is it metastatic?\" It's multiple choice. What else should I have put?)",
      "MessageIndex": 2165,
      "PostDate": "03/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Nov 16, 2017 12:00AM - edited Nov 16, 2017 06:15PM by magdalene51 You ladies are so kind to welcome me into your circle. Believe me, I am rarely alone! My cousin, who is a very vigorous 80, has lived with us for 6 years and takes very good care of me. My biggest challenge with the financial/paperwork mess is that I'm the one that has to make the phone calls. Most places will not accept a proxy at least without power of attorney, which also requires a phone call/appointment/meeting with the estate attorney. I am simply hamstrung by this fatigue, complicated by interrupting waves of grief. The following is a bit long, but I wanted to share with you the amazingly delicate way my husband's eulogist and long time friend explained what led to his death. He is a theologian so it's a bit deep in places. It was originally written for my facebook page when DH was in a coma, and revised for his service program. Targeted for Destruction – Downfall of a Good Fellow Soldier of Christ While Tolkien's Elves ironically termed mortality as \"the gift of men,\" the Apostle Paul describes death as an enemy, to eventually be destroyed in the light of eternal life and truth of divine love. Thus do Christians hate the devil, the father of lies and aboriginal murderer (John 8:44). Within this larger warfare we lament the demise of our dear friend, Christian brother, and most beloved husband David. Although all are imperfect with many faults, David seemed in some ways too good for this dark world, which he brightened at every point he touched it. As his long-time friend and fellow labourer in the fields of the Lord, I saw him wield his ministry upon the dramatic stage where I met him as my director. In this sphere alone did David touch thousands of lives for the better. Then he strongly supported my bid to re- enter the academic arena in hopes to make contributions that will in that way build up Christ's kingdom. And many others will testify to other such fruits born from David's obedient love and selfless giving acts. Truly, he has long been a \"good and faithful servant\" (Matthew 25:21). For such reasons the enemy of our souls craftily abused even his deep and abiding love for his wife in order to ensnare him in despair– –a tactic that has reduced many a good person in the history of this present darkness in which we must abide as best we may for all too short a time. Succumbing to the subtle temptation to hopelessness, David inherited (we think) a predisposition to alcohol abuse, which was apparently the concealed weapon by which he was isolated from supporters and led, despairingly, to seek escape from this world of woe. Suffering general failure of major organs––liver, lungs, kidneys, heart– –David was kept alive by machinated methods in a state of induced coma, unresponsive, yet loved ones––friends, fellow-workers, family from afar, his everlasting helpmate –– all spoke to him, just in hopes he might hear. Eventually he came around enough, thankfully, before the end to bid farewell to his wife, for whom we pray unceasingly in this dark hour. Let us all pull together in loving support of one another, trusting to \"the Shepherd and Guardian of our souls\" (1 Peter 2:25), and not lose the blessed hope (Titus 1:2) that we will be reunited with David in a more peaceful place. A place, as Sam sang amidst Mordor's darkness of despair, \"where stars forever dwell,\" immune to the stormy clouds obscuring our tiny portion inside the vast reality of God's eternal love.",
      "MessageIndex": 1203,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 24, 2018 04:36PM magdalene51 wrote: Ok! I found a picture of the dress and a detail of the fabric, plus, a picture taken of me right before I met DH.  Hair was stil long, just put up for swimming/sunbathing. Va va voom!",
      "MessageIndex": 2900,
      "PostDate": "24/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 6, 2018 02:16AM magdalene51 wrote: Mic, I know what you mean about that little piece your DH sent you. My DH was not one for writing things down; in fact, as I’ve struggled over the last few months to understand what sequence of events led him down the dark path of self destruction,I’ve scoured all his digital devices (he was in IT so very much a computer oriented person), and I can’t find a trace of him. No journals, notes, files, even his old emails and text threads seem to have been cleared out beyond his last few months. But I have 2 letters he wrote to me, one a our ten year mark and one at twenty. I wouldn’t exactly call them romantic, in the usual sense of the word, but they expressed his love in very simple and straightforward terms. The second one was somewhat different from the first; he wrote as if it were a synopsis of a screenplay, how we met and married, how our life progressed. I’m glad he didn’t see the end. ",
      "MessageIndex": 3084,
      "PostDate": "06/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 6, 2018 02:55PM magdalene51 wrote:  I’m at my cancer clinic waiting for a scan. This is my view. ",
      "MessageIndex": 3094,
      "PostDate": "06/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 9, 2018 04:34PM magdalene51 wrote: Runor: GET  THE  PUPPY!!! I did.  Puppies are the best medicine whether you’re sick or not. True story.",
      "MessageIndex": 3197,
      "PostDate": "09/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 27, 2018 01:19AM magdalene51 wrote: Hi Mic, since you asked, I’ve been in the hospital since early Friday. Ran a fever. Long story short, rare se of gemzar. See Loverly a Sas’ post son insomniac thread. House will close tomorrow, remotely. Don’t know when I can go home, Wednesday or Thursday. Was actually in icu until this morning. Got a unit of blood today. Very tired, tryin to keep everything running and everyone up to date. Love to all. ",
      "MessageIndex": 3502,
      "PostDate": "27/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 29, 2018 01:00PM magdalene51 wrote: Well this was a first. Buying a house from a hospital bed. We had a very pleasant and efficient mobile notary, everything went off without a hitch, and closing is done. The hospitalist was just here, and has agreed I can go home, with home health and protocols in place. I will have to be extremely careful with any postural changes, sitting, standing, etc. Still not out of the woods for possibility of congestive heart failure. They don’t want to do a cardiac cath/stents with my extensive mets as it would be too invasive and not worth the risks. I will be forever grateful to Loveroflife (Loverly) and Sas-Schatzi for their years of expertise, research persistence, and love, because they were the ones who guided my medical team to the right diagnosis and treatment plan that got me through to today. I would kiss Loverly’s feet - but that would require postural change. So onward and upward! ",
      "MessageIndex": 3540,
      "PostDate": "29/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 19, 2018 07:15AM magdalene51 wrote: It’s crowded for sure with all of us in here, and someone’s chocolate is melting all over. Did anyone bring M&Ms? We’ll all need a good shower after this! Busy day for me too today, but thankfully they changed my times - I was supposed to start with labs at 7:45! But they changed that to 10:30. Whew. Then I see my PCP (who is also a dear friend) then oncologist then I start my new chemo. Abraxane this time. Anyone been down this yellow brick road? Haven’t really found anything too negative (other than, you know, it’s chemo!) and my infusion nurse says I may not lose my hair. That’s probably the least of my worries, especially after my last chemo experience! I actually look kind of distinguished bald. I have a good head for it. Off to Mae’s pocket first though! Who’s got the chocolate? ",
      "MessageIndex": 3859,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 19, 2018 11:37PM - edited Apr 21, 2018 09:38AM by magdalene51 Keet et al, when I was on halaven, it was absolutely the worst on me (until I met Gemzar, that is!) with hallucinations (probably from dehydration), turned my blood to sludge, could never get a port draw without calisthenics and a dozen saline flushes; I would literally lie in bed and pray to die. I asked MO how long I could expect if I stopped treatment completely. He said 4 to 6 months tops. Kinda sobered me up. As it happened, the next scan showed progression, so he switched me to Xeloda, which put me in remission in 6 months. But that's the only time he's said anything about it and only because I asked about quitting entirely. Guess I wasn't as ready as I thought. Now I'm actively engaged in living. Even without DH, I have found a sort of contentment I didn't expect. It's not easy, but it's possible.  ",
      "MessageIndex": 3886,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 4, 2018 02:40AM magdalene51 wrote: I cannot even believe what is going on in my house right this minute. I’m actually thankful that I’m not physically able to walk down the hall to see. Let me back up a bit. Last weekend was the estate sale, and while it did pretty well (about 70% sold) there was still stuff left. Two nights ago my neighbor dropped by to introduce herself and she said the neighborhood’s semi-annual garage sale is Friday and Saturday. I talked to my organizer about this being a perfect way to liquidate the remainder. She said she would transport stuff over here and I said I’d ask my sisters to help. The 72 year old has had my car (since I’m not driving) and the 59 year old has no transportation. I’ve helped both of them a lot over the past months especially, so I was confident I could ask. DS1 had committed to take her friend a couple of places, but I was just asking her to pick up DS2, who is physically able to help, and bring her over to help with the moving. DS1 has COPD and not in best of health. As the day went on and I heard nothing from them, I was getting concerned and upset. At 2 I told her to just get DS2 and go to the house. Her response: I’ll do what I can. I said, you have MY car, you CAN do what I ask! Several hours later (too late to help) they showed up. I was asleep. They didn’t come in to talk to me. Later, after I had some dinner, DS1 came in. She whined about how she’d been crying all day because I’d be upset with her and it was all DS2’s fault. She went back to the guest room they’re sharing. After while I realize I can hear their voices and I text them to keep it down so cousin can sleep. (Continued next post)",
      "MessageIndex": 4068,
      "PostDate": "04/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Aug 2, 2018 11:57PM magdalene51 wrote: Lynne (Man) bacon soda, eh?  Keetmom, when I got thrush with first rounds of chemo, my cousin had me do a mouth rinse with food grade hydrogen peroxide. Worked like a charm, probably not as tasty as Lynne’s bacon soda though. I have been busier than a one-armed wallpaper hanger since I’ve been home! Isn’t hospice supposed to be restful? So apparently I’m not allowed to be left alone lest there be an “event”. If you’ve heard me talk about my cousin/caregiver/housemate, you may recall that she has something of a shopping addiction, that is to say, she goes shopping every day. It’s always been something of a mystery to me, as I don’t like to shop, like at all. If I have to shop, I prefer to do it online. So I’ve been haunting amazon, Wayfair, overstock, chewy, etc. decorating the new house has been something of a challenge, as I’ve had to tussle with my dislike of shopping, while enjoying finding nice things that I really like - something I’ve never been able to do, always having had to compromise with DH, whose tastes were very different from mine. I’ve consulted with DC, because she will live here when I’m gone, and because we don’t differ too much in taste- she actually does pretty well buying clothes for me. Would you ladies be interested in seeing some of our rooms, or would that be too boring? Let me know. I still haven’t seen all she’s done, since I’m pretty much confined to the bed. I’ll try to do better about posting; I still read everything, but my retention is pretty much non-existent. So I send my love to you all, and whatever is going on in your lives - by the way, did someone ask if I were still doing chemo? The answer is a resounding no! No more chemo for this girl! As I see it, it’s the chemothat caused the domino effect of the last 5 months: Gemzar -> vasculitis -> DVT -> pulmonary embolism. I see a clear line of cause and effect, even if it can’t be verified. Things continued to go downhill when I was switched to abraxane, which tells me that although it might not have been doing any further damage, it is quite possible that it was, and even that it was doing more damage than can be known. I just decided it was time to stop playing Russian roulette with my health, however much time I have left. Ok I’m done (and done in!) for the night! Go sleepy bye as I tell my fur babies. That’s what I’m gonna do. ",
      "MessageIndex": 5360,
      "PostDate": "02/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 5, 2014 02:56PM - edited May 5, 2014 02:59PM by magdalene51 Special K, and others, about the mets thing. All I did was answer a multiple choice question in the profile and it asked: \"If your breast cancer is not recurring, is it metastatic?\" I answered yes because that's what my pathology report says. Please forgive me for being such a STUPID NEWBIE that I don't know the difference between \"mets\" and \"mets\"! I already said this all once! And I can't indicate how many nodes out of how many removed because I haven't even seen a surgeon yet! This is why I have to leave this forum. Every single stinking thing I write someone has to correct me! I came here for support and all I get is criticism. Y'all just need to check your superior and condescending attitudes at the door! Maybe you have enough survivors. You sure as heck don't need me. Outta here.",
      "MessageIndex": 2171,
      "PostDate": "05/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Aug 27, 2018 11:28PM - edited Aug 27, 2018 11:31PM by magdalene51 I have been trying to catch up, but I'm only on page 176, and there are currently 185 pages so I probably won't finish tonight. That being the case, I'm going to post a short update, and a house picture. I'm still pretty much bed bound. Any exertion leaves me breathless and I've struggled with panic when I can't catch my breath and feel like I'm drowning or suffocating, and sometimes it's the smallest movement, like repositioning my pillows or my butt. I'm also having trouble with the tumor behind the esophagus which sometimes causes food to build up and get stuck. I've also had a couple of emergency diarrhea instances so the commode has reappeared by the bed. Hospice nurse suggested increasing the time release pain med but oncologist fears respiratory distress so he prefers that I use the breakthrough meds as often as needed. The conundrum is, too much and I'm a zombie, too little and I'm in pain. It's mostly the bone mets that are the problem. Amazon continues to be my best friend, sending me stuff almost daily. Here's what I got for the foyer. Our problem was that the front door is oversized, with no storm door, and as soon as the door was opened, my Rose would want to be out! She made it a few times, and she's not easy to catch. We had been using fold up metal gates, but I wanted something permanent, something that looked like it belonged there. Here's the finished product.  By the way, I'll let y'all know when it's time to start worrying about me, ok?  ",
      "MessageIndex": 5710,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 27, 2014 09:49PM magdalene51 wrote: I noticed some referring to Facebook, is there a private group there? That's where I usually hang out, have wanted to find a group.",
      "MessageIndex": 6580,
      "PostDate": "27/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 28, 2014 03:44PM magdalene51 wrote: I got my drains out today, and got the path report which is now reflected in my signature line. 5.8cm, 4/8 nodes positive. It was odd to get a housecall from a doc, but he and his wife have been our friends for more than 15 years, and he assisted with my surgery. His wife was the first one I told, before my husband even, and she went with me to tests. When she saw the ultrasound, she was pretty sure and really prepared me for what was coming. And she was the one who called me with the biopsy results. We went through all of this with a mutual friend years ago, and I always knew who I would turn to if the time ever came for me. So blessed to have them. And, he says everything is looking good.",
      "MessageIndex": 6705,
      "PostDate": "28/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 21, 2018 12:33AM magdalene51 wrote: I've decided I'll take whatever the sellers come back with, I hope they accept my counter but even if they don't I can do it. But even having decided that I kept having meltdown after meltdown. Valium didn't help much, I lay here weeping and praying and missing DH so bad! Right after he died, I kept saying, I don;t know how to do life without him. And that’s the truth. Every decision is a harrowing experience. But God is so faithful. He reminded me of a beautiful song that’s sung by a fairly new Christian group called Veritas - if you get a chance, they’re touring now at churches all over - they had posted it the other day on Facebook and I played it again - it’s called “I Love You This Much”. Still tears, but better ones. Doesn’t help that I’ve been bed bound most of the past several days because every time I move something my muscles go into spasm - mostly my chest and lower abdomen, but it’s also my arms/hands and ankles/feet. I stretch my foot, my ankle seizes up. Most annoying.",
      "MessageIndex": 2799,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 21, 2018 03:40AM magdalene51 wrote: P.S. Micmel, I love you so much! And runor, like you I suffer from the “i don’t want to go to sleep” syndrome. It’s like this:  Amirite?",
      "MessageIndex": 2804,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 21, 2018 08:15PM magdalene51 wrote: Yeah, Grannax, I fear I’m gonna take a bath on this house. I may not take an absolute loss, but depending how we do it, I could be out of pocket 30-40k in repairs/updates to just break even. Although realtor and I disagree about what updates would be necessary. I know there are things like the vanity fixtures in all bathrooms, which are corroded, bathroom light fixtures which just don’t work where they’re installed, and I’d just as soon provide a flooring allowance rather than actually doing the replacement. Same with painting throughout; I am of the opinion that people would rather make their own choices about paint and flooring. But maybe that’s just me. About my son, I’m pretty sure he never expected any inheritance from me at all. First of all, he’s not DH’s son, and all this inheritance would come from what he provided. Second, my son was born when I was 18 and single (by the way, I’lll be 67 in April), and I placed him for adoption as an infant. I didn’t want to, but it really was the best thing, and he has had so many benefits and opportunities I couldn’t have provided. I began searching for him in his teens, and nearly obsessing about it until I finally left it in God’s hands, made sure my information was available to him should he ever go looking, and dropped it. July 10, 2005, I received an email forwarded from one of the mutual consent adoption registries, saying, “I think I’m who you’re looking for.” And indeed he was. It took him about 15 minutes to find me, but he was 35 at the time, and both of us had pretty much worked through all our issues, and came with no unrealistic expectations, and we have had a wonderful relationship, more deeply bonded each year. There’s lots more to the story, but my hands are tired and I’m fighting a headache. Hangover from meltdown yesterday I suppose. Still haven’t gotten that nap. It’s after 7. *sigh* ",
      "MessageIndex": 2826,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 18, 2018 06:58PM magdalene51 wrote: Hello dear ladies! I posted a couple of times back in November, you may or may not remember, not long after my husband’s death and you were so supportive. I’ve kept up a bit but thought I’d post an update on my progress. So far, to our knowledge, I continue to be in remission. PET scan scheduled for early March. My cousin/caregiver/housemate and I went to Michigan to spend the holidays with my sister. I spent most of the three weeks huddled in bed. It never got above freezing, and my sister’s household is chaotic. But at least I wasn’t here. And I got to see a bunch of family members. And my sweet doggo Rose got to accompany me everywhere as an Emotional Support Animal. My PCP was happy to write paperwork on her. She traveled like a pro, lying quietly on my lap through airports, restaurants, plane rides, etc. What a comfort. And I am finally working on carrying through with something that started going through my head almost 7 years ago, when DH and I bought this house, and I had my first cancer dx. And that is, I don’t want to die in this house. So yesterday I made an offer on a house that started speaking to me the minute I saw the thumbnail of it, and couldn’t get it out of my head. If this all comes together it will definitely be a miracle. It fits us perfectly, our lifestyle, our guests, our animals, etc. It’s actually slightly larger than our current place, but we are downsizing our contents drastically. And since I have neither the strength nor energy to do so, I was referred to a company called Caring Transitions. I met with the local franchise owner the other day, and they offer a full range of options for helping folks like us move, downsize, sell our stuff, etc. Their pricing seems reasonable. Basically I won’t need to lift a finger, only make decisions about what to keep, etc., and I can even have my friends help with sorting & packing, to help reduce the costs. So there’s my update and a recommendation. I’ll be checking in from time to time.",
      "MessageIndex": 2773,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 20, 2018 07:52PM magdalene51 wrote: Hi ladies, it's been a rough day. Between being hormonal and stressed, I just melted down. Actually took some Valium finally and i'm better. But it's been up and down all day. Sellers countered higher than I hoped, and I went back and forth all day over what to do. Lender gave me a fresh prequal at an even lower %, financial planner said go, finally cousin and I sat here and prayed. When we were done she said she got a strong message that I should actually write the buyers and tell them why this house is important to me. Realtor had told them about being widowed recently (ack that sounds so strange to me still) but not about the cancer. So i sat down and wrote to them. Sent to realtor. She said beautiful. Sent with our counter. Waiting to hear. They have until 5 tomorrow. Now i'm exhausted, nauseous, and cold. I just want a nap. Sorry it’s so long, thought you might want to see what I wrote. ",
      "MessageIndex": 2796,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 24, 2018 04:17PM magdalene51 wrote: I’ll go next. First picture is a portrait of me at 36, shortly before meeting DH.  We got married at the courthouse, didn’t bother with pics. We had only known each other 9 weeks. My family had bets on how long it would last (my 3rd marriage, his first). Next pic is 10 years later; we had started attending church and decided to renew our vows there, that this would be the “wedding” wedding. My mom (80 at the time) made my dress from a piece of ivory silk my father had brought her from China in the late 40’s. Eyelet daisies still show pencil marks where the pattern was drawn onto the silk before being embroidered. I designed it; my mother, who could sew anything, created the pattern from newspaper, and much of it is hand stitched. It’s fully lined as well.  My mother’s pearls for something borrowed.I’ll have to see if I have a picture of the dress somewhere.",
      "MessageIndex": 2897,
      "PostDate": "24/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 24, 2018 10:06AM magdalene51 wrote: Mic, I know the relationship between the two DDs makes it hard, but I'm of the opinion that we must eliminate or at least drastically reduce the presence of toxic people in our lives - and that's what that woman is, toxic. She poisons your thoughts, and brings you down to her level by doing it. I have no clue how you would get rid of her; maybe after both DDs weddings it will be easier. And surely her DD will understand. As close as you are to her, she is not blind to her mother's toxicity, and she also undoubtedly loves you enough to understand the effect it has on you. I'd have a heart to heart with her, maybe with both DDs. That's my two cents. As for the gift, most registries have online shopping you can access, so see if she has registered somewhere that has that option. MJH, thought you might appreciate a pic of the place we lived when we first moved to Camden, it was right on the bay, you could see Curtis Island from the house. As you can see, there is a long stretch of lawn that leads to the water, what you can't see is that the edge is actually about a 20' cliff down to the rocks. Looking at the house on Google Earth, I can see that the owners have remodeled and added a whole lot of square footage! When we rented it it was a simple Cape Cod with the exception of the sun porch having been incorporated into the living area and a bank of picture windows looked out to the water. So nice. I can't even imagine what it must be like now!  ",
      "MessageIndex": 3936,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 26, 2018 11:45PM magdalene51 wrote: Hello ladies, I have promised Mic I would check in and have sorely neglected to, though I do read all your posts. I want to send a special hug to holmes as I am sadly too familiar with that kind of loss. It tore my heart to read it. Mic, a belated happy birthday and congratulations on a return to normal. All the memories you have been sharing, so bittersweet. I have a picture frame DH bought a couple years ago, one of those you put a flash drive in and it cycles through the pictures, and I set it on a table where it’s always visible - maybe not such a great idea after all. The other day as I was feeling nostalgic, watching the pictures fade in and out, I was recalling the year each one was made. It made me somehow even sadder. So many pictures of him, healthy and happy, and then the last one that was taken of him, at our 30th anniversary party,, smiling but not happy, and so jaundiced. How did i not see it? But I did. I just couldn’t fix it. I’m glad though, that he can’t see me now. I had 2 abraxane tx before they stopped because my inflammation levels were getting out of hand again, and I couldn’t breathe. I’d walk the few steps to the toilet and back to bed and be gasping for breath. I finally got in to see the rheumatologist who consulted in the hospital, and - long story short - he and my oncologist put their heads together and put me back on 40 mg prednisone until we figure out what’s causing it. Yesterday I had a temporal artery biopsy to rule out (or in) giant cell arteritis, a type of vasculitis that affects the carotid system. I had a stat PET scan last week which was inconclusive for the inflammation issue, but found no cancer progression, so I will restart abraxane next week. The major development is that I am now on 24/7 oxygen, and while it does help, when I get up and move around I still have problems. Then there’s the little annoyance of my persistent taxotere drippy nose fighting with the oxygen cannula. I need a drip cup. When I was on oxygen in the hospital I asked for a mask instead, and I’ll probably do that again. The 2 abraxane tx were sufficient to loosen all my hair, so I visited my friendly hairdresser and I am now butch again. It will be nice and cool for the summer, should I ever be able to be outside. Fortunately I have not had any further cardiac events, although the occasional discomfort tells me I am not entirely out of the woods. One problem with diagnosing this inflammation is that since I was back on the prednisone for a few days before any testing, that may have compromised the results. But the rheumatologist dragged his feet, said he was doing research, which I understand because this is a rare occurrence, but had I waited any longer to go back on it, some of the damage could be irreversible. As it is, I don’t know. I’ve been recertified for Home Health visits for another 2 months. I’m so frustrated by the inactivity, though, and my house is unfinished! I have so much I want to do, and even with the oxygen I’m still so weak and limited. I don’t want other people having to do what I should be doing! Well, my Rose says it’s bedtime, she wants her nini treat and she wants it Right Now! Nini ladies, I’ll try to fill in the blanks for you if you want...",
      "MessageIndex": 4410,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 31, 2018 11:56PM - edited May 31, 2018 11:57PM by magdalene51 Good evening, ladies. It's taken a bit, but I think I managed to get caught up. My apologies for being absent. Mic, like everyone else I am horrified at the disrespect and abuse you've had from those two children. I just want to say that the mosti important thing you can do, and must do, right now, is to take care of yourself. If you recall, I was in remission last September, and after the stress of DH's death and cleaning up the mess he left, and making some hard decisions about the future, the very next scan showed the cancer exploding all over. It's true that stress is a killer, and you can't afford it. I agree that if there's any way you can temporarily displace yourself, it would be beneficial. And I don't think leaving the utilities off is a step too far, since they have not contributed to the costs. Food too. As for the reception venue, I would cancel that sucker and not tell them; let them find out the hard way. We all know that you love your daughter, but she is abusing you and you are enabling her in it. And it can destroy you, in a very real sense, putting an emotional stress on an already failing body. You must take care of yourself! Now I've lost track of what everyone else was saying. I got the biopsy report, it's negative, and the PET showed no cancer progression so I start back on abraxane tomorrow. I'm now on 24/7 oxygen, and though I feel much better & stronger, it's still hard to get around, and as soon as I take it off, I feel like I can't get a deep breath. And I don't even notice the cannula now, except when my Taxotere drippy nose acts up. One last thing, Mic. Buying this house, moving here, it's probably saved my life. It's become a sanctuary for me, an inner sanctum, a place of peace and healing of heart if not body. You cannot live for your daughter, and she doesn't want you to. Live for you, and your DH. You two deserve it.",
      "MessageIndex": 4508,
      "PostDate": "31/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Aug 2, 2018 01:49AM magdalene51 wrote: Dear Ladies! I keep trying to catch up, but apparently it’s not going to work for me. By the time i’ve read all the posts, I can’t see clearly enough to write anything. I have so much I want to tell you! But if I try to just write it all out, it would be pages and pages. So, let’s make a deal: ask me whatever you want to know, and I will try to answer as best I can. A bit of warning, though. To go along with the failing eyesight, I also have some kind of nerve damage where my fingers twitch and jerk, So sometimes what I’m writing doesn’t make a whole lot of sense. And I can’t see clearly enough to know that. I will say this, though, Hospice seems to be a good decision at this point in time. And it’s helpful to know I’m not locked into it; that I could drop out at any time without penalty. Let me see if I have a good picture to share with y’all.",
      "MessageIndex": 5341,
      "PostDate": "02/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jan 10, 2016 02:37AM magdalene51 wrote:  Me three. ",
      "MessageIndex": 74,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 11, 2018 05:14PM - edited Mar 11, 2018 05:15PM by magdalene51 Julie isn't the only one with vowel trouble, Mic!  ",
      "MessageIndex": 3239,
      "PostDate": "11/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jul 15, 2018 09:22PM magdalene51 wrote: Here’s the view from my bed.  You can see why I want to die here, whenever that may be. ",
      "MessageIndex": 5091,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 17, 2014 04:07PM magdalene51 wrote: This is my first post. I had biopsy on lump & lymph node 4/15, got the dx yesterday, both are cancerous. MRI scheduled for Monday morning, appointment with the surgeon on 5/6. Still numb, still in semi-denial, but I know I have an excellent medical team and that helps. Been spot-reading this thread...",
      "MessageIndex": 6538,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 24, 2014 12:55PM magdalene51 wrote: Oh Morwenna, I am so sorry to hear about your mom, but it was good you got to be there for her last breath.  My mom died at 12:30 in the morning, waking me up half a city away. I had left her only hours before, and she was expected to last another couple of days. The phone call came shortly after, and I drove over to the nursing home. When I arrived she had the most beatific smile on her face, and not a wrinkle anywhere. (She was 85.) I got a call yesterday morning from my son, telling me that his adoptive mother passed away in the night, from cancer. There is no way to describe the grief. I asked if I could do anything for him; he replied, \"Stay alive.\" So that's the plan. I placed him for adoption in 1970 at the age of 6 weeks; we have been reunited since 2005. I love him so much it hurts sometimes, and knowing he is hurting is just horrible.",
      "MessageIndex": 6565,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Nov 16, 2017 06:07PM magdalene51 wrote: One thing I wanted to mention is how awesome DH's company has been. It's an insurance company (also with financial groups) a few thousand people, and he managed (until recently) a web applications development team. He didn't like managing though, because seemed all meetings and reviews and paperwork and stress. He stepped down a month or so ago, a lateral move to software architect. He had been there 23 years. His boss and the new manager of his team were at the hospital every day, and every team member visited. Cards, fruit baskets (no flowers in ICU). Even his CFO was there a couple of times. The whole IT department was unstaffed during his memorial service. The day after he passed, before there was even a death certificate, his boss, manager, and an HR rep came to the house with the check for his life insurance. Today his boss and manager came by, handed me a few envelopes, sat at the kitchen table & chatted, offered real actual physical help for anything we needed, and picked up a few pieces of equipment that DH used when working from home. After they left, I lay down to take a nap, and opened the envelopes. 2 of them had cash donations from his colleagues, the third was a card signed by dozens of them, with expressions of sympathy, love, prayers, and assurance that I am still considered a member of their family. I was so blown away I just lay here weeping for their huge hearts. They will make sure my cousin and I never want for anything. (Don't know if I mentioned, my cousin is a very vigorous 80 and my caregiver.) Unbelievable.",
      "MessageIndex": 1208,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 19, 2018 09:37PM magdalene51 wrote: Oh Micmel, you are so right! I’ve not had break from Xeloda since I started it, and the only thing that has helped (and not much) has been the Adderall I convinced my PCP to prescribe. I haven’t taken it for the last 3 days (I always put up pills for a week and a day, and hate to do it when I’m out of anything which I have been) so I’ve just been taking my pain meds and muscle relaxers and I have morphine for breakthrough pain and I have been a zombie sleeping 16 hours a day and more. Buying a house alone is terrifying. Doing almost anything alone, without the person you’ve done everything with for 30 years, is terrifying. But I have to keep moving forward because the alternative is worse. Somehow. My son’s MIL is a dear friend, widowed 9 years ago, is engaged to be married in June. She’s going to bring him down next month to help with the moving. And another friend got married at Thanksgiving. My cousin just brought me word of the husband of one of my best friends - she passed away in 2012 - has a new lady in his life. I know I will not have that, and it makes me so sad. Yes, I’m happy for them, but crying inside. Can I have your pity party if you’re not going to use it?",
      "MessageIndex": 2781,
      "PostDate": "19/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 21, 2018 03:36AM magdalene51 wrote: I was 36 when I met DH, twice divorced, and he was 27, never married, and in the military. We married two months and a week later. We never had our own children (I have a 48 year old son) but after my sister’s husband died (of cancer), he became a surrogate to their 2 children. He was a brilliant programmer, naturally gifted, no college, completely self taught. But his first love was theater. For years we had a drama ministry at our church, producing a couple of shows every year, usually a comedy or melodrama, and he would direct and often take a part, and I would produce and stage manage, and often props, sets, and costuming as welll. We had great fun. My niece is now 26 and this May will graduate from college in NYC with a degree in theater arts. DH was her coach and mentor, her second dad, and she is so heartbroken. She called him Pa and she could always make him laugh. Oh, so could i, a fact which surprised us both, right up until nearly the end, when nothing could. When I get settled in the new house, I believe I’ll write a book. I’ll need the income! Y’all would buy a copy, right? I’m thinking of calling it “The Audacity of Mags”. Whaddya think?",
      "MessageIndex": 2803,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 21, 2018 12:01PM magdalene51 wrote: I never did go get fitted for prosthetics. Knitted knockers sent me a pair, and I discovered when I was clearing out my old bras (sent them to a local women’s shelter) that one of the old cheap Walmart bras had pockets, with the slit on the outside to slide the knockers in. So on the rare occasions I wear them, they work just fine. I didn’t want to have to part with some of my favorite blouses that have darts. And they’re closer to a C-D than the DDDs I carried around with me before. Whew! Those suckers must’ve weighted a good 10-12 pounds apiece! But I could probably count on my fingers how many times I’ve worn those foobs. Grannax, thank you for your encouraging words. I actually do have a muscle relaxer, Tizanidine, been on it for years, but I’ve mostly taken it in the evening for restless leg while sleeping. I’ve been tossing them down like breath mints lately though, just fighting these stupid muscle spasms. Sometimes moving sets them off but there are times they come spontaneously. Ouch! Speaking of cymbalta, I was on it for several years (prescribed in conjunction with Lyrica, and all for my fibromyalgia) and the doc would keep increasing the dosages of them trying to find some relief for my pain. Finally, about 5-6 years ago, when I had maxed out on both of them and still no relief from the pain, I decided it was a waste to continue and asked the doc to help me step down. She did, I did, and even going down as gradually as possible, it was the worst withdrawal ever. I fought the depression and suicidal thoughts constantly. It took forever (it seemed( to get back on an even keel. The Lyrica wasn’t as rough, but while I was on it I gained (literally) 100 lbs. After I stopped it I dropped about 50 in a short time. Kept it off quite a while, but something that I’m on now is causing it to creep back up. It could be the Xeloda, or maybe the chocolate ice cream. (Ya think?) Micmel, I believe I’ll hang around awhile. It actually wasn’t so much needing a break, it was that every waking moment was filled with financial panic. I think I mentioned before that DH had handled our finances for probably 20-25 years, and I was happy to let him. We both made fairly decent money, I had my own business, but he resisted planning for the inevitable - even after what his family went through after his folks died. For one thing, we used the income from my business as a kind of slush fund - vacations, houses, etc., and never put a dime of it aside for a retirement plan for me. And I begged for it. He was convinced that his would be sufficient (and it may be) but the stress of working everything out is wearing. And trying to figure everything out, back in November, took every one of my meager brain cells. Figuring out what bills we even had, tracking down how each one was paid (mostly online, but from the bank site or the payee’s site?) then slowly transferring the payee site payments to the bank site so I can track all in one place, from my phone. Still not completely done with that task. Then, setting up the trust that will take care of my cousin (provided she survives me, as she most certainly will (both her parents lived to 95+), getting started on SS and Medicare, supplements, more figuring, figuring, figuring out. I’d best close for now before I lose this post. More later.",
      "MessageIndex": 2812,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 8, 2018 08:40PM magdalene51 wrote: Progression. Such an ugly word for us, isn’t it? It’s actually upside down for us: progression is going backwards - it’s only the cancer that gets to progress. I have it too. Remission is over. There’s apparently been an explosion.",
      "MessageIndex": 3166,
      "PostDate": "08/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 9, 2018 04:50PM magdalene51 wrote: My Rose is a Schnoodle - schnauzer/poodle mix. She’s quite a character, and hasn’t slowed down much even at age 11 now. She needs grooming, I have a mobile groomer coming for her Tuesday morning. When she’s groomed you can see her heart - which belongs to Mommy (me). ",
      "MessageIndex": 3201,
      "PostDate": "09/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 10, 2018 06:08PM - edited Mar 10, 2018 06:09PM by magdalene51 I just wanted to pop in here with a brief comment on going dark after passing - not notifying BCO, in other words. I checked into alternate ways of informing, and it would not be necessary to give your login info to a family member. You can just have them send an email to the mods. The email address is found under contacting moderator or something. My thought was, there could be multiple sites we want to contact, for various reasons, and it might make sense to make a folder of \"send after death\" and write out the emails ourselves. No passwords needed, nothing disclosed. What say you all? Runor, my XDH1 and I had an Irish Wolfhound named Brenna (this was back in mid-70's) as well as AKC Old English Sheepdogs, we actually bred one of them and sold the puppies. The times of my life when I've been without a dog could be measured in months, maybe even weeks, not years. Other than the two I have now, aged 11 and 13-14 (rescued) our last 5 dogs have lived to at least 15. Two of them lived to 17. Runor, honey, GET THE DOG. ",
      "MessageIndex": 3230,
      "PostDate": "10/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 21, 2018 08:01PM magdalene51 wrote: Hey gals hi mic! I’ve just been up to my ass in alligators and will fill you in when the dust settles. So fa we are on target to close March 27, that’s Tuesday, and moving the next several days.packing continues apace, though I’ve nothing to do with it except thumbs up and thumbs down. Must rest now. ",
      "MessageIndex": 3418,
      "PostDate": "21/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 1, 2018 11:22PM magdalene51 wrote: Mic, my oral surgeon said that there is a coating they can use to protect teeth; what I don’t know is if it can protect them from systemic damage like chemo, bot certainly from rads damage. As for your mom and DSF, consider looking into Caring Transitions, the organization that helped me downsize and move. While my transition has not been without its snags, mostly due to my hospitalization in the middle of the important part, I still think it’s the best option I’ve seen. And none of you children would actually need to be involved at all. There are franchises all over, I’d be willing to bet there’s one near your mom - where is she? Anyway, worth a look for the hassle it would save you siblings. I’m planning to write up a post about the service and the process for others who may be going through similar challenges. DC met a couple of our neighbors today, next door is another widow, and across the street she saw an elderly gentleman trying to pull his trash cans in while on crutches. And he’s a widower (though with a lady friend). And this evening another neighbor dropped by with a bowl of fruit and a neighborhood directory. Being a small neighborhood behind a gate creates a new kind of community for me, almost like a small town. One new thing we’ve discovered is an app called Next Door, which is kind of like a mini Facebook for neighborhoods. It’s kind of fun, and it’s very very useful. Meet neighbors, find or recommend services, sell your things, find your pet, report a stalker, both in your own neighborhood and in the ones nearby (we have 56). You can download an iOS or Android app, or access it from a browser. I always think I’ll make a short post and then I write a book. It’s the Irish blood. ",
      "MessageIndex": 4041,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jul 15, 2018 08:35PM magdalene51 wrote: Well, I finally got caught up reading this thread… was that a eulogy? Honeys, I assure you, I did not come home to die! All of a sudden, the last couple days in the hospital, the hospitalist and the social worker started pressuring me to decide on a skilled nursing facility to go to before going home. There was only one that had been highly recommended personally, so I said I’d go there. Thought it was all settled until the next day the social worker stopped by to tell me that facility had declined to have me. She thought it had something to do with the cancer treatment and liability, which made no sense to me. My cousin actually talked to them and found that it’s an issue with continuum of care:they offer the full spectrum, and want patients who will commit to that, and since my plan is to die in my own bed, that wouldn’t happen. Of course, that little glitch only increased the pressure. That’s when I began to talk to the hospital’s hospice arm, and it seemed a perfect fit. As a member of thes forums for 4 years, I’ve seen so many women who have lived for literally years on hospice, some have gone on and off again, and very few who have gone on hospice and died within a short time. So I have perhaps a different approach and attitude toward the whole situation than most, certainly than the hospitalist who discharged me with a whole long list of meds (and supplements!) that I should just stop taking because they won’t contribute to my comfort (something he obviously knows little about, as without my large doses of magnesium my bowels become quite uncomfortable!) Also, these are supplements I have bought and paid for, and if hospice doesn’t want to cover them, it’s ok because they are not cost-prohibitive. So my cousin and I met with the hospice rep Thursday afternoon, and the ball was rolling. Equipment was delivered - right now I’m keeping me bed but I have a trapeze so I can move around a little easier and also get in shape for the pole dancing competitions this fall - just kidding! There may have been some misunderstanding or misinformation about what landed me in the hospital this time. I had something called a saddle pulmonary embolism, which happens when blood clots block both pulmonary arteries. I nearly died Tuesday morning as my blood pressure was dangerously low. Subsequent tests showed blood clots in my right leg, which had apparently been sloughing off and sticking in the pulmonary arteries until the proverbial straw broke the camel’s back late Monday morning. My cousin described me as white, cold, and drenched with sweat. It was touch and go for 24 hours, and when they wee out of options, there was only a “kill-or-cure” option. It’s called TPA, and the ICU doc was pretty sure a full dose would do me in, but he might be able to give me half a dose. I must have agreed, because it worked. I trusted this ICU doc, because last October, when my DH lay in the bed 3 rooms away, this doc was straight with me about the prognosis. He pulled no punches, didn’t sugar coat, told me the truth, and so I knew I could trust him. And he saved my life. Apparently God’s not through with me yet. So, no, I’m not home to die. I’m home to refocus. To turn my sights away from the battle and turn toward some housekeeping: taking care of people and things that have needed my attention. Trust me, when it’s my time, you’ll see the drama queen make a few curtain calls before riding off into the sunset (metaphor alert!). Mik, you are an awesome threadkeeper, just stay the course. You’ve pulled together a great group of gals and even when I don’t post, I read and keep up. Love you all. ",
      "MessageIndex": 5086,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 15, 2018 10:35AM magdalene51 wrote: Grannax, my dad was a Pearl Harbor Survivor. He died in 2009 at age 95. He was on the USS Vestal. If you think of it, toss a flower in for me. I have never had the opportunity to go, and doubt I ever will. My dad came from a dysfunctional home, and the war damaged him even more. My folks also divorce after 30 plus years of marriage, and my father nursed a hatred of my mother til the day he died, some 40 years later. It ate him up. There wasn’t a kind or happy bone in his body. Such a sad story. Here’s a pic of my folks at the end of the war, after my dad got transferred to Miami. He had a wartime commission so he was I think a lieutenant then. They had been married probably 8 or 9 years.  ",
      "MessageIndex": 3338,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 9, 2018 06:36AM magdalene51 wrote: Gold, indeed. Lovely ladies, I’ve not been jumping in, but been following daily and keeping Mic in my thoughts as you’ve been going through this difficult time, with the surgery and DD’s antics. I was in the hospital for 6 days due to a rare and nasty side effect of Gemzar, which my sweet sister from insomniacs, Loveroflife, turned up in her research (thus saving my life!). BCO is truly a lifesaver, literally for me. I’m now in my new home, and though much remains to be done, put away, hung on walls, and so forth, I feel at home as I never have. And my son, my wonderful miracle, is here to spend a whole week. Since I placed him for adoption as an infant, and we didn’t meet until he was 35, we’ve never had a week together, nor my birthday, which is Wednesday. I am as content as the cat who found the bucket of cream. But i am still here with you all, and Mic, I totally understand about a toxic adult daughter, as my sister is dealing with one now. The toxicity infects the whole family. She will outgrow it, or she won’t, but she will eventually come face to face with the consequences of her behavior. Our sins will always find us out. ",
      "MessageIndex": 3728,
      "PostDate": "09/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 17, 2018 06:44PM magdalene51 wrote: Hi Mic! Sorry to have neglected this wonderful thread! I do read it and stay caught up but when my energy is low I don’t always have enough to post in multiple places. Insomniacs is my home base here, and I am so thankful for them because it was a couple of my gals over there that saved my life - literally! - last month. After my second infusion of Gemzar, I began to have fevers. Ended up in hospital being cultured for every infection under the sun to no avail! It was one of my insomniacs that found a rare Gemzar side effect of vascuitis that presents as fever of unknown origin! A rheumy was consulted, prednisone administered, things turned around and I was on my way to normal, with some possible long-term ramifications. In the meantime, things moved ahead toward my house closing, and on my last day in the hospital, a mobile notary came to my room and walked me through signing all the closing documents. The movers moved the heavy furniture over that afternoon, and set up my bed, my cousin made the bed, and I was released later that afternoon and came home to my new house and went straight to bed! These two weeks have been a whirlwind of unpacking, (still sorting!), figuring things out, running back and forth to the old house, home health nurses, PTs, OTs, and last week my son was here all week from Florida! Mid-week I had my 67th birthday, my 4th BC dx anniversary, and Saturday night had a housewarming/birthday party! I don’t know how many were here but the place was packed! My favorite infusion nurse came, my PCP came, my mortgage lender came (and brought his wife, who said hes’ never been to a client’s event before!) and lots of friends I haven’t seen in ages, they got to meet my son, and even though the house is not finished by any means, it was comfortable and welcoming and a good time was had by all - especially me! This week, more sorting & unpacking, more home health, and Thursday is oncologist and beginning Abraxane infusions. Hopefully it will be kind. I love my new home. I am more “at home” here than I’ve ever been in my life, and it is reflecting me. Here’s a picture of me and my son in front of the fireplace Saturday night.  Sorry for the novel, but you asked! Waving at everyone (and Mic’s new boob!)",
      "MessageIndex": 3836,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 19, 2018 11:39PM magdalene51 wrote: By the way, MJH, did you say you live in Maine? I lived there in the 70’s. It is beautiful. What part are you in? ",
      "MessageIndex": 3887,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 20, 2018 11:01PM magdalene51 wrote: MJH, I was married to XDH1 at the time, we were actually newlyweds at the time, just after Labor Day 1973, and we found a rental in Camden, with a bay view, and we were there for a year. We bought a small farm, about 6 acres, with a house that had been built as a school house in 1869, then bought by a family, they had a chicken farm, and it stayed in that family until we bought it from the last surviving family member. It was in Warren, right at the top of the hill from the Oyster River. My XDH1 worked for a builder of wooden boats, the real, old fashioned built from scratch 30’-40’ sailboats. ",
      "MessageIndex": 3898,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 27, 2018 04:25PM - edited Apr 27, 2018 04:26PM by magdalene51 Hey ladies! Yes, apparently the residual effect of Gemzar's gift of vasculitis is angina! The episodes I had in the hospital were very different in that I had no chest pain, only left arm pain. Last Friday I had no arm pain but when it began I had no question in my mind that it was my heart. I'd been sitting quietly in a chair in my closet while my organizing genius Lori was helping me decide what to keep and what could go. It was not stressful. When the pain started, I went and lay down on the bed, took my bp, it was 176/84. Took a nitro. Bp dropped, repeated twice until bp was normal range (it's a protocol I was taught). Seemed to be recovering, pain had gone from 8/10 at peak to 2/10. About 20 minutes later it started to rise so I called 911 and they took me to ER. But really the second one never got anywhere and by the time we left I was pretty much normal. My EMS tech was an awesome lady and we had a good conversation on the way to ER. Once there, they started trying to get an IV despite my protestations (“I have a port!\" “I know it looks like a good vein but trust me, it will roll!\" And it did, twice.) Finally got someone who could access my port, go to blood drawn. Results showed no heart attack, but angina. So they sent me home. With 2 big new bruises to go with 4 still left from nearly a month ago. Mic, about those teeth… picture 1 is me in April 2015, one month after finishing rads. Finished chemo previous October. Picture 2 is April 2017, just befor surgery to remove them all. I have another picture I took right after one fell out in October of 2016 that shows most of the damage happened in the first 18 months following active treatment. I showed one of the teeth to my MO and he confirmed it's systemic damage.   I miss steak most of all. A nice, thick, marbled ribeye like my DH masterfully grilled to perfection. Or when he could find one, a boneless ribeye roast, which he also cooked on the grill. Oh my. ",
      "MessageIndex": 3994,
      "PostDate": "27/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 4, 2018 02:50AM magdalene51 wrote: (When I write long posts like that, my iPad slows down so I’m typing several words ahead. Annoying.) Crash! Scream! DS1 has gone down hard on both artificial knees and is literally screaming. I’ve never screamed like that but she may be a bit of a drama queen. DS2 comes in and explains that they were fighting and she threatened to leave (and walk 20 miles home?) and DS1 tried to stop her (but why?) and they fought over the door and DS1 went down. By now cousin is up, calls 911 and the fire department arrives but they can’t move her without her screaming. They may have given her morphine. The ambulance just now left, it’s 1:45 am, the garage sale starts at 8, I’m stuck in bed because I can’t breathe, cousin has gone back to bed. I have no idea where DS2 is. What the actual heck?",
      "MessageIndex": 4069,
      "PostDate": "04/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 27, 2018 08:14AM magdalene51 wrote: Oh Minnie! Your concern about your DH’s drinking hit close to home! My husband apparently began drinking in secret not long after my dx, and hid it very successfully from me, because i trusted him. When he had his first episode of liver disease, he swore it was from the acetaminophen he’d been taking for sinus headaches - and that may well have been a contributing factor, but the wine didn’t help. Some 15 years earlier, he had watched his beloved mother die of throat cancer. So when I was dxed, all he could think was he would have to watch me die too. I think he was determined to go first, and he did. If I could go back and live those days over, one thing I would do is talk more, spend more time with him just talking it over. I think he never really adequately grieved the loss of his mom, and so was unprepared to lose me. I long ago accepted that this beast would kill me, so I was probably unnecessarily blasé about dying. I’m sure that didn’t help matters. Just don’t let it slide, Minnie. My husband died of cirrhosis and multiple organ failure, but mostly of a broken heart. Talk to him, love on him, take his pain seriously. If he’s drinking, he’s trying to numb the pain. Help him find a better way. Be a better wife than I was. And keep in touch. Much love.",
      "MessageIndex": 4414,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Jul 15, 2018 10:06PM magdalene51 wrote: Here’s a close up of the quilt that’s hanging on the wall on the left.  ",
      "MessageIndex": 5093,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Nov 15, 2017 12:06AM - edited Nov 15, 2017 12:08AM by magdalene51 Thre months to the day after our 30th anniversary, my husband died of cirrhosis after 10 days in ICU. He had been drinking secretly, apparently since my initial dx, hiding it so well that I only suspected but wasn't sure - until he was in the emergency room with a blood alcohol content of .46. I am devastated. We MBC think we will go first, and here I am left behind. Not only that, but he made no preparations, and left our finances in chaos. He said he couldn't bear to watch me die - so he made me watch him. And it was not a pretty sight. I loved him so much and he's just gone",
      "MessageIndex": 1185,
      "PostDate": "15/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Feb 21, 2018 06:42PM magdalene51 wrote: Seller countered with “split the difference?” And I agreed. Signed docs online and we are off. My ribs have been in extreme pain, I have hot water bottles front and back. Told my son I was going to dip into his inheritance, he’s ok with that. Going to shut my eyes for a bit and see what appears. Other than that, woohoo.",
      "MessageIndex": 2822,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Mar 5, 2018 06:54PM magdalene51 wrote: Mic, everything is moving forward with the house, as incredible as it seems (to me anyway). Closing is 3 weeks from tomorrow (Tuesday). There are a few minor repairs that need to be done, but amazingly the financing has fallen into place. Due to DH’s mental state, our finances were such a mess, he would think he had paid a bill when he hadn’t and trying to look as normal as possible right up until the end. So sad. But our credit rating had suffered, and since I had no income other than SS, the outlook was bleak. But my realtor found a lender with a big heart (and cancer!) and he’s moved mountains for me. So I’m starting to get a little excited; I didn’t let myself before because there were too many obstacles. But, here we are!",
      "MessageIndex": 3075,
      "PostDate": "05/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 25, 2014 11:39AM magdalene51 wrote: Had my BMX last Monday, so this is my 7th day. Getting used to looking down and seeing nothing. But it's all good. My son got to come for a couple of days visit beforehand, it was so good to see him and he gave me such a long tight hug before he left, it was as if he wanted to give me all his health and energy in that hug.  DH took me shopping for a recliner to recuperate in and we ended up replacing all the den furniture (it was in pretty rough shape) with a pit group that has two electric recliners on one end and a chaise on the other. It has been the best choice, for this room and for all of us. He has slept out here with me all but one night. Last night we celebrated the 27th anniversary of the day we met, DH grilled us a ribeye, my cousin (who lives with us) fixed corn on the cob and potato salad. Then we settled in the pit group and watched Despicable Me 2. Good times.  I know I haven't posted for a while, but I added this thread to my favorites and visit daily. A reminder that life goes on, the joys, sorrows, trials, travels, challenges. And lurking somewhere in each life, this enemy we fight, and we all add our voices to drown it out. The nature of the support we all give each other, and for which I am thankful.",
      "MessageIndex": 6697,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 27, 2018 09:06PM magdalene51 wrote: Mominator, my mother had pre-planned and pre-paid everything except the obituary and the honoraria for the participants in the service. So we were very fortunate there. Last fall however, I was not so fortunate, as my DH died completely unprepared. I didn’t even have passwords to pay bills. Had to figure out everything for myself, make all the funeral arrangements, plan everything, all while continuing treatment. What a mess! I think the worst of it for me was the anger at the unnecessary complications, which greatly interfered with my ability to properly grieve the loss of my life partner of 30 years. More than 6 months later, I’m still dealing with some of the mess! We had no children together; my son is 48 now and very settled, so there was not that complication, but while I was actually in remission while all that was going on, my first scan afterward showed an explosion of mets in the lungs and bones, and as I’ve subsequently been dealing with this inflammation issue and not breathing well, I’ve also supervised moving to a new home (my first solo purchase), liquidating 30 years of accumulation, an estate sale, and now selling the old house - I get tired just thinking about what all is left. One of the first things I did last fall however was meet with an estate attorney and set up a trust to take care of my cousin (who is also my housemate and caregiver), as DH and I committed to when she first came to take care of me years ago. Ironically, she is 81, 14 years my senior, but she is still in good health and has a caregiver’s heart - a trait she obviously shares with you. Prior to the estate sale, I invited local family and close friends to help themselves to whatever they wanted, and gave a lot of stuff away. I still have way too much, but since I don’t know how long I have, or whether I will regain enough health to enjoy life again, I don’t want to be precipitous.",
      "MessageIndex": 188,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 27, 2018 09:18PM magdalene51 wrote: I had to close that post; when my keyboard can’t keep up with my typing, I know I’m in danger of losing the whole thing! I just wanted to add that I still have a lot left to do around here, and while my cousin is a huge help, I can’t ask her to do some of the things that need to be done. I have a wonderful support system, friends and family, church and work, and so many come to help out and spend time with me. Especially after the angina attack, which happened when my cousin was not at home, she’s been reluctant to leave me alone for very long, so I get to have “babysitters” which are always lots of fun. I also get home health nurse visits. And I spend a lot of time - way too much time! - on my iPad with BCO and FaceBook. And I have 2 dogs and a cat for amusement. Thankfully my cousin does the heavy lifting - I say she’s my majordomo, concierge, chief cook and bottle washer, and personal shopper all rolled into one. I’m thankful she will never have to worry about her living situation as the trust will care for her. Thank you for all the great suggestions and reminders. I nowhere near have it all wrapped up! But I’m doing as much as I can.",
      "MessageIndex": 189,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 27, 2018 06:39PM magdalene51 wrote: Mominator, we haven’t formally met, but I have seen your posts in so many threads, always encouraging, lifting up, teaching, and I have admired your wisdom. I’ve never posted on this thread, but had it bookmarked and today went back and read the whole thread from the beginning. So much good information, so many beautiful women who have posted are already gone. I’ve become so much more aware the past few months that although the cancer itself may not be progressing, so much damage has been done, not only to my lungs with the mets but to my heart with whatever else is going on - possibly a rare side effect of gemzar, vasculitis. In any case, I’m on a relatively high dose of prednisone until the source of the inflammation is tracked down and a real tx plan can be devised. In any case, an angina attack a few weeks ago reminded me that I may not have a lot of warning or time to prepare, or the typical end stage scenario. And now I’m too sick and weak to do any physical preparation. But I suppose, in the end, none of us will know, until we do.",
      "MessageIndex": 185,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "Apr 22, 2014 12:26PM magdalene51 wrote: Thank you for all the lovely thoughts. I had the MRI yesterday and it was a nightmare. Because I am on narcotics (for arthritis and degenerative disc disease) they would only give me 5mg Valium for claustrophobia. I can't raise my arm over my head because my shoulder is so bad, so I tried it down to the side. They slid me in and I panicked. Get me out! They pulled me out. I can't handle being restrained and having my arm down where I couldn't move it just set me off. They sat me in a chair and brought me another half a Valium. I sat there looking at that dadratted machine, tears streaming down my face, while it took effect, and I figured I could do it if my arm was free and I turned my head to the side instead of looking down. So we forced my arm up and for the next 20 minutes I just lay there trying to get through it while my shoulder was screaming at me. The most excruciating and humiliating experience of my life. They called yesterday afternoon to tell me there were no other tumors in either breast but there are more lymph nodes than just the sentinel.",
      "MessageIndex": 6553,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "magdalene51…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199261/profile",
      "Content": "May 25, 2014 11:33PM magdalene51 wrote: Oh, Morwenna, tea looks scrumptious! I am a fool for all things pastry. Having a very tender mouth right now – thrush maybe?",
      "MessageIndex": 6699,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    }
  ]
}