{
  "AuthorID": "Maggie2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
  "Posts": [
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Jun 9, 2018 08:05AM Maggie2 wrote: Proud Patriot, I’m jumping in from the April chemo group. After my first T/C, my blood pressure dropped very low, about 85/55. I had such severe bone pain, headaches, and heartburn/nausea that I became way too dehydrated. The doc also hadn’t told me to cut back on my routine blood pressure meds. Once I started getting more fluids, , along with adjusting the BP meds, the blood pressure stabilized. Hope you’re doing much better",
      "MessageIndex": 230,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 4, 2018 09:16PM Maggie2 wrote: Ingerp, beautiful picture and congrats on ringing that bell! We are both on the April Chemo thread so I’m aware of your struggles with hair growth. I think you look great and should go “topless”, to quote one of our April buddies, if you desire",
      "MessageIndex": 26422,
      "PostDate": "04/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Apr 28, 2018 01:35AM Maggie2 wrote: Thank you for all the great tips.  I had my first TC yesterday and it went well.  I feel quite drugged today and have zero appetite, though. We'll see how the days continue. Not knowing what to expect, I did take a Zofran this morning to ward off any possible nausea. My chemo nurse said she prefers to put the Neulasta on the stomach, as it seems to stay more securely, unless one is a stomach sleeper. Ga Warrior, bon voyage and hope it's a wonderful trip!",
      "MessageIndex": 179,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Apr 25, 2018 11:31PM Maggie2 wrote: Thank you all for the warm welcome! I've been taking notes about remedies for constipation, as I tend to have issues with that even without chemo.",
      "MessageIndex": 157,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Jul 23, 2018 09:59PM Maggie2 wrote: InnaB, I also bought the cryo gel mittens and socks for icing.  I saw both my BS and dermatologist this past week and they both were very pleased with the fact that I had no neuropathy nor discoloration or loss of nails.  I sucked on ice chips and also experienced no mouth sores, but I was extremely diligent about rinsing with baking soda/salt for the first week or two post each infusion day. GAWarrior, I will second what DebAL said about direct-to-implant vs expanders.  Originally, I wanted direct to implants after my bilateral mastectomy.  During my surgery, the PS felt the skin integrity would be compromised with implants so he put in pre-pectoral expanders.  At one of my follow-up appts, he said that the final outcome generally is more successful with expanders first, which lets the chest heal from the mastectomy, and then exchange for implants.  My exchange is next month.  I am almost one month post final chemo and onc, PS, and BS like to wait at least 6 weeks before any surgery.",
      "MessageIndex": 957,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Aug 7, 2018 10:06PM Maggie2 wrote: Djt and GAWarrior, thank you for your good wishes for my upcoming exchange surgery next Wednesday. I’ll be getting my port removed, too. I’m sorry that several of you have had such problems with your ports. As so many of you are in the home stretch for chemo, I hope you have no more SE’s  ",
      "MessageIndex": 1069,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 20, 2018 10:09PM Maggie2 wrote: DebAL, I laughed at your description of Bedhead Hair. That is a perfect description of mine, too. I’m also having my first real hair appt next week. I’ll get all this new gray colored and my original remaining, scraggly hair trimmed short. GAWarrior, Urdrago, Life, Duffy, I hope you all getsome relief and can enjoy the upcoming weekend.",
      "MessageIndex": 1445,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 21, 2018 06:38PM Maggie2 wrote: Engine, that is such good advice for everyone hearing the diagnosis of cancer. One day at a time is the only way I’ve made it through these many months. Hair...Full Disclosure. I did Penguin Cold Capping so I have a “head” start on keeping a few scraggly strands and seeing new growth already. Unfortunately, I didn’t have the success with hair retention that so many cappers have",
      "MessageIndex": 1455,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Jul 7, 2018 08:04AM Maggie2 wrote: GAWarrior, my BMX was back in January. I had wanted to go direct to implants, but after the breast surgeon had finished her part, the PS felt the integrity of the skin would be compromised by direct to implants. He put in tissue expanders prepectoral (over the chest muscle). I’ve had several fills these past months. I finished chemo last week and am now scheduled for the exchange surgery to remove the expanders and chemo port, and put in the implants on August 15. Finally!! My PS did say that even implants for reconstruction reasons may need to be replaced in 15-20 years. There is a discussion group called “Exchange City”, I think that’s the name. Many of the ladies there have completed the implant exchange. Feel free to ask me about my experience so far.",
      "MessageIndex": 801,
      "PostDate": "07/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 19, 2018 08:56AM Maggie2 wrote: Engine, thanks for the link. The triple negative site has information about the clinical trial for anyone interested. My onc had said there’s lots of research into triple negative now. GAWarrior, best wishes for surgery tomorrow.",
      "MessageIndex": 1638,
      "PostDate": "19/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 27, 2018 03:35AM Maggie2 wrote:  Life, I don't take any hormone inhibitors.  At the initial biopsies, the DCIS was diagnosed as barely weak ER+.  The mastectomy pathology also showed an IDC component that was Triple Negative.  MO and BS felt there was no reason to take inhibitors after chemo. An acquaintance was prescribed anastrozole.  The side effects were so bad the doctor switched her to Tamoxifen, which she seems to tolerate, though she didn't have radiation to wear her down. Like you said, maybe give it some time as you aren't even a week out from completing your rads. Ingerp, your chili sounds perfect, given our damp, dreary weather.  At least snow is now off the forecast for this weekend. At both the port placement site and the implant incision, I still had stitches that hadn't dissolved at 5 weeks.  I guess some of us must like to hold onto our sutures! It has been helpful reading how some of you are feeling emotionally.  With all my treatments and the reconstruction surgery over, I'm now having very similar emotions.  One of the MO's had said that many patients will feel as if they've been abandoned and \"what now\"?  With every minor ache or headache, my thoughts immediately jump to \"has the cancer spread\". As Frog said though, the feelings pass quickly.  ",
      "MessageIndex": 1679,
      "PostDate": "27/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Dec 2, 2018 10:06PM Maggie2 wrote: Ingerp, I wasn’t on Taxol, but Taxatere. I’m in round two of losing lashes and thinning of brows. I had been warned that at about 4 months PFC, lashes start falling out again. That’s exactly when mine started falling out. I don’t think I’ll lose them completely this time and I already have lots of new growth too. I’m taking biotin daily so maybe that’s helping with all hair growth",
      "MessageIndex": 1832,
      "PostDate": "02/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Aug 17, 2018 04:17PM Maggie2 wrote: GAWarrior, thank you for the good wishes for my exchange surgery.  Today is my second day home.  I agree with DebAL.  The donor sites for the fat grafting are much more painful, swollen, and bruised than the actual incisions for the implant exchange. This surgery and recovery, so far, are so much easier than the BMX.  The good news is that I didn't have to come home with drains, as so many ladies do. It feels good to have the chemo port out too, though I am so glad that I had the port for all the blood draws and chemo infusions.  The pre-op surgical nurse couldn't get the IV placed and had to call in two more nurses to find a good vein.  As so many of you are winding down with your chemo treatments, I hope you all will have an easy time of the remaining chemo and start to feel like your getting back to \"normal\" again. ",
      "MessageIndex": 1167,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Jan 30, 2019 08:54PM Maggie2 wrote: Ingerp, I’d like to say that this stuff isn’t still on my mind every waking moment. The truth is that with all the holiday travel and guests, along with issues with my mom, who is almost 90, keeping up with BCO had to be put on the back burner for a bit. Catching up,especially reading the good news,was comforting today",
      "MessageIndex": 2092,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Feb 4, 2019 05:33PM Maggie2 wrote: InnaB, yes I lost all my lashes and brows a second time. It wasn’t as dramatic as the first time, though, because I didn’t lose them all at once. At about 4 months PFC, both started to thin and continued to fall out. Both lashes and brows have fully grown back in again, but they are definitely much thinner than they were. I had read that many women experience a second shedding. Ingerp, after you having to fight to get your Xeloda covered by insurance, I’m sorry for you to read that you now are being taken off it. I hope your next step is determined very quickly.",
      "MessageIndex": 2118,
      "PostDate": "04/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 17, 2018 10:37PM Maggie2 wrote: DebAL, glad to hear your appt went well. Does this mean that you don’t have to get another round of fat grafting in December? To all of you still experiencing the neuropathy, nail issues, pain, hives, and now even getting a cold, I wish you some relief. I’m ready to join up with your Bearded Lady Group. I guess the biotin I’ve been taking is just doing it’s job!",
      "MessageIndex": 1417,
      "PostDate": "17/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 2, 2018 05:37PM Maggie2 wrote: Djt, you really have a great head of hair! InnaB, I had to search “Uzbek plov”, which sounds really tasty. Now I had to search “quiff”. You’re keeping me busy on google DebAL, have a great vacation at the beach!! Engine, we lived in San Clemente for years. We used to enjoy Dukes and George’s on the Cove when we’d be in La Jolla",
      "MessageIndex": 1517,
      "PostDate": "02/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 8, 2018 03:05PM Maggie2 wrote: Urdrago, it's good to hear that you're \"laying around\". For these first few days, that's probably best. My PS removed my port at the implant exchange surgery. I was as excited at getting the port removed as having the expanders removed.  Wishing you good news on your path report!",
      "MessageIndex": 1570,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 8, 2018 03:13PM Maggie2 wrote: Robyn, I see that you've posted your question on the TCHP site.  Hopefully, those ladies can answer your question with more details for that chemo regimen, or maybe if any of our April group had that mix, they could help you.  I had 4 rounds of Taxotere-Cytoxan so I don't know how helpful I'd be. As I've learned from these groups, the side effects vary so much.",
      "MessageIndex": 1571,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 12, 2018 09:58PM Maggie2 wrote: Ingerp, such a beautiful picture! I can relate to the crazy weather. Indiana went from record breaking heat earlier this week to wind chill of 36 and “ice pellets” today. Having always had long hair prior to chemo, it was a surprise going out in this weather. Oh to be living back in Southern CA enjoying Duke’s Hula Pie with Engine and Janice. Urdrago, congrats on the clean margins. I was so anxious to get the drains out after the mastectomy. You’ll feel so much better once it’s removed. Hope all of this April group has a relaxing and restful weekend",
      "MessageIndex": 1601,
      "PostDate": "12/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 14, 2018 05:40PM Maggie2 wrote: Engine, thanks for the invite!  My daughter and her husband live in the LA area so at least I still have a good reason to get back for visits to warm, sunny SoCal. We were relocated to the Indianapolis area just a few months before my annual mammo showed breast cancer. As part of all the scans for the BC diagnosis, a very small kidney tumor was discovered, too. We've only lived here about 1-1/2 years and most of this time has been spent with doctors, or so it seems.  At this point, I think probably you and Duffyzmom know more about Indiana than I do :). My brother lives in the Chicago area and we have yet to drive up to visit him, but everybody says it's about a 4-5 hour drive. The cost of living here is certainly attractive, especially the housing costs! We will be glad to offer any assistance with info, opinions, etc. ",
      "MessageIndex": 1608,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 25, 2018 11:43AM Maggie2 wrote: Engine, thanks for the update on Janice.  I can understand you two taking the \"wait and see\" approach, especially since the surgeon is optimistic the incision will heal. It's just one more annoyance in this long road, though. Glad to hear her lashes are starting a comeback. Once they start growing, they seem to come in quite quickly. ",
      "MessageIndex": 1666,
      "PostDate": "25/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Nov 9, 2018 08:18AM Maggie2 wrote: Engine, I had heard that the bar was a favorite of Pepperdine students. All those families impacted. What another unfathomable tragedy",
      "MessageIndex": 1722,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Apr 25, 2018 11:55PM Maggie2 wrote: ElizB, good question and one that I also wondered about.  I'll have one hour of Taxatere, then 35 minutes of Cytoxan.  Do I ice during both drugs?",
      "MessageIndex": 159,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Apr 26, 2018 01:43AM Maggie2 wrote: leli and Djit, thank you.  I'll have to try the Activia, as I assume I'll have the problem.  What's interesting is that most of you that have had TC have experienced constipation, yet the SE printout that MO gave to me only mentions diarrhea.  This is one of the many reason why these discussion groups are so invaluable!",
      "MessageIndex": 163,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 3, 2018 09:00PM Maggie2 wrote: ElizB, thank you for the suggestions that I should discuss with my MO. My insurance case manager nurse called me yesterday and both of you had very similar ideas. The good news is that I’m feeling so much better today, still weak and fatigued, but better. Has your tinnitus cleared up? leli, my chemo nurse put the neulasta on my stomach. She said if it’s on the arm, it falls off easier. I didn’t receive Benadryl in the premed IV. I asked and she said they give it for the AC-T regimen. With me having such a tough time with SEs after chemo #1, it will be interesting how they change the premeds and/if they slow down the infusion rate",
      "MessageIndex": 249,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 10, 2018 10:36AM Maggie2 wrote: Duffyzmom. what a beautiful picture!  Your experiment with red really looks good on you.   ",
      "MessageIndex": 306,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 17, 2018 12:28AM Maggie2 wrote: Djt, that must have been unsettling, to have a nurse tell you, \"Don't Look!\" .  Glad the infusion eventually went ok. Duffyzmom, I have my second TC tomorrow and definitely have to talk with them about getting some RX to help with the headaches and bone pain..  The OTC advil didn't help at all after my first treatment. Last time, the onc nurse said to start with Zofran and then use Compazine for breakthough nausea.  I read that one of the SE for Zofran is headaches.  So you use both for nausea?",
      "MessageIndex": 356,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 17, 2018 06:25AM Maggie2 wrote: All, Thank you for your suggestions for my TC#2 tomorrow.  To answer some of your questions, yes I take dexamethasone today, tomorrow, and Friday, along with Claritin.  I get the Neulasta self-injecting dispenser stuck on my abdomen, as the onco nurse says it stays on better if it's not on the arm.  I also have a powerport below my collarbone, as I have the \"rolling veins\", as the nurses call them. As I am also doing Penguin Cold Caps and icing my hands and feet. Having the port did make the first treatment much easier since I had more mobility in my arm. I recall there was a discussion a few days back about some of you being Triple Negative.  I am also Triple Negative, but I started out with DCIS, very weakly ER+ from the initial biopsies.  After the BMX, the full path report came back with IDC Stage 1A Triple Negative.  I consulted with 4 MOs and they said everything from NO chemo to AC-T.  Two told me that with the small size IDC tumor (4.5mm), they would only recommend 4 Taxotere/Cytoxan.  Majority ruled and that's what I decided on.  The Triple Negative group is very helpful and are quite knowledgeable about the current clinical trials and treatments. Thanks again for all your suggestions.  I will discuss all this with the MO tomorrow.  ",
      "MessageIndex": 366,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 17, 2018 07:11AM Maggie2 wrote: Djt, For my first chemo on Thursday, April 26, they had me take Claritin the day before, day of, and for 7 days after.  With so much pollen here, I've just stayed on Claritin these past three weeks.  I'm hoping that being on Claritin this long will give me better results, as my bone pain was very intense.  I also had a few Percocet left over from the BMX back in January so I was alternating those with OTC advil for the first couple days.  By that following Monday, the bone pain was manageable and I also had some small relief from the headaches. I didn't really start to feel \"good\" until Day 8. I am going to talk with MO tomorrow about managing the bone pain and headaches with better results. ",
      "MessageIndex": 368,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Jun 4, 2018 12:27AM Maggie2 wrote: I was going to respond to Lynne603 about her nosebleeds and looking for something other than vaseline, but I see she deleted her post.  Maybe though, this will be of help to some of you others. Several years ago, my ENT suggested Ayre Saline Nasal gel and a saline nasal spray (I use Ocean brand, but there are multiple brands on the store shelf) to help with nosebleeds.  My primary care doc had told me to use an allergy nasal spray daily to get through allergy season, but that daily use caused the nasal passage to get way too dry with subsequent heavy nosebleeds. The ENT said to discontinue the allergy spray and stick with the saline. I'll be having #3 of four T/C on Thursday.  I've been using the saline nasal spray twice daily since chemo began.",
      "MessageIndex": 534,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Aug 19, 2018 08:25PM Maggie2 wrote: Djt, Happy Birthday! It’s great that you could enjoy your bike today. And yes, my PS did prescribe norco, if needed, for the exchange surgery",
      "MessageIndex": 1186,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 9, 2018 04:01PM Maggie2 wrote: DebAl, Life, and All the rest of this group, thank you for your continued support.  The PS is pleased with how I'm recovering from the exchange/fat grafting surgery.  As he told me the other day, \"it takes time\" both for the donor fat sites to heal and the implants to settle in. InnaB and Life, great pics.  Little kids and puppies are always cute and sure to bring a smile! I'm 10 weeks PFC now and I do have brows and lashes growing back very well. Head hair is another story.  I used Penguin cold caps and didn't see the success that so many others had.  I've probably lost about 70% of my hair.  I have new regrowth that's about 3\" now, but it is completely white. So I have all this white at the front and sides and then the bits of my old brown on the back. I haven't decided if I feel more awkward with the wig or with my two-toned hair.  I agree with you, Ingerp and Life, I am so over the baseball caps.  I know so many of you are now in rads, just had surgery, or are planning your surgeries.  I wish you all the best as your course of treatment continues.  And a Happy New Year to all that celebrate this holiday.",
      "MessageIndex": 1335,
      "PostDate": "09/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 13, 2018 09:02AM Maggie2 wrote: InnaB, PFC is Post Final Chemo. Months ago, I found a list of the acronyms and their definitions somewhere on this site. I’ll try to find it again. Urdrago, I just saw the Happy Birthday greetings you posted. Wow! That’s better than a cup of morning coffee😅",
      "MessageIndex": 1380,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 13, 2018 01:09PM Maggie2 wrote: Engine, I can empathize with your concerns regarding medical coverage.  The company my husband worked for was bought out this summer and for awhile, we didn't know if he'd still have a job, if medical benefits would kick in immediately, or what our situation would be.  Luckily, it all worked out ok for us. Come November, with the benefit signups, we will see what this new company offers.  I wish the best case for you and your wife.. Deb, I've been wearing a bra constantly since Jan 31. I'm 4 weeks post exchange now. At my appt with the PS last week, he said I still needed compression and to continue wearing a supportive sports bra. The compression is more for the fat grafting sites, not the implants.  He won't do any further grafting or revisions, if necessary, for another 6-12 months.  For me, the implants are so much more comfortable than the expanders, though I'm not sure about the final outcome, appearance-wise.  He said it takes time for everything to settle in and heal. I wasn't prepared for how long this recovery is taking, though.  So many of the women on the Implant Exchange discussion group talk about it being so easy. Maybe they didn't have fat grafting? Let us know how your PS appt goes.   ",
      "MessageIndex": 1386,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 4, 2018 09:56PM Maggie2 wrote: Ingerp, congrats! Now you can enjoy your Friday day-drinking and shopping. Your reference to Uncle Fester (on the Hair thread) was priceless. I can always count on this April group for some humor Urdrago, best wishes for the surgery and an easy recovery.",
      "MessageIndex": 1543,
      "PostDate": "04/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 8, 2018 10:12PM Maggie2 wrote: DebAL, the waves are already looking quite rough. As Urdrago said, stay safe.",
      "MessageIndex": 1574,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 14, 2018 05:22PM Maggie2 wrote: DG1986, you have really had a rough time.  I'm sorry that I can't offer any help. I had Taxatere and Cytoxin chemo regimen so I have no experience with your situation.  I would suggest that you speak further with your cancer doc to get more details.",
      "MessageIndex": 1607,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 17, 2018 02:20AM Maggie2 wrote: GAWarrior, I also had a BMX. We didn't know the left side, along with the diagnosed DCIS had a very small triple negative component until the surgical pathology report.  So it probably was good that I had already planned on the right side prophylactic.  You'll stay in the hospital overnight?  I hope your chiropractor can get your back feeling better by Friday, though the pain meds for the BMX would probably help with your back too :)",
      "MessageIndex": 1624,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Nov 9, 2018 08:23AM Maggie2 wrote: GAWarrior, I empathize about wanting to sleep on your side. It was just starting to get comfortable for side sleeping with expanders and then I had the implant exchange surgery. It’s only been the last couple weeks that I’ve been able to try side sleeping again. It takes time to adapt or adjust to the foreign feeling of expanders",
      "MessageIndex": 1723,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Dec 3, 2018 10:23PM Maggie2 wrote: Ingerp, Yes, when my lashes and brows grew in PFC, they were thicker than prior to chemo. My lashes were also just as long as they had been, maybe even longer. Now that both are falling out, I suspect that it will be back to how they were prior to chemo. I thought that maybe I had avoided the second round of losing lashes, but no such luck. GAWarrior, maybe you’ll have better luck! GAWarrior, I’m sorry to hear you’re having Mohs surgery. It’s just one more thing to add stress. I wish you a quick surgery and that the doc only needs to take just one layer",
      "MessageIndex": 1837,
      "PostDate": "03/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Feb 1, 2019 09:10PM Maggie2 wrote: Thank you all for the warm “welcome back”. Ingerp, hope you got that IV on the first try. I’ve never been squeamish before about needles. With all this poking and prodding the past year though, the last few times having a blood draw or IV, I have to look away. GAWarrior, my mom and sister live in Loganville and I have a niece in Alpharetta. I was just down there 2 weeks ago",
      "MessageIndex": 2099,
      "PostDate": "01/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Feb 2, 2019 08:57AM Maggie2 wrote: GAWarrior, you’ve really been put the wringer. My mom just had Mohs, but only needed one layer done. I hope you feel better soon and that the scar fades completely for you",
      "MessageIndex": 2103,
      "PostDate": "02/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 1, 2018 08:46PM Maggie2 wrote: Djt especially, I can relate to you ready for an ambulance. Thursday was my first chemo. I just wasn’t prepared for how hard it would hit me. The doctors kept saying “some” bone pain, “some” nausea, etc. This is the first that I’ve felt human enough to try to catch up with all of you. My blood pressure dropped very low (86/56). MO had me call the primary care doctor since she’s the one that prescribes those RX. I was told to continue to monitor it and it’s fine as long as it’s 90/60 or above. Luckily, now that I’m up to hydrating, it’s been generally fine. I think the excruating nonstop headaches were one of the worst parts. Anyway, have any of your MO reduced the dosage at the next infusion or slowed down the rate of infusion? Also, do SEs usually get worse with each treatment?",
      "MessageIndex": 216,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 18, 2018 10:35PM Maggie2 wrote: Ingerp, you asked about eyelashes. My last remaining lash fell out August 2. They have been growing in pretty quickly. I think they are now just about as thick as before, but not quiteas long yet. I definitely have enough length to use my regular mascara again. Eyebrows are pretty much back to before chemo too.",
      "MessageIndex": 1423,
      "PostDate": "18/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 27, 2018 12:25PM Maggie2 wrote: All of you are beautiful, strong women. Once the hair starts growing, it seems to come in pretty fast, whether its head, lashes, eyebrows, or even facial fuzz.  Hope you all have a stressfree, SE's free weekend. ",
      "MessageIndex": 1485,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 14, 2018 06:29PM Maggie2 wrote: Engine, it is always good to start thinking about such a major event in advance.  We know we could never retire back to Southern CA; it's way too expensive.  We definitely prefer a warmer climate than here. Retirement is way down the road for us, even though it's nice to think about!",
      "MessageIndex": 1610,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 17, 2018 12:18PM Maggie2 wrote: DebAL, welcome back! It sounds as if the tri was the best medicine if it even helped your hair grow.",
      "MessageIndex": 1628,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 25, 2018 03:50PM Maggie2 wrote: Not only did I do cold capping, but I also iced my hands and feet and sucked on ice chips during the infusions.  My onc nurse always had some humorous comments about how I was so iced down. It must have worked, though with only limited success with the cold capping, because I have had no neuropathy issues. I am so sorry to read how some of you have really suffered with it these past months. Poor Janice just can't get a break during this whole ordeal.",
      "MessageIndex": 1668,
      "PostDate": "25/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Nov 6, 2018 02:58AM Maggie2 wrote: DebAL and GAW, how exciting that you get to meet in person!! My mom, sister, and her family all live in the Atlanta region. I've waited in those Hartsfield Airport security lines too many times LOL. Piksie, I had taxatere, not taxol so my experience would be somewhat different.  I did icing for both hands and feet during treatments.  My BS was very pleased that I had no neuropathy issues.  She said she likes to collect the anecdotal evidence of icing's success, as there aren't results from formal studies yet. I would certainly suggest icing. DebAL, thanks.  I'm still wearing a bra 24/7 and it still feels foreign, though better than having the expanders. Good luck with your decision on fat grafting #2.  I still have several months until my PS will talk about any revision surgery, if necessary or desired. ",
      "MessageIndex": 1704,
      "PostDate": "06/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Dec 11, 2018 11:40AM Maggie2 wrote: GAWarrior, I am adding my prayers to all the others for a speedy, very smooth recovery for your son.  I can't even imagine the shock of getting that phone call at 3 am. ",
      "MessageIndex": 1871,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Jan 30, 2019 01:45PM Maggie2 wrote:  Hello Everyone.  I decided to take a break from all things related to cancer, especially since my BS moved me to the \"Survivorship Program\".  This basically means that her PA will do a breast exam every 6 months on my reconstructed foobs.  Today is my one year anniversary of the double mastectomy.  Being stuck indoors these past several days due to our frigidly cold temps and thinking about this past year, I felt the need to check in. This April group has been such a support, both as I went through chemo and all these months after. What I've discovered during my hiatus is that I do rely on all of you for the unconditional support.  Others that haven't traveled this path just don't \"get it\", especially the rollercoaster of emotions. So much has happened with all of you.  I am so sorry for your loss, Linda.   Engine, I couldn't believe that given all Janice has been through, you two are now faced with this latest hurdle. I was relieved to read that the internist feels upbeat about Janice's recovery. I know all of you have had so many trials, ups and downs.  I hope Bryce is well on the road to being his old self, GAWarrior. Congrats to you, Urdrago on your new grandbaby!  I was also glad to see that you are still sending your own unique \"Happy Birthday\" greetings .  All of the pictures are great!  DebAL, I cold-capped and don't have much more hair than you.  Your hair is really growing in so fast.  Ingerp, I love the curls; you look beautiful, as do all of you!  Well, now that I've read through a month of posts and attempted to get caught up, I wish all of you a warm and uneventful afternoon. ",
      "MessageIndex": 2089,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Apr 25, 2018 11:54AM Maggie2 wrote: Hi All, I hope that I’m not too late joining all of you in the April Chemo. I just found out the other day that I’ll be getting my first treatment on Thursday. I’ll be doing TCx4. From the diagnosis back in November 2017 til now, it’s been constant surprises. Anyway, I have been reading all of your comments and would like to thank you all for offering such helpful tips. I’m going to be doing the penguin cold caps, which seems as if it will make the day of chemo even more stressful, at least until we get the routine down. I start Claritin and steroids tomorrow. I am so much more anxious about all ofthis than I was for the BMX in January and the partial nephrectomy in March. It’s been good to read so many positive reports from all of you.",
      "MessageIndex": 151,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 2, 2018 06:36PM Maggie2 wrote: FD, I’ve been using Colgate 48% Softer Bristles, 360 Enamel Health Sensitive Extra Soft. Sorry, I tried to post a pic, but I don’t have the energy to fight technology hiccups tonight. My first chemo was 4/26 and so far so good with this brush",
      "MessageIndex": 224,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 2, 2018 06:41PM Maggie2 wrote: FD, I also just noticed this is your first post. Sorry that you have to join us, but I’m sure you’ll find this group of wonderful women to be a true godsend of support and information",
      "MessageIndex": 225,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "May 23, 2018 06:14AM Maggie2 wrote: Gentle hugs to all the ailing doggies, and their moms.  For all of you suffering from horrible SE's, I heartily endorse all the recommendations to talk with your oncologists.  I was ready to go to the ER after my first T/C, I felt so horrible.  I just had my second T/C this past Thursday.  They made a lot of tweaks with everything from the rate of infusion to changing the pre-meds, adding more IV fluids, etc.  These past several days, I don't feel great, but the SE's are definitely tolerable. My MO even called me on Sunday afternoon to see how I was doing this time around!   ",
      "MessageIndex": 436,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Jun 9, 2018 01:07AM Maggie2 wrote: Duffyzmom, I am so sorry to hear that you had to say goodbye to Duffy.  It is one of the hardest decisions we have to make for our beloved pets. Thank you all for keeping us informed about the SE's and suggestions for help.  This group has been a godsend.  I had Chemo #3 of 4 T/C yesterday.  Only one more round to go!  Yippee!",
      "MessageIndex": 590,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Aug 2, 2018 04:39PM Maggie2 wrote: DebAL, I had forgotten that you are having your exchange surgery next week, a week ahead of me.  Are you on the Exchange City forum? I'd just like to reiterate what so many have said, this group has been a lifesaver and so helpful these past months.  I posted questions in the beginning of my chemo and all of you were very generous with your time and knowledge, responding immediately.  Thank you.  I hope that all of you that are in the final stretch have an easy or at least easier time of it.  ",
      "MessageIndex": 1039,
      "PostDate": "02/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Aug 17, 2018 10:22PM Maggie2 wrote: DebAL, I hope you’re taking it easy too this weekend. Thanks for your helpful input.",
      "MessageIndex": 1169,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Aug 26, 2018 08:52PM Maggie2 wrote: Thank you Frog and the rest of you for continuing to wish me well. I’m 10 days post exchange surgery. I developed an allergic reaction to the surgical glue only on one side. That’s under control and the bruising is dimishing too. PS said it will be another 4-6 weeks for all the swelling to go away DebAL, you look great! It looks as if you kept your eyelashes. My last eyelash fell out the other day, but I do have new growth, same with eyebrows. I’ve been taking Biotin, but haven’t tried nioxicin shampoo. I used Penguin cold caps during chemo. Unfortunately, I didn’t experience the same success that many on the cold capping thread have. All the new growth is gray and the remaining old hair is very thin, scraggly brown. I either wear a baseball cap or have tried the wig a few times. I’m glad to read that so many of you have finished chemo and I wish the rest of you a very easy time for your last remaining treatments. This April chemo group has been such a godsend.",
      "MessageIndex": 1239,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Sep 9, 2018 08:00PM Maggie2 wrote: Life, a few days early, but hope you have a very Happy Birthday! I can’t wait to see what Urdrago comes up with",
      "MessageIndex": 1341,
      "PostDate": "09/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 16, 2018 04:34AM Maggie2 wrote: Engine, yours is a great example of the crazy housing prices in CA.  Isn't this Janice's second week back at work? Hope it will go ok for her.   Urdrago, hope your drain came out today and the doc gave you a good report on your healing progress.",
      "MessageIndex": 1613,
      "PostDate": "16/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 16, 2018 01:20PM Maggie2 wrote: GAWarrior, I’m sure you’ve told us what your surgery on Friday is, but I don’t remember.",
      "MessageIndex": 1618,
      "PostDate": "16/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 23, 2018 10:33PM Maggie2 wrote: LIFE, you’rebeautiful! GAWarrior, best wishes for a great path report. DebAL, I still have some swelling from the fat grafting donor sites (on the sides, under my armpits) so I’m waiting til everything is healed before I go for a bra fitting. I’m still getting used to these implants. Do yours feel more natural yet?",
      "MessageIndex": 1660,
      "PostDate": "23/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Oct 29, 2018 07:39AM Maggie2 wrote: GAWarrior, one week out of BMX and you're in a cancer walk...you're amazing!!",
      "MessageIndex": 1689,
      "PostDate": "29/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Nov 12, 2018 03:45AM Maggie2 wrote: GAWarrior and DebAL, what a nice picture and it was great that you two could meet in person.  I'm envious!",
      "MessageIndex": 1731,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Nov 30, 2018 02:56PM Maggie2 wrote: Hi All, I thought I had finally better check in again before it was assumed that I had vanished.  I took time off from cancer thoughts to focus on preparing for the family all traveling in for Thanksgiving. The pictures of all of you are great!  Even though I cold-capped, I had to cut my thin, scraggly remaining hair so short that it's not much longer than some of yours. I've never had short hair before and the most startling aspect is how cold the back of my neck gets. Ingerp, my hair was straight and now it is chemocurls, or rather chemowaves. I'm just happy to have hair so I will let it do whatever it wants.  Engine, my mother-in-law always cooked turkey in a brown paper bag. Until I tried hers, which was very moist and flavorful, I thought all turkey was extremely dry; shall we say sawdust! Then the food police chimed in on the use of grocery bags for cooking.  My mother-in-law continued to use her brown bags, though. DebAL, what did you decide about further revision surgery?  I think the rippling is getting worse as my implants settle in more. I warned family that I still have chemo brainfog.  Word retrieval is still noticeable to me.  I'll be talking and just can't come up with the specific word that I wanted.  Luckily, I'm never at a loss for words so I can always find a substitute, but it is still annoying. Also, my hubby now describes me as being \"scatterbrained\", which I certainly never was before. Reading through all these posts, one of you spent Thanksgiving in Indiana. We're in the Indianapolis area, though we've only lived here about 18 months.  I'll have to read through these posts to get caught up on everyone. To all of you going through rads or waiting on test results, I wish you the best of outcomes. ",
      "MessageIndex": 1821,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Dec 1, 2018 08:45PM Maggie2 wrote: Duffyzmom, we live in Fishers!! Next time you’re visiting, let me know. Deb, I’ve had a longer recovery from the implant surgery so my PS won’t even consider any further work til Jan or Feb. We’ll see then if I have any revision work. Given the level of stress and responsibility of your job, I’m in awe that you’re back at work so soon. You’ve certainly managed chemo brain with great success",
      "MessageIndex": 1824,
      "PostDate": "01/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Feb 22, 2019 03:49PM Maggie2 wrote: Linda, such a relief and good news on your ultrasound results. Wishing you good news too on your ultrasound, Duffyzmom. Urdrago, InnaB, Duffyzmom, you all look great!",
      "MessageIndex": 2161,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Apr 1, 2018 10:45AM Maggie2 wrote: Happy Easter to all of you! With a forecast of snow for tonight, it doesn’t quite feel like spring here. I have been researching and can’t find any details on CMF and hair loss, other than “thinning”. How much hair did you lose? Also, did any of you do the cold-capping, even though you were on CMF",
      "MessageIndex": 41,
      "PostDate": "01/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Apr 18, 2018 02:28PM Maggie2 wrote: Hi All, thank you for your feedback. I’ve been busy getting more opinions from oncologists. I was told everything from NOchemo all the way to AC-T. Even the doctors couldn’t agree on CMF, as one said 6 cycles every 3 weeks of IV only and the other two said the more standard route of oral pills then IV for 6 months. I will be doing the Taxotere-Cyclophosphamide 4 cycles every 3 weeks. I’ll have to see if there’s a group for that regimen that I can join. I really appreciate all the information you offered.",
      "MessageIndex": 49,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Mar 28, 2018 07:06PM Maggie2 wrote: Kate and Chickadee, thank you for your input. My tumor was T1a, 4.5mm, clear nodes and margins, ki-67 is 5. I don’t have an oncotype score, as they never did that test. They said that test was relevant for hormone receptor positive tumors. MO did send it to CA for the mammaprint/blueprint test, but due to such low tumor volume, the lab couldn’t complete the testing. I have stressed out more from trying to make this chemo decision than any of the other decisions. I have a 2nd opinion appt with another MO next week. I’m hoping she will give some clarity and relate the chemo options to my specific situation. I had originally wanted to do immediate DIEP flap reconstruction. PS had a CT scan done prior to mastectomy and found a tumor on a kidney. I had to have a partial nephrectomy 3 weeks ago. Luckily, it was also early stage, pT1a. All the doctors say there is no relation between my breast cancer and this kidney cancer, just unfortunate, or fortunate coincidence. This is why my chemo decision has been delayed so long after the BMX, as the MO wanted to wait for the kidney path report and sufficient recovery. MO said 15% if no chemo; maybe 8.5% with AC-T; 9ish with TC; and 9.5% with CMF. I don’t know if these are just generic statistics, or specific to my diagnosis and health.The only advice he will give is that I have to do what I’m comfortable with.",
      "MessageIndex": 40,
      "PostDate": "28/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Apr 1, 2018 06:01PM Maggie2 wrote: Kate, thanks for sharing your experience. I wasn’t sure how the oncologist description of “ thinning” hair actually translates to reality.",
      "MessageIndex": 43,
      "PostDate": "01/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "Maggie2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264371/profile",
      "Content": "Mar 28, 2018 04:25PM Maggie2 wrote: Hi All, were any of you given a choice as to which chemo regimen you would have?  Because of the small size of the invasive tumor and no node involvement, though Triple Negative, my MO has told me it's my decision between AC-T, TC, or CMF. At the first meeting after the final surgical path report, he even said some women may decide no chemo.  Any information that your doctors gave that helped in your decision for CMF would be most appreciated.",
      "MessageIndex": 36,
      "PostDate": "28/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    }
  ]
}