{
  "AuthorID": "maggie14",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92145/profile",
  "Posts": [
    {
      "AuthorID": "maggie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92145/profile",
      "Content": "Dec 1, 2009 03:46PM maggie14 wrote: Lori,  thank you so much for your lovely story...I'll be making sure my rubenesque girl cat \"kiki\" gets some loveblinks tonight!  You're very caring and I very much appreciated you sharing  your tale with us.",
      "MessageIndex": 6,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/720522",
      "Title": "pets and chemo hopefullady NewportLori"
    },
    {
      "AuthorID": "maggie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92145/profile",
      "Content": "Nov 9, 2009 04:22PM maggie14 wrote: Hi Cindy, I've just been diagnosed and am facing tests tomorrow and all next week.  Would you mind if I quote you on my own blog, for my friends and family so far away that they really don't get what I'm going through?  Its as if you wrote my exact story, this poem you crafted so thoughtfully.  I am not too scared until I look into my two boys' eyes (6 and 10)...they're worried for me and scared about what they hear over the phone --over and over again--well meaning relatives could read and email more thoughtfully crafted responses, I'm hoping. ",
      "MessageIndex": 11,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/741584",
      "Title": "\"its not good news\" littlebird75 badger"
    },
    {
      "AuthorID": "maggie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92145/profile",
      "Content": "Nov 10, 2009 10:40AM maggie14 wrote:",
      "MessageIndex": 16,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/741584",
      "Title": "\"its not good news\" littlebird75 badger"
    },
    {
      "AuthorID": "maggie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92145/profile",
      "Content": "Nov 12, 2009 02:50PM maggie14 wrote: Let me post a reply, Ant on the separation thing, since I'm also going through that too.  I was just diagnosed Nov. 3 and I'm still waiting to meet w the ONC, but my husband is travelling from our home in Europe to N.Am. for 6 weeks and won't be here to hold my hand while I go through the treatment decsion making process...its really tough but remember that there are super cheap phone calls and she knows you want to be with her more than anything.  Make ways of telling her you're thinking of her, even if its only a txt msg.  I'm sure the stress is felt both ways.  Oh, another thing, get your support network activated (not for her, but for you) and make sure to be in touch with a few of her friends or relatives that can be your eyes and ears at appointments--(I'm sure I won't hear a 1/3rd of what they'll be telling me next week) and having someone there with her for these will alleviate both your fears. Let us know how you fare, and know that there are lots of supportive people right here wishing you all the best.",
      "MessageIndex": 5,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/743739",
      "Title": "Some questions Ant61 concernedsis"
    }
  ]
}