{
  "AuthorID": "magic_mama",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128360/profile",
  "Posts": [
    {
      "AuthorID": "magic_mama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128360/profile",
      "Content": "magic_mama wrote: I went to see my normal family doctor yesterday and left with some not so good news. I made the appointment because I had been feeling sore/tenderness in both of my arm pits for several weeks (getting slightly painful over the last few days). She did a CBC and we haven't got the results back yet. There aren't any other symptoms and she didn't seem to be concerned by anything else. She told me to make an appointment for a \"bilateral axillary\" ultrasound and gave me the phone number. She never once mentioned the word cancer during my appt. But when I called to schedule the ultrasound, she sent the order to a breast cancer center. The ultrasound is scheduled for Friday and I'm not sure how long it takes to get blood work back. I'm worried out of my mind! Not knowing is killing me! I've been trying to come up with a diagnosis other than breast cancer but nothing else seems to fit. :( Anything help take your mind off waiting for results? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768228",
      "Title": "Trying not to worry :( magic_mama angelinac"
    },
    {
      "AuthorID": "magic_mama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128360/profile",
      "Content": "Apr 29, 2011 10:19AM magic_mama wrote: So they did an ultrasound today. It wasn't quite what I was expecting though, they only got images of my lymph nodes. The doctor told me right then that he didn't see anything. I was so relieved I didn't really ask any other questions about it. I haven't gotten blood work back at all yet either. Does this mean I really dont have anything to worry about or should I have asked for images of the breasts as well? Trying to take this as good news but its hard when I feel like I still dont have the complete picture.",
      "MessageIndex": 6,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768228",
      "Title": "Trying not to worry :( magic_mama angelinac"
    },
    {
      "AuthorID": "magic_mama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128360/profile",
      "Content": "Apr 27, 2011 07:16PM magic_mama wrote: Thanks. No I haven't been sick at all, Ive been doing some online research all day for reasons why my lymph nodes might be swollen and sore, nothing fits. Any idea how long it takes to get ultrasound results?",
      "MessageIndex": 2,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768228",
      "Title": "Trying not to worry :( magic_mama angelinac"
    },
    {
      "AuthorID": "magic_mama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128360/profile",
      "Content": "Apr 27, 2011 09:30PM magic_mama wrote: I just realized I can feel about 3 pea size lumps under my right arm and 1  under my left. I wonder if my doctor felt them too, she didnt mention it during the exam. I suppose its possible that these are just swollen lymph nodes, possibly for some non cancer related reason. Just keep getting more scared :( Firday can't come soon enough.",
      "MessageIndex": 4,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768228",
      "Title": "Trying not to worry :( magic_mama angelinac"
    }
  ]
}