{
  "AuthorID": "magneto",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273778/profile",
  "Posts": [
    {
      "AuthorID": "magneto",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273778/profile",
      "Content": "magneto wrote: My mom used to get mammograms every 6 months because she has dense breasts, then after the last one they told her that everything seemed stable so they wouldn't need to do another one until a year later. So after a year she did another one and they found breast cancer in her breast and lymph node. I can't stop thinking about how they could have caught it earlier had they done a mammogram 6 months ago like they used to and that they are responsible for her situation. I mean, is there any reason why it would not have been better to just stick to the 6 month schedule? I am seething with anger every time I think about this. And now they are having her wait an entire week after the biopsy before she can meet with the surgeon. Isn't it possible the cancer can spread in that amount of time? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864572",
      "Title": "Mom diagnosed with breast cancer, did they drop the ball? magneto YYC_Girl"
    },
    {
      "AuthorID": "magneto",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273778/profile",
      "Content": "May 13, 2018 11:23PM magneto wrote: Thank you so much for the support. I am just really hoping it has not spread to too many lymph nodes or metastasized. I am definitely going to inquire about the alternating MRI and mammogram going forward.",
      "MessageIndex": 2,
      "PostDate": "13/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864572",
      "Title": "Mom diagnosed with breast cancer, did they drop the ball? magneto YYC_Girl"
    }
  ]
}