{
  "AuthorID": "magwire77",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260413/profile",
  "Posts": [
    {
      "AuthorID": "magwire77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260413/profile",
      "Content": "Oct 2, 2017 06:12AM magwire77 wrote: well I received my US report today from my right breast lump. FINDINGS: At the 6:00 position, about 3 cm from the nipple, there is a hypoechoic nodule which appears solid. It correlates with the palpable abnormality and measures 9 x 6 x 11 mm. This nodule is indeterminant. Doppler evaluation of the area is normal. IMPRESSION: 1. CATEGORY 4A: SUSPICIOUS. ULTRASOUND GUIDED CORE BIOPSY IS RECOMMENDED FOR A PALPABLE NODULE OF THE RIGHT BREAST AT 6:00.  I was expecting something more😊 like something saying, \" don't worry, it's fine.\" I believe that all sounds positive though, and will be staying much calmer until Wednesday when I have the US on axilla(? )And core needle biopsy. Meekie- have you seen any results yet?",
      "MessageIndex": 9,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858960",
      "Title": "breast lump, swollen lymph node magwire77 Adriana1023"
    },
    {
      "AuthorID": "magwire77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260413/profile",
      "Content": "Sep 29, 2017 04:20AM magwire77 wrote: mystic and meekie- thank you both so much. I have been staying super busy and trying not to worry. I hope you are staying calm as well Meekie. I feel like Wednesday is going to take a long time to get here😊 Djmammo- I was not given any reports? Is this something I should ask for at my next appointment? All I was told was mammo is clean ultrasound shows a solid mass. I suppose I could have asked questions but I did not know what to say. I thought a clean mammogram was a great thing...it wasn't until I found this site that I realized it wasn't.",
      "MessageIndex": 4,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858960",
      "Title": "breast lump, swollen lymph node magwire77 Adriana1023"
    },
    {
      "AuthorID": "magwire77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260413/profile",
      "Content": "Sep 29, 2017 09:58AM magwire77 wrote: Thank you Djmammo. I spent the last 2 hours calling and getting my portal set up! They had my social security number in wrong.😉 I still cannot find any information other than a letter stating my mammogram showed I have dense breasts. I will call them and see how to get an actual copy of the reports.",
      "MessageIndex": 6,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858960",
      "Title": "breast lump, swollen lymph node magwire77 Adriana1023"
    },
    {
      "AuthorID": "magwire77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260413/profile",
      "Content": "magwire77 wrote: Hoping someone can give me reassurance. 40years old, relatively healthy, slender, no bc I'm family other than one great aunt, no medications. Found a lump 6 days ago in my right breast located about 7o'clock. I found it because for about a week I had been having an incredible deep itch on the front of my shoulder that occasionally spread into my breast. Went to Dr the next day. Went for mammogram and ultrasound. Mammogram came back clean which I celebrated for about 2 seconds before the Dr said the ultrasound showed a solid mass and would need a core needle biopsy. I also believed a clean mammogram was the end until then! Tried not to worry. I knew the percentages of women who get a biopsy and they are b9. Next day( yesterday) I am laying down and suddenly notice a lump in my armpit. Definitely feels like a swollen lymph node. Call BS office and they say they will get an order for ultrasound on the same day as my biopsy next week. I have not been sick nor any infections. I am not freaking out but I a m slightly more worried. I did not ask the BS any questions at my appt because I figured I would wait for the biopsy. No need to ask until then. I am just wondering if there is anything that could cause the lump in the breast and the swollen node? I have tried to avoid Google and went to many different posts on this board but cannot find any answers. Any words would be appreciated. I feel quite alone in this right now. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858960",
      "Title": "breast lump, swollen lymph node magwire77 Adriana1023"
    },
    {
      "AuthorID": "magwire77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260413/profile",
      "Content": "Sep 29, 2017 11:51AM magwire77 wrote: My reports won't be ready until Tuesday. Djmammo I see you are a radiologist but do you know if I could have some kind of infection? I developed the itch quickly, a week later I found the lump, my Dr checked my nodes a week ago Friday and found nothing, by Tuesday the node was swollen. It all seems to be happening so quickly. I do monthly breast exams so I know the lump and node are new. I guess I should just wait till the biopsy. 😊 I am an inquisitive person so not understanding is hard for me. ",
      "MessageIndex": 7,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858960",
      "Title": "breast lump, swollen lymph node magwire77 Adriana1023"
    },
    {
      "AuthorID": "magwire77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260413/profile",
      "Content": "Oct 9, 2017 10:01AM magwire77 wrote: Hey all....so I got my biopsy result back and it was negative!! I was so thankful but they did let me know I have mastitis. I asked if I should get antibiotics, the nurse said, \" well is the breast still red?\" I replied it had never been red. She said, \" oh, well does it still hurt?\" I replied it never hurt. She said,\" call your PCP and see if they think you should. They will have the report.\"  I called my PCP and was told by the front desk staff that if I was suppose to be on antibiotics the breast center would have me on them. That they were just having me call them to put my mind at ease. She did say she would pass the message to my PCP and let her decide if I should be on antibiotics. ( first of all I was calm throughout this entire ordeal, thanks to this site. Secondly, why is a front desk person telling me I don't need them for.) My PCP nurse called back and left me a message to take 2 weeks of antibiotics and then come in for reevaluation. I was doing really well with everything until today. Today should be a day of happiness, and I am thankful as hell, but now this whole mastitis thing is a new annoyance. I have not been breastfeeding for 14 years and I have no symptoms other than a lump and swollen node. I had shingles twice since February and now mastitis. From the little Google I did, it sounds like my immune system might be compromised? I am a very healthy, jog 2-4 miles a day, vegan, sleep well, and relatively good life. I am starting to feel like the very quiet wheel that needs to start squeaking!!!! I just don't know what to squeak about! All that information just to vent 😉 and ask some simple questions, can they actually tell from a biopsy if it's mastitis or not? I am confident the lump is b9 but not so sure about mastitis. If it is mastitis shouldn't I have been prescribed antibiotics or is it something that could go away on its own? This site has taught me so much and I am thankful to all of you who help so much. ",
      "MessageIndex": 10,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858960",
      "Title": "breast lump, swollen lymph node magwire77 Adriana1023"
    }
  ]
}