{
  "AuthorID": "Mah",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102953/profile",
  "Posts": [
    {
      "AuthorID": "Mah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102953/profile",
      "Content": "Jun 8, 2010 08:34PM Mah wrote: Hi I am from Sydney Australia and was diagnosed beginning of April 2010.  After mastectomy, I am apparently IDC 16mm, Stage 1, no nodes, 99% Er/PR positive and HER2-, grade 2.  I am 57 years with allergies and hypertension and Menieres disease which are all under control, and 123 kg.  They found another 2mm DCIS and a 2mm LCIS when doing a pathology on the breast. My oncologist has recommended that I do hormone therapy alone.  My second opinion said the same.  They would both do 4 courses of AC if I insisted.  Apparently on adjuvant online it showed that there would only be a 1% gain from chemo and a 1-3% risk of cardiomyopathy from the chemo.  I have a family history of heart attacks but I am concerned that I may be undertreated, and may have a better cure rate with chemo.  Hormonal therapy seems to be a staying, delaying therapy, preventing the growth.  I don't think they kill the cells.  The cancers seem to come back when you stop, and the longer you are on it  the greater the chance of resistance in your body, as with all medications, and if it does kill of cells, the ones that remain will be the 1/100 that was not ER+, and they will grow without restraint.  I have just started my sixth week post surgery and have not made a decision.  I have asked for an oncotype dx test to see how agressive the cancer is and the likelihood of it coming back. This has only just been moved.  So it will be an even longer wait.  I am afraid of chemo, and wary about relying on hormone therapy.  My oncologist has said to start hormone therapy in the mean time if I am concerned, the second opinion said that hormone therapy interferes with the effectiveness of chemo and can exagerrate the side effects of chemo. Anyone have any ideas.  The doctor seems to think it is not an aggressive cancer (grade 2?) and there will be no harm in waiting a few more weeks.  If it was a grade 3 or node positive he said I would be on chemo. So I am panicking. It was not a small tumour.",
      "MessageIndex": 2761,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Mah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102953/profile",
      "Content": "Jun 9, 2010 01:07AM Mah wrote: Hi Red Barb804 I think that you made the right choice.  Over here they give you chemo automatically if you are grade 3.  You saved yourself some money on the onco test.  If it walks like a duck and talks like a duck then it is probably a duck and you should treat it.  I admire your resolve though. Mine is in the middle.  They think that it is OK because it is node negative.  I would be happier if it were a grade 1 DCIS. I would personally worry if I do or don't do chemo.  The difference for me is that if it metastasises, then its just a matter of time (often short), and I will consider it my fault because I did not try.  Trying does not necessarily make a difference however.  The chemo did nothing for a friend of mine, 6 months of hell and died within a year of diagnosis.  Another lady at work has been fine since chemo.for 5 years and hers was not low risk. You cannot always control events, but you can give it your best shot. I would wish you luck, but you have made the right choice and it is working out well for you, I think you have made your own luck.",
      "MessageIndex": 2789,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Mah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102953/profile",
      "Content": "Jun 8, 2010 08:46PM Mah wrote: About 3 weeks I think, it has to be sent to US and takes about 2 weeks to process.",
      "MessageIndex": 2763,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Mah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102953/profile",
      "Content": "Jun 8, 2010 10:18PM Mah wrote: Hi Didel and Char 2010 and Glenis: Over here they do not do pathology on 2mm DCIS, so I do not know what my extra tumour was.  I asked and they said no. So I don't know what it was. TC tends to impact more on people with allergies which is me.  I have already used predisone about 4 times for a few weeks in the last 10 years.  I suspect AC was the lesser of 2 evils. I have a better chance of surviving treatment. But I am not told what they are thinking, this is my guess. I agree with the window.  They usually have people start chemo 4-6 weeks after surgery. This will take me up to 8-9 weeks. My concern is that they have been wrong so many times with me.  The first time they said it was a grade 1 tumour 2cm and would not have agressive features particularly considering my age. They refused to do the mastectomy for 3-4 weeks. Finally did the operation as requested and found grade 2 (mix of 1 and 3), with extra bits and indications of precancerous LCIS/ALH changes through the breast.  They agreed with my decision. Now they are saying just do hormones and it is not that aggressive.  I was stoic when first diagnosed, thinking that I would have to do chemo, as it was not in situ.  I was prepared. Then they said you do not need to do it and in fact did not recommend it.  It started to appeal to me, just return to my life.  Chemo terrifies me. I live alone, and family have passed away or live very far away and are older than me.  There is no support locally.  But I want a cure, not just a stay of execution. If they are wrong as they have been so far and I am getting conflicting advice about starting hormone therapy before chemotherapy, it is difficult to move.  They seem to be trying to wish the best for me which is nice, but if they are wrong then I am in big trouble and I would then be looking at a heart attack as a nice reprieve from a cancer death.  All the choices seem hideous.  I think that you are all very brave, and I feel like such a wimp. Thank you for your support, I will keep trying to resolve it. I used to go to the beach at Collaroy as a child, which is near Narrabeen.  Just the thought of it reminds me of the scent of alyssum flowers and sea salt and sand in my hair. ",
      "MessageIndex": 2775,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Mah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102953/profile",
      "Content": "Jun 22, 2010 07:49AM Mah wrote: Hi I have had Frozen Shoulders for 17 years and auto immune Menieres Disease.  I also have arthritis and rheumatism and many allergies and food intolerances. There may be something to the imune issues.",
      "MessageIndex": 7,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    }
  ]
}