{
  "AuthorID": "maha_007",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239103/profile",
  "Posts": [
    {
      "AuthorID": "maha_007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239103/profile",
      "Content": "Sep 10, 2016 11:18AM maha_007 wrote: Hi Pajim, Thanks for the reply. Just got her tru-cut needle(the diagnostics person got 4 small chunks of the tumor in the breast) biopsy report and have concluded that its ER-/PR-/HER2+/KI-67(6%). Bad news as I know. But they have opined in the report that ER,PR and KI-67 should be done through excision biopsy because the nature of the sample is tiny.",
      "MessageIndex": 4,
      "PostDate": "10/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847903",
      "Title": "Bone and liver metastasis maha_007 maha_007"
    },
    {
      "AuthorID": "maha_007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239103/profile",
      "Content": "maha_007 wrote: Hi, I am living in Bangalore, India. My mother went to a Gynaecologist following a lump in her lower left breast. The gynaec asked for an FNAC and mammography and finally concluded that its a breast cancer(ductal carcinoma). She wanted to do a mastectomy even before doing detailed diagnostics. But we wanted to get a surgical oncologist before we actually go for mastectomy. There were many inexperienced surgical oncologists in consideration. However we waited to get one of the best surgical oncologists to get it checked. The tumor was measured to be 3.1 x 1.9 x 2.6 cms. He felt that there is no lymphnode swelling in the axilla and said its in early stage and scheduled for a lumpectomy. We accidentally said she got operated in the hip 3 years ago and he asked us to get a bone scan done. Bone scan said there is a suspicion of a lesion in the L4 vertebra and has metastasized. But the resident doctor ignored it and said we can go ahead with lumpectomy surgery. But I was suspicious about it and went to the main oncologist to consider the report. He said there are less than 5% chances of it being metastasized(may be he was hiding) and asked to get PET/CT. PET/CT was disastrous and showed there were multiple places where the cancer has spread. It has spread to L4 vertebra, left femur, iliac bones, scapula and both lobes of the liver. They have asked for a trucut biopsy to get a histopathology and ER/PR tests. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847903",
      "Title": "Bone and liver metastasis maha_007 maha_007"
    },
    {
      "AuthorID": "maha_007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239103/profile",
      "Content": "Sep 11, 2016 01:46PM maha_007 wrote: Thanks a lot Pajim, its indeed a very good article. Tomorrow we are going for a Chemo and will have to wait and watch how she responds. Wish us luck. One question, is it possible to get a liver lesion of 2x1.8 cm out by chemo and other drugs. I am scared.",
      "MessageIndex": 6,
      "PostDate": "11/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847903",
      "Title": "Bone and liver metastasis maha_007 maha_007"
    },
    {
      "AuthorID": "maha_007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239103/profile",
      "Content": "Sep 10, 2016 06:22AM maha_007 wrote: Thanks Tomboy for your support and a prompt reply. We are going ahead with Chemo right away and thats what has the medical oncologist suggested us to do. I am not sure if there is a difference between the chemo drugs available in India and rest of the countries. Can everyone let us know what is the recommended drug for chemo if you are getting it for the first time? Does it need an auxiliary drug to control the side effects?",
      "MessageIndex": 2,
      "PostDate": "10/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847903",
      "Title": "Bone and liver metastasis maha_007 maha_007"
    },
    {
      "AuthorID": "maha_007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239103/profile",
      "Content": "Sep 11, 2016 08:58PM maha_007 wrote: thanks pajim, relief to know that...",
      "MessageIndex": 8,
      "PostDate": "11/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847903",
      "Title": "Bone and liver metastasis maha_007 maha_007"
    }
  ]
}