{
  "AuthorID": "Mahsa_sh",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242723/profile",
  "Posts": [
    {
      "AuthorID": "Mahsa_sh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242723/profile",
      "Content": "Mar 9, 2017 01:23AM Mahsa_sh wrote: Hi Angi, Sorry for my belated answer. I'm diagnosed with stage IIIa BC. The biopsy was taken from the wrong spot in first place. Hope you are doing fine Angi",
      "MessageIndex": 2,
      "PostDate": "09/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/850262",
      "Title": "Enlarged axillary lymph node after breast core needle biopsy Mahsa_sh akayb"
    },
    {
      "AuthorID": "Mahsa_sh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242723/profile",
      "Content": "Mahsa_sh wrote: Hi, I had a core needle biopsy done on March 2016 which came as Fibrpadenoma and stromal sclerosis (no malignancy). Two weeks later I found a small swollen lymph node in my armpit the same side as the breast biopsy. ultrasound showed one axillary lymph node with a little thickening of the mantel consistent with slight reactive change. The US report said the finding was not significant and the change might be due to reaction to the breast biopsy. However, the lymph node hasn't gone away since then and I think it might be bigger in size and slightly different from previous structure. Further to this, I feel more pain in my breast after the core needle biopsy and my breast is slightly bigger and swollen. My Gp refused to order FNA form the lump. I saw a breast cancer surgeon this morning and he ordered FNA form the lymph node plus MG and US for my breast. i'm so scared. has anyone experience this before? I mean a persistent swollen lymph node after breast core needle biopsy? I would be thankful if anyone can share any info regarding this, Cheers, Mahsa Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/850262",
      "Title": "Enlarged axillary lymph node after breast core needle biopsy Mahsa_sh akayb"
    }
  ]
}