{
  "AuthorID": "Malinda",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63006/profile",
  "Posts": [
    {
      "AuthorID": "Malinda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63006/profile",
      "Content": "Dec 17, 2008 01:03PM Malinda wrote: Hi,  I am being treated at Duke Raleigh Hospital Cancer Center in Raleigh, NC and they have two \"Patient Navigators\" who work with cancer patients (one of them primarily with breast cancer patients).  These two \"angels\" handle all of the questions a cancer patient can throw at them.  The navigator assigned to you comes to see you during each chemo treatment and checks in  on you during your radiation treatments, as well.  They help shedule appointements, get you in to see different doctors, listen to your fears, hopes, ups and downs,  One of them is the facilitator at the bc support group (she is a two time survior).  They also oversee the \"Cancer Patient Orientation\" program that everyone goes through before they start treatment.  During the orientation, they answer questions, tell you what to expect, talk about the drugs you will be given, take you on a tour of the chemo lounge and the radiation treatment rooms. The philosophy of \"knowledge is power\" certainly applies here and it is helpful to have things explained and discussed in advance.  I think EVERY medical facility treating cancer patiaents should have a navigator to help patients through this scary journey. Malinda",
      "MessageIndex": 6,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726022",
      "Title": "Gathering all the facts looking4answers Judiiiii"
    },
    {
      "AuthorID": "Malinda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63006/profile",
      "Content": "Dec 17, 2008 01:37PM Malinda wrote: Hi Nancy, I had chemo over the Spring and Summer and just finished radiation in September.  I have had a sore jaw since mid-summer.  It, too, is in the soft tissue and hurts at the touch (I can feel it a little swollen on the right side).  My bc was on the right side, so I think everything on the right side of my body that does not feel right is cancer returning.  I am getting really stressed out over the tenderness, so I am calling my ono the first week of Jan. and have him take a look.  Please let me know what you have found out...I, too am freaking out a little bit over this weird pain. Malinda ",
      "MessageIndex": 13,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707440",
      "Title": "Any one with bone mets that only hurt upon touch? NancyM Malinda"
    }
  ]
}