{
  "AuthorID": "MamaEnki",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
  "Posts": [
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "May 25, 2017 07:27PM MamaEnki wrote: I finished my round #2 of AC yesterday! Only two more to go. I was sad for round 2 because I was just getting back to feeling normal. It was much quicker than the first. I think the nurses spent most of the time poking around my arm looking for my veins. I feel fine today, luckily the steroids are helping me make it through my lack of sleep last night thanks to a coughing 2-year-old. It seems that unlike most of you, I have to leave to house to escape the germs. My 2 year old is on his 3rd cold since starting a new preschool on May 1st. I did have to get permission from my doctor before my husband would let me attend some open air events. My hair has finally started to shed. I have my hats, scarves and wigs. I will probably get a buzz cut this weekend before my youngest pulls out more fistfuls of hair, sadly my hair is his security blanket. He'll just have to start grabbing his own hair for a change! Like many of you, I am working during chemo as well. After being off for 5 weeks recovering from surgery, I figured out that for my sanity it is better to work. I can't work from home and I have a hefty commute, so I am just working part-time. But I work for a very accommodating company and I get a lot of support from my co-workers. MsLin, I totally understand wanting to work. It is disappointing that your employer is discouraging. You know yourself the best.",
      "MessageIndex": 355,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "Jul 7, 2017 04:09AM MamaEnki wrote: I just had my first taxol today. I don't have a port and it didn't take too long to find a vein. I was given Pepcid, steroids and Benadryl before starting. The Benadryl made me sooooo sleepy. It took a little while at first since they start slow. My appointment started at 11:30 and I left at 2:30. I guess next week will be better. No Benadryl next time. I am supposed to take Zyrtec an hour before I go. No side effects yet, but I am sure they will come. I hope everyone had a lovely holiday. This weekend I am going with my herd of kids and my dh to a retreat for cancer patients and their families among the redwoods. I am really looking forward to this little break.",
      "MessageIndex": 541,
      "PostDate": "07/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "May 20, 2017 01:59AM MamaEnki wrote: lovepugs77- I was absolutely starving for about a week post infusion. I would eat a banana and want to eat something else 10 minutes later.",
      "MessageIndex": 274,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "Jul 21, 2017 01:11PM MamaEnki wrote: msrobin58- Congratulations on finishing your last AC! I too felt bad in days following the las one. It was so frustrating to have everything taste bad and feeling like having the flu. I hope the taxol will be better for you. I had my third treatment yesterday. I am amazed that I don't get that same icky feeling afterwardsthat I got from the AC. So far the only side effects I have had is brown spots on my nails. I am too lazy to ice them, so I just painted them. I have also had minor Tate changes, but nothing like the AC",
      "MessageIndex": 564,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "May 18, 2017 07:40PM MamaEnki wrote: I hope that everyone is managing well! Now that I am 9 days out of my first AC, most of the side effects have subsided, except my bone pain has just kicked in. Ouch! I guess I just have to grin and bear it, but I am really dreading my hour-long commute home. It's a real pain in the ass! Good luck tomorrow, Irwells50!",
      "MessageIndex": 259,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "May 14, 2017 02:31PM MamaEnki wrote: Hello ladies, I have been reading your posts and felt it was probably time for me to join the group. I had my first round of AC on Tuesday. I am still recovering. I think the most annnoying thing has been the constant sore throat. I was supposed to start chemo in April, but I also had some delayed healing from my DIEP reconstruction, so here I am! I am 39 years old with 3 kids, 7, 5 & 2. Of course my youngest 2 got colds right before I started so I have been trying to avoid their germs. I got a wig on Friday. Luckily I live in the foggiest part of San Francisco, so summer heat shouldn't be a problem.",
      "MessageIndex": 194,
      "PostDate": "14/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "May 15, 2017 11:55PM MamaEnki wrote: msrobin58 I am glad that the sore throat will go away. It was driving me crazy yesterday. I am glad you are finally leaving the hospital. What a scary thing to go through and after the first chemo too! Hopefully it will make the next ones easier. Hope1970 I have The Cancer Fighting Cookbook too. I have made a few recipes and they are as delis has they can be. The ginger soda is really good. I actually look forward to drinking it. It took me awhile to adjust to the idea of chemo, too. I was originally diagnosed DCIS, so was just going to have surgery. But my breast surgeon told me that when there is a palpable lump in younger women, they tend to have lymph node involvement as well. Lucky me, the tumors in my lymph nodes were larger than in my breast. For everyone who hasn't started yet, chemo is the cancer treatment boogeyman. It is so much scarier before you begin, not so bad once you start. That being said I am still dreading my next infusion",
      "MessageIndex": 214,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "May 16, 2017 02:53PM MamaEnki wrote: ParakeetsRule- I am sorry that your first day was so bad. It's a shame that some places don't really inform you. I was given steroid pills, Emend and something else before my infusion. The A took longer than the C, but I also don't have a port so it is a slow injection alongside fluid into the vein. I was sent home with 2 days worth of Emend and steroids to take each morning with Compazine to fill in the gaps. I found I got nauseous around 5 in the afternoon, just in time for the commute home! It was usually pretty manageable. I also don't have a Nuelasta pod injector. I have to give myself nightly injections of Zorxio for 7 days. I take my nightly Zyrtec and an hour later give myself a shot and haven't really felt any effects. My daughter likes to help by holding my band aid. The pharmacist at my HMO said that they prefer the nightly injections because it doesn't stay in the blood stream as long. It's probably also cheaper for them! I hope the next few days go easily for you! The walks with your dog will probably help.",
      "MessageIndex": 231,
      "PostDate": "16/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "MamaEnki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249906/profile",
      "Content": "Jun 23, 2017 06:11PM MamaEnki wrote: I had my last AC treatment yesterday. A 2 week break and then onto Taxol. I glad that I get to read how others are handling taxol, now that the AC is done, I am getting irrationally worried about Taxol side effects. So far no major problems with the AC, I think the 3rd was the worst lots of fatigue, of course I still have to see how this one goes. I am also sad about all the delicious summer fruit tasting horribly for a week after my infusion. Reading the travails with the ports almost makes me glad that I didn't get one. We'll see how I hold up with the twelve weekly infusions, if it gets too bad I might request a PICC line for the remaining treatments. After my last AC yesterday, my DH, DS who is 5, and I went to the DMV so my cancer self can be memorialized for the next 15 years in my driver's license, which is set to expire on July 4th, my 40th birthday. To celebrate I wore my light pink wig, I figured it was better than my ig bald head. I wish everyone few side effects and may you continue to kick cancer's a$!!!! (hope I don't offend anyone)",
      "MessageIndex": 514,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    }
  ]
}