{
  "AuthorID": "Mamamule",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208970/profile",
  "Posts": [
    {
      "AuthorID": "Mamamule",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208970/profile",
      "Content": "Dec 29, 2014 02:29PM Mamamule wrote: Hopefully I can post here even though I don't own a horse. I did take riding lessons as a child... This thread caught my attention because I too have problems with memory. I forget words or can't remember the names of things mid-sentence, I walk into a room and can't remember why, and I have to write down everything! At work I have written procedures for everything -- ostensibly so that someone else could take over if I ever got hit by a bus, but they're actually for my own use. If I don't write down how to do something, the next time I'll have to figure it out all over again. I use Outlook Task Manager to keep notes on projects, issues, conversations etc. My train of thought is like a roller coaster at Disneyland -- constantly going in different dirrections. I've definitely turned into an airhead -- a couple months ago I went into work on a Saturday and left the front door unlocked the rest of the weekend. But here's the thing -- I only just started my chemo last week. I've been experiencing these problems for a couple years, and they seem to have intensified the past few months. This, plus fatigue, is why I initially went to a doctor last October. It's a bit of a murky area for me as I have ADD which is known to cause some of these symptoms/problems. However, I've had ADD for many years and with my medications I functioned fairly well.I thought there might be some enzyme I was missing or something, or a hormonal imbalance. The doctor didn't know, but did tell me it was time to get a mammogram, When I met my oncologist I told him I was concerned about Chemo Brain because I already had it! He said something very interesting -- he'd been doing some research regarding whether there is a ink between these types of problems and just having breast cancer, even without the chemo. DLB823 posted a link to an article that suggest that possibility. I've heard hormone imbalance can cause these types of problems, and after a DX of bilateral breast cancer that's ER+PR+ i'm becoming convinced I did. I hope more research is done regarding this. In the meantime, I'm learning tricks to deal with what I can.",
      "MessageIndex": 48,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778062",
      "Title": "Cognitive and/or learning difficulty post-chemo horsedoc burlenek"
    },
    {
      "AuthorID": "Mamamule",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208970/profile",
      "Content": "Dec 30, 2014 04:54PM Mamamule wrote: I have 2 diagnosis dates because I have bilateral IDC. Initial tumor was found on right side and confirmed by mammogram, but left side appeared clear. After diagnosis my surgeon ordered follow-up tests, including an MRI of both breasts. Something looked abnormal on the left side so a biopsy was done. It turns out the cancer on that side is actually larger and more advanced -- it's already spread to lymph node! I guess it didn't show on the mammogram because instead of growing in a mass, it's in a thin film that covers the underside of breast. I didn't even know that was possible... Scary stuff to realize a cancer that far along can still evade mammogram detection! I wonder how many women go home after mammogram thinking all is well for another year when it actually isn't... I'll be having BMX as soon as chemo is done. I figure they both tried to kill me, so they're both out! I was hoping to begin reconstruction at same time, but now with the stage 3 and lymph node involvement I may have to do radiation. Joy.... As someone who has suffered from brain fog issues for several years, I offer a few thoughts: Best of luck to you all! ,",
      "MessageIndex": 50,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778062",
      "Title": "Cognitive and/or learning difficulty post-chemo horsedoc burlenek"
    },
    {
      "AuthorID": "Mamamule",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208970/profile",
      "Content": "Dec 28, 2014 08:13PM Mamamule wrote: I had my first round of AC chemo on 12/17 and when I went for labs 12/24 I was told I had neutropenia. I received one shot of Neulasta the day after chemo that was supposed to prevent this, but obviously didn't. Neulasta has the same function as your medication, but I don't know how they compare. Did you develop neutropenia? Did your doc give you a preventive antibiotic?",
      "MessageIndex": 1,
      "PostDate": "28/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/827170",
      "Title": "Has Anybody Had (CMF) Chemo and had problems with neutropenia? pink_rita Mamamule"
    }
  ]
}