{
  "AuthorID": "MamaLambNC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84394/profile",
  "Posts": [
    {
      "AuthorID": "MamaLambNC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84394/profile",
      "Content": "Jun 18, 2009 07:28PM MamaLambNC wrote: Well, I found out today that the spots in my breast are both DCIS & invasive....I have been having a wild emotional day. One min. I'm laughing like there's nothing wrong & the next I'm bawling like a calf without it's mama. There's so many words floating around in my head....lumpectomy, radiation, maybe chemo, chest x-rays, breast mri, needle loc biopsy. The more I think....the more scared I get. I'm sorry to unload on you guys again but I'm losing it....again. Thanks for listening, Patty",
      "MessageIndex": 6,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736082",
      "Title": "Kinda scared.... MamaLambNC margiejune"
    },
    {
      "AuthorID": "MamaLambNC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84394/profile",
      "Content": "MamaLambNC wrote: I go to see the surgeon this morning. Found out Fri. that the clustered calcifications from the biopsy on Tue. were cancerous. My family Dr. got the word that it was DCIS....whatever that is. He said if you had to choose which breast cancer you had to get....this would be it. So, I guess I shouldn't be scared. But for some reason, I still am. He said I probably wouldn't have to lose all of my breast. Well, I don't want to lose ANY of it!! I mean, we've been together a long time....(sorry, I tend to make dumb statements when I'm stressed....) And I know that I need to suck it up & be an adult but I'd much rather run away & hide my head under a blanket until it all goes away. Please keep me in your thoughts, prayers, & etc. today? I need your guys strength. thanks, Patty Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736082",
      "Title": "Kinda scared.... MamaLambNC margiejune"
    }
  ]
}