{
  "AuthorID": "mama2mygirls",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252767/profile",
  "Posts": [{
    "AuthorID": "mama2mygirls",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252767/profile",
    "Content": "mama2mygirls wrote: I've been reading here for a week or so now but decided to make an account and post. I am 44 years old and have large lumpy dense breasts. I have had a few mammograms back when my youngest was nursing because of what they said was a clogged milk duct. Each time they complained that my breast tissue made it hard to see anything on the mammo. They did ultrasounds and gave me an all clear. I was probably 34 or around that. I did some reading about dense breasts and how they make mammo's not as accurate so I have done thermography the last few years and have had the all clear on those/ Now I'm reading on here that thermography isn't always a good thing. Several weeks ago over a short period of time one afternoon I had some stinging shooting pains in my left nipple area so i'd grab it and let it pass. That happened several times and it went away. I didn't think much about it after that. Then two weeks ago, I was at a softball game for one of the kids and started feeling a funny pain in my left breast. It hasn't gone away. I was soon to start my period so I waited until after to see if it went away, it did not, so I went to see my gyn and she said she didn't feel anything concerning but I should have a mammo or a thermography scan since I'm due for one. I made the thermo appointment and it was for today. In the week between that appointment and this one, I have done a lot of feeling around on my breast trying to figure out exactly where the pain is coming from. I have a few lumps under the nipple I think would be the 6 o'clock position and it is tender to the touch and the pain sort of radiates around the bottom and up the inside of the breast. The last two days I have had a pulling feeling in my underarm on the left side and I think I have at least one swollen lymph node there. It slightly burns. Not bad, but t After reading the thread about if breast cancer hurts or not, I am terrified. Before I started my period it did hurt worse...but I think that was just from all the normal hurting it does two weeks before my period...It did hurt just to hug...the nipple itself hurt then...it doesn't now unless I hug real tight but I think it's coming from just below. I am scheduled to go for a diagnostic mammogram on Thursday. I feel so sick and worried. I have generalized anxiety disorder that either makes me over cautious or under cautious...depending on how I can handle things. I have a special needs kiddo that needs her mama and I just feel like if I didn't do the right thing in regards to thermo/mammo and something has gone undetected then it's my fault if it's worse case. I've read different places that cancer doesn't start to hurt until later stages so that scares me too. Really I feel like I'm on the edge. I keep trying to find other options to what this could be, but nothing rings true. And honestly after reading so many people going in and being dismissed or not finding anything on scans and then getting diagnosed months after their all clear...I wonder how in the world can you ever feel like the all clear is REALLY all clear? How do you know you can trust that? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "23/05/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855390",
    "Title": "New here and scared mama2mygirls keepthefaith"
  }]
}