{
  "AuthorID": "mamakaren",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
  "Posts": [
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Apr 16, 2009 10:29PM mamakaren wrote: Hello, I have four children and one of them is a 9 year old girl. I can't imagine what your going through but I do know that with our God all things are possible. Please get a second opinion just to confirm that it's not a mistake. Hoping to God it is. I'm here for you to support you in all this madness. What is her name so i can name her at prayer group. Many Blessings, Karen ",
      "MessageIndex": 66,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Sep 1, 2008 06:22PM mamakaren wrote: HELLO, I HAD A LUMPECTOMY 7 MONTHS AGO AND I STILL HAVE DISCOMFORT AND MY ARM FEELS NUMB ALL THE TIME. IT SEEMS TO BE MORE IRRITATED WHEN I DON'T HAVE A BRA ON. I HOPE YOU FIND SOME COMFORT.",
      "MessageIndex": 9,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720119",
      "Title": "Pain after a lumpectomy/re-excision? oldlady mamakaren"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Dec 28, 2008 02:52PM mamakaren wrote: I really hope that everything goes good for you. Let's pray that it is just residual tissue damage. I feel little lumps in my breast also but nothing that stands out of the ordinary. Please keep me posted. Lots Of Love,  Karen",
      "MessageIndex": 1,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726423",
      "Title": "New lump 4 months after completing treatments, any others? glostagirl apple"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "mamakaren wrote: I completed chemo and had my last radiation on Dec 16th and have been having swollen hands every night. I have been waking up just about every night with pain in my hand and wrist. My feet are also swollen. Also has anyones body been hurting? My body is more sore than when I was on chemo. If anyone's had this problem please advise me. \"When we face what we fear... We become fearless\" Dx 1/22/2008, IDC, 2cm, Stage II, Grade 3, 0/10 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726261",
      "Title": "swollen hands and achey body mamakaren linda05"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Dec 29, 2008 11:04AM mamakaren wrote: Hi Deanna, I just got out of my appt with onc and everything was good thank God! My heart EF went back to normal and they want me to start the Herceptin  tomorrow. Blood work was great also! The wrist and hand pain they say that it could be arthritis so they will do some blood work to find out other that they said take Tylenol. Penny, Don't get discouraged this is temporary, this is the way i see it. The amount of time it takes to cure our bodies that's probably the amount of time it's gonna take to heal our bodies. So take it easy (easier said than done) just trying to cheer you up!  I hope you find comfort. As for me I'm gonna stay on the once a week treatment then they will check me every two months. As i left the office i was thinking that i want to get checked every month just for my piece of mind. Lots Of Love Bald Hotties!! Karen",
      "MessageIndex": 6,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726261",
      "Title": "swollen hands and achey body mamakaren linda05"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Jan 26, 2009 05:03PM mamakaren wrote: Hey Penny, I also have the same pain and swelling and haven't been wearing my wedding ring either. they told me also that it has nothing to do with Herceptin but i all started @ 2 weeks before my last radiation, i was also taking Herceptin with rads. So i don't know which one did it, they say that rads stay in your body for a while after your done. I don't know if thats true don't know much about it. My rads doc said that it has nothing to do with rads because they only treat the breast so who knows I have my rads doc blaming my oncologist.  So how are you doing besides the hand nonsense??",
      "MessageIndex": 12,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726261",
      "Title": "swollen hands and achey body mamakaren linda05"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Aug 31, 2008 08:17AM mamakaren wrote: Hi daisyhope, This is my first time on this site. I was diagnosed with IDC in january of this year. I wish i could give you answers to your questions but the truth is that i don't even know much about my cancer, when the doctors explain things to me i's like i'm in another world and can't hear anything that they say. It's been sometime since my lumpectomy actually i had two lumpectomies also currently on chemo a total of eight. I also am desperate to talk to someone about what i'm going through, I still have'nt come to terms with my cancer but i think that we can help eachother out. I'm starting to learn morer about my diagnoses even though i get this sick feeling in my stomach everytime i try to read my pathology report or even talk about what's wrong with me. Just know that i'm praying for you and here for you. All i can say is that i have got this far by clinging to my faith.",
      "MessageIndex": 7,
      "PostDate": "31/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720390",
      "Title": "Nottingham grade: III of III - Mottingham score: 9 of 9 daisyhope Denise2730"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Nov 11, 2008 04:27PM mamakaren wrote: Starr, I finished chemo (taxatere) 7 weeks ago and I feel your pain. I have noticed since last friday my legs didn't hurt like they had been hurting. They still feel sore a little when I get up from sitting down but nothing like before it was very painful. I would take a hot bath and then massage my legs with alcohol and it would help me alot. Hope this helps you. Lots of Love    Karen.",
      "MessageIndex": 6,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723891",
      "Title": "ackes in legs please help with info starr BondoBaby"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "mamakaren wrote: I finished toxatere more than a week ago and I'm wondering if anyone has had the same problem and if it goes away within time or could it be permanent? I feel as if my legs are these tight rubberbands and I'm stretching them everytime that I walk. It's a very painful feeling, like a burning or cramping feeling. My body feels worse than ever, not even when i was taking the A/C was I ever this beat!! Then that dammmmmm toxatere!! I know that medicine makes a person very depressed and emotionally crazy, I'm trying to controll all these emotions but I just keep having a hard time. I hope that someone has some comforting words for me. thanks \"When we face what we fear... We become fearless\" Dx 1/22/2008, IDC, 2cm, Stage II, Grade 3, 0/10 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722331",
      "Title": "Pain !!!!! physical and emotional mamakaren kris60"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Sep 2, 2008 02:26PM mamakaren wrote:",
      "MessageIndex": 6,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720461",
      "Title": "My story PeaceCat judyr"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Jan 8, 2009 04:45PM mamakaren wrote: Debbie, Thanks for the good news! I'm glad to know that you are feeling better and you look great in your picture. I'm still having swollen hands but no arm swelling. I just hope it stops! Don't think i can deal with this pain another 9 months. Lots Of Love,   Karen",
      "MessageIndex": 10,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726261",
      "Title": "swollen hands and achey body mamakaren linda05"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Nov 22, 2008 12:43AM mamakaren wrote: Hi, Congrats!!! I can imagine the excitement you felt when you heard that. If you trust your onc then don't push it. Maybe he thinks it will do you more harm than good. If he says there is no harm in doing it then you should heck 1% is 1%! Talk to you soon, going to Phoenix tomorrow my son has a football game. We are hoping to win State! He is 12 yrs and he is so pumped up about it. Hope you are at peace with your onc decision. Lots of Love,    Karen",
      "MessageIndex": 1,
      "PostDate": "22/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/724838",
      "Title": "boosts with 3 week protocol ? boobytrapped mamakaren"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Oct 24, 2008 11:32PM mamakaren wrote: OMG! yea that's happening to me now, I ended chemo sept 24 and am on herceptin i've had 5 treatments but still need a whole year. My hot flashes started after i started taking taxotere and have had hotflashes ever since. It feels awful like i'm gonna go crazy! The hotflashes feel as if im in a sauna and feel like I'm gonna faint. So i feel your pain my oncologist told me to take vitamin E since I can't take anything else because i'm her2+. I'll let you know as soon as I try it. I hope that you feel better.",
      "MessageIndex": 3,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723057",
      "Title": "Stinging hot flashes anyone? Sheilaps mamakaren"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Dec 26, 2008 08:53AM mamakaren wrote: Deanna, Hello hope you had a great Christmas. All I can say is that we all have been blessed to be alive here with our loved ones. Yes I was on Taxotere but now i'm not taking anything since the Herceptin. It's been almost 2 weeks since i've been off Radiation also. To think of it all this started towards the last 2 weeks of Radiation, the last one was on Dec 16th. My bones have never hurt like this not even when I was chemo. Monday I go to my Onc appt to see what the heck is gonna happen with that Herceptin. I'm glad that you didn't have arthritis I hope I don't. I'm gonna take vitamins and B6. I want to take so many things but i'm afraid to. My onc said I have to watch what i take and make sure that they don't have hormones in it. Due to the fact that I'm HER2+ so that really freaked me out. Hope you have a blessed Holiday! Lots Of Love, Karen",
      "MessageIndex": 3,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726261",
      "Title": "swollen hands and achey body mamakaren linda05"
    },
    {
      "AuthorID": "mamakaren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71468/profile",
      "Content": "Jan 6, 2009 09:27PM mamakaren wrote: Penny, Just wondering if you still have swollen hands? I can't seem to get rid of it and my wrist is in so much pain! I can't even wear my wedding ring,  I thought i was gonna have to cut it off but lots of dish soap helped. I hope your doing great! Karen",
      "MessageIndex": 8,
      "PostDate": "06/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726261",
      "Title": "swollen hands and achey body mamakaren linda05"
    }
  ]
}