{
  "AuthorID": "Manc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261299/profile",
  "Posts": [
    {
      "AuthorID": "Manc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261299/profile",
      "Content": "May 6, 2018 03:38PM Manc wrote: hi YATCOMW as a fellow Grade 3 with a lovely family and a real fear of recurrence your post means so much thank you After the fear and horror of the cancer my big fear was not living and enjoying my day ever again. I'm slowly getting there but people like yourself help so so much x",
      "MessageIndex": 11,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/864397",
      "Title": "Found out primary tumor is 9 cm Magnolia-mom star2017"
    },
    {
      "AuthorID": "Manc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261299/profile",
      "Content": "Mar 1, 2018 12:42PM Manc wrote: Hi IAmElaine I love your oncologist quote emotionally I've had the hardest time I'm going to try to follow this philosophy. Did you find the recurrence fears a challenge at times .",
      "MessageIndex": 122,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    },
    {
      "AuthorID": "Manc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261299/profile",
      "Content": "Jan 21, 2018 01:51PM Manc wrote: hi 7of9 what a wonderful post. I'm Grade 3 in 2 nodes and terrified of recurrence you have given me a lot of hope that newer stats are more favourable. Can I ask by the Zometa is that the six monthly infusion which may prevent bone mets. Many thanks x",
      "MessageIndex": 105,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    },
    {
      "AuthorID": "Manc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261299/profile",
      "Content": "Aug 27, 2018 11:11AM Manc wrote: Hi all what a great thread I'm stage 2b 2 nodes 1 underarm 1 an interpectoral node so all scary stuff. I've finished all treatment now diagnosed November 2016 except Anastrozole and six monthly bisposphonate infusion. For the ladies struggling emotionally with recurrence fears i feel your pain. I never asked my stats but have entered them in the UK predict site. They aren't great and I've found it so hard to deal with. However to give you some hope I'm improving with this. I think time is the key here although my fear still lives with me daily it is easing and I'm actually finding i haven't thought of cancer for a few hours more and more i know this doesn't sound great but trust me for me it is . Keep going trust your team and treatment and hopefully we'll be posting success stories soon .",
      "MessageIndex": 2244,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Manc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261299/profile",
      "Content": "Feb 15, 2018 01:41AM Manc wrote: Thankyou wallan these posts from people doing so well long term mean so much. I'm over a year now aggressive grade three in nodes and hope to get there xx",
      "MessageIndex": 5,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862479",
      "Title": "New and emotional LastChild EastcoastTS"
    },
    {
      "AuthorID": "Manc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261299/profile",
      "Content": "Aug 7, 2018 05:09AM Manc wrote: Thanks for this made me feel more normal . When I was diagnosed i was so so angry. Used to hit the floor ! and curl up in a ball and cry it upset my husband so much but I couldn't help it. I had all these emotions and didn't know how to deal with them. Now I get angry when I see people I've not seen in a while I tend to hide where before I'd go and chat. I look from a distance and think all I've gone through and imagine how they still have a perfect life of course I could well be wrong there but it gets me every time .",
      "MessageIndex": 16,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866417",
      "Title": "Im starting to lose my sh@# Careninnj msphil"
    }
  ]
}