{
  "AuthorID": "mandals0810…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235701/profile",
  "Posts": [
    {
      "AuthorID": "mandals0810…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235701/profile",
      "Content": "Jul 8, 2016 05:10PM mandals0810 wrote: Yes! Got the call late this afternoon- Benign! Praise the Lord!! I can't remember what all she told me- all I heard mainly was benign and not cancer! She mentioned fibrocystic changes and hyperplasia. I follow up with the surgeon in 3 months and have another mammogram in 6 months",
      "MessageIndex": 6,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845776",
      "Title": "34 y/o BIRADS 4 mandals0810 marie5890"
    },
    {
      "AuthorID": "mandals0810",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235701/profile",
      "Content": "mandals0810 wrote: On June 29, I went to my ob/gyn because I was having pain in my left breast and was worried it was a lymph node. She immediately sent me to the breast center where I had a mammogram and ultrasound. Nothing was found where my pain was (and the pain has since resolved) ButThey have a radiologist that reads the mammograms immediately and they provide you with results before you leave. I had micro-calcifications that were a \"loose group of variable appearing calcifications\" my report also said they were indeterminate calcifications a biopsy was scheduled, and I had it on July 5th. Stereotactic guided vacuum assisted technique.... My mammogram after the biopsy showed that they removed all of the calcifications and the marker is in place. I was told by the breast health navigator nurse that my results would be in today (Friday 7/8) However she called me this morning and told me the results were not back yet, but she still expected them today. I'm on pins and needles waiting for that phone call! I am PRAYING hard they call me today, I even took off work today, just in case of bad news because I didn't want to get that phone call at work. :( Just looking for support and encouragement while I wait!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845776",
      "Title": "34 y/o BIRADS 4 mandals0810 marie5890"
    }
  ]
}