{
  "AuthorID": "MandaB87",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95985/profile",
  "Posts": [{
    "AuthorID": "MandaB87",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95985/profile",
    "Content": "MandaB87 wrote: My sorority's national philanthropy is the American Cancer Society, and I frequently get emails from my sisters encouraging us to do breast self exams. I finally took the advice, and gave myself an exam four days ago. Four days ago, I also found a very large lump in my right breast. Accompanying the lump was the occasional brown discharge. The lump is new, but the discharge has happened several times before. It was never frequent enough for me to think anything of it, and its never very much; the most was the size of a quarter.  I immediately made a doctors appointment, and he did a breast exam. Fibrocystic Breast Disease and Breast Cancer both run in my family, and the doctor is worried because my symptoms don't make much sense to him.   The lump is hard and large, about the size of a ping pong ball, and doesn't move. The symptoms are only in the right breast, and there is no tenderness or inflammation, even during my period. There is no lump in the left breast at all. There was no pain before the breast exam, but now two days later, there is pain and putting any pressure against it (including a bra) causes discomfort. This all confusing to myself and the doctor because :I'm 22 years old, I don't have any children, I've never been sexually active, I don't drink caffeine at all. I don't really fit the symptoms for any disease specific, but it does seem that cancer is the most fitting. Im scared, but I'm not taking it lightly. My doctor's visit was Friday, and he referred me to a surgeon. She isn't in on the weekend, but I will be calling her first thing in the morning. My question for all of you is, what are the chances of someone my age actually having breast cancer? If it does turn out to be cysts, I do plan on having them removed, because I do not want to risk anything later. I'm slightly freaking out, but I'm trying not to because I don't want to worry about nothing.  What should I ask the surgeon? Any advice from anyone? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "17/01/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746925",
    "Title": "Scared and unsure MandaB87 idaho"
  }]
}