{
  "AuthorID": "Mantra",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
  "Posts": [
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 3, 2009 09:13PM Mantra wrote: I had 3 nodes removed and am trying to follow the steps to prevent lymphedema. No blood pressure/needles/IV in affected arm. Slowly returning to exercise once I'm healthy enough to do so. It actually makes me nervous to wear my rings too. I'm still researching about flying and given the difference in opinions, knowing what to do to prevent lymphedema during flights is making me a bit nervous.",
      "MessageIndex": 5,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/741383",
      "Title": "Susan Love proclaims no need for lymphedema risk reductions kira TammyLou"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 4, 2011 03:49PM Mantra wrote: My sister really appreciated offers from family and friends to drive her to her chemo treatments and to pick her up as well. People have also volunteered for her radiation treatments which should start in January. In addition to worrying about her own health, she has been very worried about the stress on her DH (who has his own health issues) and knowing he can have a day to himself has made her so thankful. She also enjoys when people bring them lunch or dinner; again to give her DH a break. He's been unbelievably supportive and attends a caregivers group, but has also been so thankful for these offers. She was also thrilled when someone knitted her a monogrammed sleep cap!",
      "MessageIndex": 10,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775931",
      "Title": "What to include in a care package for a friend? GreenSeaTurtle nicholewilliams"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 5, 2010 09:25AM Mantra wrote: I was on Gabepetin (sp?) for about 3 weeks. It helps with the tingling, stinging nerve pain. Once stopping, I really didn't have any more pain.",
      "MessageIndex": 3,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758921",
      "Title": "Been 3 wks.--what's \"normal pain\" after BMX? Joanne58 Joanne58"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 6, 2011 08:47PM Mantra wrote: I took Gabapentin for about three weeks and was then weaned off of it. Definitely was helpful in my case.",
      "MessageIndex": 4,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765786",
      "Title": "Nerve Pain post BMX with Axillary Dissection Question HollyinMich dannade"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 25, 2010 09:24PM Mantra wrote: I bought a pair of silocone foobs from Walmart. Because I had a tissue expander, I figured it wasn't worth ordering custom made since my shape would change each week. My daughter said to go to Walmart and buy these silicone foobs that she has seen there. I bought a pair (only come in pairs) and I could not believe how perfect a fit it is. It's the exact same size as my natural breast, feels light and looks perfectly natural even when wearing a tight top and I believe I only paid $30. I use them with mastectomy bras and am very pleased with the results. In fact, when the fitter at the mastectomy shop saw it, she was shocked at how perfect it fits. She asked me where I got it because quite often women can't afford custom made (even with gov't subsidies) and she wanted to be able to give them an option. Of course, since they only come in two sizes, they wouldn't be suitable for everyone.",
      "MessageIndex": 36,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/749767",
      "Title": "Why do I \"need\" $$$ silicone breastforms? lovemygarden lovemygarden"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 6, 2010 09:04PM Mantra wrote: My surgeon said I will still need to get a mammo ever after a mastectomy. I went for my very first digital mammogram at PMH this week. Wow . . . I have never had a more thorough mammogram in my life. The radiologist also told me my breast tissue extends into my back (much further than most of the population). They could only do the mammo on my right breast and said they will do my left breast once the tissue expander has been replaced. I'm a little freaked out because if my breast tissue extends into areas that my first surgeon wasn't aware of when she did the mastectomy, it means I must have all that breast tissue still in place. Just what I need . . . something else to worry about",
      "MessageIndex": 10,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/750565",
      "Title": "This May Sound Silly amlg1 Musical"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 15, 2011 09:24PM Mantra wrote: When you call your doctor's office, does it tell you what to do in case of an emergency? Go to ER? Page the doctor? Call a different doctor? I'm not sure I'd want to leave it all weekend but perhaps call the office and see what the message tells you to do in.",
      "MessageIndex": 2,
      "PostDate": "15/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767649",
      "Title": "Infected Stitch? Scared! hopeful34 hopeful34"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jan 25, 2010 03:29AM Mantra wrote: I have calcifications in my right breast and have had them for years. However, the doctors said that the pattern of them indicates they are nothing to worry about. However, the calcifications that showed up in my left breast was in a pattern that indicated cancer. I googled calcifications and read about this when I was first diagnosed so you might want to do that as well. Fingers crossed for benign results from your Feb 4 test. I know the waiting is awful. Luckily, I was able to have my stereotactic biopsy within days.",
      "MessageIndex": 1,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/747274",
      "Title": "CALCIFICATIONS Mollydog Makratz"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jun 29, 2011 08:30AM - edited Jun 29, 2011 08:33AM by Mantra I too had high grade DCIS in two quadrants of my breast. Also multifocal (8 tumors). I am also ER/PR negative. My surgeon told me that if cancer is all DCIS, then being ER/PR negative is not important. She said it only becomes an issue if the cancer is invasive. The oncologist agreed. I think if I had been ER/PR positive, I would have had tamoxifin but I honestly can't remember that part of the conversation. My lumpectomy was crossed over two quadrants. Given the number of tumors found, the grade of them and the ER/PR negative status, plus one small margin, my surgeon wasn't sure which route to go.The options were cutting more away or having a mastectomy. She was really hesitant to recommend a mastectomy in my case but put my case before the tumour board. All 10 board members agreed that a mastectomy was the route to go. I had a mastectomy and they found zero cancer. So in reality, I needed nothing more than the original lumpectomy. That said, I don't regret my decision and actually had a PMX 6 months later. I just couldn't handle worrying all the time. I didn't want to have radiation either. When I first met the surgeon I said \"I want a mastectomy\". Her attitude was that my decision was fear driven and she felt she could get it all with a lumpectomy. She said \"we can always go back and do a mastectomy, but we can't undo one.\" She felt breast conserving surgery is what we strive for but sometimes a mastectomy is necessary. Where I live, they don't test pure DCIS for Her2 status so I'm not sure what mine would have been. It's normal to be scared sh$$tless!! I was a basketcase (to put it mildly). My daughter developed panic attacks as well although she has chosen to treat them without drugs. My grandchildren knew and they tried to learn everything they could about cancer. In fact, my 5 year old grandson was so devoted to helping people understand breast cancer he actually gave a speech to his school. He said it was the best speech ever (he's obviously anything but shy!). He said at least 50 people asked him questions and he knew all the answers. And he called the speech \"my hero\" and devoted it to me. He was also very moved by his teacher who hugged him with tears in her eyes and said she was incredibily proud of him. And like you, I had two dogs and was panicked that DH would not baby them like I did if something happened to me. Here I am, one month shy of my two year cancerversary. I recently went back and read my blog . . . OMG I was really a basketcase. I then spent the first year convinced every pimple, bug bite and pain was cancer. Now, I don't really think about it. The fear is never completely gone but I rarely think about it anymore. Take a breath. Learn what you can. And make informed choices. These boards were invaluable to me during my journey. Diagnosis: 7/10/2009, DCIS, <1cm, Stage 0, Grade 3, 0/3 nodes, ER-/PR-",
      "MessageIndex": 5,
      "PostDate": "29/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770909",
      "Title": "DCIS High Grade Non Estrogen NYruralrider nanadeb"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 10, 2011 09:18PM Mantra wrote: I have tried several custom made sleeves. After trying them on for 5 minutes, my arm and hands get rashes and welts. I don't have LE so I really just bought the sleeve as a precautionary measure in case I need to fly. The sleeve I kept is a Mediven. Still causes rashes but ran out of options so I kept it.",
      "MessageIndex": 9,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/765842",
      "Title": "Allergic to compression sleeve? heatherot KittyDog"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 23, 2010 09:34PM Mantra wrote: I also read The Help and recommend it. A couple of other great books are \"The Book of Negroes\" by Lawrence Hill. Amazing story! Another wonderful book by a Canadian author is \"Fall on your Knees\" by Ann-Marie MacDonald.",
      "MessageIndex": 663,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Nov 6, 2010 11:50AM - edited Aug 20, 2013 03:06AM by Mantra Athough he won't be allowed in the room while you're having the dye injection. once that is finished, I can't see any reason why you won't be able to be with him until you are wheeled into the OR (unless for some reason your hospital doesn't allow this). I can't imagine a hospital not allowing at least your DH to be with you.  I've had 3 different breast surgeries (one included a SNB), each at a different hospital and DH was right beside me each time until I was wheeled into the OR.",
      "MessageIndex": 2,
      "PostDate": "06/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760401",
      "Title": "? about SNB momof3sofar fire-dancer"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jul 16, 2011 03:27AM Mantra wrote: My pathology report was similar although in my case micro invasion could not be excluded rather than vascular. I had 4 different surgeons tell me I was a fool to wait and infact the surgeon who did the surgery said she was bumping someone else do do mine. The grade 3, comedo necrosis, and possible micro invasion put everything into motion very quickly. I personally would be very concerned about waiting with possible vascular invasion and grade 3 comedo necrosis. I would want to get it out ASAP rather than risk it spreading. Mine turned out to be ER/PR negative. I only have to look at my sister whose cancer went from 0 to 100 so quickly that everyone including the doctors were shocked. The cancer was found May 5 and by June 15 (date of surgery) it had already spread to 16 nodes. Her cancer is Her2 positive; not sure what yours is.  She is likely stage 4 but we won't have the scan results until Wednesday. I can tell you that she would give up vacations, money, or anything else if she could turn back the clock. Try and take out the other equations (vacation and financial) and see if you still feel waiting is the right answer. If it is, then you've got your answer.",
      "MessageIndex": 6,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771682",
      "Title": "AM I REALLY THAT STUPID?? NEED LOTS OF ADVICE! rn4babies rn4babies"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jul 17, 2011 06:49AM Mantra wrote: Before being dx with BC, I found what turned out to be basal cell carcinoma on my scalp. I was leaving the country the very next day. He couldn't do the surgery for 3 weeks. I told him I heard basal cell is no big deal and we'll do it when I get back in four months. He looked  at me like I had lost my mind and said . . . true, basal cell is not urgent, however, if you think I'm going to let you walk around with it for 4 months, you had better find yourself another doctor. I said I was leaving the next day for 4 months. He said there is a wonderful invention called airplanes and to book myself a ticket and be back on the day before surgery and be prepared to stay here in the country for 7 days. I was not happy but figured better safe than sorry.",
      "MessageIndex": 15,
      "PostDate": "17/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771682",
      "Title": "AM I REALLY THAT STUPID?? NEED LOTS OF ADVICE! rn4babies rn4babies"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Nov 1, 2010 08:48PM - edited Aug 20, 2013 03:04AM by Mantra My sister had a biopsy and breast ultrasound. Her famly doctor told her that he couldn't see her for a month but would call if anything showed up on the report. I drove her crazy and kept forcing her to call the receptionist to at least ask if the results were in. She called once and the receptionist was beyond rude and told her that if something was wrong, they would call her. Another week passed and I told her to call the receptionist again. She said she didn't want to upset the receptionist. Three weeks later I was ready to drag her to the doctor just to see if the results were in. She finally agreed to call the hospital to check if the results were faxed to her doctor. They were apparently faxed within days of the biopsy. Again, I'm begging her to call the receptionist to tell her that the results must be lost because they should have had them two weeks ago. Again, she didn't was to upset the receptionist!!! When she went to see the doctor a month after the biopsy, the doctor said he never received the results. He called the hospital, had them faxed over and thankfully everything was negative. I on the otherhand get copies of absolutely any and everything. Blood tests, CD of ultrasounds . .  if it's a test . . . I have a copy of it. I also insist on getting my results regardless of whether they are fine or not. I want a phone call. This crap about no news means good news is ridiculous. It could mean the doctor never got the results, or she missed something. Calling and getting a copy forces them to relook at the results because they don't want legal issues if they fax you results that had something wrong and they overlooked it. Of course, everything has to be done sweetly and non threatening. Every doctor I have gone to has the same note posted \"being rude to the Doctor or any member of the staff may result in you being dismissed as a patient.\" I do love our Canadian health care system but some of it is ridiculous. Do your family doctors have the \"three issue rules?\" It means if you have more than three problems, you can only discuss three of them and have to set up another appointment to discuss the fourth issue. I was on a wait list to get a GP in my town. In the meantime, I drove 1 hour to Toronto and 1 hour back to see my family doctor (I had moved away from Toronto). I remember I had 4 small issues to discuss (saved them up because of the distance). The doctor said \"choose three and set up another appointment for the 4th.\" No way was I driving back for a sore wrist so I went to a walk in clinic in my town. The doctor freaked because he has to pay if you go to a walk in clinic. Too bad . . . my time is worth money and gas is expensive. So I'm getting my just desserts for you being an idiot . . . my family doctor for over 15 years! I never went back.",
      "MessageIndex": 5,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760168",
      "Title": "Frustrated in Toronto kittymama kody22"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Feb 9, 2010 02:15PM Mantra wrote: I'm normally a very private person. However, when I told my family and close friends, I could see that they really had the need to talk to their own group of friends in order to help them cope. To help them through it, I told them that they could tell whomever they needed to tell and that it wasn't a secret. This was my way of helping them cope with the news and for their friends and co-workers to understand what they were going through. I was the one with cancer; but they were the ones who had a wife/mother/sister/friend/co-worker with cancer. But it's a totally individual decision. No, I'm not thrilled that half the world knows I had a mastectomy but they do, and I just accept that people know a little more than I'm comfortable with. But because they know, they are always looking out for me and will jump in and lend a hand when I need something heavy lifted etc. etc.",
      "MessageIndex": 9,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748079",
      "Title": "Who and when to tell? wyldblumusic Frapp"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 7, 2010 08:40PM Mantra wrote: I thought about you today and all that you went through. I'm thrilled to hear that things are moving forward. I have to echo what Lisa1962 said about respecting your surgeon's decision  not to the surgery without having complete knowledge of exactly where the problem is. Will your surgeon get the results of your tests immediately?",
      "MessageIndex": 8,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750868",
      "Title": "No surgery today...fluid now leaking from 2 ducts? Chancesmom CrunchyPoodleMama"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Nov 2, 2009 11:04PM Mantra wrote:",
      "MessageIndex": 4,
      "PostDate": "02/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/743184",
      "Title": "Dental cautions? Mantra Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 22, 2010 12:06AM Mantra wrote: I saw my BS about a month after surgery and my next visit is in December (8 months post op). She said normally she sees patients at 6 months and then annually but personally I would prefer to see her every 6 months. I don't know if she will request an MRI but I definitely want them to be part of my regular follow ups. She also did my colonoscopy. She's two hours away but I just feel better having a top BC surgeon being part of my team rather than my very inexperienced family doctor. However, being in Canada means there is no out-of-pocket expense and I may feel differently if money were a factor.",
      "MessageIndex": 30,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759540",
      "Title": "Follow up with surgeon for 5 years? Why? Halah Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 26, 2010 11:23PM Mantra wrote: I think my PS only does breast reconstruction. That said, I was very tempted to ask her if she does other work. A little nip and tuck would be nice.",
      "MessageIndex": 34,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759540",
      "Title": "Follow up with surgeon for 5 years? Why? Halah Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Feb 23, 2010 12:32AM Mantra wrote: I very rarely remember my dreams and seem to only remember those that are full of very bright colours.",
      "MessageIndex": 3,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748785",
      "Title": "When you dream, do you have breasts or not? barbe1958 barbe1958"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 6, 2010 01:00AM Mantra wrote: When I was younger, I used to have a falling dream every night. In most of them I was on a stretcher and the legs of the stretcher were about 30 feet long. All of a sudden the legs would collapse and I would fall. I have had the falling dream as an adult too. I'm sort of suspended in mid air and then woosh . . . I sort of glide/fall down. I've always considered this dream as the adult version of my falling dreams but perhaps it is really more of a flying dream. Not sure. I only remember these split second dreams because I lose my stomach when I head downward and it scares me just like a rollercoaster ride does. Hmmm, I'll have to google \"night flyers\".  Okay, still trying to see whether I have breast-off or breast-on dreams, but so far no luck. However, on the rare occasion when I do recall a dream and the dream has body parts in it . . . uhmmm . . . they aren't mine! To paint a picture . . .  I don't even own this piece of equipment!!   'nuff said.   ",
      "MessageIndex": 24,
      "PostDate": "06/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748785",
      "Title": "When you dream, do you have breasts or not? barbe1958 barbe1958"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Sep 5, 2009 01:09AM Mantra wrote: When I was first diagnosed, DH and I discussed a mastectomy. We knew the tumor was agressive and didn't want to take any changes. The surgeon felt we were jumping the gun and instead talked us into a lumpectomy. She used the argument that we can always do a mastectomy but we can't undo one if it turns out a lumpectomy would suffice. I agreed, but now having 20/20 hindsight, I wish I had gone with a mastectomy. DH and I talked at great lengths about each of your reasons and decisions for having or not having a second mastectomy. In his opinion, he absolutely hates seeing me like this and said get rid of the breasts, ovaries and whatever else is necessary to get rid of this beast called cancer. He said he truly wishes he could do something yet feels totally helpless and frustrated at his lack of being able to do something tangible.  He asked a few questions to help me in my decision making process. The first question was,\" you have now had both breasts removed, the post op pathology report shows NO additional cancer was found in your left breast and NO cancer at all was found in your right breast. Tell me how you will react to that news. Without hesitation I said I would be 100% fine and would go out and celebrate. He said then that is the answer and we need to have this plan in place when we meet with the surgeon so neither one of can be talked out of it. We've made our decision. We feel the cancer is too aggressive to have a wait and see attitude. We need to be just as aggressive. That means a double mastectomy. He knows that I am going to have some emotional issues about this sometime down the road and his attitude is let's deal with what is real . . . you have breast cancer. Let's get rid of it and deal with whatever happens, if it happens instead of worry about  it now.",
      "MessageIndex": 9,
      "PostDate": "05/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739956",
      "Title": "What made you decide . . . Mantra Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Sep 12, 2009 12:04PM - edited Sep 12, 2009 12:05PM by Mantra",
      "MessageIndex": 20,
      "PostDate": "12/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739956",
      "Title": "What made you decide . . . Mantra Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Sep 14, 2009 10:30PM Mantra wrote: My surgeon had told me from day one that she would only do two lumpectomies and if a third surgery was necessary, a mastectomy would be my only option. In my case, I've skipped the second lumpectomy and am instead having a mastectomy. It was what the Tumour Board recommended and what I wanted from day one. Am I thrilled about it? NO!! But I need to get on with my life and another lumpectomy would just not make me feel comfortable and confident that they got it all. What grade is your cancer? If it is grade 1, I might risk it another lumpectomy. Mine is DCIS grade 3 and it is also ER/PR negative so I can't risk it becoming invasive and only hope that if any more cancer is found, it is still DCIS.",
      "MessageIndex": 28,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739956",
      "Title": "What made you decide . . . Mantra Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mantra wrote: Before being diagnosed this summer, I had a couple of small fillings that I needed to get done in addition to a crown. I cancelled the appointments after being dx. Now that my surgery is over and things have stabilized, I can't avoid this any longer and as much as I hate going to the dentist, I know I need to get the work done. That said, what precautions are needed? Can having an injection to freeze my mouth cause lymphedema? Should I take antibiotics? Dx 7/10/2009, DCIS, <1cm, Stage 0, Grade 3, 0/3 nodes, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/743184",
      "Title": "Dental cautions? Mantra Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mantra wrote: to have a double mastectomy? I am having a left breast mastectomy following a lumpectomy that didn't quite give margins that we expected. My lumpectomy showed DCIS (stage 0), but grade 3 with multiple tumors (two quadrants) and ER/PR -.. I am hoping that the mastectomy will either show no additional tumors or that at worst, they are DCIS given the ER/PR- pathology report. I know many women here have had both breasts removed. Did you have it because you had cancer in your second breast? Is it because you had genetic testing that showed BRCA 1 or 2 positive?  Or is it strictly a preventive measure taken even though cancer was only in one breast. I have not had genetic testing . . . yet. I will have it done but the process will not have even begun by the time I have my mastectomy on my left breast. I will also have an MRI . . . again, my surgery appointment will be before the MRI. So in my case, having a right breast mastectomy will not be done at the same time. But if my MRI is clear and genetic testing is negative, I'm not sure whether having the second breast removed is overkill or whether it is a prudent decision. Opinions? Dx 7/10/2009, DCIS, <1cm, Stage 0, Grade 3, 0/3 nodes, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739956",
      "Title": "What made you decide . . . Mantra Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 1, 2010 10:50PM Mantra wrote: Barbe The power of suggestion. A week ago I mentioned in your post thatI never remember my dreams. Yet two days ago I had a dream that I cut my bangs and left the middle section noticeably shorter. Fast dream; that's all I remember. Then this morning I had another dream. DH came home with a banana puree machine. Have no idea if such a thing even exists. It was stainless steel and had about 25 different huge pieces and I'm in bed but hearing all these noices coming from the kitchen. I got out of bed and stood and watched as all these neighborhood men were shouting instructions to eachother as to how to put the machine together. My kitchen was a mess (which was stressing me out since appently even in my dreams, having a clean kitchen is a top priority. I'm giving DH the evil eye and telling him this is the stupidest thing he has ever purchased and what in the world would we ever need it for. However, the neighbors were busy putting together all the stainless steel pieces and thought it was the coolest kitchen appliance ever. For a second I thought \"okay, this is a memorable dream but not boob related dream\" but suddenly I realize I am wearnig a t-shirt and haven't put in my prosthetic so I'm really lopsided. This sent me over the edge, I yelled at the neighbors to get the hell out of my kitchen and reprimanded DH for not pointing out to me that I was walking around lopsided. So uhmmm . . . thanks Barb, I've gone from having no memorable dreams to having extremely annoying ones.",
      "MessageIndex": 7,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748785",
      "Title": "When you dream, do you have breasts or not? barbe1958 barbe1958"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 2, 2010 03:34PM - edited Mar 2, 2010 03:35PM by Mantra Barbe - When I get back to Barrie, I'm going to come hunting for you!! OMG. I cannot believe that I woke up this morning after having another memorable dream. You must have super powers or else I am probably the easiest person in the world to hypnotize. It was actually quite an interesting dream. I'm down south and our community only allows single storey homes & obviously we have no basements here in Florida. So somehow I woke up this morning after realizing that my next door neighbors (who are also Canadian!!) have actually built a second storey on their house and masked it by using a false roof line. What a brilliant idea. Now I want one too!! But DH told me to go back to sleep until I could dream of a way to do it without a building permit and without anyone from the association seeing it being built. Hmmm, any suggestions oh dream-master?",
      "MessageIndex": 16,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748785",
      "Title": "When you dream, do you have breasts or not? barbe1958 barbe1958"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Feb 20, 2010 04:12PM - edited Feb 20, 2010 04:14PM by Mantra",
      "MessageIndex": 9,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748607",
      "Title": "Help....Verizon is so insensitive to their employees Ready2Win 3katz"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mantra wrote: Last September, I had a mastectomy. I was told our hospital was being renovated and therefore things were not as usual. The area where patients changed and waited for the consult with the nurse was very small and family/friends could not come in and we were told we would see them just before being taken into surgery. I was not happy about this, but understood. I changed, sat in a waiting chair and I could feel myself ready to lose it. I told the volunteer I needed to tell DH something and I would be right back. She said I could give the message to her and she would pass it on to him. I sat down, looked around and everyone was pretty calm. I was sad and seconds away from crying. So I sat in a chair in the corner and let the tears flow quietly. The volunteer saw me, and asked if there was anything she could do for me. Through very quiet sobs I said \"I want my husband and daughters. I just can't be alone.\" She got a hold of a nurse and told the nurse to see me next, got DH and brought him in, told my daughters they couldn't come in but she would send me out to sit with them and ushered me into a private corner of the waiting room. She held my hand, let me cry on her shoulder, hugged me and sat with DH and me until the nurse took all my info and provided me with a sedative. She then brought me out to see my daughters and said I could sit with my family instead of sitting in the waiting room. I guess having a crying patient sitting in the same room as people who were having that surgery that day was upsetting to others. Regardless, she handled it so well and my family said that she kept coming out to check on them throughout the day. Hats of to these wonderful volunteers! Dx 7/10/2009, DCIS, <1cm, Stage 0, Grade 3, 0/3 nodes, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749759",
      "Title": "Applauding our hospital volunteers Mantra Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 3, 2009 11:24PM Mantra wrote: BMac - what's MLD?",
      "MessageIndex": 19,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/741049",
      "Title": "Close Call BMac kira"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Nov 17, 2009 03:02PM Mantra wrote:",
      "MessageIndex": 5,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/743779",
      "Title": "travel tips? Leah_S janette2007"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Dec 2, 2009 12:08AM Mantra wrote: When I was dx, my grandchildren were 3, 4 & 5. My daughters told them grandma is sick and that I would be having surgery.  They did not say that I had cancer. My 5 year old grandson saw a pink stone heart at the store and asked if he could buy it for me. He gave it to me and I told him I took it with me into surgery and held onto to it because it made me feel like I was hugging him. He was very happy about that. About a month after surgery, when he was over one day, he picked up the heart and said \"if you had died in surgery, would papa have remembered to put the heart in the box . . . you know that box they put you in before you go into the ground?\" I was rendered speechless . . . I had no idea that he even associated my illness with being that serious. I spoke to my daughter that night and let her know that obviously he knows a lot more than what he's been told. I guess he overheard his parents discussing breast cancer. Knowing this, they now sat him down and answered all of his questions. He is now 6 and I was extremely honoured when he told me he was doing his oral presentation on grandma and breast cancer. Here was a 6 year old boy standing infront of his grade one class discussing breast cancer. He said the presentation was amazing and that every single classmate asked him questions about breast cancer. He said no one ever asks questions after an oral presentation but everyone asked lots of questions after his. He said \"not just a couple of kids . .. EVERYONE!! His teacher gave him top marks and said she was very proud of him and that his topic of choice was extremely important and that his knowledge was impressive. He is so involved in this and took part in the CIBC Run for the Cure. He made t-shirts for the run and even though he said the run was boring (well at least he's honest!!), he understood that it was extremely important to be there so he could raise money and support his grandma.   He is anything but shy and loves nothing more than having an audience and I hope he continues to share his interest with all who will listen. Getting the next generation involved can only help in bringing us one step closer to a cure.",
      "MessageIndex": 20,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744671",
      "Title": "Feeling Guilty Pure Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Sep 10, 2011 01:00AM Mantra wrote: I always wear mine. I upgraded and it's pretty so I don't mind wearing it. I have it because I had lymph nodes removed so it says no blood pressure, IV or needles in left arm. Before this I had a different one that also included - no MRI. I had tissue expanders and couldn't have an MRI.",
      "MessageIndex": 6,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774438",
      "Title": "Medi al alert bracelet or some such thing K-Lo Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Sep 28, 2009 08:16PM Mantra wrote: I ordered a medic alert bracelet to wear as a reminder. I'm left handed and had 3 nodes removed in my left arm. I figure the alert bracelet will either remind me or remind the person taking my blood pressure etc. As long as it causes one of us to remember, it will have done its job.",
      "MessageIndex": 16,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/741049",
      "Title": "Close Call BMac kira"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 27, 2010 11:37PM Mantra wrote: Scheduled for April 16: Right breast proph mastectomy with either tissue expander or Alloderm. Left breast tissue expander to be removed and replaced with another tissue expander (first one was positioned incorrectly).",
      "MessageIndex": 28,
      "PostDate": "27/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 15, 2010 12:04AM Mantra wrote: I too am doing the last minute errands. Yesterday I went on the impossible mission of trying to find short sleeve, comfy cotton PJ with buttons all the way down the top. And to add to the list of restrictions, they had to have capri bottoms since I'm short and long PJ are a tripping hazzard! Went to 5 stores. Finally drove to the next largest town and found one pair. Couldn't believe I spent $45 dollars but desperate people do desperate things. Then I decided to spend another $78 on a new bathroom. Plus has to buy a $70 on a surgical bra that I was told I need to bring with me to the hospital. I'm running on pure anxiety. Tonight I was in a bitchy mood. So I found an email I sent to myself about 6 months ago. It was the article from breastcancer,org. The one that first made me decide to go ahead with the prophylactic mastectomy. After re reading it, I now know it is the right decision for me. I've always kept an online folder of what I consider \"powerful articles.\" Articles that caused me to want to change my life, did change my life or articles I know I will need in the future to help me get through something. This article is just was the doctor ordered. Unfortunately, filed right next to that article was the article I kept called \"how to know when it is time to let your dog die with dignity.\" Not exactly the article I wanted to read tonight . . . but I did. So of course I got all weepy. I NEED CHOCOLATE!! There is none in the house! Am I desperate enought to run out a 1 AM to buy some? Hmmm, let me think about it. Good luck to those having surgey this week. Looking forward to comparing notes.",
      "MessageIndex": 172,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Feb 18, 2011 01:52AM Mantra wrote: I had a lumpectomy, followed by a mastectomy followed by a PMX mastectomy. The lumpectomy did infact get all the cancer however, the tumor board really had doubts that all of it was removed. They recommended a mastectomy. No additional cancer was found. In my case, if I had not had the mastectomy, I would have lived in constant fear. My cancer was grade 3, 8 tumors, multi quadrant and ER/PR - . I was told to expect invasive cancer as well as DCIS. However, the mastectomy showed no invasive cells and no additional DCIS. I think the decision to have a mx over a lumpectomy is a personal one. But it is also governed by so many other things. Although I wish I never had to have a mastectomy, I can honestly say I have never regretted it. I've had great results with implants but of course they can never even begin to replace the real thing. It took me a while to transition myself into accepting them. For me, the BMX has given me peace of mind. The aggressiveness of my cancer combined with it being ER/PR negative outweighed the downside of having a BMX. It's one of those decisions that I'll never know if it was right or wrong. I do miss my real breasts but I don't miss the fear they caused me to have. I don't think any woman is thrilled about having their breasts removed. It's like bad news followed by even more devasting news. It took me 6 months to decide to have the \"healthy\" breast removed. I vacillated a lot. But once I made the decision to go ahead, I never looked back. I knew it was the right decision for me.",
      "MessageIndex": 13,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765075",
      "Title": "What were the reasons that you had a MX versus a lumpectomy geogal anneflorida"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jun 25, 2011 12:30AM - edited Jun 25, 2011 12:30AM by Mantra Again, thank you for your support. Just to let you know, my sister said the removal of the staples was not nearly as bad as she had anticipated. The nurse was surpised that the underarm had 7 staples and she did have some trouble removing those. My sister was unable to lift her arm and she also has a lump of fluid build up so there may be some hidden. The nurse has arranged to see her weekly until things heal and she will also be the person given her the shots. I was really surprised that the shots are $3,000 each!! From what I gathered from the conversation, OHIP will pay for only a certain shot but won't pay for the one my sister will be receiving. They have a private health care plan so thankfully the expense will be covered. She's feeling pretty good now that the drains and staples have been removed and her first outing will be to a mastectomy shop.",
      "MessageIndex": 15,
      "PostDate": "25/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770719",
      "Title": "Staples or stitches? Mantra anumacha"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Aug 5, 2011 11:37PM - edited Aug 5, 2011 11:38PM by Mantra An MRI showed my sister had one positive lymph node. She actually had 16 positive nodes.",
      "MessageIndex": 2,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772737",
      "Title": "Can a MRI detect cancer in the lymphnodes? dgmlmax coraleliz"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Dec 30, 2010 11:16PM Mantra wrote: When I was going through my cancer journey, I had a page at www.caringbridge.com . My family and friends absolutely loved it because they were able to find out what was going on with me every day. Before this, we were getting tons of phone calls every single day and we just could deal with it. It also let people leave me messages and I would read their encouraging, loving and supportive messages every day. Even as I was being wheeled in surgery, my daughters pulled up my caringbridge page on their Iphones to read me the new messages that were coming in that very minute.",
      "MessageIndex": 2,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762722",
      "Title": "does anyone else have a carepage? Tg5471530 Octobergirl"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Nov 5, 2009 04:46PM Mantra wrote: My original plan was to have my breast removed without having immediate reconstruction. My surgeon's opinion was to wait a year and then make a decision once I have lived without a breast for a while. She said after a year, most of her patients decide they are quite happy the way they are and never go on to have the reconstruction. Somehow, my plan changed and I got caught up in the moment and next thing I knew I was signing a paper saying I wanted immediate reconstruction. Oh, if I could only go back in time!! I had my mastectomy on Sept 16. My tissue expander is completely positioned incorrectly. I ended up being referred to one of the top reconstruction surgeons who now has no choice but to remove my expander, put a new one in, and begin the process all over again. The new expander will be done in April or May and a full year will have passed before I finally have my implant next Sept. I probably could have the expander removed and not proceed any further. . . and at times that is exactly the route I  think I should choose. But part of me keeps thinking I've gone through all this extra pain and anxiety and maybe I might regret throwing in the towel at this point. I guess there really is no right answer but I do hate wasting another year of my life just to have an implant.",
      "MessageIndex": 32,
      "PostDate": "05/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/742859",
      "Title": "need more support for my decision MicheleS melissa-5-19"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mantra wrote: A publication of the Lymphovenous Association of Ontario Weightlifting helps, not harms, breast cancer survivors with lymphedema The raditional advice from most health professionals for breast cancer survivors has been a long list of don'ts including exerting the arm at risk by heavy lifting or repetitive movements. An interesting new study published in the August 13, 2009 edition of theNew England Journal of Medicine highlights the benefits of weight-lifting for breast cancer patients and seems to contradict the common belief about lymphedema and exercise. Lifting weights, which boosts mood, muscle mass, bone strength and weight control, was thought to be a bad idea for women with lymphedema. That notion was challenged by a small study several years ago by Dr. Kathryn Schmitz, an exercise scientist at the University of Pennsylvania. She found that weight training did not make lymphedema worse. Her newest study is the first one large and long enough to give clear evidence that this is so, and even suggests weightlifting can help. The randomized, controlled trial followed 141 breast cancer survivors with stable lymphedema of the arm. Half of the women underwent twice -weekly, 90 minute exercise classes for 13 weeks, gradually building up their weightlifting resistance under supervision of a fitness instructor knowledgeable about lymphedema. They then undertook unsupervised exercise twice a week, for the next 39 weeks. The women wore custom fitted compression garments on their affected arm and their trainers made sure the weight lifting exercises were challenging but not too hard. The remaining women made no changes to their normal exercise level. After one year, only 14 percent of the weightlifters were found by their doctors to have flare-ups compared with 29 percent of the women in the comparison group (who did not do any weightlifting exercise). Arm measurements taken throughout the study showed that women in the weight lifting group weren't more likely than women in the comparison group to have their affected arm swell by 5% or more. In fact, the women in the weightlifting group reported greater improvement in their lymphedema symptoms - and of course, they got stronger too. The researchers said that a controlled weightlifting programme can boost strength in the affected limbs, helping to ward off injuries from everyday activities that can aggravate lymphedema symptoms. \"Too many women have missed out on the health and fitness benefits that weight lifting provides, including building bone density\", the authors said. \"Our study shows that breast cancer survivors can safely participate in slowly progressive weight lifting and gain those benefits without any increase in their lymphedema symptoms\", they added. The focus of this study was evaluating those that already had lymphedema; a different part of the study is already evaluating whether weight training can prevent a first case of lymphedema in breast cancer survivors. The authors are expecting the results soon. Although further research is needed, some cancer recovery experts suggest there are further cost savings implications to weightlifting, not only to reduce direct health care costs but also by potentially reducing the risk of disability by allowing women to return to work sooner at full capacity, either within or outside the home. However hopeful the news can be, breast cancer survivors are encouraged not to rush into weight training as that could trigger problems. Dr. Schmitz suggests: ● Have a certified fitness professional teach you properly ● Start slowly, with a programme that gradually progresses ● Wear a well-fitting compression garment during workouts.Compiled from various sources. The full study can be viewed at www.nejm.org Dx 7/10/2009, DCIS, <1cm, Stage 0, Grade 3, 0/3 nodes, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/741474",
      "Title": "Weigh lifting article. What's your opinion? Mantra kira"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jun 23, 2011 08:48PM Mantra wrote: When my sister kept telling me she had staples, my thought was she must be mistaken. Then she said the nurse is coming tomorrow to remove the staples and I decided I really needed to see what she was talking about. So I examined the area today and was shocked . . . and that's putting it mildly, when I saw she was stapled. There must be 100 of them . . . from the cleavage area right up to and including the underarm. I'm so furious I'm shaking. I didn't tell her this but I'm thinking . . . WFT!! And why would they do this when removing them tomorrow is going to be an unnecessary and painful procedure. She said her underarm is killing her and the staples are rubbing. I've told her to take 2 percocet before the nurse comes. First this doctor delays her surgery by two weeks. She fell through the cracks (the doctor admitted this) and only when I got involved and demanded she get surgery ASAP, did they realize their mistake. She had surgery 12 hours after that appointment. Now that I have seen these staples I want to kill this doctor. This is a major cancer centre and a well respected surgeon. I am so angry I want to call and find out what was she thinking!! But I don't want to freak my sister out so I'm pretending that this is normal. IMO it's anything but normal . . . barbaric!! I have zero confidence . ..  and this was my surgeon too!! But I had TE so the plastic surgeon closed. My sister doesn't know what's normal and what's not. She not on any newsgroups and I'm the only person she knows who has had BC. She's very polite and very hesitant to stand up for herself. I want her to call the doctor and find out why she has staples but she doesn't want to make a fuss. And of course I can't be too pushy because I'm trying to pretend staples are normal. But the thought of her having to have all those staples removed tomorrow is causing me to see red. Unless the doctor has some reason for the use of staples, I am going to force my sister to change surgeons. She wants to have a PMX and I don't want this doctor to do it!!",
      "MessageIndex": 6,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770719",
      "Title": "Staples or stitches? Mantra anumacha"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Sep 7, 2009 10:28PM Mantra wrote: I had my lumpectomy and SNB a month ago. Both a quite itchy especially while showering. I'm afraid to scratch the incision areas so I do my best to ignore it, but at times it's easier said than done.",
      "MessageIndex": 5,
      "PostDate": "07/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740083",
      "Title": "Anyone have a lumpectomy, that can help with advice...? brynze Ctann"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jun 22, 2011 04:05AM Mantra wrote: I was supposed to have 1 node removed but ended up having 3. The reason for it was that I had 2 sentinel nodes (apparently people can have 1 to 3) plus one node was stuck to one of the sentinels so it came out too. I would definitely ask for an explanation as to why 6 were taken.",
      "MessageIndex": 4,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770615",
      "Title": "Surgeon took out more lymphnodes pil ebann"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 21, 2010 11:21AM Mantra wrote: I had left breast mastectomy in Sept/09 after lumpectomy came back with one small margin. At the time, my only concern was to GET THIS CANCER OUT OF ME! The first surgeon who could do it . . . was the one I used. I had a right breast mastectomy on my healthy breast last Friday. I'm glad I did two separate surgeries. This time the surgery was not urgent and I had time to check out different surgeons and reconstruction surgeons. I had time to live with one breast and I honestly didn't like it. I'm not sure why but this surgery is less painful than the first one. I have tissue expanders in both breasts. I had a lot of time to think about whether I wanted to go ahead with the prophylactic mastectomy. I had time to live with the mastectomy and see how I felt about it. Having additional surgery is of course an additional health risk, but I'm glad I had my surgeries separately.",
      "MessageIndex": 4,
      "PostDate": "21/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/751596",
      "Title": "Calling all uni-mast ladies 1marmalade1 Brendatrue"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Nov 11, 2010 07:17PM Mantra wrote: Have you tried the organic section at the grocery stores? Our local Zehr's (AKA Loblaws) has a very large section that has everything from food, cleaning supplies, shampoos, soaps, body cream, lotions etc. I have yet to switch my makeup to Paraban free so I honestly haven't looked for that in the organic section.",
      "MessageIndex": 1,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/760647",
      "Title": "Parabens and Phthalates Free Products Arayasunshine69 Shanagirl"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mantra wrote: Did you have staples or did you have stitches after your mastectomy? My sister has staples that run the entire length of the incision including the underarm from the lymph node removal. I was kind of shocked since I had stitches both for the mastectomy and for SNB. Just wondering why a doctor would choose staples over stitches. Thanks! Dx 7/10/2009, DCIS, <1cm, Stage 0, Grade 3, 0/3 nodes, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770719",
      "Title": "Staples or stitches? Mantra anumacha"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jun 24, 2011 02:33PM Mantra wrote: Thanks everyone for sharing their info. I spoke to my sister this morning by phone and she is so frightened of having the underarm staples removed. I still don't get the reason for staples when removing stitches is so much easier for the patient. I hate the fact that on top of dealing with everything else, she is now stressed over something that could have easily been avoided. Anyway, I told her when the nurse shows up to tell her upfront that if the underarm is too painful, she will need to come up with a plan B . . . freeze her, drug her or ???",
      "MessageIndex": 14,
      "PostDate": "24/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770719",
      "Title": "Staples or stitches? Mantra anumacha"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Sep 4, 2009 02:05AM Mantra wrote: I had a lumpectomy and SNB on August 10. Although the cancer was DCIS, it is grade 3 and at least 8 tumors were found in the area she removed. I had microcalcifications show up on my mammogram. The worst margin was 1.2mm. However, given the number of tumors, close margin and grade 3 dx, a mastectomy was recommended. I am having it done sometime in September (not sure of the date yet). I am also having expanders done at the same time if both surgeons can co ordinate their schedules. I honestly don't know if I still have cancer. I thought if they removed the area with the microcalcifications then I would be okay. But I guess not all cancer cells have microcalcifications and it is the unknown that is the scary part. In all honesty, I am truly hoping that my next report shows no cancer was found and I had my breast removed for nothing!!",
      "MessageIndex": 14,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739499",
      "Title": "anybody else ever need a reexcision? tovahsmom Mantra"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 22, 2010 06:52PM Mantra wrote: Is anyone else on a nerveblock? I'm taking Gabepentin (SP ??).  ",
      "MessageIndex": 232,
      "PostDate": "22/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "May 9, 2010 07:22PM Mantra wrote: I actually think that looking/not looking at scars isn't always about your DH ability/inability to accept this. My DH and older DD have seen, dressed, checked my scars tons of times. On the other hand, my other DD just cannot do it. I never took it to mean \"not being able to accept my mastectomy\". It's more that she just can't look at ANY scars, blood etc. I once had an accident that left my leg injured and I can tell you she wouldn't look at it either. So it's not always about \"breasts\" even though we feel it is. It's sometimes just that some people are sqeamish . . . and I'm one of the faint-at-the-site-of-blood type of people. Good thing I'm not a nurse!!",
      "MessageIndex": 360,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 9, 2010 03:24PM Mantra wrote: Thanks to all who responded to my freak-out post above. Happy to say, I am now much calmer, have met with both the breast cancer surgeon and plastic surgeon and have decided to move forward with things. My surgery is April 16th. I wish the weather was going to be great this weekend. Wanted to get another game of golf in before surgery. Not going to happen. Although the courses are open, I'm a fair-weather golfer and freezing on the golf course is just not my style.",
      "MessageIndex": 119,
      "PostDate": "09/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 17, 2010 10:11PM Mantra wrote: I had my surgery yesterday. I arrived 2 hours before the scheduled surgery time. The minute I got to admitting they told me the first surgery of the day was scheduled for 4 hours and they finished in an hour, so they were ready to take me in early. However, with all the paper work and chats with the different departments, I was taken into the OR about 45 minutes early. Surgery took 3 hours and then I was in recovery for 3 hours because I was extra groggy. I remember waking up in my room around 8 PM and DH was sitting there reading a book. I recall telling him to go home because I was going back to sleep. I didn't wake up until 6:30 this morning. I have very little pain although I'm sure the Percocet has something to do with that  I'm also on an antibiotic and a nerve block medication. In fact, I felt so good that on the way home from the hospital, we stopped for lunch. Home care starts tomorrow. Never wore the PJ or robe I brought with. I was told I would wake up with the surgical bra, but it's still in the bag. I see the PS in 2 weeks and imagine I will have a fill that day. I also asked the doctor to put in something in the IV during surgery for nausea, and I woke up feeling fine. I'm going to sleep on my recliner tonight because I'm afraid I'll roll over in my sleep in I go to bed. The pills make me groggy so I don't think I'll have any problem sleeping in a recliner.",
      "MessageIndex": 193,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "May 9, 2010 10:52PM Mantra wrote: I'm taking a nerve block medication that has been a huge help. You might want to ask your doctor about prescribing one for you.",
      "MessageIndex": 362,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jun 24, 2010 10:00PM Mantra wrote: I had my last fill on May 20th. The PS said I have to wait a minimum of three months before the exchange so I'm hoping my exchange surgery will be the end of August. I'm not finding the TE uncomfortable at all but I'm sure I will notice a nice change when they are exchanged for the Gummies! Had two biopsies today at the dermatologist. One was right over my tissue expander. The doc thinks it is a precancerous mole. Funny, but I thought it looked like an attractive beauty mark! The other was on my scalp and it could be a repeat of what I went through last year . . . basal cell carcinoma. I couldn't get an appointment until mid August to find out the results. A bit annoyed at that. I shouldn't have to wait that long for biopsy results. Don't they realize people are anxious about things like this!?",
      "MessageIndex": 472,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mantra wrote: Hi, I had a lumpectomy & Sentinel Node Biopsy on Aug 10. Three nodes were removed (two sentinel + one additional. I have been gently stretching my arm to maintain a good range of motion. However, there a few movements that cause knife-like pain as well as stinging and burning. I read that the pain is likely a result of nerve damage. Does pain from damaged nerves eventually go away. If so, is it weeks? Months? Years? Dx 7/10/2009, DCIS, <1cm, Stage 0, Grade 3, 0/3 nodes, ER-/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739744",
      "Title": "Underarm Pain - SNB Mantra shelleyr25"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Nov 9, 2010 04:10PM - edited Aug 20, 2013 04:08AM by Mantra Daisy, I needed an MRI (not for my breast) and didn't want to wait months. So I logged onto the government website that lists waiting time for hospitals in Ontario. I found the hospital with the shortest wait time and called. Wait time = TWO DAYS!! In reality it was more like two weeks because it took two weeks for me to go through the system to put me in order of priority. They called me last Monday and wanted to book me for the same week. I was busy so ended up having it yesterday. I don't want to put the hospital on the website (not sure if they'd appreciate it or not . . . better safe than sorry) but if you want to PM me, I'll gladly give you the name. It took me 1.5 hrs to get there but honestly I would have driven much further if needed. Also, there is a private clinic in Ottawa. Very very short wait time. Can't remember the price . . . think it was $600 for two breasts (found this last year when I was diagnosed with BC). I also found a private one in Markham but their wait time was a bit longer.",
      "MessageIndex": 8,
      "PostDate": "09/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760152",
      "Title": "MRI scheduled soonermagpie daniel9ds"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Nov 9, 2010 04:23PM Mantra wrote: Oh, didn't realize you are in New Brunswick. Ontario will be quite a distance! I do know that my cancer doctors who work out of Princess Margaret Hospital in Toronto will not even consider letting me have any tests of any kind outside of their hospital. They explained that this way they know the equipment, technician, radiologist etc who is doing the test. However, this other MRI was ordered by my family physician and she really doesn't care where I go for tests.",
      "MessageIndex": 10,
      "PostDate": "09/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760152",
      "Title": "MRI scheduled soonermagpie daniel9ds"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "May 5, 2010 02:31PM - edited May 5, 2010 02:32PM by Mantra I'm still on Gabapentin (sp??)  (a nerve block medication) so I haven't had much itching this time other than the day I didn't take my meds. However, I do recall during my first mastectomy having a really weird itch in the area where nipple once resided. Scratching was useless so I would just try and ignore it when it happened.",
      "MessageIndex": 9,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752196",
      "Title": "numbness at surgery site Laurie_R Laurie_R"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 20, 2010 11:00AM Mantra wrote: I have just had two of them. I used Pico Salex as the prep and found it very gentle yet effective. I also ate light a few days before using the theory \"what goes in, must come out.\" Would definitely recommend this as the prep to use. The first colonoscopy I was given twilight. She was unable to advance the scope round the first bend and the pain was really bad. However, since she managed to remove one precancerous polyp in the area she could get to, she said I had to have the rest done using a different method. She suggested a virtual colonoscopy. I didn't want that and instead found a hospital that doesn't use twilight and instead puts you right out. I woke up afterwards feeling fine, no nausea, and even better . . . no more polyps were found. I think I need to go every two years and really don't have a problem with it. The second hospital did not use Pico Salex but asked if I could use it as my prep regardless and they had no problem with it.",
      "MessageIndex": 12,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759536",
      "Title": "MY FIRST COLONOSCOPY - ANY ADVICE? Godlistens BarbaraA"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 7, 2010 09:31PM Mantra wrote: OMG!! I've suddenly gone into panic mode. My surgery is booked for April 16. Up until today I was confident in my decision to have a prophylactic mastectomy. Today is a different story.  I don't know if this uncertainty is panic driven or whether I really am unsure of my decision. I'm thinking . . . why am I putting myself through this?? Because I'm terrified of having cancer again! I have no family history, and am BRCA 1 & 2 negative. Yet somehow I developed breast cancer. I have to keep reminding myself of this. My BSGI and mammogram came back clear. I'm confident I don't have cancer. But each time I say that, the word \"yet\" seems to follow that sentence. I don't have cancer . . . yet. I made a list of my fears and oddly enough, the actual mastectomy itself didn't even make the list. My fears are more to do with going through the pain of reconstruction, and possible related complications to surgery and reconstruction. Have no idea why the thought of losing my breast is not even a factor in all of this. You'd think it would be #1 on the list. Perhaps it's because I've already had a mastectomy and it really hasn't bothered me. As I'm typing this, I realized something the doctor said today is causing me to pause. I told her that the radiologist said my mammogram showed an unusual amount of breast tissue going into my back. I asked the doctor if she would be removing all of it. No. But I can't remember why. So now I'm thinking . . . what if I put myself through all of this only to have breast cancer develop in this unusual amount of excessive breast tissue left behind. I know I should delay things. I don't think I should go into surgery while having doubts. But for a number of reasons, if I'm going to move forward with the surgery, I need to do it in April.  Anyone else feeling this incredible sense of 11th hour panic?   ",
      "MessageIndex": 106,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "May 1, 2010 10:15PM Mantra wrote: I didn't have a lot of drainage. Not sure if that''s a good thing or not. The first day I had 30 on one side and 20 on the other. It kept dropping from that point and for the last couple of days I had less than 5 cc on each side but the nurse couldn't come until day 8 to pull them so they were left in a bit longer than usual. As I said, I have no idea if a lot of drainage is a good thing but I would think the more drainage you have, the better it is for healing.",
      "MessageIndex": 311,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "May 5, 2010 03:01PM Mantra wrote: Jessamine - Someone on this site gave me a tip to a pain-free drain removal. Before they pull them out, ask them to remove all suction so that the drain bulb is now undone and not working. You'll feel a bit of a sting but I felt no pain at all. Making sure there is no suction works great.",
      "MessageIndex": 338,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 23, 2010 10:32PM Mantra wrote: It's been one week since my mastectomy and the differences between this one, and my last one, are like night and day. Last time I had a left breast mastectomy with tissue expander (no saline was put in during surgery). This time I had a right breast mastectomy with TE plus my left breast tissue expander was removed and repositioned. Both sides have 240 cc. This time the pain is minimal. Infact, we went out for lunch on the way home from the hospital. I've been out almost every day since my surgery. Today, I was sooooooo bored I decided to go into the office to do a bit of work. Okay, that was tiring!! After 4 hours, I could barely drive home I was so tired. Last time I was in so much pain I never left the house for two weeks. I really don't understand how different things are this time. I did have a different surgeon and different plastic surgeon so perhaps that has attributed to the vast differences. I think the home care nurse is removing my drains tomorrow. Again, last time the drain was painful but this time they are nothing more but a bit of inconvenience. Even though it was a prophylactic mastectomy, I am still very anxious about getting my pathology results on May 5th. I guess some things never change. A year ago (before being dx with breast cancer), I never worried about any test results. Now, all medical tests are a source of anxiety. I could have had an earlier appointment but I purposely delayed the appointment until after my birthday. Hope everyone has a nice weekend.",
      "MessageIndex": 243,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 26, 2010 08:29AM Mantra wrote: I'm having horrible itchy, burning, stinging type feeling on the outside portion of each breast. I stopped taking the nerve block medication since I wasn't having any pain. DH gave me a Benedryl thinking that might stop the itching, burning feeling. It didn't and I started taking the nerve block again last night. Now I'm worried if this is going to be a long term issue. Anyone else have this type of pain?",
      "MessageIndex": 257,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 29, 2010 03:33PM Mantra wrote:",
      "MessageIndex": 287,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 29, 2010 05:45PM Mantra wrote:",
      "MessageIndex": 289,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 30, 2010 10:27PM Mantra wrote: Had my first fill today. She put in 60 cc in each side. Painless!! My surgery was exactly two weeks ago and I woke up with 260 cc on each side. She told my I now have no restrictions other than I'm not allowed to do any sports. So no golfing this weekend :( . . . although it's supposed to rain all weekend regardless.",
      "MessageIndex": 305,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 19, 2009 12:09AM Mantra wrote: I could feel your pain as I read your thread and it brought me to tears.  I lost my mother to cancer almost 40 years ago and to this day, still miss her. I never knew my mother had cancer and I never knew she was dying. That's a long story in itself. Losing a mother is very difficult at the best of times. I am so sorry to hear of your loss and all that you are going through.",
      "MessageIndex": 14,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742308",
      "Title": "Lost my cancer-fighting partner, my mother Honeybear meima-Bev"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Jan 20, 2012 09:20PM - edited Jan 20, 2012 09:21PM by Mantra I just checked my caringbridge website and it says \"donate now to Caringbridge in tribute to (my name).\"  It doesn't say the money is going to me and my understanding of the wording is that it is going to caringbridge.  In addition, when you click on the link to donate, there is a pie chart that very clearly shows where the money is going. As well, they have an additional link below the pie chart with additional donation questions/answers and the first one says \" CaringBridge is unable to reallocate donations to individuals made through our Website. Your gift to CaringBridge is used to ensure that CaringBridge's service is available, free of charge, for all families, helping them stay connected so they may receive the love, support and encouragement they need. To find out how gifts to CaringBridge are used, click here.  ",
      "MessageIndex": 23,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778224",
      "Title": "FB, caring bridge, others-need reviews Kellke Iwillwinthisbattle"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Apr 24, 2010 12:04AM Mantra wrote: Janie44 - I'm 57 and was diagnosed last summer. I got such a chuckle out of the stupidity of that doctor.",
      "MessageIndex": 18,
      "PostDate": "24/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751616",
      "Title": "OK another stupid comment comment DCMom ktn"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 15, 2010 06:20AM - edited Aug 20, 2013 02:56AM by Mantra I had my testing done in Orillia at Soldier's Memorial. I saw them within a week of my breast surgeon sending the referral. I too thought I had to have my entire family history but I didn't. She basically asked me a ton of questions and came up with enough info to tell me that I qualified for the testing. I knew very little about my history but it wasn't really a strong family history. Here's what qualified me. 1. I had breast cancer 2. I am Jewish 3. I had an aunt and first cancer with BC (both were over 50 when diagnosed). I told her I really didn't know anything more about my family but she said I had enough to qualify. The testing is done at Mount Sinai in Toronto and Orillia had the results back a lot soon that she had originally thought. I'd have to look up how long the results took . . . can't remember off hand.  ",
      "MessageIndex": 3,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759385",
      "Title": "Need information on genetic testing in Canada Kimalan Kimalan"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Mar 8, 2010 11:34PM Mantra wrote: I had three nodes removed and my surgeon never even mentioned lymphedema. Even when I was trying to decide whether to have a SNB and asked her what are the reasons someone would not have one, she said \"some people prefer not to have additional procedures\". Only when I came to this site did I realize that LE is a risk when you have a SNB. I follow the positioning papers for \"people at risk\" found on the site http://www.lymphnet.org/lymphedemaFAQs/positionPapers.htm",
      "MessageIndex": 4,
      "PostDate": "08/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/749493",
      "Title": "Does a SNB put you at risk? Raili kira"
    },
    {
      "AuthorID": "Mantra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88748/profile",
      "Content": "Oct 14, 2009 01:07PM Mantra wrote: Is it possible for you to get in earlier if you don't have the tissue expanders done at the same time? In my case, I was diagnosed July 10th. Had a lumpectomy on August 6th and a mastectomy on Sept 16th. Are you having chemo before surgery?",
      "MessageIndex": 1,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742122",
      "Title": "\"Are you waiting for me to die, or what?\" CoolBreeze lexislove"
    }
  ]
}