{
  "AuthorID": "Manu14",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
  "Posts": [
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jan 5, 2017 03:47PM Manu14 wrote: I had SAVI radiation a little over three years ago. Shortly after I developed a seroma which my radiation oncologist said is a fluid-filled sac that frequently happens after brachytherapy. it''s your body's way of filling up the empty space created from both the surgery and the temporary implanted device. It is smaller now than it was, but no guarantees that my body will ever completely absorb it. None of the doctors consider it a concern. I also have some scar tissue. Maybe one or both of these types of problems could be what you're experiencing and you could adk your doctors about it. Although annoying, I was glad to find out they aren't anything to worry about for myself.",
      "MessageIndex": 2,
      "PostDate": "05/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Dec 23, 2014 02:36AM - edited Dec 23, 2014 02:37AM by Manu14 Hoping it's ok for me to briefly comment that peanuts are not nuts. They are legumes since they grow underground. Almonds, walnuts, etc. are classified as nuts and are considered the fruit seeds of trees.",
      "MessageIndex": 26,
      "PostDate": "23/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827123",
      "Title": "Peanuts linked to cancer spread? Shutterbug73 Beachbum1023"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jul 13, 2014 02:57PM Manu14 wrote: I like your modern up-dated version better, farmerlucy. It's to the point; shorter; plus I can remember it!",
      "MessageIndex": 15118,
      "PostDate": "13/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Oct 18, 2016 01:29PM Manu14 wrote: I'm glad you have the biopsy over with and that it wasn't too painful. I know you wish time could pass more quickly so that you could have the results. If it is indeed cancer, then seeing all the specialists and getting a plan in place will be a great help emotionally for you and your family. You asked how I am doing now. In a few days it will be three years since my lumpectomy and I am glad to have passed that milestone. Physically, I am healthy and active and make it a point to exercise everyday. I do still have a seroma in my breast, but it is not painful and is gradually getting smaller. The doctors are not concerned about it. I am no longer taking anti-hormonals due to some toxic reactions I developed from them and my oncologist and I after much discussion are on the same page about that. Each case is different and many women do just fine with them. Emotionally, I thought I powered through the first several months pretty well. It was when active treatment was over that I was surprised that I couldn't put thoughts of cancer behind me more quickly. I worried about recurrence way too much in spite of my favorable cancer profile. It seemed that I couldn't go very long without cancer dominating my thoughts. I should have been more patient with myself and realized that it all takes time to absorb. I am in a much much better place now emotionally. Life is good. It sounds like you have a wonderful support system and I bet your daughter will be able to cope better and actually be a help once there is a plan. Even adult children have a hard time the first time they see their mother may not be 100% invincible. Take care and please keep us updated   first see their mother isn't 100% invincible.",
      "MessageIndex": 9,
      "PostDate": "18/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848905",
      "Title": "Bi-Rads 4 2cm Spiculated - Scared cjs9473 cjs9473"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Oct 14, 2016 07:26AM Manu14 wrote: I'm so sorry you are going through this very scary time. Waiting for procedures and tests, then the results, is the hardest part of any of this in my opinion. My mass was also discovered during a routine mammogram. The next day I went in for an ultrasound which was followed up with a needle biopsy at the same time due to what they were seeing during the ultrasound. Although the size of my tumor was somewhat smaller, the words \"spiculated\", \"irregularly shaped\", and \"hypoechoic\" were also used to describe the mass as well as being classified a Bi-rads 4. I hoped for the best; but was told by some medical people among my relatives that the findings at that point were worrisome. The next day I received the cancer diagnosis from the initial biopsy results. While not entirely surprised by the diagnosis at that point, it still was a shock mentally and emotionally. I hope your results are not a cancer diagnosis.. Only the biopsy results can tell for sure even though the ultrasound is abnormal. Try to fill up your time until the biopsy and results with as many pleasant distractions as possible. Reading on the internet will serve no good purpose when you don't even know what the reality is yet. I wish you the best; and please know that you're always welcome to come here for support ",
      "MessageIndex": 3,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848905",
      "Title": "Bi-Rads 4 2cm Spiculated - Scared cjs9473 cjs9473"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jan 10, 2015 05:12AM Manu14 wrote: My tumor was smaller (1.1 cm) and I was Grade 1 with no lymph node involvement. From what I've read, i don't think the size of tumor alone determines lymph node status; at the same time I've seen posters on here with Grade 1 who have had a positive lymph node. Keep in mind that while the quick look frozen specimen during surgery gives a strong indication of positive or negative lymph nodes, the final answer isn't available until the pathology report that follows a couple of days later. Much good luck to you next Monday. Try to do something to get your mind off all things cancer this weekend. I found that no matter how much I read or how many sources I looked at, there was never one absolute answer for my profile.",
      "MessageIndex": 5,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/827481",
      "Title": "Anyone with Grade 1 tumors - what was your node status? shelleym1 newinab"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jan 23, 2016 10:12AM Manu14 wrote: Rosevalley, I read that you love the Portland Rhodie Garden. I live just a short walk from there and while there are no blooms right now, of course, there is always wildlife. I thought you might enjoy this photo from there. And I just checked the rhodie in my front yard and it's filled with deep rose-colored buds. I hope our warm (for PDX anyway) and sunny weather this afternoon finds you resting comfortably. ",
      "MessageIndex": 143,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jul 18, 2014 10:13PM Manu14 wrote: Age 61 at diagnosis",
      "MessageIndex": 293,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Dec 21, 2014 02:33PM Manu14 wrote: It seems like who you see for exams and how often varies by where you live. I saw my breast surgeon once 10 days post surgery . . . and that was it. But my radiation oncologist, who I really like, sees me every 6 months for the first 3 years and then once a year for another two years. She actually gives the best exam of anyone I've seen.",
      "MessageIndex": 15296,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Apr 15, 2016 06:32PM - edited Apr 15, 2016 06:33PM by Manu14 I think I am spoiled. After 2-3 days I can log in to my patient portal and see the report online. Short of that I'm sure I would be showing up at the imaging center like \"biscuits\" wrote about.",
      "MessageIndex": 5,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/843390",
      "Title": "still waiting on mammogram and ultrasound results tallygurl1973 vbishop"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jan 7, 2016 11:41AM Manu14 wrote: So glad this thread exists. I'm a little over 2 years out from surgery and have had a seroma and scar tissue following a lumpectomy and SAVI radiation. Just this past week or so the aching and occasional shooting pain has been more of a problem. And yes, the mind sure can make you very uneasy about any changing side effects. I have regular appointments with both my med onc and radiation onc later this month and hoping for reassurance that this may all just be further healing signs.",
      "MessageIndex": 30,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jul 13, 2014 11:02AM Manu14 wrote: farmerlucy -  Your outlook on life really makes sense to me. While I want to be aware of the statistical percentages,  focusing on them daily doesn't make for peaceful days. I especially like your motto: \"to do the best I can, as long as I can, and try to live a caring and peace-filled life.\"",
      "MessageIndex": 15115,
      "PostDate": "13/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jan 28, 2016 01:38PM Manu14 wrote: It could very possibly be a seroma which occurs with some frequnecy in women who go through a lumpectomy. A seroma is a collection of fluid whoch tries to fill the space where the tumor was removed. Have your surgeon and radiologist check it out. They will probably be able to easily identify what it is",
      "MessageIndex": 4,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/840787",
      "Title": "Scar tissue!!! ThePooKster Manu14"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jul 12, 2014 03:30PM Manu14 wrote: My oncotype score was 18 which indicated an 11% chance of distant reoccurance in 10 years assuming 5 years of tamoxifen.  I asked my MO what the % rate would be without tamoxifen and he said around 20%, but that lifestyle choices (daily exercise, good weight, etc.) would bring it down another 3-4%.  I didn't ask but I am hoping that the extra 3-4% reduction from healthy choices would apply when taking tamoxifen too. The MO also said switching to an aromatase inhibitor in a couple of years could add an addtional 2% reduction in occurance. Then I asked the question that none of them seem to have a clear answer to: Studies seem to show benefit of aromatase inhibitors over tamoxifen for preventing reoccurance, but do they provide an increase in overall survival?  I think I almost detected a grimace in his expression and then he answered: Well . . . while individual studies haven't shown that to be the case, when you look at the meta-analysis (my vocabulary is certainly expanding since cancer) of all the studies there may be a slight increase. The words \"may\" and \"slight\" stood out to me.  So my take away from all this so far is that while we have so much more information about our tumor type than ever before,  so much is still just pieces of an incomplete puzzle.",
      "MessageIndex": 15101,
      "PostDate": "12/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jul 12, 2014 09:56PM - edited Jul 12, 2014 10:00PM by Manu14 BosumBlues, to answer a few of your questions for me: I was ER+ 100% / PR+ 57% Although our Dx is similar, I had a grade 1 rather than a grade 3. Tumor size was 1.1 cm x 0.8 cm x 0.4 cm. I have to honestly say that once all the path reports were final, there was no real discussion from any of my physicians about whether to do chemo or not. I think it was the total collection of information that influenced everyone not to recommend chemo. My Oncotype of 18; highly ER+;  relatively small tumor size; grade 1; Ki-67 of 12% (14% is often used as cut-off point for considering chemo); no positive nodes and no isolated tumor cells; clean margins; no LVI; post-menopausal status, etc. all pointed to chemo not being an added benefit for me. If I had been grade 3 I think I might have questioned the doctors about possibly having chemo. You asked if I worry at this point and what I'm doing to stay healthy: Yes, I do worry at times but not about what treatment route I chose. I worry, like I imagine all of us do, of what if I end up being one of those in the minority percentage who does have a recurrence down the road. I'm trying to accept that there simply aren't any absolutes in the world of cancer. I feel I lived a pretty healthy lifestyle before cancer; but I've upped my game a bit. I used to seriously exercise maybe 3-4 times a week - now it's daily or at least 6 out of 7. I eat no meat other than fish, eat mostly organic, low carbs but a decent amount of the good fats and next to no processed foods. I also bought what I call a \"serious\" water filter for my drinking water. I don't know how much any of that will influence the future regarding cancer, but figure it's a healthy way to live in general. Both my MO and RO say to keep doing what I'm doing. They say the two things studies definitely show to help reduce rate of recurrence is exercise and keeping your BMI on the lower end. And my MO throws in his personal opinion on stressing the organic aspect. ",
      "MessageIndex": 15108,
      "PostDate": "12/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Jul 15, 2014 06:11PM Manu14 wrote: OneLump: I'm not stage II, but thought you might be interested in the conclusions of a 2011 journal article titled \"Ki 67 is a major, but not the sole determinant of Oncotype Dx recurrence score\" published in the British Journal of Cancer. One of it's findings was the the likelihood of a tumor with Ki67 greater than 25% having a high or intermediate Oncotype Dx RS is greater than 90%. I tried to link the specific article but am having tech difficulty accomplishing it. Waiting for the Oncotype results is no fun. I hope you get yours back soon. Make sure to ask for a copy of the full 4 page report.",
      "MessageIndex": 10,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/818536",
      "Title": "Anybody have stage 2B IDC Cancer with very low oncotype score? annabananas AKJ"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Mar 5, 2015 12:27PM Manu14 wrote: Ladyhop, I just posted in your other thread about this. I wanted to add that sometimes they can put something under your elbow to elevate or adjust the angle of the tubes so there isn't as much pull and pain. And as I said in the other thread, I would think you would be on antibiotics for brachytherapy. I remember my RO giving me the stats for rate of infection for people who took antibiotics versus not taking them. I'm sure they will take a close look at you today and do whatever is necessary. Although going twice a day is an inconvenience it is kind of reassuring to have medical people there to look for any changes. Let us know how it goes. ",
      "MessageIndex": 4,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828912",
      "Title": "Has anyone had Brachytherapy? rainbowpearl ceanna"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Feb 26, 2015 02:56PM Manu14 wrote: I had brachytherapy (using the SAVI method). My surgeon thought I would probably be a good candidate for it, but nobody can say for sure that you will be able to do it until the final pathology report comes back after the lumpectomy. If there is any cancer or micromets in the lymph nodes, then brachytherapy is not option I was told. If you do end up having brachytherapy, a CT scan will be done to measure the internal space and then plans are made to insert a device - typically a balloon called the Mammosite. I was too small so had to have a different device. Then there will be two sessions per day of radiation for a total of five days. Then the device is removed. That's the short overview. I think there are some good threads covering more of the specifics if you do a search. And I didn't find the wires being place before surgery to be a big deal. By that time you've already been given a sedative and are pretty mellow. Good luck to you and let us know what happens.",
      "MessageIndex": 1,
      "PostDate": "26/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828912",
      "Title": "Has anyone had Brachytherapy? rainbowpearl ceanna"
    },
    {
      "AuthorID": "Manu14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202549/profile",
      "Content": "Sep 5, 2014 08:04PM Manu14 wrote: Thank you. That was a good read and right on target in so many ways.",
      "MessageIndex": 3,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824275",
      "Title": "The Things I Wish I Were Told When I Was Diagnosed With Cancer farmerlucy Manu14"
    }
  ]
}