{
  "AuthorID": "Manuella",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264241/profile",
  "Posts": [
    {
      "AuthorID": "Manuella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264241/profile",
      "Content": "May 4, 2019 05:23AM Manuella wrote: I have stage 0 (pre-clinical) LE and I’m going for sn LVA mid May. My doc (Joseph Dayan) says the earlier you do the LVA, the better. At MSK they’re doing it even before the swelling starts.",
      "MessageIndex": 5,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/871297",
      "Title": "Lymph bypass surgery for mild LE? buttonsmachine buttonsmachine"
    },
    {
      "AuthorID": "Manuella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264241/profile",
      "Content": "Manuella wrote: Hey everyone, I have very mild swelling in my inner forearm and trunk (back and sides, no breast). I have a sleeve, glove, night sleeve, underarmour shirt and getting a LE bra for flying. I wear my sleeve/glove for traveling (which I do a lot), for exercising and whenever my arm feels funny. I had managed to keep swelling at bay for over a year this way, but have very light pitting now in inner forearm (it indents after 10-15 secs of pressing and stays that way for maybe 45 secs?). Anywho, I told my LE therapist (I see one at MSK) that I hate wearing both glove and sleeve in summerand she suggested I try with just the sleeve since I don’t have hand swelling but that scares me! Wondering if some (a lot?) of you go around with just a sleeve on regular days and wear both sleeve and glove mostly when traveling/excercising? I’m afraid my hand will swell and that the LE will “spread” there. Thoughts? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/865369",
      "Title": "Sleeve but no glove? Manuella JO-5"
    },
    {
      "AuthorID": "Manuella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264241/profile",
      "Content": "Apr 1, 2018 07:38PM - edited Apr 1, 2018 07:39PM by Manuella Maggie, I lost about half my hair. I did dose dense CMFx8. It started falling after the fourth session and stopped a month after my last infusion. I never needed a wig but did use Toppik in the front which is where I experienced the biggest loss. That, constipation and weight gain (10 pounds!) were my biggest SEs. Hair is growing back nicely (I’m 9 months PFC), I have a bit of a mullet situation going on at the moment lol",
      "MessageIndex": 44,
      "PostDate": "01/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    }
  ]
}