{
  "AuthorID": "Marcidougla…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119394/profile",
  "Posts": [
    {
      "AuthorID": "Marcidougla…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119394/profile",
      "Content": "Jan 18, 2011 11:02AM - edited Jan 26, 2011 01:29PM by Marcidouglas I had a mastectomy without reconstruction on my right side on February of 2010.  I was back to work in 3 weeks, it wasn't so bad.  I started chemotherapy in March & 6 1/2 weeks of radiation, I completely finished my treatments on October 1, 2010.  I am scheduled for reconstruction on February 14th. ",
      "MessageIndex": 1,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763559",
      "Title": "Prep and after unilateral mastectomy Jelson terry54"
    },
    {
      "AuthorID": "Marcidougla…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119394/profile",
      "Content": "Mar 10, 2011 10:40AM Marcidouglas wrote: I have been on tamoxifen since October 2010 and have terrible leg pains, water retension & weight gain.  I just seem to feel old and hurt all over, so I went to check it out.  My doctor did a CT Scan and saw something in the uterus so they did a ultrasound but that goodness it came back negative.  I have been off the TX for a week now because I am scheduled for DIEP surgery next Wednesday the 16th and I feel so good for the first time since I started taking TX.  Boy, what a scare this was wondering if I was going to have to deal with cancer again.  I think when I get passed my reconstruction I am going to tell the doctor to take it all out, I have had all my kids and don't need it anymore anyway.  Its like you are looking over your shoulder worrying it will come back.  Don't want to do that again.",
      "MessageIndex": 13,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/765949",
      "Title": "Chemo induced menopause cabmom Pegs"
    }
  ]
}