{
  "AuthorID": "MargaritaMS…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
  "Posts": [
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 25, 2016 12:03AM MargaritaMS wrote: Hello, raising my hand to be counted. First diagnosis was in 2000, stage IIB. Fast forward to one month shy of 15 years later, my 3rd primary, this time IBC, stage IV, HER2+,with mets to liver and spine at the get-go.",
      "MessageIndex": 249,
      "PostDate": "25/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 28, 2017 11:25AM MargaritaMS wrote: Thanks for the encouraging shout-out to those of us lurking, Zarovka! I follow this thread because I do find you all to be so inspiring and motivating! If I had a fitbit, I would like to join your group. I want to continue to move and work out but much as I like to be active, I've never liked to workout for the sake of workout i.e. I hate the fitness club and my home treadmill. That said, I too feel better and sleep better when I move during the day so I keep trying to find ways to do it. I'm a bit frustrated with the lack of snow here in lower Michigan - I haven't yet been able to get out my skis yet and only have been able to use my snow shoes once! On the upside, the lack of ice has made hiking possible so I'm trying to keep doing it. I usually manage 2-3 miles. I also have a yoga-flow DVD that I use when the weather doesn't cooperate with getting outside. The forecast for today is snow so fingers-crossed! Keep on, keeping on!",
      "MessageIndex": 171,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 5, 2017 11:49PM MargaritaMS wrote: well, I got out in the snow this weekend. Yesterday I went snow shoeing in the forest - it was beautiful and sunny. Followed that up with a hike up a huge stairway to a \"sky walk\" trail in the state park - it was bitter cold- and then collapsed in front of the tv for the evening. I've done the stairway many times and it never ceases to amaze me how it can seem effortless on some days and nearly impossible other days. Yesterday it was nearly impossible! Today, I forced myself out on to my cross-country skis even though I still felt pretty tired and a little sore from yesterday. I plowed through it but did not feel as invigorated by the movement or the scenery as yesterday - it was also very cloudy so maybe that contributed. Have again spent a long time on the couch recovering. Darn this fatigue! Keep on keeping on, everyone!",
      "MessageIndex": 209,
      "PostDate": "05/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 2, 2017 03:04PM MargaritaMS wrote: hi all, am sitting at hospital today awaiting infusion. Had a great walk yesterday I need a local park. It's a lovely 3 mile loop which is a great and easy way to get some steps. If I'm by myself, I often listen to podcasts on my phone but yesterday I was joined by my sis visiting from out of town. Chatting the whole way makes me realize how much cardio workout it is since I'm huffing and puffing as I get my words out. Well, was just told to come back in 2 hours for infusion so time to walk the hospital corridors! Have a great day, everyone!",
      "MessageIndex": 193,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 5, 2016 10:29AM MargaritaMS wrote: I also get my blood work done on-site just prior to every infusion. I generally see my onc (or her nurse practitioner) at the same time. I get CT/PET scans every 3-4th months. Am finding that I am feeling very fatigued for several days after my infusion which is annoying but a small price to pay for otherwise feeling pretty good. My neuropathy seems to be improving a bit which leads me to believe it was primarily caused by the Taxol treatments that I received prior to Kadcyla. Cheers!",
      "MessageIndex": 687,
      "PostDate": "05/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 16, 2017 09:02AM MargaritaMS wrote:",
      "MessageIndex": 731,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 16, 2017 09:04AM MargaritaMS wrote: Thanks Escorpion! I also hope we all have good news all year!",
      "MessageIndex": 732,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 22, 2017 12:35PM - edited Feb 26, 2017 11:17AM by MargaritaMS congrats on the good news, Gramen! Hindsfeet, I only receive compazine as a pre-med to Kadcyla. I haven't been on it long enough to get a break yet but I too wouldn't mind a reduced dose or something if it might help reduce the neuropathy. I also have the tingling hands and feet. Some days worse than others - usually better when I've had exercise",
      "MessageIndex": 793,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Mar 4, 2017 02:28AM MargaritaMS wrote: DL3, I'm glad you brought this issue up because it's something I've been a bit concerned about as well. My liver labs have been consistently above the \"normal\" range since I started on this drug. My doc said much the same thing as pwilmarth said - that some elevation of these numbers is common but should be watched. She also has said it is not really a worry unless/until it is several times higher than normal. I'm curious whether any of the ladies who have been on Kadcyla for years have seen these numbers rise",
      "MessageIndex": 812,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Mar 14, 2017 12:07PM MargaritaMS wrote: Hi escorpion! Doing pretty well here - thanks for asking. Hope you are too! I can't really help to answer your genome questions because I really don't understand it myself. I suggest you may want to post your question on the bone mets thread as it's a very active thread with some very knowledgeable folks on it. You may just get a faster reply. Cheers",
      "MessageIndex": 815,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jun 8, 2017 11:27AM MargaritaMS wrote:",
      "MessageIndex": 931,
      "PostDate": "08/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 25, 2018 11:21PM MargaritaMS wrote: Denny123, that is fabulous news! I am so happy for you and soinspired! 16 years is a long time to deal with this beast and all the ups and downs that come with it but boy that sure does make your “almost-remission\"all the more wonderful! May it continue for a very long time! Yay!",
      "MessageIndex": 1218,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 31, 2018 10:40AM MargaritaMS wrote: Hi Meja. Glad you found us here on the TDM1 thread. Hopefully you will find this drug manageable and without too many side effects. I’ve been on it for about a year and a half - maybe closer to two years - I’ve lost track,but I do find it fairly easy to manage. That said, I’ve had a few slight progressions while on it but so far, we have zapped them with SBRT in order to extend my time on TDM1 for as long as possible. My MO also says that there’s are many more things to try when this one fails but hoping that’s not for a good long time yet. M.",
      "MessageIndex": 1287,
      "PostDate": "31/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 30, 2017 12:12PM MargaritaMS wrote: Thanks for the warm welcome! I guess that I should be careful what I wish for! We finally got some snow over this weekend and while it wasn't quite enough to do any skiing yet, I did take a long and lovely but bitterly cold walk on the beach (I live on Lake Michigan), during which I managed to slip and fall right down on my bum. Didn't even see the ice as it just looked like sand but boy was it slick! I broke the fall with my hand so am experiencing a bit of a sore thumb today but nothing too serious. It felt good to get some steps in anyway. It wasn't a huge number but about 5000 more than any day in the past week so that's something. :)",
      "MessageIndex": 178,
      "PostDate": "30/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Sep 28, 2017 08:55PM MargaritaMS wrote: Lisbet, BluebirdDE brings up a good question about alternative chemo though I can't speak to the treatments that you may or may not be offered as I have a different tumor status. What I did want to drop in is about the blood work. Since it sounds like it is a long drive for you to get to your medical center, perhaps you can inquire about doing the blood work onsite same-day. I have done Taxol twice for a total of about 6-8 months and every time I did the blood about an hour and a half before the chemo infusion but always on the same day at the same medical center. They can get results quickly if they want to. Alternatively, perhaps there is a local medical center at which you could have the blood drawn and the take the results with you when you go for chemo. These are pretty straight forward blood tests - as far as I know - so they should make some effort to make it more convenient for you. You shouldn't miss out on a good treatment option because the driving was too much when there are likely accommodations they could make for you. All that said, I have also found Taxol to be quite manageable. Of course, we are all different so we have different reactions to the same drugs but it wasn't nearly as bad as I feared and it did knock the cancer back both times. Best wishes to you. Margarita",
      "MessageIndex": 5967,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 17, 2017 10:13AM MargaritaMS wrote: momallthetime, I can’t believe the hospital horror show that Dani has been subjected to and that you have also had to deal with. I can’t help at all on the treatment options as I have no experience with any of the treatments they are recommending but just wanted to chime in to say that I’m thinking of Dani and you and hope that things will get better quickly as her new treatmentsgets underway. Hugs and hope, Margi",
      "MessageIndex": 6246,
      "PostDate": "17/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Nov 27, 2016 11:01PM MargaritaMS wrote:",
      "MessageIndex": 663,
      "PostDate": "27/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 17, 2017 11:42AM MargaritaMS wrote: hi Escorpion. Sorry to hear that you are struggling with pain and discomfort. I also get Zometa with Kadcyla - usually once every 4 months or so. The two medications are intended to work together for bone mets. I have also experienced some aches and pains from Zometa but for me, it usually only lasts for a few days. Have you told your oncologist about the pains you are having? I guess you have since he or she has offered an alternative. I am not familiar with Pamidronate but I would not avoid an alternative just because of the 3 hour infusion time. I know it's no fun to spend so much time in the infusion chair but if you will suffer less in the days following, it may be worth it. I take an iPad and headphones and watch movies during infusions. It helps pass the time and it's peaceful to tune out the surroundings. I believe there is also a Zometa thread on these boards somewhere. Perhaps others there have had similar experience to yours. Hang in there!",
      "MessageIndex": 736,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 2, 2017 10:18AM - edited Feb 2, 2017 10:19AM by MargaritaMS hi Fran, sorry to have to welcome you to this group. I've not been on Kadcyla long enough to respond to your question about whether side effects are cumulative though some of the ladies on this group have reported some improvement of some SEs over time. I've been on for several months and find it to be quite manageable. And I'm now stable And following Taxol, it's nice to have some hair again! I've complained recently about some neuropathy in my feet and others seem to have experienced similar but I'm hopeful that it doesn't get worse - at least not quickly. In the meantime, I'm just trying to keep up activity level since that seems to be goodfor most ailments including the mind-game that is stage IV.",
      "MessageIndex": 766,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Mar 24, 2017 11:43PM MargaritaMS wrote:",
      "MessageIndex": 829,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 15, 2017 10:34AM - edited Dec 15, 2017 10:35AM by MargaritaMS Well, I received my PET scan results today. It's sort of a mixed bag. I'm mostly stable (NED-yay) except for one spot on my spine (L-2 boo!) which had shown no hyper-metabolic activity for nearly 2 years butis now described as “intensely hyper-metabolic\" - which sounds kind of bad to me (major boo!). It is the likely culprit of my recent back pain though the pain also feels wider spread to me than just one met on one vertebrae. Frankly, I was expecting a worse result but hoping for a better one. Can one met flare on one vertebrae really cause an ache across my entire lower back? Anyway, this same spot was active in my PET of Feb 2016 but has been inactive since then. So, my MO is recommending radiation and then continuing with TDM-1 afterwards to see if we can control this one stubborn met and keep this otherwise good run on this drug going. It seems like a good plan to me because I was worried about blowing through another line of treatment but I will have to temporarily suspend TDM-1 infusions during rads. Anyone else have a similar experience? Hope you all are doing well and feeling good.",
      "MessageIndex": 1050,
      "PostDate": "15/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 21, 2017 11:46AM MargaritaMS wrote: Hi gals, thanks to someone in this group (sorry that I can't remember who it was), I learned about the so-called super Kadcyla known as DS-8201. I asked my MO about it a few weeks ago and she said she'd look into it. Today, she told me that although she hadn't heard of it prior, she was interested enough in the drug's early findings that she is now trying to establish the hospital/clinic as a trial site for the phase 3 trial they expect to open in July 2018. I was really impressed that a tip from this group passed on to my MO led her to research and then apply for a clinical trial. So good to keep sharing information. Maybe we'll have yet another good drugoption down the road. In other news, I'll be proceeding with SBRT radiation to my spine in hopes that we can push back the one misbehaving met and continue on with Kadcyla since it is otherwise keeping thingunder control. Happy holidays!",
      "MessageIndex": 1071,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Apr 19, 2018 11:44AM MargaritaMS wrote: Denny, sorry to hear about the nurse’s error. That’s a big disappointment but glad you are soldiering on! I’m sure you are happy to leave the blasted nose bleeds behind. I have one almost every day - ugh!",
      "MessageIndex": 1193,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 18, 2018 10:06AM MargaritaMS wrote:",
      "MessageIndex": 1214,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 18, 2018 10:24AM MargaritaMS wrote: Kaption, welcome to our little group. I've seen you around on other threads as well. I think you'll find that most of us manage without too many problems on Kadcyla. There are, of course, some common side effects that several of us have to varying degrees such as drippy or bloody nose, a little fatigue and maybe a bit of neuropathy but then, I guess most of us land here after a fair number of prior treatments as well so who really knows how much fatigue, for example, is the result of Kadcyla and how much is cumulative strain on our bodies from all other treatments? I have found Kadcyla to be a very manageable and effective treatment. I've lost count of how many cycles I've had but it has been about a year and a half and things are still looking pretty good. I just described my recent progression in my last post aimed at Escorpion but aside from hopefully stopping the spinal progression (which has been the stubborn lesion knocking me off previous treatments) my MO wanted the SBRT in order to prolong my time on Kadcyla for as long as possible. That said, our eyes are also on DS-8201 which has been termed a “super Kadcyla\" and is looking very promising in trials for those of us who eventually progress on Kadcyla. Hopefully, you too will find this treatment both manageable and effective! M",
      "MessageIndex": 1215,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 25, 2018 11:24PM MargaritaMS wrote: Escorpion, how’s your radiation treatment going? Have you been able to do it yet?",
      "MessageIndex": 1219,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jul 11, 2018 02:36PM MargaritaMS wrote: Fran, so sorry to hear that you are struggling through a rough patch. It is so anxiety inducing to have to wait for tests to be done and then for results to come in. I can relate to your feeling that Kadcyla is your “drug of choice\". I feel the same as it has been a very manageable and effective treatment for me too. Several months ago I also had a rise in my tumor markers which, unfortunately, was correlated to progression in bones. But, as the scans showed only one active bone lesion, I was able to get that spot zapped with SBRT and then stay on Kadcyla. I just had my 6-month scan post-SBRT and the bone lesion is still quiet so I'm still on Kadcyla. I wanted to mention this to you because even if your scans come back showing progression, which hopefully they won't, but if they do, you may still be able to extend your time on Kadcyla. We all hate to hear it but when your onco says “wait and see,” that's really all we can do. Ugh! Hoping for the best for you! Please keep us posted. Kaption, I haven’t myself experienced a dosage reduction but nor have I experienced such fatigue. It could be a reasonable step to take but glad your team is also looking for other reasons which might explwhy you’ve been so sleepy. Hope you get to the bottom of it. Take care everyone! M.",
      "MessageIndex": 1248,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Mar 14, 2017 10:42AM MargaritaMS wrote: Wow, Zarovka, Cure-ions and others-I just marvel at how much y'all know about this disease and all the treatments and trials! You are amazing. Makes me want to keep studying Momallthetime, sounds like the right path is emerging. Again, here's hoping that this trial kick's butt for Dani! We can all drink a margarita to celebrate that!",
      "MessageIndex": 4523,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Sep 27, 2017 06:09PM MargaritaMS wrote: Kaayborg, Zarovka, Momallthetime/Dani and all others who are having difficult days recently, I just wanted to say that although I rarely post/comment, I do nonetheless follow along fairly regularly. You are all so thoughtful, helpful, supportive and inspiring that I want to say that I am thinking of all of you, hoping for the best outcomes (!) and wishing you strength and fortitude as you face the latest challenges that this dreadful disease has thrown at you. Warmly, Margarita",
      "MessageIndex": 5947,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Mar 13, 2017 10:38AM MargaritaMS wrote: Hi momallthetime. I've been following the discussion you've been having about Dani's treatment options. You've gotten some great and informed input to which I cannot add much and the trial sounds like a very good option. But I just wanted to mention that if Taxol becomes the best option at some point - now or down the road - perhaps you should ask your doc about Abraxane. As I understand it, it is Taxol with a different delivery method - it isn't dissolved in a solution so it is supposed to be easier to tolerate. It might be good for Dani since side effects seem to be so hard on her body. Abraxane also doesn't generally require the pre-meds that are also sometimes hard to tolerate. I've had both Taxol and Abraxane and the Abraxane was easier but alsohas been deemed as effective, if not more so, for metastatic breast cancer. By the way, from all I've lurked and seen on these boards, I can see that you are an amazing mom! I wish you and Dani all the best!",
      "MessageIndex": 4512,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Apr 22, 2019 02:27PM MargaritaMS wrote:",
      "MessageIndex": 11094,
      "PostDate": "22/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Nov 1, 2016 12:30PM MargaritaMS wrote: CJRT, that's good to know. I'm now almost two weeks past last infusion and feet are feeling better. Perhaps this is something that will be cyclical between infusions - worse right after and then improvement until the next one.",
      "MessageIndex": 628,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Nov 15, 2016 07:36PM MargaritaMS wrote: DL3, congrats on those great scan results! For the record, my Onc sees me before every infusion too. Basically, I see her every three weeks. But, she did say recently that she may reduce my visits with her to every six weeks so long as things remain stable and I feel good. In my case though, I've switched infusion cocktails 5 times in the 1.5 years since I was diagnosed so I think the dynamic nature of my treatment has led her to keep a close eye on me. I don't mind it as I always have a few new questions for her.",
      "MessageIndex": 646,
      "PostDate": "15/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Apr 24, 2017 02:09PM MargaritaMS wrote:",
      "MessageIndex": 882,
      "PostDate": "24/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 2, 2017 10:38AM MargaritaMS wrote: Hi DL3, I just looked back at my ALT and AST numbers for more than a year. For the entire time that I've been on Kadcyla - about 10 months now, they have been elevated but with a range of ALT 36-59 and AST 43-53. Prior to going on Kadcyla going all the way back another year they were pretty much always in the 20-30s range but even before Kadcyla, I had a few outliers where the ALT spiked to 58 for no apparent reason. My MO has said that these number are considered fairly slight elevations and she wouldn't really worry about them unless they shot up \"significantly and/or suddenly\". So, based on my experience, I'd say your numbers are pretty much in the range of acceptable. On a different matter, I wonder if any of you Kadcyla ladies have experienced either thyroid nodules and/or capillaritis? I am in the process of undergoing various tests - so far ultrasound and in another week or so, guided needle aspiration biopsy -- of thyroid nodules that suddenly lit up on my last PET scan. I am not terribly worried because other than the thyroid (which was not a prior metastatic site) there was no evidence of metabolic activity on my PET. And the say that breast cancer mets to the thyroid is very rare (never mind that every diagnosis I've had thus far has been \"rare\" - not to worry!) but curious whether this could be related to Kadcyla. The capillaritis is strange - it's a skin condition where tiny blood vessels (capillaries) burst right at the skin surface creating a sort of reddish pin-prick polka-dot pattern. No pain, no itch and no explanation as to why I suddenly had these things appear on my torso but they've stuck around for several weeks. It is not listed as a \"known\" side-effet of Kadcyla so just wonder if anyone else has experienced it. Much as I want to believe that they are \"nothing to worry about\" as the dermatologist says, I find any change in my body to be concerning at this point and I expect there to be reasons for anything that does change. I'm not very happy with a response of \"well, this happens to some people, we don't know why but it's nothing to be concerned about.\" I just hope they are right! Otherwise, everything continues to be good on Kadcyla! lol",
      "MessageIndex": 983,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 17, 2017 09:30AM MargaritaMS wrote: Thanks CJRT and DL3. My neck was pricked like a pin cushion- they gave me 2 or 3 lidocaine shots followed by 8 needle samples so hopefully they at least gathered enough cells for definitive results - which won’t come for a few days.Ah, the waiting. 😉",
      "MessageIndex": 1002,
      "PostDate": "17/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Mar 9, 2018 10:34AM MargaritaMS wrote: Denny, such fabulous news! Really happy to hear it!",
      "MessageIndex": 1176,
      "PostDate": "09/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 3, 2018 03:24PM MargaritaMS wrote: Gonegirl, thanks for sharing the information about your sudden reaction to Kadcyla. It does sound scary but good to know what signs to look out for. My clinic (and I) has become rather lax on the post-infusion waiting period but it seems there is actually good reason to adhere to it. Denny, glad to hear that you are finding Xeloda to be easier than Kadcyla. I agree that the nasal issues are no fun but the sore feet don't sound so great either. It's always something though isn't it?! My latest issue is that I am experiencing increased neuropathy especially in my feet. My toes often feel quite crampy and tingly. I haven't really tried any treatment for this as I haven't heard of much that helps with neuropathy. I hope I'm not reaching the end of my Kadcyla run since it's been pretty good to me so far but these foot and hand aches are really annoying. Anyone else having this problem?",
      "MessageIndex": 1204,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jun 29, 2018 09:58PM MargaritaMS wrote: Dizzydee, I've been on Kadcyla for close to two years. For me, the side effects have been pretty minor and short-lived. Mostly it's the occasional headache a few days after infusion and a tad bit of neuropathy (which may still be a result of permanent damage from my three courses of Taxol/Abraxane). That said, I don't think it is unusual to have a more pronounced reaction after the first time a new drug is administered. I think Kaption is correct that dizziness, especially if it persists, should be reported to your doc. Also, it's generally not wrong to keep be sure you stay hydrated. My medical center still has me wait a half hour after infusion before I leave as allergic type reactions are not unheard of even among people who have been on the drug for a long time. Bigpeaches, welcome to this Kadcyla thread. Of course, everybody reacts to drugs differently but I have found it to be a fairly easy protocol. Kadcyla is sometimes referred to as a “super-Herceptin\" because it uses the same pathway as Herceptin but delivers a powerful chemo directly to the HER2 over-expressing cells. Well, I'm no scientist so maybe I'm all wrong about how it works 😆 but it seems to work well for many of us and it seems that it is becoming quite commonly prescribed after progression on Herceptin and Perjeta alone. I wish your sister-in-law the best Dizzydee, please keep us posted on how you are doing! M.",
      "MessageIndex": 1237,
      "PostDate": "29/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 29, 2019 03:58PM MargaritaMS wrote: That’s great news! Congratulations to all of yo!!",
      "MessageIndex": 13,
      "PostDate": "29/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/871790",
      "Title": "A Major Milestone!!!! Fitztwins Olma61"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 5, 2016 06:42AM MargaritaMS wrote:",
      "MessageIndex": 13,
      "PostDate": "05/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/850333",
      "Title": "Medication-Related Osteonecrosis of the Jaw sharethehope MinusTwo"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Nov 9, 2016 10:35PM MargaritaMS wrote: I share your worries about what will happen to health insurance under a Trump. Not to mention the SSDI and Medicare that so many of us rely on as well. You said it Denny, \"As if we don't have enough to worry about\"! Good luck on the scan, DL3!",
      "MessageIndex": 637,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 28, 2016 01:31AM MargaritaMS wrote: Hi there, just wanted to drop in as I am also still on Kadcyla. I also don't post much but do follow this thread and appreciate all the information and gracious support of those who post here. I was on Kadcyla last year for a few months until PET seemed initially to show progression into lung. Switched back to Taxol and then radiology team decided upon further review that probably not lung progression but rather just inflammation (possibly due to earlier radiation). In any case, stayed on Taxol for about four months until next PET showed stability/regression then back on Kadcyla since about September. Doing fairly well on it but have some SEs that others have mentioned: dry nasal passages, dry mouth (SO thirsty at night!) and still a bit of neuropathy likely from the past Taxol. Have next scans in early Jan so fingers crossed that things remain stable. Happy holidays to all",
      "MessageIndex": 715,
      "PostDate": "28/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 18, 2017 02:13AM MargaritaMS wrote: During my first year of treatment, I also had Zometa more frequently. I can't now recall exactly how often - maybe every 6 weeks? but then after one year, it was reduced to every 3 or 4 months just depending on what else is going on. For example, last year I needed dental work so I had a period of 6 months without getting it. It was a nice little break while it lasted - excepting for the dental work. Lol",
      "MessageIndex": 739,
      "PostDate": "18/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 26, 2017 05:54PM MargaritaMS wrote: Glad to hear that things are going pretty well for you Pasque! That's good news! Can't say that I've had much problem with nausea but I have been dealing with the numb feet. I'm glad to know that it isn't just me. It is always worst at night when I'm trying to get to sleep. Last night, I even had what felt like a cramp in the arch of one of my feet. I used an OTC muscle/massage oil that has some menthol properties and it provided enough relief that I was able to get to sleep. It's a bit better today. Denny123, I'm encouraged that your foot numbness has subsided over time. I was a bit worried that it would increase like when I was on Taxol but perhaps it won't. For now, it is certainly tolerable and worth it considering the good results. Keep on, keeping on!",
      "MessageIndex": 750,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 27, 2017 12:45PM MargaritaMS wrote: Escorpion, I'm sorry to hear about the pain and discomfort that you have. I hope that your docs can get that under control soon. Regarding other HER2+ treatments after Kadcyla, I really don't know the answer to that question as there are so many options these days depending on all the properties of each individual's case. What I do know is that my doctor has assured me that there are \"many more\" options in the arsenal that can be tried if/when Kadcyla is no longer an option. I have to believe that in Canada, there are still many options for you that your government will provide. But hopefully, you can get the pain and numbness under control and stay on Kadcyla.",
      "MessageIndex": 753,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 16, 2017 12:28AM MargaritaMS wrote: CJRT, that's interesting that you also have red dots on your torso. How many infusions have you had? I just had my 21st- didn't realize it's already been so many - but the dots only showed up about two or three treatments ago.Anyway, it's reassuring that your doc also says not to worry about your dots. Agree that they are likely just another weird side-effect. Leftfootforward, sorry to hear you had such a hard go of your first infusion. I've not experienced such effects but I do also get compazine as a pre-med. Occasionally I take it a day or so after infusion but usually not needed. Denny123, haven't heard about a saline shortage but I'm going to ask. I have a thyroid biopsy tomorrow- just another reason for stress and anxiety. Wish me luck! M",
      "MessageIndex": 999,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 29, 2017 07:44PM MargaritaMS wrote: DL3, very interesting info about the DS-8201 drug. In reading through the info on it, I was taken aback by this line on the manufacturer's press release: “there is no current standard of care for HER2-positive tumors after treatment with trastuzumab, pertuzumab and T-DM1.\" What? Is that accurate? My MO has always said not to worry because there are still many tools in our toolbox but I've never pushed her to name what will come next if/when I fail Kadcyla. Have been hoping not to need to discuss it any time soon but will definitely ask about this drug. Btw, I am happy to report that my recethyroid biopsy came back benign. Hooray for small things.",
      "MessageIndex": 1019,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 21, 2017 12:14PM MargaritaMS wrote: Denny123, it is possible that I misheard but I thought she said phase 3. It’s a drug that has been in testing for different types of cancer, beyond breast cancer, so perhaps the study has some different arms or phases In any case, hoping the Poziotinib works for you for a good long while!",
      "MessageIndex": 1073,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 19, 2018 07:27PM MargaritaMS wrote: Ditto to what Miriamwillits said, Denny123. Really sorry to hear that the SEs were so terrible but really hoping that they did their job! Hoping that you start feeling better soon now that you’ve had the last of those pills!",
      "MessageIndex": 1105,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 4, 2018 10:33AM MargaritaMS wrote:",
      "MessageIndex": 1129,
      "PostDate": "04/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 5, 2018 03:48AM MargaritaMS wrote: hi Denny, I went I went back into my message to fix an error and i guess I deleted part of my message?! I find typing on these boards a bit clumsy. Anyway, good to hear from you. I hope that the grants come through. Is there a backup plan? Sarah101, how you doing",
      "MessageIndex": 1132,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 6, 2018 02:43AM MargaritaMS wrote: Denny that is great news, I’m so glad that you will soon be back on treatment and at an affordable price to boot! Now, fingers (and toes!) crossed that it works for you for a good, ong time!",
      "MessageIndex": 1134,
      "PostDate": "06/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 10, 2018 01:19PM MargaritaMS wrote: Denny, I’m glad the new combo will be easier on you but really, could he not have figured out that the Lynparza would be too rough several weeks ago? I know you are anxiously waiting to get back on treatment so I hope the necessary approvals come quickly. Thanks for the update. Keep on keeping on",
      "MessageIndex": 1137,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 6, 2018 01:49AM MargaritaMS wrote: Thanks for the tips on treating neuropathy. While I am loathe to add another drug to my routine, if the neuropathy gets worse I’d rather add a drug than have to move on from the Kadcyla. Keep on keeping on, ladies",
      "MessageIndex": 1207,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Nov 29, 2018 01:34PM - edited Nov 29, 2018 02:56PM by MargaritaMS Denny123, that is some roller coaster ride to be sure but SO glad to hear you are now and still NED. That's just fantastic!! All, and especially those new to this drug/thread: I'm also doing well. Not sure yet that I'm NED again but about to go for my 39th Kadcyla infusion. Over the two years I've been on this drug, I've felt pretty good and had fairly minimal and manageable side effects. I've had two minor progressions one in my L2 spine and one in my psoas muscle. Both we're treated with SBRT so that I could remain on Kadcyla since it seems to be working for the rest of my body. So far, after nearly one year post-SBRT, my spine shows no sign of disease though due to radiation related changes, this was not so easy to ascertain. I'm told there was lots of re-reading of my scan results before my team arrived at this conclusion so I'm sure hope they are right! The psoas muscle outcome will not be known until my next scan next month since I only just finished that radiation treatment. My fingers are crossed for a complete resolution even though the RO said that the treatment was not viewed as curative. My preferred state of mind is denial so I'm always and still hoping for a cure but I'd be thrilled with NED for now. I just received the results of my genetic testing. This is going to challenge my little chemo-brain to even begin to understand. It's interesting though. Hang in there ladies and hope Kadcyla works well for you too! I think someone was concerned about their liver and/or kidney function numbers. Myliver function numbers go up and down. My MO says she doesn't worry about them unless they are elevated to the point of about triple “normal\" range but my kidney function hasn’t changed while on this drug. Margarita",
      "MessageIndex": 1299,
      "PostDate": "29/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 26, 2016 11:24PM MargaritaMS wrote: Hi there, Been lurking awhile. Encouraged to hear about the tolerability and long-term effectiveness of Kadcyl. I've just had my second Kadcyla infusion. Well, this is my second time starting it. Had it earlier in the year but was taken off due to possible lung progression. Did a few months on Taxol and then the progression was ruled out. Of course, glad it was determined that my lungs actually were clear (I just had inflammation) but it was a bummer to be on Taxol again. Lost my hair - again. But worse, I got a fair amount of neuropathy in my hands and feet. Not so much painful as just the uncomfortable feeling of numbness. So, my question to you lovelies is whether, based on your experiences, I can expect improvement of neuropathic symptoms on Kadcyla or does it aggravate it? Incidentally, I am also required to wait 30 minutes after infusion in case of allergic reaction - after the first one it was 90 minutes! Thanks!",
      "MessageIndex": 624,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Oct 26, 2016 11:52PM MargaritaMS wrote: Wow! Denny you are an inspiration! Yes, at night in bed or anytime I put my feet up is when the numbing really kicks in.Thank you for your quick response. I'm definitely glad to get off Taxol and back to Kadcyla. My first go around with it was very doable so if this blasted neuropathy improves, I'll be delighted.",
      "MessageIndex": 626,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Jan 15, 2017 06:04PM MargaritaMS wrote: Denny, thanks for the biotene tip a few weeks back. I've been using it and it seems to help with the dryness though I still drink a ton of water at night too. Also been using the Ayr for sinuses and it also helps. I had a terrible cold during the early part of this month but seem to be mostly over it now so back to the \"usual\" dry nose. Also, I just wanted to share that my PET scan results from last week showed no metabolic activity anywhere! This after nearly two years of various treatments - Taxol HP, just Herceptin/Perjeta (progression), Kadcyla (suspected progression), Taxol HP again, back to Kadcyla for past couple of months. We can get there! I hope it will stay that way for a good long time because aside from a few pesky SEs, I find Kadcyla to be quite manageable. At the same time, my heart functioning (efficiency) has degraded a bit and blood pressure has been high so now also on Lisinopril and going for regular echos. Sigh, it's always something but still I'm grateful Pasque, my hair is growing back but it seems to be at a snail's pace fortunately I live in a cold climate so I can just wear a hat everywhere I go. No bad hair days anymore - just hair days!",
      "MessageIndex": 728,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 26, 2017 12:38PM MargaritaMS wrote: Great news, pwilmarth! We'll take stable! It's also good that you have gotten the pain under control. I have also had neuropathy with some painin my feet and to a lesser extent in my hands but I've found that it is becoming less intense over time. I've lost count of how many Kadcyla treatments I've had but probably been at least 6 or 7.",
      "MessageIndex": 797,
      "PostDate": "26/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Apr 2, 2017 06:12PM MargaritaMS wrote:",
      "MessageIndex": 847,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 15, 2017 12:07AM MargaritaMS wrote:",
      "MessageIndex": 903,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Nov 10, 2017 04:29AM MargaritaMS wrote:",
      "MessageIndex": 1030,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 2, 2017 02:16PM MargaritaMS wrote:",
      "MessageIndex": 1044,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 10, 2017 12:26PM MargaritaMS wrote: Thanks for the good thoughts and prayers. I had my PET scan but still awaiting results. Back continues to ache but still hoping it’s an unrelated pain. Denny123, I don’t get the finger lock thing that you mentioned but I do get the Charlie horses and other sudden cramps in various locations. It does make sense that there must be various, adverse effects of many years of chemo. It’s strong stuff they have us on after all. I’ll check in when I have my scan results. Hope you all are doing well. ",
      "MessageIndex": 1047,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Dec 15, 2017 05:20PM MargaritaMS wrote:",
      "MessageIndex": 1053,
      "PostDate": "15/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Feb 4, 2018 10:47AM - edited Feb 4, 2018 10:48AM by MargaritaMS tlcbkc, it is always nice to hear from someone who is having a good, long run on a treatment. Hope it continues for you! Thanks for checking in. Fran, is that a recent PET you had? Great news that you are NED! I had two PET scans in 8 months last year that were clear -also showing no signs of active disease. Then in December my PET was all clear but for one bone met that flared back up. It's a site that has flared before so in January we did SBRT to that one met (lumbar vertebrae) and I've continued on with Kadcyla. Our strategy was to keep with what has been working systemically for as long as possible and try to kill off for good the misbehaving met. Won't have another scan for a few months now so just hoping that it worked",
      "MessageIndex": 1130,
      "PostDate": "04/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "May 1, 2018 02:23AM MargaritaMS wrote:",
      "MessageIndex": 1197,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "MargaritaMS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239941/profile",
      "Content": "Mar 6, 2019 09:55AM MargaritaMS wrote: Hi Erkipper, sorry to hear that you are feeling poorly after the Kadcyla infusions. As ADDK asked, I was also wondering if they are giving you an anti-nausea pre-med? I used to be given compazene as a pre-med but I found myself to be so irritable and fatigued after my infusions that I decided to skip it once and see how it went. I've not taken a pre-med since because I feel better without them though they did offer to switch to a different one if I wanted but I don't get significant nausea from Kadcyla. Perhaps if you get premeds they could tinker with those and see if different ones would work better for you. Also, I try to take in lots of fluids before, during and after each infusion so perhaps that helps. And, I have made an effort to up my probiotic intake in order to decrease drug induced gastro-intestinal issues - I think it helps. I haven't noticed a metallic taste with this drug but I remember it well from other chemos - I just tried to eat my way through it. :) I'm sorry, I'm not sure this is helpful especially since we all respond so differently to these drugs but thought I'd share my strategies in case it might be useful. Hope your scan is good! -Margi",
      "MessageIndex": 1314,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    }
  ]
}