{
  "AuthorID": "Marie82",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194212/profile",
  "Posts": [
    {
      "AuthorID": "Marie82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194212/profile",
      "Content": "Marie82 wrote: I do not have cancer, but I just tested positive for the BRCA 2 mutation. I was wondering if there are any other BRCA+ women on this forum and what they have done about it. I am only 31, but the cancer history in my family is crazy. My grandma and 8 of her siblings died of cancer. My grandma was only 40 at the time. I have one aunt that died of ovarian cancer and one that died of breast cancer. My mom is BRCA+ but no cancer yet. She is doing all of the preventative surgeries in the next couple months. I assume that I will do all of the surgeries eventually, but struggling to know if I should do them this young. I have 3 children and don't want anymore, so that isn't a concern with my decision. Anyway, I would just love to hear from anyone else with this mutation, especially any younger women. Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816851",
      "Title": "Positive for BRCA Marie82 kuka21"
    },
    {
      "AuthorID": "Marie82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194212/profile",
      "Content": "Jan 20, 2014 07:24PM Marie82 wrote: thank you all for your responses! Truly these forums and the FORCE forums have been such a lifeline this past week since finding out I was positive for BRCA. There are so many strong women dealing with such difficult decisions. It has been so helpful to see women following what they feel is right for them. I am gaining the confidence I need to start moving forward and making decisions about my health and what I want to do to ensure that I am around to see my kids grow up. Thank you all for your input!",
      "MessageIndex": 7,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816851",
      "Title": "Positive for BRCA Marie82 kuka21"
    }
  ]
}