{
  "AuthorID": "marie111",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
  "Posts": [
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Nov 6, 2009 06:50PM marie111 wrote: Hello All, I am new here but have been following your thread ever since my hair feel out, it is very inspirational !! I finished 4XTC 4 weeks ago. My question is this: I never lost all my hair. When my hair started falling out I buzzed it with a #4 and what fell out fell out and a few stands stayed for the duration of my treatment. There is not much hair, it is VERY sparse and about 1/4 inch long. At this point - 4 weeks out - I am not really seeing any re growth. Should I shave my head right down ? Will this help it grow ? When it starts growing back is it a uniform growth ?  Also I am not taking anything for it any recommendations ? Thanks  ! Marie",
      "MessageIndex": 3847,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Nov 19, 2009 04:47PM marie111 wrote: Stephanie1: You look great !! What did you do to get your hair to grow like that.  I am 6 weeks PFC and like you have been reading these post ever since I started chemo, they were very inspiring. However 6 weeks out I don't have any more hairv then I did while on chemo. Same old hair that never fell out, nothing more.  Did you shave your head completly ? Did you have any hair left during chemo ? Thanks, Marie",
      "MessageIndex": 3936,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Nov 17, 2009 02:32PM marie111 wrote: Thisisme:  You look great. I am 6 weeks PFC and not much is happening.  I have a few stands sticking right up that never fell off during chemo but not much else seems to be growing.  I was wondering if you had these funny litle hairs on your head before you shaved it off. I have been considering shaving in the hopes it will grow back evenly and stong as it did with you. Any advice from any of you ladies is greatly appreciated !! Marie",
      "MessageIndex": 3920,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Aug 5, 2009 06:02PM marie111 wrote: Am starting my chemo 4 X TC tomorrow !!! Solarbeam: Thank you for your encouraging words and deep down inside I fell the same. I DO NOT want to regret this later. I am also young,not quite as youg as you ;-( and want to do everything I can to be here a long time with my kids !! However it is still scary and I hate to this for nothing. I think we are still a few years to early for anyone to tell us for sure if it is beneficial or not for early stage ER + BC. So I guess I am jumping in with both feet (and maybe a little reservation) for what I hope will not be to wild of a ride .... Hope you are all well. Marie",
      "MessageIndex": 28,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Aug 2, 2009 04:20PM marie111 wrote: Hi ladies: I have been reading your posts with much anticipation since I am scheduled to start my TC X4 on Thursday Aug 6th. I am feeling very anxious about the whole chemo SE thing and losing my hair so it's great to hear about other peoples experiences. I am hoping only 4 rounds of chemo is doable, could be worst I keep telling myself. Marie",
      "MessageIndex": 21,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Aug 3, 2009 12:37PM marie111 wrote: OK so I need to know, how bad is it ?? Should I expect to be sick for the next 4 monts or will I be able to go about my regular life minus maybe a couple of bad days. I have 2 kids ( 8 & 10 years old), will I be able to continue taking care of them ???? Very concerned ....",
      "MessageIndex": 23,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Aug 7, 2009 05:11PM marie111 wrote: Started my first tx of 4 yesterday. So far I feel great. Maybe a little queasy and my kness aches a little don't know why? I am getting really freaked out about losing my hair, how long can I expect before it starts falling out and will it all fall out and most importantly when will it start growing back and how fast ?  Any coments would be helpful. Kimby: Glad to hear you are feeling better ! Marie",
      "MessageIndex": 33,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Aug 4, 2009 09:26AM marie111 wrote: Madge24: Thank you for your encouragements. I see from your profile your scenario is very similar to mine. Can I ask why you are doing chemo? I see alot of women with early stage ILC not doing chemo. What was your tumor size? Did you do the Oncotype test and what was your result? My ONC recommends I do chemo because of my age (42) and tumor size (2cm) but my Oncotype result was 16 which is considered low. I have decided to do the chemo because I want to put all the chances on my side (I guess), still not sure I am making the right decision.... I am scheduled to start chemo on Thursday (4 X TC) ....",
      "MessageIndex": 25,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737293",
      "Title": "TC X 4 Solarbeam Solarbeam"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "marie111 wrote: This Post was deleted by marie111. LCIS, Oncotype score 16 , Chemo 4 X TC done, Nipple sparring, skin sparring BMX Dx 5/7/2009, ILC, 2cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/758208",
      "Title": "Eyebrows marie111 marie111"
    },
    {
      "AuthorID": "marie111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83491/profile",
      "Content": "Aug 7, 2009 02:40PM marie111 wrote: I can totally related to your turmoil right now as I have gone thru the same and still am.  I am 42 years o;d with two kids ( 8&10). I was  dx with stage 1, grade 1 or 2 (they can make up their minds) ILC with no node involvement. Doctors recommended I do the Oncotype test which I did and had a results of 16. So all my results are in the \"GREY\" zone but because of my age my ONC suggested I do the chemo and put all the chances on my side. This is what I did, yesterday I received my first chemo treatment. will be getting TC 4X. It was not without much sadness that I put my otherwise healthy body thru that experience but in the end I DO NOT want to have any regrets. I do fell I am doing everything possible to make sure this does not come back.  And even if I am reducing my chances of recurrence by only a few % points, well I'd rather be sure I did everything I could to fall in the no recurrence group. Hope this helps and good luck with your decision I know it's a hard one ... Marie",
      "MessageIndex": 16,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738514",
      "Title": "31 yrs. Old Struggling to decide on Chemo yasminv1 yasminv1"
    }
  ]
}