{
  "AuthorID": "mari-12",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
  "Posts": [
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "May 29, 2010 10:12AM mari-12 wrote: Hi danielaes - I keep pushing the thought of having chemo out of my head. It's overwhelming to think about it really. I know we have to hang on to the the fact that the outcome will be a good one .....but I'm not dealing well with this and feel like I can't focus enough to finish any projects around the house. How are you doing with your projects? Glad we will be going through this together. :\\  twinmomjackie - Is it the tailorx clinical trial? It was suggested to me as well. I believe there is a thread on this site about it if you want to see what others are doing. You have a lot going on right now. I know it's hard but hang in there and do one thing at a time. Before you know it, you will be done.",
      "MessageIndex": 18,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "May 30, 2010 02:48PM mari-12 wrote: wow this list is growing.....Hi all!  I don't know why our treatments are so similar. I  live in New York. It seems that these treatments are not tailor made for us and our individual size, cells, nodes, oncotypes etc. When I was offered a choice between the A/C and the T/C., I said to the Oncologist, \"Are you kidding me, how am I supposed to know what to do, I didn't go to medical school!!!\" She wanted ME to go home and do the research. I was upset at first, did my homework and then spoke to the nurse practitioner's and the surgeon. The decisions came and I'm sort of relieved that we are getting close to the same treatments. I'm glad I'll be able to commiserate with you gals. On a side note......I just got my hair cut very short in preparation for the inevitable.....and splurged and bought myself a buff :/",
      "MessageIndex": 34,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "Jul 18, 2010 05:27PM mari-12 wrote: LuvUMom: The research that I did on various medical publication websites claimed....T/C was better in Grade 3 (aggressive) cells. My B.S. kept referring to T/C as well and I absolutely have the highest regard for his knowledge and trust him. Unfortunately, the Onco, who I can take or leave claimed it didn't much matter........My research and a second opinion said otherwise. My oncotype is 26... You will make the right choice and when you do, don't look back. I wish you much luck! I agree with all that TMarina has said with the Neulasta or Neupogen shot. Remember to take it out of the fridge 30 minutes before. I have to take it within 24 hours of each chemo round or I've been told I would end up in the hospital. I believe that each Onco is different however. If you have a nurse friend, I bet she would be happy to give you the shot as well as your internist or family doctor.  Kaycee: Thank you so much!!! I sent you an e-mail. I am going to take the glutamine regardless of approval. Like Latte, my Onco seems uninterested in supplements. It seems that if I present the facts and have legitimate information to argue, all of a sudden....., it's alright to go ahead and try it. So far the B-Complex seems to be working to decrease the numbness and tingling. I guess Mr Myers never experienced bone pain or neurapathy, but I appreciate the facts. Thank you for all the information you all have provided. I'm on my Decadron high and getting ready for #3chemo. Good Luck to all of you in your chemo adventures this week!! Thank you Jenn3 I needed that too!!! cyber HUGS ",
      "MessageIndex": 1139,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "Jun 30, 2010 09:10AM mari-12 wrote: Hello to all you courageous women!!! Monday, I had tx # 2 of Taxotere/Cytoxan. Aside from a 3 hour wait (Columbia was packed) and 8 attempts by 3 different nurses to start the infusion (port was not an option for 4 doses)....I had a meltdown.... but I survived and I'm happy to report that tweaking some of the drugs the past few days helped. Last night I had the Neulasta shot and the Onc suggested taking advil the day before and for a few days after to help alleviate the abdominal pain...I'm keeping my fingers crossed that it works this time!! Had a few hiccups but tolerable. Bloating is less due to pepcid and good ole pepto.  Today I look like that Fire Marshall with spotty bald patches. That was hilarious! Keep in mind that this is temporary and we are all moving forward! My head is as large as a watermelon too and I'm finding it very difficult to find caps/hats. Have the wig but it's just too hot so cotton scarves are working well. I need to find more. I do get lots of stares but I'm sure they are all because I'm beautiful as are all of you!!!!!!!! Stand tall!! Lots of Hugs to you awe inspiring gals!! Best wishes for few SE!! ",
      "MessageIndex": 763,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "Jun 30, 2010 10:57AM mari-12 wrote: DesignerMom, I too am so glad you had such a wonderful day and thank you for the head-wrap sites!! I'm going outside right now to enjoy this 80 degree gorgeous day in New York!! ",
      "MessageIndex": 767,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "Jul 16, 2010 02:25PM mari-12 wrote: DesignerMom: Is there a particular acidophilus that you take? I think it's an excellent idea and I will ask about it on Monday. I want to try anything that might be helpful to alleviate the misery. I will wait to get the green light from the N.P.  Can you believe that my oncologist gave me the choice as to A/C or T/C?  I was shocked and said to her you're the Oncologist and given my stage, grade, Onco type, Mammoprint etc. You should be telling me!  Instead she gave me the pros and cons and let me do my research and choose. I was so angry! I sat there like a deer in headlights thinking this is truly a crap shoot and she assured me that it didn't much matter which one I chose. It's water under the bridge now and all I can do is continue to move forward and hope for success. This Onco. btw is the head of her dept. with an impressive background. So much for that! Thank goodness for the N.P.'s!! As far as hair goes...I'll be having dose 3 on Monday and I'm still dropping 1/2\" hairs all around. At the same time I think I need another buzz. It's bizarre!. I wonder if I'll go completely bald.The lower eyelashes are also thinning. Hey I'm just happy it's the summer because I definitely have the buzz cut and it keeps me much cooler. I just hope it all grows back.",
      "MessageIndex": 1100,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "Jul 17, 2010 02:46PM mari-12 wrote: Thank you DesignerMom and Poppallicious for your recommendations! The Prilosec and Prevacid is not working for me at all so we are upping the ante and going for a prescription strength to reduce the stomach acid and I'm going to the health food store in a few minutes to get some quality acidophilus. I didn't realize that the live probiotics needed to be refrigerated but it makes sense. Thank you so much! I am doing the small, frequent meals with high protein and that does help. I'm also taking B complex to help with some slight transient numbness and tingling which seems to be helping. As far as the prickly hair thing goes: I'm looking pretty much like a cross between Fire Marshall Bill and a Rhesus Monkey!! It might be time to do a close shave and even things up a bit. The lint roller is working like a charm ;) Thanks for that tip too. Today the insurance check came in for the full amount of the wig. WooHoo! especially since I haven't worn it yet and don't intend to until this NY heat/humidity gets hold of itself which will probably be in Sept./Oct. Is anyone having adverse effects with the Neulasta shot? That's a trip in itself once you add it to the chemo. Geeezzz.  Getting a bit anxious for round 3 on Monday already...what's up with that? I guess I need to get busy but it's to hot and not enough energy. Stay cool and hang in there everyone! ",
      "MessageIndex": 1122,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "May 28, 2010 01:32PM mari-12 wrote: Hi Danielaes - I too will begin chemo this month. Please add me to your list. TC (taxotere/cytoxan) 4Tx-3 weeks apart. I'm starting June 7th. Just had re-excision last week... The best of luck to us all! We will get through this together and be all the more stronger women for doing so. The gals on this site have been my inspiration!!! ",
      "MessageIndex": 14,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "Jun 19, 2010 06:18PM mari-12 wrote: Hi everyone!! I had my 1st chemo on June 7th. Taxotere and Cytoxan. I too was feeling pretty drugged and was in my bed the 1st 48 hrs., out of it but not sleeping. On day 4 after finally falling asleep with the help of an Ambien, I awoke in the middle of the night to what I can only describe as excruciating abdominal cavity pain!! On a scale of 1-10, I was an 8-9.  I thought my spleen was rupturing (had the Neulasta shot the day before). My DH called the covering MD who suggested tylenol!! Ridiculous!! My DH was smart enough to give me a mylanta and that helped somewhat. In the arsenal of drugs that had been ordered there was direction to take Prilosec. I must've misunderstood and only took it that 1st evening of the infusion. YIKES!  By day 8 I was feeling somewhat human. Better now though :) A wonderful lady on this website gave me a great tip.....Zero Vitamin water, it's flavored. It has been my way of hydrating. Water tastes so yucky now but it is so important to stay hydrated. I too found that munching on candied ginger did the trick in keeping the nausea at bay.  Picked up the wig today, have plenty of scarves....shaving the head soon!! Bring it on!!!!  My best to all of you... we are all warriors in this courageous battle we are fighting and I'm grateful to be in such  great company!!",
      "MessageIndex": 459,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "Jun 27, 2010 12:41PM mari-12 wrote:",
      "MessageIndex": 681,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "mari-12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101676/profile",
      "Content": "Jul 15, 2010 06:55PM mari-12 wrote:   Hi All June gals......Yep I'm a shy one who's been checking the site to see how everyone is doing! I will start my 3rd of 4 rounds of taxotere/cytoxan on Monday and it's been a tough road. I'm halfway through! I'm usually down and out for a good 10-12 days.  S.E. have been progressive and difficult to manage especially the abdominal bloating/distention that is just about excruciating and awful leg pain that can't seem to be managed with Advil. I've hesitated to share this information as it is such a downer and I'm trying to stay positive. This is my good week now.    I give all you gals credit for managing work and your young children. My dtr. and son are both grown and trying to help. So that part has been great. I actually cooked dinner with my DD this afternoon.  I can't remember the last time we did that, so it was fun! She especially has tried to entertain me on my good days. Yesterday, the 3 of us went to LeCirque for lunch. It's restaurant week in NYC!! Tonight my husband made a delicious peach pie! Tomorrow it's lunch with some gal pals. So life is good!   My Oncologist has been mostly absent and cold.  I've been dealing with the N.P.'s for advice. They are very knowledgeable and have a heart in comparison to her. Thank goodness for this site and you gals for all your 'tips' in getting through this mess. The latest is the drippy nose and eyes. Very attractive.  DesignerMom - We have to meet up in NYC one of these days when I can get there on my own!! I too think it would be great to meet these extraordinary women we are in battle with. We can toast and toast to the end of this chemo nightmare!!! ",
      "MessageIndex": 1094,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    }
  ]
}