{
  "AuthorID": "MariitaM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255506/profile",
  "Posts": [
    {
      "AuthorID": "MariitaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255506/profile",
      "Content": "Jul 12, 2017 07:56PM MariitaM wrote: Hi Sweet_Pea, I'm sorry to hear about your case. I hope God gives you guidance into the hard decision you have to make soon. I'm curious to know how big is the area of your ADH? I thought that ADH is the beginning of formation of pre cancerous cells. I have read they are so similar to DCIS that the reason for surgery is to rule it out. How can you have pre cancer cells in a large area without it becoming invasive? I am confused as I thought ADH affects a small area because it is the beginning. If you or anyone can walk me through it, would really appreciate that. Also, wanted to update you guys. I got a call from my doc today as I have my surgery scheduled for this Monday 17th. She told me that as she and my breast surgeon discussed my case, instead of removing 5 masses, which is one papilloma on each breast, 2 fibroadenomas on left plus a PASH on also the left, to only remove 3. The reason they gave me was because my left breast, since has the 4 masses to be removed, will completely deform. I wasn't prepared to hear that as they had told me prior that i would see a change but not deformity. There is no reconstruction on tumor removal plus I truly don't have the means to pay for an implant. I guess I feel sad because we are used to seeing ourselves in the mirror and to know that will change is hard, but I also know that if I leave the rest in, I'll have to be monitored every 6 months. I've been monitored for the past 6 months and now all this happened. I spoke to my husband and my closest and we all agree that health comes first and the rest takes care of itself, if God allows, in its time. I am considering just leaving the PASH because there's not much info out there only that they are benign and that they don't become cancerous. Do any of you know or have more info on PASH? I also went to read on the forum for benign breast conditions and PASH but there's not much there either. Thank you so much to all who have responded as we are all in some way or the other walking in the same path. Mariita",
      "MessageIndex": 813,
      "PostDate": "12/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "MariitaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255506/profile",
      "Content": "Jul 7, 2017 04:17AM MariitaM wrote: Thank you very much for all the info. I have done tons of research and even if its a new paragraph I read, for me, it is so helpful! I'm 40 years old and about 2 months ago I was diagnosed with ADH. I have one papilloma on my right breast and another esclerose papilloma with atypia on my left breast. I also have 2 fibroadenomas that have changed and are growing and they also found whats called a PASH which is considered uncommon but benign. I know this thread is not current BUT It's refreshing to have found this forum where I can find support with those walking through a similar path. I have my surgery scheduled for the 17th of this month. My doctor suggested only removing the papillomas but I insisted on having the other 3 masses taken out. Not only because 2 of them are growing but because I'll be having surgery already. I'm the type that thinks that there's a reason this has all been found plus they are not suppose to be there, so for me, it's best to remove whats foreign. This has all happened in a matter of 6 months. I only had one fibroadenoma that was being monitored for about a year and a half. This is the reason I had been getting mammograms every 6 months in addition to diagnostic ultrasounds. My breast are dense therefore very hard to find stuff. I went for a follow-up with my breast surgeon yesterday only to confirm what I had been feeling for about a month now. I had felt a somewhat lump, (I have so much going on, I do not know what to feel anymore), in addition with pain. She also felt it and scheduled me for an ultrasound. Today I had the ultrasound only to find out its 2 more masses and they did not look good so I had to get them biopsied. I'm grateful to God its being caught on time but now I'm waiting again for the results to see if on the 17th I will need to have more tumors removed. I've had so many biopsies in a lapse of 2 months that I don't tell people anymore until I have a clear picture of what needs to be removed. I guess my main concern is the fact that because I'm 40 and with atypia that my chances for BC is not only high but in addition for it to be pretty invasive. I have 4 little boys and there are many things that cross my mind. I lost an aunt, (maternal side), to BC when she was 48. She went on remission for about a year and a half only for it to come back so agressive it became brain cancer. I guess what bothered me at the beginning, when I was told I had ADH, was that my parents and sisters made me feel like I was over reacting, that I was being negative and that I was jumping to conclusions. I knew what I had researched and quiet frankly was scared and all I got was silence and after that, that I didn't need to think like that and that it was going to be fine as long as I had a positive attitude. Making me wonder if they thought I was having a bad attitude. I was so confused as I was not expecting this. It wasn't fine, it still isn't, I'm not over reacting, as I had to research so much and ask my doctors many questions to get to that conclusion, and also asked them point blank if I was over reacting. I'm so grateful to my loving husband, beautiful boys and the friends I have surrounding me that have taken the time to not only ask how I am but to ask me to educate them on what I have and on what I have researched because they want to better help me. I have also read that the reason they remove these papillomas is because pathologist can't really determine through the core needle biopsy if this is DCIS because the patterns are so similar. Does anybody have more info on this? Also, why is it so divided among doctors on how to label these breast changes? Why do they tell us they are benign when they are really not. These are not normal cells, these are abnormal cells that are forming tumors which are considered precancerous. It is true, we don't have BC but it is pointing to something that shouldn't be there. That is the reason they are removing them in the first place, to rule out DCIS or to remove these abnormal cells but and then monitor us very very carefully because every case is different and they don't know who will develop invasive BC. Also, I have read that if pathologists find that the atypia is acting out funny, as they study everything after surgery. Doctors will recommend being put on hormonal therapy, (tamoxifen for pre-menopausal women), to prevent for these cells to be multiplying so much and so fast. Does anybody know if what I have understood is correct? If anyone can respond, I would be so appreciative! Thank you so much for reading, understanding and the support! ",
      "MessageIndex": 802,
      "PostDate": "07/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "MariitaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255506/profile",
      "Content": "Jul 7, 2017 01:16PM MariitaM wrote: Sherr, my heart goes out to you! First of all, thank you so much for responding. It tells us all we are not alone. I'm so sorry to read what you are going through. I will be praying this waiting time will not be so rough for you. I'm in shock to know that for many of us, these trails continue going on until the doctors find out how to better treat us. I so hope they tell you soon as it is better to fight knowing what you are up against as oppose to feeling the uncertainty of not knowing. Thank you for confirming what I had been researching and thinking. You don't really know until you have all the results back and they tell you for certain what you have! I have a great doctor but at the beginning she made it seem like my situation was just preventative and that it was something common. Only after researching did I know that many doctors won't tell you much and downsize everything just so we won't worry. On my second app I did tell my doc not to sugar coat things and to rip off the bandaid and to please confirm or educate me on what I had studied and read and that is when she told me I was right. I worry more not knowing and being blind sided as oppose to understanding what I have. We all hear it, KNOWLEDGE IS POWER! What are your thoughts on having a bilateral mastectomy? I asked one of my doctors about it to get info. My husband and I have sat and talked so much because it is such a personal decision but something so very tough to go through. I told my doctor and husband that if my diagnosis changes and I end up having DCIS, I would remove them both. It is difficult for a group of doctors to hear this, as this topic is a bit controversial. Many believe that there is no need to, but research has not made it possible to convince me that the statistics are there. Once you go on remission, even for early stages, when it comes back, it comes back aggressive. So I personally decided that even if they tell me that I'm at stage 0 or 1, that I will ask to have both breasts removed. Also, if in 6 months, I continue to need more surgery due to my ADH, I will consider it. I do not want to go through the fight to end up getting BC. This is my worry. If anyone can tell me how they see this, I would appreciate it! For now, my doc told me that what I'm getting is not a lumpectomy but that my left breast would most likely change. I wasn't prepared to hear that because there's no reconstruction there BUT it's best to be safe with fighting marks than trying to save the breast and just waiting for anything to change. Thank you for reading and supporting by sharing your thoughts and situation! ",
      "MessageIndex": 804,
      "PostDate": "07/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "MariitaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255506/profile",
      "Content": "Jul 8, 2017 12:01AM MariitaM wrote: Thank you scoutyboy! It does sound relieving to hear that every doctor, who truly cares for their patient will give us their opinion as to how they see and study each case. Most importantly it gives people like us, who still have to wait for results a better idea of what's out there. It does boil down to how much study and statistics are truly out there and how much research on ADH is given for all of us to make wiser decisions along with our doctors. All I know is that each case is different and as long as we study our case, ask questions and are proactive, the ultimate decision we made will be the best one with what we have. I'm happy to know that you have more peace of mind now that it's all gone. I'd be too. Keep us posted on to any changes. Hopefully never again though, only blessings! Thank you for your well wishes. ",
      "MessageIndex": 811,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "MariitaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255506/profile",
      "Content": "Jul 7, 2017 11:46PM MariitaM wrote: Hi Sherr, no I never went through fertility treatments. I actually don't fit in any mold. I was never on birth control pills, I did not get my period early and I am not considered directly linked to having BC history as it was my aunt that passed away and dealt with BC and not my mom or sister. All these tumors, with the exception of 1 fibroadenoma, have come out in a matter of 6 months which has me very puzzled. My doctor says it is normal, for fibroadenomas to show up when one goes through hormonal changes. I have felt every time I've gone through hormonal changes though. This last one, exactly at my 40th bday has been the toughest. As much as I've researched, I do think I got breast disease because of my hormones and not related to anything else. I cannot confirm that though as the doctors have not told me this. I keep forgetting to ask them, but I will next time. I cannot imagine the pain this surgery must of left and in addition the pain having to wait but hold strong, I'll be praying for you and may God bring healing to you! Please keep us posted on the results! ",
      "MessageIndex": 810,
      "PostDate": "07/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    }
  ]
}