{
  "AuthorID": "MarieBernic…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
  "Posts": [
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 10, 2014 01:27PM MarieBernice6234 wrote: Hi Hope50 - I am so sorry that you are having such a difficult time with the treatment. I understand about the redness and itchiness/soreness. I wouldn't waste anytime in telling your treatment team. It could be radiation dermatitis and the radiation oncologists are reluctant to recognize this if it appears on places other than the breasts. If the specific doctor hasn't seen it then certainly it doesn't exist.  MarieBernice6234",
      "MessageIndex": 351,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 13, 2014 03:12PM MarieBernice6234 wrote: Hi ForHisGlory - Don't always believe what the treatment team tells you. Just because they work with radiation doesn't mean they have all the answers. If it varies anyway from the norm, they always say it is not from the treatment. Hope it doesn't continue in that way.  MarieBernice6234 ",
      "MessageIndex": 395,
      "PostDate": "13/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Jan 1, 2015 03:57PM MarieBernice6234 wrote: Hi JustJean - I am glad you came back to the boards. I know exactly what you mean about the Radiation oncologists not liking to discuss the side effects of radiation. They don't even like to admit that there even are side effects. Mine didn't think I was having them either, but mine were a physical nature not an emotional one. If they admit to one patient, then they have to admit that to all their patients. There are more patients that have side effects then these doctors are aware of. I overheard many conversations in the treatment waiting room.I finished radiation 14 days ago tomorrow. It feels great to have that behind me. Now I waiting for the next phase the hormonal treatment or \"oral\" chemotherapy to start. They are going to put me on Tamoxifen. I am afraid of the Tamoxifen, but unfortunately, I wasn't through menopause yet. I am still coming off the Zoloft that I was taking for my depression. I have come down from 200mgs to 50 as of most recently. My Effexor has been increased up to 100mgs. Tamoxifen and Zoloft don't mix at all otherwise I wouldn't need to change  MarieBernice6234",
      "MessageIndex": 643,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Jan 1, 2015 04:06PM MarieBernice6234 wrote: Hi PoppyK - I know what you mean about the conversation while in the treatment waiting room. I had the most conversation with the group that was already mid-stream in their rad treatment. One by one they all finished up ahead of me and there was as much as conversation with some of the other ones.  MarieBernice6234",
      "MessageIndex": 644,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 10, 2014 01:55PM MarieBernice6234 wrote: Hi BeachBaby - Well today was my day for a \"melt down\" also. I have Boost day #2 tomorrow and end on the 19th. I spoke with my oncology nurse today about my weekly visit with my radiation oncologist yesterday. Long story somewhat short is that despite the fact I told her that something was wrong and she was slow in giving me the referral for the dermatology. She (RO) stated that it certainly wasn't radiation dermatitis which pissed me off. My anger carried over to today.The RO came by the room where my radiation nurse was discussing this (cue the waterworks) and she responded and didn't like when I told her that I felt like she wasn't listening or hearing me. She said with disbelief in her voice \" What do you mean I don't listen - I always listen to my patients\". She was forced by me to state that she originally didn't agree with me was BECAUSE she hadn't seen radiation dermatitis in that way before. She stated that if I wanted to say it was radiation reaction then she would call it that. It represented to me some arrogance, but back- pedaling all the same. I don't think she will challenge me like that again. Doctors may try to cross me once but never again. The doctors don't have anything if they don't have my cooperation and my body. You can vote with your feet! MarieBernice6234",
      "MessageIndex": 352,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 13, 2014 03:22PM MarieBernice6234 wrote: Hi All - I have a question about changes that happen to the skin during the \"boosts\". I was looking at the skin in my armpit; It looked like it dirty, so I tried wash it. Noticed that some of the discoloration washed off some was peeling as well. I am seeing some pinker skin underneath it. At times it feels really sensitive. Any thoughts? I only have 5 more boosts left ending on 12/19.  MarieBernice6234",
      "MessageIndex": 396,
      "PostDate": "13/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 5, 2014 06:36PM - edited Dec 5, 2014 06:45PM by MarieBernice6234 Hi JustJean - I am sorry that your day was so difficult and doubt that I would have done any better than you did under the circumstances. You were caught in the worse type of run-around. If your facility has a patient advocacy program go speak to them and let them take up the fight for you. I got my topics mixed up the part about the whacking was for Beachlady. I had a similar experience with the rad machine whacking me twice.Now they always manually make sure that there is clearance before they start to run the machine. I think that all the machines have the ability to be manually controlled. I don't have any knowledge about the lungs getting some of the radiation, but maybe someone here does. Don't look at the bigger picture of the number of days. Just take it one day at a time. Maybe find some way to reward yourself at the end of the treatment week. Hang out here - nobody expects you to have the pink ribbons and puffy clouds!  MarieBernice6234 ",
      "MessageIndex": 276,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 7, 2014 03:17PM MarieBernice6234 wrote: Hi CoyoteNV - The list of warriors you posted are those people who finished radiation or starting it?  MarieBernice6234",
      "MessageIndex": 296,
      "PostDate": "07/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 31, 2014 03:17PM MarieBernice6234 wrote: I was directed here by Pontiac Peggy, she said to look for LINKY Hi All - My lumpy area is finally starting to decrease in redness. My hair follicles are less burned or damaged as before. I have a question though. Some of the areas that have started to peel looks weird. If any of you have seen the ad on social media about the woman who is 70 years old and peels the skin off her face to look younger underneath. It really looks weird. Has anyone else had this experience? I can't quite explain it - sorry about that. MarieBernice6234",
      "MessageIndex": 624,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Oct 10, 2014 03:32PM MarieBernice6234 wrote: Hi Ariom and Straitlover -   Thank You for your suggestions. I think that I am finished with the ice. I dud the warm, not hot compresses last night.  It did seem to help. Today I stopped taking the Tylenol 325 pill and replaced with generic Tylenol 500.  Also I am using some Aspercreme on that lymph node site and actually whether it is mind over matter or whatever, but it does seem to help. MarieBernice6234",
      "MessageIndex": 3,
      "PostDate": "10/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/825280",
      "Title": "Which is better warm compresses or ice MarieBernice6234 Ariom"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 5, 2014 06:55PM MarieBernice6234 wrote: Hi BeachLady - Don't put up with the redness and itchiness. It is something that can be treated. Most likely it is radiation dermatitis. That was just yesterday. My radiation oncologist kept saying that it wasn't related to the radiation treatment. She was very dismissive of the whole thing. Hey, the rash was on the same side as the field that is being radiated. It is not rocket science. It was my radiation nurse that really helped me that with the referral. Hope this helps.  MarieBernice6234",
      "MessageIndex": 278,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 10, 2014 01:14PM MarieBernice6234 wrote: Hi CoyoteNV - I like all your Christmas decorations - especially the one of the cat on the living room. I have to get into the spirit a bit.  MarieBernice6234",
      "MessageIndex": 350,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 11, 2014 04:02PM MarieBernice6234 wrote: Congratulations Mmtagirl!!!!!",
      "MessageIndex": 370,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Jul 18, 2016 06:31PM MarieBernice6234 wrote: Hi 70Charger - I have a history of radiation recall as well. it was especially more active during radiation therapy. Overnight it reared it's ugly head again. Yesterday I went swimming and forgot to apply the sunscreen. I wasted no time in applying some Clobestol cream - the only thing that works for me. As I had very little left, I had to get in contact with the nurse practitioner in the oncology department. She wrote me another prescription with out hesitation. I like it when doctors etc. listen to us as we really do know our own bodies. What little bit I had earlier this morning and applied made a huge difference, so it is obvious that I made the right decision. MarieBernice6234",
      "MessageIndex": 12,
      "PostDate": "18/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842025",
      "Title": "Radiation recall after 4 1/2 years? Worried about IBC. rn4babies KBeee"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Sep 3, 2014 07:00PM MarieBernice6234 wrote: Hi Ganzgirl201 and Other Stage 1 Sisters -   Hey 201, I live just outside of Boston - small world!  I joined the \"sisterhood\" as of this past Friday, so I am just getting my feet wet here. My cancer is small, but new since last year. Only half a centimeter, but very well could have broken through the membrane basement. I am scheduled for a lumpectomy on Sept 30th, then progressing to 6 week radiation, then to Aromatase  inhibitor therapy. I also will be a lymph node removal (1-3) to check for spread. They will also do the onco test. I don't really know why, the growth is so small. Oh well, my BS just finished a Fellowship at Sloane Kettering Cancer Center - having performed anywhere from 600-700 surgeries.    This Spring/Summer season has not been kind. I am at the tail end of recovering from double broken ankles. Started my normal routine back at work for about one month and this saga gets started.    MarieBernice6234",
      "MessageIndex": 15198,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Oct 22, 2014 01:15PM MarieBernice6234 wrote: Hi Runnergirl and All -     I went to meet my Radiation Oncologist and the nurses today. Next week I am going for my SIM and tattooing. Finally, I will start the week after that.  My cancer center recommended Jeans Cream to be used during the process. Has anyone here used it, and what is your opinion of it?  Does anyone know where I could purchase a cozy, comfort pillow that I could use on my right side.  MarieBernice6234",
      "MessageIndex": 649,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 9, 2014 07:01PM MarieBernice6234 wrote: Hi All - Today was a bittersweet day. On the positive side, I am now down to the \"boosts\" rounding the final corner. My radiation oncologist asked me how my appointment went with the dermatologist for the severe rash on my arm. Although she couldn't tell me \"what it was\". She was very voiceful with what it wasn't. In her opinion, there was no way that the rash was related to the treatment. So I told her that the dermatologist stated it was radiation dermatitis. My radiation oncologist said directly to me. \"It's not radiation dermatitis.\" The background to the story is that the rash was only on the side of the radiation. Several times in the past couple of weeks I have been complaining about the rash and she was always very dismissive of the whole topic. I never could tolerate any type of arrogance in a doctor. Nor do I put them on a pedestal unless they earned it. The whole idea, especially in the oncology unit is on \"patient\" centered but yet the radiation oncologist wasn't putting the patient into the equation. Needless to say this doctor has not heard the end of it from me. Why is it sometimes that a doctor hasn't seen a particular thing illness, side affect\"or otherwise, it just simply doesn't exist. Has anyone else experienced something like this before.  MarieBernice6234",
      "MessageIndex": 1127,
      "PostDate": "09/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 10, 2014 08:53PM MarieBernice6234 wrote: Hi PontiacPeggy - Actually I did feel comforted by the radiation nurse - she was one of the ones who did believe me! She feels intimidated by the RO though. I really only have to have one more visit with the RO. I will focus on the remainder of my treatment and then decide what to do from that point. MarieBernice6234",
      "MessageIndex": 1138,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Nov 5, 2014 07:28AM - edited Nov 5, 2014 07:29AM by MarieBernice6234 Hi All -  I just started my series of 35 rads yesterday. In December I am supposed to have something called a \"boost\" either after my normal rad session or after my regular one. What is that and how is it related to the regular type?  I know that my RO has to oversee/do it in any event. MarieBernice6234",
      "MessageIndex": 826,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Nov 11, 2014 02:32AM MarieBernice6234 wrote: Hi Jeanelle - What is a bolus? So obviously it isn't being used with me. I will definitely bring it up with my radiation oncologist tomorrow. I know it seems early on for me to be mentioning side affects etc, that I think I might be experiencing. Everyone's body and system are different though. I know my body and I never had these types of complaints or feelings before and it is only on the side that the cancer was on. Hope everyone else continues to do well.  MarieBernice6234",
      "MessageIndex": 872,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 10, 2014 06:24PM MarieBernice6234 wrote: HI Jeanelle and Pontiac - Well today I had one of my meltdowns during my first Boost treatment. I spoke at greater length with my radiation nurse today and told her I was going to end my treatment here. And it came to light that my anger was spilling over into today. Cue the waterworks - my RO was walking by the room where the nurse and then she became concerned. I told her that I didn't feel like she was listening or hearing me. She said \"what do you mean I don't listen,,,,I always listen to my patients\". Then I was finally able to get her to state that she said it was radiation dermatitis because she never saw it happen outside of the area..Then she said she would call it reaction to radiation if that would make me feel better. I could tell that she was backpedaling because I caught her.I don't think she will ever challenge me again. I also have this philosophy that if doctors want to treat you...they have to have the body (or my body). I have no problems voting with my feet. Doctors might cross me once but there would be a second time.  MarieBernice6234",
      "MessageIndex": 1136,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Nov 6, 2014 02:48AM MarieBernice6234 wrote: Hi CoyoteNV -   It is always nice to see that you can find the humor in a not so fun experience. I too, like to try and find the funny spots.  When do you start your radiation therapy? I jut started on Tuesday and have 31 more sessions to go, of which 8 or 9 will be boosts. Everyone here is always so helpful.   Keep coming back.   MarieBernice6234",
      "MessageIndex": 842,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 9, 2014 09:55PM MarieBernice6234 wrote: Hi Pontiac Peggy - Yes, I love when doctors like to pull that sh** on us. I rather have a doctor who isn't afraid to admit that they don't know what something is instead of playing with our heads. That I can respect and get behind. Actually that happened to me today when my dentist said he would rather not attempt an extraction I need. He was afraid that the tooth would crumple and the roots would get left behind. I have to go the oral surgeon route. Can't fault him for that. Better that than he tries it and only makes it worse. I am not sure that is making the point. In any event, my medical facility has a strong patient advocacy program so I am going to bring it in front of them. Can't let it rest at this level. End of my rant. MarieBernice6234",
      "MessageIndex": 1132,
      "PostDate": "09/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Sep 2, 2014 06:08AM MarieBernice6234 wrote: Hi Alive4Five -   Glad to meet you. I apologize that I don't know enough yet to post all the finer details of my particular situation just yet All I do know is its size(less than half centimeter and that it is invasive with a combination of cells. ERS positive and the results of the HERS test hasn't come back yet. I don't even know how important the HERS test is.    I am going to meet with a general surgeon who works closely with the breast care center team. She is young, actually almost 16 years my junior and has only been out of medical school for 9 years! She had a fellowship  most recently at the Sloan Kettering Cancer Institue in NY.    I don't know if 9 years experience is enough. I thought it would be some type of breast surgeon and not a general one. What is a medical oncologist how is that different from the radiation oncologist or even my own primary care physician? Also do you know what Amarose Inhibiting medication.  What are the differences and similarity? Sorry for all the questions  MarieBernice6234",
      "MessageIndex": 12,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Sep 2, 2014 08:56AM MarieBernice6234 wrote: Hi Call-Girl7 -  Thank you for your quick response. You are right, there is a lot of information coming at me from all sides.  And more tomorrow, of course. You said that yours is invasive ductal cancer, I gather that there is a difference between the two diagnoses. My facility very strongly uses a team approach.and everyone has a nurse \"navigator\" like a \"go to person\" who walks through the whole process with you, They have a very close and intimate relationship.  It was actually upon her recommendation that I explored this site by name.  From what I understand, tomorrow will be both a follow up visit from my biopsy and a more personal explanation of my results. Along with this, it will be used as a pre-planning stage for what lies ahead.   I know that my situation is not that advanced that they will want to jump on it immediately, but it has broken through and away from the original cells so they will want to not have too much time pass before the lumpectomy. It is fairly certain at this point that some form of oral chemotherapy will be needed. Followed by a more conventional course of radiation.  My facility tends to use this type of three pronged approach. What is the difference between STAGE and GRADE- does grade address the aggressiveness of the cancer cells? The practitioner says it is a less aggressive form - does that give it a low grade number?",
      "MessageIndex": 15,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Sep 1, 2014 07:38AM MarieBernice6234 wrote: Hi There -  I don't know exactly where to begin my story. On August 8th I went  for an annual biopsy, not expecting much. I do have some calcifications noted on previous exams. Two or three days I had a call asking me to come back for more pictures. That had happened before so I didn't think much of it. My medical center uses 3D mammo machines as a routine practice. Then it escalated to magnification views. And as prepared they said that they were going to do breast ultrasounds. 2 of them. They still weren't thrilled at what they were looking at - it was a change since the last one. This necessitated a core needle biopsy which was done 4 days ago. . On Friday, the results came back as Invasive Breast cancer Stage 1. The area is very small a half of a centimeter, made up of some undifferentiated cells.My medical center has a three pronged approach, surgery, chemo (oral for me) and then radiation, probably 6 week course. There are some calcifications nearby this growth also so those are coming out as well. It is a mixed report -small, caught early on, invasive, but with a good prognosis.    Unfortunately, these events just happened following a 4 month period of time recovering from 2 broken ankles.  I had returned to doing home visits as part of my job, for about just a month until this started to unfold. They are going to be able to use some of the estrogen based medications as there are receptors there for that. Something called the HERS result has not come back - maybe on Friday.It is somewhat overwhelming at this time.  MarieBernice6234",
      "MessageIndex": 5,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Sep 1, 2014 11:39PM MarieBernice6234 wrote: Hi fire-n-ice -   I was also saddened to hear your news and can clearly  understand your feelings of being miffed at your daughters self centeredness. To place enjoyment over trying to \"be there\" for her mother is not commendable. It seems like you and I are relatively the newer kids on the block, with your diagnosis in July and mine in August. I certainly hope that your recovery gets a jump start soon and you leave the drains in the dust. It will come. BerniceMarie6234",
      "MessageIndex": 10,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Sep 3, 2014 07:48AM MarieBernice6234 wrote: Hi Members of this topic -    Today I had an appointment with the NP and then I met a surgeon (surgical oncologist). Despite my original trepidations etc about someone who was 16 years than me That proved to be unfounded - she is wonderful. In the last year alone, she had done between 600 - 700 breast surgeries of all types, while on a Fellowship at Sloan Kettering Cancer Institute.  That is almost double the amount of breast surgeries that her counterparts  at my medical center. Between the nurse practitioner and the surgeon, all my questions were answered. The surgeon stated that normally 1-3 lymph nodes are removed during the procedure. They are going to take out the collection of calcifications closest to the mass.  She doesn't expect that the HERS test will come out positive. She still thinks that when all is said and done, it will be a stage 1, grade one, not very aggressive. They are going to send a sample of tissue out for the Oncotype diagnosis test,  to see what  the likelihood of this type of cancer recurring. Again based on size, etc, she doesn't see this as being a real concern.   My surgery has already been scheduled for the 30th of this month, so the wheels are in motion.   If everything goes pretty much according to the rough schedule, I should have the surgery and radiation done by early December. Then I will be starting the estrogen blockers. Merry Christmas to me huh.     I am still trying to take it one step at a time. Trying to form a really good support team outside of this board. Although I am a Social Worker by profession, this time I am going to hand it over to the Social Workers attached to the team. I am not going to have the energy to take on insurance issues etc on my own behalf. This time I will let someone else do that. Besides when I do return to work after the surgery, I have to save that energy for my own patients, which doesn't have the emotional charge to it.                                   MarieBernice6234                                                                                                                                                                                                                                                       ",
      "MessageIndex": 19,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Sep 2, 2014 12:03PM MarieBernice6234 wrote: Hi Cali Girl 7  -   I just realized that I addressed you by the wrong name last time. Sorry about that. Thanks for another quick response and clear explanation. According to what you said then my grade would probably be 1 because they are supposedly more differentiated than not.   MarieBernice ",
      "MessageIndex": 17,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Sep 2, 2014 12:07PM MarieBernice6234 wrote: Hi Brookside Vt -    Nice to meet you here. Thanks for the clear and concise explanation, that helps a great deal. I will post the details of my appointment tomorrow. MarieBernice",
      "MessageIndex": 18,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 10, 2015 08:47PM MarieBernice6234 wrote: Hi All, I have mild lymphedema in my affected side (right). I have a compression sleeve, and have had cancer rehab therapy. More recently I have noticed an increased swelling in my right hand. It swells up at night, and there is pain in the hand in the morning. I saw my lymphedema specialist yesterday and she gave me a glove for the night time. I have also ordered a gauntlet to wear when I use my sleeve. From what I understand, lymphedema in the hand is hard to get rid of. She thinks that it is weird to have swelling in my hand overnight. Any ideas?  MarieBernice6234",
      "MessageIndex": 13,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/788452",
      "Title": "Lymphedema Treatment 101 - Questions from a Newbie guitarhero25 glennie19"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 11, 2015 07:01PM MarieBernice6234 wrote: Hi Kareenie - The \"Compression glove\" is actually one that is used for burn patients. It has some element of compression to it, but not so restrictive like the sleeve. I don't think I could wear the glove during the day, because it isn't easy to work with. The gauntlet I could because the fingers are opened andnot closed. Please do bump up the other article, though.  MarieBernice6234",
      "MessageIndex": 15,
      "PostDate": "11/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/788452",
      "Title": "Lymphedema Treatment 101 - Questions from a Newbie guitarhero25 glennie19"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Apr 20, 2018 03:13AM MarieBernice6234 wrote: Hi All - Even though I only had one lymph node taken out with my lumpectomy, I have stage 0/1 lymphedema (lowest level). I only have to wear my sleeve when it is symptomatic. That is becoming more often. There is also swelling in my hand. That does not really seem to go away. I read today that certain medications such as Anaestrazole or Tamoxifen can some times contribute to edema. Does that mean that it causes lymphedema? I have taken Tamoxifen for a little over two years (I think), Evista and for almost three months Anaestrazole. I know that a lot of information on the internet can be trusted.  MarieBernice6234 ",
      "MessageIndex": 1919,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Nov 10, 2014 02:05AM MarieBernice6234 wrote: Hi All - I am new to the radiation game. I just started last week, only 4 sessions though with 29 more to go. My last day is supposed to be Dec. 19th. Even though it has only been 4 days, I know that I am experiencing some of the skin issues. Over the weekend, I have been experiencing some pains in the breast. My nipple is darker and is appearing to not stick out as the one on the left, Talk about itchiness, at times - it drives me absolutely crazy.I have taken to putting my Jeans cream in the refrigerator so it is cooler. I also have Aloe Vera gel in the refrigerator that I could use. Any other thoughts . I can see my nurse tomorrow and my radiation doctor on Tuesday.  MarieBernice6234",
      "MessageIndex": 862,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Nov 10, 2014 12:31PM MarieBernice6234 wrote: ForHisGlory - I don't know at this point, but don't really think so. I have been using it since the week before rads started. This was recommended to me, and it wasn' until the rads started thaat it bothering me.  MarieBernice6234  ",
      "MessageIndex": 864,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Nov 20, 2014 06:15PM MarieBernice6234 wrote: Hi All - May I introduce a new topic here in this forum? Has anyone had an a rash from radiation that kinds looks like a prickly heat rash. It is only on the right side of my body - which makes sense as that is the side that is being radiated Pretty sure it is not related to any changes in medications. I am using simple soaps - the Aveeno line - either the regular bar of soap, or the baby body wash. Tomorrow I have to see the PCP to see what they think it could be or not be in any case.  Any thoughts? MarieBernice6234",
      "MessageIndex": 978,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 9, 2014 09:37PM MarieBernice6234 wrote: Hi Yikes - I can't say that it gets direct exposure to the radiation because they are very careful about positioning.From the explanation that I was given though, the affected breast does obviously retain the heat from the machine. Then of, course unless we are walking around with our arms up in the air, the inner aspect of our arms are going to be in contact with the source of \"heat.\" In that way, a prickly heat type of rash can develop. It makes perfect sense to me when you break it down. The proof is in the pudding because ever since I started the cream the dermatologist recommended, the rash is all but gone. MarieBernice6234",
      "MessageIndex": 1131,
      "PostDate": "09/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Dec 23, 2014 07:38PM MarieBernice6234 wrote: Hi Jeannelle - Glad to hear that you are starting to feel better from the rad treatments. How long ago did you finish? I just finished on Friday the 19th, According to what I was told that it could take up to a month to get back to the new normal. When do you start with the hormonal treatments? My next appointment with the medical oncologist isn't until January 22nd- maybe that is when she will discuss it with me. Right now I am in the peeling stages. At times, I feel totally overwhelmed with everything. Trying to get ready for Christmas, the holiday is tough because I lost my Mom about 21 years ago. I think I miss her more this year because of the BC. Trying to select a new health insurance policy. Here in Massachusetts, it is mandated by law, but the system is rift with difficulties. Also my antidepressants are in a process of being tapered down and switching over to a new one. Did anyone else here have emotional reactions to the end of radiation? MarieBernice6234",
      "MessageIndex": 1182,
      "PostDate": "23/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MarieBernic…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204581/profile",
      "Content": "Apr 26, 2018 02:39AM MarieBernice6234 wrote: Hi Hugz4u - Thanks for the quick reply. I haven't been able to check back for a few days. Yeah, I wasn't really sure about those drugs making the problem worse either. You can't competely trust everything you read on the web either. I am trying to arrange another appointment to go back to the lymphedema department of my treating hospital to discuss it as well as possibly the best hand garments to be wearing now at this point. Hopefully I will be able to set something up soon. I haven't heard from the person you were referring to either so perhaps I will PM her. I will let you know what I find out.  MarieBernice6234",
      "MessageIndex": 1921,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    }
  ]
}