{
  "AuthorID": "marionkluge…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280999/profile",
  "Posts": [
    {
      "AuthorID": "marionkluge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280999/profile",
      "Content": "Nov 20, 2018 09:00AM marionkluges wrote: stopped the 4 cycles of the red med and going to go to taxol, perjeta and Herceptin.(this will be for a long period of time) today is the first dose and from what im reading some people experience a lot of different side effects. I really dont want to keep going through all this wondering each time about the side effects. anxiety level is high. they got the tumor out,didnt spread but they tell me their maybe cancer cells floating through out the body. im beginning to wonder going thru all this, will I feel another lump one day or maybe somewhere else another cancer? im so  confused with all this even talking to all doctors, reading,etc. ",
      "MessageIndex": 2,
      "PostDate": "20/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/868058",
      "Title": "Triple Positive Breast Cancer marionkluges marionkluges"
    },
    {
      "AuthorID": "marionkluge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280999/profile",
      "Content": "Dec 5, 2018 11:23AM marionkluges wrote: you went through a lot for a small tumor. that arimidex is what got me sick and I refused to take it anymore. then then doxorubincin is the same thing. so far two treatments with the taxol ,Herceptin and the perjeta every three treatments. so far so good. considering all this medicine its not a cure all. after 30 or so treatments of the Herceptin then they want to do radiation then some pill. (I heard from someone in the Babylon breast coalition and she stated that 6 months some feel is a better option then the year on the chemo.   right now I have to also deal with a fallen bladder which is starting to bother me. when it rains it pours. so I may stop all chemo and get that attended to. so will need to think this all out. I wish you the best of luck  beccafish with all you went through. ",
      "MessageIndex": 4,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/868058",
      "Title": "Triple Positive Breast Cancer marionkluges marionkluges"
    }
  ]
}