{
  "AuthorID": "MarisaG",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206812/profile",
  "Posts": [
    {
      "AuthorID": "MarisaG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206812/profile",
      "Content": "Nov 5, 2014 05:07PM MarisaG wrote: Hi all, I had a lumpectomy Oct 27th and didn't get clear margins so another surgery in a couple of weeks. Still waiting for my mammoprint results to see if I will require any chemo but was told I def need radiation. I was told I had 3 choices, one week 3 times a day (RO didn't recommend this), 3 weeks and 1 day or 6 weeks. He said I was a perfect candidate for radiation (whatever that means). So, if all goes well with my mammoprint status I should be starting radiation in around 6 weeks. Brings me right around Christmas. My husband has stage IV colon cancer so i'm very familiar with many of the side effects of treatments (unfortunately). I would be delighted to share my experiences with the group. Trying to keep the happy face!",
      "MessageIndex": 18,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MarisaG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206812/profile",
      "Content": "Dec 7, 2014 06:55PM MarisaG wrote: Hi Jarspyd.. I am in Philly too and I go to Beth Dupree as bobogirl had mentioned. She is absolutely wonderful and don't know where i would be without her. She is affiliated with Holy Redeemer and St. Mary's. I have a friend who is a plastic surgeon who tokd me she is the best in the area. Her resume is beyond amazing. I also have almost the same diagnosis as you. However, I opted for lumpectomy and didn't get clear margins so i had second. I was just told last Monday that they found 2 more primary tumors and need a mastectomy. These are not showing up on any tests. Therefore I will get a double since we don't know if they are hiding in the other breast as well. I will have chemo first right after Christmas. PM me if you want to talk. Its a tough time for us all.",
      "MessageIndex": 13,
      "PostDate": "07/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826802",
      "Title": "age 45, just diagnosed, Philadelphia jarpsyd Jenmarie9"
    }
  ]
}