{
  "AuthorID": "mariemarie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82140/profile",
  "Posts": [
    {
      "AuthorID": "mariemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82140/profile",
      "Content": "Apr 23, 2009 06:20PM mariemarie wrote: Add me to the list please. I had my first AC a week ago, started feeling physically better after 4 days but am still mentally slow and fuzzy. I'm trying to work, so far my boss has been great but it's surprising how this stuff kicks your butt, even after just one treatment.",
      "MessageIndex": 432,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "mariemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82140/profile",
      "Content": "Apr 26, 2009 07:35PM - edited Apr 26, 2009 07:37PM by mariemarie HelenNC, sorry to hear that you are having to go through bad hair days BEFORE chemo. It's not fair! The hair thing has been tough for me too, but since they told me it would fall out at 7 to 14 days past the first AC (which as 4-16), I shaved it off on day 8. I wore a wig the first day at work, everyone said it looked good, but at the end of the day the one person who didn't know about the BC asked me why I was wearing a wig. I guess it was more obvious than I thought. So anyway, I'm mostly done with the wig. The kids (11,10, 6 y.o. boys) prefer the wig, but most of the time it's caps from Hats with Heart. I dreaded going to church this morning in my chemo cap because there are just too many people there I haven't told, and ya know, people don't want to come up and ask if you have cancer-why else would I wear this hat? It was hard to see the honest, curious, (and some semi-horrified!) looks of the many children we know at Mass. Glad I got through this day. From now on, in public, I have cancer and am fighting it proudly! Love and blessings to all who post here. Mostly I've been reading and gathering info and wisdom from you all, and thanks to you all for your sharing the funny and the awful. My AC #2 is this Thursday. If it goes like AC #1, it will be OK.",
      "MessageIndex": 486,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    }
  ]
}