{
  "AuthorID": "maribel101",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225762/profile",
  "Posts": [
    {
      "AuthorID": "maribel101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225762/profile",
      "Content": "Dec 19, 2015 07:49PM maribel101 wrote: thank you so much for taking the time to answer to my post. i'm having a ductogram in a week and then an MRI. Yesterday, the doctor took a sample again and first was milk since I had a baby 15 months ago and then blood came out :( I started crying like a little girl. I dont feel any lumps but I do know that there is such a thing as duct cancer I think. I'm going crazy and all I can think is about cancer.",
      "MessageIndex": 2,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838611",
      "Title": "Two types of discharge on one breast maribel101 breezy123"
    },
    {
      "AuthorID": "maribel101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225762/profile",
      "Content": "maribel101 wrote: Help! Having discharge but different color and texture on two ducts on same breast! Hi, I'm 34 years of age. I'm receiving care from a breast specialist and in two weeks, I will be having a ductogram. I started having discharge about two years ago from both breast and then suddenly from one. The best way I can explain it, it was a like a zit, it was creamy, yellowish and sometime white. I became pregnant shortly after that, I breastfeed for about 7 months, the discharge continued from the left breast but only from one duct. I did squeeze it on  a weekly basis because I wanted to find out what it was. I'm not doing it anymore. Not long ago, I had a mammogram and ultrasound and they were both clear, however they had to take extra images from my left breast due to being very \"dense\" at the end everything was clear. My breast doctor also took a sample of the discharge that came back normal. Just yesterday, I pressed myself (by mistake) into a wall, trying to reach for something and I had this weird feeling. Right away I check my bra and sure enough, there was a wet small spot. This was the first time that it happened without me squeezing it, I noticed that it look a little bloody, so of course, I squeeze it because I got terrified. I noticed that there was a brown discharge from another duct. I still have some milk left so here I have 3 different types of discharge on one nipple! On some ducts, I have left over milk, on one duct watery and bloody and on the other duct this brown liquid. I don't have any pain, but I do feel discomfort, like something is pulling my breast or like it feels heavy. I'm going crazy and all I can think its cancer. I won't get my ductogram until the 28th. I’m trying so hard not to cry and to be strong but is getting so hard ladies.  Any type of information or opinions are welcome. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838611",
      "Title": "Two types of discharge on one breast maribel101 breezy123"
    }
  ]
}