{
  "AuthorID": "MarieKelly",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
  "Posts": [
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 1, 2008 03:39PM MarieKelly wrote: Sherry, Low grade and small is a blessing when it comes to having invasive breast cancer. Mine was Grade 1 IDC mixed with grade 1 DCIS and just about 1 cm in size.  Although I didn't have a CT or MRI as part of my diagnostic workup, I did have a bone scan and that was a piece of cake  - nothing to worry about. Some docs order the works just because they're afraid something might slip by them if they don't - not necessarily because they're suspecting something. The only treatment I had was a lumpectomy and a sentinel node biopsy - no radiation, no tamoxifen, no arimidex, no chemo. It's been over 4 and a half years since my diagnosis and I'm doing fine so far. Hope you'll do as well.",
      "MessageIndex": 3,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/722123",
      "Title": "Bx result came in today msbusdriver msbusdriver"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Aug 22, 2008 10:58AM MarieKelly wrote: A viewpoint from the other side - I had grade 1 IDC along with my grade 1 DCIS - same small tumor 0.9cm in total. I refused the radiationa after lumpectomy. Also refused tamoxifen and arimidex (age 49 and in menopuase at diagnosis). It's now 4 and a half years since diagnosis and no recurrence as yet. So small, grade 1 DCIS with clear margins - something to think about.",
      "MessageIndex": 5,
      "PostDate": "22/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719584",
      "Title": "Rads for low-grade DCIS redheadace1 fullofquestions"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 14, 2012 03:07AM MarieKelly wrote: I completely understand your concerns, but didn't have any radiation to the left breast because I refused it. Being a life-long smoker, my research told me that radiation to any portion of the lung field of someone with a smoking history can cause a significant risk of developing a future lung cancer - far above and beyond the already existing risk just from being a smoker. Since I had only just turned 49 (but already in natural menopause) at the time and my BC was only grade 1, my fear was that I would likely live long enough to have that risk become a reality.  In addition, I had serious concerns about left sided radiation because I have a damaged mitral valve with valve regurgitation and even the slightest chance that the radiation would hit the mitral valve might have been somewhat disasterous for me in the long run as well. The radiation oncologist didn't bother to mention either of these concerns when I met with him for a consult and even worse, blew off my concerns as if they were complete non-issues.  I said 'no thanks' and walked out of his office over 8 years ago and all is well so far. My surgeon got very wide, clear margins with my lumpectomy and also took out the biopsy track and I have no doubt that it's to his credit that I've done so well since I also refused any hormonal therapy.  I just got the results of my 8 year mammogram yesterday and all is still great - no recurrence and best of all, no residual tissue effect from any radiation. The breast looks exactly like the other one and even on the mammogram itself, you can't even tell there was ever any surgery done on it. In light of your concerns about potential worsening of pre-existing lung disease, I'm telling you all this so that you'll know that refusal can be a reasonable treatment option in some circumstances, but not one that you're likely to be offered since radiation after lumpectomy for any kind of invasive BC is the current standard of care.  Best wishes to you.  ",
      "MessageIndex": 1,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/787418",
      "Title": "LEFT BREAST RADS. SE? purple32 purple32"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 21, 2008 02:41AM MarieKelly wrote: I'm right there with you about these concerns. I'm also a smoker. I knew about it when I was going through the diagnosis and treatment back in early 2004 and this was one of the numerous reasons why I refused radiation. This most recent information you're referring to isn't the first that's been available...concerns about post radiation lung cancer have been published since at least the mid 1990's. The article that I remember seeing during the time I was making my treatment decisions was published in 2003. I too, walked out of the rad onc office and said no thanks. The only treatment I've had has been the lumpectomy. I refused everything else and over 4 years later, there's been no recurrence. ",
      "MessageIndex": 1,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/705853",
      "Title": "Smoking and Radiation Therapy Leia Shirlann"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jul 18, 2008 01:28PM MarieKelly wrote: Shirlann wrote: \"It doesn't do much good to try to prevent lung cancer (which at present you don't have) by missing a link in your breast cancer treatment (a condition you DO have).\" In a very general sense, that's more or less true.  But that's not exactly what I meant in saying what I did because in my opinion, that's not true across the board for everyone equally.  My mistake, I should have made the statement more clear. The message I was trying to get across is that there is a very significant difference between having a high risk cancer vs a low risk cancer in regards to the weight of concerns about possible future side effects from any given treatment.  According to the few studies done thus far on the subject, radiation induced lung cancer in smokers doesn't rear it's ugly head until at least 10 years after the radiation. So essentially, when someone has an aggressive, high risk form of cancer which could possible kill them even sooner than 10 years if it's not completely brought under control, then worrying about a radiation induced lung cancer loses much of it's importance in making the decision on whether or not to undergo radiotherapy. Putting it very bluntly, it really doesn't matter what might happen due to radiation exposure 10 years or more from now if the cancer kills you before then.  So in a high risk situation, it's far more important to control the cancer NOW regardless of any potential concerns of what might happen as a consequence in the future. But it's a completely different risk vs benefit scenario for many with a small, low grade, low risk, node negative cancer who, in all probability, already recieved a surgical cure. If these kind happen to reoccur locally (and locally is all radiation is doing anything to control anyway), then the threat that this reoccurance might lead to distant, life threatening metastasis is far less than for the high risk type. So concerns about the possibility of a smoker developing lung cancer due to radiation exposure 10+ years from now in a person with these low risk profiles is a much greater concern because these are the people most likely to still be alive in 10+ years.",
      "MessageIndex": 3,
      "PostDate": "18/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/709251",
      "Title": "Thinking of not doing rads!!! nobleanna007 nobleanna007"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Apr 20, 2010 04:44PM - edited Apr 20, 2010 04:47PM by MarieKelly Lula, My suggestion to you would be to have a lumpectomy to get whatever might be left of that area out and assuming you get clear margins that are wide enough, do nothing else except maybe (big maybe) tamoxifen. I wouldn't do watch and wait with only a biopsy as treatment - you need the cancer removed first..  You're talking here about a very small area of grade 1 DCIS and presumably, nothing more showing on that MRI by the sounds of it from what you wrote.  Grade 1 is non-aggressive and slow growing and could literally sit there for many years before becoming invasive - or never even become invasive at all. Very small size and grade 1 is as good as it gets with a DCIS diagnosis, Watchful waiting, once the primary area of concern has been adequately removed, is a very reasonable option for someone with your diagnosis. There is absolutely no rush is making your treatment decisions, so don't let anyone, especially your doctors, make you think differently. Take many months to decide if that's what you need to feel completely comfortable with your treatment decisions. Start reading and learning everything you can about grade 1 DCIS and grade 1 IDC and keep in mind when reading on this forum that others may not have the same kind of breast cancer as yours. All breast cancer is not the same - some really requires the big guns and cannons hauled out while some, like grade 1 DCIS, only needs a single little B-B shot.  If you feel that you ultimately may want nothing beyond a lumpectomy, ask your surgeon to remove the biopsy track during the lumpectomy surgery. Doing this is an added bit of benefit in decreasing the risk of local recurrence and is especially important in someone who refuses radiation after lumpectomy. If he/she refuses or gives even the slightest indication that it's uneccessary, then find another surgeon who understands the potential benefit of doing it. Radiation after lumpectomy is done primarily to decrease the risk that residual cancer cells might have been left behind in unclear or inadequately cleared surgical margins or in the biopsy track, . If the biopsy track is removed and the margins are clear and adequate, then radiation offers minimal to no real benefit because the recurrence risk is already very loiw - especially when the cancer is low grade.  I had just turned 49 when diagnosed with not only grade 1 DCIS, but grade 1 invasive ductal (IDC) as well. I was however, already in menopause. So at diagnosis, I already had invasive disease. Still, the only treatment I've had for this cancer is a wide margin lumpectomy with biopsy track removal and a single node removed for sentinel node biopsy (to check for possible lymph node involvment because of the invasive component). My diagnosis was over 6 years ago and except for the 3-4 weeks or so with post surgical discomfort, my life has gone on almost as if it never happened. You can't even tell by looking at the breast without looking very closely for the faint scar that I ever had a lumpectomy and even on mammogram, there's such minimal scar tissue that it's barely evident.  I get a mammogram once a year and a breast exam with my yearly physical - and that's it in total. Don't overreact. Take time. Educate yourself.",
      "MessageIndex": 2,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751501",
      "Title": "cancer found \"accidentally\"--now what? lulalinky riley702"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jul 17, 2008 06:32PM MarieKelly wrote: Hi Bridget, While I'm one of those people who advocates for decreasing unnecessary radiotherapy in low risk, early breast cancer, yours doesn't fall in that low risk category. Being a smoker myself, I completely understand your concern about an increased risk of lung cancer from radiation. However, concerns about potential lung cancer risk loses a lot of it's relevance when you're weighing the risk vs benefits regarding a high risk cancer that had 5 positive nodes and is Her-2 positive.  Nobody here is going to be able to tell you what decision to make. Unfortunatley, you're kind of between a rock and a hard place with it. There's still a lot of debate going on about who actually needs post mastectomy radiation, particularly those with only 1-3 positive nodes.The general concensus is that those with 1-3 nodes benefit the least and can probably get away with not doing it, but 4 or more receive greater potential benefit and so should be radiated. Of course, there are a lot of variables within that generalization. For example, the fact that you had a full axillary dissection is a favorable factor against recurrence, while being Her-2 positive is not. The very best thing for you to do is to sit down with your oncologist, express your concerns and ask to be given information about the risk you would be assuming by not doing. Generally, personal decisions like this boil down to exactly how much risk you're willing to assume. Some people will do anything to lower their risk by a mere percent or two. Others are OK with assuming much more. Only you can decide how much you personally are willing to take on and in order to make that decision, you first must understand what your actual risk is.  These decisions are always very difficult no matter what the individual circumstances are. I wish you the best in making yours. ",
      "MessageIndex": 1,
      "PostDate": "17/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/709251",
      "Title": "Thinking of not doing rads!!! nobleanna007 nobleanna007"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Apr 20, 2008 08:21AM MarieKelly wrote: My armpit looks exactly as it did prior to my lumpectomy and SNB. I only had one node removed, so it's not as if there was a lot of tissue taken out that would create any excessive slack in the skin making it necessary to close the wound in an a odd way. Maybe your surgeon had a problem locating the node and took out a lot of tissue in order to find it?? In any case, I would consider using a different surgeon if you ever need surgery again, because it seems to me that what you descibed probably wouldn't have happened with just a single node SNB except for the way this particular surgeon did it. ",
      "MessageIndex": 4,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704287",
      "Title": "Armpit/hair moved during SNB Dejaboo MarieKelly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 12, 2011 04:20PM MarieKelly wrote: Pil, I understand your concern.  I had the same type of concerns and also have a mitral valve problem (though not valve prolapse) and had a left breast cancer. There are many different types of breast cancer and not all of them necessarily need to be treated with everything recommended under the standard of care. For some, such as small, and grade 1 resected with wide, clear margins, the overall local recurrence rate is relatively low even with nothing more done than just the surgery.   I had just turned 49 at diagnosis (and 8 months into menopause at the time) and refused everything but surgical intervention. It's been 7 and a half years cancer free for me thus far. I have very non-dense breast tissue so I can depend on a yearly mammograms to catch anything that might get started. I personally would never allow radiation prophylactically (just in case) but wouldn't hesitate, despite concerns about future radiation induced disease,  if I had a tumor that couldn't be controlled any other way.   You obviously are somewhat more concerned about radiation than most seem to be. Smart lady. Educate yourself very well as to what your PERSONAL recurrence risk is and then make the decision that you're most comfortable with.  Best wishes to you.",
      "MessageIndex": 21,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773149",
      "Title": "To choose radiation therapy or not having one NWMom MarieKelly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jun 21, 2008 07:19AM MarieKelly wrote: I had a bone scan as part of my initial diagnostic workup. Two lower ribs on the left lit up, but I know that I fell off a ladder in 1998 and assumed at the time that I had broken at least one rib because the pain was horrendous and took forever to go away. Since I never got an xray at the time of the initial injury, I didn't realize I had actually broken two. After the bone scan, the woman asked me if I had ever had any injuries on that side before. Honestly, if it hadn't been for the fact that the ribs healed a bit displaced and so are sometimes still uncomfortable to lay on, I might have completely forgotten the  fall and would have answered no.  So it's very possible that you also might have some past injuries that have completely slipped your mind. I know it's very hard to do, but try not to worry too much about it unless you know there's really something there to worry about. Old injuries are very common findings on bone scans. Fingers crossed for you!  ",
      "MessageIndex": 2,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/707745",
      "Title": "Abnormal bone scan result - ribs StaceyR carole1"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Feb 14, 2010 05:28PM MarieKelly wrote: notself, Hydrogen peroxide will bubble when poured on a wound or drainage from a wound whether or not there is an infection present. The chemical reaction that makes it bubble has nothing at all to do with an infection. It will bubble up on a slice of potatoe too as well as numerous other things that aren't even body tissue and aren't infected with anything... Try it, you'll see.",
      "MessageIndex": 5,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/745930",
      "Title": "Rads burn peeling and seeping yellow/greenish snot looking stuff buccaneersdj Bethie1"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Apr 3, 2010 02:31AM MarieKelly wrote: Yasmin, Younger women have a worse prognosis even when they're stage 1 with small tumors because younger women are the more likely to have an aggressive form of cancer. Cancer that is highly aggressive can become distantly metastatic sometimes even before the tumor is even large enough to be detected. It's not just simply being younger that carries increased risk.  Although you're considered \"young\" at 31, your tumors were all grade 1. So, when you're reading unfavorable statistics about younger women and poor prognosis in general, you're reading a prognostic conclusion that's based on the increased frequency of aggressive cancer in younger women which really doesn't apply to you personally just because you happen to be young.",
      "MessageIndex": 2,
      "PostDate": "03/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/750689",
      "Title": "Significance Of Studies??? yasminv1 yasminv1"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Nov 14, 2008 10:37AM MarieKelly wrote: sally1949 wrote: I have a palpable lump, so I'm wondering why I can't go straight to an excisional biopsy instead of having an ultrasound needle biopsy. From what I've read, with BIRADS 5, they will probably want to do an open biospy anyway, even if the needle biopsy is negative. I am going to check with my doctor about that tomorrow. It probably has to do with insurance. Sally, I had a Birads 5 lump too (not palpable though) and also in the mid to lower inner quadrant. I too, wondered the same thing about just skipping the biopsy and going straight to the lumpectomy and so I asked about it. The answer I got was that if it turned out to be malignant, a SNB would be required. If they don't do the biopsy first and just go straight in to get the tumor, the lymphatic channels might be disrupted making a SNB after the fact less likely to be successful in identifying and recovering the sentinel node. You certainly wouldn't want to have a SNB done without knowing for sure that there's reason to do it because there are potential risks from it that you wouldn't want to assume unless it's necessary, So knowing what you're dealing with ahead of time and then having a SNB immediately followed by the lumpectomy is the most reasonable and effective way to go. So they convinced me (while still in a diagnostic fog) that biopsy first was how it needed to be done.However, I personally would probably not have a biopsy first if I happen to get a new lump in the other breast if the Birad number is high. A low Birad number - yes, I would definately biopsy first. My reasoning being that I have no history of EVER having any lumps, bumps, previous biopsies or anything questionable visible on any mammogram...except for the mammo that led to my diagnosis. I have very fatty, non-fibrocystic breasts and they've always been that way, so it anything pops up in the future it's highly unlikely to be anything other than breast cancer.  So for a new lump in the other breast, it's very possible my decision would be to go straight for SNB and lumpectomy and skip the biopsy...or possibly even a SNB and bilateral mastectomy. I would probably do the same for a recurrence in the already affected breast as well, although another SNB on that side might not be doable.",
      "MessageIndex": 6,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/724413",
      "Title": "Pretty scared Triciaski vitaledoda"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 17, 2008 04:41AM MarieKelly wrote: Jules, From what you've said so far, it sounds like you've lucked out in getting a non-aggressive breast cancer.  Grade 1, ER positive, PR positive, HER-2 negative and a KI-67 less than 10% are all very good news and very favorqable prognostic factors...at least as far as having invasive breast cancer goes anyway! How big was this tumor??  KI-67 is basically just a measurement of how rapidly the cells are dividing...how fast the tumor is growing. Generally, anything under 10% is considered favorable. I had very similar tumor characteristics, but my Ki-67 was only 5%. I had only a lumpectomy with very wide margins and no other treatment and it's now been over 4 and a half years since my diagnosis.",
      "MessageIndex": 6,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721326",
      "Title": "INTERPRETING Pathology report????? jules3 OneBadBoob"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "MarieKelly wrote: Chemotherapy-induced structural changes in cerebral white matter and its correlation with impaired cognitive functioning in breast cancer patients. Deprez S, Amant F, Yigit R, Porke K, Verhoeven J, Van den Stock J, Smeets A, Christiaens MR, Leemans A, Van Hecke W, Vandenberghe J, Vandenbulcke M, Sunaert S. Department of Radiology, University Hospital Gasthuisberg of the K.U. Leuven, Leuven, Belgium. Abstract A subgroup of patients with breast cancer suffers from mild cognitive impairment after chemotherapy. To uncover the neural substrate of these mental complaints, we examined cerebral white matter (WM) integrity after chemotherapy using magnetic resonance diffusion tensor imaging (DTI) in combination with detailed cognitive assessment. Postchemotherapy breast cancer patients (n = 17) and matched healthy controls (n = 18) were recruited for DTI and neuropsychological testing, including the self-report cognitive failure questionnaire (CFQ). Differences in DTI WM integrity parameters [fractional anisotropy (FA) and mean diffusivity (MD)] between patients and healthy controls were assessed using a voxel-based two-sample-t-test. In comparison with healthy controls, the patient group demonstrated decreased FA in frontal and temporal WM tracts and increased MD in frontal WM. These differences were also confirmed when comparing this patient group with an additional control group of nonchemotherapy-treated breast cancer patients (n = 10). To address the heterogeneity observed in cognitive function after chemotherapy, we performed a voxel-based correlation analysis between FA values and individual neuropsychological test scores. Significant correlations of FA with neuropsychological tests covering the domain of attention and processing/psychomotor speed were found in temporal and parietal WM tracts. Furthermore, CFQ scores correlated negatively in frontal and parietal WM. These studies show that chemotherapy seems to affect WM integrity and that parameters derived from DTI have the required sensitivity to quantify neural changes related to chemotherapy-induced mild cognitive impairment. Hum Brain Mapp, 2010. (c) 2010 Wiley-Liss, Inc. PMID: 20725909 [PubMed - as supplied by publisher] http://www.ncbi.nlm.nih.gov/pubmed/20725909 Ki-67 5%. Wide margin lumpectomy and biopsy track removal. Refused radiation and hormonal therapy. Dx 2/22/2004, IDC, <1cm, Stage IA, Grade 1, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/757043",
      "Title": "CHEMO BRAIN seen on MRI MarieKelly Suzmor"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 18, 2008 06:01AM MarieKelly wrote:  Jane, Yes, Ki-67 and the mitosis score are similar in that they are both looking at how fast the cells are multiplying, but my understanding is that Ki-67 is a somewhat more sensitive/accurate test. Cells go through a number of phases as they multiply and Ki-67 is an antigen that is present in all phases of this cell cycle except the phase where the cell is resting and not multiplying. So in this test they use an antibody stain (MIB-1) that attaches to the Ki-67 antigen to identify the percentage of cells that have been stained. Among other things, you might also see this test on a path report called MIB-1 instead of Ki-67. It also could be that your pathologist didn't do this test and that's why you don't see it on the report. I'm not as familiar with the process on how they do the mitotic score. All I know about that is they look under a microscope scope and count how many cells they see dividing and then assigned it a score of 1, 2 or 3...with 3 being a tumor with the most cells that are actively dividing.",
      "MessageIndex": 9,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721326",
      "Title": "INTERPRETING Pathology report????? jules3 OneBadBoob"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Apr 6, 2008 02:38AM MarieKelly wrote: Sandy, I strongly agree with Otter's suggestion that you get another opinion... but preferably from a doctor NOT involved in recruitment for the TailorX trials.  Becoming part of that trial with your Oncotype being 16, small tumor, grade 1, stage 1 will mean you'll possibly recieve chemo you really don't need. A oncologist recruiting for that trial will gently sway you in that direction...one NOT involved will very likely tell you that you don't need chemo at all. If you don't need chemo, why would you consent to a trial that might cause you to recieve it. A second opinion will be virtually worthless unless it's being given by a doctor who isn't trying to round up patients for a trial.  ",
      "MessageIndex": 25,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/702340",
      "Title": "Oncotype DX results?? matic22 rockwell_girl"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 19, 2010 06:41AM MarieKelly wrote: cookiegal, I think maintaining a relationship \"just in case\"  probably is the main reason why people are told to continue seeing their surgeon on a regular basis. Otherwise I don't see any logic for it. I only saw my surgeon as a patient about a week after my lumpectomy and then again a month later. After that I was told I didn't need to see him anymore unless I developed a postoperative problem or otherwise required his surgical services again. He's just a general surgeon though, so maybe that's the difference. I do \"see\" him occassionally because I work in an ER and he's called in to sometimes to see patients needing surgery - just saw him there the day before yesterday and, in the course of a conversation in which breast cancer awarness month was mentioned, I told him how grateful I am for the wonderful job he did on me and that I hoped he wouldn't be retiring anytime soon just in case I need him again.  I actually don't have an formal followup with anyone other than a yearly physical by my PCP (which includes a breast exam) because I declined all treatment after the surgery and so there's no treatment going on for anyone to follow. I get the yearly breast exam, for all the good that really does (never had a palpable lump when diagnosed), some basic bloodwork as anyone would for a yearly physical and a yearly mammogram - and that's it.",
      "MessageIndex": 13,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759540",
      "Title": "Follow up with surgeon for 5 years? Why? Halah Mantra"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Apr 19, 2008 04:16PM MarieKelly wrote: Yes, benign masses, tumors, cysts can all grow. The main difference between a benign mass and a cancerous mass is that the benign mass does not invade surrounding tissues... it just kind of pushes against and possibly compresses surrounding tissue but doesn't actually invade the tissue. As a general rule, cancerous tumors are either invasive or have invasive potential. Benign tumors are not invasive, nor do they have the potential to become invasive. ",
      "MessageIndex": 1,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/704266",
      "Title": "Do Benign Masses Grow sissyjane TenderIsOurMight"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 13, 2011 05:14AM MarieKelly wrote: Melissa, this study suggesting some 60 and older women don't really too much treatment is talking about only a certain group of these women - those with small tumors who are grade 1. Your mother has a larger tumor and is grade 3 with low ER positive and negative progesterone  hormone receptors.  She does not fit in this category of women as her risk of both local and distant recurrence is higher - even without havng any positive nodes at diagnosis and even being just stage 1.  Has your mother had an oncotype test done? If not,having that done would probably help clarify her risk for you and assist in making treatment decisions.",
      "MessageIndex": 6,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/774491",
      "Title": "For those age 60 or older, early stage bc, considering treatment AlaskaAngel Kaara"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 22, 2008 05:46AM MarieKelly wrote: Yes, this definately means the margins, at least on that one side, weren't wide enough. I'm surprised a rad onc would even give you radiation without clear margins since, unless it's not possible to do so, they usually insist on it before starting radiation. I have the same question as the other - did you have a re-excison back then to clear this margin? If not, I'd be asking for an explaination from not only the surgeon, but the radiation oncologist as well since this margin issue could be what's responsible for this recent recurrence. Wide clear margins are very, very VERY important.",
      "MessageIndex": 3,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721584",
      "Title": "Close margins on lumpectomy Sher crazydaisy"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 10, 2011 08:54AM MarieKelly wrote: So, older women with small, grade 1 tumors have traditionally been been overtreated for nothing. What a shame it takes so long for these kinds of studies to produce results..and when they finally do, it takes forever for them to be acknowledged and for standards of care to change. For goodness sake - you don't even need studies to tell you the obvious. These kinds of tumors in older women are not life threatening. When I think of how many older ladies have been subjected to the side effects of treatment compromising their quality of life it makes me want to scream. And how much longer will the overtreatment continue? Many more years, I'm sure. It's so sad.",
      "MessageIndex": 1,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/774491",
      "Title": "For those age 60 or older, early stage bc, considering treatment AlaskaAngel Kaara"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 4, 2010 05:56AM MarieKelly wrote: That's how it was done for me too, Irish.  Had the mammogram that got me diagnosed in 2/2004, then had lumpectomy in 3/2004. Six months later, I had a mammogram ONLY on the breast that had cancer. I asked the mammo tech why only that one side and was told that 1) insurance wouldn't pay for another mammo on the healthy breast until 1 full year had passed and 2) you shouldn't subject breast tissue to unnecessary radiation and since there was nothing suspicious in that breast just 6 months prior, there was no need for it. She told me a mammogram would be done bilaterally again the following February and then anually thereafter...and that's what has been done ever since.   I was OK with that - it makes sense to me.",
      "MessageIndex": 1,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/746220",
      "Title": "HOW STUPID IS THIS ??? Irishred dlb823"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 17, 2011 08:14PM MarieKelly wrote: Unfortunately, just like most everything else that has a human factor involved in interpretation, there's interobserver variability in determining what the mitotic rate of a given tumor is. See the following as an example of the problem -  http://iospress.metapress.com/content/3502200775577718/ You can never just depend on a single prognostic factor standing alone - everything must be taken into consideration and when there's a single result that doesn't quite fit in with everything else (i.e. a high mitotic index with an otherwise obviously grade 1 tumor, you need to question the validity of that oddball result.",
      "MessageIndex": 10,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705247",
      "Title": "Ki 67 vs Mitotic Rate ck55 papaska4"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 11, 2009 05:56AM MarieKelly wrote: PARAS wrote: \"Why is the word sickness so offensive to you all a word by any other name would still make you throw up, it means afflicted with an illness or a disease.\" You hit the nail right on the head with that statement - being sick means having an illness or a disease - and to the best of my knowledge, I no longer have either one in regards to breast cancer. Just because someone once had breast cancer, does not necessarily mean that person has a chronic illness and should therefore consider themselves perpetually \"sick\". I know some people think of it that way, but I don't. Breast cancer is curable in some people and for many of us for whom it is, life goes on as usual and we are not \"sick\" in any way, shape or form. Since the only treatment I've had was lumpectomy and SNB, my whole breast cancer ordeal ended as soon as the majority of  the surgical incisional pain resolved....and that was almost 5 years ago. .",
      "MessageIndex": 75,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725761",
      "Title": "Do you consider yourself sick? shockedat39 kmccraw423"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Dec 11, 2008 06:24PM MarieKelly wrote: I certainly don't consider myself sick just because I was once was diagnosed with breast cancer. I HAD breast cancer - past tense. I don't have it anymore. I had a kidney stone once too - don't have that anymore either although just like breast cancer, I might get another kidney stone some day. For some who's disease has become metastatic, breast cancer is a chronic and sometimes fatal illness - but fortunately it's not that way for everyone.",
      "MessageIndex": 17,
      "PostDate": "11/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725761",
      "Title": "Do you consider yourself sick? shockedat39 kmccraw423"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 11, 2010 09:05AM MarieKelly wrote:  Hope, Considering the kind of cancer you had (small, grade 1, node negative), refusing radiation would certainly be a reasonable decision - and in my opinion, a very intelligent decision too.  There are most definately risks associated with radiation - many of which will not become evident until a decade or more has passed. After all, we're talking here about standard of care treatment that has some significant potential aftereffects both short and longterm. For some with an aggressive form of breast cancer, a local recurrence of that cancer would offer yet another opportunity for metastatic disease to develop. When it's aggressive breast cancer, that additional opportunity needs to be avoided at all costs. And so for those people, the potential benefits of local control by radiation after lumpectomy makes sense because the potential benefits outweigh the potential risks. Just stop and think for a moment - if someone has an aggressive breast cancer which has a high probability of eventually causing their demise if it becomes metastatic, that person may not even be alive a decade or more later. Which then of course, makes the potential long term consequences of radiation essentially a moot point.  On the other hand, for those with non-aggressive breast cancer, and especially those with small tumors that were very likely to have been sugically cured, the prospect of still being alive in a decade or more to suffer the possible consequences of treatment are very, very high. In these situations, the ratio of potential benefit vs potential risk is far less favorable to the patient. If someone was cured of the breast cancer by it's surgical removal (and many are) then it becomes all risk and no benefit whatsoever for that person. If someone with a non-aggressive breast cancer has a local breast reoccurence because some bit of the original cancer was left behind, it's likely going to be the very same non-aggressive cancer the 2nd time around.  Unlike high grade breast cancer which sometimes can become distantly metastatic when the tumor itself is very tiny or even microscopic, grade 1 breast cancer is very unlikely to become metastatic until it's much larger in size, if at all. The potential risk from grade 1 breast reoccurence is miniscule in comparison to that from a high grade reoccurence. So yes, in my opinion, keeping a close watch on things would be much more preferably to assuming the risks of radiation - assuming of course, you've got wide, clean margins. You'll be hard pressed to find an oncologist to agree that it's a reasonable decision. They prescibe treatment according the care standards and unfortunately, the current standards call for everyone with invasive cancer to undergo post lumpectomy radiation irregardless of their individual circumstances. So if you stand firm in that decison, be prepared to make stand alone with it. As you can see from my bio line below, I too had a small grade 1 tumor of which about 60% was IDC and the other 40% DCIS. My surgeon got very wide margins (the specimen removed was something like 7.5 by 3.5 cm) and he even removed the biopsy track along with it. It's now been over 6 years since my lumpectomy WITHOUT radiation and without any hormonal therapy either. My most recent mammogram last month was again completely negative. Having a heart valve problem and being a lifelong smoker would have put me at even greater (much, much greater!) risk for consequences of left breast radiation, but I would have been given it anyway by the radiation oncologist I consulted with -  and without even so much as a second thought about it from him, had I not known enough to refuse it. Good luck to you in making your final decision, but again - don't expect the medical professionals to support you. It would be a rare one who does. You won't get very much support for it here either, because most people wouldn't dare act contrary to what they're being told to do by a medical professional even if their gut was telling them otherwise. Just human nature, I guess.. ",
      "MessageIndex": 13,
      "PostDate": "11/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/747136",
      "Title": "Why do I need radiation? June2268 o2bhealthy"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jun 2, 2011 11:21AM MarieKelly wrote: Most, if not all, insurance plans won't pay for a screening mammogram more than once a year - which is why most physicians won't order them more frequently than that. The insurance companies base their payment decisions on research suggesting that there's an increased risk of radiation induced cancer from mammograms done more frequently than yearly or started on a yearly basis prior to the age of 50. If mammograms were being reimbursed more freely, they'd be ordered more frequently. It always amazes me when I hear or read a comment regarding some physician stating concerns about cumulative radiation exposure from screening mammograms when the very same physician wouldn't even blink an eye in referring a patient to a radiation oncologist for prophylactic breast radiotherapy after lumpectomy for a small low grade cancer...as if there's really no comparative danger in recieving radiation doses of that magnitude \"just in case\".  You think not?? The irony of it all just boggles my mind.",
      "MessageIndex": 6,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769758",
      "Title": "Birads ratings post-radiation changes Blinx"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 15, 2010 05:15PM MarieKelly wrote: This is going to sound very radical, but as someone who has worked in the health care industry for many, many years, my advice to your daughter would be to put them on notice. Tell your daughter that if any doctor ever dismisses her concerns about the possibility of breast cancer, she should first politely make sure that person understands that her mother was diagnosed late stage because someone dropped the ball and then that she intends to find the most aggressive lawyer she can if the same ever happens to her. That little statement, in and of itself, should immediately instill a sense of lawsuit fear in all but the most arrogant, which will in turn initiate a more thorough workup than she might have otherwise gotten.  Any mention of filing a complaint or seeking legal advice ALWAYS gets results where I work. Even if they think ordering an MRI or a biopsy is totally unwarranted, they'll do it just to cover their butts if there's even the slightest indication that a patient intends to sue if they miss something.",
      "MessageIndex": 8,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759381",
      "Title": "What's the trick to early diagnoses? BcMomOf3 eileen1955"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 4, 2011 04:57PM MarieKelly wrote: Mine turned out looking perfectly normal and the scar is barely visible almost 7 years later.  Interestingly, you can't really even see where any surgery was done on the mammograms I've had since.  It literally looks like it never happened - both in the appearance of the breast and on mammogram.  Honestly though, I think the tumor location, amount of tissue removed, surgical skill and how large the breasts are to begin with and whether or not any radiation is done all have an impact on how things end up looking.  I had very large breasts to begin with, so taking out a huge chunk (over 7 cm in one direction) didn't seem to make any difference for me and I didn't have post lumpectomy radiation.",
      "MessageIndex": 5,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/762882",
      "Title": "Breast appearance after lumpectomy Krix ruthbru"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 1, 2011 08:06PM - edited Jan 1, 2011 08:07PM by MarieKelly The hospital where I work has been using NightHawk radiology services for some years now. When CT scans are done in the middle of the night, they get sent straight to Nighthawk where radiologists in Australia (where it's daytime when we are night) read the scans and send back a report. The report clearly identifies that it was read by NightHawk. That way, the hospital doesn't have to staff radiologists around the clock and the radiologists never have to work during the night. Regular x-rays done after hours get read here by ER doctors and then double checked in the morning by the regular radiologists when they start their shift.  I don't know how it's handled elsewhere, but things like mammograms or other types of routine radiology testing wouldn't be sent to NightHawk because they wouldn't be scheduled during off hours and/or wouldn't require a stat reading.   At our facility, NightHawk is only used for stat reads when it can't wait until staff radiologists are available during regular work hours. ",
      "MessageIndex": 3,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/762779",
      "Title": "Just so you know before making decisions. Deirdre1 Deirdre1"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Mar 3, 2010 03:34AM MarieKelly wrote: I skipped EVERY day - refuse it all 6 year ago. So far,  not doing radiation has worked out just fine for me. In answer to your other question about why individual differences don't seem to matter when it comes to treatment like radiation,  it's because it's being prescribed under a standard of care.  Individual differences aren't taken into consideration under standards of care. Under standards, treatment is prescribed according to what's been determined to be most beneficial for a large group of people as a whole rather than what's best for each individual in that group. So they deliver treatment to everyone who meets the standards criteria to recieve it - whether they personally really need it or not, they get it.  It eliminates a lot of the decision making process for the physician who would otherwise have to make treatment decisions individually and in a more indepth manner. As long a a physician prescribes treatment under a standard of care, they're more or less protected from being successfully sued if they prescribe treatment that doesn't turn out well for the patient. ",
      "MessageIndex": 4,
      "PostDate": "03/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749143",
      "Title": "Can you/did you ever miss a day? Raili Raili"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 20, 2009 01:41AM - edited Oct 20, 2009 01:44AM by MarieKelly NANPAR, Since your mom is in such fragile health and suffers from other serious health problems, it could be dangerous to have her go through a course of radiation for such a minimal potential benefit. You didn't mention the grade of your mothers tumor. There's a tendency for older women to have grade 1 tumors, and radiation for a small grade 1 in someone her age who is already in frail health would be, in my opinion, unethical. Even for a higher grade or larger tumor, you still have to weight the risks vs benefits. I was 49 when diagnosed with grade 1 and I refused to allow myself to be radiated and also refused hormonal therapy for various reasons. It's now been 5 and a half years since my lumpectomy with no known recurrence.   Since your mother has an oncologist telling her the risk outweighs the very minimal 3% potential benefit, I would definately consider that recommendation a blessing. I don''t know what your mothers other serious health problems are but in having them at age 72, she's likely to eventually die of something other than breast cancer and adding the potential side effects of radiation onto her already heavy plate could put someone like that over the edge.  Listen to her oncologist and do your best to convince her that having the lump removed was all that was really necessary in her case.",
      "MessageIndex": 3,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742000",
      "Title": "I think we need a second opinion - Radiation or not? NANPAR MarieKelly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 1, 2012 05:16PM MarieKelly wrote: Clinical relevance of \"withdrawal therapy\" as a form of hormonal manipulation for breast cancer http://www.wjso.com/content/9/1/101",
      "MessageIndex": 1,
      "PostDate": "01/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786770",
      "Title": "Going off Tamoxifin and going on NOTHING!??? hannah4 hannah4"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jun 19, 2008 06:03PM MarieKelly wrote: I thought about it very briefly, but decided not to bother. With two different pathologists examing the two different specimens (and two different OTHER pathologists signing off on each report with each acknowledging that they were in agreement, I was satisfied in seeing that the pathology results from the mammatome biopsy were consistent with what was found in the lumpectomy.  If there had been some discrepancy between the two reports, or the particulars within a report didn't jive, then I would definately have sought out another pathologist opinion.  The only think that bothered me just a little initially about my surgical path report was that there was no specific margin widths stated. All that was mentioned was \"The biopsy cavity is well away from the resection margins\" and \"the surgical margins are free of malignancy\".  But since the tumor itself was only about 1 cm and the surgical specimen removed by the lumpectomy measured 7.5 x 5.5 x 3 cm , I figured that was plenty enough for good margins.  Since I haven't had a recurrence in over 4 years with no treatment other than that lumpectomy, it must have been enough.",
      "MessageIndex": 9,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707607",
      "Title": "Anyone ever think about getting a 2nd path opinion? BustersMom drcrisc"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 29, 2010 07:17AM MarieKelly wrote: Yes most definately - it's all about prospective. Sometimes those with an incurable cancer have a tendency to feel breast cancer in general is never curable because it's what they know from their own experience and their own current situation. I don't mean this as a derogatory statement, but sometimes misery loves company and it's more comforting to think everyone is in the same boat.  Realistically, there will never be a personal cure for each and every person diagnosed with breast cancer because there are just too many variables among individuals and among the many different kinds of BC.  I spent 14 years as a hospital oncology nurse . I began back in the days when most women got axillary dissections and mastectomies and virtually everyone got chemo which initially, was almost always done as a hospital inpatient. It was brutal back then - no better words to describe it than that. They would get diagnosed, have their surgeries and then come and go in the hospital recieving their chemo and then for some of them, eventually returning to us to one day die. Working there for such a long time, as many of us did, our prospectives about BC prognosis became very tainted.  One day after a patient had died, a few of us were talking among ourselves expressing our dismal feelings that sooner or later everybody dies of their breast cancer - because from our prospective, that's exactly how it seemed.  An oncologist overheard us and told us that it was absolutely not true. He decided that we desperately needed to see the other side of the coin and so he set it up so that each of us rotated through his oncology office practice for a day or two so that we could see the many women who had been cancer free for a very long time, sometimes for decades. He also pulled many office charts and in addition to actually seeing some of those he consided probably cured, we could see for ourselves in the records that not everyone dies of their breast cancer.  It changed our prospective entirely. Most breast cancer can be cured, especially in stage I and II,and many are, but some aren't. It's only stage IV breast cancer that is considered incurable and so it's treated palliatively instead of with curative intent.",
      "MessageIndex": 75,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758318",
      "Title": "Remission or \"cured\"? Halah wobbly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 29, 2010 09:31AM MarieKelly wrote: Lowrider54 wrote: \"Oh, by the way, after erradication (with removal of 25 nodes and yes, in 4) and chemo and Tamoxifin - at my 5 year mark, I was told I was 'cured' too - no evidence of disease\".  And there's the reason you are so angry and believe there is no cure. Can't say I blame you since that's what you were told to believe, but there's a big difference between how you started out in this breast cancer journey (stage II-III with 4 positive nodes and the 5th about to be included as well) and many of the women here you're trying so hard to convince that they need to be waiting for the other shoe to drop for the rest of their lives. Now I'm going to ranting too. You say you're hoping to prevent someone from ending up in your situation and don't want anyone to miss a miniscule clue in thinking that they are all clear. Yet you and some of the others on the stage IV forum get very angry when those with a lesser stage cancer go there and ask questions which you ladies admittedly interpret as a request to be assured they're not going to end up like you. If you're mission is as you've stated here, then why do you get so angry when they ask these questions of you stage IV ladies?  One would think that you'd welcome the opportunity to make sure they know they'll always need to look over shoulder for the rest of their lives.  And they're most likely NOT going to end up like you though - not everyone has multiple postive nodes at initial diagnosis and that's just one factor that automatically put you at a much higher risk than many others that don't have that problem from the get go.  I nor anyone else just casually reading these forums even knows what grade your original tumor was, or how big it was, what the hormonal status was or maybe even if it was her2+ back then too because as best I can tell, you've never mentioned it anywhere on this forum - as if all that information and the multiple positive nodes didn't have any impact on how you ended up with distant mets. Being clear and forthright on all that information DOES matter - most importantly since you're trying to convince others that they're likely going to end up like you someday. If you insist on continuing to spread your message of doom and gloom for all BC patients, please AT LEAST be forthright with your own BC information  in your signature line so that others can see that their situation might be very different from yours. I'm very sorry you were told that you were cured after 5 years and as I already said, I can truly understand your anger at having gone about your life thinking all was well only to later find out it wasn't.  I'm sure it must have felt like a bomb dropped out of nowhere. You really shouldn't have been told that considering your circumstances.  But your situation isn't everyone's situation, and many, many people live out their lives without ever dealing with breast cancer again. ",
      "MessageIndex": 79,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758318",
      "Title": "Remission or \"cured\"? Halah wobbly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Nov 8, 2009 05:49PM MarieKelly wrote: It's been just a bump in the road for me too...and a very small bump at that. Except for some minor residual surgical pain that lasted a few weeks, my entire breast cancer experience was over and done with in the course of about 3-4 weeks.   I was frightened only until the moment I got the biopsy path report and found out it was just a grade 1 IDC with tubular features mixed with grade 1 DCIS. Once I heard that, I knew the odds of local or distant mets was very minimal, so I immediately knew that as long as my surgeon got wide, clear margins, then I was essentially home free.  That's why I refused everything except the lumpectomy and SNB.  Before knowing the biopsy results though, I was imagining all of sorts of potential misery ahead and definately lost a few nights sleep over it.",
      "MessageIndex": 3,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743506",
      "Title": "Diagnosed and not Worried CoolBreeze Cisatypo"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 16, 2010 02:14PM MarieKelly wrote: Yes, they should. Read the following - http://www.ncbi.nlm.nih.gov/sites/entrez Local recurrence of breast cancer after skin-sparing mastectomy following core needle biopsy: case reports and review of the literature. Uriburu JL, Vuoto HD, Cogorno L, Isetta JA, Candas G, Imach GC, Bernabo OL. Division of Breast Diseases, Buenos Aires British Hospital, Argentina. juriburu@intramed.net.ar Comment in: Abstract The latest advances in diagnostic and therapeutic procedures for breast cancer have provided valuable technological breakthroughs. Yet the long-term consequences of these modern methods are still quite unclear. Such is the case for stereotactic or ultrasound-guided histologic needle biopsy and skin-sparing mastectomy. We report on three patients who presented with multicentric breast cancer diagnosed by stereotactic needle biopsy and treated by skin-sparing mastectomy. All three patients developed recurrence at the core needle entry site. Records of 58 patients with breast cancer who were treated by skin-sparing mastectomy followed by immediate reconstruction (with transverse rectus abdominis muscle [TRAM] flap or tissue expander) at the Breast Diseases Division of Buenos Aires British Hospital between December 1999 and December 2003 were reviewed retrospectively. Eleven of these patients were diagnosed by histologic needle biopsy. The mean follow-up was 28 months (range 5-60 months). Three (skin or subcutaneous) local recurrences at the needle entry site, diagnosed in a mean time of 23.6 months (16, 22, and 23 months), were reported. The three patients underwent complete resection with clear margins, radiation therapy to the \"neobreast,\" and tamoxifen. All three patients are disease free with a mean postrecurrence follow-up of 24.3 months (30, 23, and 22 months). Based on the evidence of displacement of tumor cells and the potential nonresection of such tumor seeding at the time of skin-sparing mastectomy, as well as the poor probability of postoperative radiation therapy, we recommend surgical resection of the needle biopsy tract, including the dermal entry site, at the time of mastectomy. PMID: 16684314 [PubMed - indexed for MEDLINE]",
      "MessageIndex": 2,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759432",
      "Title": "Should they remove the core biosy tract? mom38yo MarieKelly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Dec 22, 2009 10:16AM MarieKelly wrote: I was diagnosed in late 2/2004 and had a wide margin lumpectomy with SNB and biopsy tract removal a few weeks thereafter. I had excellent cosmetic results.  The affected left breast is slightly smaller than the other but always had been and otherwise looks perfectly normal - in fact, you'd never know I had such a large amount of tissue removed from it (large breasts to begin with).  The lumpectomy scar and biopsy tract removal scar are only barely visible. I didn't have post lumpectomy radiation because I refused to allow it ( or any other treatment) for a small, low grade tumor, so there's been no post radiation affects on the breast tissue. When 2/2010 rolls around, it will be 6 full years for me since diagnosis.",
      "MessageIndex": 6,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/745649",
      "Title": "Anyone with successful Lumpectomy stories momto3 ootee"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 22, 2010 07:44AM - edited Sep 22, 2010 11:08AM by MarieKelly",
      "MessageIndex": 22,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758318",
      "Title": "Remission or \"cured\"? Halah wobbly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 15, 2009 11:04AM MarieKelly wrote: Linn - I've done a huge amount of reading on the subject of radiotherapy through the last 5 years. I flat out refused it after my lumpectomy. They have definately NOT solved the scatter problem - there's been some reduction, but it hasn't been completely eliminated and I doubt it ever will be.  Scatter is probably not the biggest problem anyway - direct hits to organs and tissue adjacent to the target area is more concerning in my opinion. They've been coming up with ways in which to reduce that too but again, it hasn't been completely eliminated either.   You're right -  the younger the patient is, the more concern there is regarding long term radiation induced toxicity for the reason you stated regarding secondary cancers, but also the concerns about cardiac, thyroid and lung damage. In women with aggressive cancers and especially metastatic cancers,  the concern is not as great regardless of the age because if you're not likely to live long enough for a secondary cancer to be induced by the radiatiion, then it's a moot point.  Cardiac toxicity isn't usually apparent for at least 10 years after radiation and is more frequent in left sided breast irradiation. My cancer was in the left breast and already having a mitral valve problem, the risk was high for me.  Smokers who receive chest area radiation run a significant higher risk of eventually developing lung cancer. Of course, smokers run a higher risk anyway just by virtue of the fact that they smoke, but radiation increases that risk numerous times over. I smoked and still do ..another reason why I wouldn't allow myself to be radiated. I really don't know how many mammograms would equal one day of radiotherapy, but I wouldn't be surprised to learn that what you stated was true or very close to it.  The radiation delivered is not a minor amount by any means. Even the prospect of continuing to get yearly mammograms is beginning to worry me and after having them yearly for the past 5 years since my diagnosis, I'm considering asking to have a breast MRI instead of a mammogram at least every other year. There are even some hospitals who are starting to keep track of how many CT scans patients have becasue of concerns about the delivery of too much cumulative radiation. http://www.redjournal.org/article/S0360-3016(08)00128-4/abstract",
      "MessageIndex": 4,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742143",
      "Title": "Radiation scatter? linn56 jklls"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jul 3, 2010 08:07PM MarieKelly wrote: Kira1234, If you decide that you definately don't want to end up with an axillary node dissection no matter what's found, make sure your surgical consent form does not allow one to be done -  they'll usually always say that you are consenting to the possibility of an axillary node dissection.  When the surgical consent form was presented to me for my signature shortly before the surgery, I noticed that it read something to the effect of \" left breast lumpectomy and SNB with possible axillary node dissection\".  Since I absolutely didn't want anything further done other than a true SNB (1-3 nodes),  I crossed out and initialed the \"possible axillary node dissection\" on the consent form and then wrote in that I consented to only 1 node being removed and that up to 2 additional nodes could be removed ONLY IF the first node was very suspicious or blatantly involved. I also made very sure that my surgeon was aware that I did this and rather loudly, told him (any anyone else in earshot) as he visited my bedside just prior to the surgery. I also made sure the person who wheeled me into the OR and the anesthesiologist knew. If it had happened that no sentinel node lit up after the dye was injected pre-op, I would have refused the SNB outright rather than have a clump of tissue removed blindly. My tumor was small and low grade, but I still would have done the same had it been anything else.",
      "MessageIndex": 152,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/752976",
      "Title": "Risk after SNB/ Lillie Shockney gets it wrong kira voraciousreader"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Apr 28, 2010 01:58PM MarieKelly wrote: Polyana, I had grade 1 IDC mixed with grade 1 DCIS -  diagnosed over 6 years ago at barely age 49 on the first mammogram that I had gotten in 7-8 years. As Susie already mentioned, having grade 1 is cause for celebration as far as invasive cancer goes.  My tumor was about 1 cm in total size with 60% of it being the IDC and the other 40% being DCIS.  I had a wide margin lumpectomy with SNB which only removed a single node and then I flat out refused anything further. My surgeon already knew at the time of my lumpectomy that I was most likely not going to consent to further treatment and so I made sure he fully understood that I expected him to sacrifice good cosmetic results in favor of very wide margins if faced with that choice. He also thankfully, removed the biopsy track which can be very important for reducing local recurrence in someone having a lumpectomy who will not be having radiation.  So, if lumpectomy is an option for you, be sure to ask about biopsy track removal - whether or not you consent to radiation. As it turned out, my surgeon did an exceptional job and got both good cosmetic results and wide, clear margins - you can't even tell I ever had a lumpectomy except for the now very faint, small scars and yet my margins were huge (large breast to begin with though). And interestingly, he is nothing more than your average, everyday kind of general surgeon, but with an excellent reputation by all who know him. The prognosis for grade 1 breast cancer is very, very good.  People rarely, if ever, die as a consequence of small, well differentiated breast cancer and it is the least likely kind of invasive BC to ever become distantly metastatic. - so don't panic and be sure to take your time making treatment decisions. It was there in your breast a long time before it ever became clinically evident and a little more time won't make any difference.",
      "MessageIndex": 3,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751917",
      "Title": "My FNAB results Polyana debbie6122"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 4, 2011 03:00PM MarieKelly wrote: Personally, I think there's too much interobservor variability in tumor grading - which is one reason why, now that oncotyping is available, grade should never be the primary reason for prescribing chemo. It could also, at least to some extent, explain how you end up with recurrence scores that don't jive with expectations relative to tumor grade. On the other hand, there can sometimes be problems with the oncotype procedure too, so no one factor should ever be weighted in isolation when making treatment decisions. The big picture is always the clearest, and if anything in that big picture doesn't add up correctly, then a closer look is needed. ",
      "MessageIndex": 27,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Mar 26, 2008 10:40PM MarieKelly wrote: Mimi, I'm the one who asked you if you were certain your mothers cancer was really Grade 1, yet ER and PR negative and Her2 positive. Here's the reason why I'm asking - I'm not sure if you'll be able to access this link because you have to register at Medscape (free of charge), but in it you'll be able to see that Grade 1 IDC is never ER negative. In this study of 5,993 breast cancers, published in the American Journal of Clinical Pathology in 2005, there were 1,151 grade 1 tumors tested for ER/PR...not a single one was ER negative. Immunochemistry of Estrogen and Progesterone Receptors Reconsidered: Experience with 5,993 Breast Cancers  http://www.medscape.com/viewarticle/496991 Likewise, there's here's another study done regarding HER2 status where NONE of 146 nuclear grade 1 tumors and NONE of 184 architectural grade 1 breast tumors were Her2...so 100% Her-2 NEGATIVE. This one was also published in the Journal of Clinical Pathology in 2005. Correlation of Her-2 Status With Estrogen and Progesterone receptors and Histological Features in 3,655 Invasive Breast Cancers www.medscape.com/viewarticle/5... ",
      "MessageIndex": 3,
      "PostDate": "26/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702875",
      "Title": "Grade 1 and Hormone Receptors?? mimi1030 mimi1030"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 1, 2011 08:27PM MarieKelly wrote: Chemo was never a recommendation for me - but only because the tumor size was barely 1 cm. I had just turned 49 at diagnosis, but only had a small, low grade invasive tumor. Refused all other treatment (rads and antihormonal) and only had a wide margin lumpectomy with biopsy track removal and single node removed by SNB.  That was almost 7 years ago and I've had no more problems to date. (fingers crossed!)",
      "MessageIndex": 9,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Mar 8, 2008 09:55AM MarieKelly wrote: Here's another wrench thrown into the mix... I was just reading an article the other day that was talking about the fact that, prior to tamoxifen coming onto the scene, high dose estrogen was the hormonal treatment of choice to treat breast cancer. Go figure!!! http://breast-cancer-research.com/content/4/4/133",
      "MessageIndex": 9,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/700437",
      "Title": "HRT Risk? MinAZ Jellydonut"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 3, 2010 01:12PM MarieKelly wrote: It's been 6 years and 7 months since my diagnosis the end of February 2004. The only treatment I've had was a lumpectomy a few weeks after the diagnosis.",
      "MessageIndex": 40,
      "PostDate": "03/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 27, 2010 12:47PM MarieKelly wrote: I agree with others in feeling that radiation for this type of lesion would be overkill. ADH is generally considered a precursor to low grade DCIS and it's sometimes even difficult for pathologists to tell them apart.  Neither ADH or low grade DCIS is a life-threatening problem (low grade invasive usually isn't either). If I were you and at your age, I would allow nothing further to be done about it and just continue to enjoy life while keeping a close eye on things through whatever type of screening schedule your docs recommend.  I fully understand your concerns about radiation - I refused radiation for an invasive low grade left breast cancer after a lumpectomy over 6 years ago when I was 49 and have had no recurrence to date.  Best wishes to you.",
      "MessageIndex": 5,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/753151",
      "Title": "ADH, family history unavailable (adopted) lobelia awb"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Feb 25, 2011 11:11PM - edited Feb 25, 2011 11:12PM by MarieKelly It's been 7 years this month since my diagnosis and I haven't seen an oncologist since very shortly after my lumpectomy in March of 2004. I saw the first oncologist just twice and fired him on the 2nd visit. The next one I also saw twice - once when he suggested taking arimidex and ordered blood work to be sure I was really in menopause and the last time just to get the blood work results and refuse the arimidex. He told that since I wasn't actively undergoing any kind of cancer treatment, then there was really no need for me to continue seeing him and that I should just continue on seeing my PCP as needed and to return to him only if I needed his services in the future. That was music to my ears and made perfect sense to me. I just get yearly mammograms and that's it.",
      "MessageIndex": 4,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/765457",
      "Title": "How Many No Longer see their Oncos? Dejaboo memory"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 12, 2009 07:11PM MarieKelly wrote: I had low grade IDC (60%) along with low grade DCIS (40%) in the same 1 cm tumor diagnosed at age 49. Had a lumpectomy with a large amount of tissue removed and refused tamoxifen, arimidex and radiation. My residual tumor after biopsy measured 0.7 x 0.5 x 0.6 cm and the resected amount of tissue from the lumpectomy measured 7.5 x 5.5 x 3 cm. I actually have no idea what the precise margin widths were because the only reference to them is a statement saying \"The biopsy cavity is located well away from the resection margins\", but I'm assuming from the size of the specimen in comparison to the size of the residual tumor that it was a considerable amount of clearance.  I was diagnosed 5 years ago next month and all mammograms since have been clear. Next mammogram is due in March.",
      "MessageIndex": 11,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/682418",
      "Title": "anyone with low grade dcis not having radiation joe1234 ballet12"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 1, 2008 04:49PM MarieKelly wrote: djb1960, Hey, the story got even better on Monday - almost unbelieveable, but I swear it's true !  When he gave me that check for the nurse, I hugged him, kissed him on the cheek and told him he was a wonderful man for doing such an incredible thing for a co-worker...and told him that something good will happen to him someday because what goes around always comes back around when it's a good deed. He called me at work on Monday (he works his other full time job at a different hospital during  weekday hours) and he said \"remember when you told me something good would happen...\"? Well, he won $10,000 in the lottery!!!!!!!!!! Got 4 of the numbers!!!!!!!!!!  I wish he had won a million because he sure deserves it, but that 10K was fantastic too. So he got back 4X what he gave her in just one week. I'm not a religious person, but I have to admit this made me really wonder. The nurse has gotten the promise of another 32 hour a week job, but it's in a skilled nursing facility working 3p - 11p - not the greatest hours for a soon to be 64 year old but they're not using computer programs to chart, so hopefully she'll do OK. The doctor who is the assistant director of the ER wrote a letter to administration asking them to reconsider letting her go. I'm not sure if that had anything to do with it, but her time with us has been extended for an additional 2 weeks. We had her \"going away\" party last Wed and about 25 people showed up at the restaurant. Lots of crying and hugging. In total, we collected just over $3,300 for her and paid 6 month of her house property taxes, paid a $1000 credit to her heating oil company, paid her October home mortgage payment, gave her $150.00 in gasoline gift certificates and another $150.00 on a grocery store certificate. It was a glorious night.",
      "MessageIndex": 67,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Oct 19, 2008 01:00PM MarieKelly wrote: Helloooooo Anna ! Was just sitting here in triage thinking about calling you, but decided to look here first. Nice day here today. Baaaaaaaad day yesterday.  Did you get my message (left it with your daughter) about Deb's biopsy? It was benign!! Do you have a surgery date yet? We are all thinking about you and hope this all is behind you very soon. We love you!  Call me anytime  if you need to talk. If I'm not working the next day, I honestly don't mind a call in the middle of the night. Marie",
      "MessageIndex": 89,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 16, 2012 09:58AM MarieKelly wrote: KAARA, I refused radiation (and hormonal therapy too) back in early 2004. My surgeon removed the biopsy track - some automatically try to do it and others don't bother figuring radiation will take care of any stray cells left behind in the track. Even if he hadn't removed it, I still wouldn't have done the radiation or anything else because of the kind of cancer I had. Large, clear margins are a major plus in reducing the risk of recurrence for any grade and having a local recurrence from a small grade cancer isn't the end of the world. If I get it again, I will simply have another wide margin lumpectomy (assuming there's no contraindication for doing so at the time). Meanwhile, I've had nearly 8 great years not dealing with any side effects from treatment or worry about what radiation might have done to me... and no recurrence as yet!!. My breast looks prefectly normal and I rarely even think about BC anymore unless I happen to scroll across the link to this forum in my favorites list and decide to read here a bit. Not everyone who gets prescribed radiation after lumpectomy really needs radiation. It's a standard of care treatment, so it's another of the one size fits most kinds of therapy.",
      "MessageIndex": 32,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781063",
      "Title": "Radiation Therapy for early stage Kaara mimikitty"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jan 25, 2010 12:00PM MarieKelly wrote: I too, thank you for posting this. I just wish there was more investigation and reporting of issues like this. Unfortunately, it's not the kind of information that those continually promoting the widespread use of radiotherapy want the public to know. You can bet there will be at least one journal article published sometime soon that will discount the concerns and once again highly emphasize the purported benefits - as always, written and published by none other than those in the radiation oncology industry. ",
      "MessageIndex": 9,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/747272",
      "Title": "Frightening NYT article on radiation TX pj12 MAGOB"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 18, 2008 11:30AM MarieKelly wrote: I'm a nurse too!  Seems to be quite a few of us here. Graduated from a diploma program in 1985 after having gotten a AA in respiratory therapy and working part time at that through nursing school.  After graduating, I worked about 13 years in hospital oncology, then did a year or two floating around various units per diem before switching to full time ER about 8 years ago.  ",
      "MessageIndex": 16,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 20, 2008 04:40PM MarieKelly wrote: Just have to share this story of something wonderful that happened among co-workers int the ER today. One of our nurses who has worked there for years is being \"let go\". It's not soley because she's incapable of doing her job. There are some slight cognitive issues, but the computer age, and specifically our new charting by computer program, has made it extremely difficult for her to adjust. She's almost 64 years old, had open heart surgery about 3 months ago and was hoping to make it to full retirement at 66. Because she can only function well in the clinic area of our ER and has a hard time in the main ER and triage, they're giving her the boot. Her last day is Friday. Today, a group of us nurses were standing around talking about how upset we are that this is happening to her. The realization that it could be any one of us someday really hits home hard when you see it happening to a co-worker. We were discussing her dire financial straights and the fact that she could possibly end up losing her home because she won't be able to pay the soon to be due tax payment, not to mention the monthly mortgage payments. It's not easy getting another nursing job when you're almost 64 and so far, she hasn't been able to find one. Anyway, a physician assistant we've all worked with for many years walked in on our conversation just as we were voicing our fears about the soon to be due tax bill and collecting money amongst ourselves to make an attempt ot help her pay it and put oil in her tank to heat for the winter. Suddenly we hear him say \"Il pay her taxes - tell me how much and I'll write the check\" - and he was dead serious!! . We were FLOORED and some of us started crying - it was just so amazing that someone who is nothing more to this nurse than a co-worker would step up and do something like this out of the goodness of his heart. Since I'm the one is charge of collecting money and making dinner reservations for her goodbye party, this wonderful man handed me a check for $2500 (yes, twenty five hundred!) which will pay a full year of property taxes with a little to spare for the oil. So if any of you ever feel that your co-workers don't really appreciate you and that you wouldn't really be missed, remember this story. It gives me goose bumps just typing it out. I'm still in complete shock. And it's not even as if he's so wealthy he can afford to do this - he has worked TWO full time jobs for nearly 20 years to put his 3 kids through college, and now that the last has graduated, he's just got a little extra he felt she needed more than him. If there's a heaven, this man is going there without even having to stop at the pearly gates!!! ",
      "MessageIndex": 35,
      "PostDate": "20/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 26, 2008 08:37PM MarieKelly wrote: No, I don't have it wrong. See the following from the ACS - http://www.cancer.gov/cancertopics/factsheet/detection/tumor-grade What do the different tumor grades signify? Based on the microscopic appearance of cancer cells, pathologists commonly describe tumor grade by four degrees of severity: Grades 1, 2, 3, and 4. The cells of Grade 1 tumors resemble normal cells, and tend to grow and multiply slowly. Grade 1 tumors are generally considered the least aggressive in behavior. Conversely, the cells of Grade 3 or Grade 4 tumors do not look like normal cells of the same type. Grade 3 and 4 tumors tend to grow rapidly and spread faster than tumors with a lower grade.                                                                                             The American Joint Commision on Cancer recommends the following guidelines for grading tumors (1):  GX   Grade cannot be assessesd (Undetermined grade) G1   Well-differentiated (Low grade) G2   Moderately differentiated (Intermediate grade) G3   Poorly differentiated (High grade) G4   Undifferentiated (High grade)",
      "MessageIndex": 5,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706195",
      "Title": "undifferentiated carcinoma bt55 MarieKelly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 28, 2008 08:11AM MarieKelly wrote: To Held and Rockwell Girl - You and I are talking here about two different things. You're focused in on a grading score translated into a numerical grade. I'm talking about a grade of differentiation that's separate from a grading scheme/score...which is surely what the original posters oncologist was referring to when he mentioned \"undifferentiated\" combined with the statement that it is an \"aggressive cancer\". It helps to be on the same page when commenting on things. There is indeed a grade 4 which translates into an UNdifferentiated cancer that's highly aggressive. When looking at the the various grading schemes (Bloom-Richardson etc), these grade 4 undifferentiated cancers are included among the grade 3's. You apparently didn't bother to read the link I provided from the ACS, so I'll try again - \"The American Joint Committee on Cancer (AJCC) recommends the following cancer grading classifications: The lower the cancer grade the better the prognosis. G1 cancers are linked to the best outcomes. G4 is linked to the worst outcomes, and G2 and G3 fall in between. There are problems with grading, though. For example, many different grade levels may be found in one tumor or the tumor grade may change with time. There are also several grading systems for different types of cancer, such as the Gleason grades for prostate cancer or the Kernohan grades for brain tumors. Each grading system divides cancer cells into those with the most abnormal cells, the least abnormal cells, and those in between. Generally, whatever grading system is used, the lower numbers indicate less aggressive cancers while the higher numbers suggest faster cancer cell growth and spread.\" http://www.cancer.org/docroot/ETO/content/ETO_1_2X_Staging.asp",
      "MessageIndex": 12,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706195",
      "Title": "undifferentiated carcinoma bt55 MarieKelly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jun 6, 2010 02:39PM MarieKelly wrote: Chasinghope, You situation got me wondering - and since it's a horribly crappy day here and I've got nothing much better to do today, I decided to try and find an explaination. First of all, although your oncologist told you that the oncotype \"doesn't access or account for the grade\" of your tumor, I'm not so sure that's true. Yes, grade is not directly taken into account when determinining the recurrence score (RS). However, Oncotype is based on examining 21 genes. There are 5 control/reference genes and the other 16 are cancer related with 5 of those 16 genes specific to cell proliferation - so almost a third of the cancer related genes being looked at are about proliferation. Proliferation is how rapidly the cells divide and high grade tumors divide rapidly.  The mitotic count is one of the determinations made by a pathologist when assigning histologic tumor grade and the mitotic count is a measure of cell proliferation.  So, although the Oncotype test doesn't directly take someone's predetermined  tumor grade into consideration when calculating a recurrence score,  the genes associated with one of the 3 components of the Nottingham Grading System, which is the most commonly used system to determine tumor grade, is weighted heavily by Oncotype.   Now on to what got me interested - having a very low RS yet a grade 3 tumor. Everything I've ever read suggests that grade DOES correlates closely with the oncotype recurrence score. So in other words, those with grade 1 are most likely to have a low RS and those with grade 3 are most likely to have a high RS with grade 2 most likely to have a intermediate range RS. Obviously there are some, like yours, that don't correlate well.  So, in having had a pathologist assign a grade 3 to your tumor, it would be reasonable to expect that your RS would NOT be in the low range. Since it was in the low range, the question then becomes why the discrepancy? Here's something interesting I found - http://www.cap.org/apps/cap.portal?_nfpb=true&cntvwrPtlt_actionOverride=%2Fportlets%2FcontentViewer%2Fshow&_windowLabel=cntvwrPtlt&cntvwrPtlt%7BactionForm.contentReference%7D=cap_today%2Fcover_stories%2F0307brcancer.html&_state=maximized&_pageLabel=cntvwr \"Collaborating with pathologists at West Virginia University, Dr. Bloom blindly assessed tissue blocks from 28 patients who had previously had Oncotype DX performed. \"All 14 tumors that had a low recurrence score had high expression of PR and low expression of KI67 and did not overexpress HER2,\" Dr. Bloom relates. \"So if you want to find people with a low recurrence score, it appears that you could do that with three immunostains. Those also correlate very tightly with tumor grade, AND LOW-GRADE tumors almost always fall into the low-recurrence category.\"  Dr. Bloom calls the four tumors with a high recurrence score \"more interesting.\" One had 3+ expression of HER2 while a second did not express HER2 but had a proliferation index of greater than 50 percent. \"In the other two cases IHC data would have predicted a low recurrence score,\" Dr. Bloom says. Both expressed PR and had a low proliferation index. His initial conclusion was that IHC found all tumors with a low recurrence score but may have missed two with high recurrence scores. However, detailed analysis of the two discrepant tumors showed something more intriguing. A key factor in both tissue blocks was a cavity from the patient's previous needle core biopsy. \"So the block contained tumor, but also adjacent to the tumor itself we could see the needle track with inflammatory tissue including macrophages,\" Dr. Bloom says. \"IN THE BIOPSY TRACT THERE WAS GRANULATION TISSUE PROLIFERATING LIKE CRAZY. SO LOTS OF CELL WERE EXPRESSING KI67, BUT THEY WERE NOT TUMOR CELLS.\" Dr. Bloom also notes that a minor component in the recurrence score is CD68 expression, a macrophage marker. \"We saw numerous CD68-positive macrophages in the tumor block,\" he says, \"but no tumor cells expressing CD68.\" Taken together, he believes these findings can explain the discrepancies between the recurrence score and IHC results. Both patients with discrepant results elected to receive chemotherapy, he told CAP TODAY, \"even though without this test they would have received only hormonal therapy. There is no doubt in my mind that both of these patients were significantly overtreated.\" So here this Dr. Bloom has offered some insight into how a Oncotype tested tumor might erroneously appear to have a high RS  (due to seemingly high proliferation) because there was granulating tissue present in the specimen which was rapidly dividing (as granulating tissue normally does). In these 2 cases, Oncotype gave a high recurrence score which was apparently  inaccurate and if looked at closely enough, the reason becomes apparent.  Although your situation would be the polor opposite of these 2 cases described,  there's still got to be an explaination for yours just as there was with these two. So the take home message of my rainy day story is this - When there is an obvious discrepancy between expectations based on tumor characteristics and oncotype results and things don't jive, then something is amiss somewhere and it should be investigated further.   If I were you, I would definately get another pathology opinion (or maybe even two) to confirm that it's really a high grade tumor before consenting to chemo. If it happens that the Oncotype is correct, then the most likely explaination as to why RS is low is because the tumor is not high grade.  If I had to choose between believing the Oncotype score or believing the assigned grade, I would believe the Oncotype score. Histological grading is subject to a degree of interobservor variabilty - meaning that it's entirely dependent on how a particular pathologist calls it and that another might see it differently. Errors are inevitable when things are subjective. Oncotyping, while still subject to occassional errors as noted by Dr.Bloom is far more reliable, non-subjective and reproducible.  ",
      "MessageIndex": 9,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/753551",
      "Title": "Meaning of low Oncotype Dx score sling99 cuddyclothes"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Aug 17, 2010 10:47AM MarieKelly wrote: WinterStorm, Unless your doctors are telling you that lumpectomy is not a reasonable option in your case, there should be no reason why you can't keep the breast.  Many women opt for mastectomy (sometimes bilateral) even when they have a choice. Their reasons are varied - sometimes it's because they're at very high risk of an aggressive breast recurrence. Sometimes it's just because their level of fear is so intense that they just want one or both of them gone to minimize any future risk of breast recurrence  - sometimes despite that risk being very low.  Whatever the reasoning, don't assume it's mandatory unless your surgeon and/or oncologist says it is...and even then, obtain 2nd and 3rd opinions if you're not comfortable with the idea of having it done. A mastectomy, with or without reconstruction, is not always free of consequences as some here can attest to and some surgeons have a preference for doing them over lumpectomy even when they're not really necessary.  I was diagnosed with invasive ductal in 2/2004 - small and low grade.  I had a lumpectomy with very wide margins and being large breasted to begin with, the cosmetic result is so good that you couldn't tell it was every done by looking at me naked. Depending on where the tumor is located within the breast, how much tissue is taken and the skill of the surgeon, even those with smaller breasts can come out of the lumpectomy surgery essentially unchanged in appearance. I refused radiation and also refused tamoxifen and arimidex. It's been 6 and 1/2 years already since my diagnois and I've had no recurrence. Radiation after lumpectomy for invasive cancer is almost always recommended because it's the current standard of care, but it's not always really necessary in every case.  Some absolutely need it - many don't.  Most women with small, low grade tumors that have been removed with very wide, clear margins (perferably 1 cm or more) won't benefit at all from radiation because their cancer would not have reoccured anyway.  That's not to say another cancer couldn't or wouldn't develop somewhere down the road but some with initial low grade breast cancer like myself, are comfortable addressing that possibility only if and when it occurs. You make no mention of the specifics of your breast cancer other than it's IDC and hormone positive.  I suspect that maybe you don't know as yet. Find out the grade of your tumor which is one of the most important things you need to know. A biopsy report would have that information and your oncologist or surgeon would certainly know it. Then go from there in making your treatment decisions. If you don't know all the details, and especially the aggressiveness of the beast your dealing with, you can't possibly know what weapons are necessary and which are overkill.  If you're not sure that you want a mastectomy, then just have a lumpectomy for now. You can always do a mastectomy after a lumpectomy, but you can't ever go back and opt for a lumpectomy once you've done a mastectomy. If you have a lumpectomy and you think you might want to decline radiation, ask the surgeon to remove the biopsy track during the lumpectomy surgery. Some think it's a waste of time and unnecessary, some think otherwise. Mine removed my track and does so with every lumpectomy he does whenever possible. This gives one more added layer of protection (in addition to wide, clear margins) in decreasing the risk of local recurrence. Hope all my rambling helped!",
      "MessageIndex": 6,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/756777",
      "Title": "Why not just keep the breast? Halah dlb823"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Aug 20, 2008 02:58AM MarieKelly wrote: \"Fifteen years after breast-sparing surgery, 30.5 percent of women who got radiation had died of their disease, compared with 35.9 percent of those who did not -- five extra breast cancer deaths for every 100 women. (The numbers were slightly higher when deaths from all causes were counted, but the difference was the same -- five extra deaths per 100 women.) \" What's important to know here (and what this \"news\" report doesn't tell you) is the baseline details of those extra 5.4% of women who died after not having radiation. Were they node positive? Clean margins?  High grade or low grade cancer? Size of tumor? Vascular invasion or not?  I'll try to pull that Lancet article at work today and find those answers.",
      "MessageIndex": 13,
      "PostDate": "20/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719522",
      "Title": "RADIATION INCREASES SURVIVABILITY OF HIGH RISK PATIENTS. worriedhubby MarieKelly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Sep 18, 2008 06:18PM MarieKelly wrote: Hi Amber - No, I didn't go to nursing school until I was about 27. I had wanted to start earlier but I was living in California at the time and the nursing programs were impacted with long waits, so I got the degree in respiratory therapy while I was waiting.  Just as I was finishing the AA degree, an aunt died and left me some money which gave me the luxury of going somewhere else for nursing school, and so off I went to Massachusetts....directly from 3 years (including prerequisites) for RT straight into another 3 years of nursing school. Didn't do tamoxifen. Actually didn't do anything at all other than have a lumpectomy and just a single node removed in a SNB. Just had the surgery and that's it. I'm actually starting to get just a bit nervous about the 5 year mammogram coming up in March. -  not because I think there's anything cooking in there, but just of Murphy's law!!",
      "MessageIndex": 19,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 20, 2012 12:22PM MarieKelly wrote: With Ki-67, it depends on the pathology lab - whatever their protocol is. Some do it, some don't.  The main reason for oncotyping a tumor is to help determine if someone should get chemotherapy or not especially when it could go either way.  With small, grade 1 tumors like yours, there's really no question that chemotherapy isn't necessary so it makes sense that you wouldn't have had that testing ordered. ",
      "MessageIndex": 71,
      "PostDate": "20/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781063",
      "Title": "Radiation Therapy for early stage Kaara mimikitty"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Jun 6, 2010 06:29PM MarieKelly wrote: Thanks OTTER. I just wrote a whole post and then accidently deleted it. UGH! I'm wondering if you wouldn't mind taking a look at the following links and tell me what you think. Swimangels post about being grade 1 yet Her2 + by FISH reminded me of something I researched on another rainy day a few years ago and I'd love for you to tell me what you think. My interpretation is that what's in these links is a possible explaination for how so relatively few can have a well differentiated tumor yet seemingly be Her2+ when almost all Her2 + tumors are higher grade, and most often grade 3.  It seems to be saying that those that are polysomal 17 without amplification aren't truly Her2 + and because of that, possibly don't get any benefit from herceptin . Tell me what you think. Polysomy 17 in Breast Cancer: Clinicopathologic Significance and Impact on HER-2 Testing http://jco.ascopubs.org/cgi/content/full/26/30/4869 EDITORIAL Polysomy 17 and HER-2 Amplification: True, True, and Unrelated http://jco.ascopubs.org/cgi/content/full/26/30/4856 HER2 in well differentiated breast cancer: is testing necessary? http://www.ncbi.nlm.nih.gov/pubmed/18202913",
      "MessageIndex": 12,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/753551",
      "Title": "Meaning of low Oncotype Dx score sling99 cuddyclothes"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "Aug 20, 2008 01:51PM MarieKelly wrote: Here's the whole study in it's full context including all the webtables and webfigures that go along with it. It's under Fouth Cycle (2000 data). I didn't even have to use the hospitals subscription to access it because it's on the EBCTCG website. Haven't had a chance to do anything more than glance through it yet, but it doesn't seem to provide the answers to my question - at least not directly anyway. http://www.ctsu.ox.ac.uk/~ebctcg/",
      "MessageIndex": 16,
      "PostDate": "20/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719522",
      "Title": "RADIATION INCREASES SURVIVABILITY OF HIGH RISK PATIENTS. worriedhubby MarieKelly"
    },
    {
      "AuthorID": "MarieKelly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58503/profile",
      "Content": "May 26, 2008 07:36PM MarieKelly wrote: Undifferentiated (also known as anaplastic) is essentially the equivalent of a grade 4.  Cancers are graded according to how closely they resemble the normal tissue from which they originate. The more they resemble normal cells, the more \"differentiated\" they are. grade 1 = well differentiated cells grade 2 = moderately differentiated cells grade 3 = poorly differentiated cells grade 4 = undifferentiated (anaplastic) cells  You'll need more than just the term \"undifferentiated\" to determine the stage, but just by knowing that a cancer has been labeled as undifferentiated tells you that it's very aggressive, likely to spread rapidly and that it's very likely to be hormone receptor negative. It's like a wildfire in the presence of strong winds...even a small one can rage out of control with it's embers being carried into neighboring areas if not dealt with swiftly and aggressively. My best wishes to your Mom.",
      "MessageIndex": 2,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706195",
      "Title": "undifferentiated carcinoma bt55 MarieKelly"
    }
  ]
}