{
  "AuthorID": "Marie1983",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286684/profile",
  "Posts": [
    {
      "AuthorID": "Marie1983",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286684/profile",
      "Content": "Marie1983 wrote: I have some concerns about my mom's recent breast imaging. Recently, she had a 3D mammogram that showed an area of architectural distortion. She was asked to come back in for follow-up imaging, and the diagnostic radiologist saw a spiculated mass. In preparation for this follow-up appointment, my mom gathered her previous medical records. According to her records, a spiculated mass in the same area first appeared on a mammogram in 1995; she subsequently had a core needle biopsy that came back benign (there is no clip, however, marking the spot). The diagnostic radiologist she just saw noticed in my mom's records that in 1997, following a screening mammogram, the radiologist noted the area was stable, but recommended the mass be removed due to the potential for \"evolving malignancy\" (my mom doesn't remember this recommendation being communicated to her at the time). My mom has assumed this whole time that she has a benign radial scar (the 2D screening mammograms she's had up to this point have remained stable), but the diagnostic radiologist she just saw said her medical records indicated it \"looked like a radial scar,\" but it was never officially diagnosed as such. The diagnostic radiologist now wants my mom to have another core needle biopsy of the mass, which she's scheduled to have later this month. My family and I are hoping that since the mass has remained stable in size for nearly 25 years, it's likely to be benign, but we're anxious. Is it possible, or perhaps even likely, that this is a benign radial scar that hasn't evolved? Thank you so much for your time and input. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870262",
      "Title": "​ Architectural Distortion/Spicualted Mass/Possible Radial Scar Marie1983 Marie1983"
    },
    {
      "AuthorID": "Marie1983",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286684/profile",
      "Content": "Mar 9, 2019 07:45AM Marie1983 wrote: Thank you both for your input and reassurance; it's certainly appreciated.",
      "MessageIndex": 3,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870262",
      "Title": "​ Architectural Distortion/Spicualted Mass/Possible Radial Scar Marie1983 Marie1983"
    }
  ]
}