{
  "AuthorID": "marilynh",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72231/profile",
  "Posts": [
    {
      "AuthorID": "marilynh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72231/profile",
      "Content": "Oct 16, 2008 07:15AM marilynh wrote: Well i had the biopsy this morning -- new machinery plus was a guinea pig for something new --- i climbed on this bed - i was shown all the machinery and what was going to happen etc and that i need to lie very still for a long time - this took about 1.5 hrs.I never felt a thing no pain at all - i couldnt see what they were doing which was good - i had taken no medication at all.They removed 2 microcalicification clusters and on the screen they were gone after they have taken the samples this was then flushed out where the micros were with saline and another name which is foreign to me and this is supposed to stop bleeding inside the breast which it did..They managed to get to the correct allocation of the micros.I was then finished had a cup of tea and went home - no pain at all no discomfort whatsoever and feel fine - now its just the waiting for the results which i have been told 48 hours and could be 24hrs as it was marked urgent - so hopefully by the weekend i will know so i either have to plan the next action or rejoice and celebrate so being positive this is what i will do -- champayne here i come",
      "MessageIndex": 34,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    },
    {
      "AuthorID": "marilynh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72231/profile",
      "Content": "Oct 15, 2008 11:18AM - edited Oct 15, 2008 11:20AM by marilynh I am going for biopsy tomorrow at 9 south african time its been a long wait for this appointment and i certainly hope i will have the results before the weekend so i dont have to stress - even if they find anything positive at least i will know my next plan of action.So stressing rather but i have medication to take to relax me and i am fortunate that my Doctor is my daughter in law so i can get good advice from her.This is my 2nd biopsy in 2 years my first one was B9 and just the name of microcalcifications scare the hell out of me.There is no breast cancer in my family although my father and his sister died of cancer.I am 58 and only started going for mammograms 4 years ago because i feared them and hearing they are very painfull.So heres hoping to hear that wonderful word benign",
      "MessageIndex": 33,
      "PostDate": "15/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    },
    {
      "AuthorID": "marilynh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72231/profile",
      "Content": "Oct 4, 2008 11:37AM - edited Oct 4, 2008 11:40AM by marilynh Hi here is a letter explaining the biospy that is going to be formed on me on the 16th October This is a new type of Biopsy device --- vacuum assisted biopsy (vacora)This type of biopsy performed depends on the abnormality found. It is often necessary to remove larger samples of tissue to obtain a definitive diapnosis so that open surgical biopsy is not necessary.They offer use of a new innovative biopsy needle which enables larger specimens to be removed.The advantages are It is a all in one unit, therefore samples are easier to obtain. The procedure is more accurate than conventional biopsies and equates to open surgical biopsy done under anaesthetic. It is less disfiguring and less invasive that open surgery. The patient lies on her stomach on a special table - discomfort is minimal.THe procedure lasts about 45 minutes.Local anaesthetic is given. Normal activities may be resumed straight away -- complications ---very rare if any - infection and bleeding. I am in South Africa so looks like we are quite advanced --- still doesnt stop me stressing - but at least i can lie down and not sit like i did for my first biopsy.",
      "MessageIndex": 8,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    },
    {
      "AuthorID": "marilynh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72231/profile",
      "Content": "Oct 9, 2008 10:35AM marilynh wrote: Me again wish the16th Would hurry up so i can put this biopsy behind me - i read a article where a woman had many microcalcifications all scattered around both breast and this turned out to be cancer.So now very confused because i also have many of them.i have now also in the interim found a small lump feels like a tiny marble but on the left breast where i have the 2 clusters of calcifications dont know if my imagine is running away with me  now.I have not been going for mammgrams for too long a period. I am 58 and have only been 4 times.the 1st mammo was fine, the 2nd a small lesion, biopsied benign.Went for another mammo 6 months later was fine so waited a year and went 4 weeks ago where 2 new clusters have appeared.So certainly havent abused my breasts with too many mammograms.My gut feeling is not good and i just get told i will be fine.I just keep on searching wherever i can to get information so at least i will be prepared and of course also will celebrate if benign - so in the last 4 years there have been quite a few changes in my breats and i have also picked up a lot of weight due to medication i take for migraine and i have also been on hormone therapy Premarin 6mg for 15 years but now have stopped due to the added risk.I do like to have a glass of wine in the evenings so wonder whether this is also a risk.Thanks to all of you with all the information you have on this site its wonderful",
      "MessageIndex": 20,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    },
    {
      "AuthorID": "marilynh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72231/profile",
      "Content": "Oct 22, 2008 09:13AM marilynh wrote: Well got good news - all B9 so all my stressing and my son had the cheek to say - what you worry about never happens so now i must just go for my yearly mammo -- so it was very good news",
      "MessageIndex": 37,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    }
  ]
}