{
  "AuthorID": "marjoriesan…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148581/profile",
  "Posts": [
    {
      "AuthorID": "marjoriesan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148581/profile",
      "Content": "Apr 6, 2012 03:16PM marjoriesands wrote: Yes, I have the same problem.  Finished my radiation April 2011 and still having pain in the post surgical breast...a lot of soreness and also burning under my arm that appears like \"hot flashes\". Finally, my oncologist said the burning is probably from a nerve being severed during surgery, but didn't have any answer for the breast pain.  Now I'm having a new side affect...a year after radiation my hair is starting to fall out!  Not gobs like with chemo but definitely a good amount.  I think they are giving us way too much radiation, and I was talking to \"deaf ears\" when I was going through it and my skin was ruptured.  I think I'm sorry I ever had radiation because who knows what the after effects will be 10 years from now. ",
      "MessageIndex": 8,
      "PostDate": "06/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/784289",
      "Title": "pain 5 months after radiation cherb Mimikub56"
    },
    {
      "AuthorID": "marjoriesan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148581/profile",
      "Content": "Apr 8, 2012 09:12AM marjoriesands wrote: I went on retreat to Mexico for a week to meditate over this problem.  My chinese doctor was already doing acupuncture and herbs and told me he couldn't make the decision for me but was quite clear about the troublesome effects of 35 radiation treatments. He said in China, the acupuncturist and oncologist work very closely together to design a program for the patient. What a concept!  Since Kaiser always recommends their protocol of chemo and radiation, I decided against the chemo.  My surgeon advised me to do the radiation since \"I opted out of the chemo\".   A year later my oncologist is still sarcastic about me not having the chemo.  My side effects are sore breast and burning under my arm.  YES, they do give you too much and I don't care what anybody says.   I wanted a second opinion but would only have been referred to another Kaiser oncologist who would have given me the same \"protocol\".  The UCSF breast cancer dept. said I would have to $1500 for a consult.  That is one reason to think about doing another insurance program (PPO)where you can really get a 2nd opinion!  I'm fine, enjoying my life and not dwelling on the past.  Just wanted to put in my two cents here. ",
      "MessageIndex": 64,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781063",
      "Title": "Radiation Therapy for early stage Kaara mimikitty"
    }
  ]
}