{
  "AuthorID": "marketingma…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210007/profile",
  "Posts": [
    {
      "AuthorID": "marketingma…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210007/profile",
      "Content": "Jul 22, 2015 03:12PM marketingmama wrote: I called ahead and was told that the surgeon uses lidocaine. The actual injections were done by my surgeon's Fellow, though he was there to oversee. I was very worried about pain but it was really a non-issue (and I'm a pain wimp). The Fellow does these a lot and I was told she's quite good so perhaps there is also something to be said for the experience of the injector.",
      "MessageIndex": 3,
      "PostDate": "22/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/833592",
      "Title": "Sentinel node biopsy - do I need Emla cream? rleepac Aug242007"
    },
    {
      "AuthorID": "marketingma…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210007/profile",
      "Content": "Jul 23, 2015 11:47AM marketingmama wrote: Lulu, it will really get better. I found that by week 3-4 I was feeling much more myself but I definitely needed the 6 weeks I took off from work. Take your pain killers and muscle relaxers (the latter really helps with the tissue expanders), drink a lot of water to flush the anesthesia, and eat well. I didn't have much appetite so stuck with fresh fruits, simple proteins like grilled chicken, and an occasional treat of Ben & Jerry's ice cream!! :) I watched a lot of Netflix and also enjoyed a few books on audio (much easier than lifting arms to hold a book or Kindle). I did my best to walk as well so i didn't lose strength/endurance (it can happen really fast). My surgery was in late May so some days were too hot to go outside. When that happened, I just did 10-15 mins on my treadmill. I paced myself and went slow in the beginning. As I got stronger I was able to do much more. Definitely try to move enough to keep your strength but be careful not to overdo. No lifting, laundry, major cooking, or housework. Be kind to yourself. It really does get better. ",
      "MessageIndex": 3,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/833600",
      "Title": "2 weeks after expanders/double mastectomy Lulu4975 trailrose"
    }
  ]
}