{
  "AuthorID": "marlyhalli",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161534/profile",
  "Posts": [
    {
      "AuthorID": "marlyhalli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161534/profile",
      "Content": "Oct 13, 2012 07:19PM marlyhalli wrote: This is my first post. I had my surgery yesterday. Lumpectomy and sentinel lymph node. The tumour was found in my mammogram on Aug 15. Finally had surgery about 4pm Oct. 12. It's been a long scary 8 weeks. I think I went a little crazy for a while. Lots of nightmares and stuff. Of course it didn't help that I had been on low dose estrogen for several years and had to stop taking it. Instant menopause on top of the worry of having cancer! Yes I've been a little crazy, but for some reason, I have not cried. I know that I really need a good cry. Maybe when I'm done all of my treatments and they tell me I am Aok, I will let it all out. Although I have to wait for my pathology report I feel that I was very lucky to be diagnosed. My cancer was very small, less than a centimeter. It did not show up on last years mammogram, so had they not found it this year, it would have been much bigger by next mammogram in 2013. One of you was asking about the dye injection and if it was painful. It did sting quite a bit. When the doctor in nucleur started the procedure to find the lymph nodes and mark them, it did hurt. I would say that that was the most uncomfortable procedure leading up to surgery.  They put a wire into the tumour using ultra-sound and that did not hurt at all. They froze my breast before inserting it. I am 59 years old and married for only one year to a wonderful man who lost his first wife in a tragic accident in 2007. My first concern when I was told that I had cancer was for him. I just couldn't imagine him getting through losing another one. Today is day one of recovery. Yes I have pain. More so from the incision in my armpit than the one in my breast. I'm still scared, but glad that the whole process has finally started. Thank you for letting me tell my story.   ",
      "MessageIndex": 117,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "marlyhalli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161534/profile",
      "Content": "Oct 13, 2012 08:20PM marlyhalli wrote: I was the same way the few days before my surgery that I had yesterday. All week I felt almost excited to be finally getting it done. I cooked a bunch of meals and put them in the freezer for the days post-op when I might not feel like cooking. I changed all the sheets on the beds and did all the laundry. And as the day got closer, I got calmer and calmer. I didn't get home last night until almost 9pm and went right to bed with a sleeping pill and something for pain. When I woke up this morning I found that I am calmer than I have been since my diagnosis of IDC in August. Yes I have pain, but the pain is almost like a reminder that they have removed it. Before surgery, I had no pain, no symptoms, nothing. Most of the time, I was just in denial. Post-op I almost feel empowered. I have finally started the battle, which I fully intend to win. Good luck to everyone who is having surgery soon.",
      "MessageIndex": 121,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "marlyhalli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161534/profile",
      "Content": "Nov 25, 2012 03:50PM marlyhalli wrote: I'm starting my chemo tomorrow, just got the OncoDX results (score of 25) day before yesterday and made the decision. Yes I'm terrified. Don't know if there is anything else I should be doing to prepare for this. I bought everything I thought I would need from the shopping list I found posted here. I've told all of my loved ones. But I've also been brushing my long blond hair every hour or so, and taking pictures of it so I won't forget how pretty it was. Yup I'm scared. Until today, I don't think that I really accepted that this tiny little pea shaped thing could kill me. I've done all of the research, but I still don't know what to expect. You girls are helping me. Thank you",
      "MessageIndex": 630,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "marlyhalli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161534/profile",
      "Content": "Nov 23, 2012 03:17PM marlyhalli wrote: I had to make my decision about 4 hours ago. I'm 59 yrs old. My lymph nodes were clear. Stage 1 Grade 2 cancer. Estrogen receptive. 1.6 cm. Oncotype score was 25. It was the hardest decision I ever had to make. I have a wonderful female doctor and after about a half hour of changing my mind back and forth, but leaning towards chemo, I asked her, if it was her, what would she do. She told me that her personality is the type that has to make sure that every T is crossed and every I is dotted, so she thinks that she would take the chemo. I'm the same type. When I was working, I already had a solution in my mind, to every possible problem that might occur, on any given day. I was always prepared for the worst case scenario. The worst case scenario in this case is that my cancer re-occurs and I did not do everything possible to prevent that. I need to know that I did everything possible. My husband and I are retired and were living the dream life that everyone hopes they have when they stop working. We travel. It was so tempting to just say no to Chemo, take some radiation and get on the road again.  I was not comfortable with my decision until I read this thread. THE KEY IS TO MAKE YOUR DECISION AND NOT LOOK BACK. Thank you BilateralBeauties. I don't have a lot of time to prepare. I start on Monday, this is Friday. Although I am still in shock, I am preparing, and accepting, and now know that I made the right decision for me. Lully, I understand how you feel. I could have went either way. Good luck.",
      "MessageIndex": 6,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/796591",
      "Title": "Has anyone decided not to do chemo? Lully adagio"
    }
  ]
}