{
  "AuthorID": "marmsie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
  "Posts": [
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "Apr 29, 2009 11:47AM marmsie wrote: Right mastectomy with \"sentinel\" NB, fingers crossed. May 21. Right breast was treated 9 years ago with lumpectomy and full axillary node dissection so we're hoping a node or two can be found for additional staging purposes. Having had radiation to this side, I'm a bit apprehensive about the surgical \"outcome\", but my skin seems to be in good shape. (A benefit in this case of being small busted?) My surgeon is all about a \"nice flat result\" which would seem to be the best possible outcome. I have no reconstruction plans. Just lots of heavy *SIGHS* these days. Breathe in, breathe out.",
      "MessageIndex": 24,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "May 22, 2009 10:46AM marmsie wrote: marmsie reporting in. I know the \"drive through\" mastectomy gets a lot of heat, but it was just fine for me. I was the first surgery of the day yesterday, under by about 7:45am and almost home by noon. Basic mastectomy, right side. No luck tracking down a lymph node outside of the breast (had full axillary node dissection 9 years ago and they got 22 back then). Spent Wednesday afternoon at nuclear medicine where they thought they found one, but looked buried in muscle. The blue dye yesterday morning didn't pick it up and it didn't show up otherwise either, so kind of glad that area didn't get totally torn up looking for a needle in a haystack. The arm is already a little messed up from 9 years ago!  I guess being small busted to begin with, and with this side being even smaller due to previous lumpectomy...made for less work? Think I can ask for a discount? All things considered, I'm feeling pretty good. A decent night's sleep with plenty of pillows in my own bed. Stiff and sore this morning, not a lot of pain to speak of. I think Tylenol will be the med of choice today. Chins up Ladies!",
      "MessageIndex": 117,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "Jun 1, 2009 07:27PM marmsie wrote: Lursa - I hereby nominate you for the \"DON'T TRY THIS AT HOME\" award for the month of May. Those couch backs... Glad to hear you are recovering, again. So here I am at post surgery day 12 - still a tad bit grumpy, but I think it's just the constant low level discomfort. The pain meds give me a headache and the Tylenol tends to upset my stomach (even with food). Something is going to feel bad no matter what I do! Besides, the Tylenol doesn't do much for the rather high level pins, needles and dare I say almost heat kind of sensations radiating out of a large area of my right chest. WOW! Anyone care to guess how long this is going to last? No reconstruction for me.  I have a lot of admiration for those of you also dealing with that additional discomfort. I do think my overall numb area is shrinking around the edges but the underlying muscles still feel like they've got a bunch of duct tape stuck there. Nope, I am just not a patient patient. Hope all the other May surgeries are healing nicely. And good wishes for June.",
      "MessageIndex": 158,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "May 27, 2009 09:19AM marmsie wrote: I didn't go home \"bound\" (surgery was May 21 - right mastectomy, no plans for reconstruction), but was wearing a hospital issue \"sports bra\" of sorts. It had velcro in the front. The compression does tend to feel more comfortable, but that darned velcro strip rubbing on my sternum was anything but; just too stiff. I switched to one of my own older sports bras. But no nodes found to dig out, so my range of motion hasn't been too compromised beyond dealing with a single drain. I really only have one curious spot of swelling that I'm a bit concerned about. It's a lump at the inner most start of the incision next to my sternum. Could be where the drain begins? It may have gone down a little since the first day, but not much. I go back to my surgeon this afternoon for a check and results, so let's hope I also get some reassurance that this lump is temporary. I've got a decent amount of tingle and burn going on. Also an aggravated ulnar nerve (which I've dealt with off and on since my first surgery so not surprised). Once I get this drain out I can start doing my stretches to work that out. Tingle and burn may be a longer issue...? Anyone else dealing with oddball muscle spasms? Drainage is way down, so I'm expecting this \"appendage\" to get pulled today. And wishing for no surprises in the pathology. I will selfishly wish for a good news day for all! Or maybe just no additional bad news? Sorry, I get a little skittish before these appointments! ",
      "MessageIndex": 131,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "May 13, 2009 06:29PM marmsie wrote: It's comforting to hear from those who are going before me - thanks for all the updates. You collectively seem to be doing quite well, all things considered! Here's to a speedy recovery by all. Needless to say, with a week and night until surgery, I'm feeling a little \"stressed\". I really liked what someone else said about the 2 days before and the 2 days after being the worst - then it's improvement time. Knock on wood and fingers crossed!",
      "MessageIndex": 88,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "May 28, 2009 10:04AM marmsie wrote: I hesitate to admit it, but I was able to lose my one drain yesterday. What a relief. I feel for those of you still dealing with the contraption(s). I'm on strict orders to maintain low arm usage for another week since it seemed a tad bit early, but the output justified it, and I lobbied hard! Surgeon is pleased with the results and I'm healing nicely. Steri strips came off - oh boy! Nothing surprising on the pathology. Oncology next - 2 weeks. We'll discuss the missing lymph node component. amig - the sticking needles sensation could linger for a while. Past experience  has taught me that sometimes just keeping ANYTHING from touching the area is helpful. Certain seams in certain shirts could be intolerable; more so by the end of the day. Pattipig - I hear ya. I would never have thought I'd be going through this either. I know much progress has been made over the years; but I still think there is so much more still to be accomplished. Why haven't we figured out some way to deal with this that doesn't involve chopping off body parts? Not my finest hour. Silly. I know I am technically one of the luckier ones. My stiff upper lip isn't feeling so stiff this morning.",
      "MessageIndex": 136,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "Jul 17, 2009 11:17PM marmsie wrote: I'm 8 weeks \"out\" and finally pulled myself together to make the appointment to get \"fitted\". Next week. Um - now what? I had a unilateral mastectomy, but no lymph nodes as they were already gone (lumpectomy and axillary dissection 9 years ago on this same side). I'm smaller busted, a 34 barely B on my best days, so smashing the remaining side with a sports bra and wearing blousy shirts has been my new style. I have worn my regular bra with the fluffy thing to fill it out a couple of times this past week with decent results. It rides a tad bit high, though, and sure does feel odd. I get that odd may be the new reality. I guess I should take my regular bra to the fitting? I can sort of see the benefits of a mastectomy bra, but considering my smallish size - does that make a difference regarding the requirements? I'm a decent seamstress and figure I should be able to add pockets to my existing bras; has anyone done this? I'm going to the only place around that coordinates directly with my insurance. If I'm not pleased with the offering I'll decline what they have and head to Nordstroms. I've heard my local one does a good job. I'll just have to handle the paperwork and have it go to deductible for out of network. But this is not something I'm going to compromise on. Any tips on getting through this would be appreciated. I'm not looking forward to the process, but WOULD like to be able to wear some of my regular clothes again. It's challenging being a single breasted lady.",
      "MessageIndex": 20,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/736171",
      "Title": "Nervouse about getting prosthesis for the first time BethHG nagem"
    },
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "Sep 12, 2011 08:36PM marmsie wrote: I'm a two timer with the hormone status being different. Mine was flipped from yours, I was triple negative the first go round, with 9 years separating the discovery of the 2 cancers. Second was ER+, same breast breast, so no more radiation for me either. Just the cancerous breast was removed, my choice, obviously. No chemo the second time, found it quite small, 7 mm. Post menopausal thanks to a hysterectomy, so doing Arimidex now.",
      "MessageIndex": 2,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/773430",
      "Title": "First Primary ER+, Second Primary Triple Negative Deeay Deeay"
    },
    {
      "AuthorID": "marmsie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81729/profile",
      "Content": "May 27, 2009 12:29PM marmsie wrote: My first surgery was in 2000. Lumpectomy with full axillary node dissection. I have had a numb patch just behind my armpit since then and also numbness within my armpit as well. Not as bad as right after surgery, but both areas still exist. Is it the back side of your upper arm? I've had ulnar nerve issues, most likely due to that first surgery - physical therapy helped a lot! It's a curious path that the ulnar nerve takes from the upper back all the way through the armpit, down the arm then into the little finger. A good P-T can do wonders, but it took a little trial and error before I found one who helped. ",
      "MessageIndex": 2,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/734797",
      "Title": "Numbness in Arm After Surgery DENTHOMAS pinkmama"
    }
  ]
}