{
  "AuthorID": "marmalade_s…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
  "Posts": [
    {
      "AuthorID": "marmalade_s…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
      "Content": "Sep 3, 2010 07:14AM marmalade_skies wrote: I'm on my last 3 treatments out of 12 of Paclitaxel, before that was 4 founds of AC. It's been two months since I've had bladder incontinence...It's not exactly incontinence, as in, I don't feel that I can't control my bladder. But when I get to the toilet and hear water sounds, I do have a bit of \"leaking\"... I've asked my onco about this, and she said it could be the Paclitaxel affecting my nerves and it may take a while, up to a year after chemo to go away.",
      "MessageIndex": 6,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/757042",
      "Title": "bladder irritation calamtykel marmalade_skies"
    },
    {
      "AuthorID": "marmalade_s…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
      "Content": "May 7, 2010 01:59PM marmalade_skies wrote: Hello everyone... seems like we're growing bigger and stronger, hello to all who're new. I am on my 3rd Day after AC and Neulasta. Did my fair bit of throwing up on Day 1, in fact everything was thrown up. Day 2 was slightly better but I was in fatigue the entire day. Day 3 and I'm experiencing some hot flushes. Hopefully that'll be the end of it all... but you never know. Wish I could write something to everyone here but I'm exhausted. So good luck with all. Be strong and all this shall pass! :)",
      "MessageIndex": 145,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "marmalade_s…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
      "Content": "May 19, 2010 04:41PM marmalade_skies wrote: Hello everyone! It's been 2 weeks since my first AC. I have gone back to work on a 3-day week basis and tomorrow's my #2 AC. Already! I feel fine enough to work but the problem I have now is acne! The acne on my face is much worse than the buzz cut! The breakout is constant and not dying out. Is anyone having an acne problem? Any suggestions how to treat it?  As for hair, JennyB, I tried pulling some of my buzz-cut hair as I was reading your post, and yes.. they come out quite easily. I guess it won't be long till they fall off completely. *gasp* I've already gotten used to my buzz-cut. In fact I quite like it as it's really cooling and my friends thought I look kind of cool in it :)  Hopefully #2 tomorrow will be similar to #1. Good luck to me! Take care everyone and hang in there. We can all do this!",
      "MessageIndex": 349,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "marmalade_s…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
      "Content": "May 2, 2010 03:54PM marmalade_skies wrote: Hi everybody! I was diagnosed in March and will be starting my first chemo session on 5th May. I'm so glad to have found this forum, and I look forward to reading and sharing all our experiences - good and bad! Will be starting with AC x 4, followed by Taxol x 12 and radiation, and Tamoxifen. Does anyone know if we will suffer from cold hands and feet during the infusion? Good luck everyone :)",
      "MessageIndex": 59,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "marmalade_s…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
      "Content": "May 3, 2010 09:37AM marmalade_skies wrote: I have 2 days to go and I am definitely getting nervous! Lorrhaw: Thanks for the tip! I got an alochol-free anti-bacteria mouthwash on standby, looks like the salt water thing works well too. I will definitely try it. sacphotomom: Seems like we'll be on the same course, except for the Taxol which I'll be doing weekly for 12 weeks... Keep up the good spirits!  sunflower87: Yes, you can do this! Stay positive! :) I'll be checking with my onco tomorrow what medications I will need to ease all the side effects. Seems loads to take! but I'm not complaining! Stay upbeat, everyone",
      "MessageIndex": 75,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "marmalade_s…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
      "Content": "May 25, 2010 04:35AM marmalade_skies wrote: Hello everyone! Hope everyone's having a good day... I'm sorry to hear about the pain from the Neulasta, fotopet. I have my Neulasta shot in the tummy and I have muscle pains for about a day before it goes away. I hope your pain will ease away soon too. I'm on Day 21, after #2 of AC on 20th May. Most of my hair is falling off, maybe about 20% is left. They don't fall out in clumps, just generally fall out in the shower. No overwhelming side-effects, but fatigue and a fullness in the stomach that doesn't do much for the appetite. Redbarb - your post on steak is hilarious! I tried having spaghetti bolognese last night and it turned out too oily although I really miss the taste! I hope to have some joy in food which will bring life to sort of a normalcy. I don't enjoy the hair loss but that's one sign that the chemo is going through the body! Lots of love and hugs to everyone. May everyday be better than the one before :)",
      "MessageIndex": 429,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "marmalade_s…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
      "Content": "Sep 1, 2010 09:52AM marmalade_skies wrote: Hello my dear May Chemo Warriors...It's wonderful to see everyone going strong and positive! I'm sorry I have been away for a while since the beginning...somewhere along the line it got really tough and I slipped in keeping up with the support group. It's really encouraging to see everyone still going strong, and a warm welcome to those who have found us! Although I seldom post, I'm always reading about how everyone is getting on... That kept me going on! I am at my last 3 sessions of Paclitaxel (yes, 3 weeks left!!), before a 3 week break and then rads. Can't believe how time flies. My hair has all fallen out, eyebrows thinned, lower lashes are gone and my \"cloudy\" tongue has stayed around longer than the past few sessions. Am so looking forward to having normal tastebuds again!  And I'm thinking of going commando too! Here in Singapore it's really hot but I'm worried about the sun exposure that the head may get. The T-shirt is an excellent idea tho - I would really love to wear a shirt that says that! LibraryJenn - there are days where I totally forget that I have cancer and think that all these will pass and I'll be back to normal. And there are days when I know deep inside that nothing will be normal again and I'll feel down. It's kind of like a see-saw. And I'm having the weak fingers too. My fingernails are not even strong enough to peel sticky tape! I know what you mean about being young and feeling the need to increase awareness for self-examination- I'm 33. Stay upbeat and persevere, my friends... we'll definitely make it!",
      "MessageIndex": 1436,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "marmalade_s…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101376/profile",
      "Content": "May 4, 2010 09:50AM marmalade_skies wrote: Thanks for adding me, fotopet! poohbear21: When I was diagnosed 2 months ago, I had quit my job and was back home visiting and planning to relocate to join my boyfriend in Israel. Throughout the first month since diagnosis, we were corresponding long-distance and thankfully, he will be joining me next week to be with me through chemo. I know it sucks that being diagnosed just screws up all our plans but I am thankful that I have a chance to get well and I have a man who loves me enough to give up his career to be with me. I have no family history and I am 33 years old. It's tough but I know we can get through this. I am starting chemo tomorrow and trying not to be anxious. The anticipation of pain could be much worse, you never know! All the best for your treatment sacphotomom: I've read that hair falls out between 10-14th day, so I am planning to have my head shaved before that. I've got hair up to my elbows and I'm contemplating if I should cut short before I shave. A girlfriend of mine will be supporting me by shaving her head too! So brave of her. We are going to get a photographer friend to document the \"shaving event\" so it's a nice memory for us when we're old with no teeth left. Hopefully I won't be overwhelmed with any SEs to go through it. And I've also got a wig and headscarves ready! I was really cheered up by the retail therapy! njbhwgirl: you go girl! going back to work must be tough, you're doing great! JennyB: hang in there girl, and thanks for all the sharing. it really helps to know what are the things to expect. Some questions - when should i get the constipation/ diarrhoea medication ready? My onco told me that I probably don't need that and just paracetamol is sufficient for pain due to Neuslasta. Is that right? And is it ok to take sugar during chemo? (or are these questions for another thread...ooops) Time for good night's sleep and wake up to a new reality. Chemo - bring it on!",
      "MessageIndex": 90,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    }
  ]
}