{
  "AuthorID": "Marren",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
  "Posts": [
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 27, 2014 11:04PM Marren wrote: yes you do need a prescription.",
      "MessageIndex": 708,
      "PostDate": "27/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "May 15, 2014 12:35PM Marren wrote: good luck Katie! That's cruel when they schedule it so late, you can't eat all day. Not fair.",
      "MessageIndex": 990,
      "PostDate": "15/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Jun 20, 2014 02:57AM Marren wrote: belleb!! Congrats on finishing chemo! That's very exciting! And also to everyone else wrapping up their chemo treatments.  I'm about 5 wks out from my last chemo.  I was suppose to have my surgery June 12th but they postponed due to a cold. That was hard to switch gears, I've been pretty nervous about it, but I also just want to get it over with. So now it's July 1st. It's starting to make me nervous waiting so long. What if it starts coming back?  Smartass- are you def getting rads after bmx? If so, what did the docs say about that? I mean why, were some nodes positive? I don't know for sure about rads for me, but they didn't think so. But they probably won't know til after surgery. How many of you after bmx are still having rads? Samu- I will continue my targeted therapy every three wks til January. So I will have my port until then. I can't wait to get it out.  I see my MO still about every three weeks. They did have me skip my herceptin this time week because of something on my echocardiogram. Hope all is well with you ladies. Take care",
      "MessageIndex": 1016,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Jun 28, 2014 12:39AM Marren wrote: smartasssmurf-Congratulations!!!! It's pretty damn exciting isn't it? I know...I finished 5/12/14 at 4:15pm. I also have herceptin til January. Well I skipped my last one(prob skip two, surgery 7/1) due to my echocardiogram showing some stress on my heart. Sorry if I'm repeating myself I can't remember who I told what and where.",
      "MessageIndex": 1030,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Jun 29, 2014 11:03PM Marren wrote: carolsue- I see you had 2 recurrences after your BMX. I'm so sorry. I was wondering how did the docs monitor you after each dx? And also any advice on what to look for? Thanks",
      "MessageIndex": 1035,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Jul 23, 2014 01:29PM Marren wrote: Belleb- good luck with surgery.  I was wondering  if anyone has had herceptin without a port? Is it ok, does it burn? I really want my port out. They moved mine in surgery and it's feeling a little nervy. If that makes sense.? I've never liked it but was grateful for it during my 6 hour chemos. I still have herceptin until about March but I think I could handle it with out the port. I was finished with chemo on 5/12 and I just have  maybe a 1/2 inch of hair but it's still very fine. My eyebrows are coming back slowly . And my eyelashes  are still too short to wear mascara.",
      "MessageIndex": 1070,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 6, 2014 03:24PM - edited Feb 6, 2014 03:24PM by Marren Asb- Thank for the tips I'll  def look into the prilosec. And maybe the emend will work better than the Zofran. Did they give you nausea meds for home? And your treatments are once a week? How long are they? Did you get a port? I'm getting mine Monday which freaks me out. But the first infusion did really make my arm sore for days after. Mine are every 3 weeks for 6 hrs 6 times. Then whatever surgery and herceptin every 3 wks for 8mo. So you must be getting your treatment today. Good Luck I hope you glide right through it and relax. And symtom free.  Tekwriter-Thanks, I should try some mineral water, the bubbles might help.",
      "MessageIndex": 543,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 6, 2014 05:48PM - edited Feb 6, 2014 05:48PM by Marren Asb Herceptin weekly, hmm I hadn't heard of that. Are you tch+p days 6hrs? I just took a prilosec hopefully that helps with my nausea.  Do you guys have the numb/metal tongue? Everything tastes so weird. I really will appreciate my taste buds more when they come back. My fingers and toes are tingly too, which really bugs me when I'm going to bed. I had to take an ativan yesterday to sleep. I've been getting acupuncture so far I can't tell if it's helped anything. I'd also like to get out and go for a walk without feeling so loopy.  Does anyone else do acupuncture or massage? I wonder if massage would help or hurt with the aches and pains that the nuelasta causes. Although with the claritin it really isn't that bad. ",
      "MessageIndex": 545,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Jun 30, 2014 10:42PM Marren wrote: thank you birdlover- My parents are here and took the kids to a hotel; so that's one less thing to worry about. And wow, you are taking your time w expansion. I thought they told me it would be a few months. I've heard they are uncomfortable but totally doable. I'm getting a recliner and watching my shows. I loved game of thrones. I may need to start reading ahead since it takes so long for shows to come back.",
      "MessageIndex": 1043,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Jul 3, 2014 11:04PM Marren wrote: hello ladies, I got home yesterday from my surgery. It went well, I'm really sore but I expected that. I'm just resting and popping pills at this point.  The surgeon decided once she got into surgery that I was a good candidate for immediate implants. So she called my husband and asked if that was okay. That's a dangerous decision to give to a man; I could have woken up to double Ds. :) Luckily we had discussed what size. But I thought a was getting expanders, but I'm not complaining I get to skip all that. She did saw sometimes they need to be tweaked. But they look pretty good. It's hard to tell too much right now. Because of swelling and bruising. Carolsue-I'm so glad your responding to treatment. But sorry to hear it's been harder on you.  I did the same chemo you did. I did 6 cycles. How many did you do? How long have you been done? Sorry I can't remember. Okay ladies have a good night. ",
      "MessageIndex": 1048,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 21, 2014 03:38PM Marren wrote: hello, So I had my second tch+p on Tuesday. Since I felt so nauseous last time I asked for fluids and anti nausea meds next day. They also added emend to my chemo. I felt better the day after than I did last time but I still have been  pretty nauseous. I've been very fatigued, but good with the nuelasta shot. Hey that's something. I don't know how you guys go to work. I'm so dizzy and nauseous most of the time. I haven't been up for much, my poor kids. Maybe I should push it more. Maybe tomorrow day 3 and 4 aren't my beat post chemo.  My vision isn't great but it does seem blurrier than normal.  We also found out my mom has breast cancer a couple of days ago. And my dad had been diagnosed with head and neck cancer in September. That makes my dad, my mom and I in six months being diagnosed with cancer! I mean what are the odds! My dad's is viral, I was braca neg. We haven't lived under the same roof in about 20 years I just don't understand. Has anyone heard of such a thing? I'm scared for my whole family now.  It's just so crazy",
      "MessageIndex": 671,
      "PostDate": "21/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Apr 9, 2014 04:26PM Marren wrote: hi  everyone, I have just finished 4/6 of my tch+p? I've had a rough time every time. It takes me like a good week to feel well enough to get out of bed. I had terrible stomach cramps and a digestive issues w each chemo too. This time it was a full week after when that hit me.  I was reading another thread about people with her2+( early stage)being offered weekly taxol for 12 weeks and herceptin I think every 3 weeks for a year. And they said it was a breeze. I wasn't offered that, I think it's fairly new. But I'm wondering since my tumor has shrunken to the point they can't feel it since my 3rd treatment. Maybe I can stop now it's done it's job. Ah wishful thinking, I'm sure.  I hope today finds you guys as well as can be in this crazy time.",
      "MessageIndex": 866,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "May 3, 2014 06:04PM Marren wrote: Katie-congrats on finishing chemo!  My bs  said they'd give me 4 weeks off after chemo before surgery. So I'll prob have surgery in June. But I'll def check out the May board. ",
      "MessageIndex": 951,
      "PostDate": "03/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 5, 2014 11:59AM - edited Feb 5, 2014 11:59AM by Marren Hello Everyone, I new here. I'm 38 and live with me husband and 2 little kids. I started chemo 1/27/14, dx 1/7/2014 I'm her2+ so we are doing chemo before surgery.  It's TCH+P I've been feeling pretty terrible the whole time. I'm 8 days out and still  dizzy and nauseous, fatigue. They gave me reglan and zofran and ativan. They don't seem to be doing to much to help. I try not to take them more than once a day. I feel so spacey and out of it.  I went in after a week from chemo and they said I needed the nuelasta shot. I did the claritan trick and I've been ok in that respect. The first dr I saw wanted to do fluids and zofran and neulasta the next day after chemo. But my current dr didn't think it necessary, but maybe they had the right idea. I tend to get dehydrated easy, so I try to drink as much as a can. Does anybody have any tips for nausea? Did you guys get fluids and anti nauseas day after chemo? I've tried ginger tea too.  Thanks I'm glad to have found you guys. I hope your all having one of those  good days.",
      "MessageIndex": 531,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 6, 2014 09:44PM Marren wrote: Emu oil is also good. I've always had nice skin to, I hope that doesn't go too, I feel you.  asb-You didn't have mastectomy right? You just know you will. My drs just said I could see how much it shrunk and go from there. I just don't want to worry about it coming back.  So I just got a tip from a friend who just went through all this.  Glutamine powder -it helps with the numbness in the fingers and toes and tongue! I will be so excited if this works! Has anybody tried it? Does anybody get fluids the day after infusion? I might demand it next time, I feel so crappy and I know it's partially from being dehydrated. It happens easily to me. And I love drinking water.",
      "MessageIndex": 547,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 7, 2014 12:06PM Marren wrote: Hi Everyone,  Curly you must get claritin. I had two different dr tell me about it. And I have friends who have used it and so did I. It works, I took it an hour before my shot and then one every morning for the past 5 days. Of course ask your dr. But I've had only mild aches and pains, but I had those before they gave me the shot, from the chemo. Good for you for rocking the bald head. I cut my hair pixie style and I'm trying to get use to that. But they say it should be gone in about a week or two. Not easy for me I'm a hair and make up girl never left home w/o.  Birdlover- I haven't taken any of those. But Emend is anti-nausea right? Did they give you zofran instead? Why do think taxol will give you a reaction? I'm so sorry you had a reaction on top of everything else.  My dr mentioned trying emend on me instead of zofran because I've been feeling so bad.  But I really just think I'm dehydrated.  And so to repeat but has anyone tried the glutamine, I'm going today. Thats suppose to help with numbness in fingers and toes, and the tongue. I hate that I can't taste anything. Anyhow I hope everyone has a great day!",
      "MessageIndex": 554,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 9, 2014 02:17PM Marren wrote: atlbc- I'm also on the TCH but I also have perjeta. And I noticed a burn during the chemo, but it subsided. But my arm was sore for days after. I'm 13 days post my first chemo. I felt dizzy and nausea for about  9 days. Just starting to feel a bit normal. But so tired. They gave me the nuelasta shot a week after chemo, and they said my WBC is at 59,000. 10x normal, I hope thats ok.?  I get my port put in Monday, tomorrow. I'm pretty scared I've never had any type of surgery. I've only been in to have my two kids, but thats it. I've heard it's pretty simple though. As for food I think as long as you wash everything well. Whole foods are best. My doc just said no sushi. And my acupuncturist(which my dr has for free,pretty cool) said to cook my veggies so your body doesn't have to work so hard since your digestive system is compromised during chemo. Which made sense.  I sent my hair off to hip hats. Has anyone else done that? I thought I saw someone mention it.  I still have my hair but I'm expecting it to go any minute.",
      "MessageIndex": 582,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 21, 2014 05:26PM Marren wrote: asb- I'm so sorry, I hate that limbo feeling. Especially when you think your on track with your treatment and well expect it to work. I felt like mine was changing shape but I think it's smaller. What did the dr say?  They have me on kytril, zofran and now emend. I got Prilosec. I tried it last time but maybe I need to take it more often. I'm also taking zofran at home too. I do feel acid refluxie.  I wish you guys all well",
      "MessageIndex": 675,
      "PostDate": "21/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Feb 28, 2014 12:38PM Marren wrote: tekwriter-that's strange they should be using your port for blood draws too. I did my first blood draw with it a couple of days ago. I put the cream on 45 min before put Saran Wrap on and I don't take it off until right when they are going to do it. I didn't feel anything. In fact after my chemo they left the needle in because I was having fluids the next day. It kinda creeped me out but they said it was fine. I don't even remember feeling it when they took it out. Asb- I'm sorry to hear about well everything. I hope they figure out what's going on and the best path. And that work will be a nice distraction.  I shaved my hair right before my 2nd tch p because it was falling out and starting to itch. I had already cut it into a pixie, and sent off my hair to hiphatswithhair.com. Which I really like. It's comforting having my own hair. And it's more comfortable than a wig.  But I still have a lot of my hair on my head, a have some bald spots here and there. But now I'm wondering if I could have waited. The hair everywhere else is pretty much gone. My eyebrows have thinned a lot, and I'm not sure about my eyelashes. They were never very full to begin with. I hope they don't go though.",
      "MessageIndex": 714,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Apr 9, 2014 06:08PM Marren wrote: carolsue63- Yes I guess I shouldn't complain because it shrunk my tumor right away, by the third one they couldn't feel anything. So yes that definitely is amazing. And that's not always the case, I'm very thankful for that. And it looks like you've been put through the wringer by cancer. But I'm so glad it's working for you too, and your scans are coming up clean. That's great!",
      "MessageIndex": 869,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Jun 30, 2014 01:55PM Marren wrote: xrayalli-of course it's okay.  It's been about 7 weeks for me since chemo. And my hair is still very fine and spotty. I can't wait to ditch my wigs and hats. It's getting hot. My eyebrows and eyelashes hung on until my last treatment. I've heard some say the eyelashes grow back thicker, I'd love that. I had a few weeks where my eyes watered so badly. It looked as though I was crying all day. I couldn't  keep any make up on. It was very frustrating. Now I know the importance of eyelashes. I must have some growing in because that has stopped.  I also just noticed I knew SE, just the last couple of weeks. A kinda of pulsating on my left eye, like lower inside corner. I hope it goes away. Anyone else had that? I also had a feeling not unlike during pregnancy when the baby moves. It freaked me out so much. For about two weeks every once in awhile always in the same spot I'd feel something push out. I asked both my docs they said it was my pulse. So bizarre. It's stopped now though.  So my bmx is tomorrow I'm getting pretty nervous now.  Congrats birdlover- your almost done! ",
      "MessageIndex": 1041,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Jul 5, 2014 02:39PM Marren wrote: congrats on finishing chemo!! Whoo hoo! So happy for you!",
      "MessageIndex": 1051,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "Apr 10, 2014 12:19PM Marren wrote: Tekwriter- are you getting a mastectomy ?",
      "MessageIndex": 871,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "May 2, 2014 08:05PM Marren wrote: carolsue- Yay congrats on your last round! And to everyone else who completed chemo. I can't wait! My last round is 5/12.  I can't remember the last time I posted because I can't remember much these days, ha! I saw a radiation oncologist and a plastic surgeon the last few days. I'm gathering info and still deciding on a lumpectomy w rads or mastectomy and well possible rads. I'm leaning towards mastectomy. I'm considered young 38 and they said reoccurrence is more likely, and of course I'm terrified of reoccurrence. Well everyone is, I just know it will cause me great anxiety. I'm in chemo and I still question lumps and bumps.  Anyhow I hope you all are well. -m",
      "MessageIndex": 948,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Marren",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195801/profile",
      "Content": "May 12, 2014 04:05PM Marren wrote: hi everybody, I'm currently getting my 6th and FINAL CHEMO!!! I'm so excited I feel like balloons should fall from the ceiling. The tch+p has been rough, and infusions were 6 hours ! I still will get herceptin every 3 weeks, surgery and prob rads but I think this is going to be the hardest part. I'm so ready to put this behind me. Still considering which surgery. Katie- I find l- glutamine and b6 good for neuropathy and taste alterations. Did your tumor shrink during chemo, and why are you going w the mastectomy?  I can't wait for my hair and eyelashes to grow back. Chipmunk- the taste alteration drives me nuts and it was worse than ever on my last one. I could barely eat anything . It's like a metal taste w a tablespoon of salt on your tongue.  I also wanted to share that I figured out that the chemo has made me gluten intolerant. I was having all kinds of digestive issues(bloody diarrhea, cramping, constipation sorry tmi) When I cut out gluten I wasn't having those problems, when still constipation from chemo but it wasn't as bad.",
      "MessageIndex": 980,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    }
  ]
}