{
  "AuthorID": "Marsrover",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114919/profile",
  "Posts": [
    {
      "AuthorID": "Marsrover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114919/profile",
      "Content": "Dec 8, 2010 02:34PM Marsrover wrote: My husband and I moved to New Jersey 2 and a half years ago (for his job)- from Boston. I moved from Ireland to Boston. I met my hubby in Boston, fell in love and the rest...is history.  I married a PATS and Red Sox fan - however, we have to keep our sporting affiliations a secret as we are living in Yankees & Jets territory. I go home to Ireland at least once a year.  Sometimes more.   ",
      "MessageIndex": 11,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761717",
      "Title": "Frightened - waiting for results - would like any support Marsrover Tundra"
    },
    {
      "AuthorID": "Marsrover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114919/profile",
      "Content": "Dec 8, 2010 02:03PM Marsrover wrote: Oh Lorraine - thanks for the speedy response. I really could just bawl my eyes out.  I am a total wreck of nerves. I am so horribly afraid that these 5 Microcalcifications could be some awful advanced breast cancer that they won't be able to cure.  Am I sounding really ridiculous? ",
      "MessageIndex": 2,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761717",
      "Title": "Frightened - waiting for results - would like any support Marsrover Tundra"
    },
    {
      "AuthorID": "Marsrover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114919/profile",
      "Content": "Dec 8, 2010 02:12PM Marsrover wrote: Hi NatsFan (Mary) Thanks for writing.  I would like to sink into the bubble bath but no bubbles until the breast biopsy site is healed.  Bah Humbug! You know, I never figured myself to be a nervous wreck and I always thought of myself as a pretty practical person - but I guess that all went down the drain with my new found pastime - worry!!! I work in a very practical arena - the Information Technology world so working has really helped keep much of this incessant worry at bay.  Late at night or the wee hours of the morning have been worst.  I wake up to find my mind in a whole new place.  Unchartered territory. Fiona ",
      "MessageIndex": 5,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761717",
      "Title": "Frightened - waiting for results - would like any support Marsrover Tundra"
    },
    {
      "AuthorID": "Marsrover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114919/profile",
      "Content": "Marsrover wrote: Hi, I am new to the forums.  This is my first post.  It is nice to meet you. A little background on me:  I am 41 years old.  Married with 2 Children, a little girl 5 years old and a little boy 22 months.  I was born and raised on the west coast of Ireland and moved to the United States when I was 25.  There is no history, that I am aware of, of breast cancer in my family.   My Mom, Dad, brother and 3 sisters are all alive and well. I breast-fed both my children and stopped breast feeding my son in May of this year. My OB/GYN said that it was important that I go for my baseline mammogram.  I waited 6 months until my breasts dried up and I had my first mammogram on Nov 18th.  My breasts were classified as hetrogeneously dense.  I have tiny breasts - maybe a B cup - but I doubt it.  I am a very small-framed person.   I was called back for a diagnostic mammogram on Nov 23rd.  I was then told to come back for a biopsy of my left breast.  They found a cluster of 5 microcalcifications. I had a stereotatic biopsy yesterday of 2 areas in the left breast.  It was quite uncomfortable but it is over now.  Hurray!  The down part is now: \"The Waiting Game\". During the breastfeeding of my kids, I got mastitis twice, both times my left breast was \"The Trouble Maker\".   My breast got hot to the touch and also very painful and lumpy.  Both times, I was treated with antibiotics and the mastitis cleared.  Neither of my kids every wanted to breastfeed from my right breast.  I am a left-handed person and my guess is that the milk flow must have been stronger from that breast - or something... Anyway, before I type my entire life story....the main reason for this posting is that I am freaked out of my head waiting for these results.  1)  I am telling myself not to worry - but Gosh...I am worrying. 2)  I am trying not to think ahead but I am already there.  Thank you for any calming input or educational information. Fiona Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761717",
      "Title": "Frightened - waiting for results - would like any support Marsrover Tundra"
    },
    {
      "AuthorID": "Marsrover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114919/profile",
      "Content": "Dec 8, 2010 02:29PM Marsrover wrote: Hi, Thank you so so so much for all the responses.  I am going to sound like a total nut but I have already cried reading some of your responses.  I have been feeling so terribly alone for the past 2 weeks as none of my friend or family have experienced this kind of worry.  So, thank you from the bottom of my heart for helping me feel like there are people out there who understand and care - really thank you!!!!  Amy:  I was born in Galway Ireland.  I am from the city of Galway and my Mum, Dad and sister are still there.  My other 2 sisters are in London.  My brother is here in New Jersey - close by. Kathleen1966 and Sweeney:  Thank you for telling me about your families.  It is nice to know people who are in a similar place.  My kids are Siobhan and Cillian (pronounced Killian)",
      "MessageIndex": 10,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761717",
      "Title": "Frightened - waiting for results - would like any support Marsrover Tundra"
    },
    {
      "AuthorID": "Marsrover",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114919/profile",
      "Content": "Dec 9, 2010 05:02PM Marsrover wrote: Dear Kintexas,  I am in the same situation as you.  I am in the waiting game.  It is really awful and I fully sympathize with you. I just had my biopsy (2 locations) and they were very close to the nipple.  I can tell you that the biopsy (on Tuesday) did not hurt. I had a stereotactic in 2 places on the left breast.  I was uncomfortable on Tuesday night but the procedure is not bad - so please try not to worry about that.  They will make you as comfortable as possible. I am 41.  I wish you much luck and an easy straight forward procedure. The women on here have been of great support to me too. Fiona ",
      "MessageIndex": 1,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761766",
      "Title": "1st biopsy B9 but more to come Kintexas Kintexas"
    }
  ]
}