{
  "AuthorID": "Martini",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224849/profile",
  "Posts": [
    {
      "AuthorID": "Martini",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224849/profile",
      "Content": "Jan 29, 2016 04:52AM Martini wrote: AlaskaGirl, We have almost the same diagnosis and I am wondering what you decided on whether to do rads or not.",
      "MessageIndex": 44,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/832938",
      "Title": "Lung damage nearly 3 years after radiation finished? Lily55 Martini"
    },
    {
      "AuthorID": "Martini",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224849/profile",
      "Content": "Feb 7, 2016 01:43PM - edited Feb 7, 2016 02:08PM by Martini Mary, please add me and thank you for starting this thread. Hello Everyone! So happy to have found this thread as I have so many questions and concerns...I guess that is why we are all here, for help and support that only those that have walked this path before or are walking it now can provide. Starting 30 treatments (although I might opt out if the boost) February 16th. Was Writing my shopping list as I read your posts but now holding off, as recommended, to see what i will actually need. Gentle (sideway) hugs to all.",
      "MessageIndex": 1124,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Martini",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224849/profile",
      "Content": "Feb 16, 2016 07:13PM Martini wrote: LMN. Yes!!!! Congratulations!",
      "MessageIndex": 1393,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Martini",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224849/profile",
      "Content": "Feb 23, 2016 10:29PM - edited Feb 23, 2016 10:30PM by Martini MARIGIN, I have had 6 treatments and am nauseated as well. Came on after the fourth. My RO, said it isn't usual but does happen. They prescribed me ondansetron, which I understand is a anti-nausea drug they use for chemo ( I didn't have chemo either). I am also experiencing gas and heart burn which I have rarely ever had before. I'm in Canada and my TO has not heard of aquafor, I did order some \"my girls\" from Amazon and will definitely be picking up some \"bag balm\" now! I also have weekly x-rays and the occasional shooting pains in my chest. I don't post much as I find it very hard to do on the tablet but really appreciate all the helpful tips, the sharing and the witty comments!!",
      "MessageIndex": 1601,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Martini",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224849/profile",
      "Content": "Feb 23, 2016 10:58PM Martini wrote: marijen, yes the meds help. No, haven't really been suffering with headaches and the few I have had I can chalk up to clenching my teeth! I'm an having joint pain and some pain in my leg on the same side they are radiating. My RO is a young woman and is open to anything is possible and our bodies can definitely show its reaction to treatments very differently. I hope they give you something to help with the nausea. I'm always amazed that our treatments and their recommendations on creams etc can be so different. I would have thought there would be some continuity among the BC community. I see you gave started hormone treatment as have some others but I was told I had to wait until after rads. ",
      "MessageIndex": 1604,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Martini",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224849/profile",
      "Content": "Mar 15, 2016 09:12PM Martini wrote: I too was encouraged to take vitamin d and calcium during rads. I have 4 more to go of 25. Not red but do have a little bit of rash starting and some itching. I'm sixty this year so don't know if that has anything to do with fatigue but I'm exhausted quickly! Congratulations to all who have finished, healing thoughts to those with sore boobs, armpits and clavicles and welcome to those just starting out! And to you, Mary, a thousand thank yous for starting this thread, I haven't posted often but have read every post, gleaned a wealth of information and thought of each and every one of you as we traveled this path simultaneously. Warm hugs to all (gentle side hugs :) Marilyn",
      "MessageIndex": 2120,
      "PostDate": "15/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Martini",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224849/profile",
      "Content": "Feb 16, 2016 07:11PM Martini wrote: Brightsocks. I had , my first treatment today. Took around 30 minutes today but will only be on the table 15 next time. Relax and breathe. Best luck tomorrow?",
      "MessageIndex": 1392,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}