{
  "AuthorID": "marthamm",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77190/profile",
  "Posts": [
    {
      "AuthorID": "marthamm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77190/profile",
      "Content": "May 20, 2009 12:14PM marthamm wrote: Just to add to the conversation, I was on low dose Xeloda during radiation and had no side effects (hair is fine) other than being more easily sunburned so I made sure to stay out of the sun as much as possible.  ",
      "MessageIndex": 4,
      "PostDate": "20/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734384",
      "Title": "xeloda RJ62 RJ62"
    },
    {
      "AuthorID": "marthamm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77190/profile",
      "Content": "Jan 4, 2009 03:12PM marthamm wrote: Hi Everyone - Hope everyone is doing okay.   Lisa - I'm really sorry about your hair.  I know it sucks but eventually we'll all get our hair back, at least that's what I tell myself when I really miss my hair. Martha",
      "MessageIndex": 253,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "marthamm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77190/profile",
      "Content": "Jun 3, 2009 06:05PM marthamm wrote: 22.  Well if I was having it done it wouldn't be a big deal since I just have \"A\" cups but for you that must really suck.  (Really? It wouldn't suck?)",
      "MessageIndex": 9,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "marthamm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77190/profile",
      "Content": "Jan 1, 2009 10:47PM marthamm wrote: Hello Ladies -  So I'm not starting chemo this month but actually started it 10/30/08 but haven't really been on these threads so I thought I'd jump into this Jan Jewels one.  I'm 31 (turning 32 this month) and did a lumpectomy 9/30/08 but didn't get clear margins so I'll be doing a masectomy with reconstruction when I complete chemo.  I have a lot in common with LisaLisa since I am also scheduled to do 6 rounds of TC and am being treated at UCLA as well.  If any of you have questions I'm happy to give any advice I may have even though I'm still trying to figure it all out myself with plenty of questions of my own.  Chemo sucks but it's doable and once you get through the first round knowing what to expect makes the other rounds better.   Like some of you I am also a teacher and have been trying to work as much as I can (taking 4 days off each round) - I think it's also a nice distraction.  I'm trying to walk to help fight the fatigue (which helps alot) but unfortunately have managed to gain 6 pounds so far which I find extremely frustrating.  I've been lucky dealing with my baldness in that as much as it sucks I'm okay going bald occassionally in public (though I wear headscarves most of the time) - it might have been my fellow bald coworkers that made it easier to feel \"normal\" bald, just try to remember baldness is totally gorgeous and there's nothing hotter than a woman who can kick chemo and cancer's ass.  I'm doing round 4 tomorrow and wish all of you the best of luck with minimal SEs.  The time will fly by - really.   ",
      "MessageIndex": 179,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "marthamm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77190/profile",
      "Content": "Jan 3, 2009 11:58AM marthamm wrote: Hello Everyone -  Hope everyone is hanging in okay with all those first rounds of chemo.  I had another round of chemo yesterday and 2 more to go - if I'm managing to survive so will all of you.  So I had quick questions to see if anyone could answer - I know a lot of you have already had your surgeries.  I had a lumpectomy prior to Chemo but no clear margins so I know I'm getting a mastectomy after chemo but I can't decide on whether it should be bilateral.  I'm leaning towards non-implant immediate reconstruction & I really just want to get reconstruction over with and not drag it out since I'm a huge whimp.  So first of all - do any of you know what the general percent of likelyhood that the bc will show up in the unaffected breast is (I know this can vary depending on the case but I have no sense of a number on this)? And second those that have had DIEP or free flap procedured - how bad was the recovery? I'm seeing my surgeon on Monday to start the process of finding a PS and figuring this all out but I like to show up to appointments with all my questions ready to go and as well informed as possible.  Martha",
      "MessageIndex": 226,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    }
  ]
}