{
  "AuthorID": "marvil",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
  "Posts": [
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Mar 26, 2009 10:05PM marvil wrote: After having a rough 3 days (extremely low WBC, now getting neupogen shot for 5 days) I just got an absolutely great chuckle from JDEKING's wig story!  That's something I would do...my husband is always cutting off tags on things I wear.  Then I read KIMMOM's post and it just reminded how the scenery keeps changing in this chemo journey...and depending where you came from affects how you see things...I hope you keeping feeling better! Well I've got really bad mouth sores too right now...does anyone have any tips on mouth sores?  I use biotene, as well as the baking soda gargle mix, but there isnt anything really helping the sores.  Do we just live with them until they go away?  They popped up like 3 days ago and really hurt now that I'm on day 11 of my first round. Prayers and hugs to all!!",
      "MessageIndex": 477,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Mar 29, 2009 01:39PM marvil wrote: Thanks for the tips for the mouth sores. My sores are finally dissipating. What I also found helpful was tucking in my lips inside my mouth and gargling to make sure the Biotene covered my lips. My sores were on my lips which was the only area that wasnt really getting the Biotene mouthwash (who would think to gargle with there lips inside the mouth? but it helped me). I've been using vitamin A&D ointment on the lips too.  Nasharayne - so sorry for your week. You are exactly a day behind me. Hang in there. I too felt better at the start of the week then went back to all crappy.  I was ice cold all the time and felt weak. I was feeling so crappy I didnt feel like going in for a scheduled blood test on day 9, but I realized something wasnt right so did drag myself in.  I found out my WBC had dropped to 1.3 (was 8.1 pre-chemo).  Its day 14 right now for me and am finally starting to feel better...my taste buds are all messed up tho. ...I'm hoping 3rd week of the cycle will be better.   Cpanasci - I think the blood test are important.  I was told I am to get my blood tested around day 9 of each cycle to watch my WBC because counts lower and you need to be extra vigilant against possible infections during this time.  I think I am supposed to get blood tested before they start each cycle too. I didnt take a neulasta shot, but needed neupogen shots after my WBC count dropped too low.  btw I noticed there have been several posts on menstral cycle during chemo.  Well I have been so irregular these past years and thought for sure my periods would stop....but I too started my period during my chemo. I guess I should just learn to expect the unexpected. I'm praying that everyone on their chemo premiere or on their 2nd cycle of chemo have a restful, postive-energy-filled healing week ahead! ",
      "MessageIndex": 574,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Apr 6, 2009 07:33PM marvil wrote: Hi all.  Well today I got through my 2nd TCH infusions.  Thank God it was uneventful with no reactions.  What was most surprising is that my chemo was not delayed.  I found out before my appoinment that my liver enzymes were elevated (double the normal range for ALT and AST).  My onc told me she did not think the levels were serious enough to delay chemo becasue my billirubin was normal. I guess the bilirubin are the counts they are most conerned with when monitoring the liver functions.  Well I'm still scared as heck because I'm not sure how my liver is gonna filter all this out from my 2nd round.  I am drinking lots of water and doing the anti-constipation routine...prune juice, prunes, stool softners, papaya.  No fainting again haha!! MOB - you must have awesome skin!  I need to get with your moiturizing routine becasue I only cover areas I remember (face and hands).  I may end up looking like the prunes I'm eating if I dont cover the other areas. Crusader1 - I love the picture. I haven't buzzed my hair as planned.  So every day is a bad hair day for me.  I cut my hair short at the start of chemo and now what remains is super thin and anyway I part it there is a wide liner bald spot.  I need to buzz it before the next shampoo. Gina - So sorry to hear about the irritating rashes...I hope they give you something good to alleviate it quickly. Luv2Sing - You deserve that chocolate cake!  You are so inspiring for even thinking about hosting the pageant during treatment.  Whether or not you are able to host, I'm sure you would have made a beautiful host...headwrap or hair.  Hugs and  Prayers for all!  Heal all week!",
      "MessageIndex": 957,
      "PostDate": "06/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Apr 8, 2009 01:10PM marvil wrote: Dawn-  During my 1st cycle my WBCs dropped low to 1.3 on day 9 and doc prescribed 5 days of neupogen shots.  The shots worked really well for me and I felt better quickly with no bone pain.  Before 2nd treatment I got blood tested and WBCs were normal ...10,000...so shots worked.  Only problem with my blood counts were my elevated liver enzymes (ALT and AST) which I don't think are related to neupogen shots, but rather the chemo drugs.  Doc said my bilirubin count was normal so chemo #2 went as scheduled.  Instead of waiting for the blood test this 2nd cycle, my onc has already prescribed 7 days of neupogen beginning day 5.  I am to get my WBCs tested the last day of neupogen shots.  I have never taken the neulasta shot so I can't comment on them.  But the neupogen seems to have worked for me the first time...the only inconvience is the daily injections at home if you are not trained. This won't be an issue for you though because you are a nurse.  My mom, who is a nurse, gave me the injections at home the last cycle...this time I plan to do it myself after getting lessons at the hopsital.  I know everyone has different situations but what ever course you take I wish you well!   ",
      "MessageIndex": 1018,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Apr 29, 2009 11:54AM marvil wrote: Hi everyone!  Well got tx #3 yesterday.  I was a day delayed this cycle because my onc was out sick on Monday.  So far doing okay.  I'm getting ready to ride out the icky waves the first few days...but so far nothing major.  Been sleeping and trying to get as much fluids in between and doing my anti-constipation routines.  Taking Nofran for nausea...so far its working.  The 2nd cycle was much better thant the 1st one...I am hoping this 3rd will be similar or better. Buddy you are in my prayers.  Hoping all goes well today for you.",
      "MessageIndex": 1703,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Apr 2, 2009 11:57AM marvil wrote: Hi all.  Well after the variety of SE phases, I'm feeling better now that I am into the 3rd week of my first cycle. I'm still taking Zofran twice a day because nausea seems to be lurking when I don't.  I'm gonna enjoy these remaing 4 days before I go in for TCH# 2 this Monday (4/6).  I dread going in for #2, but I know it has to be done. I just hope my blood counts will be okay.  Rachel - soo very sorry to hear about your SEs.  I too fainted in the bathroom and woke up in the bath tub (although for a different reason...happened when I was straining in the bathroom after dealing with constipation). It is a really strange experience when you wake up and realize you are somewhere else.  I hope it never happens again....but please take care...its really good that your father will be with you.  Carol - your Pube Fairy announcement did wake me up haha!  My hair has begun falling off too. I had it cut short at the start of chemo and although my shedding has been manageable, it can be emotional at times because you realize what your body is going through.  I keep using masking tape to pick up all my hair.  I ordered a buzzer and may soon be asking hubby to do the deed as well.  I hope and pray everyone has a healing week ahead!",
      "MessageIndex": 768,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Apr 15, 2009 11:10AM marvil wrote: nasharayne - aw i totally feel for you on the diarhhea and hemorroids.  I had severe constipation the first round and it caused a flare up of hemorroids which I am still dealing with...and lately I have had the loose bowel and it burrrnns! if you know what i mean?!  I hope your SEs go away soon.  I have my moments this 2nd cycle, but managing and am riding the icky waves out. GTY -  The hair decision is a tough one and different for each person, but I think you will know the time has come because you will get to a point you can't deal with the awkward phase and shedding hair anymore.  You will almost be looking for a sense of relief.  I had long thick hair that I cut to a pixie during the first week of chemo.  I tried to keep from buzzing my hair as long as could...but I had my hubby do it day 27 since start of chemo.  Before that I was constantly wearing kerchiefs and turbans just to keep my hair on the scalp...but it was thin, shedding, and barely attached.  I absolutely dreaded shampooing my hair because of all the shedding I was doing in the shower.  I kept talking about buzzing my hair for over a week before I finally did it.  It helped psych myself up for it.. but when I did do it I did feel a sense of liberation.  I no longer have the fear of shampooing lol!  I wear wraps with more confidence because hey I'm bald and I'm moving on.  I don't leave a trail of hair on the floor anymore either (although the remaining stubbies are still falling out its not that bad cause they are small...much easier to manage and keep clean).  There are things, however, that I am still trying to deal with now...it gets cold with a bald head especially at night so i sleep with a turban...I also need to find something to moisturize my scalp with...maybe I'll use conditioner just to see if it works even without hair.  I am on TCH x 6 (taxotere-carboplatin-herceptin) with herceptin to continue an additional 6 months.  I asked the onc twice and twice she told me yes I would lose my hair.  I assumed, but did not specifically ask \"all\" though.  So Gina may have a point that not all of it may fall out.  In my case,  if the stubs are still falling I think I would not have enough to worry about lol. ",
      "MessageIndex": 1282,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Apr 11, 2009 08:45PM marvil wrote: Well I too got my hair buzzed today lol!  My DH did the deed with my teenage son looking on to to make sure there was a steady flow of smarty pants comments in place to break the mood.  I had so much grey growing in I was a bit shocked at my grey stubbies, but overall I too feel liberated like Pickle and Janet0527.  My buzz was overdue because I'm not sure how most of the hair that was left on my head was still clinging on to my scalp!  I feel squeaky clean tonight...but I'm sure I will be asking myself in the near future how to wear this new look.  Until then...I'm going to bed, in my comfy pajamas, and enjoying the squeaky clean feeling!",
      "MessageIndex": 1130,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Mar 22, 2009 09:41AM marvil wrote: Ohh my count me in!!  That pomegranate stuff looks delicious! Gina...thank you for the keeping this thread going and keeping us connected.   Geez I feel like such a wimp.  I had my firt TCH 7 days ago...and I feel like posting takes the full concentration energy of my one brain cell that seems functioning.  Well I had a terrible bout of constipation the first 5 days...I strained so bad on day 5 that I actually passed out cold in the bathroom.  I know there were some posts earlier about preventing constipation and those were really wise recommendations.  I have never fainted in my whole life, but while I was straining I felt like I was having a stroke (broke into cold sweat) and the next thing I thought was how I felt so much better but only problem I wasn't in the same place...I was in the bathtub!!  Head in water spout and shower curtains! I don't even know how long I was passed out for.  Can you believe constipation could do that!!  So if starting chemo...I agree with earlier posts that said take stool softners earlier rather than later.  And their effects takes days so you need to take them sooner, not like me.  I never thought it would get that bad for me because I was always regular like a clock.  Sorry for all the graphic details...but going through this round really makes me think of what I could have done differently.   Since then I have been taking the stool softeners, Metamucil, prune juice and dried prunes.  I haven't had a problem with the constipation anymore so I've cut down on quantity of laxatives I'm taking....maybe I go more than I should but I'll take it over passing out after 5 days.",
      "MessageIndex": 259,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "marvil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79013/profile",
      "Content": "Feb 8, 2009 07:15AM marvil wrote: Hi.  I am recently new to this community but wanted to let you know that you and your entire family are now in my prayers too.  Im not as knowledgeable as these other amazing women because I have just begun this unnerving process of waiting, but please know that my prayers and heartfelt support are with you. ",
      "MessageIndex": 40,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727943",
      "Title": "Searching for support Luv2sing marvil"
    }
  ]
}