{
  "AuthorID": "maryhope",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
  "Posts": [
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 22, 2011 07:27PM maryhope wrote: Jann, my mammogram show two masses and my MRI showed one big Mass 8 cm.( the surgeon told me the results) Well, after the surgery RMX the report came back two small tumors!! So I have been going around saying I hate MRI's. They should not do test if not actuate....We can't win in this nightmare!! my head just pounds at the end of the night!! Not that I'm saying your test are wrong. Since all of this has started so many things have changed on me. There are so many factors when they do these test. Like I said earlier, it's so out of are control, and no time to ask for repeat text, and who's Insurance would pay for that anyways! I just went to the store and bought foods for chemo diet. I swear I got sick to my stomach and almost ran out of the store..I have read about how we should eat or not eat!! So I think, everything we do effects us so hard cause it so so scary!!!! I know MOMOF3BOYS had such a bad day going to check out wigs, iITS ALL TO MUCH FOR OUR EMOTIONS, THERE IS SO MUCH WE HAVE TO DO AND THINK ABOUT!!!! I was only shopping for jello, oatmeal, distill water ( found that one out on this board) and really felt sick!! Omg this sucks!! Hope we all can block it out for the next few days. You ladies who are going to be doing trial TX. I would love to do that! Good luck!",
      "MessageIndex": 43,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 21, 2011 09:58PM maryhope wrote: Thanks ELY for starting this board! I have been reading the Dec group who have started TX, but I feel like I want to join this group. MOMOF3BOYS, I also start TX on the 29th. (TAC) I get my port in on the 28th. Just found out last week my group of ONC voted that I do get radiation fellowing chemo :(. I did have a RMX 10/29/11. Girls the feeling of no control, is so rough! All these people we don't even know are calling the shots! I just wish I could stop time for a few weeks..everything happens so fast with BC. We can hardly think anything through and your on the next step...WE WILL GET THROUGH THIS!! So many have that's what we have to go with. We are now going to do TX together! So happy to meet all of you!! Night!",
      "MessageIndex": 29,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 14, 2011 03:04PM maryhope wrote: Chemo class...No one from my ONC told me about that, or LAURIELOOMIS did you sign up for a class at a support center? Sure would like to take a class, will have to check that out. 3MOMSTMAMA, u r right! I'm learning so much here.... Today writing down all the foods for mouths sores..I already have Refux so I'm worried about nausea...going to take whatever I can to fight nausea! I've taken anxiety med for years for sleeping issues, highly recommend it! That so helped me get through my Mastectomy...Nurses family and friends keep saying you are so strong. I keep thinking it was my happy pill or maybe it's what KELLOGGS said earlier, don't know how else to handle it, can't get out of this one! So trying to keep up a good attitude! Pet scan tomorrow.",
      "MessageIndex": 435,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 18, 2011 01:28AM maryhope wrote: LAURIE, WOW TWINS!!! How nice, they for sure will keep your mine off of feeling bad...Sounds like a beautiful family!! Enjoy!! Mary",
      "MessageIndex": 506,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 13, 2011 10:04AM maryhope wrote: 3monstmama, welcome! I'm here to learn..you know and understand are fears. You are apart of our sisterhood, because you have been were we are. Now you have to relive it with your Mom... Hello Laurieloomis! I'm right with you, and will be holding you hand through all this mess we are in. Everyone here well be in my heart today, cant wait to check in on you stronge women tonight! I've been looking and feeling my hair a lot more then I ever did, that is a hard one!! Mary hope for all!",
      "MessageIndex": 404,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 13, 2011 03:29PM maryhope wrote: Rachels, dlm217, rcm, Laurieloomis, and any other who are starting chemo at the end of this month... I was wondering if some of us who are newbies, do you think we should start a Jan 2012 site...I'm sure the girls who started early Dec do not want to relive what they just went through! I know we have all been reading and learning from these sweet ladies..I feel we are a bite inturding...We could start are new site when we start our treatment...what do u think?",
      "MessageIndex": 407,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 14, 2011 04:35PM maryhope wrote: ",
      "MessageIndex": 438,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 17, 2011 05:12PM - edited Dec 17, 2011 05:13PM by maryhope Hi LAURIE...maybe your family will help keep you mind off the nightmare we are in. I hope for your sake! How many grandchildren are coming! I have none. My kids are old but not married yet. I want grandbabies!!!!! Will they all be staying with you for Christmas? Try to have fun and focus on them. RACHELVK...REALLY! They only gave you a small about of nausea meds, Omg! Thanks for that information. I will make sure my ONC gives me plenty. Sounds like are life line!!! DARLAM...What are cold caps? Reading about that. I've looked it up but not luck! SECRET....glad your thorat is better, that sound awful! Hope for smooth sailing on #2 :) Stay strong hugs to you all!",
      "MessageIndex": 493,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 18, 2011 09:27PM maryhope wrote: Laurie, I laugh at your repley, I guess we better laugh now, cause it sounds rough...We will get through this together and with this great bunch of women here to help each other Secret! We want to listen, Are you kidding girlfriend you bitch all u want. I feel the pain u have in my heart! I may be right behind you, I will need to vent. I don't want to complain so much to the family when my time comes, cause it's hard enough to live with a sick person. I don't want to wear them down so I can say what I want here and everyone really gets its. I hope you will feel better soon, hopefully the mouth wash will help. That must be painful, sorry!!",
      "MessageIndex": 526,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 15, 2011 12:20AM maryhope wrote: Keepnfaith You will have fun tomorrow sounds great! When I have done the same thing with my family, that helps so much not to think about it!!! I have been getting so silly with my family, to make them laugh. One nice thing coming out of this, is I laugh more with my family and we have become so much closer! I love that fact.. I have been doing crazy things to them. Nurses and staff as well! I never feel like I did my job, in less I have a tech and anyone around me laughing..maybe it's not good for a 58 yr old to be silly, but things are flying out of my mouth I thought I would never say! < /MARKAT, sorry about your headaches, a trip to the ER had to scare you!! Maybe in time they will fade. Are you able to take tylenol? Or something for the headaches...sleep well!",
      "MessageIndex": 451,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 15, 2011 08:39PM maryhope wrote: ",
      "MessageIndex": 467,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 18, 2011 01:17AM maryhope wrote: RACHELVK.. Thank you, I get my results on Monday....Had a better Friday and Saturday! Im going to make cookies all day Sunday to keep my thoughts off of Monday! Did not get my port yet I get that put in the day before I start chemo. I hope your port feels better! SECERTGRD..OMG, I bet you do get sick of thinking and feeling everything that's going on in your body! So sad that we have to get sick to get better!!! Hope you feel stronger today!! Hope all of you can rest today who needs too! Oh yes, that was so nice to hear from women who are visiting the site because they are done and letting us know things will be better at the end of this dark tunnel we are in!!",
      "MessageIndex": 505,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 18, 2011 11:10AM maryhope wrote: LAURIE, the port goes in Dec. 28 and chemo 29 if I remember u start chemo the 28. Oh yes we will be doing this at the same time. Adriamycin, cytoxn, Taxotere. Those are the flavors of the month!.. Feel sick just looking at those words!! What is your cocktail? Thank God, for these posting, I have learn so much hear..No chemo school for me yet going to ask about that! I wish you and I could have sleepover like our kids did, the night before!!! Lol !! My husband who has been saying it will all be fine! I want to scream to him, then you do this!!! He means well. :) For those having SE I wish I could say something to make you feel better!! ((((( Big Hugs to u))))",
      "MessageIndex": 511,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 13, 2011 12:12AM maryhope wrote: Hello ladies, was not going to post yet, but I saw dlm217 and like her I'm starting chemo on the 29. So I felt like it was to soon to start posting. Wanted to see what Im in for, so thought I would jump in so I could say hi to dlm217. I wanted to let her know we start together! All you 40 something girls, my heart goes out too you, I'm a empty nester, and I tell people I think I can do this cause I don't have kids home!! Wishing extra strength for you with kids home. I do work and I'm 58. Im so happy I have found this post cause like you dlm217 I'm so scared as well! All of you who have started treatment, you are awesome people to me right now!! I think about all of you all day! Stay strong and I hope this nightmare will go fast for us all! (((hugs))) to u all!!",
      "MessageIndex": 390,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "maryhope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140988/profile",
      "Content": "Dec 14, 2011 10:33PM maryhope wrote: Keepnfaith, that same thing happen to me with tumor sizes ( MRI wouldn't work so it took 3 hrs. to complete the test) The test said I had a 8cm tumor, thats what the surgeon told me who did my Mastectomy. Turn out to be two smaller tumors. So many things have change on me. First they told no radiation now my ONC called me this week and said they had a meeting and I will have Radiation after chemo.. REALLY!!!! So what are we suppose to do say NO! So here we are venting! Don't be upset what is the difference, no such thing as having a little cancer...One big tumor, or two smaller ones cancer is cancer! Oh yes, the reason I have to have radiation now is because my 3 nodes are a lot bigger then they thought. I will win this!! They can change there minds all they want, but I'm keepnfaith!!! You girls that just had Mastectomy, PLEASE Take it easy. I felt not to bad at all the first week. The second week it hit me hard! Heal fast! Nighty night Nighty",
      "MessageIndex": 449,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    }
  ]
}