{
  "AuthorID": "MaryScout",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288291/profile",
  "Posts": [
    {
      "AuthorID": "MaryScout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288291/profile",
      "Content": "Apr 20, 2019 08:02AM MaryScout wrote: I want to thank everyone so much for the measured responses. You are awesome! I've had a rough couple of days trying to let this sink in. My first meeting with a doc is scheduled for May 7th, so I'm sure I'll learn a ton then. They are sending me to a breast surgeon, but I'm not sure why there rather than to an onco. I'm guessing it's because they probably want to do some kind of excision biopsy. So, in the meantime, I'm so glad I'm on effexor anyway. I'm pretty sure that I'm post-menopausal, but don't know for sure given my hysterectomy. I was taking estradiol, but about 6 months ago decided on my own to give it up. I'm glad! Thank you all, again. You're the best. :) Mary",
      "MessageIndex": 6,
      "PostDate": "20/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/871093",
      "Title": "New to this and already considering PBMX MaryScout MaryScout"
    },
    {
      "AuthorID": "MaryScout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288291/profile",
      "Content": "MaryScout wrote: Hello All! My name is Mary, and I was just diagnosed with ADH and a small foci of ALH. I'm 54 with a lot of history with cancer -- cervical at age 34 (hysterectomy, no radiation), and then 3 different melanomas. I don't have any family history of breast cancer, but my mom died at age 41 of lung cancer, and her mother at about age 50 of suicide (I know, sounds so terrible -- I never knew her). I guess I know by now how the waiting game feels, and I am having trouble seeing myself coping with all of the tests and waiting for results in my future. I've had a fibroadenoma removed, and I have dense breasts. So... I'm thinking of just going for the PBMX and moving on while I'm young(er!) and have time. Any thoughts on this? Maybe just being nervous here and am over-thinking it, but wow, I've had a lot of cancer and I've lived the anxiety that goes with it. Have any of you here had these thoughts? I live in Pennsylvania, so am kind of thinking of surgeons to travel to. If you have any thoughts on that or any of these things I'm thinking of, I would love to hear! TY to everyone. From your newbie, Mary Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/871093",
      "Title": "New to this and already considering PBMX MaryScout MaryScout"
    },
    {
      "AuthorID": "MaryScout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288291/profile",
      "Content": "May 28, 2019 05:04AM MaryScout wrote: Hello All, I thought I would follow up on a thread I started in April when I discovered I had ADH and a small amount of ALH. It took so long for me to be able to get in to see a breast surgeon that I had a ton of time to research and to reflect. I was inclined to do PBMX from the very start because I'm a survivor of multiple other types of cancers and didn't like the idea of close monitoring. I also travel a LOT (much of it overseas), and I thought that the monitoring would make this part of my life pretty hard. Okay, so I went with my gut and did the PBMX with DIEP reconstruction! I went to the breast center in New Orleans for this, and am now post 2-weeks. I totally know that this isn't for everyone, and I respect, appreciate, and support all the directions that people may take. This was my direction, and I'm super happy with how it turned out. I'm not gonna lie -- it was scary to take the plunge, but the plunge was taken! Anyhow, just thought I would put this out there in case anyone ever wants to ask anything about this direction. I know I'm a sample of 1, so, for what it's worth. ha ha. I love this forum. Everyone here is great. My best, Mary",
      "MessageIndex": 7,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/871093",
      "Title": "New to this and already considering PBMX MaryScout MaryScout"
    },
    {
      "AuthorID": "MaryScout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288291/profile",
      "Content": "May 22, 2019 08:15AM MaryScout wrote: Hi Rebekah, I was diagnosed with ADH (and small amounts of ALH) about a month and a half ago. I guess because I've survived cancer before (cervical and melanoma), I pretty much knew right out of the gate that I didn't want to do the high-vigilance approach. I didn't want the multiple biopsies, the waiting, the anxiety, etc. They were also suggesting drugs (e.g., tamoxifen), and I didn't want to do that either. I travel a lot in my job and for pleasure, and a lot of that travel is out of the country. I really didn't want to change all that either. So.... I got hard to work and scheduled a PBMX with diep flap at the Center for Restorative Breast in New Orleans. It's been one week and a day since I had it done, and we returned back home (in PA) yesterday. I can honestly say that this has been one of the best decisions of my life. If I wouldn't have done it, today would have been the day I would have gone in for my first excisional biopsy due to the ADH. Instead, I'm having a cup of coffee in my house, enjoying life, healing really well, and seeing this whole thing as a bad dream that's over. I know what I did was super pro-active and what some might characterize as extreme. The one thing I really realize is that we are all different -- in our emotions, in our framing of this disease, in how we want to approach it, in how we heal, in what is important, etc. And every difference is one that I respect and appreciate. So this is my \"difference,\" and it sounded like it might be relevant to your question. If you are thinking of PBMX with reconstruction, I cannot recommend the practice in NOLA highly enough. They are truly top-notch. I love my new foobs -- because it is a diep, they are my own tissue -- soft, warm, and permanent. They are numb, but some of the feeling is starting to return. I know it will never get to wherever it was previously, but that it ok. I would go this route again without question. If you want to talk at all, please feel free to PM me. Would be happy to do it. Yours, Mary",
      "MessageIndex": 15,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/870633",
      "Title": "Prophylactic Mastectomy bruinjamie21 trina21"
    },
    {
      "AuthorID": "MaryScout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288291/profile",
      "Content": "May 4, 2019 03:24PM MaryScout wrote: Hi All, Thanks for starting this thread. So I have been diagnosed with ADH, and I, too, just couldn't wrap my head around all of the future tests, worries, and drugs. I've had cervical cancer and 3 melanomas, so I feel at least somewhat versed in dealing with cancer. I'm not as young as you all -- I'm 54 -- but I feel young! (or at least immature :) ). So... I'm scheduled for PBMX w/ diep in the NOLA breast center on May 14. I've talked with so many friends/survivors, and none of them have tried to dissuade me at all. I know that my decision isn't for everyone, but I believe for me it's the right one. For other women who feel similarly, I understand! All of this decision-time moved very quickly (for which I am grateful). I've finally now just finished dealing with the insurance approval (Aetna, PPO) and with the pre-op tests (and travel). If anyone thinking about it ever wants to talk, I'm happy to do it! Best to everyone making this tough choice. It's great having a supportive community who cheers us on no matter what route we decide to take! Warmly, Mary",
      "MessageIndex": 10,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/870633",
      "Title": "Prophylactic Mastectomy bruinjamie21 trina21"
    },
    {
      "AuthorID": "MaryScout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288291/profile",
      "Content": "May 31, 2019 09:31AM MaryScout wrote: Hi Cinnamon, I understand your decision. I had PDMX for ADH on May 14th, though I chose to do a DIEP reconstruction. I wish you all the best with this. If you ever want to talk, shoot me a PM and I'll send you my phone #. Yours, Mary",
      "MessageIndex": 6,
      "PostDate": "31/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/871784",
      "Title": "Biopsy Results This Thursday... CinnamonSpice MaryScout"
    }
  ]
}