{
  "AuthorID": "maryann77",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99153/profile",
  "Posts": [
    {
      "AuthorID": "maryann77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99153/profile",
      "Content": "Dec 13, 2010 05:40PM maryann77 wrote: I think that hair regrowth after chemo varies person to person. As the same with who develops lympodema after having their lymph nodes removed. Some will develop it and some won't. But I also know that taking hormonal treatments, such as tamoxifen, can slow hair regrowth.",
      "MessageIndex": 19,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "maryann77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99153/profile",
      "Content": "Dec 14, 2010 06:21AM maryann77 wrote: hrt- sorry to hear about your hair. But just remember that you are a beautiful person inside and out regardless! What we have been through (surgeries, and treatments) in these last few months, some won't in a life time. So hands down to all of us!!!! But just wondering, has anyone looked into or tried hair transplants.",
      "MessageIndex": 21,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "maryann77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99153/profile",
      "Content": "Dec 13, 2010 01:26PM maryann77 wrote: I had taxotere as part of my chemo regime in Aug. My hair didn't seem to want to start growing until a few months later. And now it's growing in really thick and super soft- to the point where it doesn't even feel like hair. But I was getting worried there because I also read about permanent baldness. But give it a chance. Because even taking hormonal therapy(e.g. tamoxifen) can slow hair growth.",
      "MessageIndex": 16,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "maryann77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99153/profile",
      "Content": "Jul 8, 2011 02:58PM maryann77 wrote: Great to hear everyone's reply on the subject. I would love to think that we have come along ways in early detection, prevention and treatments. I guess you don't hear on a regular basis of all the long term \"survivors\" of cancer, you only hear of the ones dying from it. (at least I do anyways). It makes me scared and angry. Why can't someone figure this thing out?",
      "MessageIndex": 102,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    }
  ]
}