{
  "AuthorID": "marys1000",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245097/profile",
  "Posts": [{
    "AuthorID": "marys1000",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245097/profile",
    "Content": "Jan 20, 2017 11:02AM marys1000 wrote: Someone up thread wonered about people posting with ADH and not coming back, so I thought I'd post my final (hopefully) resuls. To recap I had a 3D mammo in Dec followed by a stereotactic core biopsy which found ADH in left breast and recommended excision. Excision Jan 13, follow up to surgery was Jan 19 with a surgeon, the only Dr I've talked to. I haven't seen the pathology report yet but he said I'm in the clear. The cells they found put me at a slightly higher risk of bc in the future so make sure I get regular mamo's and that is it. Just to add, two years ago almost to the day (Jan 16 2015) I had a 7 lb breast reduction. It was not a good job and in addition to poor shape, huge dog ears and SYMASTIA (totally disconnected my breasts from the chest wall leaving a uniboob situation) I was left with nerve damage sensation in left breast. Basically my right breast felt more or less like a solid normal lump and my left breast felt like loose chungs of meat that when jiggled would feel like someone was hitting a funny bone. Ironically at 58 and suffering from massive breasts my whole life I tried to find a Dr. who would just taken them off. Not a true masectomy but just totally flat. I knew and had no desire to ever undergo another surgery of any kind and I didn't want to deal with them growing back (happens) or generally have to deal with breasts in old age as I've seen it, when you are old its hard to get into a bra etc. All refused. Before going into surgery for the excision I asked the surgeon had I thought of it (don't know why I didn't) could I have just gotten a simple masectomy vs. the excision. He said probably not but if I ever end up the biopsopy to excision/lumpectomy train platflorm again might be a good idea. I mean how old do you want to be to undergo such a major surgery? The breast reduction was really bad, masectomy will be worse. I have to wonder if the trauma from the breast reduction caused my cells to start to go to pre cancerous places. I don't know. My right breast does get cramps and sore feelings, more lately but I guess that is also reduction.symastia related. They are growing:( Hopefully this won't happen again. Very grateful for the final diagnosis, did a lot of reading and see a lot of women, young women (I'm 60) really fighting this terrible disease and I'm praying for each and every one.",
    "MessageIndex": 755,
    "PostDate": "20/01/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
    "Title": "ADH Club Chickenpants SarBar22"
  }]
}