{
  "AuthorID": "marygrace2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44095/profile",
  "Posts": [
    {
      "AuthorID": "marygrace2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44095/profile",
      "Content": "Jan 31, 2007 11:34AM marygrace2 wrote: hi i am just responding to your health insurance. just wanted to make sure you were aware of the komen foundation. I also have a lump which i can and everyone else can feel my mammo and us results do not show it. i go to see a surgeon next tuesday. Good luck and call around waiting til march seems a little ridiculous. mary-grace",
      "MessageIndex": 7,
      "PostDate": "31/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/519437",
      "Title": "Mammo and US different results carandkensmom nurseekp"
    },
    {
      "AuthorID": "marygrace2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44095/profile",
      "Content": "Jan 24, 2007 08:29PM marygrace2 wrote: i forgot to tell everyone how much you have helped me and it is greatly appreciated. I really have no one to discuss this with. Someone asked about my doctor it is just my family physcian. at least i do not feel alone in this troublesome experience. you woman are so strong and i envey all of you. i look forward to keeping in contact with you all.... This has changed my whole outlook. I feel like I havent been living and i really need to start enjoying myself. GOD BLESS YOU ALL AND MAY ALL OF YOU HAVE GOOD HEALTH AND LONG LIVES FILLED WITH HAPPINESS....",
      "MessageIndex": 13,
      "PostDate": "24/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/511550",
      "Title": "dense breasts robbieryan-2007Jan22 marygrace2"
    },
    {
      "AuthorID": "marygrace2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44095/profile",
      "Content": "marygrace2 wrote: hi all, I have a lump in my left breast which i am going to have removed the 27th of february. For the past 3 days my underarm on the same side of my lump is killing me ...very tender i dont feel any lumps but very sore even when i move my arm. I cant even sleep on my left side from the pain. could this have something to do with my lump? I have been very worried the last couple of days. I was on a drug called imuran(it supresses the imune system) for about 2 years and the research i have been doing it is a carcinagen. Mostly causes lymphoma. So now i am freaking out about that. My gland over my collar bone seems larger on the left side. when i pointed this out to the surgeon he said it appeared to be in normal limits whatever that means. When they remove this lump can they tell right away by looking at it if it is cancer? I explained to my surgeon that i was on imuran but he said that was a couple of years ago. what it says about this drug is it takes your whole imune system away and if there are any funky cells they have an oppt. to grow. they may not get large enough to be noticed until years after you are off the drug... I guess just freaking out a little, I think i could deal with BC but i dont think i could take finding out i have lymphoma... Any thoughts!!! mary-grace Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/535925",
      "Title": "Pain in underarm marygrace2 Shirlann"
    },
    {
      "AuthorID": "marygrace2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44095/profile",
      "Content": "Feb 18, 2007 12:59PM marygrace2 wrote: thanks me too. like i said i am just freaking out. i will have to wait until the 27th..thanks for your support and prayers",
      "MessageIndex": 2,
      "PostDate": "18/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/535925",
      "Title": "Pain in underarm marygrace2 Shirlann"
    }
  ]
}