{
  "AuthorID": "marymorris",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238762/profile",
  "Posts": [
    {
      "AuthorID": "marymorris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238762/profile",
      "Content": "marymorris wrote: Hello All, On June 6th, I had a unilateral mastectomy with an expander and a reduction/lift and small implant on my remaining breast. Things have been going very well until yesterday. I seem to have developed a \"hot spot\" on the skin of the remaining breast near my nipple. It is about the size of quarter. The skin is blotchy looking, raw, and leaking a yellow fluid and very little spotty blood. I spoke with the surgeons office, sent photos and they replied promptly. They suggested Bacitracin ointment and fresh dressing. If my whole breast turned pink/red and/or I developed a fever I was to come in asap. I have a post op appointment on Thursday, June 11th. I have been keeping the area clean, applying generous amounts of ointment and now have noticed two smaller spots developing on the same breast somewhat in the same area. I wonder if my skin is sensitive to steri-strips, though the incisions look OK. The upper part of my breast looks normal and healthy. I do have a lot of bruising in the lower portion of my breast. Has anyone else experienced \"hot spots\" forming (I don't know what else to call them)? If so, how did you manage them? Does anyone have any advice or suggestions to get me through the next day and a half till I get to the doc's office? Thank you, Mary DX: April 17, 2018, Left Breast, IDC, Stage1, Grade 2, ER+/PR+/HER2- June 6, 2018, Unilateral Mastectomy w/ expander, Plus, Lift/Reduction and small implant on right breast. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865172",
      "Title": "Infection - \"Hot Spots\" on skin - Suggestions please marymorris Dm39"
    },
    {
      "AuthorID": "marymorris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238762/profile",
      "Content": "Jun 13, 2018 07:31AM marymorris wrote: Thank you Mucki1991. How did you surgeon treat your infection?  Mary",
      "MessageIndex": 3,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865172",
      "Title": "Infection - \"Hot Spots\" on skin - Suggestions please marymorris Dm39"
    },
    {
      "AuthorID": "marymorris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238762/profile",
      "Content": "Jun 13, 2018 07:34AM marymorris wrote: NotVeryBrave, I am thinking that his office is a little laid back. However, now that my already scheduled appointment is tomorrow, I doubt they'd want to more it up. Plus, i don't have a ride. I'll look at it soon. I'm about to hop int the shower. If it's worse, I will call them. Thank you for your feed back! Mary",
      "MessageIndex": 4,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865172",
      "Title": "Infection - \"Hot Spots\" on skin - Suggestions please marymorris Dm39"
    }
  ]
}