{
  "AuthorID": "mary5454",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
  "Posts": [
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 2, 2009 06:15AM mary5454 wrote: Hi- I start today. 20 total - I believe including the boost. I am going with the canda/Eurpoe plan - moreradiation each time - less total rads. Got my special deoderant thaey gave me.... need to get somemore wireless bras...",
      "MessageIndex": 13,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 7, 2009 07:24AM mary5454 wrote:",
      "MessageIndex": 76,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 15, 2009 06:39PM - edited Feb 15, 2009 06:40PM by mary5454 Denise - I was never asked about a clinical trial with rads- what does it consist of? I am already doing the shortened \"Canadian\" version. Talk to Me/Jobu- I had last chemo in January. Noticed the other day - have a \"gap\" in my eyelashes...must have just started to fall out. I am hoping my hair starts growing soon!  No radiation tomorrow - closed due to holiday. On Friday - I brought candy (don't bake like Lories and Mandy!). One of my \"rad guys\" told me that he was only there for a short reassignment and that was his last day....I got teary... am I getting overly sentimental ? - I have been so emotional through this and not about the cancer but about everyone who has been so nice to me!). Hope all are having a good weekend. It's only 7:30 and i am ready to go to bed!",
      "MessageIndex": 227,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 21, 2009 09:33AM mary5454 wrote: I know..I had been feeling pretty good but yesterday the fatigue just hiot me... I  just want to crawl up in bed!!  Anyone here started an AI yet? I have been on Femara for 15 days now. Starting to feel some side effects - wondering if anyone else is too...",
      "MessageIndex": 340,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 16, 2009 09:08PM mary5454 wrote: Thanks to all for the \"hope\" re: hair growth. I will try jello (heck I will try anything!). Kari - daffodil day sounds nice - spring is coming! Denise - I tan - but with rads I had discoloration and peeling under my arm, underneath my breast and around the nipple. Still do but the tightness and swelling has lessend so much more comfortable. Promised myself I would have a healthy diet and lose weight - not doing so good..need to get myself going. Not sure what is holding me back - I know that being overweight is a risk factor for recurrence!!  Have a good evening all... ",
      "MessageIndex": 604,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 21, 2009 11:39AM mary5454 wrote: Lories & Mary L. I have been on femara for 7 weeks. At first the muscle pain was awful but I heard if you exercise daily it helps- so I have been working out daily ( 30-50 minutes on elliptical or walking 2-3 miles) and I must say it toke awhile but it does help.  I still feel achy but much less so and it is tolerable - as I have heard good things about femara's effecitvenes..  Hang in there. My onc did say if it didn't get better to let him know - you can switch. I also talked to someone who did well on femara for awhile then had SE so switched - then 6 months later switched back and is doing ok.",
      "MessageIndex": 642,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 21, 2009 11:40AM mary5454 wrote: Mandy - I thought about that little girl in pink all day - definitely  prayers for her.",
      "MessageIndex": 643,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 22, 2009 07:59PM mary5454 wrote: Jane - my rad onc saw me 2 weeks after and now wants to see me in another month. My medical onc will see me in May. My breast surgeon saw me again this month  and wants to see me again in six months... Then there is the dermatologist who I saw because of a reaction to chemo ..and the other surgeon I see tomorrow because I had a little ball of \"fat\" under my skin in the thigh and they had to remove it \"because of my history\" and let's not forget the internist and the gyneo... And to think I used to see a doctor once or twice a year!!",
      "MessageIndex": 657,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 4, 2009 05:25PM mary5454 wrote: squad - I am post-menopausal too. I know they use arimdex or femara - my onc says he usually uses femara- not sure why. always red- I am using aquaphor or \"udderly smooth\". They told me not to use them 6 hours before treatment . Suggested I use it right after rads and before I go to bed. I never heard of a bolius before. # 2 today.  I am a bit claustrophobic and not crazy about the thing over me during rads- but I am really  having no problem - I count and before 200 it's over !! (I start counting after the radiation actually starts). No problems so far - no weird taste- I never heard that might be a side effect. There was with chemo though.",
      "MessageIndex": 42,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 5, 2009 06:33PM mary5454 wrote: Donna- I am using Tom's too- so far no one has complained! My breast is starting to feel swollen also....",
      "MessageIndex": 65,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 16, 2009 07:57PM mary5454 wrote: Caren - you are not alone.. last week I was at the deramtoologst for a f/u fropm my chemo reaction - I decided to show her this lump I have had under my skin on my thigh for months (before BC) . I always forget about it as it doesn't hurt. Anyways she said usually they would watch it or remove it - and because of my \"Recent History' I should have it removed. So now I go to a surgeon Thursday re: this. It''s probably (hopefully) nothing but I am freaked out.  Debi - My onc used femara so that's what I am on. I don't know which has the least side effects - i thought they were about the same...",
      "MessageIndex": 252,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 17, 2009 05:29PM mary5454 wrote: kfinnigan - hope the counting helped. I am claustrophobic- so I close my eyes right away and then when the machine starts dosing the radiation I start counting,. it helps me focus and lets me know it is close to being over.  re: the AIs- I think it is just what the onc is used to using...I checked out side effects (my main interest) and they all have the same. I have been on femara now for 12 days- so far no problem (I know it's early but...). I am told that it helps to exercise daily to avoid bone pain so am working on that. Also concerned about high choleterol since I have borderline now and my bones - have borderline ostepenia. But if it keeps cancer at bay - I am all for it!  I have an oncotype question - finally got my hands on my report! It  gives you the % of distant recurrence - that's mets right? Do I assume that radiation drastically reduces any chance of local recurrence?",
      "MessageIndex": 260,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 17, 2009 08:26PM mary5454 wrote: Debi - I am so sorry that so much is going wrong today. Did you tell them you need another time? They should accomodate. Maybe you could ask to see the oncologist sooner to get the questions answered?? Sometimes we are afraid to ask for what we need...but we need to stand up for ourselves. I will be saying a prayer for you....",
      "MessageIndex": 263,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Apr 4, 2009 02:48PM mary5454 wrote: Denise - thanks for sharing your story. I to am wondering what now? Done with treatment -still look like I have cancer (no hair to speak of)....think about it all the time. Tuesday going to  after BC treatent support group -not sure I'll continue but going once with a woman I did rads with. Been on Femara now for 2 months. Still muscle pain in arms and legs and sporadic bone pain but seems to be lessening. Although they all have the same side effects - Joy - I do hear they affect every woman differently - hope this works for you. I am finding it tolerable. So women do we now have to do all the breast cancer walks!!!  Have a wonderful weekend. Rainy and cold here in upstate New york.",
      "MessageIndex": 743,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 11, 2009 06:07PM mary5454 wrote: Jane - you'd think a radiation oncoologist would be more thoughtful. Mandy - sad that you have to \"sweeten\" them up! I asked my rad onco today about a article I read somewhere on the internet  about radiation being something like 20% effective in reducing local recurrence but increasing mortality due to heart/lung damage.  She said that was using old data- She said that radiation reduces the result of local recurrence by 70%. She also said that with the new CT scans, etc they can do a better job avoiding the lungs and heart - thereby reducing the risk.She is young and just came back from a conference - so i'm going with her numbers.  Finally got my hands on my actual oncotype results. According to that I am PR- although my initial pathology report stated I was PR+- wonder what difference that makes.  Day #6 for Femara - no problems yet.....",
      "MessageIndex": 147,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 12, 2009 04:09PM mary5454 wrote: Annie - I don't have circles either- just the tattoos- no other markings.  I started femara a week ago a few days into radiation . ",
      "MessageIndex": 168,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 18, 2009 06:38PM mary5454 wrote: Mary - you are on your way!! Mandy - do you have much chemo left? I didn't know they did chemo and rads at the same time. I hope you are feeling okay. Diane- I use aquaphor at night. In the morning I use \"udderly smooth;' as it is less greasy that aquaphor. Today they did my planning for the \"boosts\". I don't start then until a week from tomorrow but my rad onc is off until then so they did it today while she was here. I have a circle and stickers . I guess the stickers stay on...we'll see. As part of the planning they took a picture  of my breast - with a regular digital camera...hmmnnn... a first for me someone taking a picture of my naked breast...maybe I'll end up on \"Cancer Patients Gone Wild\"!!!! Another bc rads pt. told me that the clinic we go to has a support group that got a grant and we can get 3 free treatments of our choice - acupunture, massage, reiki or \"healing touch\"...I am going to call- might as well get any freebies I can.  Hope all doing well today... ",
      "MessageIndex": 283,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 15, 2009 09:36PM mary5454 wrote: I haven't been on for awhile - trying to catch up. Good luck to all! Tuesday it will be 2 weeks since I finished. peeling more since I finished - tired too- otherwise ok.  Mary - I have been on femara for 6 weeks. I had alot of muscle pain. Have been going to the gym or walking every day as I heard that helps. Well...the aching is getting less. (Hot flashes are something else!). I want to give it a 3 month try as I want to keep on taking it. It does seem better. Question - it has been 2 months since i have had chemo and my hair doesn't seem to be growing - there is some light fuzz- but still seem mostly scalp- how are other people doing? Also - just the last month I have been losing some of my eyebrows and eyelashes.Anyone else?",
      "MessageIndex": 594,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 17, 2009 05:18PM mary5454 wrote: Denise love it! I had the most wonderful facial today (she even gave a head, neck and foot massage) - present from my sisters -s o wonderful. When the woman doing the facial saw my head (after taking off my scarf)  she said - oh you must love it- you must feel so free! WoW - couldn't admit I was moaning about my lack of hair,..  Attitude is everything!!",
      "MessageIndex": 610,
      "PostDate": "17/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Apr 5, 2009 03:05PM mary5454 wrote: Annie - I was joking about the breast cancer have to!!! Your hair looks fabulous!! can't wait until mine looks like that.",
      "MessageIndex": 747,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Apr 13, 2009 12:03PM mary5454 wrote: My onc said he would see me every 3 months - next time is 5/26...rad onc is another story see her again Wednesday - hopefully that is the last time as my skin looks completely healed. On femara for 2 1/2 months now. Achiness seems to be lessening although still there. The hot flashes are strong but i read that women with hot flashes on AI do better as it shows the estrogen is depeleted!  So I think of that and enjoy the heat. In re: to mamogramm - rad oc said not until at least August as would not be relaible due to swelling. Does health insurance cover mammos less that a year apart if you have a history of  breast cancer?  Denise- my onc said he couldn't tell me I was cured (why not!!) and that I just have to be mindful of symptoms of recurrence.  Does anyone know what markers they can test for? My onc didn't tell me but thought I read about women being tested.",
      "MessageIndex": 788,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 2, 2009 08:26PM mary5454 wrote: Hi. well thought I was starting today but they wanted to do the positioning and xrays again as it was awhile since they did them. (before chemo)...So I start tomorrow. They told me it will only be 5 minutes which is good because it is an awkward position!  But I think this will be just fine.  Lories - I am in Syracuse New York. My radiation oncologist presented me with both options- the standard length radiation and the Canadian/European version. She said the shortened version with increased radiation was just as effective and had no increased side effects - so for me it was a no-brainer- shorter is better! So I will be done 3/3!!",
      "MessageIndex": 21,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 3, 2009 05:34PM mary5454 wrote: Sue- Ann- I am doing the shortened version - but lying face up right hand over my head, face turned to ther left- it''s my right breast they are radiating. Today was so quick!! I was amazed. I was a bit fearful as I am claustrophobic and hated that thing over my head when they were measuring me etc...but no problem... Squad - I like your attitude!! Any reason Armidex? My onc used femara - think they are about the same thing.  Lories_ My oncotype was middle of the road too - 18. I opted for chemo but after two sessions and loss of hair - I developed a reaction so my onc recommned I stop and go on to rads and AIs. Here we go - every day!!! ",
      "MessageIndex": 30,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 5, 2009 06:29PM mary5454 wrote: Interesting how different places can be! I never heard of a bolius and never had pictures taken of my breast. The radiation \"Boys' are very kind and respectful (although I think I have no dignity left!) and the place is very private. momtobkandsd- that isn't right! your privacy was violated - I would definitely follow up with my oncologist or nurse practictioner. Sorry it was like that for you. This is hard enough. Also I not taking tamoxifen as I am post menopausal - I am taking femara - but I picked up the prescription today and am starting tomorrow. I can start during rads. Maybe tamoxifen is different. Lories - hope all is ok - sorry your talk with you onc left you down. Hang in there! 3 down - 17 to go! ",
      "MessageIndex": 64,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 24, 2009 06:40PM mary5454 wrote: Happy Birthday Unique you young thing! Enjoy your day.",
      "MessageIndex": 402,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 27, 2009 04:51PM mary5454 wrote: I am doing my \"boosts\" now - 2 away from being completely done. For my boosts they used a \"bolus' to protect lumprectomy scar... Now that I am almost done with my 5 month journey through all of this and all the treatments  I thought I'd feel happy...but I have mixed feelings...there is something reassuring about going to the center and feeling like I am doing something active to take care of this. .And I feel so normal at the center - unlike how I feel sometimes everywhere else (even when I do wear my wig). Anyone else experiencing feelings like this?. It''s like Tesday I end so get back to \"normal\" not sure I feel so normal... ",
      "MessageIndex": 448,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 1, 2009 03:50PM mary5454 wrote: Mary - just this weekend I saw skin breakage have open area under my arm and under my breast-- this is after 18 treatments...Have discolation under my arm too but gues that is normal...",
      "MessageIndex": 469,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 8, 2009 10:22AM mary5454 wrote: I finished on Tuesday - 16 rads plus 4 boosts....Now feeling tired, skin peeling, soreness (especially under arm)...worst for me right now is muscle and bone pain from femara- have been on it for 4 weeks am pushing myself to exercise every day (Mary L my encouragement is no more breast cancer!!!) even though it hurts. Hopefully this will relent as I get used to it but if not will try Armidex...even thought tey all have the same side effcts i hear different womnen react differently to the drugs...",
      "MessageIndex": 532,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 22, 2009 07:54PM mary5454 wrote: Seabee-my radiation oncologist said I shouldn't get a mamogram until August as the  swelling/inflammation won't give an accurate picture. I was hoping sooner - just think I will feel better if i get a \"clean\" one.  I know what you mean about it not being over - everyone congratulates e for \"finishing up\" but I do not feel finished at all...",
      "MessageIndex": 656,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 6, 2009 07:29PM mary5454 wrote: Lories- I went to the femara discussion board but decided not to look at it right now. Everyone sounds like they are having side effects- but I am thinking athat all the people who don't have side effects have no reason to post! So I am going to be optimistic. I started it today.  I'm glad if the counting helps ome. It helps me. although Always Red I haven't counted that high. I start after they do all the postioning - leave the room and I hear the machine start to do it's work. it was about 120 today! They say that Monday they are going to do x-rays again (or \"films\") - I guess they do it about every 5th time???  Have a good weekend all.",
      "MessageIndex": 71,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 8, 2009 01:34PM mary5454 wrote: Joy - welcome. Sorry you have had such a hard time. Hopefully things will start looking up. I like that - thinking of the moon and the stars...I know what you mean about your dog,. When I was home with SEs from chemo my dog wouldn't leave me!",
      "MessageIndex": 99,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Apr 6, 2009 06:21PM mary5454 wrote: Finished rads 5 weeks ago. looked at my breast this  weekend and it looked normal!! No discoloration under the breast, under my arm or around the nipple. No peeling underarm or under breast...looks just normal (except for the scars of course)... So it does get better...",
      "MessageIndex": 752,
      "PostDate": "06/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 9, 2009 04:08PM mary5454 wrote: Mandy- glad you got through ...it is fast. It's too bad you don't have a supportive environment. I had #5 today. Question re; deoderant. I am using Tom's - know it's not the best- any without aluminim that do work? I am reading a great book - Anti-Cancer\" by a neuro psychiatrist who was diagnosed with brain cancer 15 years ago - one thing he recommends through his research is not to use deoderant with aluminim.  Another good book is \"Waking the Warrior Goddess\" .........trying to look at changing the way I live in light of all this..... My best to you all....",
      "MessageIndex": 120,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 19, 2009 05:40PM mary5454 wrote:",
      "MessageIndex": 312,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 28, 2009 09:21AM mary5454 wrote: Squad - I read the book \"anti- cancer\" which is by a physican who was diagnosed with brain cancer 15 years ago - he had a recurrence 2 years later and then changred his life...some of the info you got from the CBS special is in his book. My onc told me that he couldn't say i was \"cured\" only time will tell. He did say the only real proven way to reduce chance of recurrence is to have a low fat diet and exercise daily. Maybe we should start an after-radiation thread...work together to change our lives (I need to lose weight definitely)... and hang in there together..",
      "MessageIndex": 454,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 28, 2009 07:22PM mary5454 wrote: Hi Donna. I have a lumpectomy too. A masectomy was not discussed with me. Some womehn have masectomies because of the size or position of the tumor. Some want the added protection. My onc said that my lumpectomy plus radiaiton was as protective as a masectomy. Who knows?  A boost is the the rads you get at the end that focus just on the tumor site. Some women get up to 7 boosts. As I am doing the \"canadian\" version - more radiation each time, less treatments - I have ony 4 boosts - just 2 left. My skin is just now breaking under my arm..1st skin breakage. Seems sorer now too...  Sobx- I would be interested inthe book...hope you are not too tired from traveling... Denni - that makes sense. I know I am looking at the end Tuiesday and I feel lost...  Have a good eveniong everyone!! What should we call our \"post rads\" - healthier living\" thread....???",
      "MessageIndex": 458,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Mar 29, 2009 02:58PM mary5454 wrote: Debi - so sorry to hear about the loss of your sister.Sounds like she was a wonderful person and a wonderful support to you. Keep talking to her...she will hear...and you can always talk here.",
      "MessageIndex": 704,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Dec 28, 2008 06:18PM mary5454 wrote: Cinda, I am so sorry. My condolences. I am on day 10 of tx 1  and feeling better. Going back to work tomorrow. Linda - keep gargling - salt water  and sometimes I do just plan water and sometimes Biotene mouthwash. I had a vanilla milkshake today and that tasted good! I will keep you all in my prayers.  ",
      "MessageIndex": 672,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 4, 2009 02:22PM mary5454 wrote: Bold- been there. screaming in the car, crying in the bathtub...we can't be strong all the time. After my brother buzzed me - he wanted to get a mirror to show me. I said I better do this alone first - I will go in the bathroom. My 14 year old daughter ran in before me and said Mom I'll do this with you and hugged me. I just want her life to be normal through all this.",
      "MessageIndex": 821,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 10, 2009 08:58PM mary5454 wrote: Lauren,your note was just what I was looking for. Don't know what to do with myself...thought I'd log on- feel like crap...day 3 #2...I keep reminding myself that this will get better.... Thank you....",
      "MessageIndex": 928,
      "PostDate": "10/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 11, 2009 12:37PM mary5454 wrote: Bold- we will still be here checking in- how could we leave a group who has gotten us through this? (and we will get through this). Taxotere does do a number on my sinuses. I use saline spray - helps a bit. Mary - good luck tomorrow - you are getting closer to the end!",
      "MessageIndex": 938,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 12, 2009 09:17PM mary5454 wrote: Carie -hope your husband made it to you! I live in upstate New York - pretty mild right now (well freezing but not snowing here anyways).  11:00 p.m. day 5 starting to feel human- still constipated (after colace, miralax, bran muffin and now ducolax!) but bone pain subsiding...think this is the start of feeling better. Hopefully will sleep tonight,  I am hormone positive (strong estrogen) and menopuasal so will be taking AI - but not too pleased as I don't like the side effects. Guess I should look up studies too.  What alternate treatments are people doing? I have reiki scheduled for 1/20  - am open to whatever. definitely plan to change my diet - that is when my stoamch and taste buds return to normal! Have a nice evening...sleep well all...",
      "MessageIndex": 963,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 14, 2009 09:29AM mary5454 wrote: In January issue of Prevention magazine on page 120 they have a brief article about reduced radiation treatments- that's what I am (eventually ) doing. My radiation onc told me that in Canada  and Eurpoe they have been doing it for years - no change in effectiveness - so withthe boost it will be  20 treatments instead of 35. (they increase the radiation at each one).",
      "MessageIndex": 993,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 21, 2009 08:10PM - edited Jan 21, 2009 08:10PM by mary5454 Haven't posted in awhile but have been faithfully reading all the posts. So good to hear how everyone is doing. Nice to hear from some new people too. My latest thing is huge itchy welts ...I have the small red ones on my scalp but these are big and raised and itchy on my arms, neck, hands and some on my torso. My onc said he wasn't sure what they were from since they came on 10 days after tx but things I have read here make me think it's the taxotere. So I am on steriods and taking benadryl and still itching like crazy...He did say if they don;'t go away that he would be okay with stopping chemo as my oncotyp was in the low intermediate range and I have a high estrogen receptor (not so progresterone though) and go right to hormones and rads...Part of me feels like I am halfway there and should finish but part of me says  YES PLEASE LETS STOP.... My next chemo is 1/29 and I meet with him and the NP prior to see if I am okay to continue... My best to all who had treatment this week......",
      "MessageIndex": 1092,
      "PostDate": "21/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 28, 2009 08:19PM mary5454 wrote: Mary L- thanks for the reassuring words.  Hopefully will be okay without further chemo.",
      "MessageIndex": 1207,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 8, 2009 01:26PM mary5454 wrote: Mary L- I am doing the dose dense radiation - so doing 20. I just started the femara Friday so only on day 3. If you read the discussion boards- the SEs sound terrible but i am trying not to focus on that- I figure the women without SEs aren't posting!! I am getting together a list of recommended vitamins/supplements to take - have e-mailed the Onc dietician with what i have heard so far.   Good Luck! There is a February rads board.... ",
      "MessageIndex": 1367,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Dec 27, 2008 01:14PM mary5454 wrote: I am new to this board. My first chemo was 12/19- WOW- a bit more than I expected. Lots of muscle pain (some bone pain lately due to neuplasta); Digestive issues, no appetite, Hoping things will get easier. Expect my next tx to be 1/9. Want to exercise- everything says that will help but hard to get moving. Going to try to walk my dog around the block now. Hope to go back to work Monday - are people finding they are able to fo that? Can work part-time if I want.",
      "MessageIndex": 649,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 2, 2009 07:42PM mary5454 wrote: Lisa, what is your detox soak??",
      "MessageIndex": 776,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 3, 2009 11:14AM mary5454 wrote: Well today is the day. In the shower this morning the hair came out everyone time I touched my head...strands of hair everywhere. I was hoping I would be the magical exception - here I am day 15 and still have hair! but that was not to be. I wil have my brother use his clippers tonight. Not sure how I will feel. I think I was dreading this the most. Mombos - sorry about the neulasta pin. I had some too but only lasted about 3 days...took Lortab so I could sleep. Hopefully you won't have the same reaction next time. You and I are on the same schedule. I had my first 12/19- only difference is my 2nd is 1/8 - the onc nurse asked if I wanted it on a Thursday instead I said yes !- it means I will end one day sooner.. I hope all have a good SE free (or at least manageable) day today  I am reading \"The Middle Place\" -recommended on this site. if anyone wants - i wil mail it to them when i am done. Take care.  ",
      "MessageIndex": 786,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 5, 2009 05:36AM mary5454 wrote: Alyssa - thinking of you today.",
      "MessageIndex": 824,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Dec 30, 2008 07:16AM mary5454 wrote: Has everyone one TC lost their hair on the 14th day? I am coming up on it and want to be prepared. When you buy a scarf (I have to learn how tot ie one!) what size do you get?  Thanks for any help you can give me.  Bold- it gets better after the 1st 3-4 days. I never thought I could do this but I  can and you can and we will be done before spring!",
      "MessageIndex": 700,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Dec 31, 2008 05:25PM mary5454 wrote: simvog - thanks for keeping the list. Minor correction 12/19 was #`1 for me - #2 is 1/8... Thanks to all for being here. It feels like I am in another world sometimes as I try to go about my usual activties, trying to act normal but not feeling normal. Nice to know I am not the only one.  Here's to 2009! the year of recovery...",
      "MessageIndex": 729,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 5, 2009 05:42PM mary5454 wrote: Now that I am losing my hair on my head...I was wondering on TC do you lose your eyebrows and eyelashes??",
      "MessageIndex": 838,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 9, 2009 10:29PM mary5454 wrote: Had #2 yesterday - that day was fine..today not great but not horrible. Didn't go to work,,we'll see how things go. hair falling out in patches - glad I buzzed it. Got some new scarves and are much more comfortable for me than the wig. Simvog - my # 3 will 1/29..  Saw a dietican through the oncology office on Wednesday. She was very helpful. BOLD- I am 30 pounds overweight and she told me they recommend that you don't lose weight during chemo?? She did give me some good advice about what to eat and about using organic dairy and hormone free beef and chicken since my tumor is hormone positive. Well off to lay down (again). Hope we all feel better soon. Sounds like everyone is getting a bit dragged down. We will get through this, we will.",
      "MessageIndex": 915,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 13, 2009 10:01PM mary5454 wrote: simvog- this treatment definitely has an emotional impact. My onc NP warned me about it and the emotions that come rising up when you least expect it. I was wondering why the first week was so hard - it's not the actual pain or discomfort but I believe something deeper. Luckily we get through it and know that we will feel better.  On a happier note- splurged and treated myself to a bath pillow for my half- bald head! Love it! baths are what soothe me and get me feeling better. Night all!  ",
      "MessageIndex": 983,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 22, 2009 06:21PM mary5454 wrote: Hi all! It really is upsetting to hear about problems with insurance and MDs - we should not have to be worrying about money when we are going through this! Firni- I agree with the others - no matter what they say - the review doesn't matter - it's federal law they have  to pay for reconstruction. Texas 357 - would your local American Cancer Socierty be able to help you find a MD to do the rads? Lisa- great news about your sister. So nice to hear hopeful things. Bold- I hope so - I have only done 2 of 4 treatments- hopefully that will be enough if needed. My Oncotype score was 18. we will see next week if I can continue. The rash keeps spreading and itches like crazy. I am on steriods (day 3) benandry. benadryl cream and taking ativan to help me sleep at night. Before BC I never took drugs- now it seems like I am taking something everytime I turn around. Caroline - how long did it take for your rash to clear? It's on my arms, stomach, head, neck and under my breasts... Once I get though this part - I am going to be changing my diet and lifestyle,. it is helpful to read what others have found out. The dietician at my onc - gave me a article that says no flax for BC folks. I have gained weight too- after losing 20 punds before I was diagnosed. (And people thought I would lose weight during chemo!). Wishing you all a nice evening with minimal SEs...",
      "MessageIndex": 1109,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 3, 2009 06:47PM mary5454 wrote: Caroline - I wil be thinking of you - sure it is nothing. You will feel better when you get the results. Congrats to all finishing up. Lainey - sorry about your cold..you must feel miserable. are you still trying to work?  Mary L - onc did stop my chemo. My rash was actually hives all over  for a couple of weeks- finally under control with an antihistamine. Anyways - started rads today - piece of cake - in and out in minutes. Doing the does dense so done 3/3. getting my AI prescription tomorrow. Trying to change my diet. it's hard but have to do it. They really don't want you to lose weight during rads either - wil have to redo CT scan and measurements if you do. looking into a share organic farm for weekly deliveries. having some trouble finding organic chicken,. And whatever was the decision on Flax???",
      "MessageIndex": 1297,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 27, 2009 10:37PM mary5454 wrote: Well my rash has continued. Moved from my neck and hands down my body. Went to dermatologist today - she biopsed it to see what is causing it. But got a message at the end of the day from ONC NP that my Onc is stopping my chemo....I know he feels I will do as well on rads and hormones (AI) - My husband is so happy but I am feeling mixed. wondering will it be enough...feeling like stopping now is quitting...(but not wanting any more chemo drugs!)  and hating people feeling like now it's all over... it's not! I am bald and scared and have many years of treatment left. I don't know. maybe I should just go to bed... Hope all have a good night,....",
      "MessageIndex": 1184,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 7, 2009 08:53PM mary5454 wrote: Hi all! As some may remember I stopped chemo after 2 due to reaction. Anyway - I started radiation and Femara. (AI) ...Just want to let you know that radiation has been fine so far - I have done 4. They are very quick and so far only had some slight tightness in my breast.  All you brave December Divas who have gone through so much can do this - no problem!  My best to you all.. Hugs",
      "MessageIndex": 1361,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 4, 2009 02:06PM mary5454 wrote: Thanks Lisa - yes I am interested inthe detox soak - where do I order it from? My brother buzzed my hair -s till have hair - about 1/4 inch all over my head. trying to decide wheter to do a wig tomorrow for work or come as I am!",
      "MessageIndex": 820,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 16, 2009 01:29PM mary5454 wrote: Thanks Lainey - I do have Ativan but haven't used it - maybe that will help!",
      "MessageIndex": 1027,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 17, 2009 12:07PM mary5454 wrote: Good morning! Lainey - thank you. I slept last night! I had the humidifier going to deal with this awful congestion. Took an Aleve for the muscle pain and an Ativan. And it was wonderful to sleep. I so appreciate the suggestions I get here. I have been reluctant to \"take\" things to deal with some of the problems but am making an action plan for #3 - to deal with the bone pain, constipation, sleeplessness, congestion etc... Appreciate any ideas that helped others. Thinking maybe I should start a mild laxative a day before and keep taking (Colace didn't do it for me) - have been wimpy in that area as afraid of rebound diarrhea. Alyssa - hang in there. talk to your onc- maybe they can decrease the steriods. My onc NP said they would if they bothered me. I think the one thing I am learning is speak up...don't suffer in silence.  Thinking of you.",
      "MessageIndex": 1037,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 24, 2009 03:01PM mary5454 wrote: Hi - still have my rash - day 6 of it. it's on my stomach, my inner thighs, my arms. eyelids etc etc and is it itchy. I have been taking benadryl, steriods and now they added allegra. Also taking ativan to try and handle the itchiness. My neck and head are a bit better so guess that's good. My left hand is swollen - my sister (an RN) says it looks like all part of the rash/hives/welts...scheduled to see afdermatologist Tuesday- am hoping it will be gone by then - feel like a mess. And #3 is scheduled for Thursday not sure if that is going to happen... Simvog - my oncotype states I have an 11% chance orf recurrenrce - similar to you - but less treatment??? this is all so confusing.. have a good day all...I'll be laying around scratching!",
      "MessageIndex": 1135,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Dec 27, 2008 06:37PM mary5454 wrote: I bought some Biotene mouthwash as I had read about it on this site. But then I read somewhere not to use mouthwash as it kills the helpful bacteria??? Gets confusing. Have had a funny taste in my mouth and 2 bumps back of my tongue...not too bad though...",
      "MessageIndex": 656,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Dec 30, 2008 06:37PM - edited Dec 31, 2008 10:08PM by mary5454 simvog- I have #2 1/8/09 - 4 TC Mary5454",
      "MessageIndex": 714,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 6, 2009 04:26PM mary5454 wrote: Bonnie - good luck tomorrow! Lori- thanks for the words of encouragement. Bren- I am also expecting to start rads about 3-4 weeks after I finish. My radiation oncologist has offered me 20 sessions instead of 35...says that in Europe and Canada they do higher doses for shorter periods with same results and no additional side effects so I am going for it. I am feeling really good right now - but Thursday is #2... My wig is uncomfortable too- but I still have some spiky hair which is relaly itchy and I think contributes to the discomfort. Waiting to receive scarfs I  ordered - think that will feel better. Many people at work already know so who cares? right? One of my co-workers told me I shouldn't worry about anyone but myself (she also gave me a list of jokes to help me heal!). My best to you all. I  look forward everyday to getting on this site.",
      "MessageIndex": 855,
      "PostDate": "06/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 16, 2009 11:12AM mary5454 wrote: Best of luck to all receiving tx today! I am day 9 tx #2 just bouncing back. Have the itchy red stuff on my scalp - suppose I should see if I need to take anything. The thing that bothers me the most is not sleeping through the night. I think I wake up because I am sooooo congested then cannot get back to sleep. Will try a humifidfier tonight. Feeling guilty because I haven't worked since my tx. I also have co-workers who worked through treatment- have to remember can't compare myself to others. In terms of people not helping out. I remember myself in their place- not knowing what to do. I find people around me try to downplay this to make themselves feel better. My best to you all. Busqueen - hope your dad is okay....hope you have some time to spend with your DH ...with your marriage being tested so early - you two will definitely go the distance!!!",
      "MessageIndex": 1024,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Jan 18, 2009 04:28PM mary5454 wrote: Firni- welcome back. When it gets bad like that we have to remember that it doesn't last...it does  get bettter.  Mary L- I am so glad things haven't been too bad after #3- you give me hope!",
      "MessageIndex": 1046,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "mary5454",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76725/profile",
      "Content": "Feb 1, 2009 03:57PM mary5454 wrote: I was just saying to someone I have never had so many doctors and doctors visits!!! I am thankful for my health insuarance. I am getting my money's worth lately. Have you caught the price of the neuplasta???  I was at the grcoery store today (in my wig) and saw a woman who also appeared to be wearing a wig and I noticed she had no eyebrows. I know that despite what everyone says - a wig- wearer would know that my wig is not my hair. I wanted to say something to her but did not want to be rude  so but we just caught each other's eyes and smiled a few times.   Colleen - sorry  about your horrible day!! I think after all that if I came home after all that and was locked out I would have just sat down and cried!  Take care. I am skipping the superbowl but watching the half-time show!",
      "MessageIndex": 1260,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    }
  ]
}