{
  "AuthorID": "maryocd7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99015/profile",
  "Posts": [
    {
      "AuthorID": "maryocd7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99015/profile",
      "Content": "Mar 17, 2010 05:15PM maryocd7 wrote: Thank you for your response. Yes it was very useful to find this forum. I never heard of lymphedema until recently and in the past few weeks have only met a few people with this illness so this site is a great resource.  It was never suggested to me that I learn bandaging myself but I'll certainly ask about that in my next session. I'm a little nervous though as If I get it wrong I think I could make things worse but then again most times the professional has applied bandaging I have experienced so degree of pain afterwards.   One other thing I'm wondering is does a garment help the swelling come down or is this only achieved by MLD or some such treatment. ",
      "MessageIndex": 2,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/749920",
      "Title": "Swelling back up after ~6 hours with no bandaging maryocd7 Binney4"
    },
    {
      "AuthorID": "maryocd7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99015/profile",
      "Content": "maryocd7 wrote: I'm new to Lymphedema, was diagnosed about 2 months ago which was over 5 years after my surgery. I have been undergoing MLD treatment for the past 3 weeks (massage plus bandaging). The swelling reduced from close to 20% to 6% over this period. Due to excess pain last night I removed the bandaging and finally got some sleep but about 6 hours later I awoke to see that my arm looking like its back to the 20% level . Has anyone had an experience like this ? If so what did you end up doing? I was dreading the thought of wearing compression garments and now my dread is just not getting it under control.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/749920",
      "Title": "Swelling back up after ~6 hours with no bandaging maryocd7 Binney4"
    }
  ]
}