{
  "AuthorID": "Mary49",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75916/profile",
  "Posts": [
    {
      "AuthorID": "Mary49",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75916/profile",
      "Content": "Mary49 wrote: I had a routine mammogram on 12/2 and was called on 12/4 and told that I had a 2cm mass in the center of my left breast.  I am scheduled for an ultrasound and diagnostic mammogram tomorrow morning.  I was thinking I would know something when I left the office tomorrow, but from this forum it appears that the waiting is longer.  These few days have been scarey and I don't know what to expect as far as wait.  Can they tell me \"yes or no\" tomorrow?  I have been reluctant to talk to anyone since I don't want them to worry unneccessarily.  My husband is thinking positively and feels that we should not worry until something is known.  This website has been wonderful.  Thanks for any insight in what lies ahead. Mary Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/725579",
      "Title": "Scared and don't know what is next Mary49 Mary49"
    },
    {
      "AuthorID": "Mary49",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75916/profile",
      "Content": "Dec 8, 2008 06:19PM Mary49 wrote: I want to thank you all for taking the time to reply to all the people that have questions, concerns and worries.  You really helped me alot.  I went for a diagnostic mammogram and an ultrasound today.  What they found were several benign cysts.  I am so relieved.  I did not know how anxious I was until after my appointment.  I can not thank you enough for being there and making my wait easier.  I do not take this result for granted. I keep thinking how blessed I am.  God bless you all.",
      "MessageIndex": 4,
      "PostDate": "08/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/725579",
      "Title": "Scared and don't know what is next Mary49 Mary49"
    },
    {
      "AuthorID": "Mary49",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75916/profile",
      "Content": "Dec 7, 2008 05:52PM Mary49 wrote: Thanks do much for the response.  I have so many questions.  I have had tenderness in my left nipple on and off for a few years.  No discharge, no visible change.  I can not feel any lump either.  Also, for the last 6 months or so, I have had pain in my left breast.  All kinds of pains, sharp, dull, pinching, soreness, etc.  I thought that this was my heart.  Anyway, does cancer cause pain? Does the fact that it is 2 m mean anything?  How about the center of the breast as opposed to any other place?  I don't expect concrete answers to my situation, but hearing others helps.  Thanx!!",
      "MessageIndex": 2,
      "PostDate": "07/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/725579",
      "Title": "Scared and don't know what is next Mary49 Mary49"
    }
  ]
}