{
  "AuthorID": "marzipan202…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136467/profile",
  "Posts": [
    {
      "AuthorID": "marzipan202…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136467/profile",
      "Content": "Sep 21, 2011 03:39PM marzipan2020 wrote: great to hear! i found this article as well, you mentioned you were on the threshold for tubular correct? the study looks at people wuth different levels i guess of tubular tumors and how they faired.  the ones with almost 100% pure tubular did fine but you notice that there is a higher chance for mets the less \"pure\" the tumor is.  even at 70% patient start to have issues:  http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1345032/pdf/annsurg00216-0022.pdf",
      "MessageIndex": 21,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/774867",
      "Title": "I think Oncotype DX is a SCAM!! peppopat mysticalcity"
    },
    {
      "AuthorID": "marzipan202…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136467/profile",
      "Content": "Sep 21, 2011 07:58AM marzipan2020 wrote: Hi! i lost my old sigin in but read your post and wanted to chime in.  Ever since my diagnosis i have read up on as much about breast cancer as possible.  I attended a recent talk by a breast only pathologist who said that tubular tumors were a \"great\" subtype to have because they are, according to the pathologist, very slow growing and never metastasize.   the doctor also said that they are very tricky to diagnosis because the only thing that looks different about tubular versus a ductal tumor is that the tubules have more rounded edges in one but not the other [i dont remember which] and that a a pathologist that doesn't see a lot of breast cancer cases can easily mistake a diagnosis.  i hate to say it but if you are node positive i would think of double checking if this is a truly tubular tumor.  the oncotype maybe wrong but a high score, pr negative and a node positive? something doesnt add up. theres only a handful of places i would really rely on at this point -- essentially the major cancer centers like mayo clinic, md anderson in tx or sloan kettering in NY to make sure your tumor is reviewed by a professional who's seen lots of breast tumors ervryday rather than a handful a couple of times a week some local hospital pathologists",
      "MessageIndex": 19,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/774867",
      "Title": "I think Oncotype DX is a SCAM!! peppopat mysticalcity"
    }
  ]
}