{
  "AuthorID": "marzbarz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263215/profile",
  "Posts": [
    {
      "AuthorID": "marzbarz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263215/profile",
      "Content": "Nov 14, 2017 04:30PM marzbarz wrote: Thank you both for your help! Ive decided it cant really hurt much to get checked. Better safe than sorry!",
      "MessageIndex": 3,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860133",
      "Title": "I'm 18, should I get it checked out? marzbarz Luckynumber47"
    },
    {
      "AuthorID": "marzbarz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263215/profile",
      "Content": "marzbarz wrote: Hey everyone, I'm 18 years old as I mentioned :) I know its profoundly annoying to hear all of these young people freak out about cysts and pimples but hear me out. About a week or two ago i discovered that i have a pretty substantial(probably about 3/4 inches) lump on my right side, about an inch above my nipple. ( i dont regularly feel my boobs so who knows how long it had been there? )I'm not super worried, of course, as the statistics show its ridiculously unlikely for it to be malignant, however my gut is definitely telling me something may be up. I'm really not someone who is concerned about health-related stuff but the lump is pretty hard, and somewhat fixed. My breasts are naturally lumpy and cystic, and ive never been overly paranoid about that at all. I know they can change depending on your cycle, etc etc. Also, i have a benign tumor, have had cysts and swollen lymph nodes, so i kind of know what one feels like and this is hard and more like a tumor to me. My mother is studying medicine, and on telling her she nearly laughed at me, knowing i was probably just overexaggerating, but i encouraged her to feel it and she looked pretty concerned... She has also had cysts but says this feels different. My older sister had a breast-cancer-scare-thing as well and was also pretty dismissive of my concerns, until she felt it, eliciting a, \"holy shit!\" A point of concern to me is that when i was younger (maybe 12 or 13) i had chest pains that went away eventually, but they led me to recieve about 4, maybe more, different x-ray scans within a short period of time. I have heard that exposure to even minor levels of radiation during that time can significantly increase your risk. Who knows if its just pseudoscience though? The point is, half of me thinks any concern have about it is really stupid, but i'm also probably a bit more informed than the average hypochondriac on here, so thats sort of my reasoning for continuing my thoughts about it. So, should i even consider seeing a doctor and risk paying to be told its nothing? Or is it best to get it checked no matter what? Also, how do i go about requesting a test? What should i ask for? Any general advice would be much appreciated. Thanks so much to anyone who can help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860133",
      "Title": "I'm 18, should I get it checked out? marzbarz Luckynumber47"
    }
  ]
}