{
  "AuthorID": "masonsmawma…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223441/profile",
  "Posts": [
    {
      "AuthorID": "masonsmawma…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223441/profile",
      "Content": "Sep 18, 2017 08:59AM masonsmawmaw wrote: Nursingstudent.....at the age of 38 I noticed that my nipple was inverted...that is, it was seeming to pull inward. I had a mammogram that was clear and an US that also showed nothing. Went to a general surgeon and he said it was nothing. I insisted on action so he did a needle biopsy. Biopsy was clear but I felt like he just picked a spot and randomly stuck the needle in. I still wasn't satisfied and I knew that an inverted nipple was a classic sign of BC. I informed the surgeon that I was going to get a second opinion. At that time, he decided to do a regular biopsy under sedation. Of course, the biopsy showed BC and he proceeded to do a lumpectomy. I also had chemo and radiation. 15 years later I am diagnosed with mets to bone! Don't mess around with this....get as many opinions as you need to make sure that all is well! Will be praying for you :)",
      "MessageIndex": 11,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858613",
      "Title": "Need information... Nursingstudent2011 Nursingstudent2011"
    },
    {
      "AuthorID": "masonsmawma…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223441/profile",
      "Content": "May 23, 2018 02:55PM masonsmawmaw wrote: Friends- I was just informed that Bluebird (Diane) passed away yesterday. So sorry to be the bearer of more sad news....",
      "MessageIndex": 8883,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "masonsmawma…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223441/profile",
      "Content": "Feb 22, 2019 01:18PM masonsmawmaw wrote: I lost a total of 27 pounds on this combo, but have now stabilized. I attributed it mostly to the loss of appetite and I did have mouth sores for a while that kept me from eating properly. I'm told that Affinitor also interferes with food absorption, so that could be part of the cause. All in all, I must say I don't really like this combo because too many weird things have occurred since I started at the end of October. My latest \"complication\" was shortness of breath and low oxygen levels. After numerous tests failed to reveal anything definitive, I have come home from the hospital on 2 liters of oxygen. Not a happy camper right now! MM",
      "MessageIndex": 5,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869879",
      "Title": "Loss of appetite and/or weight loss with Afinitor/Aromosin combo dorimak Grannax2"
    },
    {
      "AuthorID": "masonsmawma…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223441/profile",
      "Content": "Mar 4, 2019 11:23AM masonsmawmaw wrote: RIP Zarovka...you will be missed :(",
      "MessageIndex": 10779,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}