{
  "AuthorID": "Mauimama",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123260/profile",
  "Posts": [
    {
      "AuthorID": "Mauimama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123260/profile",
      "Content": "Feb 22, 2011 02:26PM Mauimama wrote: TexasRose... Been reading many posts, first time I jumped in here.  Had my mastectomy (left side only) 2 weeks ago today.  Recovery much easier than I anticipated, thank goodness.  Wanted to mention tip for when you're driving.  Put a soft pillow up against your chest and put your seat belts over the pillow.  That way you have soft protection against your chest and are still protected w/o having to hold the seat belt away from you.  Hope it works for you~",
      "MessageIndex": 228,
      "PostDate": "22/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "Mauimama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123260/profile",
      "Content": "Feb 27, 2011 11:55AM Mauimama wrote: Hi March ladies, I had a mastectomy on the L side on Feb 7th, tissue expander put in, stayed over night in the hospital and discharged home the next morning.  Came home w/2 drains which stayed for about 10 days.  Had to drain them myself, but it was very easy.  No showering til the drains came out per my doc.  Then it was the best shower ever!!  Had a friend come stay w/me for few days, but honestly I was up and doing things every day by myself.  Sore and tender and uncomfortable, but otherwise I've found it to be remarkably manageable.  Took Percocet first couple of days home, after that, it's been Tylenol once in a while and always at night before I go to sleep to just take the edge off.  Not nearly as bad as I anticipated so I've been very grateful.    It'll be easier than you think -- Keep your spirits up~  Good luck & aloha~",
      "MessageIndex": 41,
      "PostDate": "27/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    }
  ]
}