{
  "AuthorID": "MaureneCA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145826/profile",
  "Posts": [{
    "AuthorID": "MaureneCA",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145826/profile",
    "Content": "Feb 27, 2012 03:57AM - edited Feb 27, 2012 01:39PM by MaureneCA My story starts in October 2010 when my friend was diagnosed with breast cancer. Before her surgery (which the doctors said had to be preformed immediately) we did hours and hours of research on chemo and radiation and it's benefits and side effects. After her surgery she refused chemo and radiation because of what we were finding. We kept finding references to nuturition and healing. Well, I was diagnosed with cancer in my right breast and lymph node in Feb 2011. After the biopsy and meeting with the doctor and surgeon I felt like a cow going to slaughter. Everything was so cut and dry and I felt like they couldn't wait to get me on chemo, surgery and then radilation. I just didin't have a good feeling. I asked about nutrition and a raw food diet and it was like the doctor almost laughed at me. I could see the snicker on his face. I walked out of the doctors office and told my husband that I just became a vegan - which I did - and never went back. After one year without a doctor and deciding to heal my body thru nutrition and the right foods (eating 80 - 100% raw now) I have shrunk my cancer by 51% as of Friday (2/24). I finally found a cancer doctor (a month ago) who is a 2 hour train ride away. She believes in taking care of the root problems first and them using traditional treatments as a last resort if they are even needed..She did tons of tests and blood work. She said everything was looking good. Even my cancer markers were down. My heart goes out to all of you who are going thru chemo and radiation. I just knew it wasn't the right path for me. I found this website in my research for the supplement DIM.  I want to add it to my arsenal of supplements. Even if you choose (or have chosen) the conventional cancer treatments, a good DVD to watch is \"Healing Cancer from the Inside Out\" by Mike Anderson. It was recommended to me by my friend who believes in a very healthy raw foods lifestyle. It was my AH HA moment as Oprah says. It will give you an understanding of how the right foods can (and will) help heal you. With all the drugs going thru your body the nutrients from juicing and drinking green drinks and eating a raw food diet will help rebuild your cells. I have since been told that cancer (in the majority of cases) is a slow growing disease. You have cancer from10 to 40 years before it's ever detected. That I had time to decide my course of action. My original cancer doctors sure didin't tell me that. That's when I did research almost 24 hours a day for weeks. What turned me away from the conventional treatments was that the doctors insisted (and I mean insisted ) that I get right in and start my treatments.  I am actually starting on a 30 day juice feast (the final phase to rid my body of cancer) for the entire month of March. I'll b 63 March 2nd and want this month to be the end of my cancer journey. I would like to be totally cancer free by June. I have just started a blog (lavitatotalwellness.com) where I am sharing information I am learning from my cancer doctor and all the health conferences and cancer summits I attend. I am actually in the process of becoming a Holistic Health Practitioner and want to become a Naturopatic Doctor. I believe that's why I got cancer. To help others make informed decisions about their treatments. We all have to make decisions that are right for us but we are never told about the other side of the coin by the majority of cancer doctors. Granted it cost more money to go the route I am taking but I feel for me it was the right way to go. Organic foods and supplements aren't covered my insurance. I spent 1 week at the Optimum Health Institute in San Diego in April 2011. It actually put me on the right path. I had an entire week of detoxing my body. It's a 3 week program but it's $850 / week and one week was all I could afford. There I learned what foods to eat and how to combine them. I will be sharing all of that in my blog also plus sharing recipes. One very important thing you should check is your Xenoestrogen level. On the blog I explain what they are and how you can tell if you have them. The first thing my new doctor told me was that I had way too much xenoestrogen in my body. They play a major role in cancer and I had.no idea. No other doctors told me that. You can either go to my blog or just do a Internet search. If you have breast cancer it's more than likely you have way to much xenoestrogen in your body and it's important to get rid of it.. Everyone has to decide what treatment is best for them. The problem is that most doctors won't discuss how to heal your body (from almost all diseases thru the proper nutritional choices). It doesn't make them any money.You have to be an informed patient and don't take the doctors word at face value. Do research (I know it takes alot of time) and then make the decision that is right for you! Remember that God created our bodies to be self-healing machines. I'll keep all of you in my thoughts and prayers. God bless! Maurene",
    "MessageIndex": 38,
    "PostDate": "27/02/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/108/topics/782687",
    "Title": "Another \"Chemo or No Chemo?\" Dilemma! crking71 bcisnofun"
  }]
}