{
  "AuthorID": "MavJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236558/profile",
  "Posts": [
    {
      "AuthorID": "MavJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236558/profile",
      "Content": "MavJ wrote: I have been awake 2 nights till 4am with anxious thoughts running through my mind, I have a GP appointment booked for next monday but the wait is terrifying me. I have made a list for reasons why or why not this lump may indicate breast cancer. Here are all the reasons it could be cancerous: -It's like hard -It's under the skin and can be seen a little but is discreet (looks like a flattened bean). -It's not painful. -No head so I don't think it is a cyst. Here are reasons it most likely is not cancerous: -I'm 18 so the chances are low, but that doesn't stop me worrying. -It is smooth under the skin and moveable and doesn't feel attached to anything. -It's pretty high up, it sort of misses my right breast so perhaps that means something. -It hasn't changed in size. -I have no other symptoms linked to breast cancer -I don't have a family history. - I don't drink or smoke. Can anyone offer me some comfort? I wish I could see the doctor sooner but there are no appointments available. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/846304",
      "Title": "18 year old. Found hard lump under armpit near right breast MavJ MavJ"
    },
    {
      "AuthorID": "MavJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236558/profile",
      "Content": "Jul 25, 2016 02:52PM MavJ wrote: Thank you for the information, I am just anxiously waiting for monday now...",
      "MessageIndex": 2,
      "PostDate": "25/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/846304",
      "Title": "18 year old. Found hard lump under armpit near right breast MavJ MavJ"
    }
  ]
}