{
  "AuthorID": "maxfaith",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217654/profile",
  "Posts": [
    {
      "AuthorID": "maxfaith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217654/profile",
      "Content": "Jun 27, 2015 01:39AM maxfaith wrote: hello dancemom1999! It's good to hear that you are doing great. My mom I think is on BI RADS 5. Please help me pray for my mom. I am still have high hopes that she will be safe. I love her so much.",
      "MessageIndex": 2,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832951",
      "Title": "highly suspicious for malignancy maxfaith maxfaith"
    },
    {
      "AuthorID": "maxfaith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217654/profile",
      "Content": "Jul 20, 2015 09:13PM maxfaith wrote: Hi everyone,  The results are out. My mother had her excisional biopsy on 29/06 and the biopsy result were just out last 20/07 ( INSERT: it took longer for us to know the result because her doctor went to Europe). Anyway it says: Breast, left, excision biopsy INVASIVE DUCTAL CARCINOMA, NOTTINGHAM TUMOR GRADE 2 DUCTAL CARCINOMA IN SITU POSITIVE IN PERITUMORAL LYMPHOVASCULAR INVASION MARGINS OF EXCISION, NEGATIVE FOR TUMOR INVOLVEMENT The above thing is the result and the doctor said its on its early stage? Can anybody confirm this? And as per their discussion, my mom have to undergo masectomy for the left and right to prevent the cancer cells from spreading in the near future. Lucky she is, the doctor said because it got detected the earliest. (Was it really early even though cancer cell are already present?)  Can anybody give us idea on this? Is masectomy the best possible option? Thanks ",
      "MessageIndex": 5,
      "PostDate": "20/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832951",
      "Title": "highly suspicious for malignancy maxfaith maxfaith"
    },
    {
      "AuthorID": "maxfaith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217654/profile",
      "Content": "maxfaith wrote: Hi Guys! My mother is 49 years old now. She felt a lump on her left breast just above the nipple but it was totally painless and there was never a change in her breast structure. She went to her doctor to check about the thing and she was required to undergo mammography and ultrasound. The finding says that the lump is \"highly suspicious for malignancy\" which scared all of of us. Her uterus was already removed before 2 years ago and has taken Progynova as part of her HTR. I have a thought that the lump was triggered my the medicine that she has taken for about a year. DID you guys have any idea about the accuracy of highly suspicious for malignancy that resulted to be malignant for real or was there any chance that it could be benign. I am sorry, I could not find any help from the internet that is why I am writing here. My mother does not know anything about this inquiry because I dont want her to worry. Thank you all. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832951",
      "Title": "highly suspicious for malignancy maxfaith maxfaith"
    }
  ]
}