{
  "AuthorID": "Maya847",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
  "Posts": [
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Oct 1, 2011 06:27PM Maya847 wrote: Thanks Barbyjean!  Heading there now, knew there had to be something on this site, but still trying to navigate on here.  :)",
      "MessageIndex": 95,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Sep 28, 2011 01:07PM Maya847 wrote: Thanks Surrey, did fine with the port, but sore. Was kind of a bizzare feeling when he did it, but have to admit getting the local to the clavicle area was the worse. Very tolerable. Went and tried on wigs today. Very weird experience there too. Seems like I am in a daze. First chemo treatment in six days...nervous but hoping once I get that one of the way and know what to expect I will be fine.  Normandy, sorry to hear about the SNB report/surgery, but you are doing everything in your power to get rid of it and will do great!",
      "MessageIndex": 46,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Oct 1, 2011 06:07PM Maya847 wrote: Hi all, so glad to hear people who had their first treatment tolerated it well.  Getting a bit nervous to start Tues the 4th.  (TAC)   The unknown sucks and I am sure once I get this one under my belt I will do well.  People keep talking about a \"chemo class\" they went to.  What is it and what did they tell you?  Also can anyone give me a list of things I should pick up before Tues?  I see a few posts have some ideas but if anyone had a complete list I would love to get it.  Going shopping tomorrow!  :)",
      "MessageIndex": 91,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Oct 3, 2011 07:09PM Maya847 wrote: Echo at 11 am tomorrow and then for first treatment..  Have no idea what to expect as far as pre-meds etc.  Michelle, I did not receive any type of pre-chemo class.  I normally take Claritin D.  Why are people taking Claritin on chemo...what exactly does it do....  I am also on prilosec already.   I am doing TAC so will be getting Taxol,  why take previcid on top of the prilosec?  thanks!",
      "MessageIndex": 108,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Oct 19, 2011 01:51PM Maya847 wrote: Went back to the surgeon who put my port in yesterday as my port site was very red and burning.  He is concerned the port leaked...put me on an antibiotic and will recheck Tues next week (I am scheduled for second infusion on Wed).  He said if it was not better they would have to remove the port \"and that would not be good.\"  When I spoke with the nurse today they scheduled me to have a picc line put in next tues just in case the port has to come out.  Has anyone had one of these lines?  What are they....and why would they not have just put one of those in me the first time round?  Also concerned about what damage was or could be caused by the port leaking.....",
      "MessageIndex": 323,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Oct 20, 2011 06:54PM Maya847 wrote: Thanks everyone for your well wishes.  Terry71, yes I would appreciate to see the pictures if you don't mind.  Can I ask why they did a piccline instead of a port for you?  When I originally asked my oncologist why I had to get a port instead of doing it through an IV he response was the chemicals they are using tends to burn through veins....those words are haunting me now as I wonder what in the hell it does when it leaks from a port!  I do not think they know for sure that is what happened, it is just what the surgeon told me he was concerned about and why he put me on the week of antibiotics.  The redness is starting to go down some but it still has a burning sensation in and around the port..which I doubt is good.  Can you get the piccline wet and does it restrict your movement at all?   On a lighter note, I am ditching my wig and just ordered several hats, turbans and  scarfs from tlc.  Spent $300 on the wig and it is uncomfortable and just not me.  I am cute as a button without hair, so decided I would be a hat person and be comfortable.  :)",
      "MessageIndex": 348,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Oct 14, 2011 05:19PM Maya847 wrote: Had my 1st chemo on Oct 4th.  The next day I went in for the Neulasta shot.  Today is the 14th and I think it is the first day I have felt that I was actually functioning.  Most of the bone pain is gone (or at least not constant and incapacitating.)  I got my period on the 6th and between the pain/cramps from that and the shot I felt like someone beat me with a baseball bat.  For what ever reason my period has not yet stopped.  I did not vomit at all and the nausea meds seemed to do their job.  New problem is I keep getting sharp pains in my kidneys.  Called doc and they said if it is still present Mon to call.  I thought I was a pretty strong woman...but not sure I can do five more of these....",
      "MessageIndex": 245,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Sep 27, 2011 07:50PM - edited Sep 27, 2011 07:50PM by Maya847 Hi all, I go in at 6 am tomorrow for my port and have first treatment Oct 4th.  I am not sure about the abbreviations for the chemicals they are using but I am getting:  \"Doxorubicin Hydrochloride & Docetaxel & Cyclophosphamide.\"  Anyone know what the abbreviation would be for all this so I don't have to spell it all out if I repost?  :)  Doc said I will get an infusion every 21 days for 6 cycles.  I will do what ever it takes to KILL AND DESTROY this! ",
      "MessageIndex": 42,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Oct 17, 2011 05:10PM Maya847 wrote: That's interesting Maggiestatus, cause my onco said the heavier period, severe cramps etc are most likely because of the chemo.   I had chemo on the 4th and I am still bleeding on and off today the 17th.  :(  My incision from the port was well healed and no problems and now today it is red and burns.  Has anyone had this issue?  Have to go back to surgeon tomorrow to have him ck it out.  I have second chemo next week....  Hair is starting to fall out today, so will get it shaved it tomorrow.  It's all good, after next week, only four more.  :)",
      "MessageIndex": 283,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "Maya847",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136342/profile",
      "Content": "Oct 1, 2011 08:55PM Maya847 wrote: Thank you so much!!  This was just what I was looking for.  Start TAC Oct 4th...want to be prepared- very helpful!",
      "MessageIndex": 684,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    }
  ]
}