{
  "AuthorID": "Mayanne",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
  "Posts": [
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Feb 15, 2014 10:41AM Mayanne wrote: Hi Genny, I saw your thread last night and wanted so much to write, but we are on a weekend away and I couldn't remember my password!  This morning, thinking more clearly, I found that I could have it sent to me by e-mail. I'm sorry you've had such a roller coaster of emotions this week.  It's such a scary time to \"walk through the door\" which is how I think of finding out about a diagnosis. Once you're on the other side, it's different.  You kind of fluff up your feathers to protect yourself and march forward with a good plan for getting cured.   I think often of my Mom, who found a lump in 1978.  In those days women didn't have a biopsy first (at least she didn't - maybe it was so apparently cancerous). She went into surgery, not knowing if she'd wake up with her breast or not.  She didn't.  She was also told that cancer was found in 4 out of 10 lymph nodes.  I don't think women were as educated about the type of cancer, grade, stage, etc. in those days - but I imagine it was  IDC.  She was told at first that she may have to have chemo plus radiation, but the final decision was to have five weeks of radiation.  (I discovered all of these details when I recently found a journal she had kept,).  I was very perplexed as to why she did not have chemo, but gather from her writing that she was part of a clinical trial (She never mentioned the words, but I surmise from what she said).  I think that the trial may have been to see if women who had invasive cancer could get by with radiation alone.  They were also experimenting with inserting dye into the nodes and looking at the x-rays to see if the radiation had killed the cancer cells.)  She was told that she was only the sixth person at Mass General to have this test.  She DID have to sign her permission, but I don't think she comprehended the full scope of it.  I couldn't find an explanation of what he x-raging of the nodes revealed.  They added another week of radiation to her plan - I'm not sure if it was because of something they saw on x-Ray or if it was always part of the trial.  They never did add chemo to her treatment. Anyway, the whole reason I wanted to post here, other to welcome you, Genny, and to say hello to everyone else, is to say that my mother went on to have no recurrence and lived until age 93.  This is not to say that I think women should avoid chemo.  I think she may have just lucked out.  With invasion in her lymph nodes I still can't imagine why chemo was not given.  Perhaps part of the clinical study - to see if the \"new\" contrast dye and monitoring method would suffice?  She was 60 at the time and probably a good candidate - no young children at home, yet young enough for a couple of decades of monitoring?  Spoomsister, I'd like to check out your blog, too.  And, Genny, have a wonderful vacation!",
      "MessageIndex": 116,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 31, 2014 12:33PM Mayanne wrote: You must be glad it's over, Shirley!  Another step completed - good for you!",
      "MessageIndex": 219,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Feb 15, 2014 04:38PM Mayanne wrote: Hi Genny, How interesting!  I DO wish I could go back in a time machine and tell my mother that despite her diagnosis, that she was going to go on to live to be a very old and lovely lady.  When I read her journals from that time just before her surgery and just after, when she tried to prepare herself for what lay ahead, I want so much to go back and tell her that she is going to be just fine!!!!   ",
      "MessageIndex": 121,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 3, 2014 01:27PM Mayanne wrote: I hope so, Shirley! ",
      "MessageIndex": 229,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Feb 15, 2014 11:11AM Mayanne wrote: Spoomsister,  I have the same hormone status as you.  Thank you so much for sharing your blog.  My story of my mother above was just to tell of my amazement that with what must be thought of now as antiquated radiation machinery and inadequate treatment in the absence of no chemo - that she went on to have a good life for e decades.  So I'm sure that all of us - with state of the art 3D mammography, radiation equipment, Dosimetry, and education, will one day just think of our treatment as huge bump in the road which sidelined us for a while.  ",
      "MessageIndex": 117,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Feb 19, 2014 08:52AM Mayanne wrote: That IS good news, Genny! ",
      "MessageIndex": 139,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 25, 2014 12:01PM Mayanne wrote: Genny,   Thanks for sharing the photos of Baby Nora and your two dogs!   I LOVE the name Nora as it was my grandmother's name.  Congratulations on your GSD becoming a therapy dog!  And the little dog is beyond adorable. I'm happy to hear that today you feel well. Don't dread the radiation too much.  Other than the daily grind of having to be there, it hasn't been bad at all.  I just finished mine today and am not even tired (of course fatigue could still happen).  I got a diploma and my husband and I are going out to eat and I AM going to have a glass of wine! TB90, I've also missed my wine with dinner, but like you now when I have a glass I enjoy it more!",
      "MessageIndex": 210,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 16, 2014 02:17PM Mayanne wrote: Hi Shirley,  I had a full panel of genetic tests (checking 35 know mutations and genes), because my mother had. BC and my sister has it now.  All were negative, but there's the unknown future discovery possibility.  Medicaire covered my test if your sister is at that age, yet.  I had JUST made it in October when it was done. I hope your sister can have it. And good luck tomorrow on your MRI results.",
      "MessageIndex": 244,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Feb 15, 2014 04:49PM Mayanne wrote: Genny, of all the things my mother worried about, in writing in her journals after her mastectomy, she never said she missed her breast!  She had never said it to us in person, but I would have expected that in her private writings (not realizing her daughter would someday be fascinated), she never talked about her missing breast.  And in those days, it was a fairly drastic surgery.  I helped her, of course, when she became elderly, and saw the hollowness.  She had always accepted it, wanting only to live - in all definitions of the word - and she did!",
      "MessageIndex": 122,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 9, 2014 07:18PM Mayanne wrote: That's great news, Genny. You must be relieved.  Are you posting on another site now? Slappy, if you are going alone, you might like to take a tape recorder along.  I really wanted to see the BS alone - somehow I feel braver when by myself - but my adult daughter convinced me I could use another set of ears, so I gave in and she came.  I was amazed later on that I had missed certain points, since I was processing other information.  ",
      "MessageIndex": 179,
      "PostDate": "09/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 2, 2014 05:07PM Mayanne wrote: Hi Slappy, Sorry you have to wait for these results.  I waited for a week and finally couldn't take it any longer - called my PCP's office at 4:45 and was told that the doctor's nurse would call me back.  The nurse called and told me that the doctor wanted to see me at 8:00 the next morning.  Of course, I knew from both her tone of voice and the fact that the doctor wanted to see me that the news would not be B9.  And, yes, I had to pay a co-pay to hear that I had DCIS.  The doctor said she doesn't like to deliver this news over the phone. She also said that the results had just come in and that was why I had to call them, rather than have them call me - evidently the hold up was because they had sent the sample out for the hormone receptor status. I'm sorry to hear of your BIL's passing :-(  I'm very sad for you sister.  They must have had a wonderful life together.   ",
      "MessageIndex": 226,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 18, 2014 11:11AM - edited Apr 18, 2014 11:19AM by Mayanne Hi Shirley, I found the radiation very easy to tolerate.  In the very beginning, I was nervous, anticipating what might occur, but as I got to the halfway point, and I still had almost no redness or fatigue, I knew I could do it.  I had an easy 30 minute country commute and I enjoyed that.  I drove myself almost the whole time, except when we had icy snowy days and my husband drove me in the truck. I got a \"weighed down\" feeling just after treatment started, but it passed.  I got it back several times during treatment, but it was as if my body always adjusted and it went away.  I describe it as if my body weighed about 100 more pounds or as if I was walking through water.  I think I took a nap one time when I felt sleepy.  (Of course I am retired and my treatments were my only job.  I sympathize with anyone having to work, too, or take care of others.  I think I would have been much more fatigued in those cases,) The redness began at about week 4, but didn't hurt as a sunburn would - was more sensitive to fabric touching it.  As soon as the boosts began, I started to heal.  The boosts caused hardly any redness themselves. I peeled very slightly. Of course I couldn't wait to be done and have my freedom back.  I had a calendar and excitedly made big x's after each treatment.  The cancer clinic had an associated program called \"Cancer Wellness\" for two days a week over 10 weeks.  Since I didn't begin until about week 4, I'm still going to that twice a week,  and I think it has helped with all aspects of treatment - emotional and physical. Now I'm about 3 weeks out and fine.  I had a cold and it seemed worse than I would have expected and I was blaming the radiation,  but then I recovered completely very quickly, so I don't think it had anything to do with radiation. Good luck as you proceed with your plan and come back to let us know how you are, OK?",
      "MessageIndex": 246,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 18, 2014 06:28PM Mayanne wrote: Oh, no does this mean that you have to discount everything on that MRI report?  ",
      "MessageIndex": 249,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Nov 14, 2013 03:49PM Mayanne wrote: Thanks for thinking of me, Annie and everyone. Just wanted to tell you that I've moved over to Just Diagnosed. Waiting was definitely the worst. Knowing what it is (DCIS) gives me a course to follow and I'm feeling stronger every hour. Just remember that you'll probably get a benign result. And even if you don't, it's curable! I like to think this way. Forty years ago when women found tumors, they probably wished that there was a time machine they could go into and travel to the VERY beginning stages of the cancer and find and treat it before it had become invasive. Well, that's what we have these days - the ability to go back in time and find the beginning stage. We are all very fortunate that we live in this day and age.",
      "MessageIndex": 26,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813868",
      "Title": "Waiting for results AnxietyAnne rikmorgan"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Nov 11, 2013 12:14PM Mayanne wrote: Hi Anne, I'm another one waiting. Had my mammogram on October 21st and my doctor called on the 22nd, sounding very concerned and told me I'd need a stereotactic biopsy. I didn't know enough about the terminology at that point to ask questions, but googled and learned a lot. I thought of getting a copy of the radiologist's report to see why the doctor was so concerned, but the biopsy was scheduled for November 5th and I was worried I'd be MORE concerned depending on the bi-rad rating. I was able to go to the biopsy alone, even though my husband, my daughter, and a friend all wanted to take me. I felt that I'd be braver going alone - didn't want to converse with people making small talk to make me feel better, I guess. It worked out well for me - I went on autopilot and once there in the hospital, everything went smoothly. I wanted to tell you that the mental picture of the biopsy is worse, much worse than the true experience. Once I saw the table that had become my adversary (I had even told my husband I was going to cancel the whole thing, because it seemed so barbaric.) - I felt consoled. The table was relatively comfortable. The radiology tech was kind and they explained everything to me. Since the breast goes through the opening, once I couldn't see anything, I relaxed. I knew things were happening, but could pretend it wasn't happening to ME. They were very careful to not cause a bit of pain. I was surprised and relieved that all of my 2 weeks dread came to this. I was able to drive myself home, too, although my husband was standing by. If you wait until your husband gets home, that's fine - just try to not stress in the meantime. It will be much easier than you imagine. I wish I'd gotten my results as fast as some here. I'm still waiting and wish I'd thought to ask the doctor HOW I'd hear. I've been sitting by the phone for a week. I didn't even want to give them my cell phone number, in case THE CALL came in when I was in a store or something. My biopsy was a week ago tomorrow. The doctor who did the procedure on Tuesday told me the results would be ready on Friday, but the technician who had kept her hand on my shoulder the whole time, told me softly that I shouldn't expect the results that early, despite the fact that the pathology lab is in the same hospital. And today is Monday, Veteran's Day. I don't even know if the doctor's practice is open. I hesitate to call - but probably will if I haven't heard by Wednesday or so.",
      "MessageIndex": 14,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813868",
      "Title": "Waiting for results AnxietyAnne rikmorgan"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Nov 11, 2013 12:45PM Mayanne wrote: Hi Pokemom! I'm not even sure the practice is open today (Veteran's Day). The office will definitely be open tomorrow and the doctor will most likely be there, so if I haven't gotten a call I WILL call then. It's frightening to call, though, isn't it?",
      "MessageIndex": 17,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813868",
      "Title": "Waiting for results AnxietyAnne rikmorgan"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Nov 11, 2013 12:41PM Mayanne wrote: I notice certain differences with our experiences. The first time I heard that I'd need a biopsy was when my PCP called me the day after my mammogram to tell me that the calcifications were concerning. She sounded very worried, mentioned that I should come to see her and that she'd probably be sending me to a specialist. I didn't process all this until the next day, called back and was told that going back to see her and that seeing a specialist would only be necessary after the biopsy and depending upon results. It seems from what I'm reading that many people are seeing specialists before the biopsies. That would probably have made me even more concerned during the two weeks I waited to have the biopsy, but it also would have been a good opportunity to ask questions. I'm still not even sure HOW or WHEN I'll hear the results of the biopsy. In the biopsy room, the techs asked if I had a follow up appointment scheduled to see my doctor - as if that were protocol. Yet I didn't have one. I'm wondering how much our experiences in the routines vary? I guess I'll call the office in the next couple of days if I still haven't heard in case something slipped through the cracks?",
      "MessageIndex": 16,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813868",
      "Title": "Waiting for results AnxietyAnne rikmorgan"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Nov 12, 2013 05:02PM Mayanne wrote: Hi Debbie, I called the doctor's office and asked for results. The nurse called back and I could tell by her tone of voice that the results were not benign. She said that the doctor wanted to see me tomorrow morning (Wednesday) at 8:30. I said, \"Well that doesn't sound good.\" She said, \"I can't say anything more - Dr. O at 8:30 tomorrow.\" and again sounded kind and serious. So, I have to get through the next 12 hours before I know what it is. I guess you could say I'm frightened but resigned and I have educated myself to know what questions to ask and understand what she might tell me. My husband wants to take me, but I'd rather go by myself to face this without distractions. Annie, I don't want you to be worried because of this. The chances are good that you'll be in the 80% that are benign. I just wanted to post here because I don't know how else to find Debbie.",
      "MessageIndex": 21,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813868",
      "Title": "Waiting for results AnxietyAnne rikmorgan"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Nov 12, 2013 06:50AM Mayanne wrote: Annie, I'm sorry you have to wait so long to have the biopsy. I waited for two weeks from the time the doctor (my PCP) called. Sometimes I was fine and \"sort of\" forgot about it. I felt like Scarlett O'Hara who said something like, \"I'll think about this tomorrow.\" Other times it got the best of me and I had two meltdowns - one time actually crying and carrying on to my husband that he didn't want to talk about it with me and I NEEDED to talk about it. (He said he thought it would just make me dwell on it.) Another time I said that I was going to cancel the whole biopsy - that I thought of it as a medieval torture and wouldn't go through with it. My husband was so worried that I really would cancel and tried to talk me back into it. (Of course, what he didn't know was that I just wanted to say the words out loud that I COULD cancel.) I wouldn't really, because my Mom and sister had both had breast cancer and I knew the risks. I guess it was mean of me, because my husband is wonderful. I was just lashing out, trying to unleash the steam that had built up. I was so relieved to just get it over and that feeling lasted a couple of days. I only had a tiny bit of discomfort. I was very tired the day immediately following the biopsy (I only had local anesthesia), but I think it was more from the adrenaline let down than anything. THEN, as if I'd only allow myself to worry about one thing at a time, I began to dread THE PHONE CALL which would tell me the results. I know I should do what Debbie suggests and just pick up the phone and be pro-active. After all, the phone call is only the line of demarcation between knowing and not knowing. What is already is or isn't. I should at least find out. I would imagine that my doctor would call me if she HAS the results, because she seemed very concerned when she called to tell me I needed a biopsy. So, I keep waiting. Thanks, Debbie, for your response. You sound very brave. I know that the waiting is the hardest, because you can't take any action. It's kind of a vulnerable feeling. In the last couple of weeks since this has been going on, I feel in awe of all the brave women who have faced their demons and are now healing themselves in whatever way is necessary. My sister had breast cancer in 1999 and had a lumpectomy, chemo and radiation. I realize that I was not really there for her in my heart - didn't really know what she was going through. I was taking care of our elderly mother at the time, so in some way I think I figured that was my contribution. She was able to concentrate on her own health. But now I totally realize what she felt. She has five children so got a lot of support, but I wish I had been there more for her. I WILL call today - knowing how you have handled this helps me.",
      "MessageIndex": 20,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813868",
      "Title": "Waiting for results AnxietyAnne rikmorgan"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Jun 23, 2014 07:14AM Mayanne wrote: Thank you FarmerLucy!",
      "MessageIndex": 33,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Jun 20, 2014 12:19PM Mayanne wrote: Hi White Tiger, I just wanted to say hello.  Glad you are home from the noisy hospital.  I hope you get some answers quickly.  Such a good thing the doctor discovered this. Farmer Lucy, I also did a lot of drawer and closet organizing!  It gave me a feeling of control, I guess.  ",
      "MessageIndex": 22,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Jun 21, 2014 10:13AM Mayanne wrote: Hi White Tiger (love your name, by the way), I wanted to say that it isn't silly at all to wish that the doctor had never found it.  I'm sure we've all wished that.  It's easier for me, who has gone through it and had treatment to see the blessing that it was found. For you, before the diagnosis and treatment plan, it's natural to wish you could go back to the day before your plastic surgery, when you didn't know it existed. It's the unknowns of someone at the stage you are at that creates the most stress.  Almost everyone here says that once a plan for treatment is in place, you'll feel better.  I found that, too.  I felt that I was taking one step at a time and working my way through it.   I don't know of any books you can read, but have you read the site her called \"Success Stories\"?  I posted my mother's story.  She found a lump when she was 60 - 36 years ago.   In those days, the doctors did the biopsy in the operating room with the plan that if a malignancy was found, the woman would have an immediate mastectomy.  So, waking up, she found that she had no breast and realized that she had cancer.  Pathology had also found cancer cells in 4 out of 10 lymph nodes.  I am fortunate to have her journal from the hospital.  I took it with me every day of my radiation treatment,  because her attitude was inspiring to me, even if I hadn't also known the rest of \"her story\".  Soon after her surgery, her doctor visited and she told him how frightened she was.  He told her that the experience could either be a tragedy or a wonderful life lesson (I've thought that was rather simplistic of him, but it helped my mother, so that's what counted).  She wrote that it HAD been a positive experience - that she had made wonderful friends in her room (4 to a room!), that some women had inspired her (the young mother who had been I diagnosed years before and just had the cancer return when her baby was 1 year - but she was living life).  Or the woman who told my mother that there was always hope - that she herself had TB when she was young, but a treatment had been found which helped her live a full life. To tell you the end of my mother's biography - she had radiation - and was followed by her RO for about 15 years.  She went on to live until age 93, never really worrying about cancer.  I think how worried she was in the first year and wish I could go back in a time machine and tell her she would live to be the oldest person in her family.  Having to worry is so unfair. So I was not blindsided by my diagnosis.  As well as my mother, my sister had BC when she was about 50 and then had a recurrence last year.  I guess I felt it was inevitable (genetic testing didn't find any links,  but maybe something will be discovered in the future).   I had an additional experience that taught me that cancer may not always be the worst thing that can happen.  I was four days from my lumpectomy (all set with house clean, no alchohol, no nail polish, food prepared, etc.), when I got very sick, had surgery for an incarcerated femoral hernia and bowel resection.  I was in the hospital (quiet wonderful nurses) for a week with a tube from my nose to stomach (pain in my nose was the WORST!).  I could have died that day/night.  I thought how ironic it was that I was so worried about one thing and another - totally unexpected thing came to attack me.  So when I had the lumpectomy it seemed minor to me and my family.   I guess we get philosophical when these things happen.  It was so wonderful to be disease free before diagnosis - to believe I might live to be 99 with no illness or disability.  My two winter surprises just taught me that we have to appreciate every day.  My surgeon told me that the incarcerated hernia could come back and I thought \"Oh great, now I have two things that might come back.\"  But such is life!     ",
      "MessageIndex": 29,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Jun 23, 2014 07:19AM Mayanne wrote: And thank you, Nancy, too.",
      "MessageIndex": 34,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Jul 9, 2014 11:21AM Mayanne wrote: Thinking of you, White Tiger!  ",
      "MessageIndex": 55,
      "PostDate": "09/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Jan 13, 2014 01:22PM Mayanne wrote: Hi Idunno, I wanted to add my cyber hugs to your thread.  I also wanted to address the \"doctor\" issue.  I had my concerning mammogram on October 21st and got a call from the doctor on October 22, saying that concerning calcifications had been discovered and that I needed a biopsy and that after that she'd refer me to a surgeon.  So, I figured from that time on that I had cancer and started anxiety right from that day (well, most of us probably do).  I waited a week without results and called in myself and was told that I should come to see the doctor the next morning at 8.  Of course with this attitude, I figured it was not to be B9. Now to the doctor.  She is actually a nice person.  She takes so much time with each patient that she backs the later appointments up - and doesn't get rattled at all.  I was steeled for what the news might be - I figured from research that DCIS would be the best news.  She came in, smiled, sat down with my path report and said, \"Yes cancer was found - sorry.  It's DCIS, not invasive.\"  So, I was relieved. But she went on to be gloomy - saying that I'd be sent to a surgeon, the surgeon would probably take lymph nodes, did I need any tranquilizers, etc.  I said, \"But it's early stage and treatable.\"  She continued to be pessimistic.  Now, I wouldn't say she was angry as your doctor was - but I feel that she offered ZERO support to me.  I questioned her at a follow up visit, asking how she knew that my biopsy would be positive (when only 20% are - as YOURS will be :-)  She replied that she's \"paid to be pessimistic\". Huh?  I've decided that either I have to change doctors or take everything she says with the knowledge that I've figured her out.  She also said that she has to \"prepare people for the worst outcomes\".  Perhaps your doctor is the same - just wanting to make sure you follow up with the next steps.  Another story to keep in mind - what keeps me optimistic always - is that in 1978 my mother (at age 60) found a lump in her breast through MSE.  I don't know the complete details, but I believe she didn't have a biopsy - went right to surgery with the understanding that if cancer was discovered - she'd wake up having had a mastectomy.  Four out of 10 lymph nodes also tested positive.  She did wake up having had the mastectomy.  Of course, I don't know the details - wish I could go back to read her path reports which may still be archived at the hospital.  I believe she may have had IDC.  Anyway, she went on to have radiation - the six or so weeks.  No chemo (which I'm wondering about - does anyone know why chemo, which I believe was available in 1978 - would not have been given when 4 out of 10 lymph nodes were positive?) The good news is that she went on to live until age 93 with no recurrence.  So, Idunno, hopefully your lump will be a cyst and you can go back to give that doctor a piece of your mind (even if to help other patients) about how she worried and hurt you and made you feel unsupported.  I am so sorry about the loss of your husband.  It sounds like you have many people who love and are loved by you.  And now you have a whole new group of loved ones here!  ",
      "MessageIndex": 18,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816795",
      "Title": "sad, alone and confused Idunno Hortense"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Feb 12, 2014 02:24PM Mayanne wrote: Hi Franny, I just want you to know I'm thinking of you and hoping you get good results at your appointment.  I also have frequent PVC's which began last spring!  Mine were diagnosed as benign by my PCP. But, since they are so unsettling, I went on to a Cardiologist who confirmed that are benign. Just for my peace of mind he had me wear a Holter Monitor.  The monitor confirmed what he and my PCP diagnosed.  Your description of the feeling of a fish flopping is just what it feels like to me.  Evidently many or most people have PVC's, but only some actually feel them. It made me somewhat nervous to be facing the anesthesia with my lumpectomy (twilight type), even though all doctors were unconcerned about the PVC's.  And I did fine.  (I even had a surprise hernia emergency surgery with general anesthesia while waiting for lumpectomy and did fine with that, too.)  I've been inquisitive with my RO about the effects that the radiation will have on my heart, and he has shown me on the computer the blocks that are in place to prevent any damage. Anyway, just know that you'll be on my mind tomorrow and I'll be hoping for great news!",
      "MessageIndex": 27,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815593",
      "Title": "Thought I'd be one of the 80% FrannyM424 sweetjam"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 9, 2014 06:01PM Mayanne wrote: Hi Red, So sorry this has been happening.  At first I couldn't figure out what you meant by stirrups - I was thinking of foot stirrups!  Of course it's those arm brace things!  It only takes a few minutes to set me up to their three coordinates, but a partial roll is involved and to hold it absolutely steady, I have to brace my right leg and arch my back slightly.  This is difficult - especially when they're also saying to \"'melt into the table\".  If I let myself \"melt\" the roll position would be gone.  I consciously have to hold while bracing, and luckily it's only for a minute or two and then another minute or two after someone comes back to move the machine to the other side.  I have at times worried that the slight arching of my back is sending the radiation where it's not supposed to go, but is assume the machine would reject me.  You'd think they'd stuff a pillow under me or something. I have my 22nd out of 33 tomorrow.  I'm reddening up quite a bit in two separate areas.  I know they are not burns, but the skin breaking down and not building up new skin because of the radiation doing what it is supposed to do.  I always remember someone on one of the threads here calling the process \"healing beams\" in trying to make the best of the process. Anyway, I hope they figure out your proper position and stop making you go through all that wait time!l",
      "MessageIndex": 1307,
      "PostDate": "09/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 13, 2014 06:29PM Mayanne wrote: I'm one of the almost done's!  I have 7 left - 3 whole breast and five boosts.  Some days I'm much more uncomfortable than others.  I'm so red, I'm almost blue.  I was using regular Eucerin, but when the RO found a tiny hole in my skin in an \"under\" area where I couldn't see it, he told me to use Aquaphor and will give me a prescription if it doesn't get better.  Most afternoons I hold my clothing away from my skin and try to not create friction by walking around.  The tech today said it must be painful by the looks, but I describe it more as tender and uncomfortable, rather than painful (crossing fingers). Yesterday, while I was at my treatment, my husband invited my DIL and whole family (including her Mom who is visiting from Spain) for a big St. Pat's Day Irish dinner and told me after the fact!  He had planned to do the cooking, but hadn't realized I've been getting more uncomfortable.  I'm trying to figure out how I'll be three days from now and if I can maneuver around with company in the house. (I can't see myself holding my clothes away from myself!)  I can't wear a bra, of course, because of the band, so I'm thinking of cutting the cups out of my athletic bra which was extra large - maybe one of those would create the space I need around my skin?  But how to hold it in place is the question.  As far as fatigue this week - I'm not sleeping any more than usual - but I realize I have the absence of my usual energetic-ness.  I usually have a long list which I tackle and take great pride in crossing off accomplishments.  These days all I cross off is \"going to treatment\" and two days a week \"going to the gym\"!  Not bad, after all, though!",
      "MessageIndex": 1334,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 13, 2014 08:24PM Mayanne wrote: My RO showed me on the computer how a small portion of my lung would be exposed, too. He said there was no way around that.  My heart is blocked, but evidently a sliver of lung couldn't be blocked.  I'm not sure if that's the case with everyone or just some?  I had my 26th treatment today and so far, have no issues that I can tell with my lungs.  Good luck - you're on your way!",
      "MessageIndex": 1337,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 26, 2014 06:20AM Mayanne wrote: Oh, but PS to the above.  My husband and I are retired.  I know that if I had had chemo, worked full or even part time or had small children or teenagers, I know that I might feel entirely different in the energy department.  I like Red's philosophy above to \"cut yourselves some slack, sleep when you need to, and give yourself time to heal\".. ",
      "MessageIndex": 1411,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 5, 2014 02:26AM - edited Apr 5, 2014 02:29AM by Mayanne I thought I'd check in with my post treatment update, too.  I had only a couple of weeks of discomfort and they began at about week 4 and lasted to the end of the whole breast treatment.  Discomfort for me was lots of nipple sensitivity - I'd actually have to hold any clothing away from that area.  I was very red on the rest of my breast, but it didn't hurt or sting like a real sunburn.  It looked much worse than it felt.  I switched at that time from regular Eucerin to Aquaphor, because it seemed to be a good buffer against clothing. On weekends there was always a noticeable recovery time, when the sensitivity calmed way down.  I got a few zingers during that uncomfortable time and asked my RO, who said that they were from the nerves disturbed by surgery and that the radiation could activate them.  Instead of getting worse they disappeared by the time I started the boosts.  I think I only had them for a few days - few times a day. The minute the boosts started (29th treatment) I began to heal - a little peeling of very thin layers, particularly in that area below the breast.  I didn't have to get the prescription.  My RO checked carefully and could tell if the peeled areas were something to get extra help for or if it would heal naturally.  I got slightly redder in the boost area during the last treatments and then it stayed red for about 4 days post treatment.  I haven't had any more zingers, peeling has stopped, I have a slight tan, haven't been fatigued.  I am enrolled in the cancer wellness program that is on Tuesdays and Thursdays, but have been away this week for some R&R in the mountains.  I find that I really miss the workout.  I have about another four weeks of membership in that program, so will get back to that on Tuesday.  I'm slightly achy and stiff,  but that is nothing new! (I'm 65) I want to note that the radiation was not as bad as I had feared in the beginning.  I had to have it on the left side, so was extremely worried about my heart.  I've been very bothered by PVC's (irregular heartbeat) for about a year, although numerous tests have diagnosed this as a benign condition.  My RO from the start reassured me and showed me on the computer how my heart was blocked from the radiation.  The PVC's are no worse now that I've been finished for 9 days.  I also have always thought about my mother who had BC in 1978 and had radiation for 6 weeks - on what would now be considered less accurate machinery - and she did well and lived for 33 years.  She had a mastectomy, 3/12 nodes, and radiation. Lojo, I'm sorry that you're still having problems.  My RO always stressed that airing things out would really help things heal, but I never had the seepage problem.  I hope they can tell you what to do next.  Now that you are finished with treatment (hooray!) you should probably notice a huge difference in a few days.  Let us know how you're doing!",
      "MessageIndex": 1478,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 19, 2014 03:52AM Mayanne wrote: Enjoy your weekend, Flagirl.  I always loved the change of routine on weekends, too.  And I would almost be able to feel myself healing over those two days,.  ",
      "MessageIndex": 1513,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Jan 10, 2014 07:37AM Mayanne wrote: Hello, everyone, I just got my pathology results last night from my BS.  It's a relief that she got clear margins and nothing other than DCIS.  I'm going to be able to have radiation at a hospital closer to our house than where she's located and where I had surgery - so she'll contact them and I'll get a call to meet with the RO.  She said she likes the radiation to start - at the latest - 8 weeks post surgery (which was 12-30) - so I have time, she feels.  I thought I'd get a call today, but so far, have not.  I'd like to get going on this. I was so nervous when the doctor called - really expecting to hear that I'd have to go back for clear margins - that I totally forgot to ask if the cells were still grade 3, if they found necrofication and if they found I was hormone negative (she had told me earlier they were going to re-check this.  My friend, a nurse, said that the RO will have the pathology report and will go over this with me.  I know I could call the BS but I'm so tired of thinking about it all. I've been hoping to be in the prone position, because I have PVC's which sometimes are very irritating and attention-getting.  I don't want to take any chances with my heart getting more irregular (although the PVC's are benign, says the Cardiologist).  Just a note about my lumpectomy.  I had very little discomfort from just after I woke up until now - 10 days later.  Although I had a prescription for pain meds, all I've taken for discomfort was 1 Tylenol one time when I attempted to sleep without my sports bra one night (and gravity tugged).  I still have steri strips on (until the third week), I'm slightly bruised, cannot see any changes in shape.  I think the doctor took very little tissue.  I'm wondering if my pain threshold might have changed because I had gone through emergency hernia/bowel resection three weeks earlier and had been recuperating from that even as I had the lumpectomy.  So, as soon as I have the meeting with the RO and the setting up, I'll know when I begin.  I've heard that this hospital gives patients their choice of times to go.  My BS said I'll most likely have the usual 33 treatments to \"clean things up\".   Hope everyone is doing well today!",
      "MessageIndex": 390,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 23, 2014 11:10AM - edited Mar 23, 2014 11:16AM by Mayanne I have only two boost to go - Monday and Tuesday.  My redness/soreness/tenderness has turned into a tan and just peeling slightly.  I'm not yet fatigued.  But, I did want to ask if anyone has had indigestion/acid reflux?  It's that feeling that there's a bubble of gas in your chest that just won't release?  I didn't ask the doctor or nurse because until this weekend, I'd only had it a couple of times and thought it was from something other than radiation (don't want to blame everything on that!). Although I've read that the esophagus can be irritated from the rads.  It happens most often when I'm lying down. I'll be asking tomorrow - just wondered if anyone else has had this - I'd never been bothered by this before treatment. Also, I KNOW that slight chills must be a SE.  I've often felt them when I'm sitting and reading and just realized this morning that they're coming directly from my breast that is undergoing rads.  I'd read that there can be weird sensations and I'd thought it referred to the zingers, but the isolated chills must be another one.",
      "MessageIndex": 1386,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 26, 2014 06:11AM Mayanne wrote: Hi Quirky Girl, I haven't had chemo, so our treatments haven't been the same, but I DO remember that very early on in my treatment (just finished day 33d of 33 today), I felt bogged down when I walked, as if a huge pressure was pushing me down and it was even hard to lift my legs to walk along out of the hospital (so this seemed to happen immediately after treatments).  I think I must have adjusted, because instead of getting worse, it happened less and less frequently, and I can't even say I'm tired today.   I got my diploma today and we're going out to eat to celebrate!  Good luck to everyone going through this journey.  You WILL get through it and come out the other side.  My diploma reads, \"Congratulations to you for outstanding bravery and courage throughout radiation treatment.  Good health from the staff.\"  So this is what we all are showing - bravery and courage in our treatment!  Good health to all of us!!",
      "MessageIndex": 1410,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 27, 2014 04:58AM Mayanne wrote: Thanks for your input on the indigestion/heartburn/acid reflux, Jm.  I asked both the nurse and doctor separately yesterday at my discharge appointment and each one said that while it seems to be unusual (but perhaps some women do get it but don't associate it with rads?), it might be cause by the scatter of the radiation to the esophagus.  The doctor said that if it doesn't resolve in a couple of weeks, I should see another doctor. Kat, I was very uncomfortable for about two weeks in the sense that anything coming near my skin (especially nipple) was irritating.  I tried inventing a spacer using the formed cups from my athletic bra (that I cut out from the bands), but even that was irritating.  I used Aquaphor which seemed to create a buffer from fabric.  As soon as the whole breast radiation stopped I felt better, though, so there is relief ahead. Furfriend, you're almost done - it will be here before you know it. Mimi, I think that is such a good point about the anxiety - especially during the first half of treatments - causing anxiety and from that, fatigue.  When I think back to how worried I was about all of the SE's that I was aware might be coming, although I didn't realize it then, I WAS very anxious.  As the time went by and I was past the halfway point and doing well (except for the expected skin irritation), I could breathe and count my days and relax and sleep better! Red, comparing to the SE's of sunburn also make sense.  My chills started easing up as soon as the whole breast radiation ended, boosts began, and redness turned into tan. I just wanted to remind everyone to drink plenty of water - at least 64 oz. a day and a little more would be good, too.  I had trouble keeping track of this until I bought a 24 oz. bottle and now I just make sure I drink a full one in the morning, middle of the day and the evening.  Also, exercise really does help battle the fatigue.  I sometimes push myself to go to the gym program (associated with the cancer clinic) but feel so much better coming out and for the rest of the day. ",
      "MessageIndex": 1419,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 23, 2014 04:05PM Mayanne wrote: TB90, that's just what I experience, too.  It feels like a pressured bubble when I'm lying down and actually, today I have it even when sitting or standing.  It's very annoying.  I'm going to ask the nurse about it tomorrow, so I'll let you know what she says.   And those chills, Lilyluv and TB90, are definitely real, too. Just like chills when you're starting to get sick, but you can tell with these chills that you don't have a fever.   Thanks for sharing SE's. ",
      "MessageIndex": 1390,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 25, 2014 03:10AM Mayanne wrote: Hi Slow Deep Breaths, I hope you're feeling better.  I haven't yet had the fatigue, but know it's common and others here will probably come to tell you. Are you able to do a little exercise?  My RO nurse told me at the beginning that the best way to combat fatigue is to walk and/or exercise.  I know that's hard to do when feeling so tired.  I HAVE had the chills, however.  They come and go. I've been told that I may get tired in a couple of weeks, so maybe you're getting it all over with early.  Hope so. ",
      "MessageIndex": 1402,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Feb 14, 2014 12:35PM Mayanne wrote: Hi Everyone, I had my fifth treatment today.  (I'm having 33.)  So far no SE's.  I'm using Eucerin, because my sister used it and had great results with no burning (and she's a redhead). I actually started using it about a week before treatment started. My center is in a fairly local hospital (30 minutes away), and I'm enjoying the ride through the country each day. The doctor, nurses and techs are very nice.  I'm even going to be able to join a two day program at a health center in the same complex as the hospital.  I'll probably have to push myself to go those two days, but know it will make me feel stronger. It's nice to have this thread - I haven't yet had a conversation with any of the women who are going through radiation, because the techs see me coming into the waiting room and seem to be always ready - so I zip right in.  Even if someone else is waiting, there's been no time for meeting one another.",
      "MessageIndex": 1000,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 28, 2014 10:29AM - edited Mar 28, 2014 10:43AM by Mayanne Hi Andrea, It will be interesting to read what others' ROs have said about when to apply the cream, but mine wanted me to begin immediately at the start of rads. I was glad I did, because the redness came on rather suddenly.  I had seen the RO and nurse in the morning and they were amazed that I had no skin issues, and by the afternoon, the \"burn\" look came out. (I believe this was at the beginning of my fourth week.) I had actually started applying cream before rads even began.  I figured it would condition the skin.  The only thing to remember is to gently wash it off if the cream has been applied within 3 or 4 hours of the treatments.  After I started reddening up, I also carried sample tubes in my purse and applied it immediately after treatments while dressing (learned that here :-)    Lily, I hope your burn spot is better.  Yes, my skin was doing fine - just turning to tan - but the RO and nurse had told me to keep putting cream (using Aquaphor) on for a couple of weeks while it's peaking (and it was hard to believe that anything was still going on).  Last night I found a tiny split on my areola and tiny splits on the nipple.  I'm sure these new areas are from the boosts which I just finished on Tuesday (3 days ago). My husband gave me a product called Climb On which is a pasty thing sold to outdoor people who have cracked hands.  It was hard to apply, but possible.  The cracks are no worse this morning, so I'm hoping they are healing quickly and, anyway, they are not getting worse!  They also don't hurt, but I'm sure I have to keep a watch on them. The doctor had said that if anything changes (he had not seen these cracks at the discharge appointment because they weren't there yet, of course) that he would prescribe Silvadene. Evidently, as \"over\" as it seems when the rads are over, there are still changes going on for those 7-10 days.  Pat, thanks for your positive news!  It's wonderful to hear that you are healing well! You are beautiful!  I just want to add to your positive news and tell women who are reading and still facing rads, that in my case, the SE's have not been bad.  I was terrified and looking back, think of all the times I had meltdowns in anticipation of what MAY happen.  I had read so much that I knew of almost anything that could happen and I thought it would all happen to me.  It didn't and, although I know I could still become fatigued, so far I haven't.  I had been very afraid of radiation, but I've read and the doctors have said that there's only one case in a thousand where radiation actually causes cancer.  I've preferred to think all the way through that the radiation has healing beams (read here and I wish I could thank the person who coined that). ",
      "MessageIndex": 1441,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Feb 18, 2014 08:26AM Mayanne wrote: Hi Everyone, I just had my 7th (of 33) radiation treatment today.  No fatigue, yet, but that's not unusual, I guess.  I do have a little nipple soreness, but I have my weekly meeting with the nurse and doctor tomorrow (as well as the weigh in), so I can ask about that then.  Hopefully, I can get to the appointment as snow is supposed to hit our area in late morning.  My appointment is at 9:45 and it's an easy ride if the weather isn't bad.",
      "MessageIndex": 1052,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 5, 2014 06:08PM Mayanne wrote: I just had my 19th out of 33 treatments, 5 of which (I believe - just haven't heard for sure) -  are the boosts.  I had the sim for the boosts yesterday.  Has everyone had sim for boosts?  The nurse told me that some RO's don't require them, but mine does.  I was kind of irritable, seeing the CAT machine - it was my third CAT scan in three months (having had one for an incarcerated hernia in December.)  I moaned to the tech who said matter-of-factly \"Well, that's how it goes sometimes, unfortunately.\"  The doctor, too, made light of it and said it's \"low dose\". I'm in the middle of my fourth full week (started on a Friday and will end on a Tuesday) and my breast is only slightly tanned.  The RO and nurse yesterday seemed amazed and asked what I use (Eucerin).  But this morning in the dressing room I noticed a red raised spot in an area I might have been neglecting to cream - low and to the outside. And I seem to remember my little robotic friend moving over to his second position very close to that particular area.  It doesn't hurt, but (so I'm very grateful to those of you who've mentioned it.) I'll speak to the nurse tomorrow - maybe I need the silver Rx to keep it in check. I looked for our Bag Balm but couldn't find it and used Lip Medex, instead.  That little blue jar always heals everything for me (although not for my daughter - I think it depends on skin type.) I read in my mother's journal that she wrote in during her radiation in 1978 - that her skin was fine all during her treatments but the following week, she began to peel.  About fatigue, Red.  I don't work and I'm sure that adds tremendously to your energy levels.  I'm making my treatment my work right now.  But I DO notice that some days as I'm leaving the clinic, I feel that I weigh about 400 pounds - as if a huge hand is pushing me into the floor - or as if I'm trudging through invisible water.  It's not sleepy tired - I wish it were.  I don't go to sleep any earlier than usual.  But, fortunately, the heavy feeling doesn't last long - maybe an hour or so - and then I'm normal again.  The grouchiness which I can't blame on any kind of psychological issues - comes out of the blue and leaves after I get it out of my system.  I'm convinced it's physiological - my own body's reaction to the invasion of the beams.  Best wishes to all of us!  I finish four days after Spring begins!",
      "MessageIndex": 1283,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 27, 2014 08:29AM Mayanne wrote: Minus Two, My discharge instructions say to call the RO nurse if I get fever over 100.  Have you spoken with yours?  Interesting about the fact that your RO mentioned the spill over ahead of time.  Sometimes I think they're afraid of the power of suggestion so hold back until we ask. I'm on first day free of treatment.  The nurse told me, as I'm sure yours did, too, that the radiation is still working so there could be redness peaking until 7 to 10 days later.  I hope you feel better soon!",
      "MessageIndex": 1422,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 27, 2014 01:27PM Mayanne wrote: Mimi, That is SUCH a good way to think of it - and it's true, too.  They told me that that was all brand new skin underneath.  Red, I've been peeling in the same way - little thin rolls of old skin.  I'm just tan at this point, two days after the end of radiation, but I guess from reading descriptions above and knowing that radiation is still working for 7-10 days, that it could get red again. I'm still waiting for the fatigue to begin.  Maybe that's still coming, too?  I'll let you know.  My gym program (associated with the cancer clinic) is on Tuesdays and Thursdays and lasts for five more weeks - I really think that's been helping.  Congratulations, Dragonfly!  Have fun with your quilt and other projects.  Minus Two - hope you feel better soon.  Let us know, OK?",
      "MessageIndex": 1436,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 30, 2014 11:06AM Mayanne wrote: MinusTwo,  I hope you're doing better.  I suppose the chest x-ray would have shown if you've developed pneumonitis?  But I was wondering about that as it's a side effect that was mentioned to me at my surgical consult.  I wonder if chest x-rays could miss it?",
      "MessageIndex": 1445,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 30, 2014 09:23PM Mayanne wrote: Lojo, congratulations!  It will feel so great to be done!  I can see how crumbs could hurt. Rads, my RO and nurse said to air things out as much as possible.  But then, they would also say to keep on applying aquaphor generously.  I guess there just has to be a balance.  Drink lots of water, too! TB, it just doesn't seem right that things should continue to worsen after it's over.  How fair is that?",
      "MessageIndex": 1451,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 30, 2014 05:56PM Mayanne wrote: Hi Red, Glad you're safe and happy back at home.  I'm amazed that the spring flowers are already out in Vancouver!  We are on a get-away R&R in the White Mountains of NH and there's still snow and mud - NO flowers in sight. No more splits or cracks.  What appeared one night disappeared by the next day.  I still have not had the fatigue - and have been spring cleaning with lots of energy.  If it hits me one of these days (finished with rads 5 days ago) at least the house will be clean of cobwebs. Minus Two - how are you?",
      "MessageIndex": 1447,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mar 1, 2014 12:08PM Mayanne wrote: Terri, I'm thinking of you and admiring your warrior attitude.  It will be OK, no matter what. Hoping for a B9 result, too.  You never know <3",
      "MessageIndex": 33,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818226",
      "Title": "Terrified!!! :'( Terri001 jbdayton"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Mayanne wrote: I'm scheduled for a Lumpectomy on December 12th. My daughter and I went to the surgery consult with the idea that I might choose a mastectomy because of family history and my high grade, negative hormone status. I have complete faith in the surgeon and she believes the Lumpectomy is the way to go. What I'd like to ask is something about possible recurrence as happened to my sister (after a Lumpectomy, chemo and radiation), although her cancer was more advanced. If DCIS is generally the first stage, and IDC comes out of DCIS, why would women who had once had DCIS and most assuredly been regularly screened for a recurrence, ever get IDC? Wouldn't it be found again through screening as DCIS? Or does IDC just appear in the same breast without any warning at all? Also, if a woman has a mastectomy, why is it possible to have a recurrence? Naturally, I was asking so many other questions when seeing the surgeon, I forgot to ask these. Dx 11/13/2013, DCIS, <1cm, Stage 0, Grade 3, ER-/PR-, HER2- Surgery 12/30/2013 Lumpectomy: Left Radiation Therapy 2/7/2014 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815288",
      "Title": "Confused about recurrence possibility Mayanne ruthbru"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 17, 2014 08:47AM Mayanne wrote: Ddkath,  so glad that you made it over another hurdle.  Sweet dreams.",
      "MessageIndex": 160,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819132",
      "Title": "Freaked out and have no idea where to start Ddkath70 Holeinone"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "May 7, 2014 01:29PM Mayanne wrote: DDkath, I can't tell you how much I'm admiring your strength and resilience.  I also love your haircut and think you are a very beautiful girl!  You WILL get through it all and one day the experience, while never forgotten, will all seem like one of life's insurmountable hurdles which YOU were strong and brave enough to get over and get past. Is that your dog on your icon?  She/he remind me of a very beloved Brittany who was in our lives for 13 years.  Much love to you.",
      "MessageIndex": 181,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819132",
      "Title": "Freaked out and have no idea where to start Ddkath70 Holeinone"
    },
    {
      "AuthorID": "Mayanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191579/profile",
      "Content": "Apr 16, 2014 04:29PM Mayanne wrote: I'm thinking of you, Ddkath!  ",
      "MessageIndex": 154,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819132",
      "Title": "Freaked out and have no idea where to start Ddkath70 Holeinone"
    }
  ]
}