{
  "AuthorID": "maybeoverreacting",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59692/profile",
  "Posts": [
    {
      "AuthorID": "maybeoverreacting",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59692/profile",
      "Content": "maybeoverreacting wrote: I had an excisional biopsy in August 08 that pretty much showed chronic inflammation and an abcsess. The \"obstruction\" has come back and I have it in both breasts... it does act just like an abscess (red hot, tender, nipple pulling to the side, etc.) I am not breast feeding and this has been going on since oct 2007. I am wondering if anyone has ran across this: My new and WONDERFUL BS went in Monday and cut the stubborn thing out. She did find the abscess, pus (ewwww) and other grody stuff. She also removed the \"obstruction\" again that has grown back. She put it into a specimen cup and didn't mention a word about it. I am going in for repacking as the wound is open to drain. I asked her if she removed the abscess and she said yes, it was irrigated. Perfect! So what was the mass in the cup that she removed? She said she needs to figure out what is causing this blockage so it can be fixed referring tot eh mass maybe?). If she had any concerns about the solid tissue lump that was removed, she probably wouldn't have left it open correct? I am so paranoid... I guess the pathology results will ease that soon enough. Has anyone heard of this before? I have heard of an abscess and fistula but not behind a mass. It was about 1.5 cm long and pink around the outside with a white something in the middle? Too much margin around it, I couldn't tell if it was spiculated. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/749543",
      "Title": "Am I paranoid or what???? maybeoverreacting maybeoverreacting"
    },
    {
      "AuthorID": "maybeoverreacting",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59692/profile",
      "Content": "maybeoverreacting wrote: I wasn't going to do this but I have decided to. You are obviously on this site because you are concerned. I thought I had BC or at least there was a possiblilty for about 21/2 years. My condition is benign I have found out, however, has become worst through treatment resistence from my doctors (8 of them) because of my age. I was 28 when I sought help for my first symptoms. I have been told it is everything from a dilated vein to a superficial pimple. My red hot lump grew and grew for about 21/2 years and I have developed an abscess and fistula that may never go away. I've told this story here before but I'm really discusted that my docs put me off so long. I am packing a drainage hole in my left breast and will start on my right soon. It's terribly painful and I'm not looking forward to treating it any longer. A benign diagnosis is the best for sure (and I feel very lucky), however, it is not always necessarily \"NORMAL,\" as I was told. An infection that turns into an abscess is very difficult to treat and I suggest everyone seeks a diagnosis so that the condition is managed, Do not stop at benign ... do the research and follow up with a doctor you are confident with, no matter how many it takes. Don't rule out benign conditions if you are infact lucky enough to have a non malignant result. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750081",
      "Title": "Breast Disease maybeoverreacting maybeoverreacting"
    }
  ]
}