{
  "AuthorID": "Maziel58",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184588/profile",
  "Posts": [
    {
      "AuthorID": "Maziel58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184588/profile",
      "Content": "Jul 28, 2013 08:02PM Maziel58 wrote: Hi, Sheila and all - I'm new here; haven't even got my drain out. Meeting with the oncologist on the 8th. I haven't left this site so please tell me about Neulasta.  I am HER2.  I am 70.  I have a lot of bravado and positivity, but I have really bad anxiety attacks which I keep private.  I am very strong BUT... I want to be out for the port - as out as they'll let me be.  Not getting bumped is going to be difficult.  I have 8 dogs, 3 cats and hookbills.  I guess I'll have to tie a pillow to my chest...or something.  Maybe a catcher's padded front thingy (I don't do baseball). All I want to do is be ok enough to kayak gently in quiet water across the street.  Will I be able to do that? I've heard with a port, you can't do a lot of upper body stuff.  To make it worse, my husband has a very bad heart and diabetes, and gets his feelings hurt easily.  He also knows from his past work history, so much about medicine.  I find him reading on IPAD at 3 a.m. and he can't sleep.  Now I'm reading these forums, and starting to get a little shaky. I don't know what drugs I'll be taking yet.  Scary new world. ",
      "MessageIndex": 664,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Maziel58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184588/profile",
      "Content": "Jul 27, 2013 12:55PM Maziel58 wrote: How do I get there?  I just got here today.",
      "MessageIndex": 629,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    }
  ]
}