{
  "AuthorID": "MBfightsBC4…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54387/profile",
  "Posts": [{
    "AuthorID": "MBfightsBC4…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54387/profile",
    "Content": "Oct 2, 2010 10:03AM MBfightsBC4Mom wrote: Hi everyone! This is MB (Mary Beth)...Beth's daughter. First, thanks Kel for posting this. Second, I really want everyone to know what BCO meant to Mom. She would spend hours pouring over the boards and chatting with her 'sisters'. She made some of her best friends from BCO, including Wats, who now gets to party hardy with her in Heaven. I was with her until her very last breath. Even with her head partly shaved, a semi-circle of staples jutting from her skull, teeth not brushed, face not clean...she was absolutely the most beautiful thing I've ever laid eyes on. She was not only my mom...she was my very best friend. My heart is filled with gratitude to all of you. I'm SO blessed that I got to meet so many of you on the Vegas trip. Since then, I've had many \"mamas\" who have taken good care of me. Even if you never met my mom...I know she loved you. She was the most gentle spirit, but could kick some major ass when it came to fighting this cancer. They told her 7 years ago to get her affairs in order...take her vacations...that she was going to die. Seven years later, while she lay unresponsive in the hospital bed, the docs kept coming in every morning saying, \"It'll happen in the next 24 hours.\" But when did Mom EVER listen to those dang doctors??? She stayed with us for FIVE DAYS! I hope her memory never dies. And I hope that she is in the arms of all the sisters who left before her.   Thank you, everyone for loving my mom.  Love always, MB ",
    "MessageIndex": 33,
    "PostDate": "02/10/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758512",
    "Title": "AusAla (Bethie) is now an Angel KellyC Bonnielv"
  }]
}