{
  "AuthorID": "MBPooch",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
  "Posts": [
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Feb 21, 2019 04:20PM MBPooch wrote: My peeling was very minimal, just the nipple. Again, nothing showed on my imaging so don't let your clear images lead you to not pursue. A dermatologist can do the punch biopsy and if anything will set your mind at ease.",
      "MessageIndex": 8,
      "PostDate": "21/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869928",
      "Title": "left nipple itchy concern ( last almost 2 months already) mtl114 sflow"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Feb 19, 2019 11:41AM MBPooch wrote: I think you may be able to get in sooner to a dermatologist since all you're looking for right now is the punch biopsy. I agree, that Pagets isn't seen as often but it is possible to have Pagets without any other underlying issue. Therefore there would be no lump to feel. In my case the only thing that picked up the DCIS under the Pagets was the MRI after the Pagets diagnosis. Since you've already tried a prescription ointment I don't see any reason whey they wouldn't just go forward with the biopsy. Keep us posted!",
      "MessageIndex": 3,
      "PostDate": "19/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869928",
      "Title": "left nipple itchy concern ( last almost 2 months already) mtl114 sflow"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Feb 19, 2019 09:08AM MBPooch wrote: mtl114 - The only way to test for Pagets is with a punch biopsy. My scans all came back negative as well so my GYN referred me to a dermatologist. I did the prescription steroids as well for 10 days but they did not help. It was the dermatologist that did the punch biopsy. Your symptoms sound very similar to mine. Is there any way for you to get in sooner with another dermatologist?",
      "MessageIndex": 1,
      "PostDate": "19/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869928",
      "Title": "left nipple itchy concern ( last almost 2 months already) mtl114 sflow"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Feb 23, 2019 11:29AM MBPooch wrote: Glad you have a plan in place! Best of luck with your surgery, it really is not too bad. Will be thinking of you next week!",
      "MessageIndex": 14,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869928",
      "Title": "left nipple itchy concern ( last almost 2 months already) mtl114 sflow"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Feb 27, 2019 02:25PM MBPooch wrote: Glad you're going to stay persistent! It could very well be nothing but mine didn't \"look\" like Pagets either.",
      "MessageIndex": 19,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869928",
      "Title": "left nipple itchy concern ( last almost 2 months already) mtl114 sflow"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Feb 22, 2019 08:33AM MBPooch wrote: Would it be easier to focus on finding a dermatologist right now? They can do the punch biopsy and you may be able to get in and have it done sooner than trying to get into a breast specialist. Eliza - my situation was SO much like yours! High grade DCIS underneath the Pagets that did not show up on mammogram or ultra sound. It did show up on MRI after my Pagets diagnosis. I also did a BMX and haven't regretted it for a minute! Recovery was also not nearly as bad as I had imagined. Good luck to you next week!!!",
      "MessageIndex": 11,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869928",
      "Title": "left nipple itchy concern ( last almost 2 months already) mtl114 sflow"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Feb 25, 2019 06:23PM MBPooch wrote: motheroftwo - Even if it's something you suspect in the back of your mind, it hits you like a ton of bricks. This is the worse stage, not knowing specifics but you will get there so don't get too ahead of yourself. This is such a great place to come to for questions and support!",
      "MessageIndex": 44,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869779",
      "Title": "Age 32 and Large mass in right breast Motheroftwo36 Marymc86"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Oct 24, 2018 12:06AM MBPooch wrote: I was diagnosed with Pagets and DCIS last October. Neither showed up on a mammogram or an ultra sound but both were very visible on the MRI. My insurance paid half the cost of the MRI. If anything having it done will give you piece of mind.",
      "MessageIndex": 1,
      "PostDate": "24/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/867946",
      "Title": "MRI Celand Celand"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Mar 13, 2019 07:34AM MBPooch wrote: Tnadav - I did Direct to Implant with my mastectomy and couldn't be more thrilled with the results! Recovery was also not nearly as bad as I had imagined. I had surgery the last week of Nov, hosted Christmas Eve dinner and went on a NYE vacation 4 weeks later. 8 weeks later my husband and I were in Vegas and I sat poolside in a bikini, something I would have never thought would be possible so soon after surgery. Direct to Implant was great since it eliminated the need for a second surgery and as long as you are consistent with the arm exercises (I also feel like some light yoga aided me a ton) you should experience a fairly quick recovery. Best of luck and feel free to reach out if you have any other questions!",
      "MessageIndex": 4,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870340",
      "Title": "San Diego bilateral mastectomy - 32yo Tnadav Tnadav"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Mar 13, 2019 02:45PM MBPooch wrote: April0315 - I also had implants at the time of diagnosis but knew immediately I wanted a BMX. I had some benign findings in the other breast after MRI and just wanted to take the most aggressive approach. When I met with my plastic surgeon he suggested Direct to Implant. Getting silicone implants put in at the time of surgery was super appealing to me. I liked the idea of only needing one surgery and also having symmetry. It was also very mentally motivating to come out of surgery with breasts that were very similar to what I had. I'm a little over a year out now and couldn't be happier with my decision and how they look. Definitely take the time you need to be confident in your decision. If you haven't already, genetic testing my also aid in your decision as well. Best of luck to you!",
      "MessageIndex": 11,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870338",
      "Title": "Lumpectomy vs mastectomy how did you decide? April0315 April0315"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Apr 26, 2018 09:15AM MBPooch wrote: Make an appointment with a Dermatologist and demand a punch biopsy of the most affected part of the nipple. The ONLY way to test for Pagets is with a biopsy. I tend to think your symptoms are stress related but the only way to know for sure is with a biopsy if you are wanting to rule out Pagets. If anything it will give you piece of mind. Keep us posted!",
      "MessageIndex": 5,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864230",
      "Title": "Itchy left nipple on a 19 year old male! Lissy19 Traveltext"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Dec 6, 2017 03:52PM MBPooch wrote: Good news on the new biopsy date, I know how frustrating it is to wait for results! Good luck on Friday and stay in touch!",
      "MessageIndex": 373,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Dec 5, 2017 01:30PM MBPooch wrote: Tessieb - Sorry you've found yourself here. I was just diagnosed with Pagets of the nipple in October and felt very similar to you in every way, I just turned 46 and have no family history of BC. Had genetic testing done and that came back negative as well. Try not to get too ahead of yourself. I did lots of over thinking and lots of googling that led me in places and situations that were completely different than mine which in turn led to a lot of senseless worry. After my initial diagnosis I had a negative mammogram but my MRI indicated a mass under the Pagets as well as another mass on both the left and the right. I did a core biopsy on all 3, DCIS was found under the Pagets but both other masses were benign. My underarm on the Paget side had been sore and slightly swollen as well but turned out to be nothing. I just had a BMX last Thursday with immediate silicone direct to implant. Still waiting on final pathology but my nodes were clear which was a huge relief. I did get a prescription for xanax for bedtime shortly after diagnosis. I found that was the time I really let my mind wander into some dark places. Once you have a firm diagnosis and plan in place you will feel so much better. Hang in there and keep us in the loop! Michelle",
      "MessageIndex": 370,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Jul 9, 2018 08:02PM MBPooch wrote: Hi Nati - Try not to panic! The unknown is for sure the worse part. I was in a similar situation last Oct and the biopsy is the only way to diagnose Pagets so that's great your surgeon was so proactive. I was thankful my doctor also ordered an MRI as that was the only thing that caught the underlying DCIS. Mammogram and ultra sound didn't pick up a thing. I had a BMX the last week of November with direct to implant and there are more days than not that I don't think about breast cancer at all. You may find that this is simply a nasty case of eczema but if it's not know that a lot of the time everything turns out great and that there a lot of options out there!  Keep us posted! Michelle",
      "MessageIndex": 1,
      "PostDate": "09/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865769",
      "Title": "Possible Pagets Nati Nati"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Jan 16, 2019 09:51AM MBPooch wrote: One 250 mg of Magnesium taken with a vitamin D chewable has worked wonders for me! Take it an hour before bed, works amazing.",
      "MessageIndex": 3,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869375",
      "Title": "Need some advice with sleeping, anxiety, etc kec1972 lyzzysmom"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Nov 13, 2017 02:08PM MBPooch wrote: Hi Samzie - Sorry that you have found yourself here but this is a great place to come for support! I was recently diagnosed and you sound exactly like how I felt a couple of weeks ago. Try not to worry yourself to death this week, easier said than done I know, but it could be absolutely nothing (the majority of biopsies are negative, especially at your age and with no history) I was diagnosed with Paget's and an underlying DCIS that both mammogram and ultrasound missed. After MRI, two other masses were discovered. They also said that it looked highly suspicious with a Birads 4. I worried myself sick for days. I went in for an ultra sound guided biopsy of both new masses and was certain both my breasts were filled with cancer. As it turned out both masses were Fibrodenomas and benign. Google can be a scary place so stay away from that! I am choosing aggressive treatment and opting for a double MX with immediate reconstruction at the end of the month (I just turned 46 yesterday and feel like I'm too young for this!) but that will hopefully be the end of this chapter with no further treatment needed. Take it from someone who put the cart before the horse, it's a lot of senseless worry! Keep yourself occupied till Thursday and focus on your results then, every cancer is different and this might be nothing at all for you! Will be wishing for great results for you, please keep us posted!",
      "MessageIndex": 1,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860093",
      "Title": "So scared.... waiting samzie24 Larlaw"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Jan 10, 2019 03:11PM MBPooch wrote: alto - Sorry you've found yourself having to make that decision. After my DCIS diagnosis last year I chose to have a BMX (I had previously had some B9 findings in both breasts). I didn't want to worry about the future testing, already had implants and wanted symmetry in both breasts. I was able to do Direct to Implant so reconstruction was done at the same time as surgery. It wasn't a picnic but I can tell you recovery was far easier than I thought it would be. Best of luck in making the decision that is right for you!",
      "MessageIndex": 21,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868533",
      "Title": "DCIS diagnosis almost 2 weeks ago Heather2018 alto"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Nov 15, 2018 09:28AM MBPooch wrote: Oya80 - Glad to hear you are doing well and on the other side of surgery! I'm a bit surprised they let you go home same day as well. I actually pushed for that but my surgery was later in the day so not an option. I think you'll be surprised by how fast the body recovers. Wishing you a speedy recovery!",
      "MessageIndex": 18,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868244",
      "Title": "Surgery soon... lumpectomy or dbl mastectomy? Oya80 HopeBry"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "May 16, 2019 02:00PM MBPooch wrote: The only way to diagnose Pagets is with a punch biopsy. Be sure to push for that so you can ease your mind.",
      "MessageIndex": 7,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871467",
      "Title": "Worried I'm overreacting Trishdenys edj3"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Jan 10, 2019 04:04PM MBPooch wrote: eliza_246 - Your story is SO similar to mine! I was also diagnosed with Pagets and also had a clean mammogram and ultrasound. I did have an MRI before surgery that showed the DCIS directly under the pagets as well as another spot in that breast and one in the right. I did biopsies of the other two spots and those were both benign. However, I knew after the DCIS diagnosis I would be doing a BMX. I'm a total worrier and didn't want to have to constantly worry about all the future testing. I was also not trusting that mammograms and ultrasounds would find anything that could be lurking. I also had implants so was told cosmetically that it would be the only way to retain symmetry. I was previously an A cup so didn't have a lot of natural tissue. I was lucky enough to be able to do direct to implant so had silicone implants put in at the time of my BMX. Final pathology didn't reveal any surprises, my recovery was by all accounts fairly easy and I don't regret my decision for a minute! Feel free to message me if you have any other questions!",
      "MessageIndex": 2,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869268",
      "Title": "DCIS ONLY DISCOVERED WITH PAGETS OPERATION NOT IN MAMMOGRAM eliza_246 MBPooch"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Jan 10, 2019 10:07PM MBPooch wrote: eliza_246 - I started driving about a week later. I don't have a desk job, I'm a realtor and so Dec/Jan was a great time for me to have surgery. I was pretty fit before surgery, was diligent about my exercises and started back with yoga at home about 6 weeks later. I think that was the most important thing that aided in my recovery. I had surgery the last day of November, hosted my husbands family for Xmas eve and went up North for NYE on a snowmobiling vacation. I didn't partake but my surgeon said it was up to me. I had an augmentation 7 years prior so not sure if that could have aided in recovery as well. It was a very similar experience. The recovery was definitely easier than I had imagined it would be.",
      "MessageIndex": 4,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869268",
      "Title": "DCIS ONLY DISCOVERED WITH PAGETS OPERATION NOT IN MAMMOGRAM eliza_246 MBPooch"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Dec 7, 2017 08:00AM MBPooch wrote: DagnyT - Here's a little about my experience, maybe it will help you with some of your questions/decisions. Mine happened opposite of yours. I noticed the smallest bit of white scaly skin on the nipple back in July. Looked like a skin condition, nothing more. Never peeled, bled, cracked, nothing like typical Paget symptoms. I went to my GYN because I had not had a mammogram last year, I was 45 and my left breast just felt sore in general. Long story short, mammogram was negative but while the peeling never changed for the worse (my husband couldn't even notice it) it never completely went away. My GYN sent me to a dermatologist who after trying creams and steroids finally did a biopsy. A biopsy is the ONLY way to test for Pagets. Biopsy surprisingly came back positive for Pagets. I have no family history. I met with an oncologist first but only because that was the first person I could get into and who the Derm recommended. She ordered the MRI. After the MRI I got a second opinion from an amazing team of doctors who are closer to where I live. They work together as a team with a radiologist and with a nurse navigator who helps coordinate appts between the team. MRI revealed a mass directly behind the nipple (under the Pagets) as well as two more spots, one in each breast. I did a core biopsy of all areas, two surprise spots were both B9 and mass under the nipple was DCIS. I had an augmentation done almost 7 years due to not having much breast tissue that also played into my treatment. I did not have enough breast tissue for a lumpectomy but had already decided that a BMX was the only thing that would give me piece of mind. Also, knowing that I would lose the nipple on the left I wanted symmetry on the right. Last Thur, 11/30 I had a BMX with silicone direct implants. My nodes were clean and I'm still waiting on final pathology but am super happy with my decision and initial results. Hope your appt went well today, keep us in the loop!",
      "MessageIndex": 22,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860556",
      "Title": "Surgeon vs Oncologist First? DagnyT stexas"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Nov 13, 2018 11:03AM MBPooch wrote: If you're concerned at all about Pagets I would go to a Derm and have a punch biopsy to confirm. My Pagets didn't have the typical signs and symptoms. There was no itching, no bleeding, just a continuous flaky nipple that would not go away with over the counter or prescription creams. It also did not show up on my mammogram. The only way to know for sure about Pagets is the biopsy. Hopefully it's something that will just resolve on its own!",
      "MessageIndex": 1,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/868311",
      "Title": "Flaking skin on nipple Prairietwin2 MBPooch"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Oct 9, 2018 05:20PM MBPooch wrote: I only had a little oozing and exactly how Kelligirl5 described. Never enough though where it would soak through anything. Definitely have your derm do the biopsy so you can set your mind at ease and know one way or the other. Keep us posted!",
      "MessageIndex": 8,
      "PostDate": "09/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867520",
      "Title": "Swollen left nipple- oozing, bleeding, crusting & itchy! Cmmarier ishhlish"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Nov 28, 2018 03:35PM MBPooch wrote: CCrill - You could try Vitamin E oil and see if that helps the dryness. Or an over the counter anti-itch cream may give you relief. I tried both before going to my Gyn then ultimately a dermatologist to have a punch biospy done. Keep us posted!",
      "MessageIndex": 1,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/868571",
      "Title": "Dry skin on nipple CCrill MBPooch"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "May 27, 2019 04:40PM MBPooch wrote: Wondering if anyone has experienced anything similar. I'm a year and a half out from BMX due to DCIS and Pagets with direct to implant. My recovery was surprisingly easy but recently I've noticed some changes on the left side, cancer side. It started with an annoying itch sporadically during the day. That lasted about a week. This past week there's more of a general tight feeling along the outer left side. Almost along the ridge of the implant. Not really pain, just a noticeable tighter feeling and a little sore here and there along that left side. I'm thinking its nerve regeneration but haven't seen any similar posts. My breasts look and feel the same but that left side is just a bit tighter and more sore. More uncomfortable in a sports bra and almost unnoticeable when not wearing a bra at all. Anyone else experience anything like this and if so how long did it last? Did it go away on its own or did you go in?k. Thanks in advance!",
      "MessageIndex": 1782,
      "PostDate": "27/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "May 28, 2019 11:42AM MBPooch wrote: MinusTwo - Updated my signature and I agree that if it doesn't resolve this next week it's time to get it checked out. Wondering if I was just overdoing it with arm weights and that side is more sensitive due to the SNB. aliciacantu84 - I've had that shooting and burning before. Sometimes when I over stretch too much.",
      "MessageIndex": 1786,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Nov 9, 2018 09:50AM MBPooch wrote: Oya80 - Like PollyOne I also chose BMX. I actually never considered lumpectomy. I wanted to do whatever I could to hopefully not ever have to go through that experience ever again. I'm also a bit of a hypochondriac so knew I would question every ache and pain! I had also lurked around on here enough to see that there were people who had surprises when their pathology after mastectomy came back and I just wanted to be certain I was taking care of everything. I was able to do direct to implant which if you would be interested in reconstruction it's definitely something to ask about. Only having the one surgery and waking up with breasts that were similar to what I had was mentally encouraging to me. My recovery was actually not bad but I feel like that might not be the norm. I do practice yoga and had implants before so not sure if either of those things aided in my quick recovery. My surgery was Nov. 30th, I hosted Christmas Eve and took a trip up to Northern WS for NYE. Most days now I don't even think about it and it's hard to believe it's been a year already. Best of luck in making this decision, none of this is easy but you will be okay!",
      "MessageIndex": 3,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868244",
      "Title": "Surgery soon... lumpectomy or dbl mastectomy? Oya80 HopeBry"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Oct 6, 2018 02:13PM MBPooch wrote: I was diagnosed with Pagets last October. I also did multiple creams then finally had my dermatologist do a punch biopsy. That is the only way to test for Pagets, mammogram and ultra sound both missed it as well as the DCIS that was underneath the nipple. If you have any question at all get the biopsy.",
      "MessageIndex": 3,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867520",
      "Title": "Swollen left nipple- oozing, bleeding, crusting & itchy! Cmmarier ishhlish"
    },
    {
      "AuthorID": "MBPooch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261580/profile",
      "Content": "Dec 4, 2018 09:38PM MBPooch wrote: CCrill - I did mine through my dermatologist. It's a small biopsy of the skin and the only way to test for Pagets.",
      "MessageIndex": 4,
      "PostDate": "04/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/868571",
      "Title": "Dry skin on nipple CCrill MBPooch"
    }
  ]
}