{
  "AuthorID": "MCbeach",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
  "Posts": [
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 8, 2013 05:10AM MCbeach wrote: Hi Ladies, Thanks SO much for all the info on how you are all doing and the descriptions of what it is like right after surgery. These posts are really helping me prepare mentally for my date next week. Glad everyone seems to be recovering nicely!",
      "MessageIndex": 117,
      "PostDate": "08/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 17, 2013 08:06AM MCbeach wrote: Hi ladies, I made it. I had my BMx Thursday am then a 2nd emergency surgery to stop an artery that was hemoragung under my armpit. I stayed in the hospital 2 nights. Pain is not bad, I'm just taking it easy. Much less then i anticipated. My Ps filled my expanders w 300cc so they even look pretty good already. Feeling very happy and blessed. I brought a water bottle and Chapstick to the hospital. I'd highly recommend taking these for all those w upcoming surgeries.",
      "MessageIndex": 222,
      "PostDate": "17/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 17, 2013 11:12AM MCbeach wrote: gtgirl -ditto about the snb shot. The prick was a small prick, it just stung a little. More then a typ shot. I didn't watch it so I didn't even know when the needle went. Have ur nurse help you take deep breaths, that helped a ton. Mimi32-glad to hear u are recovering well. I hope the swelling goes down for you very soon.",
      "MessageIndex": 224,
      "PostDate": "17/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 20, 2013 07:43AM MCbeach wrote: jmfrankel- oh my! So glad they caught this but how scary for you. Do your stomach shots hurt? I hope they are at least tolerable. It sounds like you have good spirits about all this which is great! Keep us posted to your progress. It is so nice to have others to go down the recovery path with. Hugs to you.",
      "MessageIndex": 263,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 19, 2013 05:09PM MCbeach wrote: gtgirli- I had snb, all nodes removed were clear. :) In post op, my right side started to swell huge and bruise. They rushed me back to the or, opened it up again, found a bleeding artery, cleaned it out. The TE did not have to come out or be re-set, thank goodness. All seems fine now, just more numb and bruised on that side.",
      "MessageIndex": 255,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 22, 2013 04:07PM MCbeach wrote: Allebasi-so sorry to hear of your pain w the drain removal! Sounds like it was bad. Also sounds like you have more feeling than I do. I had 2 taken out on Wed and I didn't feel a thing since I am so numb. So at least it is over for you or do you have more? I still have 2 more that will come out next Tues. It is so nice to have a group who is going through this at the same time. All the stories, comments and experiences shared are a blessing!",
      "MessageIndex": 290,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Dec 17, 2013 08:49AM MCbeach wrote: Tangandchris-HUGS - so sorry to hear about all you have going on. It is good to get it out, at least we have that here. I got 300ccs when my TEs were paced (11/14 at my BMX). I have gotten fills of 60ccs 2xs (last one was painful for 2 days then fine). Hope you heal quickly and that the skin is ok. hugs again...",
      "MessageIndex": 471,
      "PostDate": "17/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Jan 10, 2014 05:53AM MCbeach wrote: Hi again, I met w my PS yesterday and talked about the tightness.  He said the strain by my inner armpits is scar tissue w my TEs and this will be fixed with the exchange surgery.  He also said the iron bra will go away then too.  :)  I am also released to go back to yoga.  :)  My exchange is set but I have some decisions to make (gummy bear vs softer silicone, etc.)",
      "MessageIndex": 495,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Feb 19, 2014 06:13AM MCbeach wrote: Gtgirl-I had a large seroma in my non-cancer side in the armpit from an emergency bleeder (sent directly back to the OR after BMX).  It was about 3\"x1\".  I was told to do lots of massage in the shower and hot compresses with massage too.  It was sore feeling.  It would go down slightly and then would come back.  It started to finally disappear once I started resuming my yoga (which I do 5 days/week since 6 weeks after BMX.)  Hope this helps you.  Talk to your PS, they may be able to drain it.",
      "MessageIndex": 523,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 4, 2013 05:21AM MCbeach wrote: Allebasi-from what I understand in my BS paperwork, it is to hold the drain with ur thumb and forefinger at the top and to use ur other hand to pinch the tube and run it down (to get the excess in the tube out). I heard it hurts a bit. Would love to hear any pointers on this from those who has been through this before.",
      "MessageIndex": 71,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Oct 30, 2013 04:53PM MCbeach wrote: Nov 14th, bilat skin sparring mastectomy. Just found out the date. Much to do. Anyone know how long until driving (typically?) Nancyjeane-telling the kids was the hardest part of all this for me so far. Mine are 11 & 14. My DH and I sat them down and told them we had something to talk about - family discussion. 11 chimes in, \"it's not cancer, is it?!\" - i had to say yes, but explained how lucky I am to find out so early. They got it. We even \"celebrated\" with dinner for such an early catch. I am blessed that it was caught early. I talk openly with them, they mostly open up at night when I put them to bed (they are girls btw). HTH",
      "MessageIndex": 42,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 3, 2013 05:38PM MCbeach wrote: Hugs ladies heading in this week! Keep us posted to your progress as soon as you feel welll. Prayers that everything goes smooth.",
      "MessageIndex": 68,
      "PostDate": "03/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 12, 2013 06:03AM MCbeach wrote: Mimi68-Thanks for the pointers and advice on the colace. Hope the trobbing subsides soon for you.",
      "MessageIndex": 165,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 18, 2013 01:05PM MCbeach wrote: Allebasi-I drift off too for a bit pretty frequently. ESP about 30 mins into my pain med dose. (Hydrocodone 2 every 4 yrs). I try to go down to one but it really hurts bad so I think I will keep w 2 for a while. I'm on just that and antibiotics. It sounds like u gave a muscle relaxer in there too? That may be the cause of your freq drowsiness? Maybe pm some if the other Nov girls and ask what they are on and if the have similar bits of sleepiness? Hug to you, hang in there. Your dh sounds like mine. I feel blessed to have mine as I'm sure you do too.",
      "MessageIndex": 236,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 11, 2013 09:14AM MCbeach wrote: I hear all the info on the miralax but I took this once before for constipation and boy did I have the reverse problem (TMI?) I'd hate to have this before/during my surgery so should I just mention it to the Drs before surgery and hope they give me something after surgery? Thoughts appreciated!",
      "MessageIndex": 157,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 12, 2013 07:13AM MCbeach wrote: gtgirl-hmm, r u sure that is correct? I'd pm beesie, she is very knowledgeable and will likely be able to give you info to put ur mind at ease. Hugs, I know this us scary, we are here for you.",
      "MessageIndex": 167,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 13, 2013 07:28AM MCbeach wrote: JMfrankel-glad to hear about ur drains coming out. That's got to be so much better for you. Keets858-I am also sorry to hear about your son. I can't even imagine the pain that would inflict. I hope to never know. Mimi32-hope recovering goes well.",
      "MessageIndex": 181,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 27, 2013 06:53AM MCbeach wrote: Hi all-I read these posts every single day but don't always have the enerygy to jump in and post. This forum has been so good for me to feel like this is all going to be ok. I got my finally 2drains out yesterday. Ouch, those 2 hurt. They said they were \"stuck\". They were the lower drains. I also got my first fills. Didn't feel a thing. I got 300 ccs in surgery and then 60ccs yesterday so I'm a bit surprised at how big they are less then 2weeks post BMX. A bit tight feeling but not bad. I have 3or so more fills scheduled for each upcoming week. I also got my full pathology yesterday. Instead of the little 5mm DCIS, they found 2.8cm of it! I had little breast tissue before so I would have ended up w a mx regardless. Also, they found multiple groups so microcalcs and atypical cells in the clear side. So glad I did the BMX surgery! Catetz-so glad your exchange went well! And so good to here that the new implants are more soft. And thanks for sharing you post op instructions. Helpful for what is to come. Mimi-wow driving already! I couldn't imagine that yet. I need to get my range of motion back. Allebasi-no surgical bra here. Maybe ask your PS if you can wear a tank or something else instead? I ditched my loose camisole yesterday. Feels good to wear a baggy shirt. The Pink shirts are great bc they have a wide neck and I step into them. Button ups make me feel frumpy. Nelly-I slept on the couch for 1-1/2 weeks bc of the drains. I took the back cushions off so I had a wider space. Then propped my back up w narrow pillows so the drain area was free and nothing rubbed on that area. Hugs- we all know the drains suck. Rosebuds-glad to hear all is going well for your fills. Annie-how are you? Is the side that swelled after drain removal ok? I hope so. I think that is unusual. Have a wonderful Thanksgiving everyone!! Gobble gobble.",
      "MessageIndex": 336,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 18, 2013 03:43PM MCbeach wrote: good luck keets! i am going in on Wed to get 3 or 4 of mine removed these buggers are annoying.",
      "MessageIndex": 238,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 22, 2013 02:12PM MCbeach wrote: ditto, just hydrocodone & cefelexin (antibiotic) here. I am weaning off the hydrocodone w ibuprofen. Feeling the elephant a little more w ibuprofen but not much pain.",
      "MessageIndex": 286,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 30, 2013 09:46AM MCbeach wrote: No stitches to remove here either. I did have to get the steri-strips off though. I just did that in the shower and boy that wasn't fun. I only felt it one one side, but it made me feel squeamish. I got filled last week, 60cc each side so now I am up to 360cc. Felt a small small barely noticeable prick on one side. Didn't feel the fill, just felt tight for about a day. Ibuprofen took care of it. Rosebuds-sorry to hear that the cold bothers you. It's the opposite for me, I can't feel it so have felt more outside than pre BMX.",
      "MessageIndex": 368,
      "PostDate": "30/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Jan 11, 2014 11:27AM MCbeach wrote: mimi32-my exchange is 3/17.  I delayed it since DH and I are going out of the country in March and I didn't want to be \"healing\" while out of the country.  What fill amount are you up to?  I had 300 at Sx then 5 fills at 60 to get me to 600.  Which nearly perfectly matches my before pics, so weird that the PSs can do this. I got released to excercise yesterday (i do hot yoga). Wow does it seem to help.  The iron bra seems to be releasing and is just a bit tight (and numb) now, def tolerable.  Sternum pains seem to be less too.",
      "MessageIndex": 498,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 11, 2013 05:24AM MCbeach wrote: Hi All- Sounds like you are all doing well, for the most part. I read a lot here, but post little. Your posts have really helped me prepare for my BMX surgery this Thursday. Seaniebopp-I also waiver between feeling ok and scared shitless. I think that is to be expected. I pray when I feel really anxious (that seems to calm me). I also read alot of posts. Some make me feel better, some not so much. But it really does make me realize that women are STRONG and this is just a bump in the road. ok maybe a crater but we can do this. Rosebuds, teachingwith, JMfrankel,mimi, (sorry if I missed someone) - so glad that you are doing well. Did you all have the stomache shot? That scares me :( gtgirl-sorry you have to go through this twice. I think that would be hard to do, but it sounds like it is the best plan based on your situation. ((HUGS to you ladies))",
      "MessageIndex": 148,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 19, 2013 01:51PM MCbeach wrote: gtgirl- my drains (4 total) are under my arms toward my back. Small incision and they are stitched in which sometimes pokes. They barely drain, about 5cc/day. One on the hematoma/bleeder side is about 2xs that so still minimal. I'm a little nervous to get them out but it'll be better than having them in. You'll prob get heparin shots (I got 3) to prevent clots. The nurse said they sting bad, but they were ok, not bad. I had the option where to get them, so I got 2 in one arm and one in the thigh. The arm was the best. Just breathe through it and it'll be fine. I hope I'm not rambling too much, just spilling a bit about things I would want to know prior to surgery. I'll be thinking about u tomorrow, try to get some good sleep tonight and post when u are up to it. Hugs.",
      "MessageIndex": 252,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 22, 2013 07:01PM MCbeach wrote: nancyjean-are all your drains out? I had a similar awful pain at the bottom of my TE and after they pulled 2 if my 4 drains, the pain went away.",
      "MessageIndex": 293,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Dec 2, 2013 05:38AM MCbeach wrote: Hi ladies-I discovered something to make the exercises tolerable! Take a warm/hot wet washcloth and place it under each armpit until they turn cold. THEN do arm stretches.it loosens up the muscles so it doesn't pull and hurt. It has helped me so much. I hope it can do the same for you. Mimi68-so jealous to hear you can work-out/run. I miss that. There is no way I could do that yet. Congrats on the NED! I have a similar situation and couldn't be happier.",
      "MessageIndex": 387,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Jan 8, 2014 07:33AM MCbeach wrote: Hi girls-I still get weird pains too, esp at night.    My chest wall just hurts when I first get up, maybe the gravity pull from my TEs.  I also have range of motion but still feel that \"pull\" if I raise my arms too high.  Anyone else still have this?  I am thinking about going to get a myofascial release massage to help.  Did anyone do this? I have not excercised since BMX and feel blah.  I am hoping PS lets me get back to my CPYoga but I'm not sure he will.  I'm also not sure I could do it yet since opening store doors is still a 2 handed thing. Good luck to all of you starting chemo and who are going through radiation.  ",
      "MessageIndex": 492,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "MCbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189910/profile",
      "Content": "Nov 3, 2013 06:07PM MCbeach wrote: Take a deep breath. You can't undo anything. It's ok to research things to prepare yourself for the worst, but hopefully you will not need that. I had a number if bad mamos, they always came back ok. The odds are with you that you will be fine. Hugs and peace to you.",
      "MessageIndex": 1,
      "PostDate": "03/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813986",
      "Title": "just needed to share.... juneping juneping"
    }
  ]
}