{
  "AuthorID": "mccathyg",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116532/profile",
  "Posts": [
    {
      "AuthorID": "mccathyg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116532/profile",
      "Content": "mccathyg wrote: Hi all Just found out that I have a recurrence in my chest wall. The tumour is about 19mm. This is my fourth time with BC so am trying to research what treatment I can have.. Has anyone had a resection of a similar tumour? I am worried because when they biopsied the tumour they pierced my chest wall and I ended up in hospital for a week with a pneumothorax so I am not sure how easy it is to remove a tumour in the chest wall. Anyone had a similar experience? Thanks Dx 8/2000, Left, <1cm, Stage IA, Grade 1, ER+, HER2- Dx 8/2005, Left, <1cm, Stage IA, Grade 1, ER+, HER2- Dx 12/2010, Left, <1cm, Stage IIA, Grade 2, ER+, HER2- Dx 11/2015, Left, 2cm, Stage IIIB, Grade 3, ER+/PR+, HER2- Chemotherapy 2/21/2016 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Hormonal Therapy 5/31/2016 Femara (letrozole) Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy Whole-breast: Breast Surgery Mastectomy: Left Surgery Mastectomy: Left; Reconstruction (left): Latissimus dorsi flap Chemotherapy Cytoxan (cyclophosphamide), Ellence (epirubicin), Fluorouracil (5-fluorouracil, 5-FU, Adrucil) Surgery Lumpectomy: Left Surgery Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836947",
      "Title": "Chest wall tumour mccathyg weesa"
    },
    {
      "AuthorID": "mccathyg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116532/profile",
      "Content": "Nov 27, 2015 06:18AM mccathyg wrote: Thanks for the best wishes ladies. Just been confirmed stage 3b but was glad not to have any mets to distant organs. I have decided to name my BC 'supercell' because whatever I throw at it, it comes back again. It starts getting very surreal when you repeat the process so many times. Sending positive thoughts to everyone just dx, there is always hope and if it returns then there is still lots of hope too x",
      "MessageIndex": 3197,
      "PostDate": "27/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "mccathyg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116532/profile",
      "Content": "Nov 23, 2015 02:57AM mccathyg wrote: Hi everyone. Hope someone can help me with some info. I am just in the middle of dx for what is a recurrence in the chest wall. The tumour is 19mm and is on top of one of my ribs just above my mastectomy scar. As this is my 4th dx I like to try and research as much as possible. Has anyone had surgery to remove a lump in the chest wall? I am worried because when they did the biopsy the chest wall was punctured and I ended up in hospital for a week. Thank",
      "MessageIndex": 3184,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}