{
  "AuthorID": "Mdempsey",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74986/profile",
  "Posts": [
    {
      "AuthorID": "Mdempsey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74986/profile",
      "Content": "Jul 29, 2013 04:29PM Mdempsey wrote: Thank you so much for replying to me!  I do still see my oncologist, however she doesn't know about my arm and leg pain yet nor about my dad just being diagnosed with cancer.  Thank you for your help :)",
      "MessageIndex": 2,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/808491",
      "Title": "Worried!!! Mdempsey Mdempsey"
    },
    {
      "AuthorID": "Mdempsey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74986/profile",
      "Content": "Mdempsey wrote: Hello,  I'm a 35 year old single mother that has just been diagnosed with breast cancer.  My story begins 3 weeks ago when I found the lump at 10:00 in my left breast.  I immediately was sent for a mammogram (which I had never had before) and it showed up, so I was asked to stay at the hospital and have an ultrasound.  The ultrasound showed the mass at 10:00 (1.4 cm) along with 3 other spots at 12:00, 2:00 and 6:00 (all mm size).  The mass was solid with no fluid, irregular borders and not moveable.  The report stated it was suspicious for carcinoma.  I was then sent to a surgeon to evaluate.  He told me the same thing that the ultrasound report showed and referred me for a ultrasound biopsy.  I had this done Nov. 12th and found out Nov. 14th.  I called to get the results yesterday and the doctor told me that it was breast cancer, it was smaller that 2cm and that we would have to attack it aggresively.  I already had an appt. scheduled with him on Nov. 18th.  He said we would go over all my options then.  He did state that surgery would have to be done along with immediate radiation, but as of now that's all I know.  We have no history in my family of breast cancer.  My mother did have a hard cyst removed years ago and it was benign.  She just had a mammogram that has come back showing 5 total.  Hers cannot be felt and show to be that same thing she had before - but not sure yet.  I have 2 sisters that haven't showed any problems and now I'm so concerned about my 12 year old daughter.  I apologize for rambling, but I'm so scared and so afraid of what lies ahead for me.  I wanted to talk to someone that has been there and knows how I'm feeling right now.  Thanks for listening!!!  Melissa Surgery 12/1/2008 Lumpectomy: Left; Lymph node removal: Sentinel Chemotherapy 1/12/2009 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 4/20/2009 Breast Hormonal Therapy 6/15/2009 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Hormonal Therapy 12/2/2010 Femara (letrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724504",
      "Title": "Just Diagnosed Mdempsey shanda"
    },
    {
      "AuthorID": "Mdempsey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74986/profile",
      "Content": "Nov 16, 2008 09:04AM Mdempsey wrote: Tammie, Thanks so much for responding to me.  This is all so new and so scary.  I'm on a huge emotional roller coaster now and just like you I think the worst.  One of my many concerns is my daughter.  We are very close and I'm the one that has always been there for her.  She knows everything except that I have now been diagnosed with breast cancer.  Chris and I plan to tell her tonight.  I'm afraid of telling her because I'm afraid I won't be strong.  I really need to be strong when I tell her because if she sees me break then so will she.  I don't want her to worry about anything.  I am so anxious about Tuesday when I find out everything.  I'm not sure what kind of surgery I'm having, if it's in my lymph nodes, or what.  My sisters, mom, dad and Chris all want to go with me.  It's hard to stay positive and really that's all you hear from people, but my word that's the hardest thing to do.  Like you, I think once my treatment plan is in place I will start to feel better.  I will be praying for you and I'm here for you too if you need to talk.  It always helps me to talk about it, especially with people that are going thru the same thing. Hugs and Prayers to everyone dealing with this!",
      "MessageIndex": 9,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724504",
      "Title": "Just Diagnosed Mdempsey shanda"
    },
    {
      "AuthorID": "Mdempsey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74986/profile",
      "Content": "Nov 16, 2008 09:14AM Mdempsey wrote: Shanda, I believe we both are in the same boat, not knowing what happens next.  Please keep me posted on everything with you and together maybe we can help each other get thru this.  Thanks for listening to my story and you are in my thoughts and prayers.  I hope to talk to you soon. Thinking of you!",
      "MessageIndex": 10,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724504",
      "Title": "Just Diagnosed Mdempsey shanda"
    },
    {
      "AuthorID": "Mdempsey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74986/profile",
      "Content": "Mdempsey wrote: Hello, my name is Melissa.  A little about my journey.  I was diagnosed with Breast Cancer in 2008 at age 35.  The cancer was stage 1 with no lymph node involvement.  My cancer was aggressive.  I had a partial mastectomy, 33 radiation treatments and chemotherapy.  I continue to be on Femara and am having Zometa treatments every six months.  The oncologist was concerned about a distant cancer. I was the first in my family (paternal & maternal) to have any type of cancer.  My mother was diagnosed a year later with breast cancer.  Now my father has been diagnosed with sqaumous cell cancer of the tongue.  So now I'm an absolute basket case!!!  To top it off, I am having pain in my right arm and right leg.  The pain is now constant in my arm and sporadic in my leg.  The pain has recently woke me up during the night.  Now all I can think about is bone cancer.  I've tried researching the relation between all of this.  I guess I'm just wondering if anyone has a similar story or could relate in any way.  Thank you for listening!!! Melissa Surgery 12/1/2008 Lumpectomy: Left; Lymph node removal: Sentinel Chemotherapy 1/12/2009 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 4/20/2009 Breast Hormonal Therapy 6/15/2009 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Hormonal Therapy 12/2/2010 Femara (letrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/808491",
      "Title": "Worried!!! Mdempsey Mdempsey"
    }
  ]
}