{
  "AuthorID": "mdwriter",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104277/profile",
  "Posts": [
    {
      "AuthorID": "mdwriter",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104277/profile",
      "Content": "Jul 20, 2010 07:54AM mdwriter wrote: Posted elsewhere, but here is summary. After reading about Dr. Lagios here, I had him review my path slides after my lumpectomy June 22, 2010 with SNB which showed DCIS low-int grade, negative nodes, wide clear margins, etc- with VNPI (prognostic index developed by Dr. Mel Silverstein)of 5. He recommended No radiation and No Tamoxifen or aromatase inhibitor. He also suggested follow-up RODEO MRI which is a dedicated MRI with an algorithm that apparently gives a more specific and sensitive picture. Developed by Dr. Steve Harms in Arkansas, but there are now more machines around the country- Google Aurora RODEO MRI. Now I am waiting for my follow-up baseline mammogram (my mammo in April showed nothing), ultrasound (that's how this was picked up after my GYN felt a suspicious area in June) and MRI.",
      "MessageIndex": 14,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/682418",
      "Title": "anyone with low grade dcis not having radiation joe1234 ballet12"
    },
    {
      "AuthorID": "mdwriter",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104277/profile",
      "Content": "Jul 20, 2010 02:14PM mdwriter wrote:",
      "MessageIndex": 15,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/682418",
      "Title": "anyone with low grade dcis not having radiation joe1234 ballet12"
    },
    {
      "AuthorID": "mdwriter",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104277/profile",
      "Content": "Sep 9, 2010 10:49PM mdwriter wrote: Monica Long had expected a routine appointment. But here she was sitting in her new oncologist’s office, and he was delivering deeply disturbing news. Nearly a year earlier, in 2007, a pathologist at a small hospital in Cheboygan, Mich., had found the earliest stage of breast cancer from a biopsy. Extensive surgery followed, leaving Ms. Long’s right breast missing a golf-ball-size chunk. Now she was being told the pathologist had made a mistake. Her new doctor was certain she never had the disease, called ductal carcinoma in situ, or D.C.I.S. It had all been unnecessary — the surgery, the radiation, the drugs and, worst of all, the fear. “Psychologically, it’s horrible,” Ms. Long said. “I never should have had to go through what I did.” Like most women, Ms. Long had regarded the breast biopsy as the gold standard, an infallible way to identify cancer. “I thought it was pretty cut and dried,” said Ms. Long, who is a registered nurse. As it turns out, diagnosing the earliest stage of breast cancer can be surprisingly difficult, prone to both outright error and case-by-case disagreement over whether a cluster of cells is benign or malignant, according to an examination of breast cancer cases by The New York Times. Advances in mammography and other imaging technology over the past 30 years have meant that pathologists must render opinions on ever smaller breast lesions, some the size of a few grains of salt. Discerning the difference between some benign lesions and early stage breast cancer is a particularly challenging area of pathology, according to medical records and interviews with doctors and patients. Diagnosing D.C.I.S. “is a 30-year history of confusion, differences of opinion and under- and overtreatment,” said Dr. Shahla Masood, the head of pathology at the University of Florida College of Medicine in Jacksonville. “There are studies that show that diagnosing these borderline breast lesions occasionally comes down to the flip of a coin.” There is an increasing recognition of the problems, and the federal government is now financing a nationwide study of variations in breast pathology, based on concerns that 17 percent of D.C.I.S. cases identified by a commonly used needle biopsy may be misdiagnosed. Despite this, there are no mandated diagnostic standards or requirements that pathologists performing the work have any specialized expertise, meaning that the chances of getting an accurate diagnosis vary from hospital to hospital. Dr. Linh Vi, the pathologist at Cheboygan Memorial Hospital who diagnosed D.C.I.S. in Ms. Long, was not board certified and has said he reads about 50 breast biopsies a year, far short of the experience that leading pathologists say is needed in dealing with the nuances of difficult breast cancer cases. In responding to a lawsuit brought by Ms. Long, Dr. Vi maintains that she had cancer and that two board-certified pathologists at a neighboring hospital concurred with his diagnosis. Yet several leading experts who reviewed Ms. Long’s case disagreed, with one saying flatly that her local pathologists “blew the diagnosis.” The questions that often surround D.C.I.S. diagnoses take on added significance when combined with criticism that it is both overdiagnosed and overtreated in the United States — concerns that helped fuel the recent controversy over the routine use of mammograms for women in their 40s. The United States Preventive Services Task Force, an independent panel that issues guidelines on cancer screening, found last November that the downside of routine annual mammograms for younger women might offset the benefits of early detection. The panel specifically referred to overdiagnosis of D.C.I.S., as well as benign but atypical breast lesions that left undetected would never cause problems. D.C.I.S., which is also called Stage 0 or noninvasive cancer, was a rare diagnosis before mammograms began to be widely used in the 1980s. Until then, breast pathology typically involved reading tissue from palpable lumps. The diagnoses — usually invasive cancer, a benign fibroid tumor or a cyst — were often obvious. Today, D.C.I.S. is diagnosed in more than 50,000 women a year in this country alone. The abnormal cells, which are encased in breast ducts, are removed before they develop into invasive cancer. There are estimates that if left untreated, it will turn into invasive cancer 30 percent of the time, though it could take decades in some cases. Concerned about the accuracy of breast pathology, the College of American Pathologists said it would start a voluntary certification program for pathologists who read breast tissue. Among its requirements is that the pathologists must read 250 breast cases a year. “There’s no question there’s a problem, and that’s why we’re starting this certificate program,” said Dr. James L. Connolly, director of anatomic pathology at Beth Israel Deaconess Medical Center in Boston. While the program has not started yet, it is still controversial. With hundreds of thousands of breast biopsies performed in this country a year, some pathologists stand to lose business, Dr. Connolly said, if doctors and patients demand that their slides go to a certified pathologist. Cases like Ms. Long’s may be extreme examples, but tracing her story shows why doctors increasingly say that a woman’s initial reaction to a diagnosis of D.C.I.S. should be caution rather than a rush to disfiguring surgery or potentially harmful radiation. Dr. Dennis Citrin, the oncologist at Midwestern Regional Medical Center in Zion, Ill., who told Ms. Long that she did not have D.C.I.S., said efforts to identify cancer at its earliest stages could benefit patients but also create problems. “We’re now trying to move the goal post if you like,” Dr. Citrin said. “We’re trying to make a diagnosis at an earlier and earlier stage. There are going to be patients where there’s confusion or difference of opinion in this spectrum of changes, the earlier that you move in the process. So that’s why there are cases like Monica’s.” ‘Shock and Disbelief’ Tiny Cheboygan Memorial Hospital, a 46-bed facility in rural northern Michigan, is far from any major cancer center. Its patients are mostly elderly and suffering from cardiovascular problems and diabetes. Monica Long helped take care of them, working as a nurse on the night shift. In March 2007, Ms. Long, then 49, went for her annual mammogram, which showed a shadow of about one centimeter in her right breast. A biopsy followed and the results were sent to Dr. Vi, the only pathologist at Cheboygan and, in fact, in the entire county. Dr. Vi had started at Cheboygan in 2003 after a journey that began with medical school in Vietnam, where he grew up. He ran the hospital’s pathology department even though he had not passed either part of the exam to become board certified until 2008, a year after he gave Ms. Long her diagnosis. In a deposition, Dr. Vi said he had taken one portion of the test “several times” before passing, but he did not remember how many. Of the hundreds of thousands of breast biopsies that are performed every year in the United States, many are conducted in community hospitals. Like Dr. Vi, many general pathologists in small practices do not have extensive exposure to D.C.I.S. and other atypical breast lesions. Just over a week after Ms. Long’s biopsy, the pathology report from Dr. Vi came back as ductal carcinoma in situ. “I was in shock and disbelief,” said Ms. Long, a whippet-thin workout fanatic and divorced mother of three daughters. “Everybody thinks it’s not going to happen to you. Then I got kind of scared. You hear the word cancer. When people are told you have cancer, I swear they look at you differently.” Ms. Long was given two options: a mastectomy or a procedure called a quadrantectomy — removal of one-fourth of the breast — followed by six weeks of radiation. “I decided to do the quadrantectomy, and hope for the best,” she said. Before Ms. Long’s surgery, Dr. Vi sent her slides for a second opinion to pathologists at Northern Michigan Regional Hospital in the larger nearby town of Petoskey, Mich. In a brief interview, Dr. Vi characterized D.C.I.S. diagnosis as a “gray zone” and declined to comment on the Long case. The Petoskey practice — including a board-certified pathologist named Dr. Noel Ceniza — was already fielding complaints from another patient, Barbara Stachak. In 2005, Dr. Ceniza reported that Ms. Stachak’s biopsy contained cells consistent with breast cancer, prompting a chain of events that led to the removal of a large portion of Ms. Stachak’s breast. After that surgery and further testing, Dr. Ceniza revised the diagnosis to a less serious finding. “I just felt so violated,” Ms. Stachak said recently. She lost a lawsuit against Dr. Ceniza in 2009, after his lawyer argued that he had not departed from the standard of care. When the Petoskey pathologists got Ms. Long’s slides, they partly disagreed with Dr. Vi. He had found two forms of D.C.I.S., called solid and cribriform. In solid D.C.I.S., cancer cells completely fill the affected ducts. In cribriform, there are gaps between the cells. Dr. Ceniza and a partner instead found another form of the disease, in which the cells are arranged in a fern-like pattern. A lawyer for Ms. Long, Brian McKeen of Detroit, said that Dr. Vi “could easily have sent the slides to any number of known and notable breast pathology specialists for a second opinion.” Asked in a deposition why he did not send Ms. Long’s slides to a breast specialist, Dr. Vi hinted at financial constraints. When a pathologist sends out a slide for consultation, the hospital, not the patient, is frequently billed. The Petoskey doctors had agreed to provide free consultations. In a statement, lawyers for the Petoskey doctors denied that there was any malpractice in Ms. Long’s treatment, citing reports in medical literature of a “wide array of variability” in interpreting breast pathology. “It is not a breach of the standard of care for one pathologist to have one opinion and another competent pathologist to have another opinion,” the lawyers said. In June, six weeks after her surgery — the removal of one-fourth of her breast — Ms. Long began radiation treatments. Misdiagnoses Identified In 2006, Susan G. Komen for the Cure, an influential breast cancer survivors’ organization, released a startling study. It estimated that in 90,000 cases, women who receive a diagnosis of D.C.I.S. or invasive breast cancer either did not have the disease or their pathologist made another error that resulted in incorrect treatment. After the Komen report, the College of American Pathologists announced several steps to improve breast cancer diagnosis, including the certification program for pathologists. For the medical community, the Komen findings were not surprising, since the risk of misdiagnosis had been widely written about in medical literature. One study in 2002, by doctors at Northwestern University Medical Center, reviewed the pathology in 340 breast cancer cases and found that 7.8 percent of them had errors serious enough to change plans for surgery. Yet some pathologists have found the response to these types of studies slow and inadequate. “To recognize the problem requires you to acknowledge that there’s room for improvement and that some of your colleagues are not really making the correct diagnosis,” said Dr. Michael Lagios, a California pathologist who was a consultant on the Komen report. To diagnose a breast cancer, pathologists look at slides mounted with thin slices of breast tissue. The slides are stained with a purplish dye that highlights patterns of circles and dots, each representing a cell, its nucleus and membrane. The diagnosis turns on the appearance of these cells under a microscope. At larger hospitals, the findings are often presented to a tumor board, in which a team of doctors from various disciplines reviews the pathology report and develops a treatment plan. A number of pathology practices around the country also specialize in rendering second opinions. Dr. Lagios, a pathologist at St. Mary’s Medical Center in San Francisco, reviews slides for women who want a second opinion. And what he finds concerns him. In 2007 and 2008, he reviewed 597 breast cases and found discrepancies in 141 of them, including 27 cases where D.C.I.S. was misdiagnosed. Dr. Lagios says that based on his experience, microscopic core needle biopsies of low-grade D.C.I.S. and benign lesions, called atypical ductal hyperplasia, or A.D.H., may be misread 20 percent of the time. Beyond diagnostic errors, there are different schools of thought about what constitutes D.C.I.S. Variations in diagnoses may depend partly on where a woman is treated. In San Francisco, Dr. Lagios uses a criterion that says some breast lesions under two millimeters are not D.C.I.S., even if they have the other markers of the condition. At Beth Israel Deaconess Medical Center in Boston, also renowned for its breast pathology services, those lesions are considered D.C.I.S., according to Dr. Connolly. Dr. Lagios says he frequently talks to patients who are struggling to make sense of several different opinions. “This leaves the woman totally confused,” he said. Response and Regret Fear compounds the confusion, and even though D.C.I.S. is 90 percent curable, there is growing concern that women and their doctors opt for more aggressive surgery, radiation and drug therapy than is needed. A mastectomy is sometimes offered as an option for D.C.I.S., although experts say it is usually not advisable unless the D.C.I.S. is large or appears in several sites in the breast. Yet more women who are faced with the diagnosis of D.C.I.S. become so fearful that they elect to have both breasts removed, often against their doctor’s recommendations. “The patient gets paralyzed with a fear of cancer,” Dr. Masood said. “They want the breast off.” Among women who had surgery for D.C.I.S., the rate of double mastectomy rose to 5 percent in 2005, from 2 percent in 1998, according to a study last year. Dr. Ira J. Bleiweiss, chief of surgical pathology at Mount Sinai Medical Center in New York, said that ideally, all breast cancer diagnoses would be referred for a second opinion. He warns patients and their doctors: “Don’t rush to the operating room.” That is just what Stacie Hintz did after a diagnosis of D.C.I.S. in Colorado Springs in 2004. After both her breasts were removed, she was told that her initial pathology — which found an aggressive type of D.C.I.S. — was incorrect. “I was pretty scared at the time,” said Ms. Hintz, who cares for disabled adults. “My daughter was 2 years old. The state of mind that I was in was saying, ‘I need to live to raise my daughter — just do what you need to do.’ “ Ms. Hintz later moved to Denver and, like Ms. Long, sought follow-up care at a larger facility, the University of Colorado Health Sciences Center, according to her lawyer, Linda Chalat. To manage her case, doctors at the University of Colorado asked for slides from her previous doctors. Several weeks later, Ms. Hintz received a letter from her new doctors. “It said we’ve reviewed these slides and we’ve found no cancer,” she said. “I’m standing there, in shock.” Ms. Hintz later reached a settlement with the pathology group that had given her the diagnosis. Dr. Masood says that since there is no mechanism for reporting errors, some women find out by accident that their diagnoses were wrong. An exception is Janice Fenwick, a retired asset manager for the Marines, who was told she had D.C.I.S. in April 2009. That summer, after she had a partial mastectomy and began radiation treatment, the V.A. Medical Center in West Palm Beach, Fla., told her the diagnosis was incorrect, Ms. Fenwick said. In her case, though, there are questions whether that notification could have come sooner. After the surgery, both a Quest Diagnostics laboratory and the Armed Forces Institute of Pathology in Washington were unable to find any cancer in the portion of her breast that had been removed, she said. As early as June 9 — before Ms. Fenwick began radiation — the Armed Forces Institute of Pathology asked to see the slides from the original biopsy, according to information she obtained. Ms. Fenwick said she had completed two-thirds of her radiation treatments by the time she received a telephone call from her oncologist. “We have troubling news to tell you,” her oncologist said. “You don’t have cancer and you never did.” The institute disputed the original diagnosis, conducted at the West Palm Beach V.A. Medical Center, she said. “I was kind of beside myself.” Ms. Fenwick, 50, said a V.A. official later apologized and said the agency would look into using outside experts for breast biopsies because the hospital did not treat many breast cancer cases. Sean Cronin, a lawyer representing Ms. Fenwick in a lawsuit against the V.A., said he was troubled that she had received radiation even after questions were raised about her diagnosis. The hospital would not comment on Ms. Fenwick’s case. Its director, Charleen R. Szabo, said in a statement: “Medicine is not an exact science. Treatment options are based on information available at a period in time. When additional information comes to light, altering the course of treatment may become necessary.” A Nurse Is a Patient Just as the course of history can turn on minor events, Monica Long’s life — and her status as a cancer patient — was altered by a high school reunion. She rekindled an old flirtation at the gathering, then followed her new beau to Illinois from Michigan, where she went to work as a nurse at the Midwestern Regional Medical Center. As an employee at the hospital, a division of Cancer Treatment Centers of America, Ms. Long decided to follow up her breast care with Dr. Citrin. Following hospital policy for new patients, doctors reviewed her pathology and saw no evidence of D.C.I.S. For confirmation, they sent the slides to the Mayo Clinic, which also found a benign condition. When Ms. Long appeared in Dr. Citrin’s office two days later, he told her about the findings. “What makes you right and them wrong?” Ms. Long demanded. Dr. Lagios, retained as a plaintiff’s expert by Ms. Long, also found the lesion to be benign. In fact, a pathology expert hired by the defense agreed, but said the misdiagnosis was reasonable, given the difficult nature of this area of pathology. Since her surgery, Ms. Long has struggled with a range of emotions — relief, anger and guilt. As a nurse in a cancer hospital, she encounters many people who are caught in the disease’s maw. Ms. Long says they provide constant reminders of how fortunate she is. Yet, there is another reminder every time she takes a shower — the disfiguring results of her surgery. “I think you could handle the disfigurement a little bit more if there’s a real purpose for it,” Ms. Long said. “The tough part is to find out later that I didn’t need it, and I never did.”   Shayla Harris contributed reporting.  ",
      "MessageIndex": 19,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/682418",
      "Title": "anyone with low grade dcis not having radiation joe1234 ballet12"
    }
  ]
}