{
  "AuthorID": "Meadow",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
  "Posts": [
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 21, 2016 05:54PM Meadow wrote: You should call the nurse to have her ask the Onc before you take anything, even over the counter meds and herbals, just to be sure. Just as the Claritan has been found to be very useful, others hinder chemo and its effects. I bet benadryl is ok, as it is giving by IV during chemo, but check with the team to be sure. Hugs to you!",
      "MessageIndex": 1,
      "PostDate": "21/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/842379",
      "Title": "Neulesta and Claritin phaila Artista928"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 4, 2015 07:25AM - edited May 4, 2015 07:30AM by Meadow Yes Nance, normal...but maybe some lymphedema too, since you have had those nodes removed, the path that your lymph fluid takes has been disrupted, and has to find a new path or you get blocked up with fluid, and have swelling. Have you popped in on the lymphedema boards here on BCO? the sisters that post there are extremely knowlegdable about this topic, and canoffer some good advice. there are gentle massages you can do to stimulate the flow of fluid again. If you are have some Lymphedema (LE) you must stay on top of it as it can become quite serious, and chronic. Have you called the docs office and spoken to the nurse? Sometimes tis is a good idea.",
      "MessageIndex": 1,
      "PostDate": "04/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/831014",
      "Title": "Swelling armpits after Sentinel Node Dissection Nancdancer Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 7, 2015 08:34PM Meadow wrote: Bumping again for responses to your questions",
      "MessageIndex": 3,
      "PostDate": "07/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835556",
      "Title": "lump under nipple on left breast caprivaida caprivaida"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 26, 2015 08:30AM Meadow wrote: Bear, this is a great question. I follow a thread here on BCO where some of the sisters are working with a company to help design a compression t shirt, to help with this issue, and lymphedema, that thread is....just a second I have to go look it up! ",
      "MessageIndex": 1,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/829910",
      "Title": "Need a Product Suggestion Bearhitch Jennie93"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 26, 2015 08:34AM Meadow wrote: ......Shirt design for Lymphedema.....in the Lymphedema forum. You should check it out, they have brand suggestions. Good Luck!",
      "MessageIndex": 2,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/829910",
      "Title": "Need a Product Suggestion Bearhitch Jennie93"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 24, 2015 08:42AM Meadow wrote: Chris, Brothers can be such a pain, and heartache. I am SO SORRY you are sad. I think you are on the right idea, do not let his words hurt you. Our families can make us feel so badly sometimes, and with you fighting cancer, you just do not want to use energy for strife. Please focus on yourself right now, let go of the frustration with him. The negative energy will make you feel worse. Just know he is wrong, and let it go. Again, so sorry for your stress.",
      "MessageIndex": 1,
      "PostDate": "24/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829822",
      "Title": "what a mess chris1959 AmyQ"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 7, 2016 10:56AM Meadow wrote: Ray, so sorry you are going through this. I am glad you are going to a specialist, and the waiting is SO HARD. If it were me, I would probably try to push for a sooner appointment, not because you are in immediate danger or anything, it is just that 3 weeks can be agony to wait. Keep us posted on what you find out, and my best to you always.",
      "MessageIndex": 1,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841104",
      "Title": "Urgent advice needed please. Ray1974"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 8, 2016 10:43AM Meadow wrote: yes please update as soon as you can. We have a sayingaround here, \"in your pocket \", I am with you in your pocket today!",
      "MessageIndex": 9,
      "PostDate": "08/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841104",
      "Title": "Urgent advice needed please. Ray1974"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 6, 2015 02:19PM Meadow wrote: Feathers, I would say the same things apply to you too, as we discussed above. I am glad you called your doctor. Stay on top of any swelling, check out the above posts. Hugs to you! ",
      "MessageIndex": 6,
      "PostDate": "06/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/831014",
      "Title": "Swelling armpits after Sentinel Node Dissection Nancdancer Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 6, 2015 05:59PM Meadow wrote: Capri, I am not the best at reading the reports either...I am bumping your question to the top of the active threads so hopefully someone will answer soon. Your question of \"Could I have breast cancer and the mammo not pick it up\"...the answer is yes. Mammogram is often not the best diagnostic tool, I am glad you are having an ultrasound, Do not worry right now, just love up on those babies. No sense in letting worry rob you and your little ones of joy before you have answers. We have breast changes our whole lives and more times than not changes and concerns are benign. With your family history you must stay aware of anything suspicious, as you are doing. Please update us when you do have more info. Hugs to you",
      "MessageIndex": 1,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835556",
      "Title": "lump under nipple on left breast caprivaida caprivaida"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 29, 2016 07:04PM Meadow wrote: Simple, I am thinking so many things...I want to encourage you that it will be ok. Everything is different after surgery, and yet...everything still is the same. You are still you. Your body is different, but you are still you. You are making a dramatic change to your body to save your life...it is worth it. You can do this. You are strong. Please know you will be sore for several days. Just opening the refrigerator door was hard work. Sitting in a recliner may be more comfortable than being in bed for a few days.; Drains are a nuisance but it is brief. Pillows Pillows Pillows!. Drink lots of water. Please check in soon so we can know how you are. Hugs to you.",
      "MessageIndex": 1,
      "PostDate": "29/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/842606",
      "Title": "Surgery tomorrow Simple13 Lind_z"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 5, 2016 06:15PM Meadow wrote: Simple, my internet was down, sorry I have not checked in, hoping you are resting comfortably.",
      "MessageIndex": 8,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/842606",
      "Title": "Surgery tomorrow Simple13 Lind_z"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 8, 2016 06:43PM Meadow wrote: lind z, you have lymph edema in that area, and it can become chronic. There is a forum here on BCO with some VERY knowledgeable ladies who can help. PLEASE go there and let them give you some help. There are massage techniques to help the fluid flow out of that area.",
      "MessageIndex": 17,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/842606",
      "Title": "Surgery tomorrow Simple13 Lind_z"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Aug 27, 2014 04:24PM Meadow wrote: ",
      "MessageIndex": 34,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823831",
      "Title": "First Puketober sitings! surfdreams sas-schatzi"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 14, 2015 07:01PM Meadow wrote: ha!",
      "MessageIndex": 6,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830425",
      "Title": "BMX w/ direct implants (hopefully) next week. What to expect? tara_ tara_"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Aug 27, 2014 03:45PM Meadow wrote: I don't want to make waves but I just want to say that without the funds raised by all the pink ribbon events, I probably wouldn't be alive today....my cancer does not receive a large portion of funds for research, and it is rare, aggressive, and statistically a poor prognosis. I am thankful to God for the funds raised, the research and awareness.  But that is just me. I fully understand that a pink volleyball t shirt with the logo \"Dig for a Cure\" is cause for an eye roll. And that Mammo Grams picture above...hilarious!  But I appreciate the bottom line.  Now please dont yell at me! I love you all!",
      "MessageIndex": 32,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823831",
      "Title": "First Puketober sitings! surfdreams sas-schatzi"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 14, 2015 06:29PM Meadow wrote: Jilly, I agree, the need for space! And SpecialK, I had forgotten about the straws and lids on cups. Eliminates the motion of sitting up to drink....yes",
      "MessageIndex": 4,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830425",
      "Title": "BMX w/ direct implants (hopefully) next week. What to expect? tara_ tara_"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 28, 2015 06:49PM Meadow wrote: Tara, hoping you can check in soon and let us know how you are getting along. Hoping healing is going well.",
      "MessageIndex": 9,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830425",
      "Title": "BMX w/ direct implants (hopefully) next week. What to expect? tara_ tara_"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 14, 2015 02:41PM - edited Apr 14, 2015 03:02PM by Meadow Tara, best wishes to you for a speedy recovery. I will do my best to answer your questions and give you a heads up on some things. 1. You will be fine the second week. You will need help the first week as you would after any major surgery. My mother in law stayed four days with me after surgery, oh my gosh loved it, love her. She was a big help in changing the dressings around the drains.Plus meal preparation, bathing, just getting a drink, is a challenge the first few days. Pulling open the freezer...thats a no no. Your movements will be limited the first few days but improve daily. The drains are what will give you the most fits....you will have long tubes (I had 3 drains, 2 on my affected side, one on the other). The fluid has to be drained out of the pouches several times a day. You will rejoice when they are out!. I could empty them myself, but it was nice to have help with the bandages. 2. Pain was not a problem for me, I did take pain meds. Just stay ahead of it. Take the pain meds, not a time to be a suffering hero! 3. I was up and around, but not really doing anything around the house at all the first week, and much more normal, I mean super light stuff, the second week. Nothing that involves upper body strength for sure. No laundry, no vaccuum, no groceries. Just lifting your arms will be difficult. Your implants will probably be under the chest pectoral muscles, this feels very strange at first, but your implants will settle and it wont feel so odd later. But you will have no strength up top at first, at least I didnt. 4. Get lots of pillows! Some ladies (me included) found the recliner more comfy than the bed. Do not hesitate to ask for help putting the foot rest down. When in bed I looked like a pampered princess, pillows everywhere! I cannot stress the importance of multiple pillows enough! Rest Rest. And check in your handout info when discharged, you will be given a sheet of range of motion exercises to start after a few days, I found this to be very important to do, as you heal the skin and muscles get super tight. Do not start until your doc says to though. The excercises are very simple and keep you stretched out. Get a zip hoodie, as you will NOT be putting anything on over your head...a hoodie or light jacket with pockets in it. I wore mine inside out so the pockets were next to my body, and I put my lovely drains in the pockets. Hopefully you will get more tips on managing the drains in clothes, dont get discouraged with them, but they kinda suck. Anyone else have tips for her? Keep us posted and hugs to you as you have surgery. ",
      "MessageIndex": 1,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830425",
      "Title": "BMX w/ direct implants (hopefully) next week. What to expect? tara_ tara_"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 18, 2015 06:58PM Meadow wrote: I am glad it helped some, Love! All my best wishes and prayers for you",
      "MessageIndex": 8,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830425",
      "Title": "BMX w/ direct implants (hopefully) next week. What to expect? tara_ tara_"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 8, 2016 05:36PM Meadow wrote: ts, I cannot answer your question as I have not had this surgery. I hope you do get other responses soon. I do hope your surgery goes well tomorrow, and I am sending up a prayer for you and a calm spirit. Please udate when you can. Hugs!",
      "MessageIndex": 1,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/842011",
      "Title": "Papilloma surgery ts2320 ts2320"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 4, 2015 08:34PM Meadow wrote: Coachbarb, welcome!, Yes, you have found a place where we \"get\" it! Hopefully you will find tons of support and information here. Plus the nicest people are here on these boards. It is a good place to land. You are posting this question in the surgery forum, but I want to make sure I am answering you correctly...you are asking about chemo tips right? Not a problem just want to make sure I follow. Your surgery date was originally Oct 15, then chemo after? Chemo is very do able. Is your health good, besides having BC? you will feel better of course if your overall health is good going into chemo. For good mouth protection from sores, I kept a small container at my kitchen window that contained a dry mixture of baking soda and salt, and I could put a spoon of that in a glass of warm water and swish and spit while I did the dishes or was in the kitchen. This made it easy as it was ready for me, and I never had a prob with sores. For surgery and chemo, I have one word...pillows. I cannot stress the importance of pillows enough. You know that fluffy pink pillow you always wanted at walmart but never really NEEDED it? Nows the time. I put pilows all around me in bed, You can hardly see me for them. But they make comfort more..just more I guess! I know there are other tips too, maybe someone else can share their thoughts. As far as telling the family, I see your name is \"Coachbarb\" which tells me you probably are accustomed to a team. You will hopefully have a team during this, a team of health care providers, and support at home from friends and loved ones. We here on this website are a part of that support team too. But this is a different kind of team than we have ever played on. It centers around you. So if you want to wait till after the trip, do so. If it means everyone has a better time not stressing and crying, then wait. But if you need their support now...dont wait do what YOU need to do. They hopefully will get on board soon, not be sad and distraught, for you need positive thoughts now. A positive outlook means so much in your healing. Thinking of you!",
      "MessageIndex": 1,
      "PostDate": "04/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/835513",
      "Title": "What do I need on hand for chemo side effects Coachbarb WinningSoFar"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 28, 2015 08:48PM Meadow wrote: Terrymay, I am so very sorry you lost your husband. And I am sorry you have been diagnosed with BC. Please know that you have a sisterhood here on this website that will be with you as long as you want, day or night. I hope you get a chance to explore around...there are so many interesting threads, and so much support. Do not despair, you do not have to go through this alone. Does your medical center offer support meetings? Or connect people with breast cancer diagnosis? You can start a thread here and ask something like. \"Anyone diagnosed near (insert your home location)\". I have seen several threads like that. My best to you and a big old cyber hug. Hang in there.",
      "MessageIndex": 3,
      "PostDate": "28/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/836234",
      "Title": "On my own, just diagnosed. Husband died of cancer 18 months ago. terrymay Lily55"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Aug 18, 2016 06:19AM Meadow wrote: following this thread, as I had recon with a silicon implant, then rads. I did this because I was rolling the dice, hoping not to have encapsulation. I do have moderate to slight severe encapsulaton, of course. I am wanting to exchange this implant (not soon), hoping the surgeon can break up scar tissue, and I will be happier and more comfortable, and more symmetrical. I seem to be an optimist!",
      "MessageIndex": 2,
      "PostDate": "18/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/847031",
      "Title": "Implants after Radiation Therapy DakotaGirl BayouBabe"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 4, 2016 06:58PM Meadow wrote: I would guess...and mind you, I am not in a position to know (you must know that right) as I am not medical and have never seen the spot.....this does not sound like IBC at all to me.",
      "MessageIndex": 12,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840672",
      "Title": "Faint(pink) redness on left breast for 5 months.. aliciado santabarbarian"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 7, 2016 07:41PM Meadow wrote: Aliciado, you have been told again, that your breast i ok. I am curious why you cannot trust your Doctors (7 of them)??? Do you think it could be a faint birthmark? Do you have other anxiety issues? While we must trust our gut feelings when we know something is wrong, I am wondering if you are being reasonable since you have been to so many Docs. Maybe it is time to relax and move on, watching for changes.",
      "MessageIndex": 23,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840672",
      "Title": "Faint(pink) redness on left breast for 5 months.. aliciado santabarbarian"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 3, 2015 08:54PM Meadow wrote: because cancer is harsh enough, we all need a soft spot to land. Did not mean to stir anyone's pot. Moving on....",
      "MessageIndex": 15,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823378",
      "Title": "What treatments did you start with? Lindseyc Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 3, 2016 02:00AM - edited Feb 4, 2016 06:55PM by Meadow Hi, are you having any other breast changes? Heat, swelling, pain? I agree, most doctors have never or will never see IBC, and it can be difficult to diagnose. It does show up very well on ultrasound. So the fact you did have a clean ultrasound is good. My first symptom of my IBC was a very itchy, painful breast. But this is not the same for everyone, some people do not have any itch or redness or pain. The sore lymph nodes in your neck tell us that something is going on...but IBC is rare, and progresses rapidly, sometimes symptoms progress overnight. Have you been seen by a breast specialist? 6 doctors is A LOT of doctors to have been consulted, and yet you still have unanswered concerns. We cannot tell you what is going on, of course, only share our experiences and encourage you. I would see a breast specialist. Try to trust the experts, if you indeed have seen one that is. I have no knowledge of the health care system in Greece, hoping you get answers soon.",
      "MessageIndex": 9,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840672",
      "Title": "Faint(pink) redness on left breast for 5 months.. aliciado santabarbarian"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 3, 2015 02:44PM - edited Mar 3, 2015 02:49PM by Meadow Lauriesh, I just read through this thread, and I am going to gently point out that your post to Jessozzie sounded too harsh for what she was saying to Chrissy. Perhaps as we all know, the tone of a written text is impossible to tell from just reading. I too have IBC, like Jessozzie, and I know we hunger for information, as all the sisters do here on BCO, and our kind of cancer is particularly aggressive. No, she is not stage four and of course, isnt allowed by the rules to post. But also by the rules, we are to be kind to one another, as we all have so much to deal with. Would you be surprised to know she is 84 years old? and a retired judge in Australia, who has so much life in her? I see her last post was deleted, and she has not been back on BCO since. And yes, I am stage four and can post. here. I hope you are doing well, and I hold you and all our sisters up. Respectfully, Meadow",
      "MessageIndex": 13,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823378",
      "Title": "What treatments did you start with? Lindseyc Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 18, 2016 02:07PM Meadow wrote: Hi Jomichaels, welcome! I am sorry you have concerns, and hope you get answers soon. I have a good friend here on BCO, his name is Traveltext...he has had breast cancer, and is the expert on all things male in my book! I will send him a message and ask him to pop in here, Hoping you get more responses soon, and I am glad you found this wonderful website.",
      "MessageIndex": 1,
      "PostDate": "18/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851283",
      "Title": "Lump under my armpit jomichaels12 Traveltext"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Nov 10, 2014 06:13PM Meadow wrote: Thanks Spooky!",
      "MessageIndex": 271,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 31, 2014 06:12PM Meadow wrote: I have been reading through the thread with great interest. Thank you all so much in pursuing this project to reality!",
      "MessageIndex": 266,
      "PostDate": "31/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 15, 2014 08:27PM Meadow wrote: sounds great good work! ",
      "MessageIndex": 292,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Nov 14, 2014 06:48PM Meadow wrote: Thanks for the update Carol57",
      "MessageIndex": 276,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 8, 2015 05:51PM Meadow wrote: Thank you so much Carol! Ordering one tonight!",
      "MessageIndex": 316,
      "PostDate": "08/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Jul 29, 2014 06:04PM Meadow wrote: Happy dance!",
      "MessageIndex": 6,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823223",
      "Title": "PET scan says NED ... 6 years strong JeninMichigan roberta37"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 21, 2015 12:49AM Meadow wrote: so happy for you both! just wonderful!",
      "MessageIndex": 22,
      "PostDate": "21/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831631",
      "Title": "I met Susan_02143 today in Istanbul!!!!!!!!! stagefree jocanuck1951"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Jan 27, 2015 08:34AM Meadow wrote: Yes what kcat and wrenn said! ",
      "MessageIndex": 5,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827919",
      "Title": "My husband won't look at me. Evilmidget Jpicch"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 27, 2015 09:01PM Meadow wrote: Mom, I have not had this procedure, I did have a double mastectomy, so our surgeries are very different. I hope someone with more knowledge in this area will respond soon. And I hope and pray for you a benign outcome from your surgery. I hope you get answers soon, sorry I am not much help. Wishing you peace and a Happy New Year.",
      "MessageIndex": 1,
      "PostDate": "27/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/839010",
      "Title": "Anyone had all their ducts removed? M0m4vr61 Moderators"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Jan 26, 2015 10:14PM Meadow wrote: Evilmidget.....now I have to say first, I never thought I would start a sentence with that opening name!....I am sorry you have gone thru this. I have to say, some people are so uncomfortable with body image, or body and health issues, or altered figures. It really suprised me that my mom, who adores me, did not want to look at my mastectomy scars, or help with my post op care. I am 53, she is a super healthy active vibrant 82. I share that to let you know it is not a lack of love, but some people just arent wired that way. Of course, it would be wonderful if your husband would reach outside his comfort zone, and do whatever you need to feel good, as you are going thru so much physically and emotionally. That would be the RIGHT thing to do, but....I think men are notorious for not doing the right thing when it comes to meeting our emotional needs. They try. But they are weaker than we are! You are strong. I want to encourage you to keep letting him know your needs, keep expressing how you feel. He may come around. I am sure this is hard for you both. I know you are not alone, and I know others will post here soon with good advice. I hope you feel better soon. Hugs",
      "MessageIndex": 2,
      "PostDate": "26/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827919",
      "Title": "My husband won't look at me. Evilmidget Jpicch"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Aug 14, 2015 06:35PM Meadow wrote: Sak, I can only tell you what I would do, not what you should do...I would ask for a biopsy. I had dense breasts too, and good clear images can be hard to get. I am glad you are being watched closely. To answer your question about how quickly fibroadenomas can show up...I do not know the answer! But I am bumping your post to the top of the active threads and hopefully someone else will respond soon. I hope you a get answers soon, and please keep us posted.",
      "MessageIndex": 1,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/834250",
      "Title": "New Lump / Opinion Sak5259 614"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 19, 2016 08:52PM Meadow wrote: So sorry to hear of your pain! I am guessing your Oncology team is not thinking it is cancer, sothey are not going to get concerned...not really helpful is it! I have had disk fusion in my neck, a long time before bc. You are going to have to get their attention...you need and MRI on your neck, would be my opinion. I am not a medical person, please continue to be noisy about needing a referral to an orthopedic specialist for evaluation. Let us know what you find out, hugs to you!",
      "MessageIndex": 1,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/849098",
      "Title": "Neck pain after mastecomy and partial breast reconstruction HeatherAnn77 Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Jan 27, 2016 10:40PM - edited Jan 27, 2016 10:41PM by Meadow Hi, I wanted to share that after those first weird little fuzzies grew in, and looked shaggy, I buzzed it back down to a shorter, uniform length. It was hard to do, I was proud of every one of those stragglers, but I was glad I did, as the new growth looked better. And it grew in better, not super patchy like it had started back. Just a thought for you all with new growth, I am sure you all look amazingly beauiful... stragglers or not!",
      "MessageIndex": 23214,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 27, 2015 10:14PM Meadow wrote: Hi Theresa, I saw your post the other day, but I didnt have an answer for you! I had both mastectomy and rads, (after chemo) which is the protocol for my type of cancer. Sorry Im no help! Have you checked the radiation forum here on BCO for info?",
      "MessageIndex": 3,
      "PostDate": "27/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/831707",
      "Title": "Radiation Effectiveness - Stage, Grade, Lymph Node Status? Italychick I_Spy"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 20, 2014 08:12PM Meadow wrote: Aimee I also had a clean mammogram and 6 mo later I had swelling, itching of the breast, and orange peel skin on the nipple, and was referred for a sonogram. This confirmed IBC, inflammatory breast cancer. It will not show in early stages on a mammogram. Please ask for an ultrasound as you must rule it out.",
      "MessageIndex": 9,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819189",
      "Title": "One Swollen Auxiliary Lymph Node, worried! Doctor seems puzzled wondering22 wondering22"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 27, 2015 02:02PM - edited Mar 27, 2015 02:04PM by Meadow sugarcakes, I had a modified radical double mastectormy with implants placed then at mastectomy, and I did have rads after I healed for a few weeks. Yes, you can have rads with implants, but there will be changes to your skin and implant. I developed scarring, and I have encapsulation. It is not severe, but it is not as comfortable as my unaffected side. The skin after rads is less plyable, doesnt heal as well, so yes you can remove the implants and replace them, it is the skin that is the problem. Your surgeon can explain better than me, and I am hoping that our sister SpecialK can see your post, she is knowlegeable about this kind of topic. Perhaps you will have less changes than me, we all respond differently. I of course wish you the best!",
      "MessageIndex": 1,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/829917",
      "Title": "Lumpectomy with Existing Implants??? SugarCakes Sandiegohoneybee"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 15, 2015 02:37AM Meadow wrote: Mother, yes I was sent home wearing one. I wore it until my first follow up, I do think it helped with swelling. It got to be uncomfortable so I asked at my follow up if I could ditch it they said yes. I think it is recommended to wear something, as you are \"training\" your new body where stuff goes, does that make sense? But hopefully someone else with answers will respond soon. Hang in there!",
      "MessageIndex": 1,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830434",
      "Title": "Binder after mastectomy? MotherofFour shelly4321"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Aug 15, 2015 07:44PM Meadow wrote: Nana, I asked my Rads techs about this very thing, they told me the beam they focus on my chest has a very precise pattern, and it does not extend up to my head. This is why you do not have to wear any protection anywhere, the radiation stays in that pattern they tattooed on your chest with very little traveling. I hope my answer helps . Hang in there!",
      "MessageIndex": 3,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834241",
      "Title": "Teeth nanahagg rdeesides"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 14, 2015 10:21AM Meadow wrote: I agree MamaDuck, Taxol did a number on my feet. And welcome!",
      "MessageIndex": 3,
      "PostDate": "14/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/831386",
      "Title": "Is it lymphedema or chemo SE in ankle? Chloesmom Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 3, 2017 11:03AM - edited May 3, 2017 11:03AM by Meadow",
      "MessageIndex": 3,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854690",
      "Title": "25 Year Old Male with recent Breast Pains. Alessio Traveltext"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 14, 2015 05:46PM Meadow wrote: Yes, It did give me the nature of what you are talking about. Bless your heart, thats not fun! It has doubled in size you are right",
      "MessageIndex": 5,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 12, 2016 12:28PM Meadow wrote: kcat, my arm is numb there too, but has been since my mastectomy.Yes, I think you could be having some slight lymphedema, and it is good to recognize it early. Have you ever been to a Physical Therapist for that side? I really recommend that for anyone, I asked my Plastic Surgeon for a referral to a PT, we have a dept. that is dedicated to LE (lymphedema). I said I was feeling slight LE and wanted to stay ahead of it. She was wonderful, and I learned alot. Even if you really are not experiencing LE, I still think it is beneficial. Hoping you find out soon what is going on, please keep us posted.",
      "MessageIndex": 1,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/841207",
      "Title": "Numb arm kcat2013 kcat2013"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 13, 2016 08:07PM Meadow wrote: So very sorry for your loss, may God comfort you and your son.",
      "MessageIndex": 9,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/844241",
      "Title": "My wife has passed Tiger_Blood RonnieKay"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 1, 2015 08:07PM Meadow wrote: Ash you are so welcome!",
      "MessageIndex": 4,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/835400",
      "Title": "How am I doing? help ash123 ash123"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 3, 2017 10:55AM Meadow wrote: Alessio, I am going to send a message to Traveltext, Hoping he responds soon, he is always a wealth of information. Best of luck always!",
      "MessageIndex": 2,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854690",
      "Title": "25 Year Old Male with recent Breast Pains. Alessio Traveltext"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 2, 2015 09:55PM Meadow wrote: Hello Deannie, nice to meet you! Hoping the changes you describe are nothing to worry about. I am glad you are seeing a doctor, that is what we must do. And you will find a wealth of info here on BCO and some really nice people too! Let us know what you find out, please keep us posted.",
      "MessageIndex": 1,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/829039",
      "Title": "Hi new here. Deannie58 Deannie58"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 16, 2015 11:10AM Meadow wrote: Stick up for what you want, and what the Doctor ordered. If the Radiologist has concerns insurance will not cover it or some other reason, ask him. Sometimes Insurance denies paying for something if it is not ordered or not written up in a correct way. You need answers, it is obvious that you have \"something\" going on, hopefully you will find out today",
      "MessageIndex": 25,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 16, 2015 12:57PM Meadow wrote: Thanks great news, keep an eye out for changes, thickening of your skin, changes to your nipple, if it pulls inward...did he think i tcould be related to your Fabry disease? Try to relax. You have been through long day and it is just now noon!",
      "MessageIndex": 29,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 18, 2015 09:54PM Meadow wrote: You need to be seen by a specialist, so glad you were referred to go. Hand in there! WHen is the appointment? ",
      "MessageIndex": 36,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 18, 2015 11:03PM Meadow wrote: I think that is the right move. I would think the new pain you are having may be worse today from the mammogram, whatever you have going on and with the swollen size of your breast, you are sore. I know you are anxious to know what is going on, just try to relax, you will find out soon and then you wil have answers and a plan. You are in my thoughts!",
      "MessageIndex": 38,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 14, 2015 05:06PM Meadow wrote: Ms, I am sorry you are going thru this! Never let someone make you feel stupid about your own body. They cannot feel what you feel. And that tech is WRONG. Cancer can hurt....IBC can make your breast extremely sore and tender, mine was. But, back to you...I am glad you are being seen tomorrow, and of course tell your doc about your IBC questions! IBC is very rare, and it is often mistaken for mastitis, and treated first as such, to rule it out. Chances are in your favor that it is a benign \"something\", so just relax till you get more info. IBC progresses rapidly, and skin changes can occur literally overnight. The cancer is not in lumps, but sheets like cotton candy, and it plugs up the lymph system so your breast swells up, and fairly rapidly. The good news is the current chemotherapies, surgery, and rads treaments are working and statistics are changing in our favor. That is some general info on IBC for you, but you havent been diagnosed with anything yet so dont worry! Please keep us posted. I had a May baby, he will be 22 this May. Time flies! Enjoy.",
      "MessageIndex": 2,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 15, 2016 08:13PM Meadow wrote: Scarlet, I might say, lets do the biopsy now. Have you had 3 rounds of antibiotics? Did I remeber right? I think it is time. Can they work you in sooner than next week? Not to say it is urgent...but if it is IBC, you can start treatment sooner.",
      "MessageIndex": 13,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840955",
      "Title": "Large lump appeared over night. scarletprinny Kicks"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Sep 9, 2015 10:54AM - edited Sep 10, 2015 08:52AM by Meadow dtown, it would be impossible for me to not follow every word what the big brains at the Mayo recommend. I am so sorry you are having to do this! one helping of bc is enough for anyone. My best to you!.",
      "MessageIndex": 1,
      "PostDate": "09/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834841",
      "Title": "Re-Irradiation dtown 614"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 10, 2015 09:42PM Meadow wrote: Thinking of her and you",
      "MessageIndex": 35,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828336",
      "Title": "Update on Raro raro"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Sep 30, 2015 08:45PM Meadow wrote: Awesome Sharon< THANK YOU for sharing this with us. So very happy for you!",
      "MessageIndex": 19,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/835111",
      "Title": "6 Years Out! pupfoster1 Moderators"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 3, 2017 11:05AM Meadow wrote: Traveltext has had breast cancer, he is a really great resource. Hang in there!",
      "MessageIndex": 4,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854690",
      "Title": "25 Year Old Male with recent Breast Pains. Alessio Traveltext"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 15, 2016 03:27PM Meadow wrote: hoping for benign. If not, do not despair. You can fight this and win",
      "MessageIndex": 10,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840955",
      "Title": "Large lump appeared over night. scarletprinny Kicks"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 17, 2015 01:49PM Meadow wrote: I agree with Winning, after biopsy confirmed I had cancer, I saw my surgeon. Because their practices overlap so much the Oncologists and Breast Surgeons are very familiar with each other, have people they like to refer to, know each other very well. My surgeon had a pick of oncologists he preferred for me, and his office set my first appointment for me. My Oncologist referred me to the Radiologist. If I had met anyone of my team and felt we were not a good match I of course could change and see whomever I felt was a better match for me. I was fortunate love every one of them. I hope you will too. Ask a lot of questions when with the Surgeon, like, \"should I make my own first appointment with the Onc, or does your office do that?\" Whom do you like for me, in the system, do you have a preference?\" Your team is very important. They will help save your life. Keep us posted!",
      "MessageIndex": 3,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828594",
      "Title": "question about which MD will be first windingshores"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 17, 2015 01:55PM - edited Feb 17, 2015 02:01PM by Meadow Yes SpecialK is right too, different kinds of cancers require chemo first, others will want surgery first. Ask whenyou get your biopsy results who they want you to consult first. The Breast specialist sent me to the Surgeon first, and he knew that with wilth my kind of cancer I would need chemo first to eradicate as much cancer as possible before surgery. They will take care of you... help direct you. My cancer center also has people they call Navigators, nurses who will help you the entire journey. I kept her number in my phone and could always reach her, or she called me back without much wait. I called her about anything that I had questions about, no question was too small. Her name is Madonna by the way, she made me feel comforted!",
      "MessageIndex": 4,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828594",
      "Title": "question about which MD will be first windingshores"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Sep 30, 2015 11:01PM - edited Sep 30, 2015 11:04PM by Meadow Ash, What you have described is totally normal. In your paperwork from the hospital you should have received some print outs for range of motion exercises to do. If not you can google, \"Exercises for post mastectomy\" and see what you need. These are very important to do as you will suffer severe loss of movement ability, range of motion in your upper body. These simple stretches really work great. My fav was to stand facing the wall with your toes almost touching the wall...put your hand on the wall and crawl your fingers up the wall till your hand is over your head...then lean in and stretch a gentle stretch. Do this several times a day. I would call your surgeons office and and ask when you should start, seems like I started a couple of weeks out from surgery, as you do not want to start too soon to interfere with healing. Hang in there! Sounds like you are doing great. Hugs to you",
      "MessageIndex": 1,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/835400",
      "Title": "How am I doing? help ash123 ash123"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 27, 2014 06:46PM Meadow wrote: Hi ladies, I have been seeing a therapist for the past few weeks for early lymphedema, and I just got my first compression garment today. I really like it, it is just a standard light compression sleeve and glove. I am so thankful for this thread and all the info herein....I will be reading for awhile to get informed!",
      "MessageIndex": 1360,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 24, 2016 10:43PM Meadow wrote: What a loving tribute to her. I am so sorry for your loss. Her star shines brightly through your words.",
      "MessageIndex": 9,
      "PostDate": "24/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/841609",
      "Title": "Fidelia - another beautiful angel FideliasDaughter RonnieKay"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 2, 2016 08:07PM Meadow wrote: Scarlet, I did experience fatigue before my diagnosis, looking back after diagnosis, I did not feel all that great, nothing specific, thought it was just old age...I was 53, lol. Like Mamiya, I had rapid onset of symptoms, similar to yours, so I am glad you are being seen by a doctor tomorrow. MANY reasons why you are having these changes, so do not freak out. (You do not seem to be freaking by the way) Please do update us with what you find out. Hopefully you will get good answers tomorrow. Hugs to you!",
      "MessageIndex": 4,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840955",
      "Title": "Large lump appeared over night. scarletprinny Kicks"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 16, 2015 08:14AM Meadow wrote: Absolutely MamaDuck!",
      "MessageIndex": 6,
      "PostDate": "16/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/831386",
      "Title": "Is it lymphedema or chemo SE in ankle? Chloesmom Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 22, 2016 06:28PM Meadow wrote: Your Doctor sounds like a complete incompetent. You need to be seen by a breast specialist.",
      "MessageIndex": 17,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840955",
      "Title": "Large lump appeared over night. scarletprinny Kicks"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 7, 2015 11:12AM Meadow wrote: My best to you too Ann, my IBC sister ",
      "MessageIndex": 1,
      "PostDate": "07/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835547",
      "Title": "PINKTOBER--The Ignorance Never Stops Teakie88 Shutterbug73"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 26, 2015 03:50AM Meadow wrote: 52 and a half",
      "MessageIndex": 388,
      "PostDate": "26/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Sep 30, 2015 10:12PM Meadow wrote: Scuttlers, I appreciate your thoughts on Pink October. I wish the money went to research, we all are aware aware aware. But I am not bothered by the whole thing, outside of the money, (which is huge). I feel good about myself and I like the focus on Breast Cancer for the month. I try to stay in my positive place, I find this helps me in mind, body, and spirit. I get physically sick if I go negative. So thats my take on the whole thing. Thank you for sharing the sobering stats above...",
      "MessageIndex": 1,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835406",
      "Title": "For FaceBook scuttlers patoo"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 13, 2015 09:55PM Meadow wrote: so very sorry for your loss. Thank you for your kindness to let us know in your sorrow.",
      "MessageIndex": 21,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828448",
      "Title": "Heartbreaking News - Diana Payne solange49 dlb823"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 17, 2016 09:14PM Meadow wrote: Balthus, I have not had that reacton to my sleeve, but I bet others have.I do not have LE yet, only slightly with summer heat or extreme upper body exertion,. but when I feel the need I do wear the sleeve and I did wear it flying. I recommend you fly with it, and take it off if you need to. Do you think it is too tight?",
      "MessageIndex": 1,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/842285",
      "Title": "Anyone Ever Gotten Nauseous or Lightheaded From Sleeves woodstock99 ChiSandy"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 9, 2014 11:04PM Meadow wrote: Amoc, I am thinking like so many above, that estrogen replacement is not an option. for you. I seriously doubt you could get a doctor to prescribe it for you with your diagnosis.They would be medically negligent. I know your symptoms very well, I too traveled this road you are traveling, and there will be good days ahead I promise. One day you will wake up and say, \"I feel better\", that will be followed by another and another. I hope that day is soon. ((hugs))",
      "MessageIndex": 21,
      "PostDate": "09/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/826766",
      "Title": "Estrogen replacement....am I crazy? Amoc1973 Scotty"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 13, 2015 07:34PM Meadow wrote: Cmo I am so sorry you feel down. Getting good news mixed with bad gives us mixed feelings! But perk up, good things abound. I am not much with statistics, I have IBC, and no one wants to read stats with THAT, so I dont really pay attention to them particularly... if it is going to bum you out then dont. Stage one with no nodes, thats awesome! And being one of the \"lucky\" ones who did cut off my boobs and all my junk, I can tell you that the good life is still mine. And if that is the way you go too, the good life is still yours to be had. I am glad you are here with us, and I hope some one else can respond to cheer you up. Hang in there and hugs to you!",
      "MessageIndex": 1,
      "PostDate": "13/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/830387",
      "Title": "Just feeling down today... Cmo65 movingsoccermom"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 4, 2015 07:30PM Meadow wrote: Yes anything can hurt. Anything is possible as we are all so different and unique. What might not feel painful to one may to another, but there are usual standards",
      "MessageIndex": 4,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829121",
      "Title": "My 16 year old daughter B123 SpecialK"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 3, 2016 10:15PM - edited Mar 3, 2016 10:19PM by Meadow Arista, many people have to skip or miss a treatment, without problems. I was sick during chemo and had to skip a week. In my opinion (I am not a medical person) this is not a problem. Hope that helps! And CONGRATS on finishing chemo!",
      "MessageIndex": 1,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/841824",
      "Title": "Anyone hear of mets due to final chemo being postponed? Artista928 Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Aug 26, 2014 09:57AM Meadow wrote: Doona, I am so sorry you recieved bad news. Cancer just plain sucks. I am so glad you wrote that you are strong...that strength will return soon and you will think more clearly.  Do you have a treatment plan yet? Again so sorry you are going through this.",
      "MessageIndex": 4,
      "PostDate": "26/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823969",
      "Title": "results are in Doona Hopeful82014"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Aug 24, 2014 03:18PM Meadow wrote: Sheela Hello and welcome to the BCO forum.  As our Mods have said, it is always best to see your doctor with changes and concerns regarding your breasts.  There can be so many causes and reasons we experience changes or problems. Try not to worry until you have more information.  I believe this thread started out several years back....looks like from reading above Lisa's problem was benign and not cancerous, great news for her. Please lets us all know what you find out and again, don't expect the worse, ok?",
      "MessageIndex": 12,
      "PostDate": "24/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794856",
      "Title": "Indentation with hard veins & tenderness in armpit Chocsi37 Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Sep 30, 2015 10:19PM Meadow wrote: You inspire me! You are almost 7 years out from diagnosis, and I am so happy for you. You give me hope.",
      "MessageIndex": 3,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835406",
      "Title": "For FaceBook scuttlers patoo"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 14, 2015 09:30PM Meadow wrote: Ms do not apologize!",
      "MessageIndex": 9,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 15, 2015 02:12PM Meadow wrote: I would strongly request for an ultrasound. Unfortunately mammo is not the best diagnostic tool, we all are told to get one, but my General Doc insisted I get an ultrasound even tho the breast center only wanted to do another mammo...I had a clean one just 6 mo before. I am glad he persisted, as the cancer was clearly obvious on ultrasound even to me and I am not medical. Remember, he is working for you! Do not be afraid to ask for it. keep us posted",
      "MessageIndex": 12,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 4, 2015 06:06PM Meadow wrote: B123, Nope, no reason to panic. I am sorry she is experiencing problems, and of course we worry so much more when it is our kids. You are right to seek medical expertise. We are always eager to share any knowledge we can and offer encouragement, but we are not able to tell you exactly what is going on, only a doctor examining her can do that but yes, you know that. There are so many changes and issues that come up in our breast that are benign, and I certainly pray that is the case for her. My first thoughts are that it is related to her sports and activity, plus bust size and age. My little cousin is her age, big busted, active, and she has a hardtime managing her chest in sports. Something guys do not have to deal with! Dense breast tissue requires more monitoring as issues can be hidden in there and not so easy to feel/see. Her age makes hormonal changes more likely the cause and not cancer, so just relax for her and yourself until you have more info. And even then if you did get bad news, panicing will not help anyone. Please keep us posted and of course wishing you the best news after tests.",
      "MessageIndex": 1,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829121",
      "Title": "My 16 year old daughter B123 SpecialK"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 30, 2015 08:33PM Meadow wrote: Pipersmom, I think jjmama posted on another thread that she had good news, no cancer. You can do a search with her name, see where she posted last. I hope you get answers too if there are things you are wondering about.",
      "MessageIndex": 43,
      "PostDate": "30/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 14, 2015 05:11PM - edited Apr 14, 2015 05:12PM by Meadow I would ask to see a breast specialist, as by your pic you obviously do have something going on. Again, odds are in your favor it is not cancer so try to stay calm. I know it is hard! (And the Moderators will remove your pic, just so you know!)",
      "MessageIndex": 3,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 11, 2017 08:33PM Meadow wrote: Orchid, welcome! I did not have that treatment, hoping others who did will see your post and respond soon. Hang in there, you are almost through it. Yes, cumulative effects...just when you poop out, it is over...whew!. Continue what you are doing, water, rest, make sure you eat. Sounds like you are doing great, even though it may not seem so. Again welcome and keep us posted",
      "MessageIndex": 1,
      "PostDate": "11/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854117",
      "Title": "5 FU Orchid73 Orchid73"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 19, 2015 07:15PM Meadow wrote: Mandy, so very sorry for your loss. She will be missed dearly",
      "MessageIndex": 35,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828643",
      "Title": "My Mother raro stagefree"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Nov 11, 2016 07:03AM - edited Nov 11, 2016 07:04AM by Meadow kk, firstly, congrats on the new baby, the new joy. So sorry about your diagnosis , and the tough decisions it forces on you. I have \"met\" here on BCO a member named bchusband , his wife was just like you, pregnant and breast cancer. She does not do the website , but he joined as her caregiver . She had chemo while pregnant , and their son is now 18 mo old. mom and baby did great. Perhaps you could connect with him for some valuable information? I am not a medical person and can not give any advice to you you, just want to help you connect with some one who went through this as well. My best hopes and prayers to you and the baby .",
      "MessageIndex": 7,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847013",
      "Title": "chemotherapy while pregnant kkaykkat Jiffrig"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Jul 11, 2015 04:34AM Meadow wrote: Cloud, I just saw this thread and I am so glad you popped in and bumped it up. I too loved being bald....I always had \"big\" hair and now like you said...if I need a comb Im headed for a haircut. Freedom! I am happy for your good health. Hugs to you! ",
      "MessageIndex": 237,
      "PostDate": "11/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/726163",
      "Title": "Embracing the Bald BooBee Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Nov 20, 2014 07:46PM Meadow wrote: Thanks lago for posting the chart ",
      "MessageIndex": 1389,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 25, 2014 11:16PM Meadow wrote: Iago thanks for the link to the LympheDiva seconds",
      "MessageIndex": 1429,
      "PostDate": "25/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 15, 2015 02:13PM Meadow wrote: Hello kicks my dear",
      "MessageIndex": 13,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 15, 2015 10:14PM Meadow wrote: Kicks no reallybad storms yet, just the normal thunderstorms, thankfully",
      "MessageIndex": 22,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830422",
      "Title": "Worried about IBC any advice appreciated! Mschrank Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 9, 2015 03:19AM Meadow wrote: Step, so sorry you are going thru this, I have not had that diagnosis, but hopefully someone who knows more than me will respond soon. My best wishes sent your way",
      "MessageIndex": 1,
      "PostDate": "09/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/831144",
      "Title": "Anyone with Sarcoma in the Breast? Steph99 PistolMama"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 2, 2015 03:40AM Meadow wrote: Thanks for sharing these ideas!",
      "MessageIndex": 1,
      "PostDate": "02/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830081",
      "Title": "Suggestion for BRAs after lumpectomy.. NATSGSG Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 19, 2014 08:52PM Meadow wrote: VR and Kam, welcome to the forum, the place where you will find support, information, humor,(so needed as a stress reliever) and friendship. We have all been on the same road you both are at now, tests and biopsies, the waiting, and news that rocks your world. I can assure you, YOU CAN DO THIS! You can go through treatment and come out healthy and happy on the other side. Yes, you will have to fight. But it is a fight you can win, take it one day at a time. I cannot stress enough the importance of staying positive, in a positive state of mind. Your body will respond. If you are comforted by prayers, share your needs and get those prayer warriors going. These two things will help your mind and spirit as your medical team gets going with your treatment plan. Hoping for benign results. Thinking of you both",
      "MessageIndex": 8,
      "PostDate": "19/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826981",
      "Title": "Mammogram & Ultrasound \"worrisome\"- biopsy tomorrow vr423 Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Jul 27, 2014 02:55AM Meadow wrote: Nice to meet you Shewolf, sorry for the reason but we will all help you through it and you will help us too. We are in it together!",
      "MessageIndex": 23,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823074",
      "Title": "Guess it is my turn shewolfpg RMlulu"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 5, 2016 03:23PM Meadow wrote: Hi, I do not really know the answer to your question, so I am bumping it up to the top of the active threads so more people can see it and respond. Human error can happen, even in medical situations of course. But they are rare, hopefully. Hoping others respond soon, my best to you!",
      "MessageIndex": 1,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/848695",
      "Title": "Do technicians label breast side in screening mammogram? lizzyg42 BornInTheUSA"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 26, 2015 09:44PM - edited Mar 26, 2015 11:14PM by Meadow CLHR, so sorry you are going thru this, but I am glad you have found BCO.... this website has tons information, and so much more! I did not experience what you have with the discharge, and mine was a malignancy, so I am \"bumping\" your question to the top of the active threads in the hopes that others will chime in soon. I am so glad you are calm at this point, or at least your post appears so. That attitude is so in your favor and will serve you well whatever you biopsy reveals. Hoping for benign results, Please keep us posted.",
      "MessageIndex": 1,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829935",
      "Title": "odds it's not malignant? CLHR Moderators"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 31, 2015 08:53PM Meadow wrote: so very glad! great!",
      "MessageIndex": 6,
      "PostDate": "31/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829935",
      "Title": "odds it's not malignant? CLHR Moderators"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 29, 2016 02:57PM Meadow wrote: yes, this would be the case. Are you getting a treatment plan yet? Hang in there, hugs to you. Just know you can fight this and win.",
      "MessageIndex": 7,
      "PostDate": "29/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/841080",
      "Title": "Pain near lump area and on edge of underarm (IDC) isnogard Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 9, 2016 01:57PM Meadow wrote: Naward, it can be many reasons, may I ask what were the results of the biopsy?",
      "MessageIndex": 9,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/841080",
      "Title": "Pain near lump area and on edge of underarm (IDC) isnogard Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 24, 2015 09:22PM Meadow wrote: Shimmy, of course you are upset, and you have every right to be. I am wondering,how you are doing hormonally after your hysterectomy? The reason I asked, I was way out of whack with hormones after mine, but I did not know it, and I felt so bad, like you are describing. It makes a bad situation 100x worse. I am sorry you are so stressed, and please know we are here for you.",
      "MessageIndex": 1,
      "PostDate": "24/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830737",
      "Title": "Paralyzed with fear Shimmymoo Shimmymoo"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Apr 7, 2015 09:57PM Meadow wrote: Like Ruth, I wanted to say YES! to the good news. It is so good to hear good news",
      "MessageIndex": 45,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 6, 2016 09:16PM Meadow wrote: isnogard, I am so sorry you are going thru this. You are smack in the middle of the most stressful time ...the time from diagnosis to the starting of treatment. I was the same way, nothing moved fast enough. It sounds like you do have a good team on board, that is a big positive. I am sure you will feel better after your consultation with the surgeon. To answer your last question, I am not familiar with other centers outside of my area, sorry. I hope you do get some other responses and info. I know some conventional wisdom about breast cancer is that it does not hurt...I did not find that to be the case. My cancer is Inflammatory Breast Cancer, IBC, and there was pain/soreness in mybreast, and under my arm, lymph nodes. I read once IBC is like IDC on steriods, and amped up version of IDC...so maybe you too are feeling this pain from the cancer, and of course it is causing concern and anxiety. Please try to relax, and after you see the surgeon next week, if you still feel like things are moving too slowly, ask for your team to speed things up for you. They can fast track you if necessary and sometimes we get more action if we press. But my advice is to try to relax. I believe all things are better approached from a place of positivity and calm determined energy. I hope this helps, that is my intent, My wish is for all the best for you, of course",
      "MessageIndex": 1,
      "PostDate": "06/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/841080",
      "Title": "Pain near lump area and on edge of underarm (IDC) isnogard Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 7, 2016 08:42AM Meadow wrote: So glad I could help. Keep us posted",
      "MessageIndex": 4,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/841080",
      "Title": "Pain near lump area and on edge of underarm (IDC) isnogard Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Aug 12, 2015 08:52PM Meadow wrote: Bellanan, so sorry to hear of your second diagnosis! One helping should be enough for everyone, don't you agree? I am also triple neg,and there is an awesome thread here on BCO called, \"Calling all TNs\" in the triple neg forum, and please pop in and check it out! There you will find tons of great info and the absolute nicest sisters there. It has helped me so much.",
      "MessageIndex": 2,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834126",
      "Title": "Triple Negative stage 1 Bellanan Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Feb 1, 2016 07:50PM Meadow wrote: Sound advice Jill.",
      "MessageIndex": 45,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/840410",
      "Title": "Trying to keep calm, waiting is hard reflect ChiSandy"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Nov 25, 2015 10:52PM Meadow wrote: Lusy, so sorry to hear of your concerns. Can you ask your doctor if you should be seen earlier? SOmetimes they can get you in if you ask kind of insistantly. Dec 18 is a long way off, I agree. Can you call to be seen earlier?",
      "MessageIndex": 1,
      "PostDate": "25/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/837005",
      "Title": "Pain Lusy Meadow"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Mar 22, 2015 09:15PM Meadow wrote: Suzannecarol, I am sorry you are in pain. My husband does anesthesia in surgery, so I just asked him if you could still be experiencing pain from intubation...he said yes it is possible, not common but possible. I too hope it is better tomorrow, but either way call your surgeon's office and tell the nurse to get their input. Before diagnosis I always hated to call and \"bug\" the docs or nurses.....after diagnosis, I call. They dont mind one bit, and hey, I am in a fight for my life! who better do they have to talk to!. Let us know what you find out. Hugs!",
      "MessageIndex": 1,
      "PostDate": "22/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/829781",
      "Title": "roof of mouth very sore? Suzannecarol Suzannecarol"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Oct 25, 2014 07:26PM - edited Oct 25, 2014 08:00PM by Meadow",
      "MessageIndex": 5,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825737",
      "Title": "Anxiety attacks - any advice? reader123 bhd1"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 17, 2016 06:34PM - edited Dec 17, 2016 06:35PM by Meadow Yum, firstly. try to calm down. did your doctor have any follow up recommendations? Any further tests ordered? Please stop poking and digging at the spot/lymph node, you will make it sore, and you have the test results yes, to show it is there? Curious what your next step is, to watch? Ask your dr these questions, and let us know what she said.",
      "MessageIndex": 1,
      "PostDate": "17/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/851296",
      "Title": "another ultrasound results... yummymommy Moderators"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 23, 2016 12:31PM Meadow wrote: yummy, I have no answer for you, like the wonderful ladies above. You seem to want a cancer diagnosis, or feel there is some benefit to you emotionally to be pursuing a cancer diagnosis. One day you may actually have cancer, you may see its not as scary or bad as you fear....or it may be a nightmare.....it is all in your approach, your fight, how much support you have, your team. You seem to have very patient people in your life, good for you! We here have lost patience with your refusal to accept the professional results you have received. Perhaps it makes me think, how I would have been so thrilled to get those results, and you keep coming back with reasons to worry. Get another hobby besides this one, go visit a nursing home, help others who are sick, or old, who need encouragement. There are so many things you can do with your time, your strength. Merry Christmas!",
      "MessageIndex": 30,
      "PostDate": "23/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/851296",
      "Title": "another ultrasound results... yummymommy Moderators"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 12, 2015 10:25PM Meadow wrote: Tayhante, nice to meet you, and welcome. Did I see on another thread that you have IBC? that is my diagnosis. I did not recve your chemo, I had AC and Taxol, but I wanted to respond to your post. If you are short of breath you should call the nurse at your oncologist office, just to let them know, Are you also taking steriods this first week? I did, and it was the steriods that were giving me shortness of breath. I tried to push thru it, but as AC has some nasty cardiac SEs, I did cut back on the steriods, not the chemo. I wanted every drop of that stuff to help me win! But do check in with the nurse to let them know about your shortness of breath. ",
      "MessageIndex": 1,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/831321",
      "Title": "Anyone currently on TCHP? Tayhante Tayhante"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "May 12, 2015 10:32PM - edited May 12, 2015 10:33PM by Meadow Also, if you are indeed IBC, pop over to a thread called...\"Welcome to BCO IBC Support...This Ain't Facebook\"....and introduce yourself, if you would like. There are some super ladies there, and as IBC is rare, it is nice to meet others here.",
      "MessageIndex": 2,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/831321",
      "Title": "Anyone currently on TCHP? Tayhante Tayhante"
    },
    {
      "AuthorID": "Meadow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198025/profile",
      "Content": "Dec 23, 2016 03:07PM Meadow wrote: I did not see it, wish I had! She has great wisdom! Merry Christmas to all you ladies!",
      "MessageIndex": 34,
      "PostDate": "23/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/851296",
      "Title": "another ultrasound results... yummymommy Moderators"
    }
  ]
}