{
  "AuthorID": "mec2450",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
  "Posts": [
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "Feb 22, 2010 02:56PM mec2450 wrote: All, I have not seen pathology report but according to ONC wife is still triple neg. Given that, we need to decide on doxil or trials, etc.. I am apprehensive about going straight to doxil since it seems like the last drug out there (from std approach anyway) but am nervous about waiting to get into trial like rad001 or other parp type trials. For those of you out there int trials, how long does it take to get into treatment? thanks. -mike",
      "MessageIndex": 3,
      "PostDate": "22/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748606",
      "Title": "Tumor - Lost Markers? mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "mec2450 wrote: All, Have a question for the group - has anyone heard of tumor losing its markers. What I mean is, after a biopsy pathology shows negative for breast cancer, er, pr, ner2, etc... but 5 years back she was slightly er+ and strong her2+ My wife and I have been battling her BC for 10 years - moved into her lungs 5 years ago but no where else (that we can detect) to this point. She has had almost ever drug out there (except doxil), the usual pattern of going from one drug to next when scans show progression. Hormones did not work for her, tried arimdex, faslodex, others. She has been on steady chemo for last 5 yrs. Recent CT showed growth, largest tumor about 2x6cm - she has many tumors but this is largest, so we talked with oncologist and got 2nd opinion about lung biopsy which we had this past monday. I have not see pathology report yet but via emails with oncologist it seems tumor (where sample was taken) is undifferentiated and not even positive for breast cancer, even though we know it is. Onc says that 20% of tumors can behave this way after such prolonged and aggressive treatment. He is doing further investigation to see what other biological testing we can do to help determine treatment course. This was second lung biopsy for us, first was 2 years ago and it showed her triple neg so we went the platinum direction of drugs, then avastin, etc.. so we thought another biopsy would be helpful now since as I said our choices are becoming limited. We are considering several options, std doxil, metronomic chemo with doxil, sutent (although that seems to be not very likely), epotoside, BZL101 (if we can get in trial) and some far out things like Denosumab, erbitux, etc.. really looking at all options. I guess i am just asking for feedback on this strange pathology and general input from group. Like many of you bc soliders, my wife is amazing, does it all, 3 kids, all the activites, hardly ever complains even though i know her feet are so numb she cannot feel them and no hair for 5 years but we will never give up fighting. we live scan to scan but it's ok - have figured out how to make it work. Just looking for a new way forward so we can keep on going. God Bless all of you and thank you for your comments.  -mike Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748606",
      "Title": "Tumor - Lost Markers? mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "Feb 19, 2010 08:16AM mec2450 wrote: All, Here is detail of my wife's treatment history... January 2001,Left radical masectomy w/reconstruction - A/C followed by weekly Taxol July 2004, RECURRENCE (er+, pr-, her2+++) Gemzar alone (disease progressed) Gemzar w/Herceptin (disease progressed) Arimidex for one month (disease progressed) Falsodex injection 1x (disease progressed) Herceptin/Taxotere (disease progressed) February 2005, ABRAXANE arrived Abraxane/Herceptin decrease in nodule size Remained on this regimen with further decrease Over next few months. Over time nodules were Still present but stable. No new nodules August 2005-Apr 2006    Scans were stable May 2006  Pet scan - No activity May 2006 -Oct 2006       Herceptin alone October 2006   Disease progressed after 4 months of Herceptin alone Abraxane/Herceptin for 2 cycles - disease stable Dec 2006 -March 2007   Abraxane/Herceptin slight progression per CT scan April 2007  Switched to oral Tykerb/Xeloda July 2007  Disease progressed after 9 weeks Navelbine/Herceptin weekly Sept 25, 2007  CT scan Disease progressed Started Avastin/Taxol one treatment Decided to drop Taxol due to Dr D/Theadula recommendation Continued on Avastin/Herceptin Dec 12, 2007 CT scan Significant decrease in tumor size Continued on Avastin/Herceptin February 20, 2008           CT chest scan Only - possible growth following Pneumonia chest x-ray continued Avastin/Herceptin May 15, 2008                  CT scan significant increase in tumor size (largest tumor) Started Ixempra August 13, 2008              CT scan Some shrinkage in largest tumor but 4 new small tumors. Continued Ixempra but added Herceptin November 12, 2008         CT scan - Large tumor grows - small tumors disappear November 21, 2008         Lung Biopsy - pathology changed to trip neg December 2008               Carboplatin/Avastin/Taxol Had to stop after 3rd treatment for allergic reaction March 2009                     Cisplatin/Avastin/Taxol Stopped after 2 treatments/Ears ringing October 2009                  Stable scan Continued on Avastin/Taxol January 2010                   Scan showed increased growth in lungs No new nodules/Increased lymph nodes February 2010                 Another Lung Biopsy",
      "MessageIndex": 1,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748606",
      "Title": "Tumor - Lost Markers? mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "May 31, 2011 06:00PM mec2450 wrote: Mark,  I am sorry for your loss and will pray for you and your family. My wife is 10yr TN bc survivor with recent brain mets after battling lung mets for 5 years. I understand your frustration with dr's and ins as I have experienced much of the same in last 10 years. My wife and I have become our own dr to some degree constantly researching and asking questions and getting 3rd and 4th opinions. It sounds like you did as much as you could. AS other have said, TN is very hard to figure out. My wife has brain MRI this week to see if the Gamma Knife procedure she had 12 weeks back worked. Good luck and god bless you and your family.  -mike",
      "MessageIndex": 17,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769678",
      "Title": "Tribute to my Wife and BC.org and its members luvmywife Mazy1959"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "mec2450 wrote: All, My wife started Tykerb/Xeloda combo 12 weeks ago after Herceptin/Abraxane seemed to stall out on us and stop working after keeping her in check for 18 months. We just got results of CT yesterday and no progress with the T/X combo. Disease seems to be progressing - still only in her lungs (that we can tell) but I am getting concerned that it is spreading other places that we do not know about yet. We are meeting with ONC next week to determine next steps but I think he is thinking we give it another 12 weeks with T/X before giving up on it. My concern is that we saw no improvement with this last round and i do not want to waste 12 weeks on something that may not be working. Unless I am missing something - this is mostly a trail and error process at this point and we never know how something will work unless we try it. question for you t/x people out there - if it is working for you did it work right away or did it take time. Judging from what i have read on the board - it seemed like T/X either worked right away or it did not work. Can anyone confirm for me. Also - any thoughts on other chemo combos. I am thinking we give navelbine/herceptin a try - my wife has about 10 nodules in her lungs from 2mmm to 8mm in size - no where else that we know of at this time. Thanks in advance for your responses! -Mike Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/648940",
      "Title": "Tykerb/Xeloda - Update mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "Jul 21, 2007 11:59AM mec2450 wrote:",
      "MessageIndex": 9,
      "PostDate": "21/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/648940",
      "Title": "Tykerb/Xeloda - Update mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "mec2450 wrote: Hello Everyone, Well - its been quite a ride last 6 months. Some of you know my wife's history but quick recap: abraxane/herceptin from 2005 until spring 2007 Tykerb/Xeloda spring 2007 to summer 2007 Navelbine/Herceptin from summer 2007 to now nothing has worked since abraxane stopped working. Just had a CT tuesday and not good news. Navelbine/Hecerptin did nothing after 10 weeks of weekly infusion. Tumors grew rapidly in lungs with some new tumors. No other organ involvement yet but we all know it is lurking. Met with onc today - he was a little stumped. We are looking at avastin, doxil, sutent, in combinations. Sutent/avastin is only available in research protocol - not sure we qualify. Avastin is covered by our insurance but it needs a chemo combo. Question for all is what are popular avastin chemo combos that have had success? We are also considering a trip to NYC for another opinion from sloan (went there 3 years ago). Thanks in advance. -Mike Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692836",
      "Title": "Abraxne to T/X to Navelbine to ??? mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "Sep 28, 2007 08:50AM mec2450 wrote: thanks for info. my wife has had: ac/t, taxotere, gemzar, abraxane, navelbine, xeloda arimidex, aromisin, faslodex, herceptin, tykerb never had any platins or doxil, sutent is avail only on reserach according to onc. as of now - onc is leaning towards avastin/carboplatin",
      "MessageIndex": 3,
      "PostDate": "28/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692836",
      "Title": "Abraxne to T/X to Navelbine to ??? mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "Mar 31, 2011 01:20PM mec2450 wrote: leanneh, my wife is tn and recently we discovered brain mets. she had about 5 tumors and opted for the gamma knife radiation approach instead of whole brain radiation (wbr). procedure took about 4 hrs in total including the \"mapping\" of tumors, mri and then actual radiation (it was about 60 minutes). Please check out gamma knife approach as it has less side affects than WBR. Good Luck and God Bless. -mike",
      "MessageIndex": 24,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766830",
      "Title": "Now the Brain Leanneh sincitydealer"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "Jul 6, 2007 09:25PM mec2450 wrote:",
      "MessageIndex": 4,
      "PostDate": "06/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/648940",
      "Title": "Tykerb/Xeloda - Update mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "Jul 10, 2007 07:05PM mec2450 wrote:",
      "MessageIndex": 6,
      "PostDate": "10/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/648940",
      "Title": "Tykerb/Xeloda - Update mec2450 mec2450"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "mec2450 wrote: All, Happy Holidays! Question for the group, does anyone have experience with the Drug IXEMPRA? Apparently it is a new drug for metastatic patients who have have limited success with other drugs like tykerb, avastin, etc. Any info is appreciated. Thanks, Mike Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696728",
      "Title": "IXEMPRA mec2450 Analemma"
    },
    {
      "AuthorID": "mec2450",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6776/profile",
      "Content": "Feb 25, 2011 09:13AM mec2450 wrote: Hi, My wife is TN with mets to lungs. She has had almost every fda approved drug and also trials. We are still looking for drug that works for her. Recently she got brain mets so we looked at WBR vs. knife approach and went with gamma knife. she had 3 tumors visible from std brain mri but with gamma knife they used higher density mri (1.6mm slicing) and found 4 more so they treated all 7 at once. she is doing well and we have follow up in 7 weeks. Our radiation onc said trend is to not do WBR but to treat the tumors with knife approach since side affects are less and overall risk is less. Good luck with whatever you choose....",
      "MessageIndex": 10,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765127",
      "Title": "tripple negative brain and lung METS luvmywife chainsawz"
    }
  ]
}