{
  "AuthorID": "meechell83",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110624/profile",
  "Posts": [
    {
      "AuthorID": "meechell83",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110624/profile",
      "Content": "Nov 3, 2010 06:00PM meechell83 wrote: Thanks everyone for the good thoughts and prayers! I've been at home for awhile, but I took a loonggg time. I'm not in too much pain right now. I haven't taken pain meds yet, but trust me I will be taking them soon and get a good long nights sleep! The doctor is going to be out of town next week and wants to see me Tuesday of the following week (in 13 days!) He said I can call his nurse Monday and make the appointment. I hope she can give me the results then. And so now, the waiting game starts again! =( The book Previvors really hit the nail on the head. It says that \"Waiting is the hardest part, especially for a high risk woman. WHen you get your test results, even if they're bad, there is some measure of relief. You can start to formulate a game plan with how to treat the disease. Before that, it's nothing put pure fear\" I also saw a quote at Race for the Cure that I'd like to share \"Courage is the art of being the only one who knows you're scared to death\"",
      "MessageIndex": 7,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760232",
      "Title": "Lumpectomy today... meechell83 leaf"
    },
    {
      "AuthorID": "meechell83",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110624/profile",
      "Content": "meechell83 wrote: Well I'm up at the crack of dawn to get ready to go to the hospital for my lumpectomy. I know how high risk I am (due to Cowden's syndrome and other factors) so I am preparing myself for it being cancer. I made the decision that if it IS I'll go ahead with a mastectomy. If not, I'm having a prophlaytic mastectomy in April (when I have time off of school), I hate not being able to eat (I\"m already hungry, go figure) and my lips are chapped =(, Yesterday I missed my Zumba class because I was trying to get 5 days worth of work done in 2. I almost broke down crying over it because  I am scared it'll turn out to be cancer and I won't be able to go to Zumba for awhile ( I love it!) So send a little prayer and good thought my way please! I doubt I'll be able to post today again, but I'll try when I get home! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760232",
      "Title": "Lumpectomy today... meechell83 leaf"
    },
    {
      "AuthorID": "meechell83",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110624/profile",
      "Content": "Oct 11, 2010 11:46AM meechell83 wrote: Thank you so much for your encouraging words. I'm having a biopsy tomorrow due to a \"very suspicious looking lump\" (exact wording of report from MRI). I'm just ready to know for sure what it is and then I can concentrate on how to treat it. I HATE not knowing! I'm knee deep in nursing school right now and I don't know if I'm at a place to have a preventative mast. (Even though my boyfriend suggested it) . I will go ahead with the surgery if I get a dianogsis. I'm a little confused now. Last year the doctor said that I had DCIS in a lump that they removed. Now, when I called the nurse, she said it was atypia, not DCIS. ??? I don't know what to think. I'm quickly learning that I need to be well educated and knowledgable!  Thanks again, and I'll keep everyone up to date when I get my biopsy results back.",
      "MessageIndex": 5,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/758908",
      "Title": "26 years old, considered extremely high risk and worried meechell83 aslatenrn"
    },
    {
      "AuthorID": "meechell83",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110624/profile",
      "Content": "meechell83 wrote: I'm 26 years old and have a genetic disorder called Cowden's Syndrome. Without going into a lot of details, it gives me various benign tumors (I've had 11 surgeries, including 4 surgeries) and puts me at a high risk for some cancers, including breast cancer. I had a scare last August, when the doctor found DCIS in some cells, but there were no cancer cells. I've been told by numerous doctors that \"it's not a question of if, but when\" and that a bilateral mastectomy with reconstruction is the best way to go. I've decided to go the mastectomy route if I get diagnosed. I'm scheduled for a mammogram/breast MRI tomorrow and I'm terrified. Will I ever shake this feeling of having a time bomb in my bra? Part of me wants this to be over with. I can handle all of the other medical problems I've had, but this is really throwing me. It's like I'm split in half- half of me knows I can handle it and half of me wants to run away scared. Is this a normal feeling to have? The irony of it all is I'm in nursing school. One of my doctors says \"Are you sure you don't want to go into advertising or something?\" Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/758908",
      "Title": "26 years old, considered extremely high risk and worried meechell83 aslatenrn"
    }
  ]
}