{
  "AuthorID": "meg8000",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
  "Posts": [
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "May 22, 2010 04:11PM - edited Dec 29, 2010 02:11PM by meg8000 Annson - What a caring son you are! I know your mom will appreciate having you and your dad around to help her through this. My son was 21 and a senior in college when I was going through my chemo and radiation, and was an hour and a half away at school. I missed him terribly. TC is very doable. I wouldn't say it was pleasant to go through, but it also wasn't terrible, in my experience. I'm only 10 years younger than your mom, and my biggest things to deal with were exhaustion and the bone pain from the neulasta shots that help raise your white blood counts. It feels like having the flu, and I would just lie around a lot. After about 10 days, I would start feeling better and start to resume normal activities. However, each successive treatment beat me down a little more. It was something I just gave in to and let it have its way until it was over. As far as the many varied side effects of chemo go, the oncologist will recommend a variety of products to help with the side effects, along with drugs that, for me, did a pretty good job of controlling the nausea. Our chemo center offered a chemo pack, containing small amounts of all the over-the-counter products that one will need to combat things like mouth sores, constipation, etc. It's worth asking about to save money. I would venture a guess that there are 2 things about this breast cancer ordeal that are experienced by most of us - fatigue and heightened emotions! The whole process of being diagnosed with breast cancer and then undergoing chemo and radiation put me on an emotional roller coaster. My emotions were very close to the surface. I really appreciated the companionship of my family and, because I was exhausted from the chemo, I spent a lot of time in the family room in the new recliner that we had bought for me (which was one of the best things we did prior to chemo). I was too tired to read or do much else, so we watched a lot of movies and TV together. Every night we would watch a new movie from our DVD collection or rent one. One of the best things you and your dad can do, is to spend time with your mom in the evenings. If you mom likes movies, keep the supply of movies coming. Keep the movie topics light - comedy and feel-good movies. I found that b/c of my fragile emotional state, I really couldn't handle any movies where bad things happened. A couple of other things I did on some of my better days were crosswords, Sudoku, and even coloring! Anything that was happy and brought to mind pleasant memories. For the most part, I had a good appetite during chemo. When things would start tasting funny, I would adapt what I could eat. My husband would buy me treats like popsicles or ice cream bars. My son would call or visit when he could. One time he brought me a lovely scented candle and some wonderful hand creams. When I was feeling blue and missing him, I would light the candle and use the hand creams, and it reminded me of his love and his presence. I'm sure your mom would appreciate little gifts every so often. They don't have to be expensive - maybe a new flavored tea, if she is a tea drinker, a nice hand cream or bath lotion/shower gel - any thing that you can think of that she might enjoy. It is always just nice to know that someone is thinking of you. Since you said your mom is deeply spiritual, I'm sure she would appreciate things of that nature - maybe a nice bookmark, a helpful spiritual book or other small religious artifact. A cancer diagnosis is always frightening and worrisome, so anything that will bring peace is helpful. For me it was meditation CDs and peaceful music for my iPod. On some of your mom's down days, maybe you and your dad can rally the troops and \"remind\" a few friends and family that she would really appreciate hearing from them. There is an organization called Chemo Angels that will send cards to anyone undergoing chemo and radiation. I did this and am glad that I did. Every week I got a card filled with cheery news from 2 women who volunteered to be my angels. I cannot tell you how much it picked up my spirits to get those cards every week. It was very touching to know that 2 complete strangers cared enough to wish me well on my journey. Breast cancer treatment is a long haul. Eventually friends and family kind of forget that you are still going through it and stop calling and sending cards, but every week my chemo angels would faithfully send me a cheery note urging me on. I really looked forward to getting their cards, and it really helped perk me up. I apologize that this is so long, but I hope it helped to give you an idea of what this experience will be like for your mom. I wish your mom and your family the best in her treatment.",
      "MessageIndex": 9,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/752837",
      "Title": "Role of a son during the process? Annson Lumpynme"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Jan 18, 2011 05:43PM meg8000 wrote: Good luck to you!!  :)",
      "MessageIndex": 23,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763513",
      "Title": "Please VOTE for me!! Ca1Ripken FireKracker"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Jul 15, 2010 03:42AM - edited Dec 29, 2010 10:34PM by meg8000 That is wonderful, LindaLou!  I know we all hope to get there someday too!  Thanks for sharing.  :)",
      "MessageIndex": 10,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/755284",
      "Title": "10 Year Anniversary Today! LindaLou53 gutsy"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Dec 19, 2010 01:16PM - edited Dec 29, 2010 01:45PM by meg8000 I am so sorry to hear this.  May she rest in peace.  Peace and comfort for her family.",
      "MessageIndex": 48,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762218",
      "Title": "Tonya (Nine_Rugrats) is an Angel JeninMichigan kittycat"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "May 28, 2010 07:32PM - edited Dec 29, 2010 04:12PM by meg8000 <<PFC stands for \"Post Final Chemo\">> Thank you for posting that!  For months I've been wondering what that stood for.  I've looked all over the abbreviations and never found it, so of course I filled in my own name for it and, believe me, my \"F\" word was something entirely different!   ",
      "MessageIndex": 5442,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "May 28, 2010 07:57PM - edited Dec 29, 2010 04:12PM by meg8000 Sherri - You were 2 days ahead of me in chemo tx and your hair looks much longer than mine! My photo was taken about a month ago and now my hair is much thicker, but only about 1/2 inch long.  My hair was a medium to dark brown before chemo and it came in all white and silver at first, but now it is black and white/salt n pepper.  It's a new color for me, but I like it.  I always wanted to go lighter with my hair color, but blonde never looked right on me, but I like the silver.  It actually looks good on me.  So far my hair is still straight and very thick, as it was before, so I'm hoping it will have some body this time, and not be as fine as it was before.  My nails also seem to be coming in stronger.  Before they were very thin and split easily.  I shut 2 fingers in the car door when I was a kid.  One grew in split for about 15 years before it finally closed into a single nail.  The other one is finally a single, whole nail for the first time in over 30 years.  It sure is nice to be rid of that nail problem.  Now I just have to wait for the ridges to grow out.  (Unless of course instead of having wavy hair I am instead going to have wavy nails!)    Meg",
      "MessageIndex": 5444,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Jan 18, 2011 05:41PM meg8000 wrote: I am sorry for your loss.  My sympathy for you and your family.",
      "MessageIndex": 13,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763586",
      "Title": "Another Angel....... Redoat Makratz"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "meg8000 wrote: Ladies - I am going to introduce myself here, as unfortunately I will be joining you. I am 9 yrs out from original diagnosis & treatment (lumpectomy, chemo, rads, hormonals). My husband passed away in July and I injured my arm the night he died. CT & MRI showed no tears in muscles, tendons, but did show abnormal bone marrow and several suspicious lesions & pathologic fracture. Follow-up PET confirmed hot spots with high uptake on pelvis, several lumbar joints, clavicle, humerus. I will have a bone biopsy to confirm & verify particulars of the cancer. MO mentioned radiation treatment for the fracture to help it heal and help with the pain. I also have pain from lumbar and clavicle. MO also mentioned likely treatment might be Ibrance, Xgeva, and hormonals. Treatment plan will follow once we have more information. I am well-read on the BCO forums from my first go-around with cancer, and made myself familiar with the statistics, outcomes, and outliers of the disease. But that didn't help me from sucking in my breath when MO said that average life expectancy of MBC is 3-5 years, followed by those that have mets to single system, especially the bones tend to do better and might be able to gain a few more years, like 7-10 years. I felt the adrenaline rush of fear, despite the fact that I knew the odds. Yes, I know that no one can give us and expiration date, and I know that there are many here on these forums who are doing very well many years out, but that doesn't stop me from thinking about the fact that there are others who aren't so lucky, and we never know which we will be. My husband of 47 years just died (also cancer), and I have a 30 year old son, and he is my biggest concern. I don't want to leave him to the vagaries of life without a father AND a mother. He would be alone, as he is an only child. I need to get at least 10 years out of this, as I think it will be easier for him to cope by the time he is 40 and possibly a little more settled. However, I will prepare for the worst, but plan for the best. Yes, I am scared, as we all are, but I'm also pretty strong and very much a realist. I know that we need to do all our planning, preparation, and education first, and then all we can do is let go of the fear and just roll with it - live our lives the best we can each day, and try to find the humor and love and the best in each day. I live in the greater Atlanta area, and we have CancerCenters of America, with a Breast Cancer Center nearby. I'd like to plan to visit them. Has anyone been to them anywhere across the country? I'd like to know how much more expensive they are, especially since their intake process includes a 3-5 day stay. But I'm interested in not only their expert opinions, latest research, trials, etc., but also their integrative medicine and wholistic approach. I'm not sure they would have too much different to say treatment-wise, but I owe it to my son (and myself) to do all I can for the best care. I also have practical concerns. I am 67 and still working. But I don't think I can continue to work. I have had too much piled on me this year and I just can't deal with it all by myself. I cannot concentrate at work any longer. I have a very stressful job that demands 100 percent attention for mostly 10 hours per day. I can't do it any longer. It's nice that it keeps me in contact with others and gives me something else to occupy my time, but it doesn't leave me the time I need to take care of myself. And since it's all-consuming, it prevents me from having enough time to have a social network. I'm interested in going on medicare, because I think it will help financially. Between my husband and myself, I have paid out of pocket over $12,000 this past year, as well as several other years. I can't keep doing that. Does anyone know if the Medicare supplemental policies have pre-existing conditions? I have heard you have to pay extra based on your health. I only have a week to get signed up before their deadline, although I may have longer because I am eligible for a special enrollment period, but I need to get it done by end of year. I also want to get CancerCenters of America done by end of year if possible, so I don't have to start over with $6000 deductible/out of pocket again next year. I will next need to focus on my personal support network. Due to my husband's illness, he became homebound over the last 10 years, and we had to let most of our local friends fall away. I will need to renew those contacts and I plan on finding and including more wonderful people in my life. My husband and I moved to a 55+ subdivision 3 years ago, and my neighbors have been wonderful. Many of them have their own health challenges, but we all band together to help one another out. It is the best neighborhood I have ever seen in that respect. I will be seeking out bereavement groups and local cancer support groups. I've got to make some friends and have some kind of social life. Most of my friends are distant, and I can't do this alone. I am trying to keep the burden of this off the shoulders of my son. He is pursuing his doctorate and I don't want this to interfere with his ability to study and concentrate on that. It's hard enough for him to lose his father, let alone be concerned with the possibility of also losing his mother, and I'd like him to complete his degree so I know he will be in good standing for a stable career so I don't have to worry about that. I know I am starting to ramble, so please forgive me. I will try to wrap it up. I know I also have a tendency to sound like I have it all together, but believe me, I don't. I'm just like all the rest of you when you heard the news. Scared and trying to cope. Scared of leaving my son an orphan. I will read the bone mets thread (all 753 pages) and many of the other articles and excellent discussion topics here, but that will take time. Any shortcuts or tips you have will be most welcome. I look forward to getting to know you all, and thank you for your kind support. I wish you too all the best in your journey. Dx 10/22/2009, IDC, Right, 1cm, Stage IB, Grade 3, 0/1 nodes, ER+/PR+, HER2- Surgery 11/4/2009 Lumpectomy: Right; Lymph node removal: Sentinel Chemotherapy 12/9/2009 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 3/17/2010 Whole-breast: Breast Hormonal Therapy 5/15/2010 Arimidex (anastrozole) Dx 12/7/2018, Stage IV, metastasized to bone, ER+/PR+, HER2- Hormonal Therapy 12/27/2018 Faslodex (fulvestrant) Targeted Therapy 12/27/2018 Ibrance (palbociclib) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868662",
      "Title": "Newbie with Bone Mets and Alone meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Feb 9, 2019 10:47PM meg8000 wrote: 36 and counting - thanks so much for sharing your insight into your experiences. I hear you about Emory - my husband and I used to go to Emory Spine Center, and it is such a hassle. What takes me less than 2 hours at a local site would take a minimum of half a day at Emory. But despite that, I am thinking at this time of using Emory because of their NCI designation and reputation. I hear you about the one stop-treatment, as I want the same whole patient approach, with an orthopedic oncologist to treat the bone mets. I hope I can get that at Emory without too much inconvenience. Sounds like you have found CTCA to be a good fit. I guess we have to find what we are most comfortable with. I'm sorry you are dealing with this at such a young age. That's got to be rough. Best wishes to you too",
      "MessageIndex": 11,
      "PostDate": "09/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868662",
      "Title": "Newbie with Bone Mets and Alone meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Jan 1, 2011 09:51PM - edited Jan 1, 2011 09:51PM by meg8000 Kira - The higher the percent Ki-67, the greater the risk of an adverse outcome. <10% = favorable 10%-20% = borderline >20% = unfavorable",
      "MessageIndex": 14,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Jan 1, 2011 01:03AM - edited Jan 1, 2011 01:05AM by meg8000 When you are diagnosed with breast cancer, you can never be sure it is totally gone. It has been estimated that a patient with invasive breast cancer must be followed up for at least 25 years before cure can be implied. Most of the prognoses we are given are for 5 year survival rates, and some are based on 7 and 10 years, and these look very good - something like 87% Overall Survival rate for Stage I & 75% for Stage II. Then we get stats from Adjuvant that indicate that after treatment, the 10 year survival rates can be as much as 92% for Stage I. But then I found the following statements on CancerMonthly. It does not have a reference to show what study it came from: That shocked me - half develop metastatic disease?! So, does this mean then that the 5-10 year stats look very good, but decline after that? I think most of us are under the impression that the 92% stats we are given from the onc hold true longer than the 5-10 year mark, but apparently that is not the case. I do know that they just don't have reliable studies much beyond the 10 year mark, but this was a wake-up call to me.",
      "MessageIndex": 37,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762100",
      "Title": "Stage 1 and Mets mari65 barbe1958"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Feb 2, 2011 08:00PM - edited Feb 2, 2011 08:10PM by meg8000 Thanks to you all for your responses and kind words. Please be assured, I would never take names directly from this thread or anything like that - I was just trying to see if there was an interest or a strong objection. Here is one way I thought it might eventually be worked out - once we work out some of the details of dos and don'ts: I thought perhaps, -- when all the details are finalized,-- I would start a thread for women to sign up to be a little sister. Then I thought that only those Stage IV gals that want to participate could pick someone from the list and send them a pm asking if they are available to be their little sister. If the little sister isn't taken yet and agrees, she would update her name and list herself as no longer available and they could exchange names/addresses. We might be able to do it the other way around, but I thought you might like to have the ability to choose. I thought there might be some kind of brief questionnaire exchanged via PM for tastes - such as religious, spiritual, none inspirational, etc. tell a little bit about yourself and your situation do you prefer a one-way or reciprocal arrangement It would have to be decided what types of things are important to know. As expressed by some above - some people want to get to know their little sister and communicate, some might just prefer to look forward to a card that says Thinking of You and leave it at that. There should also be some kind of guidelines such as frequency, duration of commitment, what to do at the end of the commitment, what things should not be discussed. If possible, I would look to you women for some of the guidelines on how you would want to be treated. All of this is according to your wishes first, and I would want to approach this carefully to try to think of as many pitfalls as I could before proceeding. Since there seems to be an interest for some - I will continue to try to develop this and welcome all input, comments and suggestions. It may well be that in the end it cannot be worked out or that it is better left alone. I do not want to do anything that would cause problems.",
      "MessageIndex": 22,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764222",
      "Title": "Little Sisters meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Mar 11, 2011 09:47PM meg8000 wrote: Bumping this for a little feedback. Just trying to know if you think this might work out like this, or is maybe a little too complex and maybe just needs to be a very simple sign-up with very few rules.  Just trying to figure out what would work out best.   ",
      "MessageIndex": 24,
      "PostDate": "11/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764222",
      "Title": "Little Sisters meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Jan 1, 2011 01:33PM meg8000 wrote: Sheila - I agree - those stats look too high, and since they have not provided supporting documentation I am going to ignore them. Iago - thanks for those links.  I agree, they were great.  I need some time to process the information since for some reason, this morning I do not want to think about it.  :-)  Thank you for providing the links.",
      "MessageIndex": 51,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762100",
      "Title": "Stage 1 and Mets mari65 barbe1958"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Dec 3, 2018 08:11AM meg8000 wrote: Jessie123 - thanks for your reply and I'm sorry you are in the same boat - both with the new diagnosis and facing it alone, after the loss of your husband. I agree with you about the Medicare Advantage programs. They did not seem advantageous to me at all, and I was already planning on getting a supplemental program - either F or G. I agree with you about the 'free exercise' programs. That made me LOL! PartyofFive - way to go on your 5.5 years of stability from Tamoxifen. You have gotten great results from your treatment! I can only hope that I will have a similar response. I can see from your treatment history that you must have been through a lot initially. I'm the same in that I always want to have a full grasp of what I am dealing with - the disease, the potential treatments, and risks/rewards of each so I can make informed decisions. Thanks for taking the time to reach out. Cure-ious - you may be right that I am mixing a jumble of problems together. I certainly am trying to sort through things so I can prioritize my actions, and you are right, it is overwhelming at first. It's funny you mention being around for 10 or more years because, from educating myself 9 years ago about what I might be facing in the future, that is kind of what I thought. But it felt like I'd been punched in the gut when almost the first words out of my doctor's mouth were that average life expectancy for MBC was 3-5 years. It threw me for a loop. She did go on to provide other caveats, but I guess I had to pause and absorb that possibility before I could move on. You are certainly right about the shock and awe. No matter how prepared you think you are, it seems to get you. Thanks for the comments on CTCA. I suspect that is an accurate assessment. Thanks for the great info and comments and for taking the time to respond.",
      "MessageIndex": 7,
      "PostDate": "03/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868662",
      "Title": "Newbie with Bone Mets and Alone meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Dec 3, 2018 10:47PM meg8000 wrote: RockyMountaingirl - thanks so much for such great info on Medicare! Your info was clear and very helpful. Yes, I am entitled to a special enrollment period. I have verified that several times over the past year or so with both my employer and the Medicare office, because my employer has >500 employees. Coincidentally, I just went to the SS office today, and took them the letter we also get from our insurance company that outlines their testimony to creditable coverage, and they did explain they need the own form (found on their website) to be filled out by my employer because it is signed by a representative of the organization and includes dates of start of employment and start of health insurance coverage and proves coverage. They (SSA) also reconfirmed that I can sign up at any time and don't have to do it within the annual enrollment period. Thank you, thank you, thank you for clarifying that you have to sign up for supplemental coverage and drug coverage within 6 months of obtaining Part B or else you may face pre-existing condition exclusions. I knew this caveat was still lurking somewhere and wasn't sure where. While I do plan on signing up for all at the same time, this is good information to have - critical even for cancer patients. I have been worried that pre-existing conditions could be excluded at some point in this crazy political climate, and that's one of the reasons I wanted to apply ahead of time, hoping that maybe if that happened, they would grandfather in those who were already covered. In looking at the drug coverage, and plugging in Ibrance, Xgeva, Anastrazole, and even a few shots of Neupogen for good measure, and the out of pocket drug costs came to over $15,000. Lordy! Looks like I'll be replacing my $12,000 out of pocket for medical expenses with about the same in drug expenses. Then again, I haven't really taken the time to figure out how the drug coverage works, so many I'm not understanding that correctly yet. My main objective was to get cheaper coverage than our high cost insurance costs, and also as a way to be prepared to be ready to retire at any time. Thanks so much!!",
      "MessageIndex": 9,
      "PostDate": "03/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868662",
      "Title": "Newbie with Bone Mets and Alone meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "meg8000 wrote: Hello all - Please excuse me for intruding on your forum, but I wanted to ask something. I have early stage bc and have been a member of bco for about 18 months now. I often read the Stage IV forums and feel like I know some of you here even though you may not know me, since I don't post in the forum very often. Frequently I have read posts where women are going through a rough time and I have often wondered if there wasn't some way we early stagers could help out our sisters who have to carry a heavier load - something like a little sister program where we could be paired up and send cards regularly to our big sister. I had a chemo angel during chemo, which was just a really nice thing to look forward to on a regular basis when I was feeling down, and I was wondering if there was any interest in doing something like this. It was nice to look forward to getting a card in the mail, especially when you've passed that time where friends stop calling to check on you. I wanted to ask for your input on whether or not you think a program like this would be something you would enjoy. I was thinking of a program where the little sisters might sends cards on a regular basis - maybe monthly or twice a month - just to let you know we were thinking of you. No thank-you's or replies would be needed from the big sisters. The whole point is just to let someone know that you care and you are thinking about them and want to make the burden a little lighter, not make the recipient feel compelled to answer or reply. Obviously there are details to be worked out, and if there is an interest, we would need to gather input on what kind of parameters we would need to put around this. But first I thought I'd float the idea and see what the Stage IV women thought of it and we could go from there. Maureen Dx 10/22/2009, IDC, Right, 1cm, Stage IB, Grade 3, 0/1 nodes, ER+/PR+, HER2- Surgery 11/4/2009 Lumpectomy: Right; Lymph node removal: Sentinel Chemotherapy 12/9/2009 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 3/17/2010 Whole-breast: Breast Hormonal Therapy 5/15/2010 Arimidex (anastrozole) Dx 12/7/2018, Stage IV, metastasized to bone, ER+/PR+, HER2- Hormonal Therapy 12/27/2018 Faslodex (fulvestrant) Targeted Therapy 12/27/2018 Ibrance (palbociclib) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764222",
      "Title": "Little Sisters meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Dec 26, 2010 06:23PM - edited Dec 29, 2010 04:46PM by meg8000 Congratulations Gabrielle - that is wonderful!",
      "MessageIndex": 35,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745637",
      "Title": "10 years ago at Christmas.... Gabrielle Mimidi"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Dec 17, 2009 10:53PM - edited Dec 29, 2010 03:57PM by meg8000 Hello Ladies!  I guess I get to join the club now.  I am 57 - just turned 58 actually.  I have a loving husband of 39 years and a wonderful 21 y/o son.  I jumped on the BC train on 10/22 after a callback from a routine mammogram.  I was stunned as there was no BC in my family and I had never worried about it.  I opted for the lumpectomy w/SNB on 11/4 (I wanted to move fast and get that thing out!).  Surgeon told me all went well and I was expecting just radiation, but when asked him for a copy of the pathology report and read \"extensive lymphatic involvement\", \"poorly differentiated\", and learned it was a grade 3 cancer, I was concerned, and thought chemo might be in the picture to help out with that.  Had the OncotypeDX and scored 26, so I started chemo (TC x 4 every 3 wks)  on 12.09. I don't mind whatever I have to go through short term to insure a good long term outcome, so bring it on is my attitude.  My worry is the grade 3 and reoccurrence in a couple of years.  I know that will always be nagging in the back of my mind.  But the odds for me are so good at 8.5%, it's hard to ask for much better, so I will go with that as much as I can. I'm on day 9 of TC.  Cut my hair short (myself!) a couple of days ago to get ready.  (It looks cute!)  I understand I have 5 days left of hair, so I will enjoy it while I have it.  Some friends took me to lunch today and a cancer survivor now out of treatment loaned me her gorgeous wig, and I ordered one of those beautiful free $72 silk scarf head wraps  from FranceLuxe.  Tomorrow I'll get my UnderArmour skull cap, and I think I'll be ready for the fallout. Anway, I just wanted to say hi, and thanks for being here for this journey.  It makes it a little easier.  Meg",
      "MessageIndex": 1180,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Feb 15, 2019 09:25PM meg8000 wrote: vlnrph - Yes, I don't have primary bone cancer; it is metastasized breast cancer. I sought out an appointment with an orthopedic oncologist because the fracture in my arm is not healing properly and the humerus is now angulated from the point of the fracture. I have had loss of function in my arm and pain for the last 7 months that I need to have checked out by someone who knows both bones and cancer. Moomonmamma - Thanks for the response. Yes, that is what I have heard also.",
      "MessageIndex": 14,
      "PostDate": "15/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868662",
      "Title": "Newbie with Bone Mets and Alone meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Mar 6, 2011 04:25PM meg8000 wrote: Ladies - Let me first apologize for my absence. I work in a large I.T. shop and we have 3 major software releases a year and just went through one of them - which means lots of working hard and overtime, surrounded by a couple of on-call stints. Anyway, below is my proposal. I wanted to keep it simple, but unfortunately, I'm a details-type of person. I think it is warranted here. Please comment if you think anything should be deleted, added, or enhanced. 1. The intention of this program is to provide a support person in the form of a little sister which is a member of BCO and who has a diagnosis of breast cancer, who will commit to contact her big sister by postal mail for the specified frequency and period of time outlined below. 2. I will open a thread for people to sign up to be little sisters. 3. Little sisters should post on the thread, indicating their desire to be a little sister. 4. The commitment term will be 2 years. 5. The minimum contact frequency set at twice a month. 6. Stage 4 sisters should pick from among the little sisters on the thread and send them a private message (PM) asking to be their big sister. 7. Selections can be based on personal knowledge, profile, posting history, or sign up information that the little sister has posted. 8. Once little sister has accepted commitment to a big sister, she should update her sign up post to indicate that she is no longer available. Please provide the end date of the commitment. 9. Little and big sisters should exchange information about themselves via PM so that personal information can be kept personal.  10. Big sister shall indicate if she desires reciprocal communication with her little sisters, or prefers a one-way form of support. 11. Suggested information exchanged should include name & postal address, name of a friend/family member to be designated as an alternate contact in case of problems, type of relationship desired (one-way, two-way) and personal information such as hobbies, interests, things they like to do, favorite colors, religious preferences, humor, etc. 12. Little sister should PM their Big Sisters quarterly to check how they are doing and to see if anything they are doing is bothersome to big sister. 13. It would be helpful if big sister provides an alternate contact so that, if big sister does not check in, little sister can contact the alternate person to see if there is some kind of trouble or adjustments that should be made. 14. Little sister should adjust her contacts accordingly, and/or inform the board if extra support from the community is desired, should the big sister be going through a rough time, if that is according to the desires of the big sister and/or her family/contact person. 15. Big sister may terminate this commitment at any time by informing little sister via PM. 16. Little sister should try to meet the commitment she has signed up for, but if something comes up that makes her unable to do so, she should inform her big sister by PM and delete or update her commitment post. Big sister may then chose to start the cycle over. 17. What to do at the end of the commitment? Thanks to everyone, and I hope that you will find this to be a rewarding and satisfying means of support.   ",
      "MessageIndex": 23,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764222",
      "Title": "Little Sisters meg8000 meg8000"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Dec 19, 2009 12:43PM - edited Dec 29, 2010 03:58PM by meg8000 Thank you all for the warm, wonderful welcome!  How great to meet all of you and how heartwarming it is to be around others who walk the same path.  It is great to have a cheering squad! I am now off of work for the next 2 weeks.  My son came home from college for a brief visit and will be back again middle of the week.   Best wishes everyone for a great weekend!",
      "MessageIndex": 1221,
      "PostDate": "19/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Jan 16, 2011 02:54PM - edited Jan 16, 2011 02:55PM by meg8000 Boy - they're getting sneaky in posting their advertising these days.  Find a forum, sign up, find an article that deals with the topic of the forum.  Post a link to the article, but do not make it clickable.  Post a link to the product being advertised, but make that clickable, so people will mistakenly click on the link to the advertised product.  Cha-ching!  Each click earns money I guess.    The whole point of the above post is not to discuss the article, but to advertise Recovery radiation skin cream.   Reported.",
      "MessageIndex": 1,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/763452",
      "Title": "Study Finds Racial Disparity in Breast Cancer Outcomes sivananda Marple"
    },
    {
      "AuthorID": "meg8000",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94587/profile",
      "Content": "Dec 2, 2018 04:59PM meg8000 wrote: Zillsnot4me - thank you for your reply. Very heartening to hear from 6 year survivor! Good going! Hapa - thank you for your reply and for all the info about CTCA. In looking at their website, that's what I was afraid of, and just the kind of feedback I needed to hear. You saved me a lot of stress and wasted effort. I will refocus my time and efforts on Winship at Emory and make the trek over there. I still think it would be a wise investment of my time to go beyond my local cancer center. I have a feeling that treatment is fairly standardized initially, but I think there will be a lot more experience at an NCI. Thanks to you both!",
      "MessageIndex": 3,
      "PostDate": "02/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868662",
      "Title": "Newbie with Bone Mets and Alone meg8000 meg8000"
    }
  ]
}