{
  "AuthorID": "meganklauer",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58619/profile",
  "Posts": [
    {
      "AuthorID": "meganklauer…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58619/profile",
      "Content": "Apr 5, 2008 06:32PM meganklauer wrote: Hi Melissa! I just wanted to say that I am 27 and found a lump in my left breast a little over a year ago. After much testing, I had it removed as well as the second area that was found when I had my MRI. Both were b9, but found out I have atypical hyperplasia which puts me in the high risk area. I am on a 6 mo. mammo schedule now, with my next in May. I too found this site to be really great and full of inspiration as well and information. Keep your head up, the waiting is the worst. As the other gals said, the odds are in your favor of coming out b9. Best of luck to you and keep us posted. Megan",
      "MessageIndex": 3,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703445",
      "Title": "Finding a lump at 28 years old melissag0816 ne0n"
    },
    {
      "AuthorID": "meganklauer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58619/profile",
      "Content": "meganklauer wrote: I had an excisional biopsy last Nov. and I seem to be healing well. I go back for a follow up mamm in May. I had 2 incisions both on the left breast. Where the lump on the outside was removed, I can feel another lump now. My question is, is this typical with healing? Can it just be \"filling\" the empty space? Or is it something I should contact the dr about? I don't seem to notice a lump on the 2nd incision area, but that one was deeper and was only detected by MRI. (didn't know it was there until they were checking on the 1st one) I also sometimes get a sharp needle like pain. I am 27 and when I had the biopsy done, everything came back B9 results, but had atypical hyperplasia and thats why they removed both areas. Hopefully this makes sense. I have been searching for info on how the incisions heal, but haven't been able to find anything. Thanks for any info you can share~ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/701379",
      "Title": "Healing after excisional biopsy meganklauer Shirlann"
    }
  ]
}