{
  "AuthorID": "meggie25",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184294/profile",
  "Posts": [{
    "AuthorID": "meggie25",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184294/profile",
    "Content": "meggie25 wrote: Hello! I am 28 and never really worried about breast cancer until several cousins in my age group were diagnosed. About 4 months ago I went to my gyno for a physical and he found what he believed to be a cyst at approx 10 o'clock on my right breast. He sent me for an ultrasound and referred me to a breast specialist (at this point I still had no concerns as my mom has had many breast cysts so I knew they were benign). Personally, I could not feel this lump AT ALL. I was less than impressed with the radiologist - he never even got images of the cyst which the breast specialist was not happy about. She re-ordered the ultrasound and ordered a 3-d mammogram. It took the radiologist 2 months to schedule these tests. In the 4 months between my gyno finding the lump and the mammogram, the lump had grown large enough for me to feel easily. The day of my mammogram the nurse found another pea sized hard non-moving lump on my left breast just below the areola, and the lump on my right breast was now 3 easily palpable lumps. The radiologist could not get clear images from the mammogram, but after the ultrasound decided the 3 lumps on my right breast were swollen lymph nodes. He said that he couldn't find the palpable lump on mammogram or ultrasound, which means it's nothing and requires no further testing. I left feeling irritated that he had given me so little attention and seemed to not take me seriously at all.  I have not heard anything from the breast specialist, so I'm assuming they also feel that nothing more needs to be done. I am concerned that a palpable lump and lymph nodes that have been swollen and growing for 4 months may mean something, most likely nothing, but wait and see doesn't feel like the right answer. I hate to be a pest and I don't want my doctor to think I'm paranoid. Should I ask for more testing?  Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "16/07/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807816",
    "Title": "Should I ask for more testing? meggie25 Beesie"
  }]
}