{
  "AuthorID": "meghar",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172961/profile",
  "Posts": [
    {
      "AuthorID": "meghar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172961/profile",
      "Content": "Apr 4, 2013 07:58AM meghar wrote: How long should it take to get MRI results? My mom had a breast MRI done Tuesday March 26th and today is April 4th - still no news despite 2 phone calls to hospital/surgeon.  Is it normal for it to take a week and a half? Would I be annoying the doctor to call again today? The wait is causing terrible anxiety.",
      "MessageIndex": 22,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802093",
      "Title": "MRI kk12903 meghar"
    },
    {
      "AuthorID": "meghar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172961/profile",
      "Content": "Apr 12, 2013 11:48AM meghar wrote: If the medical professional told you \"it doesn't look suspicious\", I would lean towards assuming (for now) they are correct. MRI is apparently a highly \"sensitive\" but not highly \"specific\" test - meaning that along with cancer, it will detect normal, healthy activity that doesn't show up on other imaging. They also look at other info (washout patterns from the contrast dye) to get a clue about it. So the medical team is looking at and considering a lot of information that is not necessarily even discussed with you when they make a remark such as \" doesn't look suspicious\". If you have any kind of surgery they usually do test the axillary lymph nodes anyway so it should not go undetected in case that is one of your worries. Last year I had an enlarged lymph node under my arm the size of a hazelnut - it turned out to be completely nothing. But you will sleep better if you tell the breast surgeon you want to know with certainty that the nodes are clear - and make sure they either do a biopsy or re-image or whatever they recommend.  And they only mentioned \"a\" node. Sounds like they are very organized and getting results quickly and appointments quickly, so that is a good thing - when you feel your care is in good hands, you can feel less anxiety. ",
      "MessageIndex": 27,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802093",
      "Title": "MRI kk12903 meghar"
    },
    {
      "AuthorID": "meghar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172961/profile",
      "Content": "Apr 4, 2013 10:22AM meghar wrote: Thank you for the fast answers...the phone rang right after I wrote this post and it was the surgeon. More decisions. He said the MRI showed a large area of enhancement beyond the two small tumors we knew about. Based on the MRI, now a mastectomy with all lymph nodes is recommended versus just a lumpectomy which was the reco before the MRI. However he noted that MRIs have a 15-70% chance of \"over stating\" results -meaning it is hard to trust an MRI.  Have to decide whether a lumpectomy which might turn into a repeat lumpectomy or mastectomy is a better choice than just doing a mastectomy to begin with. At 86 either choice has its pros and cons. Time to do more research on all these issues!",
      "MessageIndex": 25,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802093",
      "Title": "MRI kk12903 meghar"
    },
    {
      "AuthorID": "meghar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172961/profile",
      "Content": "Jun 28, 2014 03:29AM meghar wrote: Hi I am looking for an oncologist recommendation in the Danbury, CT area for my mother, age 87, mets to bones, being treated with femara and xgeva...currently she is being treated out of state but is moving back to Connecticut soon as she is doing really well after a roller coaster year and mastectomy 14 months ago. I believe she is thriving because of the excellent doctors who treated her, so it really does make a difference \"who\" you see, especially for metastatic breast cancer. We have a few names but would like to make the right choice - someone kind but really sharp --it matters to my mom that they are nice and at least somewhat friendly. She is tough and wants aggressive treatment if she ever needs it. If anyone has any recommendations, they can private message me if that is better. Thank you.",
      "MessageIndex": 8,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808616",
      "Title": "Any other stage 4 ladies in Connecticut? chanah rosie06ct"
    },
    {
      "AuthorID": "meghar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172961/profile",
      "Content": "Dec 20, 2013 02:57PM meghar wrote: Re: lumps not there before....I just wanted to share that my mother kept remarking on a new \"lump\" or bulge under her arm and on the front of her chest but not near the mastectomy scar. I could see changes in her shape even with her clothes on. We were worried about tumor regrowth, lymph nodes, or lymphedema. We did not think it was a seroma as she had a seroma right after surgery and it was smaller and a different shape. The new \"lump\" was large enough that the medical oncologist actually thought she had reconstruction (saline implants) -(which she never had as she is 87). 3-4 weeks later my mom's entire under arm and chest area 'lumps\" were so pronounced that she was larger on the mastectomy site than the other side (where breast was still intact). At her routine 6 month surgeon checkup, the surgeon said immediately that it was a seroma -- long story short is that she had well over a liter of fluid drained.  Imagine the size of a one liter soda pop bottle under your skin. The surgeon knew immediately that it was not a tumor, not lymphedema, but a seroma. This can happen even months or years after a surgery. It is not ominous (his words) but should be drained if it is large. So going to the right doctor asap is worth the piece of mind. She had it drained in a half hour and was fine. It does seem like it can come back though. I am only sharing this story to highlight that 1) sometimes even huge problems are benign and 2)seeing a doctor sooner than later is still less scary than waiting, thinking, imagining and worrying. If it is a mild problem, you will be relieved. If it is a more significant problem, you will be taking care of it sooner which is always better.",
      "MessageIndex": 1964,
      "PostDate": "20/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "meghar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172961/profile",
      "Content": "Sep 19, 2017 01:29PM meghar wrote: Question for my mom age 90, has been stage IV for 4.5 years with bone mets only. Scan today showed 3 or 4 new small liver mets. She has only ever had Letrozole and xgeva, then Letrozole/Ibrance with xgeva shots monthly. I am trying to brace for the oncologist appointment tomorrow --what kind of treatment do you think might be possible for her next? ER/PR+. Her2-. I want to give her hope --it is really important for her.",
      "MessageIndex": 4230,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "meghar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172961/profile",
      "Content": "Sep 6, 2013 11:35PM meghar wrote: Hi canadagirl I know the MRI is over at this point but it might make sense to research a facility (for future reference) that does sitting up or standing up open MRIs. I found two different facilities here and my mom had two of these sitting up (on a chair), facing a television. I was allowed to be in the MRI room a few feet away. The MRIs were for spine.  It is worth driving a bit far for one of these if a person finds the traditional MRI claustrophobic. ",
      "MessageIndex": 1689,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}