{
  "AuthorID": "MelbMum",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66763/profile",
  "Posts": [
    {
      "AuthorID": "MelbMum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66763/profile",
      "Content": "May 13, 2008 08:49PM MelbMum wrote: Hi Kira, You poor thing. You need a good hug, and I am sending you one from Australia (I assume you are in the US?). You yourself will know which decision to make about whether to have any surgery before the wedding, and if so, which surgery to have but it is a bloody tough choice. I was diagnosed at 34 with DCIS grade 2/3 (actually never got it confirmed, I just didn't/don't want to know). I opted for a double mastectomy with no reconstruction. The lesions were in my right breast, and it turned out the there were none in my left breast, but I have two young kids and just wanted it over and done with, not having to worry about doing it all again in a couple of years. I don't know whether the regime is different here, but they give radiation even with a mastectomy. I coped alright with it, but it did burn me towards the end (I am fair skinned). I won't bore you with the rest of my tale, but just know that I am thinking of you, and I think I agree with the others who suggest that you wait until after the wedding to have surgery. It can have a huge impact on what you can and can't do. Good luck with it all",
      "MessageIndex": 15,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705441",
      "Title": "lumpectomy vs. mastectomy? kira Shirlann"
    },
    {
      "AuthorID": "MelbMum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66763/profile",
      "Content": "May 16, 2008 05:39PM MelbMum wrote: Well one thing is for sure, this drug can't possibly be weight related because I am only on 1000g/day and I am a big girl!! I am over 80kgs (dunno what that is in pounds? 180?). Wonder why my dosage is so low compared to you girls. I only started it this week and last night had my first diahhrea attack and TERRIBLE wind/gas. I really felt for my husband during the night as I couldn't stop farting! (mind you, this could be from the Tykerb?). Anyway, let's hope that the Tykerb/Xoloda combo is as effective in my case as it seems to have been in many other cases. I am fighting a brain tumour (which has regrown in recent months) and some mets in my meninges (spinal column). Hope you all have a good day. It is Sat morning here in Melbourne, and our 11th Wedding anniversary so we are going out for dinner and a movie later. Can't wait! Cheers, MM",
      "MessageIndex": 10,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705623",
      "Title": "XELODIANS, what is your dose? badboob67 Bronx81"
    },
    {
      "AuthorID": "MelbMum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66763/profile",
      "Content": "May 14, 2008 03:08AM MelbMum wrote: Hiya Oz, I am a fellow Aussie (Melbourne, obviously from my name!). I have lost my hair twice and wore wigs when I was out because I HATE drawing attention to myself and I felt that a bandanna or some hats just looked tragic. Can't believe that onc said that! What a load of crap. Even from my vast (sarcastic) medical knowledge, I know that that isn't true. A friend of mine in Melb has just finished 18 months solid of chemo (and herceptin) and the mets in her lungs have disappeared. She is now technically in remission. Have you tried Celebrity Wigs (don't know if they are all over Aus or not), I bought a blonde wig (actually two!) with my first hair loss because I had been blonde, but the second time it had grown back dark so I had a dark wig (which I still have if you want to borrow....) You hang in there girl. Things will get better. It is extremely upsetting to lose your hair again. I was much more upset the second time, but as someone else said, you gotta do what you gotta do. Take care, MelbMum",
      "MessageIndex": 23,
      "PostDate": "14/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705323",
      "Title": "HAIR LOSS ozzie2 maggie1984"
    },
    {
      "AuthorID": "MelbMum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66763/profile",
      "Content": "May 16, 2008 04:09AM MelbMum wrote: It's very interesting for me to find this thread. I had a double mastectomy almost 3 years ago (only the right boob needed to come off, but I chose to have both off to stop the potential of me to have to go back in a year or two's time). At the time I was 34, my kids were 4 and 6. I decided not to get reconstructed after my surgeon gave me a list of positives and negatives regarding reconstruction. The biggest lightbulb was the fact that if I got an infection during chemo they would have to come out. I decided there and then not to do it. I am also not the bravest person and the thought of more surgery down the track filled me with fear. My hubby says he doesn't care, but....... we don't have a great love life, but then again that could be a lot to do with me now being menopausal and not having a libido (have no desire to do 'it' but I'm offended that my hubby doesn't seem to either!!). I wear prothestics and even my kids (now 7 and 9) don't seem to notice that I have boobs during the day, but am flat chested in my pjs!!! A previous counsellor told me that I should really consider reconstruction. I asked her at the time if the new boobs would look exactly as they had before. She told me no, they would be scarred etc, but told me that in clothes, nobody would know. I replied with 'they don't know now!' and she said \"very valid point\". Good luck to all us boobless wonders! My oncology nurse and I reckon we should start a shop selling breast forms and bras and wigs and call it 'The Bald and the Boobless'!!!",
      "MessageIndex": 17,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    }
  ]
}