{
  "AuthorID": "meliss",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
  "Posts": [
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 15, 2010 06:28PM meliss wrote: Add yeast infection to the list of side effects. I woke up this morning and realized that I had better get some Diflucan fast! I have been eating live culture yogurt, but I guess it wasn't enough. I battled yeast the entire time I was breastfeeding, and I know that it is much easier to stop it before it gets entrenched.",
      "MessageIndex": 360,
      "PostDate": "15/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 17, 2010 09:00PM meliss wrote: Hair is starting to fall out now (day 10). Being the procrastinator that I am, I don't have a wig, or hats, or scarves yet. I did go look at wigs today, and am going to another place tomorrow. I do have a closet full of fabric (I'm a quilter), so I can figure something out if I have to before I get a wig ready to wear.",
      "MessageIndex": 423,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 24, 2010 10:54PM meliss wrote: Only have a couple minutes as I have a HUGE research project due tomorrow and I am way behind after losing 3 days this week to that stupid allergic reaction. But, wanted to say I am doing much better now.  Sherry9316: I am hopeful for you that with the new anti-nausea meds round 2 will go much better. If you stay ahead of the nausea with the Zofran and Phenergan, whichever regimen you decide to go with, I bet you will not have as much trouble.  Okay, back to studying.....",
      "MessageIndex": 614,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 15, 2010 06:25PM meliss wrote: RS711: my chemo nurse told me today that nose hairs fall out also. I use a CPAP at night, and my nose and back of my throat are starting to get really dry and irritated. She recommended using a q-tip to apply some vaseline or aquaphor to keep things moist and prevent nosebleeds. She also recommended saline spray.",
      "MessageIndex": 359,
      "PostDate": "15/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 21, 2010 05:21PM meliss wrote: Arggghh....HIVES!  I am on day 15 and woke up in the middle of the night with my hands itching. I attributed it to cleaning the skin with Soft Scrub and not wearing gloves. I have used Soft Scrub many times before, but thought maybe my skin is more sensitve now. Took some Chlor-trimeton this morning and went to work. Took more at 1:00, and by 2:15, my bottom lip was starting to swell. I left the office and went to my onc. My chemo nurse said it is not likely a reaction the chemo this far out. Told me take Benadryl every 4-6 hour and call them if it doesn't get better. Have taken benadryl once; so far no better.  Sheri9316: I agree with DesignerMom.You have been without fluids for awhile and a bag of IV fluids will make you feel tons better. The Zofran and Pheneragan are good. My onc. sent me home with them with instructions to take them the first 24 hours whether I felt like I needed them or not. The pheneragan will make you sleepy though.",
      "MessageIndex": 516,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 27, 2010 02:35PM - edited Jun 27, 2010 02:36PM by meliss cheyanna, anytime my temp goes over 100 my onc wants to do a cbc to check for infection. since our immune systems are compromised, we are more susceptible. your fever could be just a response to your body fighting, or could be infection. without the cbc, they don't know.",
      "MessageIndex": 688,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 29, 2010 07:44PM meliss wrote: Sherry9316: I ordered several different types of hats from both tlc and headcovers.com. I have a small head, and I wasn't sure which styles of hats would work for me. I wanted a variety to choose from, and I will send back what doesn't work. My order from headcovers came in and I liked 2 or maybe 3 of 8 I ordered.  I should get an order from tlc tomorrow. Scarves don't work for me. I look like an idiot. Not my style--I need something with a brim of some type. I have a wig that looks better to others than it does to me. I wear it at work, but at home I go bald unless I am cold from having the air conditioning on in the sauna that Georgia is in right now. To go out casually I usually choose a hat over the hair. Part of the reason for that is I need a band to put under the wig to keep it in place better. I ordered that from tlc. Hopefully that will make the wig stay put so i won't feel like tugging on it all day! I saw a baseball cap on a website that said \"Hairstyle courtesy of my oncologist\" and another that said \"I'm having a no hair day!\" When someone complimented my \"haircut\" at work today, I said \"Thanks, my oncologist provided it!\" They honestly did not realize it was a wig. I don't know if it really looks that real or people are just that unaware...whatever!",
      "MessageIndex": 754,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 26, 2010 07:18PM meliss wrote: Dmom: we are on the exact same path. I had my third round of CMF last Friday. You and I were sitting in the chair at the same time. I spent a good bit of the weekend asleep, but did go to work today. I have a desk job, so I thought it would be fine. What I forgot to factor in was that I had to stand up and give a presentation to parents of incoming freshmen at the college I work for. About 20 minutes into it, I thought, \"I'm not going to make it, and it would be really awkward to pass out in front of 180 parents!\" So, I excused myself for a moment, called my assistant to come over and back me up, and then leaned on the podium for the rest of the presentation. Whew. Won't do THAT again! On the tamoxifen, I don't know yet what I will do. My onc said the standard 5 years if I don't go into chemopause. If I do, then she said the other one whose name I can't remember but starts with an A I think.  I am leaning more toward having ovaries removed. My right one has caused pain for the past several years, and I'm wondering if a hormone imbalance contributed to my bc. When I was diagnosed with bc, I had orginally gone in for my annual checkup and to discuss possible oopharectomy anyway.  Much to research and consider.....",
      "MessageIndex": 1329,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 27, 2010 09:22PM meliss wrote: Bon, I hope you get some relief. My allergist said to take 50 mg of benadryl at a time. Unfortunately, by that time I was so far into my reaction that I needed steroids to get on top of it. But, my skin is pretty sensitive once it starts to react. If I get even the slightest touch of poison ivy, my whole body will break out. So, hopefully, you won't react so much.",
      "MessageIndex": 1366,
      "PostDate": "27/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Aug 11, 2010 09:23PM meliss wrote: I'm so tired now, I could use some steroids!",
      "MessageIndex": 1657,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 28, 2010 02:17AM meliss wrote: kittycat: I've been catching up on the reading I was not able to do for my class last week when I was not feeling good from the allergic reaction. I find that with the first night on a strong steroid, I can just count on being awake. I pretty much plan for it.  I know I will be tired at the end of the week when the steroid wears off and the TC kicks in--I will sleep plenty then! Thanks for your good wishes tomorrow!",
      "MessageIndex": 701,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 15, 2010 10:22PM meliss wrote: Luvumom:  I had an allergic reaction to Taxotere also and had to change regimens. I was given a choice of AC or CMF. I chose CMF for several reasons I will be happy to discuss if you want to PM me.  DesignerMom: I am SO with you on the lack of motivation. I have been doing okay work, but once I get home, I am not interesting in doing much of anything that requires any effort. I think if I were not going to a job working with other people, it would be very difficult to be self-motivated with work. I am taking a summer class for in my graduate program, and it has been very hard to do the work. Normally I am an over-achiever with my classwork, but not this time! I do find that if I can myself started on something, I can usually stay with it. It's just hard to get the energy for that initial kick start!",
      "MessageIndex": 1097,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 17, 2010 07:19PM meliss wrote: Okay, here's a bad joke on the no hair thing...I was at work on Thursday, and it was a particularly \"hairy\" morning. (Okay, everyone groan at the bad pun. I am full of them!) I was wearing my wig that day. Someone asked me how I was doing with the hectic pace we were having that day, and I said, \"Oh, pretty good so far. I'm not pulling my hair off yet!\" It took her a second, then she got what I said and started laughing.",
      "MessageIndex": 1125,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 21, 2010 08:40PM meliss wrote: Hives update: I called my allergist/internist, who is also a good friend, when my lips continued to swell. He said take 50mg bendryl, then 50 more in 4 hours. My lip swelling is going down, and the itching is improving. I hope I can sleep better tonight, andI I hope this is better by tomorrow!",
      "MessageIndex": 519,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 23, 2010 01:50PM meliss wrote: The hives got worse before they got better. Woke up Tuesday in much worse shape, so I went to my allergist. He gave me two epinephrine shots and one prednisone shot and put me on a stronger antihistimine. He also put me on an antibiotic for a low-grade fever/possible sinus infection. I spent all of Tuesday in a drug-induced sleep, thank goodness, so I was only aware of how miserable I was part of the day when I was awake. Today is much better. The swelling in my face has gone down a lot, and the hives are going down and not as itchy. Another couple days on prednisone and I should be okay, just in time for treatment #2 on Monday, June 28.",
      "MessageIndex": 573,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 25, 2010 02:07PM meliss wrote: Welcome, emmalou. We are on the same treatment plan. I have #2 on Monday. Hope today goes well for you!",
      "MessageIndex": 645,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 27, 2010 12:41PM meliss wrote: Beanius, I am very prone to thrush also. I often take Diflucan to counteract thrush when I am on antibiotics. It is a wonderdrug! Nystatin is an older thrush medication that works also, just takes longer.",
      "MessageIndex": 680,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 29, 2010 04:46PM meliss wrote: After much discussion and consultation with others, my oncologist is not willing to try the taxotere again. I am weighing options between AC and CMF. Many pros and cons for both. My other choice is to switch to another oncologist who would try it, but there is no guarantee that I won't still have a reaction and have switched for no reason. Since I am HER2-, I am not convinced that AC is the best choice. But the CMF is a longer regimen. I will see the surgeon tomorrow about a port. He can put one in on Friday. I think I can start either regimen on Friday.",
      "MessageIndex": 739,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 14, 2010 11:50PM meliss wrote: Hi everyone--I just joined the group. Had my first chemo on June 7 (TC) and did well. The only SE that has really bothered me so far has been bone pain from the Neulasta. My hair is still with me, but I expect it to go any day now?  I told our sons that when it goes, I think I will just get a great big tattoo on my head instead of wearing a wig. At ages 12 and 15, they thought that was a great idea! I won't really do it, and they know that, but it was great way to make it a less stressful situation for them. We had a lot of fun thinking of different designs I could get. Have really found all the posts so helpful and am looking forward to sharing the journey with all of you.",
      "MessageIndex": 335,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 8, 2010 08:20PM meliss wrote: Wow--lots of postings to catch up on! I switched from TC to CMF last Friday (July 2) and am doing well with it so far. It was a busy weekend and I was tired, but not too bad. I have been able to work this week and feel good. My onc said that one of her goals with chemo was to put me into menopause (chemopause?). I am 45, done having kids, and that is just fine with me! I had my period a couple days before I started treatment, and I am now a week \"overdue.\" I have been regular as clockwork since I had kids, so I am wondering if it really has stopped just like that, or if I my cycle is just thrown off by the chemo. About midcycle I had really bad menstrual cramps one evening, but then nothing since then. Anyone else shut down like this?",
      "MessageIndex": 951,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 20, 2010 12:09AM meliss wrote: Sherry, hope you are feeling better and get past the nausea soon. Like many of you have said, I can't do plain water very well either. I have been drinking La Croix fizzy waters. They are carbonated and flavored, but not sweetened. On ice, they work very well for me. I also really like Vernor's ginger ale. It has a stronger ginger flavor than Schweps' or Canada Dry.  I woke up last night with terrible bladder pain, and have pushed fluids hard today. Talked to the the on-call doc, who asked lots of questions. We decided to see how I do today/tonight, and he called in an antibiotic to have on hand if it gets worse again. I had a yeast infection earlier in the week, so I don't know if this is cystitis from yeast, a bladder infection trying to get started, or a SE from the Cytoxan. I definitely feel better after more fluids, so maybe I just didn't drink enough on Friday. Found a wig I really like, which surprised me, because the ones I had looked at previously were not exactly making me feel good about how I looked. This one is perfect. When my older son saw me in it, he thought I had gotten a haircut--he could not tell it was a wig. (That could just be because he is a somewhat absent-minded 15yo!) I also ordered some hats/scarves to try from headcovers.com.  Now if I could just motivate myself to do my schoolwork instead of browsing websites....",
      "MessageIndex": 461,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 11, 2010 04:12PM meliss wrote: Sherry9316, did you ask them to check the mistake on your weight? Are you sure you are getting the right dosage?",
      "MessageIndex": 1008,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 11, 2010 05:57PM meliss wrote:",
      "MessageIndex": 1013,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 12, 2010 08:12PM meliss wrote: Julia2, your reaction sounds very similar to mine on the 2nd round of TC. But, my onc would not start the T up again once I reacted. They shut it down and gave me steroids. My reaction stopped very quickly. She would not allow me to continue on TC. She gave me the options of AC and CMF. Since I am HER2-, I opted for CMF. PM me if you have questions.",
      "MessageIndex": 1032,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 28, 2010 02:10AM meliss wrote: So, it's 2:00 am and I am hungry and wide-awake before treatment #2 tomorrow. Gotta love those steroids!",
      "MessageIndex": 699,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 28, 2010 09:37PM meliss wrote: Well, TC #2 didn't go so well today. After 5 minutes of Taxotere, I started to feel lightheaded and my chest started to feel tight. The nurse stopped the drip, and I immediately felt better. She gave me another bag of steroids---I do not want any more steroids of any kind! I was feeling fine, but she insisted. They had someone with a full taxotere reaction last week and she wasn't taking any chances. Blood pressure was up to about 140/80; had been 113/72. No rash, no itching, no throat swelling or itching. Overall, I had no symptoms of systemic reaction. She got the onco doc, who talked to me about changing to AC or CMF. I was not happy about it, but wasn't really processing all of it in the moment. She said either treatment would require a PICC or a medi-port and set me up with a surgeon on Wednesday after we discussed it. He can't put in a port until Friday. After I got home, frustrated and annoyed, I sat down and started to process what had happened. As I thought through it all, it occured to me that maybe what we needed to do was not something as drastic as changing protocol. Maybe we just need to slow down the drip. I have done a bunch of research, and talked to my allergist. I am going to call in the morning and talk to her about trying again. If it doesn't work, then I will make a decision about switching to a different regimen.  ",
      "MessageIndex": 720,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 27, 2010 09:35PM meliss wrote: Bon, your reaction sounds similar to the one I had to TC. It also started two weeks out from treatment, and my onc nurse intially said it wasn't the chemo. I went into full-blown hives over most of my body....it was not fun. Had to take full doses of Atarax (stronger than Benadryl) and prednisone to get things calmed down. Then, when I went in for my next treatment, about 5 minutes into the drip I started to have a reaction, feeling light-headed and tight in my chest. Onc said, no more taxotere, you are allergic. I hope you feel better and you are not reacting to the chemo. Load up on the benadryl!",
      "MessageIndex": 1360,
      "PostDate": "27/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jun 30, 2010 04:00PM meliss wrote: New treatment plan: I am switching to CMF. I will have 5 treatments, 3 weeks apart if I get Neulasta. I can go 4 weeks apart without Neulasta. I am going to opt for the 3 weeks, unless I can't tolerate the Neulasta. I did fine with it the first round of TC, so hopefully it will work out. I go on Friday at 11:00 to start with the CMF. Anyone on CMF have any information on what to expect? We are supposed to go out of town on Sunday to a party, and our 15 year old son is coming home from a couple weeks at camp. He hasn't seen me bald yet!",
      "MessageIndex": 773,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 11, 2010 04:23PM meliss wrote:",
      "MessageIndex": 1009,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "meliss",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103630/profile",
      "Content": "Jul 14, 2010 09:34PM meliss wrote: So, 37 days after my first treatment, and 41 days since my last period, guess what happened today? I started my period! Surprise! I haven't had a 41 day cycle for 20 years!",
      "MessageIndex": 1067,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    }
  ]
}