{
  "AuthorID": "MelissaA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
  "Posts": [
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 13, 2009 01:01PM MelissaA wrote: Hey Lindasa. I know what you mean about being a \"worrier from way back.\" That describes me well. I wish I could just \"turn it off\" but I can't. My husband and his sister say its like an \"easy button.\" They can flip that switch off and on - if they decide to not worry - they actually don't. I even worry about THEM!!! Not worrying!!!! LOL I'm waiting to have an excisional biopsy January 22. I'm just trying to arm myself with as much knowledge as I can beforehand. I know some people don't believe that way, but I want to know what it means. If the doctor says \"benign\" - I know what that means. But if she says something else - I want to know what that means too. So I can be as prepared as possible and ask the right questions. Since I'm a worrier too, I don't have any suggestions for ya. Just thought I'd let you know you're not alone in it. TAke care of yourself.",
      "MessageIndex": 3,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727278",
      "Title": "Tempting Fate? crazy4carrots Mykidsmom"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 14, 2009 09:42AM MelissaA wrote: Hey javagirl39. I'm assuming your name is a reference to coffee?? I'm right there with you!!  I'm so sorry for you what you're going through. I know you are just scared to death. Its a hard feeling to describe to others, isn't it? I'm 38, awaiting biopsy on January 22 for lump in by right breast. What kind of biposy did you have? I'm scheduled for an excisional, outpatient surgery, IV anesthesia. Did the \"looks quite suspicous\" comment come from the biopsy itself, or your mammogram? Do you have supportive people in your life? Friends, family? I've chosen not to tell anyone until the bipsy is over, except my husband and best friend. Let us know how things are going. I'm sending prayers and good thoughts your way. Feel free to message me or email. Melissa",
      "MessageIndex": 2,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727326",
      "Title": "waiting for biopsy results javagirl39 Artemis"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 11, 2009 04:34AM MelissaA wrote: Hi Eve. First off - do not be scared to see a doctor. As for money, does you college have a student health center? Perhaps you could start there. Is it just pain, or do you feel lumps/bumps/masses, etc? Is the pain there all the time when you push on it, or just at certain times of the month?? (Like before, during or after your period). Is the pain new? Breast pain/tenderness can come from lots of different things.",
      "MessageIndex": 2,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727130",
      "Title": "can someone help me? eve_sykes MelissaA"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "MelissaA wrote: Hi everyone. Several times I have wanted to respond to a thread and gotten the error message that I cannot post more than 5 times in 24 hours. Could someone explain why this is happening to me? Is there really a limit? I'm losing my mind waiting for my biopsy and talkig to people on here has really helped!  Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727445",
      "Title": "can somone help with posting question... MelissaA MelissaA"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 16, 2009 10:55PM MelissaA wrote: Thanks everyone. I understand now. I was just wondering what on earth I was doing wrong. Thanks for the info - Shelia. Everyone has been so kind. Talking about it helps me - and everyone here seems more inclined to listen than the people in my real life. My husband and best friend know, but I'm waiting to tell other people. My husband loves me, but he's not a talker and is in a bit of denial about the whole thing. I don't want to drive my best friend too crazy. So I appreiciate everyone listening and talking.  Sharon51 - my husband spends WAY more time on the computer than me.........LOL. ",
      "MessageIndex": 7,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727445",
      "Title": "can somone help with posting question... MelissaA MelissaA"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 24, 2009 07:10AM MelissaA wrote: Hey Moosey and Kelly! I just wanted you know I am thinking you both and will be sending good thoughts and prayers to you this week.  Moosey - I had to wait 2 weeks due to my surgeon's schedule. I had an excisional biopsy this past Thursday. It went really well and the recovery has been very easy. What types of biopsies are you two having? I will have my results as early as Monday afternoon but not later than Thursday. So, I'm just stuck waiting, again.  Again, best of luck to you both and I'll be thinking of you. Hugs and prayers, Melissa",
      "MessageIndex": 5,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727866",
      "Title": "Got my date for biopsy mooseygoosey MelissaA"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 14, 2009 12:50AM MelissaA wrote: Congratulatoins Erica!! Great news on your biopsy.  Take care of yourself.",
      "MessageIndex": 7,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727079",
      "Title": "Holy Crap. ecm aljlbl"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 16, 2009 07:47PM MelissaA wrote: Thanks you guys for letting me know about the posting. Thanks, too for the good wishes. DaughterMom - sorry about your situation with your mom and now yourself. Please post and let us know what you find out today. HOpefully its nothing at all. No one actually every told me by BiRads. They jsut told me there was a \"suspicious\" mass. I looked at the mammogram films myself, they gave me copies to take the surgeon and you could definitely see \"it\" but of course I have no clue what I was looking at. My ultrasound showed nothing at all - so they said no cyst. My doctor said that mammogram report said \"low suspicion for malignancy\". I'm actually doing better the last few days. The biopsy is next Thursday. I do have children - ages 12 and 16. We're not telling them anything yet, though. Hopefully this will post for me......let us know when you hear from your tests.",
      "MessageIndex": 3,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727445",
      "Title": "can somone help with posting question... MelissaA MelissaA"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 15, 2009 10:51PM MelissaA wrote: Webwriter - Fantastic news. That must be such a relief.",
      "MessageIndex": 3,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727412",
      "Title": "PET Results are In! webwriter apple"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 15, 2009 03:46PM MelissaA wrote: Hey Tina - Just wanted to send you some good thoughts and prayers. I know how scared you are. I'm awaiting a biopsy next week - felt a lump and then it showed \"low suspicion for malignancy\" on mammoram. (I'm 38). I have no family history, but I know your family history probably worries you even more. My kids are 12 and 16. We're not telling them though unless the biopsy comes back malignant. How soon after your biopsy will you know something. Glad you have the Zanax. Keep posting and remember that they say 80% of all breast biopsies are benign. Hugs and prayers, Melissa",
      "MessageIndex": 3,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727415",
      "Title": "Just starting and very worried Tina-in-Seattle Lizann22"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 23, 2009 06:24AM MelissaA wrote: Hi Jenn - yes, you do need to get it checked. However, there are other things that minic cancer - cysts and fibroadenomas, to name two. Breast cancer is very rare in a woman as young as you, so try to not worry too much - but get an appointment with your doctor as soon as you can to make sure. Cysts often change (appear, disappear, shrink, grow) with your period. I've read that fibroadenomas are often effected by hormonal changes as well. Its great that you are already so in tune with your body and taking care of yourself so well!! Take care of yourself and let us know if you need anything.",
      "MessageIndex": 1,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727837",
      "Title": "Cancer? Jenn8907 mommy2baz"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 26, 2009 12:48PM MelissaA wrote: Hey Kelly - Thanks for the nice words. I am going to call at 3:00, but there seemed to be some confusion wthi the recovery room nurses. I'm pretty sure the surgeon is not going to give me the results until I see her on Thursday. It was the recovery room nurse who told me to call today for the results. So......I'm going to call and ask. My breast surgeon has a great assistant and phone calls go to her, so she should be able to clear it up. When do you get your results?? Moosey and Jodi W - Will be thinking of you both this week with your biopsies. Mine was an excisional biopsy - no wire localization as it was a palpable lump - and I didn't have any problems at all. virtually no pain afterwards, just a littel sore. Felt a little sluggish that day and most of the next, but I guess that was from the IV sedation - or the stress! I know you both will do fine and I'm praying for you and wishing you benign results! Love and prayers, Melissa ",
      "MessageIndex": 10,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727866",
      "Title": "Got my date for biopsy mooseygoosey MelissaA"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 26, 2009 04:05PM MelissaA wrote: Mommy2baz - So sorry you are getting the runaround. If the radiologist recommended a digital mammogram - it would seem that they meant for you to have it done now - not a year from now. Becuase of hte density of your bresats plus all the scarring, it would seem important to have the test done. Do you have a primary care doctor? Could you get a referral striaght from them for a digital mammogram? I hope you can figure out something! Hugs and prayers, Melissa",
      "MessageIndex": 7,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727844",
      "Title": "Breast Tissue \"Differences\"?? mommy2baz MelissaA"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 15, 2009 09:48AM MelissaA wrote: Hi Barb - Just wanted to offer you some kind words and prayers. I'm waiting to have my biopsy done next week. I haven't even gotten to the \"waiting for results\" phase yet and I am a wreck. Please just know that you're not alone and I'm hoping someone will post soon with more information for you regarding the MRI. When do you expect to hear? Today? Let us know what you find out. Hugs!!! Melissa",
      "MessageIndex": 2,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727390",
      "Title": "Scared Again Waiting for The Call - Any Advice? barb3246 MelissaA"
    },
    {
      "AuthorID": "MelissaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77480/profile",
      "Content": "Jan 28, 2009 01:08PM MelissaA wrote: Hey Laura -  I won't get my results until tomorrow. My appointment is at 9:30 a.m. for the followup wound check and biopsy results. Their policy is to give them to the patient in person - good or bad. So....I'm down to coutning hours! I'm hanging in there though - I've done better than I thought I would. Thanks for asking!  I sure hope you get everytihng checked on the 10th. Keep us posted. Melissa",
      "MessageIndex": 11,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727844",
      "Title": "Breast Tissue \"Differences\"?? mommy2baz MelissaA"
    }
  ]
}