{
  "AuthorID": "melisden",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196671/profile",
  "Posts": [{
    "AuthorID": "melisden",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196671/profile",
    "Content": "Mar 15, 2014 09:45PM melisden wrote: Hello Ladies, I just had my mastectomy 2 weeks ago with expanders placed immediately.  I've had my second fill.  Last week I felt almost panicky because of the tightness.  The chest is a really uncomfortable area in which to feel tight.  It's where you breath!!!  At this point, I feel like the expanders are exaggerating the numbness that is there as a result of mastectomy.  you just have a larger numb area that you feel all the time.  I can't lay on my sides because I have these two LARGE rocks on my chest.  I feel like I'd really like to get them removed and just be flat and free.  I almost feel that if it weren't for these stupid expanders I'd almost be healed and moving on by now.  I might be very wrong about this - but I'm telling you this reconstruction  (and I haven't even had any complications) is a bear.  If I have any complications, I won't continue.  I know that already.  there are so many mixed feelings - it's crazy!  I find myself actually looking at other women's breasts all the time now. I just can't imagine that I'll ever be able to move my arms across my body without running into this weird numb rock on my chest which always keeps draws my attention back to the cancer and mastectomy.  Is there anyone who has felt this way, had implants/expanders removed and now feels better?  Is there freedom across your chest?  Sometimes I wonder if your nerves have a better chance of coming back if they don't have these huge artificial things in the way. Any thoughts and experiences would be greatly appreciated.  Right now I'm being told to just hang in there for a bit longer.  But from what I can see, they will tell you that no matter how far along the way you are.....",
    "MessageIndex": 46,
    "PostDate": "15/03/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/82/topics/807165",
    "Title": "Implants removal with no Reconstructions- Scared Lezza13 Mommyathome"
  }]
}