{
  "AuthorID": "Melleffertz1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189286/profile",
  "Posts": [{
    "AuthorID": "Melleffertz1",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189286/profile",
    "Content": "Melleffertz1 wrote: Back in December I noticed that I was alot of Nipple Discharge.  I put it off as most people do, feeling stupid about a little leaking.. :)  I went to to  OB/GYN and they did a mamm and an U/S and referred me to the Breast Surgeon who then sent me for a Gallactogram (very cool procedure... )  All of my test came back normal, no pappilomas nothing...  So we decided on the Wait and See what happens approach.  I went back and saw her after school got back in session and we decided to remove the offending ducts and the problem had gotten continually worse, she wanted to rule out Stage 0 (and we did).   A week later, I went in and had the procedure done, some minor discomfort but thought I was on the mending road, back to housework, cleaning, laundry, all the mundane housewife stuff (mainly carpooling those kiddos)  Last weekend, 10 days Post Op, my Breast got really sore, I mean ouch it hurts can't stand it, don't come near me sore.  I called Monday and we moved up my post op to that morning.  Great Dr and Great Nurse, glad to have them on my side.  Went in and she removed the steri-strips and said \"looks like you have a hematoma forming and it might be trying to get infected\"  Got my scrip, cried in pain and walked out the door.  Got home, went to Kroger to get 1 gallon of milk.  While I walked into and out of the store my breast leaked everywhere!  I coulda sworn I was going to bleedout.  I called the Nurse and she said to keep a 4x4 or so on it and it should clear up.. After a Shower (yes a shower) to clean up, I was sorer than I had been ever.  I noticed the last 48 hours that things were building up again!  My breast on the left was larger than the right (and it should be smaller now.. :)  )  and this morning the same thing happened again, luckily at home and I just stood in the shower while it drained.  I have resorted to wearing a maxi-pad in my bra.  I go back tomorrow morning to see her again and was wondering if anyone else has had this experience.  I am in a bad place emotionally right now and need to know that others are here.. can't burden my kids and well, hubby is just freaked out by that thing... :)   Thanks for listening it just helps to \"get it out\"   Mel Michigan Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "04/10/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812185",
    "Title": "2 weeks Post Op Melleffertz1 Melleffertz1"
  }]
}