{
  "AuthorID": "Mellaluka",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89159/profile",
  "Posts": [
    {
      "AuthorID": "Mellaluka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89159/profile",
      "Content": "Sep 25, 2009 10:34PM Mellaluka wrote: Hello, my mum, 58, has lung mets, recently dignosed. I have found many women online who have been around for 10 years +. My advice is ignore the stats, they are old and i agree every women is different and with so many options now available and more coming it gives every reason for hope. The fact your mum has been in remission for such a long time is a good sign too.",
      "MessageIndex": 2,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740913",
      "Title": "Lung mets dsus4 Mellaluka"
    },
    {
      "AuthorID": "Mellaluka",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89159/profile",
      "Content": "May 14, 2011 04:22AM Mellaluka wrote: Hello, my mum is in a similar situation, minimal mets to her pleura sept 2009 then mets to liver July 2010 started on herceptin and taxol worked really well, no sign of mets in liver and minimal mets in pleura. This week she had a seizure after noticing a few Symptoms like weakness in her arm and foggy vision in one eye. She now has 2 brain mets. Her treatment now will be whole brain radio, with possible gamma at later stage, no more herceptin for now (possible to go back to it in the future) and will start on tykerb and xeloda. She will also be on a low dose steroid permanently to reduce the swelling in her brain and anticonvulsant to prevent further siezures this has been prescribed by her neurologist which is a new dr to join her team.",
      "MessageIndex": 14,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763995",
      "Title": "My mom's brain mets Cpratt2010 hezzy"
    }
  ]
}