{
  "AuthorID": "MelMel10",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
  "Posts": [
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "May 27, 2010 10:38PM MelMel10 wrote: My first chemo treatment will be June 1st, next week. Have any of you had your port put in yet, and if you have, does it worry the ever-loving mess out of you? Mine is driving me nuts.",
      "MessageIndex": 3,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "Jun 2, 2010 08:15PM MelMel10 wrote: Holli, I am so sorry to hear about your side effects. I hope that you get through it as quickly as possible. I had my first treatment yesterday, and so far have had no SE's. For others asking about orientation - I didn't have one either but when I got there yesterday they spent a lot of time going over all that I  needed to know. They gave me more printouts for each drug and possible SE's and a chemo book that has lots of helpful general info for me. I was almost late for my appointment because I couldn't get off the \"throne\". I was scared to death, but the actual process was no big deal at all. Nothing hurt, nothing made me sick. Try not to worry too much, it was much less of a deal than I imagined.  My port, which was really bothering me, is now fine. I guess it just needed to be used! Process: Nurses first took vitals and blood (from port) and attached the little dangly thing to use for the IV meds, then flushed the port with saline and heparin (there was a slight bad taste, but nothing I couldn't stand). Then before the chemo started, I got flushed again. Next came Decadron (steroids) injected, then ALOXI (a long-acting nausea med). I was given 2 tylenol tablets and 2 benadryl allergy tablets (for total of 50mg) to keep allergic reactions to meds at bay. Then the taxotere was started. That was followed by the carboplatin and herceptin. It took about 4 hours, they go slow the first time to monitor allergic reactions to meds. So far, so good. I have eaten normal meals and have had no side effects (except for a little burping and a little gas). I have heard that the 3rd - 5th day are the bad days for my cocktail, so am quite anxious about the next few days. I'll let you all know what happens! Good luck to all of you who are starting your treatments soon!!",
      "MessageIndex": 84,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "Jun 5, 2010 12:11PM MelMel10 wrote: Hi All, Welcome jezzetoms, hope all goes well with your mom! PennStater - I started having some aches and pains the day after my Neulasta shot, but nothing that was unbearable. The Zyrtec helped alot. One in the am and one in the pm. Day 4 of my first tx was pretty busy, went to the big city of Birmingham for my 2nd opinion (family insisted). The doctor told me the EXACT same thing as my doctors here in town, which was comforting. I was super-tired when I got home yesterday afternoon, but I have still not had any nausea or vomiting. Just achy and easily tired. I am drinking water like mad, and sticking to plain food, but it seems to be working. Last night I woke up with a burning throat, so I used the magic mouthwash which numbs everything it comes in contact with. When I got up this morning I was able to eat a normal breakfast and my throat felt almost normal. For those of you about to get started, if your SE's are as minimal as mine have been you will be just fine. Good luck to you all!",
      "MessageIndex": 138,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "Jun 17, 2010 08:59PM MelMel10 wrote: Hi All, My hair has also started to come out (I'm at day 17 on first tx of TCH). My head started getting sore yesterday and today my hair has been coming out in handfuls. It seems to be thinning rather than coming out in clumps. I have really thick hair and can afford to lose quite a bit (as long as I don't lose it in clumps), so I think that I'm going to wait about shaving it until I see the clumps coming out. I already have my wig ready, so I'm prepared for it when it does happen. This is my \"good\" week, and I have felt pretty much normal, yeah!! My 2nd tx is scheduled for next Wednesday, and so it will begin again, but now I have some idea of what to expect. It's not nearly as scary this time. To all you ladies who are waiting for your first tx - I hope that you all are as lucky as I have been with SE's. I have had very mild SE's, no nausea whatsoever, and have been able to work every day. I am saying prayers for you all and sending hugs and well wishes your way. It was not nearly as bad as I had made it out to be in my imagination. Hang in there everyone! ",
      "MessageIndex": 422,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "May 27, 2010 10:40PM - edited May 27, 2010 10:41PM by MelMel10",
      "MessageIndex": 4,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "Jun 3, 2010 09:32PM MelMel10 wrote: Hi All, By the time I read through all the new posts, I can't keep everyone's straight, must be chemo brain already, lol. Forgive me for not addressing you guys specifically... For those of you who are trying to work through this: Today was day 3 of my first treatment and I was able to work all day. Got up at 4am, ate breakfast with my husband at 5am, was at work by 7am and left work at 5:30pm (probably the steroids, huh?). I had my neulasta shot yesterday and can feel some aches and pains, but by no means are they unbearable. I have eaten normal meals all day, and am hoping and praying that I continue to feel this good over the next several days. My throat is feeling a little \"weird\" so doctor called in the magic mouthwash for me, but I didn't have to use it today. For those who have a problem with the saline taste, a friend of mine said that Red Hots, Hot Tamales and Altoids will help cover it. It did not bother me, but then again I haven't built up an aversion to it yet. Will continue to let you all know how things progress. Reading all of your posts has been so helpful, I am also one that feels the more I know the better able I am to handle it. Thanks to all of you for sharing. I am praying for all of you and sending well wishes your way.",
      "MessageIndex": 116,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "May 27, 2010 11:04PM MelMel10 wrote: Hi Danielaes, Sure, I'm don't know the abbreviations since I'm still new to all this, but I will be taking TCH (Taxotere, Carboplatin & Herceptin) every 3 weeks (6 treatments), will continue the Herceptin for a full year, will do radiation after chemo, and then most likely tamoxifen. I have managed to hang in there pretty well for the most part b,ut have been a bit emotional today. Had Pet scan and port procedure on Monday, and MUGA this morning. Just woke up feeling overwhelmed I guess. Glad to have found this board where others are going through similar issues. It does help to feel that you aren't alone in the fight. ",
      "MessageIndex": 6,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "May 31, 2010 10:51AM MelMel10 wrote: Hi RS711 - I had the BRCA test and it was a breeze. You swish mouthwash around in your mouth and spit it into a container that gets sent off. Luckily mine came back negative. The test was not a big deal, it is always waiting for the results that gets me. I'm glad that I did it because it allowed the other females in my family to know if my bc was genetic or not. MUGA is a type of heart scan. Herceptin can damage the heart (can cause congestive heart failure in some), so they do a preliminary scan and then scan throughout treatment to be sure that everything is alright. Good luck to all of you as you begin your regimen, and thanks to all of you for being willing to share your journeys with the rest of us!! And just so you all know, other board members have said that the port is uncomfortable but it gets better in a few weeks, so keep the faith.",
      "MessageIndex": 37,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MelMel10",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102070/profile",
      "Content": "Jun 9, 2010 07:00PM MelMel10 wrote: Hi All, Sherry - I am also a sweat tea drinker, but I have developed a UTI, so I am staying AWAY from caffiene from now on. Drinking water, juice and then more water. The tongue/throat stuff I got was not the dreaded sores, but thrush. So if you don't have actual sores and your tongue/throat feels funny, this may be the culprit. I still have not had any nausea, they gave me ALOXI in my port before my tx and this seems to have done it for me. I am so sorry to see that some of you are having such bad nausea and vomiting. I've been able to work and eat normal meals, I just get really tired at the end of the day. I am praying that SE's for each of you will be minimal. You guys are an awesome group of ladies, keep the spirit!",
      "MessageIndex": 225,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    }
  ]
}