{
  "AuthorID": "melmcbee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
  "Posts": [
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 6, 2012 06:28AM melmcbee wrote: Diane, thanks for lifting my spirits. I really needed to hear your good news. You are an inspiration.",
      "MessageIndex": 21,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/795952",
      "Title": "Shout out to stage III peeps; update diana50 victoriasecret"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 22, 2012 07:37PM melmcbee wrote: Thanks Boobsinabox (love that name) and Lee. That is exactly what I needed to hear. I was concerned because I have the usual pain and swelling from the mastectomy in my arm and then a month later the dissection was done so I had worse arm pain and swelling from that. I basically feel like a blow-up doll. gained10-15lbs, look pregnant and my arms feel like they have doubled in size. lol. Pin is getting better but I want to put the sleeve on hold till I deal with the chemo and maybe som physical therapy. Hugs to all.",
      "MessageIndex": 3,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/792374",
      "Title": "why did you get your first sleeve melmcbee SpecialK"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "melmcbee wrote: I am just wondering how many people got compression sleeves or gloves before they got lymphedema or is it the norm to not get it for prevention. I am having a time finding someone to fit a sleeve for me without having lymphedema. I am being told that I could just order one off the rack but to be fitted for one they usually measure the arm to see what the compression should be. And will insurance pay for it for prevention. I dont have lymphedema I am still swollen and in pain from the last 2 surgeries that I had. I hope this isnt a dumb question and thanks for any advice. Melanie. mentor smooth round high profile gel 700 rt 550 lt with fat grafting 5/30/2013 Dx 6/24/2012, ILC, 2cm, Stage IIIA, Grade 2, 8/15 nodes, ER+/PR+, HER2- Surgery 7/9/2012 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Surgery 8/9/2012 Lymph node removal: Right, Underarm/Axillary Chemotherapy 8/23/2012 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 1/9/2013 Breast, Lymph nodes Surgery 5/30/2013 Reconstruction (left); Reconstruction (right) Surgery 12/4/2013 Reconstruction (right) Dx 3/29/2017, ILC, Stage IV, metastasized to bone, ER+/PR- Hormonal Therapy Faslodex (fulvestrant) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/792374",
      "Title": "why did you get your first sleeve melmcbee SpecialK"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 14, 2017 05:01PM melmcbee wrote: Sorry that you are going through this stress. It sounds like it could be lymphnodes swollen. Have you been sick sending prayers for good new",
      "MessageIndex": 1,
      "PostDate": "14/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854194",
      "Title": "Armpit swelling and lumps Iowamom35 djmammo"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 1, 2013 03:09AM melmcbee wrote: I wouldnt say its better but I wouldnt stress over it. Just look at it this way, as long as they took out the lymphnodes and surrounding tissue thaan its all gone and you will probably get radiation too just in case. I had all that stuff and did bmx, chemo, and radiation. They threw everything at it. So actully you get more treatment. Healing hugs",
      "MessageIndex": 1,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/811964",
      "Title": "Macroinvasion and Extracapsular peacestrength peacestrength"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 20, 2013 01:19PM melmcbee wrote: Fran my prayers are with you. Try to focus on treatment and getting well. Hugs",
      "MessageIndex": 55,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/812395",
      "Title": "east coast doctors fredntan Janetanned"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 8, 2013 02:51PM melmcbee wrote: Come to Florida. We scan the heck out of you. If you come in the ER you are gonna get something. I see senseless scans all of the time. I personally have had 1 bone scan, 2 petscans, mri brain, mri cervical, pelvic u/s, CT chest/abd/pelvis, 2 cts of the chest by itself, vq lung scan. Ct head. Our doctors are so afraid of lawsuit they have to rule out anything serious before they sign off on you. Maybe it has to do with malpractice laws by state. Now I have had issues this past year and that is why they did all these tests. I think you should ask for what you want. They should at least be running blood work which will show if anything is going on in your body. Healing hugs to you.",
      "MessageIndex": 17,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/812395",
      "Title": "east coast doctors fredntan Janetanned"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 27, 2017 03:06PM melmcbee wrote: Hi Starbright38. I was just diagnosed stage iv too. Im suppose ti start ibrance soon. There is an ibrance thread that has a ton of info in it. Im sorry that you are going thru this. Gentle hug",
      "MessageIndex": 1,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/854550",
      "Title": "starting Ibrance soon starbright38 Lillymillie"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 9, 2012 10:13PM melmcbee wrote: Hi ladies. I am soooo glad that this surgery is over. I havent been back to sleep since I left the hospital at 3pm 8-9-12. They gave me a percocet before I left and I have really had no uncontrollable pain. I took some ibuprophen a few hours ago. I just wanted to tell everyone how much better I feel and the worrying and stress before the surgery was much worse than the surgery. I got my port for chemo, alnd, revision on rt mastectomy scar that had necrosed and wasnt healing, and I have 1 drain. I think I feel so good cause I have no more upcoming surgeries till after all my treatments. Now I just wish they would start the chemo. Shabby I have TE's and was able to start sleeping on my side probably after 1 week with discomfort. they still aggravate me but up until this surgery I was sleeping on my sides all the time.  I rig up pillows all around me till I get comfortable.  Oh and do you mind if my name can be moved up to aug 9th. Damiana, I had my dissection yesterday and dont have the results yet but the 3 nodes they took out during my bmx came back positive with macromets so thats why they went back in and took the rest. But Im also stage 2b unless 1 more node comes back positive. Then it bumps me up to 3. Im so relieved to get as much of it out as they can and then chemo, rads, and anti-hormone.  I agree lets fight it with evrything they got. lol Gma thats hard to find out you are allergic to the tape that way. The worse part of my bmx was the blisters from the bandages. I so empathise with you and now I made sure to stress to them to please use paper tape. It worked cause they didnt send me home with all that thick stuff. Christina and Mlo, my prayers and positive thoughts are with you.  Tazzy how are you feeling.  I hope everyone is feeling better and no more earthquakes. lol I wouldnt know what an earthquake was. I dont know how everyone is so calm about them. However a hurricane doesnt phase me. Thanks to everyone for letting me blabber on. I havent had that many good days since my dx. Im just glad to have a place to share the good feelings and the bad. love to all.",
      "MessageIndex": 545,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 10, 2012 02:07PM melmcbee wrote: How is everyone protecting themselves after the axillary node dissection from lymphedema? Just curious.",
      "MessageIndex": 582,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 13, 2012 04:33PM melmcbee wrote: Thanks Sharon I know that I needed to hear that. Congratulations and hugs.",
      "MessageIndex": 9,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/796273",
      "Title": "3 Years Out pupfoster1 Bugs"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 12, 2012 06:25PM melmcbee wrote: Shabby glad your throat is calming down. Gargle with warm salty water works wonders. Damiana, I did the same as far as pile up a bunch of pillows to keep me more erect than flat. Im a serious side sleeper but someone gave me one of those pillows shaped like a u and it allowed me to lay my head to one side or the other and still have support for my neck. I had pillows on both sides of me in case I did start to roll to one side it was more comfortable.  I have te's too and by like week 2 post bmx I was able to start laying on my side with little to no pain. Still use a ton of pillows. Trailgirl Im allergic to the tape and its been the worst. Warm water soak like Blessing said works great and I also get antibiotic ointment to rub on it as well.  Cottontail welcome glad you are here Christiana0001, I am impressed and glad you are recovering so well. I dont even remember being able to get out of bed after my bmx that soon. What vitamin or supplements do you take. Maybe I need you to give me a diet to follow similiar to yours cause I think you have super healing powers. lol.  Blessings, My daughter and I sat outside last night till about 130am and saw quiete a few meteors. It was nice to just look at the stars and laugh with my daughter. I was too tired and had to come in but we are planning to go back out tonight and see if there is anything to see tonight. Good luck with all my prayers and good vibes being sent to Onelife, Cspreng and Shabby.  Love and hugs to all",
      "MessageIndex": 653,
      "PostDate": "12/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 5, 2012 08:04PM melmcbee wrote: Hi ladies... Still waiting on my surgery date.... I just had bmx on July 9th and now I have to get a port and ALND since my nodes turned out to be positive. Wishing everyone a peaceful comfortable outcome... Hugs.",
      "MessageIndex": 381,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 13, 2012 04:06PM melmcbee wrote: Welcome Elocin. Christiana thats great that your output is so low. Just make sure your drain isnt clogged . Im still putting out about 35ml twice daily and yesterday it was about 50 twice a day. Beckers glad you are back and doing well. Tazzy hope everything is getting better. Good luck to all that has upcoming surgeries and healing prayers to all.",
      "MessageIndex": 667,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 18, 2012 08:05PM melmcbee wrote: Hope everyone is doing well. Shabby I know you cant wait to get those drains out.Thank God you werent hurt in the car wreck. Can you change my name again back to aug 9th whenever you feel better.  Thanks Tazzy hope you are feeling better. Mooleen when you had your axillary dissection did you have pain in your arm that became worse over time instead of better.  I can remember empathising with Damiana having pain so soon after her surgery. Now mine is getting worse and Im not sure why. Also how long does the swelling in the armpit and side of breast area stay? Still swollen since BMX on 7-9-12 and alnd and port 8-9-12 Damiana is your arm pain getting better? What are you doing to help it. Im trying to teach myself this lymphatic manual drainage to see if that helps but so far its not. Maybe its the nerves healing that is causing the pain but i feel swollen still as well. Elise I so hope you are feeling better and that your NS is healing.  Christina I hope you find a surgeon who will listen to what you want. Hmp I hope you are feeling better. The TE's do get easier to tolerate.   Good luck to all who have upcoming surgeries. Healing vibes to those of us that already had our surgeries. ",
      "MessageIndex": 816,
      "PostDate": "18/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 20, 2012 05:06PM melmcbee wrote: Good luck to everyone recovering and all upcoming durgeries. Im also glad that Im not the only one who feels pregnant. I thought something was wrong with me.  Healing vibes going your way to all. Hugs to all",
      "MessageIndex": 901,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 30, 2012 12:15AM melmcbee wrote: Welcome heidi, you found a wonderful support group. Beckers Im so sorry about the infection.  Im sending healing prayers your way. Glad to hear all the good reports. Im getting so far behind the thread that I cant remember what I wanted to write individually so I will just say hugs and healing prayers are going out to all.",
      "MessageIndex": 1140,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 1, 2012 07:37PM melmcbee wrote: 301724 please know my thoughts and prayers are with you. Gentle hugs coming your way.",
      "MessageIndex": 1214,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 2, 2012 09:35PM melmcbee wrote: Wintersocks. you will definitely get your humor back. I was allowed to shower with drains and my drains had clips on them so I just clipped it to a necklace or a lanyard or just a scarf or something that you can put around your neck. I think I put plastic wrap or had the hole to the drain covered while I showered and I didnt spray right on the drain site but it did get wet and I didnt have any problems. Stacey, I stayed 2 nights and 3 days and brought my computer and books and all kind of crap that I didnt use. I didnt feel like doing anything but getting up going to the bathroom, walk around the floor, sponge bath and sleep. Plus I must have recieved all kind of stuff from friends, my breast care coordinator, family. My poor daughter had 3 carts of crap to take to her car and then come back and get me. I dont even think I watched any tv. They had some meditation music channel with like waterfalls and rivers and stuff. I never even changed the channel. Glad I had my glasses though for signing things.  Howhm I hope you get some rest and healing thoughts are coming your way. Gentle hugs Omeggo glad you like what you got. Its nice to see a positive come from this.  Hugs and prayers to all. Hugs to all",
      "MessageIndex": 1231,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 9, 2012 05:37PM melmcbee wrote: Hello beautiful ladies I hope everyone is having a great weekend. Tazzy, I bought a lymphedema sleeve to wear preventively yesterday and I am more swollen today in my armpit area and breast area today. Heck Im 2 months post-op bmx and 1 month post op axillary dissection. Nobody seems concerned with me either. lol. Oh I was swollen before I wore the sleeve it just was worse today.  Elocin I love Zoloft however I may have gained weight on it and just didnt realize that was the reason.  Gma glad you had a good day at work. I hope it goes easy for you.  Cottontail Im sorry your drain site is still sore. I hope we never have to have those stupid things again. lol They really are awful. Sweet Caroline good luck on your upcoming surgery. Blessings Im glad you had a good time. I bet it felt good to get dressed up and see old friends. Hi Marian, glad your surgery went well and the injection was painless. Hope you heal quickly and positive thoughts for your path report. Hi Momtofive, happy your surgery went well. When I was dx I immediately went and got a short haircut and dyed my hair pin. Myabe that was a little too far but it was my way of making light of the situation. I wanted to make people smile. I started chemo 8-23-12 and went back and got a shorter haircut which I really liked. My hair started to fall out Thursday and is still falling out. I cant believe how much hair we really have. Im glad I cut it off before it started falling out. However I didnt shave it yet. Not sure why......... Healing thoughts and prayers to all. Sorry if I forgot anybody. Love to all of you. ",
      "MessageIndex": 1353,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 16, 2012 02:19AM melmcbee wrote: Hello beautiful ladies... I hope everyone is doing well. I hate hearing about the leaks. I empathise because I have a couple of spots that are on my rt mastectomy scar that I cant get healed. I have been putting neosporin on it but not working too good. They are really small so I hope my ps will fill me today. He refused the last time because of them. I need at least 6 more trips to see him and get fills before I can start radiation and I finish my chemo in December. Lets see, I will get my 4th chemo next week. Chemo sucks. Have I said that before?? I am so impressed with hearing everyones exercise and diet routines. I feel so fat and have no energy to workout. lol. I am at least trying to log what I eat everyday so I can see the calories and get a reality check. I would love to know your tricks for increasing energy levels. My 3 yr old just laughs and runs from me cause she knows I cant catch her. Would it be considered child abuse to start throwing pillows at her since I cant catch her???? Hmmm. Oh well I will get her one day. lol NB I pray the chemo  gets you to NED. Ladies I pray all of us get those wonderful letters put in our patient chart. Hugs.",
      "MessageIndex": 1608,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 10, 2012 01:48PM melmcbee wrote: Hi ladies... Feeling a little more sore today but it isnt bad or unbearable. Good luck to Onelife and Shabby. Praying for a speedy recovery for everyone. Shabby I wished when I had my bmx last month that I wouldnt have brought everything either. The hospital gave me everything. A button up shirt or dress is easier to put on to leave the hospital with. But my poor daughter had to carry everything to the room and then everything back to the car. Plus people are bringing you more stuff that hs to be taken home. I took my laptop to get online but I really didnt feel like doing anything but rest. Hugs and prayers to all",
      "MessageIndex": 578,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 26, 2012 08:36AM melmcbee wrote: Sending prayers your way for good news.  I drove myself crazy googling stuff before I was dx. Try not to worry.",
      "MessageIndex": 4,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791083",
      "Title": "Brand new here, but very worried....biopsy today Daisy1966 Infobabe"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 25, 2012 02:42PM melmcbee wrote: So many amazing sories about this life.  I just had a bmx with TE's july 9th and the 3 nodes they took out showed negatively intraoperatively but after being sent off or whatever... they came back all 3 pos for ILC with macrometastesis and extranodal invasion into tissue. what.... So now I go back to surgey in a couple of weeks to get the port, ALND, and some necrotic tissue fixed on my rt breast (all my fault). I dont even remember the first surgery. Lets see,,, get a lump, oh yeah than show all your friends who flip...next get mammos'  us,  and hey dont leave yet we think you need a bx come back in 2 hours. Go home and ice my chest and wait.......than they say oh yeah its positive go to this doctor and that doctor and do this test and that test and here sign here so we can cut them off... now its 2 weeks later and I am finally coming off the drugs and the disbelief. I have breast ca. wow. Glad there is a place to come to vent and learn. I know nothing. thanks",
      "MessageIndex": 180,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 31, 2012 08:24PM melmcbee wrote: Thanks for the article I loved it. I dont think boxing is in m future lol. I hope that I will feel normal again one day.  Im at that phase where I look in a mirror and cant figure out who this person is staring back at me. I mean it doesnt look like me at all. Not just physically. It looks like some weak sick shell of a person. Now my right arm is swelling and I cant decide if its lymphedema or nerve problems. My doctor gave me neurontin to try for the arm pain. Hmm. Did I already tell ya'll about that??? My chemo brain doesnt remember lol. However I had the best day today. I got so much cleaned in my house and organized. I had a great time with my 3 yr old. She has just been so loving lately. Her biological mom came over and went trick or treating with  my husband and Cali. When it was time for her mom to leave she just came to me and didnt cry for her mom. She is finally comfortable that this is home now for her. My daughter, Lacie, who is 25 just was amazed. She doesnt care to much for my 3yr old (Cali)'s mom.  Lacie gave up her shift tonight so she could sit home with me and give candy out. I just felt so much family love and fun today. Im truly blessed. So I know Im rambling but I just had to tell you how much love I felt and how happy I am today.",
      "MessageIndex": 1764,
      "PostDate": "31/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 15, 2012 06:57PM melmcbee wrote: Shabby, I think it was at least a week to 10 days before I could lay anyway other than on my back. I would put pillows all around me so if I rolled on my side it wouldnt let me go all the way and thats ho I started to be able to lay on my side. slow and easy. I thought the damn TE was coming out my right armpit after a day of housework that I wasnt suppose to be doing, lol. Lesson learned. there is a reason why they limit your activities. Hope everyone else is doing well and best of luck to those with upcoming surgeries. Hugs to all",
      "MessageIndex": 722,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 6, 2012 07:22PM melmcbee wrote: Glad you had a good trip Tazzy. You were missed.",
      "MessageIndex": 1939,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 13, 2012 05:52PM melmcbee wrote: Gma so glad you are healing but thats awful to get hit with all those infections. I hope you get better soon. Healing hugs. Beckers I should have my last chemo on the 18th. Thank the Lord. Is everyone getting ready for the holidays? Hugs to all.",
      "MessageIndex": 1954,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 18, 2012 03:21PM melmcbee wrote: Tazzy, its so good to hear from you. The trips you took sound like a perfect way to end your year of hell. What a way to celebrate. I know you will be thrilled to get out and back to work. Thanks for checking on us. You were missed. Hugs",
      "MessageIndex": 1967,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 24, 2012 06:42PM melmcbee wrote: Merry Christmas to all the beautiful ladies who dragged me through the hard times. May all of us be blessed and have a happier New Year. Love you.",
      "MessageIndex": 1993,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 8, 2012 01:00AM melmcbee wrote: Hi all. Finally heard this morning that I will be going into surgery Thursday morning 8-9-2012.  Wishing everone speedy and comfortable healing. I have had my brother in law here helping me this week and it was awesome to just have someone who was here for me that didnt have to be. He kept me laughing all week. Now that the family is in bed I decided to get up and get on the computer and start researching the ALND. Cant sleep anyway cause the TE's are aggravating me. Not terrible pain . I just know they are there and I am such a side sleeper. lol .  Still have swelling from bmx. will I have to have drains again.? hmm.  Well I am sending love and hugs to all.",
      "MessageIndex": 477,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 10, 2012 07:14PM melmcbee wrote: IM so glad you got the drains out. Mine is driving me crazy. The port is also a pain and I see black bruising outside of the bandage. Tazzy  my output was 60, 70, and 45 today.  I didnt get the mastectomy drains out till I was below 20 a day and I still feel they may have come out too soon then because I was so swollen and even my abdomen was swollen although it could just be me gaining weight. lol. I did my exercises after the mastectomy and had great range of motion but Im nervous to start exercising right now cause I feel like im dislodging the port.  Damiana my last surgery I took the pain pills and all other meds on a schedule and it did keep the pain at bay. I wasnt so organized today and its harder to knock the pain out after it gets bad. I need to get back on track with it. June I took my xanax and ibuprophen before my TE fills and it wasnt as bad as I thought. It was no where as bad as the snb injection.  Sleep well everyone",
      "MessageIndex": 594,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 11, 2012 06:27PM melmcbee wrote: Trailgirl I am so sorry you had problems in recovery.. I hope you are feeling better. If anybody has had a port do you remember how long before it healed. When could they start chemo. Thanks for any advice.",
      "MessageIndex": 624,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 16, 2013 09:42PM melmcbee wrote: Hi Tazzy.. Good to see you. I miss you since you went to the IDC 2013 thread. Im on ILC warrior thread. lol Beckers I love the picture and you are beautiful. Hugs to everyone.",
      "MessageIndex": 2176,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 22, 2013 07:48PM melmcbee wrote: Shabby I am sorry to hear that you are still having pain. Its disheartening because that is my only hope is once I get the exchange this pain will go away. It has become worse since I started work and the neurontin and percocet isnt helping anymore. I also dont know if I would choose reconstruction again if given the choice nut I know once its all said and done that I will be happy. Healing hugs to all",
      "MessageIndex": 2207,
      "PostDate": "22/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 30, 2013 04:27PM melmcbee wrote: Nbnotes I am so glad to hear this wonderful news. May you rule the NED throne for a long time. Healing hugs.",
      "MessageIndex": 2233,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 14, 2012 07:02PM - edited Aug 14, 2012 10:09PM by melmcbee So glad everyone is recovering well. Tazzy hope you get some energy back soon. Theres nothing wrong with resting when you need it.  Good luck to those that are going in for surgery this week.  Welcome Littleredoregon. I think I would agree with you to see an oncologist.  I have tissue expanders and all they do is put a needle in thru the front of my breast. The needle look just like a port access needle. It didnt hurt I just felt pressure. I have the kind that have a magnet in it so they can find the access. Some have the access on the side. Wish I could give you more helpful info but Im neew at this too. lol. Im sure some of the more knowledgeable ladies will come around soon. Hugs to all",
      "MessageIndex": 702,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 3, 2012 10:58PM melmcbee wrote: Hi everyone. Im sorry some are still having problems. I promise it does get better. I worked in my yard this weekend and maybe did more than I should. I started having pain in my rt te tonight. I hope to be allowed back at work next week. I see my mo tomorrow to go over bloodwork and side effects. Than I see my ps thursday for a fill. Im glad to see him because I would love to know if the shape of my foobs and armpits are normal. Will they ever be normal.  And man I am mad at myself for causing myself pain. I have felt so good lately.  But lesson learned. I hope everyone here has a pain free day tomorrow. Healing thoughts are coming your way.",
      "MessageIndex": 1257,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 19, 2012 05:39PM melmcbee wrote: Welcome Nancy.. Im amazed at all the stories of postponements. Thats is ridiculous. Im so sorry that people in the medical field are so unfeeling. That would never fly where i work.  Talking about sports bras, When I had my bmx I had to where the sports bra that they gave me and they said as long as it attaches up the front I could get one similiar to it. I hated that thing. I was so uncomfortable that when my PS took it off of me and said I didnt have to wear it anymore. That was the last day I wore any type of bra. I just wear big shirts or whatever. Do you think that may be the cause of me still being swollen. Or the cause of pain in my rt arm. I also had a ALND, rt mast revision and port done since then. I just realized that I must be the only one that isnt wearing a bra.  Justine I love the tats.   Christiana hope you are feeling better without the drains. 301724's daughter, prayers to you and your mom and family.  Cherrie Im sorry they delayed your surgery.  Its always good to get those test out of the way. Im praying for good results. It will be ok. breathe   ohmmmm Good luck to everyone with upcoming surgeries and healing vibes to those recovering. hug to all.",
      "MessageIndex": 853,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 22, 2012 05:54PM melmcbee wrote: Nbnotes best of luck to you. You will be so happy to be done with this surgery. Healing thoughts coming your way. Omeggo, hope you get your drains out. Im real interested in your new meditation. I start chemo tomorrow and have downloaded some free music off of Itunes thats different kind of guided meditation. Im hoping it will relax me but I was wondering what you were using and would love any suggestions. Also What is the tele-talk, is it something on the internet? Hope you are feeling better and healing thoughts are coming your way. 301724, so glad you are back and recovering. Please tell your daughter we appreciate the updates. Thats awesome that your path reports are good. I know that is a huge relief. You sound so good. Try to rest and heal. Prayers coming your way. Tazzy did you get the drains out. Just hang on it gets better quick when they finally take them out. Prayers coming your way. Carrie, so glad you had a great weekend. I pray that you have peace with any decision that you make.  Shabby, so glad you got the drains out. I hope you are on your way to feeling better. Healing thoughts coming your way. Dawn I hope you get your drains out. It has been a day of good news for our ladies. Glad for all the good reports. Hope I Havent missed anybody. HEaling thoughts going out to Blessings and Houndmommy.  Prayers, hugs and healing thoughts going out to everyone on this board, so glad everyone is here.",
      "MessageIndex": 956,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 22, 2012 07:44PM melmcbee wrote:",
      "MessageIndex": 960,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 22, 2012 07:14PM melmcbee wrote: Howhm021, Glad you are feeling well enough to post. Sorryabout the arm pain. I started alternating ibuprophen and pain meds after surgery and it worked. I think our bodies get immuned to stuff so maybe if your doctor said it was ok something else would help. I had the shooting pain and it has gotten better. still have the numbness. I totally know how you feel. I trashed every ice pack i had lol. I hope you feel better and it was good to hear from you.",
      "MessageIndex": 958,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 23, 2012 07:09PM melmcbee wrote: Ladies glad to see some good news and NED's. I had my first chemo today and it went very well. I also found one of those cord things in my rt armpit. I knew what it was immediately cause I had the mondors cord with my implants 15 yrs ago. So I guess I will be calling my physical therapist and try to get my range of motion back. lol. Hope everyone is feeling well and healing prayers are coming your way.",
      "MessageIndex": 998,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 26, 2012 06:41PM melmcbee wrote: Hi ladies and Gent. Welcome to all that found us. I hope everyone is feeling better and prayers to all who aren't. Im not having the best day. Flu like symptoms I suppose from chemo or neulesta shot... whatever. Finally took a pain pill. Havent needed them in weeks. Crying for the last few hours and not sure why. Cant handle my husband or my beautiful 2 yr old grandbaby today. Im just done. So I am getting in bed and sending healing thoughts to all of you. Thanks for being here. Im gonna get me some meditation music going and fall out. lol. Hugs to all.",
      "MessageIndex": 1049,
      "PostDate": "26/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 27, 2012 09:21PM melmcbee wrote: Welcome Happee.. Glad you found us but sorry that it was necessary. Great place and wonderful ladies with lots of info. Everyone has different stories and procedures, so just ask anything specific and you will get lots of responses. I had my bmx and snb on 7-9-12 and have not been back to work. However I also had to have a port placed and a axillary dissection on 8-9-12. I work in a hospital with patients so I cant have any contact until I am sure that I can handle moving people and machines. lol. I feel like I didnt heal as fast as most on this board probably do to the fact that I wasnt in as great a shape before hand. The thought of running 5 miles a day hasnt entered my mind in many many moons. However after a week or 2 when I started getting off of the pain meds and doing physical therapy I wanted to do things that I wasnt allowed to do. I would wait for my warden (daughter) to go to work then I would clean and work in the yard and lift things I shouldnt and then cry all night cause I was in pain later that day. They have specific guidelines for what you are allowed to do post surgery by however many weeks. I was told not to lift more than 3 lbs. what a joke... Just listen to your body. A good stretch is ok but when it gets to pain you should stop. My surgeon would always tell me to not mess up her work. lol. I had numbness and still do in my armpit and arm in certain areas. I also had severe pain in my arm at certain times but now I dont. The stretches and excercises really helped me. I hope you are well and I think you will find a lot of useful info here. Hugs to everyone pre and post surgery. Healing prayers coming your way.",
      "MessageIndex": 1079,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 23, 2012 07:43PM melmcbee wrote: Justegan that was an awesome video. I loved it. Beautiful and loving family. Ladies I hope everyone is doing well. I get my 4th chemo tomorrow.  I have been so weak, sob, and I have back pain and leg pain and just sore all over always. Even today which is like almost 3 weeks after last chemo and neulesta shot. I havent slept so my oncologist said to take the rest of my time on chemo off of work. So I hope it will help my body to deal with it better. I dont remember anyone else having these side effects all of the time. Am I crazy? I have gained 30lbs total so far and I know thats putting a stress on my body and so is my 3 yr old. lol She is running 103 fever. Than to top the week off my nephew has been hospitalized with a brain tumor and it doesnt look good. He is only like 28. Please say a prayer for him too. Now there is 3 of us fighgting cancer between him, me and my dad. I hope everyone is doing well and healing hugs coming your way. Im so glad I have this place to come too.",
      "MessageIndex": 1687,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 31, 2012 06:36PM melmcbee wrote: Summer they only used my biggest one . Im multifocal. I never could figure out how people put that in their signature line. lol.",
      "MessageIndex": 1189,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 31, 2012 04:43PM melmcbee wrote: Hi ladies. Im all about having a pity party or anger venting session or whatever. I absolutely agree with keeping the thread open cause we have already been through so much. I just want to choke my dh too but he is just out of it. Maybe husbands get chemo brain by osmosis or something. lol. Damiana good luck on wed. What drugs will you be getting?  I was scared to death but my first chemo went really well. Actually I love my chemo nurse and I talk to her more than the doctor about any se's im having. Just good luck with the hormone shots and all the stuff that goes along with it.  Omeggo its hilarious that my dh is too stressed to deal with it too but let him hear something about his wife from a friend that he didnt know first and that just kills him. lol Beckers glad your healing. Extra hugs to you with your family spread out all over. You just remember how brave you are. nbnotes hugs to you and I think it must be a full moon maybe thats why we are all weepy and emotional. I really feel lousy today and have had my 2 yr old at home sick all week running fever and uti. However I called the doctor today and said should she really still be running fever after 5 days. Oh and the diarrhea from hell. Now I know what hemmorhoids are. ugh. Thats how my first week of chemo went. lol. Thank God my husband is home and I just came to bed with the computer to try to catch up on everybody. Im so far behind in this thread and I am so sorry for not being on more to offer and inspiration or well wishes to all. I am so glad that ya'll were here and I couldnt have gotten thru this month without each and every one. Love, hugs, and healing prayers to all",
      "MessageIndex": 1186,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 7, 2012 06:35PM melmcbee wrote: I dont blame you and you deserve for this to be over.  Healing hugs",
      "MessageIndex": 1801,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 10, 2012 09:04PM melmcbee wrote: Gma glad everything went well and that you are home.  Healng hugs and prayers to you and eveyone.",
      "MessageIndex": 1822,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 1, 2012 07:25PM melmcbee wrote: Hey beautiful ladies and Gent..... Shabby, the day my surgeon said that I could take that horrid bra off I have only wore support a couple of times.  It works for me cause I couldnt stand the pain. I also used ice and heat on and off if I was uncomfortable. I also alternated my pain meds with ibuprophen and took xanax if I was physically tense. I also take a bunch of vitamins and supplements. I dont know if that has helped or not. But I really dont know they are even there now. So it does get better I promise. Light you some candles maybe lavender scented lotion on to relax and listen to whatever music soothes you.  Hugs to you. Blessings that is a beautiful picutre and you have been such a source of calm and peace in this storm. thanks Alanpamb welcome and I hope you are healing. gentle hugs to you. Cottontail take care of yourself and dont push yourself to hard. Healing prayers are coming your way. Marian good luck on your surgery please keep us posted. Marilyn I hope you have a blast in Ireland. You deserve it.  Lisa hope you are healing well and glad you are back to work. Hopefully I will get to go back in 2 weeks. Wintersocks healing hugs coming your way.  Remember when you see those beautiful scars that they are battle scars that show how strong you are and how you beat bc with each and every scar you see. Those scars are proof that you didnt give up. Wear them proudly.  Omeggo I dont think my armpti will ever be the same shape it was but I do shave very carefully. I had an axillary dissection so I never put a used razor on that side for fear of cutting myself and getting lymphedema. Im also numb on my right side so I have to actually look at what im doing and make very sure Im not shaving to hard. hugs prayers and healing toughts to all. Im so glad yall are on my team.",
      "MessageIndex": 1212,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 11, 2012 10:34PM melmcbee wrote: Thanks Dawn. I woke up feeling like my neck was stiff on right side. The port is on the left and the dissection was done on the right. Its not a sore throat its like muscle spasm or inflamed lymphnodes or something. Good luck to all ipcoming surgeries. Praying for fast healing for you.",
      "MessageIndex": 628,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 1, 2012 02:51AM melmcbee wrote: Ladies I think the last chemo I received on Tuesday is killing me. UGH..... I havent been this sick in a while. Than I had to go to ps to get another fill yesterday and his partner did my fill and liked to have killed me. He jabbed the hell out of me. I honestly dont see the light at the end of the tunnel right now. All I see is sickness. I really cant imagine ever being normal again. I have 1 more chemo to go than I start rads. I just dont feel so positive right now. Kona Im so sorry about your babies. That is awful. 301724 congrats on getting thru this hell. Omeggo I hope you start feeling better Im too weak to even stay on this forum so ladies I love you and hope for great health for all of you. Hugs",
      "MessageIndex": 1914,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 11, 2012 05:32PM melmcbee wrote: 301724, Im so glad you are doing well. You did it. Its over. Yeah...",
      "MessageIndex": 1948,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 16, 2012 03:32PM melmcbee wrote: Tazzy I had my port placement, alnd and repair on rt mastectomy on Aug 9th. lol. I just dont know how to change it on the board. lol Damiana Im in the same boat about shaving I finally couldnt stand it any longer and shaved very carefully and slowly.  Christina I was so glad to get my first set of drains out. I had 2 with my bmx and the first 1 came out great the other side hurt but it was because it healed over the stitch. I dont think that happens often. So dont worry. I now have a drain from my alnd and it doesnt hurt as bad and th surgeon said it was cause it was smaller. Thank God. Good luck to all with upcoming surgeries and quick healing to those rhat have just had surgeries. hugs to all",
      "MessageIndex": 748,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 17, 2012 02:51PM melmcbee wrote: Hi ladies. Hugs to all. Today was my first day back at work. I made it 4 hours than I started vomiting. I didnt realize that I wouldnt be able to take my stomach meds at work. Oh well. At least I am back. I go to ps thursday for my second fill. Healing hugs to all.",
      "MessageIndex": 1428,
      "PostDate": "17/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 4, 2013 07:54PM melmcbee wrote: Nbnotes I am so glad that you felt well enough to spend time with your brother. Blessings I hope your spitting suture area is feeling better and healing. Granellie I hope the the rash gets better. Healing hugs and prayers to all",
      "MessageIndex": 2066,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 15, 2012 04:37PM melmcbee wrote: Hi ladies. Sorry I just havent been on the boards much. I received my 2nd chemo on Wednesday and I feel like I have been beat up. I hope everyone is doing well.  Healing prayers and hugs.",
      "MessageIndex": 1411,
      "PostDate": "15/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 28, 2013 06:52PM melmcbee wrote: Beckers, I pray that your mom is healing and glad that you are able to be with her. I can only imagine how difficult this is for you. Hugs. Gma I hope you start feeling better. Ladies I have missed you. I had my 13/34 rad treatment today. I also finally met with a lymphedema therapist who is going to help me. Of course my hand was down to almost normal size. lol. I hope everyone is doing well and enjoying their life. Love and hugs to all.",
      "MessageIndex": 2115,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 29, 2013 09:20PM melmcbee wrote: Dawn how are you doing? Hope you are healing and on the road to recovery. I just wanted to ask about your status. Hugs Beckers so relieved that your mom has started to get better. I know that is a big relief. Great idea to start physical therapy before you go to work. Tazzy. Im so glad to hear from you. I knew you had mentioned in the past about being on another thread.... maybe 2013 survivors. I finally found that thread ( I think) and it was for IDC and I have ILC so I was disapointed that I may miss out on your new life. You have been such a big help to me and an inspiration since I first started hear. I would miss not hearing about your life. I learned about how to live with cancer and treatment from reading your posts and I hope to learn how to live my new life post cancer and treatment from you. Hugs 301724.... Hey.... So glad to hear from you. How is everything going? How are you feeling. Where are you at on your journey to recovery? Healing hugs Ladies I miss hearing from all of you. How could I have ever made it this far without all of you? Im so thankful for all of you.",
      "MessageIndex": 2121,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 21, 2012 09:36PM melmcbee wrote: Good luck on your surgeries tomorrow Blessing and Hound.  Trinity Moleen and Lisa I hope you are doing well.  Beckers hope you are healing well. Tazzy I hope you get your drains out. Shabby I hope you are feeling better.  Congrats ladies on good results. Healing vibes and hugs to everyone.",
      "MessageIndex": 943,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 1, 2013 08:29PM melmcbee wrote: Gma, hugs from me as well. We will be here when you need us.",
      "MessageIndex": 2226,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 29, 2012 10:15AM melmcbee wrote: Justegan, I know in my heart that you will have your own children one day. Good luck at the clinic. And you are so right. This isnt fair. Get your pillow and put over your face and just scream until you feel better. Than put on some soothing music, light a candle and put a cold cloth on your head and try to relax.  Hugs and healing thoughts are going your way.",
      "MessageIndex": 1123,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 7, 2012 06:06PM melmcbee wrote: Gma, Im glad you are getting surgery and will pray for fast healing. Did you discuss a mastectomy with the surgeon or did you decide to keep your breast and just get the seroma out?  hugs",
      "MessageIndex": 1799,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 24, 2012 08:17PM melmcbee wrote: Hohlm02l, Im so sorry about your stepmom. She sounds very sick and depressed maybe even narcissistic.. If it someone that you have no choice but to get along with then smile pretty and sarcastically say that you will include her in more events. Then turn around and say what you really want to say behind her back. Thats if you dont want conflict with your Dad. Solution 2 is to talk to your Dad and let him handle it. Solution 3 is to tell her off and tell her how much hell she has put you through all of their marriage. However being honest and telling her that may cause a strain in your reltionship with your Dad. Nobody has the right to minimize what you have been through. But if you can brush it off and ignore her it may keep your family from having hard feelings... I am too psycho myself to keep that anger and resentment bottled up. I would have blown up and ruined a family relationship a long time ago. However in my weakened state I have calmed down tremendously and now dont let petty people bother me anymore. I hope you can find peace with yourself. You deserve it. Hugs to everyone. Tazzy that is awesome that you are halfway thru. When I came on these boards you were in chemo and a big inspiration to me so I feel like watching you come to the end of your treatments gives me hope that I will get through this. 301724 good luck on your chemo tomorrow. I did my 4th today. I will be in your pocket with you as well... Nbnotes I have 2 wigs and bought a bunch of scarves but I never wear the wigs. I wore the scarfs and caps to work. I have these hot flashes that start on my head so I basically go bald everywhere and just bring something with me to put on if I feel awkward. Thanks to everyone for their prayers. I found out today that my nephews tumor is extended into 3 lobes of his brain and he will have the option for chemo and radiation. Gentle hugs to all. Love you",
      "MessageIndex": 1700,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 10, 2012 11:58PM melmcbee wrote: Hey ladies, I hope all is well. Kona, Im so glad that you are getting another baby to take care of. I know your last chemo is coming up so I wanted to tell you thet Im thinking of you and hope it is easy on you. Nbnotes, Im so glad that you had the surgery to remove those things that were making you sick. You will feel better one day and probably want to have it done again but at least you can get through treatments first. I go for a fill tomorrow and hate it. I always said if anything went wrong with them I would definitely not do reconstruction again. But I know I would do it again. I so hope you are still well and no more fevers. Hugs Tazzy thats awesome that you are going back to work. Can you believe how far you have come??? How much you have been through?? So happy that you are on this side of healing. Beckers when you come up with a plan to get in shape fast let me know. I have definitely let myself go through all this as well. Good luck. 301724, how are you doing??? Omeggo.. hugs Blessings.  love ya ok my chemo brain wont let me recall all the things that I wanted to say to everyone. I love you guys and I hope everyone is well. Prayers for all.",
      "MessageIndex": 1946,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 2, 2012 06:07PM melmcbee wrote: Gma you are so much tougher than I would have been. That breadt would have been gone a month ago. I will say extra prayers for you. You inspire me and if you really want to keep that breast than keep fighting . Omeggo and 301724 Im so glad ya'll are feeling good post chemo.  Omeggo I couldnt even imagine sitting in a gym parking lot much less walking in and actually working out... You go girl...lol Im with 301724... what is a mammaprint? Well I went to see my oncologist nurse and showed her my arm and hand and she said it didnt look that bad to her and they would take care of it before it got bad. They are getting me an order for a glove to go with my sleeve...  I personally think my hand resembles a small boxing glove. lol. Oh well life goes on I hope everyone is feeling great and healing prayers are going up for everyone.  Hugs",
      "MessageIndex": 1780,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 15, 2012 09:05PM melmcbee wrote: Blessings that sounds like it was a blast. Glad you had a good time. Gma Im so sorry that you are feeling so bad. I hope you feel better. Beckers, I work in a hospital on my feet too. I havent worked but maybe 1 month since July. I just couldnt do it. I need to go back and I hope that once I finish chemo I will start feeling better. I just dont think I will ever have the same energy level that I had before diagnosis. Everybody says that radiation will be a piece of cake. I hope so. Healing prayers to everyone.",
      "MessageIndex": 1959,
      "PostDate": "15/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 17, 2012 07:05PM melmcbee wrote: Gma Im sorry you are having such a hard time. I dont know anything about respiratory care or CPAP. Gma, healing hugs Beckers, I am a radiological technologist. I do xray, Cat Scan and I am training in MRI. Tomorrow is my last chemo... Yeah... I know I will be sick for a while but Im so glad its the last tme and maybe I will finally get rid of the body aches that has bothered me for months. I see the light at the end of the tunnel. Hugs to all",
      "MessageIndex": 1963,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 16, 2012 05:29AM melmcbee wrote: Gma Im sorry you are having problems with le... glad you got your drains out. You so deserve a break. Tazzy thats amazing that your journey is over. You handled it with grace and strength. Im so happy for you. I might have missed it but do you have to take tamoxiphen or anything? Thanks for all the inspiration you have given me. Ladies it has been so good to hear from all of you and Im so proud to be with a group of strong yet kind ladies who have given me laughs and let me whine when I needed to. My 5th chemo has been put off cause of this stupid cough that I have but at least I get some peace and get to spend the holidays with my family. I did get a fill yesterday and still need 4 more visits before I can start radiation. Te's arent bothering me anymore so  thats a blessing. Healing hugs and prayers to all and thanks for being the greatest support group out there.",
      "MessageIndex": 1851,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 7, 2012 03:49PM melmcbee wrote: Hello ladies. I hope everyone is feeling better. Healing prayers are coming your way. Hugs.",
      "MessageIndex": 1332,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 19, 2012 06:09PM melmcbee wrote: Hi ladies. Glad to hear that everyone is moving right along in their treatments. I also go for my second fill tomorrow. Juste I am so glad that you dont have to go through with all of that. You are young and strong and will get through this with flying colors.  Blessings, love the song. Tazzy Thats aweome that they already set you up to start rads. Im so thankful your journey is almost complete. You have fought a tough battle.  Shabby, how on earth do you feel like working out? I want to throw up just thinking about it. lol. Im so miserable and fat and bloated that I dont even have energy to do anything. I did go back to work Monday and that has beenpretty much a nightmare. I was always the hyperactive one constantly running around and now I just drag from 1 room to the next with many bathroom breaks in between. The only thing controlling my nausea is to eat. ugh.. Healing hugs to all",
      "MessageIndex": 1435,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 4, 2012 09:15PM melmcbee wrote: Congrats 301724 on your last treatment that is so awesome. I also wanted to tell everybody that Im starting to feel better so Im sorry if I have been whining lately. Thanks to everyone for picking me up because I was really down and didnt see the light. Hugs",
      "MessageIndex": 1925,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 24, 2012 05:45PM melmcbee wrote: Hi ladies, Im glad to hear that everyone is coming along with their healing. I didnt get my fill last time cause my ps saw a tiny spot that wasnt healing that great so I was disappinted. I was able to work around 24 hours last week due to dr appts and just being sick from chemo.  Today I was in the shower and felt a huge lump in my right armpit and I just FREAKED. Fell apart at work and called my mo who told me to come in and he felt it and said not to worry it was just scar tissue. I cried the rest of the day and dont know why. As far as the Pinktober thing, it doesnt really bother me. I used to do the cancer walks for ACS Relay for Life so I decided to make me a page this year cause I want to walk the survivor lap. Since I have been around it for 15 yrs it felt right. I think my friends and family have bought every pink ribbon shirt, sock , glass, ect thats on the market and given it to me. Sometimes I feel like wearing it and sometimes I dont. Since I go to work with a scarf on my head its sometimes easier to just wear the shirts cause it keeps people from asking me whats wrong. lol. Anyway I hope all of you have a blessed night and healing hugs to all.",
      "MessageIndex": 1463,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 18, 2012 02:01AM melmcbee wrote: Hey I cant fit into mine either. I will have to buy bigger ones. lol",
      "MessageIndex": 1965,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 29, 2013 11:58PM melmcbee wrote: Dawn Im so envious of you getting your TE's out. I cant wait for the day to get mine out. It will be at least 3-4 months after I finish radiation before my plastic surgeon will touch me. lol Changing the subject ladies.... Did anyone who had chemo go into menopause from it and if so is it a permanent thing. Thanks for any info.",
      "MessageIndex": 2123,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 9, 2012 03:50AM melmcbee wrote: Hey ladies.. I have missed all of you. NB I am praying for good results. I lost the thread that everyone was on. I will remark it as my favorite. I have terrible chemo brain.  Just.... love the do. I havent been able to get any fills due to a tiny scab. Trying to heal it up. I just had my 3rd chemo and the se's are manageable but now I have a cold. Trying to work but I am unable to make 30-40 hours a week due to fatigue. Healing hugs to all. ",
      "MessageIndex": 1518,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 27, 2013 06:22PM melmcbee wrote: Nb its so good to hear from you. How is everything going. Sometimes I go to stage4 boards just to see if your posting. Where do you post most often. I guess that makes me a stalker. lol Beckers that sucks that you have to deal with both. Tazzy I Would love a few days of me time.I hope you enjoy it. btw.. I wanted to ask how work was going. ladies all my love to you. I couldnt have made it this far without all of you. My mentality is to go camp on a beach and drink,smoke, and eat what i want and enjoy life. It definitely wasnt to do all this crap and be sick and in pain. lmao. My exchange is Thursday and I am done. Thanks for all the support.",
      "MessageIndex": 2268,
      "PostDate": "27/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 29, 2013 06:14PM melmcbee wrote: Gma I am sorry you are hurting and I totally feel your pain. Ive had te pain for 11 months. Are you having neuropathy, if so neurontin would help. Maybe try swimming for exercise because its suppose to be less stress on your body. I wish I had some better advice for you. Im praying my pain will be over after my surgery tomorrow. Healing hugs",
      "MessageIndex": 2278,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 8, 2013 06:00PM melmcbee wrote: Love the happy dance Tazzy. Gma, how are you feeling?",
      "MessageIndex": 2153,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 28, 2012 04:37PM melmcbee wrote: Beckers Im so glad you are feeling well enough to let us know how you are doing. Sounds like surgery was a success. Tazzy that trial sounds promising. You are so brave. Waterpolomom, Im sorry you are having problems and I am glad you told us. I never thought about putting lotion anywhere except my arm and chest area. Thanks for the warning.  So busy takiing care of the breast cancer that I have let the rest of my body go. Kona, so happy that you are enjoying the puppy. They are such a blessing. Nbnotes glad to hear from you. Hope you are feeling better. Omeggo glad you are finished with chemo. Im with you on waiting for side effects to be over. 301724 so good to hear from you and hope you are doing well. Gma how are you getting along? Hope I didnt miss anyone. I hope everyone is doing well I had a clean pet scan today... Yeah!! except chemo changes in my bones. I just laughed and said I told you my bones hurt.... I start radiation Jan 9th. Hugs to all.",
      "MessageIndex": 2028,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 29, 2012 08:16AM melmcbee wrote: Thats awesome Nbnotes.... So happy for you. Hugs",
      "MessageIndex": 2033,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 16, 2013 09:52PM melmcbee wrote: Im doing well. I finished radiation a few weeks ago and went back to work part time last week. I will get my exchange in about 3 months. Wish I had more energy but I assume it will come back soon. lol  How are you doing? Hugs",
      "MessageIndex": 2178,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 18, 2013 07:26PM melmcbee wrote: 301724 so glad to hear from you and glad you are finding your new norm and getting back to your races. Tazzy I am all about the post it notes too. lol Beckers I am working about 20 hours a week which is broke up into 3-4 days a week. I am struggling with getting tired and sore especially from moving patients.  I think I gained 2 lbs from eating candy that I shouldnt have sarted again. Blessings, I am unhappy with my te's and my ps told me that my implants will not be as big as my te's. I am disappointed but these stupid te's are hurting me so I guess if I went bigger it would be uncomfortable. Im sorry you are not happy with your reconstruction. I totally understand how disappointing that must be after all that we have been through. I also feel like I wont be happy but then I told myself that if it at least stops my pain to get my exchange then the size wont matter. He told me that I would be a size C so I guess I should be happy. Nbnotes I am glad that you are not having hot flashes as much anymore. My last chemo was Dec 18th and it put me in chemopause. I have not started my Anastrozole yet and I have hot flashes all of the time. lol. August sisters I am so glad to hear from all of you. I wanted to tell you that I had some bad news yesterday. My 32 year old niece has had a reccurrence of her osteosarcoma on her foot. She will have surgery, rads and chemo. She had this last year and they did surgery and 6 weeks of rads. Thay had to stop at 6 weeks cause they found out she was pregnant. She was told that she had a 3% chance of reccurence.  Then I was diagnosed and then my 28 yr old nephew was diagnosed with inoperable brain tumor Astrocytoma. I cant believe that the 3 of us lived in different parts of the country and all were diagnosed within a year and at such a young age. I am just in shock. Love and hugs to all of you.",
      "MessageIndex": 2195,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 8, 2013 03:21PM melmcbee wrote: Hey ladies. Hope everyone is feeling better.  Beckers glad you are healing from surgery. Justegan and Ali good luck on finishing your chemo. Gma how are you doing? Dawn glad the cellulitis is getting better. Hope I didnt miss anyone. Healing prayers to all. I start radiation tomorrow. Glad to be finished with chemo. love yall",
      "MessageIndex": 2071,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 11, 2013 05:40PM melmcbee wrote: Meg, I love you and wish you the very best. Please know we are here whenever you want to say hi.",
      "MessageIndex": 2083,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 17, 2012 01:45AM melmcbee wrote: Gma healing prayers sent to you. Hugs Beckers. Im sorry that you feel yucky. Maybe it will take time for your body to adjust. Healing hugs sent. Hope everyone is doing well",
      "MessageIndex": 1623,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 30, 2013 08:30PM melmcbee wrote: Hey Kona, my husbands birthday is Feb 4th and that is on Monday. I just wanted to let you know so you can verify your surgery date. I would hate for you to show up a day late for surgery. lol. Wear some big pockets and I will bring you some birthday cake. Good luck and healing prayers.",
      "MessageIndex": 2127,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 7, 2013 08:45PM melmcbee wrote: Kona so glad you are doing well. I knew birthday cake would do the trick.. lol.  Glad you are happy with the results. Hugs",
      "MessageIndex": 2147,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 17, 2013 04:25PM melmcbee wrote: Happy St. Patrick's Day... Nbnotes and Tazzy if I had known then what I know now I Would Not have done reconstruction. It has been the biggest pain bith emotionally and physically. I dont blame any of you for choosing to take a break. I cant wait for a break. lol. Beckers I am so sorry that the Tamoxiphen is giving you trouble. Nbnotes I will be taking Arimidex so can you tell me how you are doing on it. How did the hysterectomy go? Hope you are doing well. Gma so glad to hear from you. Have fun at the party",
      "MessageIndex": 2187,
      "PostDate": "17/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 29, 2012 07:33PM melmcbee wrote: Hi ladies... I just wanted to check in and say hi. I just had my 4th chemo last Wednesday and it is definitely cumalitive. I am so drained. I am nauseous yet fat... I have gained 30 lbs total. The weight is making me feel like crap. I have a cold. lol My 3 yr old has been sick for a week. I have bad back pain and 2 days ago I started having sharp pain radiating down my right arm. So my mo put me on neurontin today and is sending me to a neurologist. Gee great another copay.  Ugh... They also did an ultrasound on my axilla just to make sure there was no hematoma or anything. I only have 2 more treatments then I get to go to radiation. Nona I think my last tx will be Dec 4th. Yeah.  Trinity the claritin helps me with the general bone pain from the neulesta shot. The water is a big help too. Oh yeah and how could I forget the mouth sores/ dry mouth. I must have not chewed on enough ice this time. Popsicles usually help me with that but I forgot them this past time and only chewed regular ice. Who was it talking about the fat thing.... Beckers? Blessings? Well I want you to know that you cant possibly be as fat as I feel. lol. I have to keep telling myself that when we start to feel better with more energy we will be able to move more and lose this weight. I know we can. I hope everyone in the NorthEast US is ok and holding on. Prayers are sent your way and prayers to all of us Strong Beautiful Women that are se's are minimal and that are surgical sites are healed. Love to all of you.",
      "MessageIndex": 1750,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 1, 2012 02:25AM melmcbee wrote: Beckers, Im not sure what an open adoption is but I dont think we have that. Family and children services were gonna take those children away from her and after a year of her not doing her plan that they gave her to do, we talked her into signing custody over to the state of Florida. We were her foster parents for a year until the adoption was final. She is ours free and clear and the State of Florida could care less if her mama ever saw her again. We let her mom see her because she loves her mom and wants to see her. We could cut her off at any time. She has no legal right to see her. We just dont let her go off with her mom unsupervised.",
      "MessageIndex": 1771,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 5, 2012 04:37PM melmcbee wrote: Hi ladies. I hope everyone is doing better. Well I couldnt take it anymore so I called the mo and he saw me today. It was burning when I urinated and I knew I had to goout f town tomorrow. Glad I went because my urine has blood and wbc in it so that gave a reason to get an antibiotic. He gave me magic mouthwash for the throat pain and more cough syrup. Today my nausea has dissipated mostly and I am finally starting to feel a little better. Thanks again for letting me whine until I could pick myself up. Hugs to all.",
      "MessageIndex": 1932,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 26, 2012 03:20PM melmcbee wrote: Beckers I want to go in your pocket too. I know you are nervous but you must be excited as well to be finishing up surgery. This is the last one right? Im praying for you. Hugs. Hey can anybody give me any insight when this horrible taste goes away. Will my stomach ever get straightened out and my legs quit hurting? Im 1 week pfc. Thanks. Love to all",
      "MessageIndex": 2007,
      "PostDate": "26/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 29, 2012 11:14PM melmcbee wrote: Omeggo, Im sorry you are feeling so bad. Like you said... thank God its the last of it.  Beckers, how are you feeling? Im so glad to see you posting on here. Healing hugs to all.",
      "MessageIndex": 2037,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 3, 2013 05:04PM melmcbee wrote: Omeggo hang in there. Im right with you. My GI stuff finally dissipated. Still having the bone pain and weakness. Healing hugs. Gma Im jumping in too. Hugs 301724, I am so sorry that you are having problems. Praying the antibiotics work quickly. Hey Tazzy and Blessings Granrllir glad you made it through the holidays. Beckers I  am so sorry for your loss. Prayers sent for you and your family. Nbnotes congrats on 5. Kona sorry I hope you get the info you are looking for on Tamoxifen. You may want to post it on the hormonals forum. Hugs Happy New Year to all. Love all of you. Praying for everyone.",
      "MessageIndex": 2059,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 12, 2013 07:37PM melmcbee wrote: Gma I know that must be a tough situation. Im sure the oncologist office has some kind of help programs or in your town. Like here there are a couple of breast cancer programs that help patients who dont have insurance. I pray that your doctors will work with you. Kona that is so exciting about going to Vegas.. Woo-hoo.. Sorry I havent been in an airport but I did have to go to the courthouse and they have one of those doors that you walk through that beeps if you have any metal on and it didnt beep when I went thru. My chemo brain cant think of the name of it. Pathetic isnt it? lol. Cant remember anything. Dawn thanks for asking. radiation is going fine. I have had 2 treatments. No problems yet. Healing hugs to all my sisters",
      "MessageIndex": 2089,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 26, 2013 07:42PM melmcbee wrote: Dawn its so good to hear from you. Glad you had the recon already. I should be getting mine in a few months. Im scared that I wont like mine too. What is it that you dont like if you dont mind me asking? Gma I am so sorry you are still having problems. I am back at work too and have a terrible time making it through the day. I get so tired and legs are sore. I also still have pain in my breast but its mostly at night time. I feel like I am getting feeling back in my breast now. Not all of it just some areas. I think my nerve ppain is from these damn tissue expanders. ugh I hate them. Healing hugs to you. Hope everyone is doing well. Hugs",
      "MessageIndex": 2215,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 16, 2013 06:00PM melmcbee wrote: Oh GMA, Im so sorry that you are having problems. Healing hugs to you.",
      "MessageIndex": 2246,
      "PostDate": "16/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 21, 2013 07:43AM melmcbee wrote: beautiful",
      "MessageIndex": 2249,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 28, 2013 01:43PM melmcbee wrote: Oh Gma, Im so sorry. I know how painful thats is. NBNOTES, I so know what you mean. Its like once we finish all treatments and they say ok go on with your life, its a struggle. I think we fought so hard for so long that now we have slowed down and have time to grieve or be angry or depressed. Im still sttuggling with when will I feel better. Its like we have a form of ptsd. So glad to hearfrom you. Tazzy thats why I asked. I still feel like crap and unable to work again. I will get my exchange surgery Thursday and I hope I will return to normal after that. Healings hugs to all.",
      "MessageIndex": 2273,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 5, 2013 05:49PM melmcbee wrote: Nancy, Im so glad to hear from you. Im on arimidex too. Have you had any problems with it? I was a nervous wreck today because I had my 6 month followup cat scan of chest for my pulmonary nodules. Good news the nodules are stable, bad news there is a rib fracture. Not sure how that happened. Wondering if the radiation or arimidex weakened my bones or if it is a met causing it. Sigh. Never get to bask in the glory of good news. Lol. So happy you have had some good news. Healing hugs.",
      "MessageIndex": 2292,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 7, 2013 06:06PM melmcbee wrote: Nancy, what does gin soaked raisins do and how do you use them?. I havent had bad side effects. I have neck and back pain from work but I did before bc too. The breast pain I dont think is from arimidex. Its so good to hear from you.",
      "MessageIndex": 2297,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 1, 2013 06:27AM melmcbee wrote: Hi Beckers. Im only working about 3 days a week so far. Still have that fatigue thing going on. Im on arimidex too and thankfully Im not having any side effects. Tazzy I do love your pic. You look amazing. So glad everyone is doing well. Healing hugs to all.",
      "MessageIndex": 2241,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 13, 2013 07:16PM melmcbee wrote: Hi Beckers, its so good to hear from you. The lung nodules arent that big of a deal unless they change size. I see many patients with them as I do cat scans and they are routinely followed by cat scans. I Love my zoloft. It helps tremendously. Gma I am sorry they are giving you the run around about your pain meds.",
      "MessageIndex": 2304,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 14, 2013 07:38PM melmcbee wrote: Gma. How are you doing.Hugs",
      "MessageIndex": 2244,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 23, 2013 08:40AM melmcbee wrote: Justegan its so good to hear from you. Im glad you are doing well.",
      "MessageIndex": 2253,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 24, 2013 09:35PM melmcbee wrote: Beckers, good to hear from you. What kind of side effects were you having? Tazzy you are so funny. Glad you are doing well. Gma, I am sorry about your sisters. Sending prayers. Well ladies my exchnge surgery is scheduled for May 30th. I cant wait. My pain has become so bad the last few weeks that my ps said it wasnt from my te so he sent me to er and the doctors think that I just pulled some muscles on my radiated side. Either way I pray that these implants will feel better. Healing hugs to all of you.",
      "MessageIndex": 2259,
      "PostDate": "24/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 28, 2013 08:43PM melmcbee wrote: Thanks Tazzy. Im so glad we all checked in with each other before my surgery. It means alot to hear from ya`ll.",
      "MessageIndex": 2275,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 3, 2013 10:09PM melmcbee wrote: Glad to hear from ya'll. Doing well here. Healing hugs to all",
      "MessageIndex": 2290,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 19, 2013 11:01PM melmcbee wrote: Yeah..... Congrats and hugs",
      "MessageIndex": 11,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/800713",
      "Title": "Active Treatment Finished Today Momof2inME maryannecb"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 9, 2018 03:38PM melmcbee wrote: Congrats and thanks for giving us hope.",
      "MessageIndex": 18,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/862240",
      "Title": "Five-Year Metsaversary pajim KSkier"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 19, 2017 08:53AM melmcbee wrote: I was 42 and had ilc. I was told the chance for it to show up in other breast was high. So I did the bilat mastectomy. Gentle hugs to you.",
      "MessageIndex": 6,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858033",
      "Title": "Unilateral vs bilateral, how'd you decide Jnnmn7 IntegraGirl"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 24, 2013 06:02PM melmcbee wrote: I just wanted to send you prayers and a hug. Hoping for the best.",
      "MessageIndex": 4,
      "PostDate": "24/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/802240",
      "Title": "New and Nervous, trying not to freak out. HotPinkMess FilterLady"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Nov 10, 2017 01:05PM melmcbee wrote: My sincere condolences. She was a beacon of light and full if energy.",
      "MessageIndex": 68,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/859918",
      "Title": "Stagefree's last journey stagefree Brendatrue"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 10, 2013 05:43PM melmcbee wrote: Pwife, im sorry that you are having this issue. I found a thickened area in my breast because it was hurting. It wasnt a sharp shooting pain. Do you have any redness? I would definitely get it looked at but try not to worry. Please keep us informed and good luck",
      "MessageIndex": 1,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815628",
      "Title": "New Here pwife pwife"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 19, 2013 06:04PM melmcbee wrote: Welcome everyone. I am a year post diagnosis. I had bmx, axillary dissection, reconstruction, radiation and chemo bu not in that order. I have ilc so i.chose bmx. I had 8 positive node with extracapsular invasion so I got radiation. I did a/c/t because I was 42 i guess i dont know. I did learn that stage is only a number. Some people stay at stage 2 until they die of something different and others are stage 0 or stage 1 when they find out they are stage 4. There is no rhyme nor reason to it. Good luck and welcome again. Healing hugs",
      "MessageIndex": 83,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 14, 2013 06:05PM melmcbee wrote: Shary, your picture is beautiful I think red is definitely your color. Get you some protein shakes. They might help. Macy welcome. Im sorry you have to be here but im glad you found us. I was 42 at diagnosis and my mamo didnt show mine either. I have Ilc. I dont think I had time to grieve until I was through with treament and surgeries. Sending healing prayers to you Fredntan, I bet you are excited to get your nipples. You did tats right? Did it hurt? I was suppose to have an appt with my ps this past tues. to talk about getting tats but cellulitis put me in the hospital last Sat and I dont think I will get them for a while. Im hurting too much and my ps now wants me to go to pain managment and get an intercostal nerve block ugh. That doesnt even sound fun. Lol Healing hugs to all",
      "MessageIndex": 137,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 24, 2012 09:12PM - edited Aug 24, 2012 09:13PM by melmcbee Im so sorry that you are going thru this. I was worried about being addicted so I started slowly alternating between the pain pills and ibuprophen, aleve and tylenol. Our bodies become almost immune to them if we take the same thing. It helped me. I would use lots of ice packs as well. I also had a prescription for xanax and I think that helped with the pain. I took melatonin to sleep which worked for about 2 weeks till I started getting headaches.  Good luck to you and healing thoughts are coming your way.",
      "MessageIndex": 7,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/791669",
      "Title": "Recovering Addicts? Experience strength and hope please... juneaubugg SherylB"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "melmcbee wrote: Im so excited that I finally found a therapist that is certified for lymphedema treatment. I really like her. Of course my hnd was almost normal size when I finally got to see her for the first time. LOL. I explained that I learned MLD from youtube videos that you wonderful ladies provided links for. I also explained that I would be going back to work in a little over a month and I wanted to learn how to wrap my arm at night and get fitted for a better sleeve and glove as the ones I have cause more swelling. She showed me a wrapping alternative that is like a foam brace type thing that attaches by velcro. My question is does anyone use this instead of wrapping? Do you like it? Also, is there any other questions I should be asking her? Thanks for everything. Melanie. mentor smooth round high profile gel 700 rt 550 lt with fat grafting 5/30/2013 Dx 6/24/2012, ILC, 2cm, Stage IIIA, Grade 2, 8/15 nodes, ER+/PR+, HER2- Surgery 7/9/2012 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Surgery 8/9/2012 Lymph node removal: Right, Underarm/Axillary Chemotherapy 8/23/2012 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 1/9/2013 Breast, Lymph nodes Surgery 5/30/2013 Reconstruction (left); Reconstruction (right) Surgery 12/4/2013 Reconstruction (right) Dx 3/29/2017, ILC, Stage IV, metastasized to bone, ER+/PR- Hormonal Therapy Faslodex (fulvestrant) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/799658",
      "Title": "What is a wrapping alternative? melmcbee Kicks"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 22, 2012 08:52PM melmcbee wrote: Tpot, Im sorry I missed this post. I hope you found the other thread.  Our stats are similiar. Hope to chat with you on the boards. I have ILC stage 3a too. Have a blessed day",
      "MessageIndex": 1,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792239",
      "Title": "Anyone starting chemo in August 2012? tpot3 melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 15, 2013 10:01AM melmcbee wrote: Where were your rad tats and how did they cover them. I think i have about five of those.",
      "MessageIndex": 139,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 24, 2012 06:19PM melmcbee wrote: I wasnt given the option to do chemo first. I have invasive lobular. Healing hugs to your mom.",
      "MessageIndex": 5,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/793991",
      "Title": "Chemo or Surgery First? danlias melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 30, 2013 06:44PM melmcbee wrote: Hi Kira. I met with the therapist today and she worked on LMD and she also wrapped my arm. She went slow and explained it all to me but she also said she was going to put the directions down on paper for me. It was a lot to take in so I am glad she will also give me written instructions. I was extremely uncomfortable with the wrapping but I know that it takes time to get accustomed to it. She is checking on the prices of the alternative wrapping for me and going to check on what my insurance will cover.  Thanks for all of your help. Hugs,",
      "MessageIndex": 3,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/799658",
      "Title": "What is a wrapping alternative? melmcbee Kicks"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 31, 2013 08:05PM melmcbee wrote: Hi Ambercatz, Im sorry you are going thru this. Sometimes they do chemo first to shrink the size so they it will be easier to get clean margins with a lumpectomy. Chemo isnt as rough as it was years ago because they have medications now to control vomiting, diarrhea, constipation, bone pain and neuropathy. It will be easier for you when a plan is in place and you know what you will be doing when. Healing hugs to you",
      "MessageIndex": 1,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/805508",
      "Title": "Been to clinic-not good news ambercatz soriya123"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 11, 2013 12:12PM melmcbee wrote: Goutlaw, Im so sorry you have to be here. I was 42 at diagnosis and Im not her2 + so I dont fit the bill. I just wanted to tell you to post somewhere else and start your own thread and you will get responses. There are her2 positive threads, young people treads and also either idc or ilc threads. I dont want you to think you are alone because you arent. We are all here for you.",
      "MessageIndex": 282,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 24, 2012 01:47PM melmcbee wrote: Welcome Bee15.... This is a wonderful place for support, hugs, and info. Healing hugs coming your way.",
      "MessageIndex": 262,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 20, 2012 07:53AM melmcbee wrote: Glad to hear these positive stories. I needed it today. Thanks",
      "MessageIndex": 246,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 30, 2013 03:36AM melmcbee wrote: Morgado, my thoughts and prayers are with you. Once you get your treatment options lined up you will feel better. I have just passed a year past diagnosis and it does get easier to handle once you start fighting it. Healing hugs",
      "MessageIndex": 304,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 17, 2013 03:46PM melmcbee wrote: Vicki it sounds like it worked to me. Why was it discredited and where did she get it? Sounds interesting",
      "MessageIndex": 273,
      "PostDate": "17/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 26, 2012 07:03PM melmcbee wrote: Hey Camillia, I just wanted to give you a cyber hug. I would love to know the answer too. I have a grand daughter thats almost three and we are constantly putting hand sanitizer on. Luckily she thinks its lotion cause it smells good.  Im on tx 2   A/C/T  and the chemo is making my eyes and nose run and scratchy sore throat. I take tons of vitamins and supplements hoping it will keep my immunity up. I hope you start feeling better.",
      "MessageIndex": 1,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794083",
      "Title": "Getting a cold during chemo Camillia BikerLee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 10, 2012 07:27PM melmcbee wrote: I was bored out of my mind at 4 weeks post-op but all I had was the bmx. I had the alnd a couple of days ago and feel rough right now. My only suggestion is I did alot of stretching and physical therapy exercises after the mastectomy. I wanted to do yard work and all kind of things. Just dont plan to do crazy stuff. Just plan it to be a relaxing vacation. Oh and I live in florida and its really hot. I have had to stay in the airconditioning more than outside. I wouldnt even dream about lying on the beach unless it is early in the morning or late in the evening. Im always hot now since they took my breast but I dont know why. Lots of relaxing indoor activities to do.",
      "MessageIndex": 5,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791819",
      "Title": "How did you feel one month after your Mx and ALND? CarrieR CarrieR"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 6, 2017 05:55PM melmcbee wrote: I agree that you need to get a copy of every test and biopsy. Then you ask insurance company who you should go see. You need those reports. I work for a radiology department and they wouldnt wait fir 16 months if there were pisitive finding regardless of financial or insuurance problems. 16 months of doing nothing is a huge lawsuit if there turned out to be a positive findings. Please get those reports first. Try to breathe and relax",
      "MessageIndex": 14,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851887",
      "Title": "Advice please Emcginty247 Claudia30"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 12, 2012 07:15PM melmcbee wrote: Thanks everyone. I appreciate all the support. Hugs to all.",
      "MessageIndex": 4,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794831",
      "Title": "Will I ever quit gaining weight??? melmcbee LtotheK"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 15, 2012 05:24AM melmcbee wrote: Jenlee, I have that problem now before I even start on chemo so I guess I will look 80 after. But I did the damage to myself from smoking all my llife. What I wanted to ask you is if you thought about what you might could feed your body to help. I dont know the right things except water and maybe vitamin e but I bet a health food store could lead you in the right direction. When I was dx my friend made me start drinking these green smoothies made with fruit, kale, spinach, flaxseed oil, ect... Anyway since I started reading up on it I am now taking all kinds of vitamins and supplements to help with healing and so forth.  I would love to know anything that you may hear that could help cause I would definitely add it to my regimen. Hugs to all.",
      "MessageIndex": 11,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/791971",
      "Title": "Dry skin & wrinkles after chemo? jenlee Dthayer"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 3, 2017 06:53PM melmcbee wrote:",
      "MessageIndex": 1,
      "PostDate": "03/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/858415",
      "Title": "Spots on lung and sternum after 11 years Bailey2017 klvans"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 9, 2012 10:41PM melmcbee wrote: I love the pics of everyone's hair. I just started chemo 8-23-12 and my hair has been cut short and is falling out. My scalp hurts.... Was there anything that you put on it to make it not so tender? Any vitamin or supplements? Any particular shampoo? Lotion? Thanks for any advice. Hugs",
      "MessageIndex": 17451,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 13, 2012 05:35PM melmcbee wrote: Thanks Lou and Crazyride. I will definitely research your suggestions. Does the online fitness program cost money? Thanks for everything ladies.",
      "MessageIndex": 8,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794831",
      "Title": "Will I ever quit gaining weight??? melmcbee LtotheK"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 13, 2012 07:35PM melmcbee wrote: Just signed up on my fitness pal. pm sent thanks",
      "MessageIndex": 10,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794831",
      "Title": "Will I ever quit gaining weight??? melmcbee LtotheK"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 4, 2013 09:49PM melmcbee wrote: Hi ladies. My hair is no where long enough to color but I was looking up some homemade ways to color or highlight hair. Like lemon juice, chamomille tea amdperoxide. LOL. I wish they made professional hair color for short hair. If I was to buy a box now I would only use like 5% of it. Oh well I am so happy to have any hair that I really dont care if it is grey at 43. However, I promised myself if I made it thru all of the treatment then I would go platinum blond. At least one time. I told my mother this week that I was going to buy a baby bow with the velcro clip on it just so I can say I put a barrette in. Lol. I have to find the humor in it somewhere. I am going back to work this Saturday and would love to do something funny like that. My co-workers would get a kick out of it. If you have any crazy ideas that dont include a wig I would love it. Hugs to all.",
      "MessageIndex": 18945,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 18, 2012 09:36AM melmcbee wrote: Hi my name is Melanie. I am 42 and was dx at the end of June with ilc. I have spent the last 2 weeks on here learning about breast cancer.I work in the medical field and have realized that I know nothing about this. It didnt show up on my mammo in Dec. I felt a lump on Sunday and went to the breast center on thurs where the did mamo, us, and bx. I got the resultsand have already had a bmx on july 9th. There was a big tumor and 2 possible small one in the breast so a lumpectomy was out. Because this type doesnt show up well on mammo or us until its big I chose to go ahead and have both removed. I had tes put in and now im just waiting on mo to tell me the treatment plan.I dont knowwhat the tumor actually measure or if the other 2 were malignant or if its in my nodes or if there were any in my left breast. the mri showed the tumor at 5.6 cm. Im glad yall are here so I can ask questions. Thanks for being here. the shock is about gone and reality is setting in.",
      "MessageIndex": 73,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 8, 2013 12:01PM melmcbee wrote: Lk I just wanted to say good luck on your surgery. We are here if you need us. Healing hugs",
      "MessageIndex": 71,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/800669",
      "Title": "Stage 3? LKSHER LKSHER"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "melmcbee wrote: I thought that losing my hair would bother me more than it has. No. Its my fat%$# thats sending me into a depression. I am physically sick from it. My breathing is getting bad. I cant bend over without it hurting my stomach. I look 9 months pregnant. I cant seem to quit eating. I feel nauseous if I dont eat. I cant wear any of my clothes. I dont know how to stop this. I am too tired to exercise. I thought I must be full of fluid but Im not. I had an ultrasound a few weeks back and the tech told me it wasnt fluid. It was alot of air. Help... Does anybody have a great diet tip?  Please. Melanie. mentor smooth round high profile gel 700 rt 550 lt with fat grafting 5/30/2013 Dx 6/24/2012, ILC, 2cm, Stage IIIA, Grade 2, 8/15 nodes, ER+/PR+, HER2- Surgery 7/9/2012 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Surgery 8/9/2012 Lymph node removal: Right, Underarm/Axillary Chemotherapy 8/23/2012 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 1/9/2013 Breast, Lymph nodes Surgery 5/30/2013 Reconstruction (left); Reconstruction (right) Surgery 12/4/2013 Reconstruction (right) Dx 3/29/2017, ILC, Stage IV, metastasized to bone, ER+/PR- Hormonal Therapy Faslodex (fulvestrant) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794831",
      "Title": "Will I ever quit gaining weight??? melmcbee LtotheK"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 13, 2012 08:46PM melmcbee wrote: Hey Beckers... How are you? I hope everything is good. I am gonna try to start counting calories with that free website Crazyride mentioned. I signed up and it looks promising. Now I just hve to stop my midnight meals. lol Hugs...",
      "MessageIndex": 12,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794831",
      "Title": "Will I ever quit gaining weight??? melmcbee LtotheK"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 27, 2018 09:44AM melmcbee wrote: Do you wear a seatbelt that may have caused injury to breast? If you have cyst than maybe cutting out caffeine would help. Get a mri of yout shoulder and that should tell you whats causing shoulder pain. Good luck",
      "MessageIndex": 6,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/861985",
      "Title": "Radiologist says Lump is a bruise but Rolle Rolle"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 3, 2013 10:42PM melmcbee wrote: Hi ladies. Thaks for all of the wonderful tips. I am glad to know that I can color my hair soon. I am 11 weeks pfc and my hair is thin but getting thicker. It is real short less than an inch in some places and maybe an inch in others. Hope everyone is doing good. Hugs",
      "MessageIndex": 18928,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 24, 2012 08:53PM melmcbee wrote: Prayers sent for a good benign report. Hugs.",
      "MessageIndex": 5,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793967",
      "Title": "MRI dustyGreen dustyGreen"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 15, 2014 08:35AM melmcbee wrote: Kimberly, I am so sorry for what you are going thru. As I was reading this, I was thinking of cellulitis too but my experience is much different. I have had cellulitis twice and both times ended up in hospital. The last time they had to take my implant out. It started 1 year after my exchange surgery. I felt this intense burning on my chest and was driving for an hour and when I was able to stop I immediately went to a mirror and my right breast was blood red and hot to touch. No buimps or itching. It was very painful.  It spread rapidly with antibiotics and I was required to be hospitalized for iv antibiotics. A month later it came back again very fast and painful and hot to touch. No itching or bumps. Now we are all different but I wanted you to know how mine presented itself. Oh I had the impant removed and it never came back.  Good luck",
      "MessageIndex": 23,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/819262",
      "Title": "Thoughts on rash on/around/up from Mastectomy incision 1toughmomma 1toughmomma"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 20, 2012 11:47PM melmcbee wrote: Praying your appointment went well and healing hugs to you.",
      "MessageIndex": 50,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797357",
      "Title": "Cancer came back Mamita49 hopefour"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 12, 2017 11:59PM melmcbee wrote: I agree that you should have a surgeon who will clean up the first surgeons mess. Sometimes they dont want the liability. Surgeons are funny like that. Prayers and gentle hugs",
      "MessageIndex": 11,
      "PostDate": "12/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854135",
      "Title": "Concerns about surgeon Remali Remali"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 14, 2012 01:41AM melmcbee wrote: Thanks everyone. I actually went and bought some whey protein and almond milk and rice milk to mix with it. I hope it starts eworking. Hugs",
      "MessageIndex": 4,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794873",
      "Title": "Surgical scar not healing melmcbee melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 14, 2012 03:00AM melmcbee wrote: I didnt think of an infection.  I will call my doctor monday and see what he says.  He will probably call me an antibiotic in. Thanks for everything ladies. Hugs",
      "MessageIndex": 6,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794873",
      "Title": "Surgical scar not healing melmcbee melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 1, 2013 10:26PM melmcbee wrote: Thats a good question. I had cancer on the right and a bmx with expanders placed. I wasnt given the option of prone. They did mine supine. I always assumed it was because I had cancer on right side.",
      "MessageIndex": 1,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/812046",
      "Title": "prone versus supine mtnchick yoga_girl"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 22, 2017 10:13PM melmcbee wrote: Thanks Micmel. I still have a headache.",
      "MessageIndex": 109,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832600",
      "Title": "XGEVA let's talk about the good and the side effects dixiebell JFL"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 18, 2012 10:12PM melmcbee wrote: hugs to you Elise.",
      "MessageIndex": 10,
      "PostDate": "18/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/792150",
      "Title": "Hematoma and purple/black nipple Pointvalue Moderators"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 19, 2017 09:52PM melmcbee wrote: If the doctor suggests a breast specialist then that wouldnt hurt to follow up. I wouldnt worry too much because at her age if would be very unlikely to be anything cancerous. I would suggest stopping any caffeine if she uses it for a month and see if it returns to normal. I am impressed that she found it. It is awesome that she knows the importance of breast exams. I wish I would have paid better attention. Great job. Praying for an easy resolution to her issue. Gentle hugs",
      "MessageIndex": 2,
      "PostDate": "19/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855284",
      "Title": "15 Year-Old With Lump Above Her Inverted Nipple STEAD89 djmammo"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 22, 2017 05:13AM melmcbee wrote: I just found this thread. My mo wants me to start this in a month. I am looking for any tips about mouth care and what vitamins di you take. I bought a multivitamin and calcium 600mg with d3 800 iu. What do I need to take. Any suggestions would be great. Thank yo",
      "MessageIndex": 107,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832600",
      "Title": "XGEVA let's talk about the good and the side effects dixiebell JFL"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 9, 2018 09:32AM melmcbee wrote: Dixiebell I ended up with Onj. I only had 1 injection of Xgeva.",
      "MessageIndex": 116,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832600",
      "Title": "XGEVA let's talk about the good and the side effects dixiebell JFL"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "melmcbee wrote: My path report says a1 pankeratin positive then underneath it has all the b1 listed out with positive and negative results. The er and pr are negative. Not enough sample. I fell apart at work thursday and ran home to moms with my family. I read somewhere on this site that bone biopsy could be wrong for hormone receptirs. I have been on arimidex for 5 years. I wwasnt reliable with taking it everyday. I have several lesions on my spine and pelvis. I guess im stage 4 now. Oh and the bx report calls it matastatic breast cancer. It didnt say it was ilc or idc. Any info is appreciated. Thank yo Melanie. mentor smooth round high profile gel 700 rt 550 lt with fat grafting 5/30/2013 Dx 6/24/2012, ILC, 2cm, Stage IIIA, Grade 2, 8/15 nodes, ER+/PR+, HER2- Surgery 7/9/2012 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Surgery 8/9/2012 Lymph node removal: Right, Underarm/Axillary Chemotherapy 8/23/2012 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 1/9/2013 Breast, Lymph nodes Surgery 5/30/2013 Reconstruction (left); Reconstruction (right) Surgery 12/4/2013 Reconstruction (right) Dx 3/29/2017, ILC, Stage IV, metastasized to bone, ER+/PR- Hormonal Therapy Faslodex (fulvestrant) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853863",
      "Title": "Er and pr neg bone biopsy melmcbee melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 11, 2013 08:55AM melmcbee wrote: Good luck and stay strong. I know how scary this can be but you have done everything right. So feel confident in that and let us know how it goes.",
      "MessageIndex": 3,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815604",
      "Title": "Hi :) Irishtwins2009 Holeinone"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 27, 2013 09:50PM melmcbee wrote: Kar thats awful. how did they find the 6cm tumor? Momine, mine was the same way. My tumor showed up on the mri but the 8 positive lymph nodes did not show up on the mri, petscan or ct. I talked to a radiologist about it and he said that the cancer has to be a certain size for a petscan to pick it up.. I cant remember what he said maybe it was .8cm. healing hugs to all",
      "MessageIndex": 10,
      "PostDate": "27/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/805062",
      "Title": "GE Medical Equipment mary625 KSil"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 15, 2017 10:33PM melmcbee wrote: What is the treatment for bone mets. Does arimidex work. Thank you for any insigh",
      "MessageIndex": 3890,
      "PostDate": "15/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 16, 2017 07:05AM - edited Feb 16, 2017 07:08AM by melmcbee Thank you Chrissy",
      "MessageIndex": 3892,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 24, 2017 07:46AM melmcbee wrote: I have several new sclerotic lesions in spine and pelvis. I was originally told they are too small to biopsy but my oncologist talked a radiologist into doing a biopsy. I am having it done tomorrow on my pelvis and I just wanted to ask if they sedate you. How did you feel afterwards. I move patients all day and wanted to know if I would be sore or in pain and for how long. Thanks in advance.",
      "MessageIndex": 4003,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 26, 2017 12:46PM melmcbee wrote: I had the biopsy and it wasnt bad. Now I just stress on whether they got a good sample and whether it is mets. I just started researching what else it could be. Cant come up with anything. Thanks for letting me vent.",
      "MessageIndex": 4004,
      "PostDate": "26/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 19, 2017 09:50PM melmcbee wrote: If the doctor suggests a breast specialist then that wouldnt hurt to follow up. I wouldnt worry too much because at her age if would be very unlikely to be anything cancerous. I would suggest stopping any caffeine if she uses it for a month and see if it returns to normal. I am impressed that she found it. It is awesome that she knows the importance of breast exams. I wish I would have paid better attention. Great job. Praying for an easy resolution to her issue. Gentle hugs",
      "MessageIndex": 1,
      "PostDate": "19/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855284",
      "Title": "15 Year-Old With Lump Above Her Inverted Nipple STEAD89 djmammo"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 26, 2013 01:53AM melmcbee wrote: Hi ladies I wanted to ask if anyone with ILC has mets to their stomach or intestines? I know this is less common. Bean Im sorry that I am asking this question after you said your sister has a blockage and it could possibly be caused from a GI met.  Thanks for any info ladies.",
      "MessageIndex": 1128,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 25, 2013 09:22AM melmcbee wrote: Thanks to Chrissy and all others for taking the time to help those of us who are not stage 4. I have a dumb quetion. When I was diagnosed as stage 3, I basically accepted the fact that I will die of breast cancer. I dont know when but I know it will progress. Is this true? Is there anybody that has stayed in remission for 30-40 years when diagnosed in their 40's? I have a friend who stayed in remission for 25 years but I really dont know of anyone that is cured. Can it really be said that you are cured? I also know that people progress from stage 0 to stage 4 so stages dont really matter. I dont mean to upset anyone but I really need someone from a stage 4 group to help me understand if this is true. I have done all my treatments but I haven't really made any lifestyle changes because I want to live the next 20 years happy. Am I wrong in thinking that I will never be cured and it will come back eventually. My mo wont give me a life expectancy. Dont get me wrong I dont think about it or worry about it. I am going on with my life as if nothing has happened. But now I give in a lot more to my grandbaby whom I adopted. I dont sweat the small stuff. If I want a drink I drink it and if I want a cigarette I smoke it. I dont believe God gave me my grandchild to raise just to take me out of her life so soon but I also believe that there is no cure. Does anyone know of someone being cured? Oh and another question is after you have a bmx with reconstruction is it possible to get a chest wall reccurence? How do you know if it comes back there? We dont get mammos right? I realize these are stupid questions and could upset some people so I am thankful that you have a thread that I can ask them in. I truly dont want to aggravate anyone but this is on my heart and mind. Thanks and hugs to all.",
      "MessageIndex": 1165,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 4, 2013 10:06PM melmcbee wrote: Wannacruize, healing hugs and prayers going to you and your DD.",
      "MessageIndex": 1249,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jun 27, 2013 11:38PM melmcbee wrote: Gosh Evitre I am so sorry that youand your mom are going thru this. I was going to posta brain met question as well but I just had to tell you that Im praying for you and your mom. I was curious about brain mets as far as did anybody have the symptom of headaches before diagnosis or was it a certain spot on your head that hurt. Generalised pain versus specific site pain? Thanks for any help.",
      "MessageIndex": 1559,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 4, 2013 10:20AM melmcbee wrote: Lorreymom, I am so sorry for what you are going thru. Know that all of this is doable. You got this. Try to just do one thing at a time. Dont worry about chemo or rads yet. Just get thru surgery and tests first. Have you got an oncologist yet. Do that first because they will probably do scans on you before the surgery. Some patients get chemo before the surgery. I didnt because I have ILC. There is a ton of info and support on this site. Good luck an keep us informed. Healing hugs to you.",
      "MessageIndex": 2,
      "PostDate": "04/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/812226",
      "Title": "Met with surgeon yesterday lorreymom lorreymom"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "melmcbee wrote: Hi. I just found out that the 3 nodes that were taken out during my mastectomy turned out to be positive for ilc with extranodal extension into the adipose tissue. My surgeon says that its my choice but she cant find a reason not to do the surgery. She is concerned about my lymphadema risk. Im 42 and wanted some suggestions on what others thought whether I should have the surgery or let them just treat it with radiation. Can I prevent the lymphedema? How do you protect yourself from getting it? Will it decrease my quality of life? Thanks for any advice. Im just so confused. Melanie. mentor smooth round high profile gel 700 rt 550 lt with fat grafting 5/30/2013 Dx 6/24/2012, ILC, 2cm, Stage IIIA, Grade 2, 8/15 nodes, ER+/PR+, HER2- Surgery 7/9/2012 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Surgery 8/9/2012 Lymph node removal: Right, Underarm/Axillary Chemotherapy 8/23/2012 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 1/9/2013 Breast, Lymph nodes Surgery 5/30/2013 Reconstruction (left); Reconstruction (right) Surgery 12/4/2013 Reconstruction (right) Dx 3/29/2017, ILC, Stage IV, metastasized to bone, ER+/PR- Hormonal Therapy Faslodex (fulvestrant) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/790904",
      "Title": "need an axillary dissection melmcbee melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 8, 2013 03:11PM melmcbee wrote: Just wanted to add my prayers for you and your mom. Hugs",
      "MessageIndex": 16,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/796571",
      "Title": "My Mom's Diagnosis Pure melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 24, 2013 11:35PM melmcbee wrote: Thanks Mary for putting a face with the problem. Kar, if you dont mind me asking, I just want to clarify. Are you saying that a mri did not pick up a 6cm tumor? Do you mind me asking where the tumor was and did you have iv contrast with your scan? My tumors were not picked up on mammo and the u/s wasnt real definitive but it showed up on mri as a 5cm tumor. When I had the bmx it turned out to be 3 tumors with the biggest at about 2.5cm I think. Basically all 3 totalled about 5cm. I am asking this because I work in radiology and I knew that some tumors especially small were missed on mammo but it is a shock to hear that mri missed it. I actually do xrays, cat scans and some mri. I have seen mri of the breast and it amazes me what is picked up on mri that I cant see on the mammo. I share this knowledge with my coworkers so they will know about it. Thanks for any info you can give.",
      "MessageIndex": 5,
      "PostDate": "24/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/805062",
      "Title": "GE Medical Equipment mary625 KSil"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 15, 2012 12:45AM melmcbee wrote: I take zoloft which is a wonderful drug. It keeps me grounded. When I was dx my primary doctor immediately raised my dose and gave me xanax to get through all of the test and surgeried. I dont take the xanax unless im in a  stressful situation like surgery. Ask your doctor for something and Im sure he will give you an antidepressant or something to help. Hugs to you",
      "MessageIndex": 5,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791988",
      "Title": "So conflicted 5kidsMom 5kidsMom"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 4, 2013 11:43PM melmcbee wrote: Wendy I am doing the happy dance for you. Thank you for taking the time and sharing with us to give us hope. Blessings to you and your family",
      "MessageIndex": 3,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802750",
      "Title": "10 years and still dancing with NED!!! WendiLou maryannecb"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 22, 2014 12:20PM melmcbee wrote:",
      "MessageIndex": 2243,
      "PostDate": "22/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 30, 2012 10:43PM melmcbee wrote: I agree execises and maybe a physical therapy consult wouldnt hurt. Healing hugs coming your way.",
      "MessageIndex": 6,
      "PostDate": "30/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794249",
      "Title": "cant straighten arm after Monday BMX? pamelahope doubleAA"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 11, 2017 07:33PM melmcbee wrote: Ana when I had my ultrasound the radiologist came in and questioned me hard about the possibility of trauma to my breast. Like either from a seatbelt injury or it being hit. She couldnt believe that I didnt have trauma so she did a biopsy. It was lobular. Who did your ultrasound. Was it a breast center. However because you said it wasnt there 6 months ago I wanted to tell you that they said mine had probably been growing for 10 years. Hugs.",
      "MessageIndex": 4,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/859313",
      "Title": "Scar Tissue in Breast, No Trauma?? ana92 ana92"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 22, 2012 10:07AM melmcbee wrote: Thanks for the links. I will read them today. Yes I was told they will still do radiation as well. But it helped to remind me that I want to beat the ILC first and deal with se latr. Thanks again and hugs your way as well.",
      "MessageIndex": 3,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/790904",
      "Title": "need an axillary dissection melmcbee melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 21, 2013 10:42AM melmcbee wrote: Oh dear Lord C squared I am so very sorry for your loss. Im praying for you and her family.",
      "MessageIndex": 1447,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 2, 2013 09:31AM melmcbee wrote: Wayne, I will pray for you. Can we all just block the hijacker. This is our thread that is important to some of us for learning. These thoughts are becoming poison to some of us and we need to be built up not tore down.",
      "MessageIndex": 1217,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 8, 2013 08:27PM melmcbee wrote: I am so sorry that you have to be here. There is a lot of support here and you are welcome. After my biopsy results I had a mri of both breast to see the extent of the tumor. A pet scan and CT scan to see if there was any metastesis anywhere. I met with my medical oncologist and my case was taken to tumor board to see what my best option was. My oncologist worked closely with my surgeon and the tumor board said I would need a mastectomy. It was suggested to me to take both breast off because I had invasive lobular. When it was decided to do a matectomy I met with a plastic surgeon who would be doing my reconstruction and he wanted to put tissue expanders in and do the reconstruction at a later date due to the possibility of having radiation. I had the bmx with tissue expander placement and they do whats called a sentinel node biopsy during the surgery. If the sentinel node comes back positive they then do an axillary dissection. Because mine was lobular cancer it showed up as negative at first. After surgery the final path report came back positive and so I had another surgery to remove my lymph nodes on that side and they also put the port in then. Results from the nodes being removed were 8 positive out of 15.  So after surgery I had chemo for 5 months then radiation for 6 weeks and I will get reconstruction in 3 more months when my skin heals from radiation. Whew that was a mouthful. It takes all the doctors working together to decide a plan. Some plastic surgeons like to put implants in before radiation some like to do it afterward. You need to consult a plastic surgeon for that info. You need a medical oncologist to help you come up with a plan and maybe take your case to tumor board. You may need pre surgery scans to see if it is anywhere else. Anyway  hugs to you and feel free to ask away. There are alot of great people here. Hugs",
      "MessageIndex": 1,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801593",
      "Title": "Treatment plan moving fast Chrisesta67 gemini4"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 9, 2014 09:55PM melmcbee wrote: Nancy, Im so sorry that you are so upset. Please really don't go there yet especially when it was a technologist who said something. It is the technologist's job to get a medical history but under no circumstances should they say anything about seeing something and the reason they shouldn't say it is because they are not qualified to say it. I am a technologist and I see stuff all the time and I am wrong sometimes. Because I am not qualified to read anything. And neither is the tech who did your scan today. I always have to ask if there is a prior history of injury or cancer or other medical conditions and I make sure the patient knows that I am asking this for a history not because of anything that is seen on their images. Please don't let this bother you. Wait until a doctor reads that scan. I promise that tech is NOT qualified to see or say anything.  ",
      "MessageIndex": 7,
      "PostDate": "09/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822644",
      "Title": "Unbelievable Nancy2581 Nancy2581"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 23, 2017 06:07PM melmcbee wrote: Thats wonderful news. Congrat",
      "MessageIndex": 339,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jun 5, 2017 05:19PM melmcbee wrote: Praying for you Kandy",
      "MessageIndex": 351,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 15, 2017 06:10AM melmcbee wrote: Kandy. Im also praying halaven works. Gentle hugs.",
      "MessageIndex": 621,
      "PostDate": "15/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 15, 2017 01:36PM melmcbee wrote: Bessie is %100 right. I should not have used the word mess. It is very common to neeed another excision. My apologies. Thank you Bessie for correcting me. All I meant to say was mist surgeons dont like to operate after another surgeon. But it is done all if the time too. Grntle hug  ",
      "MessageIndex": 22,
      "PostDate": "15/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854135",
      "Title": "Concerns about surgeon Remali Remali"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 27, 2017 07:21PM melmcbee wrote: Sending positive thoughts and prayers. I have some sclerotic lesions and know how much it stresses you.",
      "MessageIndex": 2,
      "PostDate": "27/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/853770",
      "Title": "Metastasis- sclerotic lesion Jbburlington Tpralph"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "melmcbee wrote: I had a bmx in July and I had an area on my right breast that didnt heal properly. In August, my bs reattached the area and after 4 weeks it was healed perfectly. A few weeks ago when I went to ps to get filled he noticed a tiny area on the scar that was white and he refused to fill me until it healed. Well I have already canelled 1 appt cause it wasnt healed and now I am gonna have to cancel my appt for next week. Its about the width of a pencil and there is a smaller spot next to it. I have been putting neosporin on it like my doctor told me to but it seems to be getting worse. I have also put aloe gel on my foobs and vit e oil on them as well. Does anyone have any suggestions on something else I could be doing? I have tissue expanders in. I also take a ton of vitamins including biotin. Any suggestions would be so appreciated. Oh and I have put on a lot of weight. Im not sure if that has anything to do with it. Thanks in advane for any help. Melanie. mentor smooth round high profile gel 700 rt 550 lt with fat grafting 5/30/2013 Dx 6/24/2012, ILC, 2cm, Stage IIIA, Grade 2, 8/15 nodes, ER+/PR+, HER2- Surgery 7/9/2012 Lymph node removal: Right, Sentinel; Mastectomy: Left, Right Surgery 8/9/2012 Lymph node removal: Right, Underarm/Axillary Chemotherapy 8/23/2012 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 1/9/2013 Breast, Lymph nodes Surgery 5/30/2013 Reconstruction (left); Reconstruction (right) Surgery 12/4/2013 Reconstruction (right) Dx 3/29/2017, ILC, Stage IV, metastasized to bone, ER+/PR- Hormonal Therapy Faslodex (fulvestrant) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794873",
      "Title": "Surgical scar not healing melmcbee melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 11, 2018 10:34AM melmcbee wrote: You arent stuck fir the weekend. I would call the rad doctor thats on call and ask for medicine to be called in to put on it. Thats his job. I also used silvadene cream but I cant remember whether I used it during active treatment or after it was over. I also remember there were medicated cold pads I put on. I burned bad too. The doctors job is to help patients get through all of their treatment. I would call him. Prayers and healing hugs",
      "MessageIndex": 6,
      "PostDate": "11/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862395",
      "Title": "Radiation doubts StageThree macb04"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 3, 2013 11:01PM melmcbee wrote: www.facebook.com/groups/265320...",
      "MessageIndex": 1082,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 4, 2013 08:41AM melmcbee wrote: Hi ladies today would be day 3 after the nerve blocks. I fell better. I am not having the shooting pain down my side under armpit. I am still having minor soreness in a few spots under my breast and medial at the sternum. I will use the patches and tramadol for that. I go back to work Monday so we will see how it holds up to my job requirements. Healing hugs to all.",
      "MessageIndex": 1103,
      "PostDate": "04/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 11, 2013 11:12PM - edited Oct 11, 2013 11:23PM by melmcbee Hey Gowith. As always its good to see you. There is a facebook group called post mastectomy pain and its more active. Since its Friday I didnt know if th more experienced ladies would see your post. Im trying to recount th months but I think my pain became the worse rifht before my exchange surgery which would have been a month after rads. I finally had 3 intercostal nerve blocks done a few weeks back. I also take neurontin which helps me. I dont know at what point they label us with pmps. Most doctors seem to blow it off like we are crazy. I get the impression they think we should be thankful we are alive. Lol. The pain you are describing with th stabbing and burning is finally relaxed. Believe it or not someone here told me to rub or massage it and it really did help quiet th nerves down. I also used ice and lots of pain pills but I havent used any since I started seeing the pain mgmt dr. He gav me th jnjections and lidoderm patches and tramadol. I really havent had to use anything this week. Good luck and praying you find peace and no pain.",
      "MessageIndex": 1121,
      "PostDate": "11/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 5, 2014 08:56PM melmcbee wrote: Hi ladies. My latest update is I woke up in terrible pain and coughed and felt a pop. I went to dr and had rib xrays. Nothing new was noted just the healed fracture from last time. I ended up going to my pain doctor who did the nerve blocks again. I hate those needles in the back but I know that I will get better. The terrible stabbing pain is gone. Hope everyone is doing well. Healing hugs",
      "MessageIndex": 1148,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 8, 2014 09:26PM melmcbee wrote: Solticegirl, I didn't even think that radiation could be the cause of mine. I mentioned my pain to my radiation therapists friend and he was kind of huffy by saying they didn't give me enough radiation to cause burned nerves or whatever. lol. I told him of course I didn't believe he had anything to do with it. lol But I always wondered....",
      "MessageIndex": 1167,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 1, 2014 09:24PM melmcbee wrote: DontdoALND, I love your name. I wanted to tell you that I get injections to numb my breast nerves and I cant remember what they are called. I have to get them every 3 months and they do help but I hate actually getting the injections. Its a nerve block. I have had terrible pain on my side and under my breast since my ALND and mastectomy. I do not have pain in my arm anymore it is mainly on my bra line. I get 3 levels done each time and it literally numbs the area. I used to have pain in my arm but I started doing lymphatic manual massage and tried to drain or move any lymph fluid to the center of my body and it did seem to help. Do you have any issues with lymphedema or swelling. If you do there is a great thread here about lymphedema with some super smart women who can tell you how to make it better. I just wanted to say that I hope you get relief soon. I have suffered for 2 years and know how miserable it is. Oh and Neurontin also was a help to me. Healing hugs  ",
      "MessageIndex": 1199,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 22, 2012 01:52PM melmcbee wrote: Thanks Kira. No she is my stepsons daughter that my husband and I just finished the adoption about 6 months ago. She will be 3 in October. Breast cancer definitely didnt fit into our plans. lol. but we will deal",
      "MessageIndex": 5,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/790904",
      "Title": "need an axillary dissection melmcbee melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 10, 2014 09:47PM melmcbee wrote: Nancy, I just wanted to stop by and send you a big hug. BC sucks.....  The last 2 years I went from a bmx to expanders to implants to cellulitis to losing one implant. I have 1 fake boob and one scarred flat area. After 5 surgeries I said to heck with it. I don't even care and I walk around without a prosthesis daring someone to look at me funny. We literally suffer from some kind of post traumatic stress disorder or at least I know I do. I can flip at a moments notice.  Please let us know how it all comes out and know that we are here for whenever you need to vent.",
      "MessageIndex": 23,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822644",
      "Title": "Unbelievable Nancy2581 Nancy2581"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 2, 2013 09:37PM melmcbee wrote: Hi Diana and thanks for checking in nd giving inspirations. I know you will be stable for a long time. Im o impresed with all of you ladies with your exercising and bike riding. That notion hsnt hit me yey. lol Maybe soon. I just finished my reconstruction and will be returning to work soon. healing hugs to all",
      "MessageIndex": 34,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/806309",
      "Title": "I wonder how my stage III gals are doing? diana50 pupfoster1"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 29, 2017 10:03AM melmcbee wrote: Bowoky. Try to start hydrating with water. I always suggest this to patients who are hard sticks. It will help pump up your veins. Good luc",
      "MessageIndex": 25,
      "PostDate": "29/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854192",
      "Title": "Skin pulling and lump bowoky MTwoman"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 3, 2017 08:52PM melmcbee wrote: Hi. I just wanred to ask if you drink caffeine. That can cause issues. I hope the new doctor figures it out for you.",
      "MessageIndex": 4,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/852373",
      "Title": "Anyone with cysts and lymph nodes? Scmommato3 Scmommato3"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 16, 2013 10:06PM melmcbee wrote: Tessie, praying for good results.",
      "MessageIndex": 9,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810470",
      "Title": "Possible re-occurance tessie51 momof2doxies"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 12, 2013 02:23AM melmcbee wrote: Yay. That is awesome news. Im so happy for you and thankful you shared it with us.",
      "MessageIndex": 15,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/810712",
      "Title": "Sweeeet Seven SpunkyGirl YATCOMW"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jun 16, 2017 07:05PM melmcbee wrote: Are you running a fever. Have you started anything new like soap or lotion.",
      "MessageIndex": 3,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856187",
      "Title": "35 and worried sick Titch150 Titch150"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 10, 2013 02:26PM melmcbee wrote: Dawnette, welcome and im sorry you have to be here but this is a good place for info and support. Please feel free to ask anything. There is a great thread called team warriors with lobular cancer. Hope to see you around",
      "MessageIndex": 2,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815599",
      "Title": "Just diagnosed this morning... dawnettejh christina0001"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 13, 2012 06:47PM melmcbee wrote: If you tell them that your head is cold they can give you one of the O.R. hats. There are different kinds that they have to wear. I dont see why they couldnt give you one. Best of luck. hugs to all",
      "MessageIndex": 5,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791964",
      "Title": "Hair question and hospital pamelahope pamelahope"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 1, 2013 09:12PM melmcbee wrote: Sam2u and Mermaid, Im sorry yall are going thru this. I know its a nightmare. The biopsy result is the most important. When I was getting my u/s the radiologist kept asking me if I had trauma to my chest and though I am a klutz I said no. She finally told me that it looks like a fat necrosis to her but if it did turn out to be cancer than it was the kind I would rather have..... Now I cant ever remember choosing to have cancer. But what she meant was Ilc. Vs Idc. I am sorry I am digressing again. What I mean is the radiologist will sometimes give differentials like fat necrosis vs cancer. They wont always say it is this or that because if it is something else they can be sued so they describe what it looks like and measures and say it could be this or that. Praying for b9 results for both of you",
      "MessageIndex": 6,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/811969",
      "Title": "The Wait is the Worst Sam2U mermaid18"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 21, 2013 08:03PM melmcbee wrote: I didnt feel like drinking alcohol when I was on chemo. I did a/c/t. All I could handle was ice water. I hope you have a great time. Healing hugs",
      "MessageIndex": 1,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/811409",
      "Title": "Alcohol use during treatment Jolene1957 Jolene1957"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 24, 2012 01:51AM melmcbee wrote: Cindee, I am so sorry that you were made to feel that way. Let me tell you how it works in my hospital.  (im a ct, mri and xray tech). Technologist are not allowed to give results because we are not doctors and it is illegal. However I know that they sometimes do, I also know of situations where they told the pt what they thought and it turned out to be wrong. Thats why its illegal. However if a radiologist sees something of importance or emergent he will call the doctor and if he cant get a hold of a doctor he will call you. A radiologist will not let something emergent go because then that could be a lawsuit on him. If you sign a medical release at any doctors office like a pcp for example then they can get the results. At our hospital we have a medical records dept that you can go to and pick up a copy of your own results. They may just require a picture id.  Im not sure what type of facility you had yours done at but most should have a medical records dept. Good luck to you and again I am sorry that tech made you feel uneasy. The u/s techs I work with, had they known you traveled that far and or your doctor was unavailable... they would have probably had you wait there for the reading or sent you out to lunch and have you come back to give the radiologist time to read it. Our radiologist wouldnt have agreed with the tech blowing the pt off and expect her to worry and wait. However unless a radiologist gives a technologist a verbal reading on an exam the technologist cannot legally give a reading on their own opinion. They could lose their license for that. I pray you are well and I would immediately call your pcp to get that report or the facility and ask what they need to get you a copy. They can fax a medical release to you and you fax it back with a copy of your license and they can fax you that report. After I got that report I would write a complaint to the supervisor of radiology that the tech knew your doctor was awy and how concerned and scared you were and didnt even give you any tips on how to get that report. My boss would have our arse... for that. If you have any other facilities to go to I would also tell the supervisor that they just lost your business and how much you spent to fly there.. oh the more I think about it the madder it makes me. I am truly sorry for how you were treated. ",
      "MessageIndex": 4,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/792451",
      "Title": "Ultrasound confusion any advice would help!! cindee56 cindee56"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 25, 2013 02:35PM melmcbee wrote: I dont know anything about internal radiation. But I do know about nerve pain. I had a bad time with it and started taking neurontin and pain pills and stretching and rubbing the area. I believe that rubbing the area helps to settle down the nerves. I had a bmx and an axillary disection and tissue expanders and finally implants. Good luck",
      "MessageIndex": 1,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809940",
      "Title": "do zingers come from radiation? lpk49 chattipatti"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 25, 2013 04:23AM melmcbee wrote: I also used a gel patch that was called vigilon patch. It was a cool  blue patch that I kept in the fridge. Then I used silvadene in between the times I used those gel patches. I hope you feel better soon.",
      "MessageIndex": 7,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/800999",
      "Title": "Pain after Rads?? susancats melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jun 15, 2017 03:06PM melmcbee wrote: Is she taken any aspirin ir ibuprophen or vitamins or herbal meds.",
      "MessageIndex": 6,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856027",
      "Title": "Unexplained bruising and hematoma on arms and legs Kidmanliang Kidmanliang"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Dec 11, 2013 05:09AM melmcbee wrote: Hi nervous and welcome. Chrissy has given you great advice. I just wanted to add that caffeine could be aggravating it so try to cut down on your caffeine intake and please let us know how it turns out.",
      "MessageIndex": 2,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815637",
      "Title": "Really worried about a thickened area in my breast nervouspatient123 nervouspatient123"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 13, 2017 01:35AM melmcbee wrote: I found my lump after i felt pain in breast.",
      "MessageIndex": 32,
      "PostDate": "13/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852444",
      "Title": "How many of you felt a mass prior to getting tested? Hopefloatsagainandagain Cowboy-Up"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 11, 2018 11:58AM melmcbee wrote: I guess forgot important info but are they giving tamixifen post menopausal. Chemo put me in menopause and I was told I couldntt take it that I had to take an Ai. Anyway I didnt always remember my arimidex and now I wish I would have paud better attention. It may not have changed anything but I always try to suggest taking the pills the mo suggest. Best of luck. Healing hugs and prayers sent.",
      "MessageIndex": 8,
      "PostDate": "11/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862397",
      "Title": "Is Tamoxifen Worth It? Dustien msphil"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 2, 2013 10:13PM melmcbee wrote: Oh Letlet, how blessed you are. God has special plans for you and your baby. Congrats",
      "MessageIndex": 49,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/806012",
      "Title": "In shock for a different reason - PREGNANT! Letlet kathleen1966"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 26, 2013 11:20PM melmcbee wrote: It wasnt a big deal to me. I would suggest if you are claustrophobic that you take an anxiety pill first but if you dont it shouldnt be too bad for you. Most of the CT machines now are really fast so you wont be in the machine long. My experience was they put a squishy blue thing up under my upper body and molded to me with my arm up over my head and did a scan on me then left me on the table for about 20 minutes and I couldnt move while they did something on the computer.Afterwards I think they did another scan. The worst part was  probably just lying in the same position with my arm up for a while.  Hope it goes well for you. Hugs",
      "MessageIndex": 1,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/801083",
      "Title": "Mapping session tomorrow..What should I expect? josie123 Sickofpink"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 16, 2013 11:46PM melmcbee wrote: Katiejane, Im sorry you are going thru this. I also just got out of hospital for cellulitis so I obviously am not doing things right. Lol. I just wanted to tell you I know how miserable it is and I hope you feel better",
      "MessageIndex": 1,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/811107",
      "Title": "Immune System/Lymphedema/Cellulitis Katiejane Katiejane"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 10, 2013 05:39AM melmcbee wrote: Scaredmom, try to breaathe and relax. That is the best thing to do is get a biopsy. There isnt anything that you can do till you get the results. Ive read on here that 80% of lumps are benign so you have good odds. Find a project to keep your mind occupied because it may take a week for the results to come in from your biopsy. Try not to google too much because that will only give you more anxiety. Good luck and please let us know how it turns out. Im gonna add this to my favorites so I can follow your outcome. Sending prayers. Come on here and rant anytime and blow off steam if you need to.",
      "MessageIndex": 8,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806714",
      "Title": "35 with swollen, painful breast scaredmomoftwo scaredmomoftwo"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 3, 2017 08:43PM melmcbee wrote: Kandy Im sending prayers and healing vibes your way.",
      "MessageIndex": 553,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 18, 2013 03:18AM melmcbee wrote: Momof2doxies, praying for good results.",
      "MessageIndex": 18,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810470",
      "Title": "Possible re-occurance tessie51 momof2doxies"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 3, 2013 11:05PM - edited Sep 3, 2013 11:06PM by melmcbee Sorry that didnt work either Post breast therapy pain syndrome. Is the name",
      "MessageIndex": 1083,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 4, 2013 02:11PM melmcbee wrote: It wasnt too bad. I wouldnt say that I would want to do it everyday but the relief I feel is worth it if it last awhile. He did 3 different levels according to where I was hurting. He said if it helps then we can talk about doing something more permenant like killing those nerves. I dont know if i will do that but we will see. Healing hugs",
      "MessageIndex": 1106,
      "PostDate": "04/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 5, 2013 10:55PM melmcbee wrote: Mlp, sending healing hugs to you. I know this surgery will be the answer to your pain. As far as nerve blocks go, there are several different kinds of medicine that can be i jected and some last longer than others. If it is diagnostic then I am assuming they are usi g the lidocaine just to see if the right nerves are numbed so they know which ones to kill or do surgery on. Praying you find relief soon.",
      "MessageIndex": 1110,
      "PostDate": "05/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 26, 2017 05:59PM melmcbee wrote: Hi runnermum. Welcome. I was diagnosed 5 years ago at 42. How old are you. I chose a bilat mastectomy. Chemo and radiation. Then took arimidex cause the chemo put me in menopause. Please ask anything and come back for support. We care",
      "MessageIndex": 3,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/854513",
      "Title": "IlC JUST DIAGNOSED Runnermum Runnermum"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 14, 2017 05:44PM melmcbee wrote: Dont be terrified. You have an appointment monday. Nothing bad will happen that soon. Take an anxiety pill. Your breast could be swollen because you nay be starting your period or is there a chance of pregnancy. Good luck Monda",
      "MessageIndex": 2,
      "PostDate": "14/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854192",
      "Title": "Skin pulling and lump bowoky MTwoman"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 11, 2013 08:22AM melmcbee wrote: Absolutely. Try to. go to a breast surgeon if your nipple is inverted. They will probbly do the mamo again but insist on a biopsy. Insurance will usually not pay for mri unless you have breast cancer and a biopy is more definitive. Please let us know how it goes.",
      "MessageIndex": 1,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807559",
      "Title": "still concerned sandrak1 melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 3, 2013 05:13PM melmcbee wrote: Dorightbymom, i would be so mad if I did everything right and still got cancer. Unfortunately it happens. Did you check out the alternative thread or the holistic and complimentary. Thread? Sounds like you are very blessed to have a healthy mom minus the bc. I bet she is already healing. My dad is 75 and in hospice for alzheimers and fighting cancer for 20 years. He doesnt know me. I want to know all about the family history now. I have a million questions I wished I would have asked him. Have fun with girls night in. Ask your mom all about her childhood and big moments in history that she lived thru. She knows so much with her life experiences. Lord how I value that now. Please give her a big hug from me and tell her I could spend hours just listening to any story she wanted to tell. I bet since she ha juiced and such for so long that she may have some tips to share as well about healing th body. Ruthbru... you dont look a day over 50. I could listen to any story that you had to tell too.Healing hugs",
      "MessageIndex": 16,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812045",
      "Title": "Best Doctor for 90 Year Old Patient DoRightByMom salspecs"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 11, 2013 04:30PM melmcbee wrote: What is CIPN? Thanks",
      "MessageIndex": 1040,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 13, 2013 11:01PM melmcbee wrote: Alnd... Axillary lymph node dissection",
      "MessageIndex": 1045,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 2, 2013 08:45PM melmcbee wrote: MaryLou, I just had 3 intercostal nerve blocks Tuesday. I felt completely numb afterwards and he said that was from the lidocaine. Today the soreness is comong back in some areas. He said to give it 5 days to gauge how it will be. How did yours work? Thanks for any help.",
      "MessageIndex": 1099,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 28, 2014 11:58PM melmcbee wrote: Hi ladies. I just wanted to check in and see how everyone is doing. I started hurting again this past week and decided to come back and look when I posted about my nerve blocks. It was Oct 2 2013 so I now realize that the nerve blocks must have worn off. That isn't bad timing. Its almost 5 months so I guess that I should be happy they lasted that long. The pain came back quick and hard. I have had a sinus/ cough thing for the last 6 months and I thought this past week that maybe I broke another rib from coughing but have realized that the pain is too spread out and it must be my nerves again. Guess I will decide to go back and get the injections done again..... How is everyone else doing? Healing hugs  ",
      "MessageIndex": 1146,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 12, 2014 11:59PM melmcbee wrote: Hi Sandra. Im sorry that you are going thru this. I wanted to tell you some suggestions that helped me after my first surgery. I was told to lightly rub the skin area to help desensitize it and I thought it was crazy but I did it and it worked. So I always looked like a fool at work rubbing my tissue expanders and side. It did start to work. I also used ice packs all of the time. Then I had the exchange surgery and didn't have too many problems until I got sick with cellulitis and a bad cough and I cracked a rib on my radiated/alnd side and have had problems ever since. I had intercostal nerve blocks which lasted for 5 months then I got sick with the bad cough again and I think I reinjured the rib and the nerve pain about killed me. I got the nerve blocks 1 week ago and it has helped with the severity of the pain but if I cough or sneeze I still feel like its a broke rib. I was told today that I just have to heal. I can get these injections every 3 months if needed but im hoping it will just go away. Unfortunately, when we are hit with a diagnosis of breast cancer we don't have the option of asking what damage the treatments and surgeries will cause because a cracked rib or fried nerve is still better than cancer. Or so I am telling myself. lol. As someone who has gone thru this since July 2012 I can say to try PT and the lymphedema PT. Learn how to do the Lymphatic manual drainage because it could help you and certainly wont hurt you.  Dulcigirl is smart to send you to the Lymphedema thread because they are really smart about the subject. Try to desensitize the area by massaging it. I was told not to use ice but it helped me however I was going thru chemopause and could melt an icecube on my forehead. lol  Goodluck and healing hugs ",
      "MessageIndex": 1157,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 25, 2013 04:15PM melmcbee wrote: I believe it is from multiple surgeries ans radiation. Its my radiated side that has the shooting pain if I move the wrong way.",
      "MessageIndex": 3,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809940",
      "Title": "do zingers come from radiation? lpk49 chattipatti"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 25, 2013 06:17PM melmcbee wrote: Thats great Carolyn, glad you are feeling better.  Hugs",
      "MessageIndex": 8,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/800888",
      "Title": "Why is my breast getting hard and swollen? CarolynVM melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Feb 23, 2013 11:38PM melmcbee wrote: I am swollen too. I have tissue expanders and it feels like its pinching and painful. Just wanted you to know that you arent alone. I think its just normal tissue reaction to the radiation. hugs",
      "MessageIndex": 3,
      "PostDate": "23/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/800888",
      "Title": "Why is my breast getting hard and swollen? CarolynVM melmcbee"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 26, 2017 10:23PM melmcbee wrote: Write your questions down and carry them with you. Record the meeting. Take someone with you that can help you remember what is said. Good luck.",
      "MessageIndex": 8,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/854513",
      "Title": "IlC JUST DIAGNOSED Runnermum Runnermum"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 10, 2014 10:15PM melmcbee wrote: Ladies, I also wanted to tell you to try and rub the skin on the area that hurts. Sometimes it helps with the burning if you do it several times a day. Even if it hurts bad to do it. The nerve endings are trying to regenerate and if you get a cloth and rub it then it kind of desensitizes it. This was a trick that I used after surgery for the first year and it did help.",
      "MessageIndex": 1217,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 1, 2013 08:40PM melmcbee wrote: Wow, 90 years old. Thats amazing in this time. How does she feel about the mamo results? Does she want to fight it? There is an awesome alternative thread here with some really smart people. They can give you an idea of what kind of juicing, diet and supplements and they will know some doctors. I think its so good of you to want the best for your mom. If I make it to 90 I want a margarita and a big steak and baked potato and a pack of cigs to celebrate. Many blessings to you and you mother.",
      "MessageIndex": 2,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812045",
      "Title": "Best Doctor for 90 Year Old Patient DoRightByMom salspecs"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 5, 2017 02:47PM melmcbee wrote: Kandy im so happy you are back home. Continued prayers for you",
      "MessageIndex": 572,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 31, 2017 07:42PM melmcbee wrote: Lita Im sending prayers and healing thoughts.",
      "MessageIndex": 646,
      "PostDate": "31/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 4, 2017 08:50PM melmcbee wrote: Prayers and hugs sent.",
      "MessageIndex": 738,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 1, 2013 07:34PM melmcbee wrote: Congrats on good news.",
      "MessageIndex": 33,
      "PostDate": "01/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/810121",
      "Title": "More Tests Ugh pupfoster1 lovujja"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Apr 8, 2014 08:40PM melmcbee wrote: Oh gosh Momof2, Im so sorry that you are in pain. I don't know why you are experiencing it. I have had to have steroid injections in my back cause of nerve pain from my surgeries but they were more rcent then yours so I don't know if that is why. I can tell you that it was a pain management doctor that was finally able to handle it. However the hole you are referring to concerns me. I would call either your breast surgeon or oncologist and see if they have any ideas. I so hope you get some help.",
      "MessageIndex": 1164,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jan 8, 2013 07:56PM melmcbee wrote: Mrs Henderson, Healing hugs and prayers coming your way for good results. Dr. google is a dangerous beast but we all do it. lol. Someone will come along soon that has more info for you. Good luck.",
      "MessageIndex": 1,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/798584",
      "Title": "Endometrial cancer, too?! Scared. MrsH Sherry528"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Jul 27, 2017 09:07PM melmcbee wrote: Happy Anniversary. You look so beautiful and happy.",
      "MessageIndex": 504,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 1, 2017 05:38PM melmcbee wrote: Kandy you are in my prayers.",
      "MessageIndex": 526,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "May 20, 2017 07:59AM melmcbee wrote: Hey Ann. I turned stage 4 with bone mets at around 4 1/2 years to. I think we were on tge same threads back in the beginning. Im sorry you are here. However welcome. I did bilat nastectomy raduation and chemo but I had 8 positive nodes. Im on faslodex ibrance and xgeva. Prayers and gentle hugs to you",
      "MessageIndex": 7,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/855278",
      "Title": "Newbie here & reaching out AnnBR AnnBR"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 8, 2013 06:45PM melmcbee wrote: Yogagal, I just got out of hospital too for. Ellulitis about 3 weeks ago. And here is the kicker. My last surgery was May 30 th 2013. My ps ws really ticked. Lol I was a non worker during treatments. I had A/C/T. Every 3 weeks an it kicked my butt. So did the neulesta shot. Good luck",
      "MessageIndex": 27,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811093",
      "Title": "Working while going thru treatment Yogagal segunda"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Mar 8, 2013 06:57PM melmcbee wrote: Congrats and thanks for bringing us inspiration. Hugs",
      "MessageIndex": 4,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/801582",
      "Title": "4 YEARS ALREADY! Shanagirl lovujja"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Aug 8, 2013 09:45PM melmcbee wrote: Hi ladies. I was just stopping by for some answers. I am having some sharp burning pain in my radiated breast. I just had my exchange surgery at the end od May. It just started getting bad again the last 2 weeks. I had pain like this after my bmx and I assumed it was my tissue expanders. They about killed me. I Had a catscan a few days ago and it showed a fractured rib. I know the pain Im feeling isnt from that. If I move the wrong way I have a sharp shooting pain across my rt breast. I just went back to work full time a few weeks ago and its killing me. I have ice on it which helps. I dont have problems with my shoulder nor do I feel a tight feeling aroung my chest. It just burning shooting pains. What is the best doctor to go to for this? Thanks for any help that you can give me.",
      "MessageIndex": 1037,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Oct 14, 2013 10:06PM melmcbee wrote: Faithfully, Im so happy that you are being referred out for a biopsy. Hopefully you will have some answers soon",
      "MessageIndex": 12,
      "PostDate": "14/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811912",
      "Title": "Gut feeling? Faithfuly13R Faithfuly13R"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 29, 2013 10:48PM melmcbee wrote: Faithfully,wow.... you have been thru a lot. I dont have any answers for you except if something is growing out of your breast then it would probably be a good idea to let a doctor get it out and send it off for testing. I have invasive lobular which didnt show up on mamo. I also had a painful palpable mass. It hurt but I didnt have shooting pains. It almost sounds like an infection with the swelling and heat. I would try to find a breast clinic. I hope you get the help you need. Good luck.",
      "MessageIndex": 1,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811912",
      "Title": "Gut feeling? Faithfuly13R Faithfuly13R"
    },
    {
      "AuthorID": "melmcbee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155690/profile",
      "Content": "Sep 30, 2013 01:04AM melmcbee wrote: Faithfully, I am a radiological technologists and when I found the lump I went to work and told my co workers about it nd they got our mamo tech to feel it and she got me in to our radiologist breasst clinic in Jackonville. I jut had a clear mammo six months ago but they did a mammo which didnt show anything so they sent me for an ultrasound and a radiologist came in and looked at it and told me to go eat lunch and come back in two hours and get a biopsy. I knew that day the results would be positive just by what she said. That was on a tuesday and saturday I went to the hospital I ork for and pulled my own pathology report. Invasive lobular grows flat like a trellis and therefore it i usually not detected early. I had a mri on my breast and it actually measured at arojnd six cms but the when I had a bilat mastecfomy it turned out to be three different tumors. I ended up having 8 out of 15 positive nodes with extravasation into the tissue. I did six months of chemo and bad to do radiation. I now take arimidex. We dont really say we are cured or cancer free we just say we are NED. No evidence of disease. There is an IBC thread on here. Have you read any of it or posted any questions to them. They can help you get some i sight. I dont know much about IBC but I know the fear and frustration you are feeling. I pray you get to the right place to get you some answers that you ned and please let us know how you are doing. We are praying for B9 results for you.",
      "MessageIndex": 5,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811912",
      "Title": "Gut feeling? Faithfuly13R Faithfuly13R"
    }
  ]
}