{
  "AuthorID": "Melsyboo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77836/profile",
  "Posts": [
    {
      "AuthorID": "Melsyboo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77836/profile",
      "Content": "Melsyboo wrote: Sorry if I ramble, but I am nervous for my mom. A couple weeks ago she went for a mammogram. They saw something suspicious so scheduled her for a biopsy. Before the biopsy she was scheduled to see her Dr. The Dr. was not worried about the mammogram findings, (she has calcifications and they just watch them), but she did find a small lump that did not show on the mammogram. She tried doing a needle biopsy there, but the lump was solid and not fluid filled, so my mom was scheduled for a biopsy this morning. While she was there, the Dr told her that the lab \"didn't like the looks of the first sample.\" Apparently last week, she sent that small sample to the lab. I didn't even know she had taken a sample last time..Anyway..my mother didn't ask the Dr what they meant by that. It could mean they didn't like the looks of it because there was hardly anything to look at? Too small of a sample..I am so worried now. My mother is a wreck as well. Now she has to wait until Friday to get the results from todays biopsy! What a mess. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747306",
      "Title": "Biopsy confusion?? Melsyboo Hope_M"
    },
    {
      "AuthorID": "Melsyboo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77836/profile",
      "Content": "Jan 25, 2010 07:52AM Melsyboo wrote: I am sure my mother didn't even hear everything she said. She was so nervous, and you tend to space out and not listen clearly! The Dr could have simply said they didn't like the sample..many different meanings could be assumed there. All we can do is wait now. They got the bigger sample from todays biopsy and hopefully we will get good news! Thanks for letting me vent. It is just so scary!",
      "MessageIndex": 2,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747306",
      "Title": "Biopsy confusion?? Melsyboo Hope_M"
    },
    {
      "AuthorID": "Melsyboo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77836/profile",
      "Content": "Jan 29, 2010 09:50AM Melsyboo wrote: So it's Friday and my mother and I are on pins and needles waiting for these results! I am at work. My mother called me to say that the Dr office had called to remind her of her follow up appt for Monday. She said well what about my results? The Dr was supposed to call me today. The ladt said well that's what the follow up appt is for! Boy do they know how to drive people nuts! I understand a follow up appt to check the biopsy area, make sure it is healed etc etc, but if the Dr said she would call Friday then I hope she does! Sorry for venting, but it sucks that a person has to wait and go through all this! I assume the results must be in by now and if they were anything bad she would have called. UGH the waiting is so hard!",
      "MessageIndex": 4,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747306",
      "Title": "Biopsy confusion?? Melsyboo Hope_M"
    },
    {
      "AuthorID": "Melsyboo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77836/profile",
      "Content": "Melsyboo wrote: Well, Friday my mom was supposed to have her lumpectomy and SNB..but she is sick :(. She has an appt with her primary for a chest xray to see if she has pneumonia or is just really congested. She was just at her primary on Monday and her lungs were clear, she just had the beginnings of a cough. She also had an xray done at her pre-op Friday. Just one more hurdle for her to deal with! When she called the BS to postpone they were kind of rude. They asked her if it was a permanent postponement. She explained to them she is sick and can't possibly have surgery in her condition. Just the sound of her voice could have clued them in! SO, her next appt is March 26th with the DR, but not sure about the new surgery date. They have to get back to her on that!~ More waiting now and more stress. Sorry for the rant! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749240",
      "Title": "Surgery postponed Melsyboo Jellydonut"
    },
    {
      "AuthorID": "Melsyboo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77836/profile",
      "Content": "Melsyboo wrote: I have a hard lump about 3 or 4 inches under my right breast, on my ribcage area. It is right below the area where my bra band sits. It's not painful at all, not red, and looks like it is right under the skin. Could this be caused by friction from my bra? I know breast cancer lumps can be found in armpit area as well, but can they be located this far below? Just curious..I am 33 and nervous! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727378",
      "Title": "lump on rib Melsyboo belecoi"
    }
  ]
}