{
  "AuthorID": "Meme117",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
  "Posts": [
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Mar 10, 2015 05:33AM Meme117 wrote: Hi Cmo65, sorry to see you have to join this club. I'm almost identical. 49 with no family history. My tumor is just over 2 cm so puts me at stage 2. It's been almost 2 weeks and the reality of my \"new\" life is just setting in. Each day brings new info and new doctors. The major shock for me is the need for chemo and all the lovely side effects, this being due to her+. I have found this site the bestest for info and support, I'm all about being prepared. Hugs to you!",
      "MessageIndex": 6,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829317",
      "Title": "Was told this evening I have IDC Cmo65 mel147"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Apr 4, 2017 04:08AM Meme117 wrote: Hi I've been DX with a lung nodule er+pr-her2+. I'm getting a third opinion today then should have a plan. Anyone have lung nodules removed? Maryellen",
      "MessageIndex": 1816,
      "PostDate": "04/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Sep 12, 2015 09:30AM Meme117 wrote: Good morning from PA! I'm officially staring on 9/21 due for 33. Had the simulation with mapping yesterday, cancer sucks! Will do a trial run next Friday, really. I just want to get it done. I guess a whole week doesn't matter in the grand scheme but for me and my life, I want to be done. The skin care instructions I received are to use lindy, eucerin or aveeno cream. Apply 2-3x/day, apply nothing 4 hrs before treatment and use a mild soap such as dove. I was told to try not to mix lotions as if there is a reaction they will know what cream. RO said some people have a reaction with aquaphor. Someone on this site recommended emu oil and vit e cream. I have aquaphor ready to go and the emu oil. I was told by the nursing staff to stop taking vit a,c and e, so I'm not sure about using vit e cream. I need to find out more info about vitamin interaction. There is a good video online that shows the radiation procedure www.rtanswers.org And I love the photo from Connecticut so beautiful what a wonderful hike.",
      "MessageIndex": 160,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Oct 19, 2015 11:11PM Meme117 wrote: WeLcome to newbees and congrats to those who finished! On my forth week, red but ok. Using aquaphor and calendula and the cooling towel. Bit of fatigue but manageable. Chisandy thanks for all the info, very informative. Why is fat only surgically removable?",
      "MessageIndex": 995,
      "PostDate": "19/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Sep 30, 2015 11:38PM Meme117 wrote: goofyfoot hugs to you, sorry you were in such pain. And a big congrats for finishing that mountain , you hoo girl! Congrats to those who finished!! Tomorrow only at #8 and still hating it.",
      "MessageIndex": 532,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Sep 21, 2015 10:11PM Meme117 wrote: First one done, it was easy but I sure had a lot of anxiety. I have tattoos, no lines or stickers. I met with a doctor for 5 minutes. I think I'd be pretty annoyed if a tech was snarky with me. We are in an uncomfortable position fighting breast cancer. I can see how it would rub off with sweat and possible lotion. You should be able to draw it if need be otherwise they need to find another option. I'd love to see my X-ray plans. Horsegirl did you ask to see or was it just offered to you?",
      "MessageIndex": 268,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Sep 27, 2015 10:29PM Meme117 wrote: 5th treatment tomorrow, bleh. My boob already has partial redness and my underarm is tight. I should have walked around with my arm up this weekend. Can't see the eclipse it's totally cloudy.",
      "MessageIndex": 438,
      "PostDate": "27/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Mar 7, 2015 09:35PM Meme117 wrote: Thank you for responses. Sewingnut, I love to cruise, can relate to port comment. A year of herceptin? My BS said this would be in my treatment but I don't think a year. How were your SEs? Where is the triple positive thread? Beachbum1023, I also love the beach, I'm about an hour and a half to jersey beaches. Can't wait till our snow piles are finally gone and the sunny weather returns. Not sure if I'll feel like the beach since I'll be in the throw of chemo over the summer. Lilyn, where did you get your soft scarfs? Trying to find a variety of sites. Elainetherese, thanks for the info. I do have one gf who is being a point person. April25, I think fb would be an easier way to reach a lot, I'm not much of a phone person, I already owe some return calls now😁 looks like I'm going to be having the same chemo treatment can you give me any pointers? I'm ready to get this over with!",
      "MessageIndex": 6,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829226",
      "Title": "Overwhelming yet trying to be positive - a new reality Meme117 Trvler"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Sep 1, 2015 03:47AM Meme117 wrote: hi I'll be joining in, not sure start date but second consult next week so thinking the week of the 15th. Thanks for photos very helpful.",
      "MessageIndex": 34,
      "PostDate": "01/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Sep 25, 2015 12:36PM Meme117 wrote: thanks for the video, so interesting. I disrobe before I get on the table, a bit unnerving since the room is freezing. Today they gave me heated towels. There's been 3-4 techs each time with much lining up to start and I put my arms up over my head. I also count to get thru and there's music. I'm down 4 out of 33, my boob is red already and I'm tired. Rads so far is not as hard as chemo. Chemo was 18 of TCHP with herceptin till April every 3 weeks. The SEs were tough from hairloss, eye issues, major body pain and more and others have it worse. I agree that due to the actual sessions in which friends and family come with and provide comfort it felt less vulnerable than radiation. I wish my chemo place had TVs and gave out drinks. Congratulations to those who finished!",
      "MessageIndex": 367,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Oct 11, 2015 12:22AM Meme117 wrote: someone posted a bracelet pic - love it where to buy? Congrats Karen on being finished! I'm 1/3 done and have bit rosy skin , bit of swelling and nipple sensitivity. Bought cooling towel and love it!",
      "MessageIndex": 749,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Oct 13, 2015 10:10PM Meme117 wrote: Only 18 more to go, bleh! I have had some twangs of pain today in my boob anyone have that? It's very quick but has happened a few times today. Definitely feeling more sunburn today. And fatigue hit me hard today but pushed thru and took nap at 5:30 and now to bed at 10. Welcome newbees, I highly recommend getting the cool towel.",
      "MessageIndex": 801,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Meme117 wrote: I had my first appt with MO and he was nice, not overly impressed but I don't have much experience with doctors😀 I didn't like the chemo room, am I supposed to? It was dreary, so so quiet, a big room lined with chairs along the walls. I was stunned it was so depressing. Are they all that way? Maryellen Dx 2/25/2015, IDC, Left, 2cm, Stage IIA, Grade 3, 1/13 nodes, ER+/PR+, HER2+ (FISH) Chemotherapy 3/23/2015 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/4/2015 Lumpectomy: Left; Lymph node removal: Sentinel Dx 3/24/2017, Stage IV, metastasized to lungs Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829315",
      "Title": "Your Chemo Room - please describe Meme117 Mommato3"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Meme117 wrote: Diagnosed 2/25, knew it was coming after reading ultrasound report. IDC stage 2 triple+. Saying I have cancer has been the real part - honestly it sucks! Family and friends have been wonderful but I'm already tired of explaining over and over. Anyone use Facebook to share info or a website? Appt Monday with MO to set up the chemo. Plan is 6 rounds through 18 weeks, then lumpectomy or mastectomy, then radiation - it's going to be a longer process than I imagined. Making plans now to deal with hair loss😢 but I am determined to be a warrior! Maryellen Dx 2/25/2015, IDC, Left, 2cm, Stage IIA, Grade 3, 1/13 nodes, ER+/PR+, HER2+ (FISH) Chemotherapy 3/23/2015 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/4/2015 Lumpectomy: Left; Lymph node removal: Sentinel Dx 3/24/2017, Stage IV, metastasized to lungs Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829226",
      "Title": "Overwhelming yet trying to be positive - a new reality Meme117 Trvler"
    },
    {
      "AuthorID": "Meme117",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212309/profile",
      "Content": "Mar 10, 2015 08:49AM Meme117 wrote: thanks ladies for the info! I'm going to call a different MO office maybe they'll let me just visit. I do think of it as a long term investment😄this place would be 8 miles farther not too bad. Beachbum1023 your place is more my style sounds fabulous!! I love tiara Tuesday, I'm all about the theme",
      "MessageIndex": 8,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829315",
      "Title": "Your Chemo Room - please describe Meme117 Mommato3"
    }
  ]
}