{
  "AuthorID": "meme31",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
  "Posts": [
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Mar 9, 2011 11:39AM meme31 wrote: bump!  Sorry about your moms diagnosis.",
      "MessageIndex": 4,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/765651",
      "Title": "Breast hardening 15 years after radiation belamom meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "meme31 wrote: I've been off and on here for a few years with bumps that never show up anywhere on images.  So I feel like i'm just getting to know my breasts and what is normal.  So when i saw a surgeon in Aug of 2012 after having a mammo and us for a lump that didn't show up he said he felt it was a cyst.  He said he felt three actually about the size of a jelly bean and his level of suspicion was 0.  So good just come back if it grows.  Of course it's grown since then and feels like a small tootsie roll kind of squishy yet firm.  I went thru the early detection works again and they paid for me to have yet another mammo and us and all is good.  So they don't want to send me to a surgeon. I don't have insurance and if you are dx with bc thru this program you are automatically approved for medicaid. If i see someone on my own i may have to pay and if it would actually turn out to be something bad i don't know how i would pay for it.   So i'm wondering if i should fight and ask them to cover it or go see someone on my own or just let it be?  I'm not comfortable having something growing in there but if it keeps not showing up then i would think it's nothing.  It's in the upper outer most part of my breast about 1 oclock in the left one almost along the edge of my breast.  I'm only scattered fibroglandular tissues so not considered heavily dense.  But of course it's in the dense area i do have.  Do women with not heavily dense breasts have things missed on tests? I would just love some thoughts please.  Thank you! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803528",
      "Title": "I would love some advice please! meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Apr 21, 2013 12:11PM meme31 wrote: Thanx ladies and mods:)  I'm thinking i will try to see if the early detection works will let me see a surgeon and if not i will see one on my own.  I was thinking the other day if it was my daughter i would push to have it bx to make sure so i should do the same for me.  It's just hard to do it for myself.  Especially when i keep feeling stupid and a bit embarrassed about pushing for answers when it's probably not a big deal....",
      "MessageIndex": 4,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803528",
      "Title": "I would love some advice please! meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Apr 23, 2013 06:54AM meme31 wrote: Thank you ablydec, you are right. I'm 34 so not a high risk at all for age. I just have to tell myself that with any health concerns i have for myself.  It's so much easier to be insistant for the ones i love than myself.  Such is the life of a mother.  I've left a message for the nurse navigator at the hospital i had the diagnostics run at and hoping she will get me in to see a surgeon.  If she cant then i will go on my own to another hospital(KU med center, recently deemed an NCI hospital).  I already have a referrell to see a surgeon there from my primary doc for the lump.  I told the lady setting up the appt. i had to find out if i can get it through the EDW works first then let her know if i needed to set up the appt. with her or not.  That hospital is a good one and i may be able to get charity payment for some or all the things if i have to see them.  It's funny because i would prefer that hospital in the first place but the EDW doesn't work through them.  We will see where i end up going, but i'm going somewhere;) Thanx again ladies!",
      "MessageIndex": 6,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803528",
      "Title": "I would love some advice please! meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Apr 24, 2013 08:50AM meme31 wrote: I made my appt. on my own through KU and they are sending me financial paperwork to fill out so at least some of it should be covered.  They were really good working with my twin sister to pay her bills since she doesn't qualify for medicaid or disability since she recently had a lipoma removed from inside her spinal cord and was in the hospital for 5 weeks and still going to rehab. We can never be too careful I think, I know statistics don't matter really because we are all people and not numbers and my sister was in the 0.01%(something like that)for her tumor and location of it.  So i'm going on May 16 to the breast clinic to see a BS.  It feels good to have it scheduled. ",
      "MessageIndex": 7,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803528",
      "Title": "I would love some advice please! meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 16, 2010 12:14AM meme31 wrote: Thank you for the prompt response-everything seems to be going  so slow.  Did you get a dx yet from your tests?  When i called another hospital's breast center she tried to reassure me as to the first radiologist reading it well and it's run through the computer for detection she said probably but i could have another mammo for $150. i've also done some researching on the cad technology which is the computer reading it and it defintitely doesn't make me feel more secure. I feel like i have a terrible time getting people to give me a straight answer. She never said if we could bring in records for another opinion or not.  i might just have to call back and bother them again-although it seems like that's all i keep doing with everyone involved, records, nurses, edc.  I read several papers that said asymmetry was commonly seen on mammo's but it stated 3% of all mammos it showed up on.  Is three percent common, if it was then the 20%of biopsies that turned out malignant would be a regular occurence rather than being assured it's not common. ",
      "MessageIndex": 2,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760779",
      "Title": "second opinion-do i have to have another mammo for that? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "meme31 wrote: I'm not comfortable with my dx from my mammo and am wondering if i have to do the test over again somewhere else or just have another look at the test i already had?  I have posted a few other things with my info within the past couple weeks.  i don't have insurance and one place said they would do another mammo for $150.  Do i ask for another radiologist to read it or someone else-surgeon?  I've read alot of radiologist papers and teaching files on line and it seems that my asymmetry maybe should have rated a birads-3 not 2.  I just don't feel settled after the mammo and the us- which i insisted on- was neg.  But i told them where to look for the asymmetry-she didn't know and i don't know if i was right on where  to look.  It did not say which quadrant or postition it was seen on only upper right breast.  ???  I'm not worried about the lump which started the initial process so much now-i think a couple of times i have felt the same in other breast at same spot-which is good-it's harder to find but i think it's there?  I've read about ILC and it may present as asymmetry on mammo.  But the mammo most often doesn't even pick it up because of how it grows.  This is starting to drive me nuts and just want to know for sure there is nothing there to worry about.  It seems that asymmetry doesn't show up that often on mammo's and maybe that's why i haven't gotten much info from others on here about it.  The only stuff i have found is on the ILC thread and even there noone answered my post.  I feel like because im only 31 that maybe things aren't being done as carefully.  Maybe more mammo pics should have been taken.  I still think it's weird they did not want to biopsy the lump which is why i went in the first place.  It's in the same breast as the asymmetry.  I also think it should have been called focal asymmetry because it showed on two projections at least.  Please any more advice would be great.  The edc said it is possible if i had another mammo on my own that showed something suspicious they would maybe pay for the biopsy and mri.  But she did not know she just said if i have them done on my own and it suggests something more i should call and see if they will pay those.  Thanx for listening-it helps putting it all out here for others to see. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760779",
      "Title": "second opinion-do i have to have another mammo for that? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 16, 2010 03:40AM meme31 wrote: I'll pray for b9 results for you sue.  And i appreciate any info so thanx for sharing.  the waiting process really sucks for us all.  There's a very good chance yours is b9!",
      "MessageIndex": 4,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760779",
      "Title": "second opinion-do i have to have another mammo for that? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 11, 2011 05:53PM meme31 wrote: I have no idea what you are speaking about-montgomery glands and smaller bumps?",
      "MessageIndex": 1,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776326",
      "Title": "What Is This? Should I Be Worried? WeWillFindHope shells43"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 11, 2011 08:08PM meme31 wrote: I also looked it up and i don't think it's related at all either.  Thanx for making me figure out what it was though, i have those too and acne on my breast.  Good to see i'm not a freak. ",
      "MessageIndex": 3,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776326",
      "Title": "What Is This? Should I Be Worried? WeWillFindHope shells43"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 28, 2011 06:58PM meme31 wrote: bump",
      "MessageIndex": 1,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/775669",
      "Title": "\"You are a Stage III\" Shanagirl Shanagirl"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 16, 2010 11:01AM meme31 wrote: ya, i got ahold of another hospital and the breast center manager said she asked the radiologist and he wouldn't give me an official report but would be happy to look over the mammo and report for free.  So that will save me a couple hundred dollars-for now at least-that is so great of them to do that for free-an answer to my prayers. ",
      "MessageIndex": 5,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760779",
      "Title": "second opinion-do i have to have another mammo for that? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 4, 2012 04:43PM meme31 wrote: you may want to start a new thread for the question about cysts.",
      "MessageIndex": 63,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Feb 28, 2011 07:32AM meme31 wrote: Thanx for the info, i've been wondering about the self exams.  I do not understand though if you are supposed to slide you fingers and some of the checking or just actually move your fingers and feel in there or both. In the video she was sliding her hand. If i slide my fingers i feel things that i don't if i actually use my fingers to dig around.",
      "MessageIndex": 7,
      "PostDate": "28/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765502",
      "Title": "Breast Self Examination for Breast Cancer olivia888 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jan 27, 2011 10:53AM meme31 wrote: I'm sorry you are still waiting-i'm sure it is very hard.  Thinking good thoughts and prayers for you. ",
      "MessageIndex": 14,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763784",
      "Title": "Waiting....biopsy results 8 days + cherylmi Lisa1962"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jan 22, 2011 06:57AM meme31 wrote: well i'm not an expert by any means-but i don't think the type of biopsy has anything to do with it.  I do know a lot of paths get sent out for second opinions.  It isn't bad or good-they just have to make sure they are getting it right.  Sometimes certain things can look similar and certainly wouldn't want them to be wrong.  Just hang in there-the waiting sux!",
      "MessageIndex": 2,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763784",
      "Title": "Waiting....biopsy results 8 days + cherylmi Lisa1962"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 4, 2010 06:53PM meme31 wrote: gonna-win-i agree it seems after reading so many stories on here about that very thing-not seeing something on tests and wait and see method that is risky and we should be proactive in our own health.  I've been posting on the not diagnosed but worried forum and i am finally getting my us tomorrow-i am 31 and my doc found a lump and said wait and see so after a few weeks it didn't go away so i found a company to pay for it-i don't have insurance and they will cover the tests if necessary and biopsy.  I had a mammo that did not see the lump but had only a few calcifications and some assyemetry so they said ok just come back in a year.  I insisted on an us so here i go tomorrow. Luv- i'm sorry for your diagnosis but the women on here are heaven sent and can give lots of support and advice for your decisions and worries.  Good luck to you to you both.",
      "MessageIndex": 15,
      "PostDate": "04/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/760034",
      "Title": "Diagnosed 10/19/10 luvmykids143 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 7, 2012 07:00PM meme31 wrote: I've heard thryroid problems can cause breast problems.  It seems maybe it's time to look for a different source rather that the breast.  And maybe another bx of the breast too.  I'm sorry you are dealing with this crap for sooo long.  I hope it gets figured out soon!",
      "MessageIndex": 15,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774728",
      "Title": "Thoughts, Comments, and Questions Welcomed! KD2011"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Dec 10, 2010 07:08AM meme31 wrote: bump up so someone with knowledge about this might see it and provide an answer-good luck!",
      "MessageIndex": 1,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761743",
      "Title": "B9 but still questions what_ifs texasdonna"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 31, 2011 11:46AM meme31 wrote: That's good news.  I don't want to needlessly worry you and i'm glad you feel better but asymmetry should be followed up with i thought.  More views are good but i don't believe it's true that if it was really there it should show up on all images the same.  It is unlikely to be a true lesion but it can hide in certain views.  It's good that they did so many views but just make sure you go back in a year.  And if you feel uncomfortable at any point or feel you want a more solid answer i think an US is certainly a good option to check it out and make sure.  I've researched a lot about asymmetry and that's why i was saying that. Rarely cancer can show as asymmetry hiding in certain views. ",
      "MessageIndex": 9,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773940",
      "Title": "Thank You All! Good News! Charlene40 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 29, 2011 08:27AM meme31 wrote: Hang in there honey!  I think it's great you will get results so fast but still very scary.  Of course you aren't a wimp and if you were so what.  You don't have to be strong you just have to get through it.  I'd be terrified of those rapids and more at ease with a surgery.  We are just all different.  But i know you can do it, you will do it, and you will feel some relief either way when you are done knowing what you are dealing with.  Hoping today gets a little easier for you!",
      "MessageIndex": 1,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775694",
      "Title": "It's this afternoon--excisional biopsy claireinaz Twin330"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Apr 24, 2013 06:34AM meme31 wrote: The bs can explain it all to you.  Keep your appt so you won't be confused when it's all done.  Good luck next week.",
      "MessageIndex": 1,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803710",
      "Title": "Test Results JoyMrt5 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 14, 2011 09:53AM meme31 wrote: Oh honey don't worry about being difficult.  I think sometimes if we aren't quiet and do what we are told then we are difficult.  It's good that you will get a better position with the other machine and can comfortably do the bx.  It shouldn't be painful for you. ",
      "MessageIndex": 1,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/774844",
      "Title": "Unsuccessful biopsy JodyJ JodyJ"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 18, 2011 05:15PM meme31 wrote: Good for you going straight to MRI.  Yes they are reliable but can have false positives.  But most women think that's a lot better than false negatives. ",
      "MessageIndex": 5,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776392",
      "Title": "lump?? Curiousone Curiousone"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 14, 2011 07:21PM meme31 wrote: Sounds like a good plan.  I've not heard of a fatty lymph node.  But i'm not a dr.  God bless you  too and let us know how it goes tomorrow.",
      "MessageIndex": 7,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773119",
      "Title": "Dimpling when lying down. lilmansmamaw meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 15, 2011 08:34PM meme31 wrote: Yes please let us know how it goes. ",
      "MessageIndex": 10,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773119",
      "Title": "Dimpling when lying down. lilmansmamaw meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 12, 2011 06:47PM meme31 wrote: It's up to you to be worried or not.  I think it's great you aren't.  But you seem unsettled and that means maybe another trip to the doc.  They can do an US to look better.  Mammo's don't catch everything. Especially in dense breasts and if the lump is outside the area the mammo can view. ",
      "MessageIndex": 1,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776392",
      "Title": "lump?? Curiousone Curiousone"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 24, 2010 09:03PM meme31 wrote: The Early Detection Works-in KS-i don't know if it is other states or not.  They pay for a mammo and other tests including paps for women without ins.  At least at 40 and after.  They had to approve mine by asking the nurse about a pappable lump i have and they agreed to a cbe and mammo-i had to push for the other tests but got more.",
      "MessageIndex": 8,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/761126",
      "Title": "Terrified of MRI results drewmom apple"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 18, 2011 12:57AM meme31 wrote: I have no insight just hugs.  I'm sorry you are having the new symptom  and you have to wait for everything.  Maybe someone else will come along but it is slow on the weekends  so might not get lots of traffic.  I'll say a prayer for you.  It all sux and is just scary!",
      "MessageIndex": 2,
      "PostDate": "18/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775029",
      "Title": "Blood leaking from nipple 6 days after core biopsy? Normal? Kimmer1975 Lifes-A-Beach"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 23, 2010 08:44PM meme31 wrote: this is a good thing i agree!  Better safe than sorry and just because they don't see something suspiciuos on there and they believe it to be ok does not mean it always is.  This site is full of women who had non suspicious things found and turned out as cancer-you just don't know what cancer looks like for sure and if it shows up on tests at all!  I've also learned how to be proactive for oneself because others often won't-it's our job and being young-i'm 31, and you are young as well means people might be more likely to dismiss something because it's not as common in younger women.  I'm finally getting a surgical consult on Dec. 2 for a small lump my doc found but that took a lot of annoying the proffessionals to agree to pay for it.  I'm getting the testing paid for through the edw because i don't have ins.  I'm not comfortable with someone saying it probably isn't anything bad.  Hang in there-odds are you will be just fine and will have a baseline of several tests to compare to should anything further arise.",
      "MessageIndex": 6,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/761126",
      "Title": "Terrified of MRI results drewmom apple"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 1, 2011 05:45PM meme31 wrote: Thank you Indianamom.  I think i needed that!  I go see my midwife in a couple of weeks to see what she thinks about the lump the surgeon couldn't see on US and thinks is just breast tissue.  I'm way more comfortable with my midwife and i think she will help me come up with another plan to see a different surgeon.  I don't have insurance so it's tricky.  I'm also going to call next week to see if the Early Detection Works will let me switch faciltities and try a new doc.  Good luck with the kiddos, i have 4 so i understand.  Thanx again, and keep us informed how your appt. goes.",
      "MessageIndex": 1,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775792",
      "Title": "Update... IndianaMomOf3 IndianaMomOf3"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 4, 2011 09:32AM meme31 wrote: I visited Wichita and Hutchison this summer with three of my kids and my two nephews.  I'm about an hour from downtown KC. Lavendar-I agree it seems a lot of us are having this problem.  I was so hoping at my intial US and follow up ones it would show a cyst, but nothing shows.  So does that mean nothing to worry about just breast tissue even though it feels different. Or there is an issue and  we can't see it-unfortunately a bx would prove which.",
      "MessageIndex": 20,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772561",
      "Title": "Back again..... Biopsy Trabby Trabby"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 4, 2011 08:35AM meme31 wrote: So you are only a yr older than me.  And yes they can do a mammo on you but it may not show a lot due to dense breasts.  And i don't believe it matters what side of the family its on.  Sounds like outdated info maybe.  Maybe you could ask them to biopsy the lump when they do the node-hmmm, you never know they could say yes.  I agree with the carrying around quietly.  I think it's funny they talk about early detection and when we find a lump if they can't see it they don't biopsy it.  There are places that have a rule of bx any lump but it doesn't sound like you or i are at those places.  What part of the country are you in? Or are you in the country?",
      "MessageIndex": 9,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772561",
      "Title": "Back again..... Biopsy Trabby Trabby"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 1, 2011 08:49PM meme31 wrote: I would guess they might want an excisional bx to remove the area instead of just a bx.  If they were that sure then they want to make sure the pathology is correct.  So that's good news  but they will probably not be done and might turn out the way they expected or not.  Good luck",
      "MessageIndex": 2,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774077",
      "Title": "What Happens Now? ksfarmwife mawhinney"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 24, 2011 10:31AM meme31 wrote: I've read about other women on here having bloody discharge after a bx.  So you should call anyway but i think it might be normal. ",
      "MessageIndex": 57,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776099",
      "Title": "Should I Be Worried Lme002 Lme002"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "meme31 wrote: Some of you may know of me, i've been on here a while.  I'm sorry for bothering you again.  My mammo and us came back birad 1.  I feel much better now and just want to move on.  I spoke to the radiologist and asked him my breast density rating.  He said not dense, just average.  That's good news and again makes me feel better.  He said my left breast is more glandular then the right.  And the right is the one with the problems.  So i want to be done and forget about all this but the stupid lump, not 3dimensional according to my midwife, appears to be getting bigger, maybe i'm wrong.  And the ridge, i would describe now as a blob moving out along my breast is definitely getting bigger.  By blob i mean it reminds me of the blob from the movie the Blob.  Or if you will when you look at the radar for the storm moving in and it's spread out and rounding around the edges, the edges are bouncy too.  So the radiologist said there is nothing he can see and it's probably fibroglandular changes.  But i could talk to my doc if i wanted and get an appt. with a bs.  I don't have ins. I can't go through the early detection works again,i'm 32, and it got screwed up last time i did.  So i guess my question is, is it normal to have these changes and can a NOT dense breast, just average, have missed tumors on imaging? I'm hoping it is cyclic more and it will shrink.  Although its been there a couple months now.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778087",
      "Title": "I just want to be done meme31 leaf"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 4, 2011 09:06AM meme31 wrote: Thats funny,i'm in Ottawa.  And you-Marion-not sure where that is.",
      "MessageIndex": 17,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772561",
      "Title": "Back again..... Biopsy Trabby Trabby"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 4, 2011 07:50AM meme31 wrote: Tabby, i'm sorry you are dealing with this crap still.  Are you young?I also have a lump for nearly a yr now and can't see it on US or mammo.  I think my age plays a part in not being more proactive.  So maybe you are experiencing it also.  Mine is soft too so the BS thinks it's not suspicious but it's growing bigger and flatter-i posted this too on a post.  And don't feel bad, for some reason some my posts don't get a lot of answers and your's don't seem to be either.  I know you are scared and i am too, as all of us on here are.  But it's probably good they are taking some action.  It's kind of weird but they know what they are doing-i suppose, i've been wondering that for the past year.  I've not been talking to my husband about any of this because it makes him nervous so i look here for support and when you feel like many don't answer, maybe many don't care.  But i don't think that's the case.  These women are in treatment for cancer  and i think they are just busy and don't take the time to respond but i'm sure lots more read than post.   ",
      "MessageIndex": 7,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772561",
      "Title": "Back again..... Biopsy Trabby Trabby"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 4, 2011 08:54AM meme31 wrote: Hey more traffic for ya!  I'm in the USA -kansas.  I agree with Sheila it's odd they won't do a mammo but again you are younger so dense breasts and not able to see as much because of it.  Good luck Sheila-we are all terrified. ",
      "MessageIndex": 14,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772561",
      "Title": "Back again..... Biopsy Trabby Trabby"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 14, 2011 07:40AM meme31 wrote: bump",
      "MessageIndex": 1,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/778039",
      "Title": "Grade 3 - what should I know? QuinnCat QuinnCat"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 11, 2011 10:18AM meme31 wrote: of course you are worried but an MRI is a great idea.  It can give a picture of everything in there.  There are more false positive results from it but i would rather have  that then a false negative.  Good luck, is it scheduled yet?",
      "MessageIndex": 1,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776299",
      "Title": "Please help Dottysgirl marjie"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Feb 2, 2011 08:09AM meme31 wrote: An MRI is a good idea.  A lot of things that dont show up on the other tests will show up on that one. ",
      "MessageIndex": 1,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764293",
      "Title": "Second Opinion SueI12345 SarahsMom"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 29, 2011 10:48AM meme31 wrote: I know how you feel.  I haven't even had a bx yet but the bs office called this morning to confirm my 6 month appt. for Friday-but my immediate thought was-why are they calling, do they want me to come in early-nope just Friday still-guess they just call early.  Hang in there-I'll pray for b9 results for you!  And my goodness, you must be on the east coast.  What a week!",
      "MessageIndex": 2,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773882",
      "Title": "I survived apaige JanetM"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Feb 24, 2011 11:20AM meme31 wrote: Hang in there honey, sounds like you are very scared and you still don't know what is wrong so don't assume it's cancer even though we typically go towards the worst outcome when we are dealing with the unknown.  A breast surgeon is the correct person to see so that is not unusual.  Bumping up for others to see.",
      "MessageIndex": 1,
      "PostDate": "24/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765361",
      "Title": "biopsy 3/1..what questions to ask? teesa2you Shrek4"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 12, 2011 11:22PM meme31 wrote: Sorry you haven't had any replies yet.  I don't have cancer(at least that i know of) but if you go to the ILC board you might find some useful info.  And if it's diagnostic testing you shouldn't have to wait for the results i thought. ",
      "MessageIndex": 1,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773074",
      "Title": "Breast shrinkage & discharge Kim137 Moderators"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 13, 2011 09:57PM meme31 wrote: bump for someone with more info for you!",
      "MessageIndex": 1,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776443",
      "Title": "Question for anyone, please help. Cnebae48 TifJ"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 24, 2011 02:38PM meme31 wrote: Good you are having it out.  It's pretty bad when the professionals can't spell-lol.  So did they just decide because of the features from the US that it should come out instead of just bx.  I wonder what makes them decide to do that instead of a needle bx.  You must be excited to get it out of there and find out what's going on for sure.  I go on that same day for a checkup also.  Glad you are keeping busy.",
      "MessageIndex": 3,
      "PostDate": "24/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/773592",
      "Title": "Hello again! Update... Zombean80 Zombean80"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jan 6, 2011 07:08PM - edited Jan 6, 2011 07:13PM by meme31 I've noticed a post from warriorprincess on a few threads and for some reason only one person or two have even acknowleged her.  I think i will send her a message and ask her to try again.  I can't imagine how lonely she feels coming here for support and noone even seeming to notice her.  I hope she gets more notice this time so please don't think im picking on anyone in particular and i choose this thread because it seems most prudent right now, but it would be nice for her to feel like she matters.",
      "MessageIndex": 147,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Feb 27, 2011 10:18AM meme31 wrote: Good luck on Tues. let us know how it goes.  Thanx for letting us know how it went.",
      "MessageIndex": 7,
      "PostDate": "27/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/765166",
      "Title": "MRI next week kikiwiki ShanYao"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Mar 1, 2011 10:03PM meme31 wrote: Good for you getting to the bs tomorrow. Please keep us posted!! ",
      "MessageIndex": 10,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/765166",
      "Title": "MRI next week kikiwiki ShanYao"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 22, 2011 03:09PM meme31 wrote: bumping up for more info.  I would seek a second opinion.",
      "MessageIndex": 12,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774147",
      "Title": "awaiting surgery vamom vmudrow"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 11, 2011 01:15AM meme31 wrote: I'm trying again to post to you.  I agree completely about the early detection and not practicing what they are preaching.  I have asthma so i use a puffer, hopefully it works for you but def. keep that appt anyway.  My husband is a smoker too, he goes outside as well, that's good for the kiddos.  I quit smoking 11 yrs ago and only smoked for about 8 yrs. so i know it's hard and imagine the longer you keep the habit the harder to quit.  So i understand all that and the frustration of being told to check every lump and when it's not showing up it's fine.  But there are many on here and many doc. who believe the lump should be bx no matter what.  Did you try calling your dr. back and explaining what happend with the radiologist.  Instead of waiting till next week.  Unfortunately the squeeky wheel gets the oil.  So even though you went over there maybe a phone call would help too. I would think if he ordered it and it didn't get done he may want you to try somewhere else.  Hang in there!",
      "MessageIndex": 11,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772827",
      "Title": "Biopsy cancelled Trabby meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 25, 2011 01:42PM meme31 wrote: You might want to post something under the IBC forum and ask a few questions.  I hope you feel better soon!",
      "MessageIndex": 16,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776919",
      "Title": "***Problem with the same breast, should I be worried*** positivethoughts positivethoughts"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 10, 2011 04:38AM meme31 wrote: I can relate.  I barely talk to anyone about me.  Mine wasn't seen or us so it makes feel kinda dumb for wanting it bx but i really can't get over it.  My sister and that's it.  Not even my husband do i talk to, it makes him nervous i think.  He never even asked how my last appt went six months ago.  So i understand but at least your doc is understanding and looking at it as two seperate issues.  Hopefully it's nothing but there have certainly been issues where the cyst went away and the tumor was under it.  So please remember we are here and you are not alone. ",
      "MessageIndex": 2,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772882",
      "Title": "Ever been treated like you've \"Cried Wolf\"? :( Rushell Lavender250"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 14, 2011 09:22AM meme31 wrote: Stress can make it late or not at all. ",
      "MessageIndex": 37,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774560",
      "Title": "Question slgarcia05 leaf"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 9, 2011 12:35PM meme31 wrote: the early detection works does not have to do with your income.  If i had no insurance and they sent me to a clinic to make sure i actually had a lump because of my age it itsn't just covered each year.  So because i had no ins., and did actually have a lump they are covering my tests and doc. appts. There should be a place to pay for your tests regardless of income.  You need to google and find ones for your state. ",
      "MessageIndex": 27,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772505",
      "Title": "New lump, here we go again Lavender250 Linda-n3"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 12, 2011 04:42PM meme31 wrote: It is a good sign they didn't see it.  Even though some docs think all lumps should be bx.  You have convinced yourself of something you have no proof of.  Take the ativan and STAY OFF THE COMPUTER, including this site.  IT just makes you feel you are doomed.  TAKE A BREAK!!  You are not dying of cancer right now and maybe never will.  You could die of a ridiculous blood clot or stroke or car accident any time.  Any number of completely random things could happen.  If you don't have a belief in Christ then maybe it's time to try it out.  A church you could visit, the lord is with you always and no matter what happens he will be.  Put your faith in him and you will find some peace.  I will say more prayers for you.  Maybe wait for your ins. to kick in and get the appt. with the bs so you can get some answers.  But for now please quit dx yourself and let the professionals do their job as best they can.  ",
      "MessageIndex": 44,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772505",
      "Title": "New lump, here we go again Lavender250 Linda-n3"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jul 20, 2011 04:42PM meme31 wrote: bump",
      "MessageIndex": 1,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771902",
      "Title": "New to this site - any advise would be greatly appreciated lznc Moderators"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Dec 1, 2010 01:40PM meme31 wrote: ya for you getting some answers on the way-good luck!  Good job getting it done-what a pain in the butt it's been for you.",
      "MessageIndex": 32,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/759013",
      "Title": "abnormal mammogram jp63 jp63"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 10, 2011 12:38PM meme31 wrote: Thank you ladies.  Yes i've been here a while now and i'm hoping my midwife can give me some advice on where and how to go.  I am using the Early detection works right now to pay for things but need to find out if they can switch me to a different facilitly.  I had tried before just before March and the lady was a bit@# to me and refused to switch me.  She never said she couldn't just kept saying lets just finish here and see how it goes.  I think there is a new lady now and i just need to call.  I haven't because i haven't wanted to seem  more difficult.  It's funny how encouraging i can be to my family and people on here but if it's about me i don't want to bother people and have a hard time advocating for myself.   None of this is screening because i'm 32.  I've also spoken with a breast imaging specialist on here through pms a few times.  She told me like i suspected that an US is not a perfect tool and is many times wrong unfortunately.  I'm due for a mammo in this month but the surgeon didn't order one.  Another reason i didn't care for her.  I guess if i called and asked her she might.  I just don't want to deal with her.  I'm going to call the program now and see if they can switch me.  Jenni-how would you describe your ridge?  I wondered if the direction meant anything.  I hope others may share how their lump or ridge was going. ",
      "MessageIndex": 3,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 10, 2011 02:05PM meme31 wrote: Thank you Kimmer!",
      "MessageIndex": 10,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 11, 2011 01:07PM meme31 wrote: Thank goodness my monthly bleeding is normal.  Wow depends is definitely a sign you needed something done.  Glad you did.  And i believe in sharing so not too much info, heck i'm still waiting on the balls quote you have;)",
      "MessageIndex": 16,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "meme31 wrote: So i've realized that my right boob gets really bumpy, not my left.  Does that matter?  I've been on here for nearly a year now so you can see old posts if necessary.  But the one lump that i think is big and hard, the gen. surgeon didn't see with us and felt it was only glandular tissue.  I disagree it hasn't gone away and i will see my midwife on Wed.  to see what she thinks.  Either way i am comfortable with her and will tell her my anxiety. Hopefully it goes away after my period. I don't start my period for probably another week and a half to two weeks and about a week ago i noticed a ridge if you will, of lumps a few centimeters away from the big lump.  It goes up and down next to my areola not in towards the nipple. It feels like a bigger one at the top and several(maybe four)littler ones strung down from it.  I think they are all connected but could be wrong.  It is very weird.  Maybe 3 or 4 cent. long. The only description i can think it compares to would be to run your hand along some gravel in the driveway.  No pain, breasts not sore.  I can almost always squeeze discharge out of that nipple.  Not the other one though-sometimes.  Any one else have this or ideas to it?  And i've wondered for a while now does it matter if you can feel a lump and it not just round, what direction it goes?  You know not just from the out in towards the nipple.  Obviously a round one doesn't actually go in a direction but a long one can.  I've also read a couple places lately that if you feel a lump and it turns out cancer than it's less likely to be an early stage-is that true or make any sense?  Thanx ladies for reading this!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 12, 2011 09:33PM meme31 wrote: Kelly, i'm not sure how to tell for you.  If it was round it wouldn't really go in any direction.  But the breast tissue i believe starts on the outer part of the breast and comes inward toward the nipple like a cone i guess.  So if it went along it or turned vertical that was what i was meaning.  Sherri, thanx for the info.  I think that's something so confusing about breast cancer.  Certain types aren't easily detected and add dense breast into that and more questions.  I imagine a thickening would not feel bumpy huh?  Just more like a piece of rubber maybe.  I don't think so though. I am lumpy bumpy anyway especially upper outer and don't know if i would ever notice a difference up there.  The ridge sort of goes from the upper outer to the lower outer just next to the areola, vertical.  I will see if it's still there after my period next week and make my appt. for after that week either way to check out the single lump, also lower outer-8-9oclock.  Doesn't feel 3d she said.  I heard someone else say that here a few weeks ago.  Not sure why that matters or exactly what that means. ",
      "MessageIndex": 23,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 17, 2011 10:41PM meme31 wrote: You're right Kimmer, cancer doesn't google or discriminate.  Kennessee, you should ask for a definite dx.  I agree there is no reason for a probably.  You are not too young and maybe you need a new opinion.",
      "MessageIndex": 26,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 10, 2011 12:45PM meme31 wrote: ok, i grew some balls and called.  They didnt answer so i left a message.  It will probably be tomorrow since today is a holiday.  I'm so glad there are so many wonderful women on here who are so insightful and supportive. ",
      "MessageIndex": 4,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 10, 2011 02:01PM - edited Oct 10, 2011 02:04PM by meme31 Yes they are moderately dense.  I believe it's a 3 of four.  But i'm younger so that is to be expected.  Thank you for the links i will look at those.  Wanted to add Jenni-vertical is the word i was looking for to describe the ridge.  So thanx!",
      "MessageIndex": 8,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 10, 2011 09:33PM meme31 wrote:",
      "MessageIndex": 14,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 18, 2011 02:18AM meme31 wrote: bump",
      "MessageIndex": 44,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/695857",
      "Title": "WHAT did YOUR lump FEEL like? gscott MomOfTeenGirl01"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 31, 2011 01:35AM meme31 wrote: I can't see the pictures, don't know if it's just my computer or not!  But sounds cool anyway:)",
      "MessageIndex": 1,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773909",
      "Title": "my sister Rocks! vanlex vanlex"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jan 7, 2011 10:03AM meme31 wrote: Good, it seems a 6 month check should be useful.",
      "MessageIndex": 10,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762717",
      "Title": "Not sure if this is serious or not? Lynn97 Sherryc"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 4, 2011 01:43PM meme31 wrote: You don't sound paranoid.  Why is it we are difficult or paranoid when we aren't satisified with little to no information.  I mean scientists want to know about all that's going on about what they are studying .  I struggle with the same situation though.  Yes get your records and see the another doc.  And if it wasn't a core needle bx you may want one for more accurate results.  Don't feel bad but i have to tell myself the same thing right now.  Good luck!",
      "MessageIndex": 1,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775927",
      "Title": "Worried even though I shouldn't be? Se82 Se82"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Mar 22, 2011 04:59PM meme31 wrote: bump",
      "MessageIndex": 1,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766475",
      "Title": "I'm sorry to bother you all, but this has been worrying me! Napaoctober irish22"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Feb 28, 2011 09:45AM meme31 wrote: weesee, it's great to see your pretty face and love the hair.  I hope you get some answers this week and a biopsy.  I agree take the tylenol and the shots might not be a great idea either-it also thins your blood and don't want to drive that way, but a logical idea if you were at home and in pain-hehe!",
      "MessageIndex": 8,
      "PostDate": "28/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765529",
      "Title": "breasts are killing me now! How do i prepare for mammogram pain? WeeSee mrsnjband"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 10, 2011 01:29PM meme31 wrote: Kimmer please share the balls quote.  I love some good humor!  And i have to see my midwife anyway for my checkup.  I can't miss those because 5 yrs. ago i had surgery to remove high grade precancerous cells in my cervix.  That really was no fun.  And where did you read about the breast conditions following the breast tissue?  And cyclic wise i think both breasts tend to get a little swollen and lumpy.  It just seems that not cyclic in the past few months my right breast is quite lumpy as i've shared and the other one not.  If this doesn't go away after my period then i will have to see someone if i don't already have an appt. too.  I need to get an appt. though for the other lump that has been there for 2 months now anyway so it seems i just need to get it set up if they will let me switch to see wha't going on. ",
      "MessageIndex": 6,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 10, 2011 02:55PM meme31 wrote: i thank God only had one leep procedure to remove mine.  I was awake though i felt pain.  Unfortunately i bled for about 45 min. afterward and had to lay there through fixing it and and all that went with it.  I didn't need to be given blood though.  The doc went out and got my husband and opened up her jacket and said see all this blood, it's your wifes.  Not very professional and it bothered him.  I bled after having my second child too.  Didn't need blood then either but again i had no pain meds or epidural and sat there for nearly an hour while she had one hand in me squeezing and the other on top pushing, or the other nurses were pushing they took turns, and giving me shots to finally get it stopped.  He was a month early too, thank God for that as well, his umbilical cord was tied in a complete knot.  She said she had only seen one other like that in five years. If he had stayed in i hate to think what could have happened. So med. wise i'm not exactly common and that's why i know shit can happen to anyone.  Wow you had to have a whole hysto. to get rid of yours, i'm sure all that was not a great time for you. I have 4 kids. Ya to you getting 3 around all that mess;) I will try to keep my balls close-thanx again! BTW, i love the ocean and all that's in it-so love your name and pic.",
      "MessageIndex": 12,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 12, 2011 03:25PM meme31 wrote: Hey ladies, i did go to see my midwife today.  She is fantastic, i just love her.  She felt and said it feels glandular to her too, not 3d.  She listened though and agrees i should have a diag. mammo and US.  So she gave me the order and i can just call around to places to find the cheapest one.  I'm also going to call back the Early detection works since they didn't return my message.  Kennessee, i do think because of our younger age they are less likely to believe us or do all the testing.  I do know that it's much less likely to be cancer because of the young age.  But i don't like the guessing of the unknown.  I do feel better that i'm getting a plan and will have a few more tests at a different facility though.  I have a terrible time standing up for myself.  Good for you asking for the bx.  Thanx for your input.  My lumps are in the lower outer quadrant and up into the upper.  And the single lump i have is in the lower outer quadrant.  Kimmer, thanx for checking in on me, i really appreciate that!  I think i might start a new thread asking how many women have been told there lump is glandular tissue and came out ok or not.  What do you guys think?",
      "MessageIndex": 21,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776217",
      "Title": "Ridge of bumps meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 10, 2011 12:48PM meme31 wrote: How did it go today?",
      "MessageIndex": 8,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772827",
      "Title": "Biopsy cancelled Trabby meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 28, 2010 12:16PM meme31 wrote: kira1234-honestly i can't remember if i told her that or not-i think i did?  So the size does or not matter much?",
      "MessageIndex": 13,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759704",
      "Title": "31 and mamo was negative but i have a lump meme31 kira1234"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jan 6, 2011 08:24PM meme31 wrote: bump up for others who might have some info. for you.",
      "MessageIndex": 2,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762990",
      "Title": "Indentation on Breast SueI12345 aldumont01"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 23, 2011 11:46PM meme31 wrote: bump for more info for you.",
      "MessageIndex": 1,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776914",
      "Title": "worried and scared...once again. scaredmommyof6 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 31, 2011 03:07PM meme31 wrote: Anewsong, we are all there with you.  I'm only 32 and i go on Friday as well.  So do a couple other ladies on here-busy day i guess.  Mine is hard and long and i think it has gotten slightly bigger since i found it a few weeks ago.  I'm going for a different lump that's not suspicious though and i've had for a year now, this was supposed to be my last appt.  So i have a new one to show her-lucky me.  Actually i have two new ones, the last one just popped up a few days ago and is about a centimeter away from this big one and it feels skinny like a grain of rice and long.  Maybe an inch long. Isn't that strange.  Doesn't feel like the ropeyness of my boob or the lobules just skinny and long.  I guess if nothing shows up on US than they are just breast tissue but they feel distinctly different to me.     Honestly i will be surprised if they don't show up and i have a feeling she might want a bx this time because of the new ones.  But if they don't i will try to rest easy that it is fine and God is watching out for me.  Having said that i'm starting to get scared for the appt.  But i do feel prepared either way!  And it sux waiting but not too much longer now!",
      "MessageIndex": 14,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773652",
      "Title": "What is that? ANewSong SarahsMom"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Feb 12, 2011 06:49PM meme31 wrote: bump",
      "MessageIndex": 1,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/764779",
      "Title": "painful knot under arm marticcrn Laurie09"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "meme31 wrote: From what i understand malignant breast masses are most commonly found in the upper outer quadrant.  So i was wondering what exactly that meant.  One-is it most common for all breast lumps, malignant and b9 to be in that quadrant?  Two-if so than does it make it about equal if lumps are in any quadrant?  Three-if not then which is greater for malignant ones and which for b9? Four- If our lump is in a less common quadrant then would it be less likely to be malignant or more likely because most lumps either way are in the upper outer quadrant.  I hope this doesn't confuse you-i was just wondering what  you ladies thought about this and your particular situations with it.  Seems interesting to me.  The one i'm scared about that actually feels suspicious to me is in the lower outer quadrant about 8 oclock. Thank you!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773874",
      "Title": "I wonder if it matters which quadrant? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 29, 2011 12:03PM meme31 wrote: wow that's interesting.  I wonder why it would matter which quad. for possibility of mets and long term survival.  I had no idea that it could matter. ",
      "MessageIndex": 12,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773874",
      "Title": "I wonder if it matters which quadrant? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 29, 2011 12:23PM meme31 wrote: Well, that makes sense. ",
      "MessageIndex": 14,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773874",
      "Title": "I wonder if it matters which quadrant? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 4, 2011 12:47PM meme31 wrote: Lavendar, i don't know where you are located but i don't have ins. either and i was able to get my tests and doc appt. for my lump paid for throught the early detection works.  You need to look up for you state if you are in the states and see what programs they have to pay for this for you.  Maybe a sooner appt could be had also.  Don't put the horse before the cart or something like that-all this could be b9 and you won't have to worry after that.  An antianxiety med helps you feel less anxious about your situations and maybe some over the counter sleep meds, melotonin is good i've heard, if you are having trouble sleeping.  Good luck!",
      "MessageIndex": 15,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772505",
      "Title": "New lump, here we go again Lavender250 Linda-n3"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 9, 2011 12:21PM meme31 wrote: if you don't take allergy meds you may want to try a few to see if it helps with the throat tickle and mucos.  I take Allegra-over the counter now-if you buy it at Costco you can get the off brand for even cheaper and it works wonderful.  I don't have ins. either and i can afford it-you may try it and see if it fixes that problem.  Maybe melotonin for sleeping, again over the counter natural remedy. ",
      "MessageIndex": 25,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772505",
      "Title": "New lump, here we go again Lavender250 Linda-n3"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 9, 2011 06:45PM meme31 wrote: if you caused your cancer then how did perfectly healthy people who never ate something bad or smoked or drank, did everything by the book, end up with cancer.  If we knew what and why we get things like this then we would have a lot less sick people.  Lots of people with sicknesses did absolutely nothing to deserve it.  So when we are just normal and live life and enjoy ourselves or don't get to the doc. enough, it doesn't mean you caused your illness, which has yet to be determined you have.  If you or i have cancer than it is what it is and no amount of regret or wishful thinking or even praying will make it be gone and never have been there in the first place.  Deal with it if you have to and right now enjoy as much as you possibly can.  Hang in there!",
      "MessageIndex": 30,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772505",
      "Title": "New lump, here we go again Lavender250 Linda-n3"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 14, 2011 12:41PM meme31 wrote: I think Friday Slgarcia goes in for the bx not yet results.  Hoping both of you get b9 results!",
      "MessageIndex": 47,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774560",
      "Title": "Question slgarcia05 leaf"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 3, 2011 12:40PM meme31 wrote: I'm sorry for your diagnosis.  I have no info for you but thought i would bump this up for others who may.",
      "MessageIndex": 1,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772601",
      "Title": "INVASIVE MAMMARY CARCINOMA W/ LABULARY rose1523 rose1523"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 15, 2011 11:18PM meme31 wrote: I think some discharge especially if it's not bloody is somewhat normal. I can squeeze some out,  Not the left one very often but the right one almost always, which also is the one i have lumps in.  It's that color also but not really sticky for me.  It can be a sign of something wrong if it's spontaneous.  I had a couple leaking issues but the BS wasn't concerned unless it happened more. ",
      "MessageIndex": 1,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773188",
      "Title": "BIRADS 3, and now nipple discharge.. HillD11 VSM"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 11, 2011 12:11AM meme31 wrote: You need to try to relax honey, i know it's scary.  But it would suck even more if you didn't get an US and find out hopefully whats going on.  Of course the computer will tell you the worst of any situation.  Try and stay off the searches.  When do you go, Friday?  You don't know what it is till the proper tests are run, no matter how it feels.  If you have cancer then finding it now is much better than finding it at stage 4.  No matter what, i think it could be a good idea to ask the doc for some anti anxiety meds.  I'll pray for you to get some rest and much needed peace and to get b9 results. ",
      "MessageIndex": 3,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772941",
      "Title": "Walnut size? Rough cyst? Lavender250 marie5890"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Feb 2, 2011 11:38AM meme31 wrote: Good luck ladies, i'm praying for b9 results for both of you.",
      "MessageIndex": 8,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/764272",
      "Title": "Waiting on Biopsy results anitaph anitaph"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 29, 2011 09:21AM meme31 wrote: So i may not understand this but i think it says that just because we have lots of lumpy tissue in that quadrant doesn't make it more likely to get the cancer there.  And if we could figure out why it is more common there then we would be on the right track to finding why we get bc.  But as to b9 lumps being in certain quad. we don't know because at least this particular study isn't talking about it.  Are most lumps in that quad. anyway or do other area's get as many and are just less likely to be cancer?  Or is a lump in the other quads. less likely  to be b9?  Hmmm,  Thanx for the study!",
      "MessageIndex": 2,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773874",
      "Title": "I wonder if it matters which quadrant? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 29, 2011 11:39AM meme31 wrote: I definitely have lumpy bumpy.  Thenewme, i clicked on the link and it said page not found.  Could you tell me a different way to get there.  I also found the which quad. thread.  Although it doesn't contain any info about b9 lumps for obvious reasons.  Srbreastcancersurviv-weird that both were the same size.  Small is good i guess.  The one i have doesn't feel so small-4.5 cent. as far as i can measure.  Actually i ended my period a couple of days ago so feel for any new lumps.  There is one right next to this one now, feels thin and long-like a large grain of rice.  The large one is wider at the top and kinda tapers down but still quite long.   ",
      "MessageIndex": 9,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773874",
      "Title": "I wonder if it matters which quadrant? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 29, 2011 11:40AM meme31 wrote: Just saw the edit-Thanx!",
      "MessageIndex": 10,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773874",
      "Title": "I wonder if it matters which quadrant? meme31 meme31"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 16, 2011 01:58PM meme31 wrote: bump for someone with more info.  Hang in there!",
      "MessageIndex": 1,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774976",
      "Title": "Happy Bubble Popped: Blood in Nipple Discharge IndianaMomOf3 lwarstler"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 17, 2011 03:44PM meme31 wrote: That is soo weird, what a strange feeling, you don't have implants i assume.  I agree watch and make sure you don't get sick but if you feel fine then hopefully all is fine. ",
      "MessageIndex": 4,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773277",
      "Title": "Ruptured cyst?? jessjoy MTwoman"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 14, 2011 01:09AM meme31 wrote: Well said Lavendar!!  And sometimes we need some tough love.  The anxiety meds will take some time to take effect i would imagine.  I also agree that your instinct is important to trust.  But there are certainly those out there who create their own sicknesses in their head and they are fine in reality.  So you are doing the right things with the meds and doctor appts.  I'm not immune from the worries of life obviously or i wouldn't be here still.  My appt. is in a few weeks so i hope after that i will have all my eggs in one basket and feel satisfied.  I don't have high anxiety normally so this feeling i have and can't shake is why it worries me most.  I have no other explantation than God is trying to tell me something and we need to find what's wrong.  But i will feel more satisfied after this last appt. i think whether she does a bx or not, i'm reminding myself if it is Gods will than so be it. ",
      "MessageIndex": 54,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772505",
      "Title": "New lump, here we go again Lavender250 Linda-n3"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 9, 2011 07:56PM meme31 wrote: YAY!!!!!!!!!!",
      "MessageIndex": 8,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/772785",
      "Title": "conflicted 4minniemousegirl 4minniemousegirl"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 19, 2011 09:36PM meme31 wrote: bump",
      "MessageIndex": 1,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773372",
      "Title": "Should i go to a breast specialist? seemz seemz"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 1, 2010 12:30PM meme31 wrote: You look great!  Love the handy work;)",
      "MessageIndex": 2,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/760148",
      "Title": "my Halloween costume choice. mtndawn Maya2"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 9, 2011 11:45AM meme31 wrote: I'm pretty sure if you are producing something when you cough then it's not cancer.  It's a consistent dry cough that can be a symptom of cancer.  You need to calm down if possible and wait till you have a dx and go from there.  None of us know what is wrong without the proper dx, so please try to not make it worse for you.  Chances are you are fine and if you do get dx with bc then you can get moving and be treated.  Be thankful you don't have the aggressive cancer your mom did because that would certainly be a worse situation for you.",
      "MessageIndex": 21,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772505",
      "Title": "New lump, here we go again Lavender250 Linda-n3"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "meme31 wrote: My ob found a lump several weeks ago and told me to watch it.  It didn't go away so i got ahold of a company that pays for a clinical breast exam and radiology and biopsy.  So i had a mamo today and they said i had dense breasts-i'm 31,so took a couple more pics then the radiologist said it all looked normal.  I know at my age i think i should have an ultrasound but i'm not sure.  I have no family history and i'm young so should i be worried and ask for an ultrasound.  I don't even know if the doc will call me back and talk about the mamo results.  There is a lump there so how do you not find anything?  How can you say i have dense breasts and then say everything is fine if you can't see in there? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759704",
      "Title": "31 and mamo was negative but i have a lump meme31 kira1234"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 25, 2010 11:57AM meme31 wrote: The doc called this morning and left a message saying they looked at the results of the mamo and the lump was benign-so can they tell on the mamo if it's benign and that must mean they see it-i guess.  Should i still call and request an ultrasound?",
      "MessageIndex": 3,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759704",
      "Title": "31 and mamo was negative but i have a lump meme31 kira1234"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 28, 2010 10:43AM - edited Oct 28, 2010 10:49AM by meme31 momof2-thanx for the info, i hope they will see it on ultrasound and decide if it's a mass to biopsy it.  I feel silly making so much out of a little lump-not much bigger than  a pea.  I keep feeling to see if it's still there and it was my doc who found it and i had to show the other doc where it was but she did feel it.  I have to keep reminding myself it's my body and i shouldn't take their word on anything until they have proof.  I wish i could recieve the mammo report in the mail-hopefully tomorrow i will get it and read it for myself.  Anyway only another week to wait till the US and i should know more then.  I'm waiting and not worrying too much, it just seems the longer it takes to get everything checked the more concerned i grow-i'm sure over nothing-that's why i feel silly.  How did you find yours?  And did they finally find it in the US?  Did you have any symptoms?  If they wont biopsy it i suppose i will go ahead and post now on a different forum for some advice where to do it? Then i will be ready with some info.  I'm in KS-franklin co.-close to lawrence that's where i've been going.  Thank you so much, what a terrible thing to bring wonderful supportive women together.  But you all inspire me so much and help remind me it's probably nothing but need to be sure:)",
      "MessageIndex": 11,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759704",
      "Title": "31 and mamo was negative but i have a lump meme31 kira1234"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 25, 2010 02:06PM meme31 wrote: Thanx for the advice-i'm sure i'm fine but i wont feel comfortable until i have taken all precautions.  I called and they are going to schedule an ultrasound and don't know if they will allow the biopsy to be covered so we'll see what the ultrasound shows i guess.  If they won't cover the biopsy does anyone have an idea of the prices of that?  Thank you again for the help-it makes me feel more able to call and request more be looked at.  She said it's normal to have thickening after children in some spots and it looks binign but they should cover the cost of the ultrasound because it might be considered suspicious-since i want to have other tests-glad i called.",
      "MessageIndex": 7,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759704",
      "Title": "31 and mamo was negative but i have a lump meme31 kira1234"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 27, 2010 12:39PM - edited Oct 27, 2010 12:43PM by meme31 Well they scheduled an ultrasound for me on Fri. 05,so just over a week away.  If it's a cyst they should see the fluid-is that correct?  It won't pay for draining it but if it's a mass i think they will pay to have it biopsied-i don't have insurance but am getting this paid for through the EDC i believe it's called-early detection center.  If they see it and say it looks ok or if they don't see but i can still feel it should i insist on a biopsy?  It seems like yes, so i hope if it is a mass that i don't have to ask for it but i had to insist on an ultrasound so i should probably expect the same.   What sort of symptoms if any did you ladies have?  I haven't had any other than a lump and earlier this year i had a couple of times my nipple leaked through my clothes.  I've also had a tingling feeling at times in both breasts-i kind of feels like my boobs are getting full of breast milk and needing to be emptied-if that makes any sense to anyone-sorry for the silly description but that is how it felt,just tingling though and not the fullness.  I had my last child over four years ago and didn't breast feed him so definitely not from that but that is the best way i can describe it.  Thanx for listening!!",
      "MessageIndex": 9,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759704",
      "Title": "31 and mamo was negative but i have a lump meme31 kira1234"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jan 6, 2011 04:36AM meme31 wrote: You might want to call and see if you can get an earlier appt. if you explain your worries and also ask to get on the cancellation list. It seems silly to wait and stress for so long over a test that can be done easily i believe. It's worth a try-good luck, hoping for all b9 results for you!",
      "MessageIndex": 4,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762975",
      "Title": "focal asymmetry - new and worried Mom2MissBee marie5890"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jan 8, 2011 03:42AM meme31 wrote: Yea, i am soo glad you don't have to wait long.  I hope that helps a little at least with your worry.  Good luck and keep us posted!",
      "MessageIndex": 9,
      "PostDate": "08/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762975",
      "Title": "focal asymmetry - new and worried Mom2MissBee marie5890"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 14, 2011 12:06AM meme31 wrote: bump for more info for you.  Sorry for your dx.  Good luck!",
      "MessageIndex": 1,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776436",
      "Title": "Totally Confused bojo nanadeb"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 25, 2011 04:47PM meme31 wrote: bump",
      "MessageIndex": 1,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777012",
      "Title": "is this can be a breast cancer huma947 exbrnxgrl"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Oct 4, 2011 09:21AM meme31 wrote: i'm sorry about your dx.  I'm glad it went so quickly for you to not have a terrible wait.  Good luck in your journey.",
      "MessageIndex": 9,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775834",
      "Title": "Hoping for the best is hard... PhunkyM Babsplus5"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 20, 2011 11:11PM meme31 wrote: bump",
      "MessageIndex": 3,
      "PostDate": "20/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773393",
      "Title": "Seeing breast surgeon on Tuesday velvetelvis chickadee521"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 15, 2011 05:39PM meme31 wrote: This is a good place to vent especially when we don't want to bother our family and friends.  Do you have an appt yet?  Not knowing is so hard on us. ",
      "MessageIndex": 3,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773124",
      "Title": "What is this??? jessjoy jessjoy"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Jan 6, 2011 03:55PM meme31 wrote: bump up so others with info can answer you.",
      "MessageIndex": 1,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762982",
      "Title": "Metaplastic breast cancer maryelsa322 girlfrompa"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Aug 16, 2011 08:31PM meme31 wrote: Absolutely!  Luckily it doesn't sound like you will be waiting too long.  I have some more veins on my right breast which is the one with the lump but i don't think it really means anything.  I will go to my last bs appt. in early Sept. so i will possibly get a bx if she feels the lump has grown.  I think it has.  I'm crossing my fingers for you too!",
      "MessageIndex": 5,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773124",
      "Title": "What is this??? jessjoy jessjoy"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Nov 15, 2010 01:48PM meme31 wrote: Waiting is the hardest part, i have no words of wisdom for you other than you are not alone!  Praying for b9 results for you.",
      "MessageIndex": 1,
      "PostDate": "15/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760783",
      "Title": "Biopsy tommorrow, very nervous fulloffaith1220 Lisa1962"
    },
    {
      "AuthorID": "meme31",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111710/profile",
      "Content": "Sep 29, 2011 08:59PM meme31 wrote: I'm so sorry for your dx.  I'm glad you didn't have to wait though.  You can look at the ILC forum and find lots of great info.  You can also post in the just diagnosed forum too.  I'm sure there will be lots of ladies that can help out.  Good luck Claire. ",
      "MessageIndex": 1,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775725",
      "Title": "invasive lobular cancer claireinaz suzieq60"
    }
  ]
}