{
  "AuthorID": "memory",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
  "Posts": [
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Aug 18, 2011 01:08PM memory wrote: I'm so sorry, Cool Breeze. I've been looking for news on your scan, hoping you could move smoothly into surgery.  We also have an old dog, yellow Lab, we're trying to keep going as long as possible. She has tumors on her body, but they don't seem to be hurting her, so we'll keep her going. We're taking our cue from her. I know how hard it is to lose a pet. My beloved cat, 18 years old (I'd had her 17 years), died about three weeks before I was diagnosed. I'd had a horrible year -- husband's health problems -- and so to lose her then seemed so unfair. I imagine that's how it feels to you.  I'll think positive thoughts regarding your meeting with the surgeon.",
      "MessageIndex": 36,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773273",
      "Title": "Today was ...... CoolBreeze nancyh"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Jul 16, 2010 03:35PM memory wrote: Glad you liked it, sweet. I must confess, the first time I read about the life of a 19th century farm woman I wanted to walk around my kitchen and kiss every appliance!  But I hope no one thinks I'm pooh-poohing the difficulties and challenges 21st century women face. I'm not. But sometimes it helps to keep a little perspective; looking back at the past helps with that. And at least as breast cancer survivors we have the benefits of medications, treatments that others didn't have in the past. For instance, did you know that John Adams' daughter, Abby, had breast cancer? The only treatment available to her was very crude surgery -- without anesthesia! The HBO mini-series that ran a few years ago, \"John Adams,\" included some pretty gruesome details about that surgery. I still haven't decided whether I want to rent that DVD and watch it.",
      "MessageIndex": 47,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755096",
      "Title": "Stress and Breast Cancer lukejessesmom texasrose361"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Jul 17, 2010 09:03AM memory wrote: Regarding stress in the :olden days\" v. stress today. If you read enough pioneer diaries you will see plenty of sorrow, tragedy, pain, desperation -- those things make for a very stressful life, imho. then again, human beings have been under stress since the first man and woman walked the earth, haven't they? .  I know we all want a reason why; it'd be nice to know why. But like another poster once said, you can't unring the bell. The only thing we can do is go on from here.",
      "MessageIndex": 56,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755096",
      "Title": "Stress and Breast Cancer lukejessesmom texasrose361"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Jul 15, 2010 08:48AM memory wrote: I  don't want to minimize anyone's troubles, but I suspect that cancer is brought on by many factors, with environmental contaminants playing a large part.  While stress is a tough thing to go through, the average woman in a developed nation actually goes through LESS stress than her ancestors did. A woman living in the 1800s, for example, could expect to see one or more of her children die in infancy. She had to endure crude medical care, and the direction of her life was mostly determined by the men in her family, with a few exceptions. I hate to say this, but it was a little like being a pet: if you had a good master (father/brother/husband), you had a good life. If not, well . . . If a woman wasn't wealthy, she could expect to do hard physical labor for much of her life, either on a family farm or while working for someone else. Women DID work outside the home back then, despite that they tell us. Only back then, most, if not all, worked for pennies. And make no mistake, even if you didn't have to work outside the home, the act of running a household was HARD work, if you didn't have servants. And yes, I know running a home is very hard work today, but think about it: back then, you made all the meals from SCRATCH. You did the laundry BY HAND. You hauled water, you chopped wood. You milked cows. See what I mean? And you usually had to do these tasks even when you were sick; who else would do them?  And if your family fell on hard times, there were few options open to you. No government help, no welfare, no programs.  Have you ever seen those pictures of women settlers who lived in the west? Notice how old they looked? Stress DOES have an impact on the body, certainly; it can age you. But I don't think it's THE cause of cancer, no. For me, the clincher was a study of Holocaust Survivors. They were tracked long-term after they left the camps. I can't imagine a situation more stressful than a concentration camp.  But guess what: their rates of cancer were no higher than that of the general population.  I don't know what causes cancer, but the medical profession really doesn't, either; that's the problem. I have a feeling that environmental changes, contaminants, play a part, but that's just a guess. SOMETHING has to be going on, though: such young women, 20s and 30s, are getting breast cancer.",
      "MessageIndex": 43,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755096",
      "Title": "Stress and Breast Cancer lukejessesmom texasrose361"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Apr 18, 2011 12:31PM memory wrote: I had a BMX because my PS recommended it. The prophylactic side had ADH, microcalcifications, papillomas (sp) and fibroadenomas (sp). On the cancer side, the tumor turned out to be larger than they thought (2.1 inches instead of an inch.) and some Grade 2 DCIS had already started. Even though I tested negative for BRAC 1 and 2, I've been told that I would likely have presented with a new cancer in a few years given that I had already survived one cancer, and because of the conditions in my other breast. That said, every other BC survivor I know underwent lumpectomy and is doing well. This is a decision you will have to make carefully, and as another poster said, only you can make it. I would also undergo a breast MRI if I were you, before making a final decision.",
      "MessageIndex": 19,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/762394",
      "Title": "Atypical Ductal Hyperplasia 2 years following IDC Stage II eeyore2515 bdavis"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Feb 18, 2011 09:56AM memory wrote: Don't mean to frighten you but I was hospitalized about a month after surgery (for an incision infection which doesn't necessarily have to happen to YOU) I was found to be low on potassium and had to be given a bag of it. So Swimangel's suggestion of Gatorade is a great idea.",
      "MessageIndex": 6,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764955",
      "Title": "felt better after surgery, now feel lousy luv2trav memory"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Apr 18, 2011 03:16PM memory wrote:  49, three months shy of my 50th birthday.",
      "MessageIndex": 638,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Oct 11, 2010 11:54AM memory wrote: I'll be a year from diagnosis on Oct. 28. A year from surgery on Dec. 2.",
      "MessageIndex": 74,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Dec 21, 2010 05:53PM memory wrote: Breast cancer is like the Hotel California. You can check out any time you like, but you can never leave.  I know that probably doesn't help much, but you're in a big club, a lot of women feel the way you do. A lot of good suggestions on this thread, especially from Lowrider.",
      "MessageIndex": 21,
      "PostDate": "21/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762264",
      "Title": "4 years later and I'm still Devastated! bluesky Ellie1959"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Mar 23, 2011 05:58PM memory wrote: I am so, so very sorry.",
      "MessageIndex": 42,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Mar 5, 2011 04:57PM - edited Mar 5, 2011 04:58PM by memory My onc switched me to six-month appts. pretty quickly. She says I'm at pretty low risk of recurrence, plus she likes the monitoring I've been getting from my other docs. My new gyn is doing a pretty good job, and so is my PCP. (PCP is an internist who tests the hell out of me; at first it bugs me, then I thought, well, at least he's pretty thorough. And he never blows anything off.) A woman I know with a diagnosis similar to mine says that if all goes well I'll be switched to yearly onc appts., and the day may come when they tell me not to come back in at all. Of course, she's close to eighty, and her onc told her that at this point, the cancer is not really an issue. btw, I agree with what everybody's saying about going to the onc's office: sad and stressful.",
      "MessageIndex": 22,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/765457",
      "Title": "How Many No Longer see their Oncos? Dejaboo memory"
    },
    {
      "AuthorID": "memory",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105163/profile",
      "Content": "Jun 27, 2011 02:19PM memory wrote: I know it involves a whole different cancer, but last year I read a story about a woman who's been living 11 years with Stage IV colon cancer, the cancer having spread to her liver early on. Part of her success seems to be luck -- every treatment they try on her works, at least for a while  -- but she also stays abreast of any new treatments or drugs; I seem to remember she attends a lot of conferences.  My brother's a radiation oncologist, and one thing he explained to me when I was diagnosed is that every patient is different and so every cancer is different. Two people will have identical diagnoses but experience different outcomes; I think we all know that, already. Of course, it was the intro he used to nag me to be a compliant patient and listen to my doctors . . .",
      "MessageIndex": 29,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770838",
      "Title": "In a teeny funk CoolBreeze pejkug3"
    }
  ]
}