{
  "AuthorID": "MeneK",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207903/profile",
  "Posts": [
    {
      "AuthorID": "MeneK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207903/profile",
      "Content": "Nov 15, 2014 01:17PM MeneK wrote: Hi, I am fairly new to posting, but I followed the forums during my treatments. I started radiotherapy 3 weeks ago and had 11 up to now (the device was broken for 3 days last week). But this weekend I feel terrible. I can not lay on my right side (operation side). I started rads just 15 days after surgery and the drain for my axilla was just removed. And now it is reddish and my surgeon tells me that its OK. But I feel otherwise. Anyways I worked through all chemo and had a week off for the surgery and keep working through radiotherapy too. But rads are making me exhausted and I wish Wednesdays are holidays too. 5 weekdays feel too long. Taxol felt a lot easier. Tiredness that comes with rads is making me feel sick, just at the time when everybody told me that the hard part is over. Plus hot flashes aren't sparing much. It nice to find a place to talk this with women who can relate and feel not so alone. Everyone supporting me is very sympathetic to my condition but they rarely understand.",
      "MessageIndex": 86,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "MeneK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207903/profile",
      "Content": "Nov 17, 2014 11:07AM MeneK wrote: Thank you all for your support. Beachlady my session is 8:00 in the morning and waking up at 6:30 is a nuisance. But during the session which takes like 5 min max, I find much useful to think about my daily plan, consider my tasks for the day or what to wear tomorrow. I somehow summarized every position of the device and how long each angle and shoot took and it fells like a countdown and at the final position before the device goes back to original position. The routine becomes relaxing after some point I guess. Interestingly my doc and the techs told me I wouldn't feel anything. But when the device is shooting I feel a tingling and very afraid at the first time. Sharpie stains easily go by washing (my tech uses a board marker size). I was unfortunate enough to wear a white bra the first day. But it cleaned well. I will use Tamoxifen and not started yet buy a bit worried. My doc said I also have use lucrin injections to keep me in menopause, which I hate. Being 29 and all my friends having their periods and do not know how precious that is and still complain about it. And lucrin increases the risk of endometrial cancer and I can not imagine going down for another cancer. I now wish I had kids earlies when I could... ",
      "MessageIndex": 103,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    }
  ]
}