{
  "AuthorID": "MeNeverMind…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
  "Posts": [
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Dec 9, 2009 07:13AM MeNeverMind wrote: First off let me say that I am doing ok. I am just so fricken sick of all this crap that I can't bring myself to even look at the computer. I was just reading throught the last 20 pages since I was here last so let me say... Sex? I totaly don't feel like it. I am bald and backed up and want to puck. Very sexy. Hubby is just going to have to deal with himself. Sounds? Everything gets on my nerves. The tv is always to loude, even hubbys voice can become to much. And if the cat meows again I may just let her outside. Periods? Had 1 right after my 1st treatment, not another. Love that. Dry skin? My face is falling off it is so dry. I scrub and scrub and then put mu foundation on and I an still flacking off. The corners of my mouth craked 3 weeks ago and bleed almost every day. I eat lotion and lip balm but still craked and dry. Now my feet have started to dry and crack. Lucky me. I have always had trouble with dry skin in the winter. If I can have the humidifyer on so high that the windows drip I might make it through the season. But this is so much worse. Wigs? i am so sick of fake hair. I want my real long soft hair back! I never had bangs so it is real hard getting used to having stuff in my face all the time. Christmas? I put up one nontraditional tree and I kicked my butt. i don't even feel like going shopping. I am doing shawls that I found on line for all the ladys since I am always cold I figured it was a good idea. One stop shopping. But I have nothing for the men and I am not sure I care at this point. Food? Is it me or does everything taste like crapy wall paper paste? EVERYTHING is WAY to SPICY!!! Even minuet rice with out salt seems spicy to me. If I wasn't always so hungary I would never eat. Bread is to sharp, soup (even salt free) is to salty. Water tastes like crap (yes, even with a touch of lemon in it) Even chocolate milk to yuckie. Chocolate was my fall back and now that tastes like crap to. Husbands? Don't get me wrong I love mine. He is so sweet. Does all the dishes before coming to bed. The laundry is getting washed and dry, not put aways but who really cares. I know he if feeling left out. I get home from work by 5pm and try to be in bed by 7pm. With making dinner that doesn't leave anytime for anything else. And it seems that the last 2 weekends were mostly me laying in bed and him playing a video game. Not what he wants but he is dealling with it. Tongue? Mine still is raw. Bleeding this morning when I brushed it. My whole mouth is raw. Everything tastes like crap, but I think I said that already. Poopy fairies? Never stoped getting those visits. Thank God for the small stuff. Sleep? Never really had any trouble. Thank God for the small stuff. I feel so much better. Thank you all for letting me vent. In reading I saw that I am not the only whimp in the group. I hope everyone is doing ok. ((((((((((((((((HUGS)))))))))))) to all those who are not doing good. Love Kimmy",
      "MessageIndex": 857,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Jan 20, 2010 01:33PM MeNeverMind wrote: Sorry it has been so long.  My last AC was on the 16th of Dec and I started feeling better within 2 weeks and I just couldn't bring myself to come here and admit that I was sick.  I have left all of my contacts in the lurch by not saying anything.  I was feeling so good that I just couldn't bring my self to talking about being sick so I didn't.  Sorry.  I started Taxol on Jan 8th and have been fine.  Very few, if any side effects.  I am doing weekly  tx for 12 weeks.  I have had 2 so far and my tongue tastes VERY salty and the very very tips of my fingers tingle a bit.  But No other problems.  I am so happy.  I was so scared for the first one that I would be flat on my ass in bed all week and that I would spend the next 12 weeks out of work going crazy at home with my hubby all day.  I am at work and need to get be to it now, but I wanted to make sure that every one knew that I was ok.  I still have pages 38 to 45 to catch up on but I need to do some of my work.  I promise I will write again tomorrow.  Love and Kisses.  (((((((((HUGS)))))))))))) Kimmy ",
      "MessageIndex": 1375,
      "PostDate": "20/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Jan 27, 2010 01:21PM MeNeverMind wrote: Let me just say that I was sitting at my desk at work crying because I am just so fed up with everything.  I am getting collection notices from medical crap that can't seen to bill the insurance properly.  And we are changing insurance here at work so my cost will go from $188 a month to $448.  So I am going to be working to pay the insurance, and i got a very large persuasion talk to drop the insurance here because it will make everyones price go up.  This fucking sucks.  And then I read Melinda's post and a laughed so hard I could almost not breath.  That was great.  Thanks I really needed that.  Not if only I could get the magic bill fairy to come fix this mess I would be perfect.  So I am going to go back to work now.  Talk soon.  Love and ((((HUGS)))) to all.  Kimmy",
      "MessageIndex": 1447,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Jan 30, 2010 04:11PM MeNeverMind wrote: Congrats Michele for being finished.  We will all get there someday soon.  Thank you Alicia.  I thought I was nuts.  I looked in the mirror this morning and there is a hole in my right eyebrow.  I suspected for over a week now that my eyelashes were falling out since so many are ending up in my eye and I was suspicious the my brows were thinning but the doctor said that if I hadn't lost them on the Ac I would not lose them.  As my husband say \"Just another thing that stupid doctor doesn't have a clue about.\"  I think I agree.  But it nice to know that I am not nuts.  But it is sad that I am losing them.  Oh well, I didn't really like my eyebrows anyway.  Never thought they worked on my face.  I haven't been wearing mascara in over 2 months, ran out and never got more.  So I had my 4th Taxol yesterday and it went great.  My port worked perfect and I was in and out within 2 hours.  It was perfect.  I didn't know what to do ith the rest of my day.  I almost could have gone back to work, almost.  Just being a bum today which is nice.  I think my hubby is getting sick so he isn't in the mood to go out and I am all ok with that. Hope everyone is doing good today.  I am sending good vibes to everyone for pain free days and nights with no hot flashes and peacefull sleep.  Love and ((((((HUGS))))) Kimmy",
      "MessageIndex": 1476,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 1, 2009 04:46PM MeNeverMind wrote: Great Afternoon Everyone.  I stoped by today to say that I had my lesson on Friday and feell so much more relaxed.  I get the \"good\" stuff for my meds.  I have been doing some reading and it seems that Emend is the best.  Ya for me.  I also am getting Dexamethasone, Zofran, Comazine and if I need it I get Ativan.  I WILL NOT GET SICK!!!  I WILL NOT GET SICK!!!  I Will Not Get Sick!  I will not get sick.  Right?  RIGHT!  I went out today and picked up a bunch of soup and crakers and these little cookies that have always eased my tummy.  And I talked to the girl at the pharmacy and we got my insurance corrected in the system so I am saving $240 alone on the good meds.  Ya for me again.  So I started reading the posts since I was here last and I now feel even better.  I know that I am making more out of this than is really going to ahppen.  But I don't want any of this.  I don't like being sick.  Well being told I am sick and going to get sicked when I am not sick.  But in a weird way I will get to stay home from work once and  awhile.  And it never hurts to make the people at work that don't work while I'm there have to work while I am gone.  But enough about that.  I just really wanted to say that I am total happy to have such a wonderful group of sisters.  And I hope I am able to help others as much as I have been helped.  Thanks All.  Have a great evening.  Love Kimmy",
      "MessageIndex": 51,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 8, 2009 03:44AM MeNeverMind wrote: Thanks for all the info.  I too was glad to hear about the wind from both ends.  So far I am a bit backed up but since I still have air coming out I think I am ok.  And the days after chemo I ate mostly eges and soup so not a lot of solid, so to speak.  Never did do the fire last yeasterday.  Payed so bills and then my energy was staring to go so we went the grocery store and had a nice dinner.  Snuggled on the couch for a few hour, hubby asked if it was his birthday cause he liked it so much, and then I called my folks and was in bed by 8:30pm.  Been up since 3:00am, watched the clock and the decided I was hungry so I am having some more soup and sitting here with all of you great girls.  Have a beautiful night.  Love Kimmy",
      "MessageIndex": 211,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 10, 2009 02:38PM MeNeverMind wrote: I am having a belly full of acid today.  And my mouth is RAW!!!.  YUCK YUCK YUCK.  So now I am off to get blood work done.  What a great day.  Hope everyone is doing good. ((((((((((((((((((((((((HUGS)))))))))))))))))))))))))))))Love Kimmy",
      "MessageIndex": 269,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 16, 2009 01:48PM MeNeverMind wrote:  Brenda, use all your warriorness and DEMAND the doctors cell phone numbers if you have to to get some action.  Call MANY times and tell them it is an emergencey.  You should not have to suffer!  We are all here for you.  Give us the number and we will make the call.  They will get the point real fast.  LOL  Call.  Then call in five minutes.  And in five more till you get some action.  Make sure to tell the doctor what is happening when you see him.  Hope you feel better soon. Good Afternoon.  Sorry I didn't post this weekend but I was doing so good that I was outside the whole time.  What a great weekend.  I am sorry for anyone that is not feeling well.  (((((((((((HUGS))))))))))))))) to all.  I am a bit scared about my next treatment on Wed.  I don't want to be a big girl.  I don't want to go.  I understand totaly about being in denial, I still am in a way.  My head is iching so bad today.  i may just shave my head so it stops.  Well I must go back to work now.  Talk to you soon.  Love Kimmy",
      "MessageIndex": 408,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 20, 2009 07:01AM MeNeverMind wrote: Good Morning everyone.  I don't want to brag, but I feel great.  I slept great without any aids, I forgot them.  I got up made banana bread for work and took my time getting ready.  Feel wonderful.  I think all the problems with my after the first treatment was nerves.  So I just wanted to drop in and give some encouragement to those coming in and to wish luck to those that are struggling.  ((((((((((((((((((((((((((HUGS)))))))))))))))))))))))))))) to all.  Love Kimmy",
      "MessageIndex": 517,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 21, 2009 06:49PM MeNeverMind wrote: Good evening lady's.  I loved the pink glove video.  I am often over come by the support that total strangers have to me now.  By one crappy lump I have become part of something so amazing.  I had never not donated to breast cancer anything.  I always gave something to everyone.  It was the only donation that I never gave any thought to.  It wasn't an option.  I always felt bad that I never did a 3 day walk.  I work for a company called Pro-Tuff Decals and we make stickers for football helmets for high school and collage teams, and even some of the NFL teams.  We also do TONS of other stuff, but for October lots of schools were doing pink ribbons on there helmets.  And every time on order came through, the production crew would leave a sheet on my desk for me.  I have so many pink ribbons in all sorts of sizes and shades of pink that I could wallpaper my car.  And no one had to leave them for me.  They wanted to show that they were supporting me.  I am so honored to have such a safe place to be getting better.  Sorry.  I am tired today.  I went to work this morning for a few hours and am just wiped out.  I feel good in terms of no nausea and very little heart burn.  I infact had the fairies come visit 3 times yesterday and 2 times today.  I hope I never get backed up again.  YUCK!  I just think I am going to go take a nap.  Sorry for the ramble.  Love Kimmy ((((((((((((((((HUGS)))))))))))))))",
      "MessageIndex": 563,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 7, 2009 03:49PM MeNeverMind wrote: I am having such a great day.  My brain fog is less then yesterday.  Yeasterday these same sentences took me 5 min of redos.  Today almost no use of the backspace key. :):) Today I have no nausa.  I got to go into work with my sweet hubbie today.  He drives a gravel hauler truck.  It was fun.  Short day but beautiful weather.  We are going to go out and sit by a big bonfire.  I hope everyone is enjoying this day. Oh in regards to hair falling out.  What about eyebrows and eyelashesh?  Is it like you wash your face and then your eyes are naked?  Just checking.  And does anyone else feel like there teeth and moving.  I feel like back when I had a retainer and my teeth would shift when I removed it.  It seems strange but I sometimes feel like that when my sinus are full also.  Just checking.  Keep strong.  Love Kimmy   (((((((HUGS)))))))))",
      "MessageIndex": 200,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 9, 2009 01:19PM MeNeverMind wrote: I do feel better.  I am going to start drinking tons of water when by belly is upset and that should make everything ok.  After I posted this morning I really had my first big, \"oh my god i'm gonna puke\" moment.  Scared me to death.  I did not like that.  I am going to be paying more attention to what and when I eat.  I think cheese might be a no no.  But soup is good and eggs seem to be ok.  Crackers are good too.  I am just afraid that I will turn into a house before all this all over.  Oh well.  Fat is fun.  Chubby is cuddley.  But I was able to drink a bit of V fusion apple, banana juice.  It was good.  I may try some apple juice tonight.  I think I am just scared.  It is a whole new week with a whole new set of crap to deal with.  I am so glad that I have such a great place to beable to go where people understand all the stupid little stuff.  Thanks all.  Good Luck to everyone.  (((((((((((HUGS)))))))))))) Love Kimmy",
      "MessageIndex": 244,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 12, 2009 05:44AM MeNeverMind wrote: Me not warrior.  My big giant whimp.  I was crying off and on all morning.  I still feel like crap but atleast, for now, I am at work.  I can not believe how cold I have become since I got BC. I am bundled up like it is snowing and I am still frezzing.  I still feel like I want to puck this morning, but I am being strong and trying not to.  I am having some strong tummy cramps.  My hubby is scared that if I feel like this at day 7 how on earth are we going to make it through.  He is all upset cause I now want 8 to 10 hours of sleep not my nornal 6.  Still a work in progress I guess.  Oh well.  I am going to get to work.  Good luck to AroninMia and Sherri today.  Stay strong.  (((((((((((((((((HUGS))))))))))))))))) Love Kimmy",
      "MessageIndex": 312,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 23, 2009 05:59AM MeNeverMind wrote: Good morning all.  I feel more like myself this morning.  Like a real person, not as much like a sick person.  I had a great Sunday with my husband.  We did a bit of hiking and he was so supportive.  Any time the trail became uneven he held my hand to steady me.  It was so nice.  He said he was proud of my for not giving up and powering through the not so good moments.  I total used way to much of my energy yesterday but it was so worth it.  After we got home last night I had a quick shower, bowl of cereal and was in bed by 7pm.  The hubby did all the dishes and laundry for us before coming to bed last night.  How sweet.  Some days I feel like all I ever do is eat and post on the computer and then I look back and it is as if I am never  here.  How everyone is doing good.  Sorry to be so rushed but I should get to work.  Hope everyone is going to have a great Thanksgiving.  Love and Kisses to all. ((((((((((((((((((((((((((HUGS))))))))))))))))))))))))))))))) Love Kimmy",
      "MessageIndex": 578,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 26, 2009 05:54AM MeNeverMind wrote: Happy Thanksgiving!!!!  Welcome to all the new sisters.  How everyone is going OK.  I have been just drained latley.  My mouth has been raw for 3 days and even with all the rinsing it still hurts.  I left work early yesterday because it hurt to talk.  I am still looking forward to dinner tonight but most of it will be to salty.  God bless everyone and ((((((((((((((((HUGS)))))))))))))))))) to all.  Love Kimmy",
      "MessageIndex": 637,
      "PostDate": "26/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Dec 10, 2009 06:43AM MeNeverMind wrote: Let me just say you guys are so funny.  \"penis pain\".    Finally a side effect that I could live with!        Funny stuff.  One thing I didn't mention yesterday... Port?  I hate it.  I mean it is nice for getting chemo but it just bugs me.  I am always bumping it.  It always iches.  I hate the scar.  And it hasn't worked right since the day they put it in.  And I am sick of getting poked.  Smells?  Everything bugs me.  I sit in my cubical at work with a fan blowing in my face all day and I still am overcome by smells.  I can't understand how people can not get that I want to puke with all the perfumes in the air.  And don't get me started on the chrismasy room air fresheners.  yuck!  I can't stand the smell in my own nose, and they are not making it better. Food?  I finally found something that wasn't to spice and tasted good.  Stove Top stuffing.  I was shocked but it was good.  I am going to try it again today, lets hope it works. So we had snow yesterday and now it is -11 outside.  The wind almost took my wig off.  I know I hate wearing it but I don't think I am strong enough to go with just a scarf.  Maybe in January I'll get some nervs and try it.  I got blood taken yesterday and the gilr touched a nerv.  I have never felt such pain.  I am sick of being a pin cusion!!!!!!!!!!!!!!!!!!!!!!!  (ok I feel better) Hope everyone has a great day.  Love and kisses.  ((((((((((((((((((WARN HUGS))))))))))))))))  kimmy",
      "MessageIndex": 890,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Feb 4, 2010 06:14PM MeNeverMind wrote: My husbands idea of making dinner is having me stop at McD's on my way home from work.  I'm not asking for a 5 course meal, I would take scrambled eggs or mac n cheese.  Just so I can take a rest.  And don't get pissy when I say I have to be in bed at 7:30pm.  I get up for work at 4:30am and am still late for work almost every day.  And I don't see you making my lunch or breakfast either.  He loads the dishwasher if I leave it till morning, when I have more energy, if he can't stand to look at the dirt dishes.  And when he needs clear jeans he does laundry if I am at work.  And don't get me started on the sex thing again.  You just don't understand if you haven't gone through it.  And no matter what I say he will never understand. ",
      "MessageIndex": 1541,
      "PostDate": "04/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Dec 11, 2009 01:09PM MeNeverMind wrote: Good Aftenoon all.  I got my free hats yesterday.  All 4 were new with tag, 2 baseball caps and 2 were knit caps.  All I asked for was pink and that I got.  Hot pink on 2 and lite pink on 2.  Only 1 of the knit caps is going to work for me.  It was kind of nice to take my wig off and have a nice warn cover for my head while we were out last night.  I am still waiting on my scarf.  Again all I asked for was pink to I am excited to see it.  Hope everyone is having a good day.  Love and Kisses.  ((((((((((((((((((((((((((WARM HUGS))))))))))))))))))))))))) love kimmy",
      "MessageIndex": 920,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Jan 28, 2010 01:35PM MeNeverMind wrote: first = i hate the mud flap girl, hubby has a tattoo of her on his arm. second = the people at work think i keep having some sort of serzure with all the giggling from all the fart, pee and missing hair talk.  and yes i pee crooked, fart WAY more than i did before and lost all the hair down below and all but peach fuzz on top. third = i will look into all the cance center for help and information and i will look on line for grants and the such. thanks fourth = i feel good after the 3rd Taxol.  if i get enough sleep i am ok all day.  hubby is having trouble with the fact that i go to bed a 7:30pm and he just can't go to bed that early.  and he still wants to \"do it\" but i am not there just yet.  i feel better about it then i did on the AC.  we have been snuggling much more in the last few weeks.  over all i like the Taxol so much better.  the 3rd day out is the worst.  i just feel like crap and then the 4th day my mouth just full of salt.  so that is all with me.  must get back to work.  thanks and have a great day. Love Kimmy happy farting LOL",
      "MessageIndex": 1464,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 10, 2009 06:00AM MeNeverMind wrote: Well good morning all.  It seems that morning is just not a good time for me.  I made a stop on my way into work to pick up some prunes and feel like I am going to die.  I got all hot and sweaty.  I had food with substance with me and it didn't work.  I downed half a bottle of water in hopes of not upchucking.  This is going to be harder to regulate that I thought.  It seems that my tummy is really only truly happy if I have soup in it.  So I will buy a plug in the car travle mug and just keep soup around all the time.  Now that I know that is what works best I can adapt.  Chocolate milk tastes good today, YIPPIE!  I bought some other drinks at the store in hopes of finding something good.  I made lemon aid last night, it was like drinking dirt.  Will not try that anytime soon.  My hubbie was so sweet last night.  He made dinner and cleaned up all the mess.  He also let me fall asleep in his lap while rubbing my head.  I love that man oh mine.  He could tell I din't have a great day yesterday and even asked me about it, but what the best part was that he listened, without telling me how to deal with it.  He just listened.  I was amazed.  Even thought this is a crap of a thing to be going through I really think we are learning to deal with each other better.  Silver linning?  You bet.  O.K. so now I have soup in my tum I feel better.  But I don't want to start working.  Now off to find a scarf from the earlyer posts.  Shopping is fun.  Hope everyone is going to have a great day.  lets all hope I am the worst today.  LOVE YOU ALL!!  ((((((((((((((((HUGS)))))))))))))) Love Kimmy",
      "MessageIndex": 257,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 13, 2009 01:17PM MeNeverMind wrote: Good Afternoon Girls,     I feel so much better.  I added another med to the antipuck meds so  I feel so much better.  I think I might have had a bit of a bug as well.  I left work early yesterday and went to bed early again.  I'm like a new not sick but definately sheeding person.  I can not believe how much hair I have pulled off my shirt today.  Good thing I am shaving my head this weekend.  And I can drink choclate milk.  Boy oh boy is it GOOD!!!!!!!  And I am hungry.  So I should get back to lunch.  Love and Kiss Kimmy",
      "MessageIndex": 353,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Oct 30, 2009 01:29PM MeNeverMind wrote: I did this early this morning but since I am starting chemo Nov 4th I thought I would post here also.  Thanks  Good Morning all.  My name is Kimberly and I am a stage 2a, grade 3, triple negative breast cancer winner.  I had zero margins and no node involvment.  I have 3 aunts with more than 1 round each of breast cancer.  I have had a lump removed and my port installed and will be going to my pre chemo lesson today.  I will start the chemo on Wed.  I will be getting AC 4 x's 2 weeks apart and then something else 1 week apart for 12 weeks.  I have a great husband who is feeling total left out and left in the dark, I know he is scared.  We don't have any kids but we do have 1 cat.  I have a wonderful support system of friends and family.  My mother in law had been the biggest blessing for me.  I bought a GREAT little bob wig and am trying it out at work today since tomorrow is halloween (costume - breat cancer winner).  I will be donating my hair to Locks of Love and my husband has agreed to be the one to shave my head when the time comes.  I was talking to a friend yesterday about maybe just wearing the wig full time a work and the doctors so there will be no time for the pitty face when I do lose my hair because no one will know.  Does that sound silly?  I have been a work for almost an hour now, trying to get as much done as I can now so I don't have to worrie about it next week.  Oh and if you can't tell I tend to ramble when I am scared.  And I am scared.  I had everything planed about when I wanted to do the chemo but the doctors schedual stoped that.  I am just affraid the I will not feel up to working and eventhough I have the worlds greatest office, I don't want to have to miss work alot.  I am mostly scared about how I am going to feel after the chemo.  Like an hour later, 5 hours later, a day, 2 days, 3 days...Well you understand.  I know everyone is different and there is no way to know how anyone is going to handle it.  I have heard that anywhere from day 1 to day 5 I might get sick.  But sick could be so many different things that there is no way to know.  I seem to have turned into a bit of a perfectionist and over planer since I was told about this \"lovely gift\" on Aug 28.   Everyone here seems great.  I am looking forward to all the support and wonderful info that I know I will be getting.  OK so I am going to go breath now and get back to work.  I feel better now.  Thanks I had to put off the chemo for 3 weeks so I could go see a cardiologist and ended up having a angiogram, then had to wait to see the doctor.  Good news, my heart is perfict just beats on the low side of normal.  I am sure I will feel better once I have my lesson today.  I have been reading EVERYTHING I can get my eyes on.  Sometimes I make myself sick because I know to much.  But I feel so much better knowing what is going to happen.  I don't know what I would do without the internet.  You guys are so wonderful.  I feel so much better.  Thanks",
      "MessageIndex": 36,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 4, 2009 04:14PM MeNeverMind wrote: OK.  Here I sit.  Half way through my chemo treatment.  It seems that my port is not letting them get any blood out of it.  So we are not able to start the red stuff.  It has been about an hour of sitting around board.  I have a double port and the out side side had a week blood pull when we started the first bag and then it would not give anything up.  CRAP!  So she switched sides and after a bit longer got nothing and gave up.  So I got some other meds and we now have tons of blood.  GOODIE!  I am now getting the red stuff.  So it is not all that bad at the moment.  Just wish I didn't have to be here.  I am still planing on going to work in the morning so I will log on and let everyone know how I am feeling.    Thanks again for all the support.  Love Kimmy",
      "MessageIndex": 122,
      "PostDate": "04/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 6, 2009 06:21AM MeNeverMind wrote: Good Morning everyone.  As I was reading back over everything I realized that cyber space had eaten my post from yesterday morning.  Bummer.  So let me fill you in.  We finaly got the port to work and I finished all my first chemo with very few tears, thanks to my mother in law.  She is my rock.  She keeps buying me all these cute little breast cancer ribbon gifts, since I am all about the pink now.  My new fav color, wear it everyday.  This it I got a great little book mark chain she found at a craft fair.  I think I might turn it into a breaclet so I can wear it all the time.  Yes I am very crafty.  Anyhow.  I am feeling good.  The only real sick feelings yesterday were more fear of what was happening, ie... was I going to get sick?  But I have been taking all my many pills like a good girl and keep crakers on hand at all times and drink, drink drink lots of water.  yeasterday a coworker jokes about hooking a phone and computer up in there and that can be my new office.  LOL:)  Got my shot yesterday and still feel good.  I slept throught the night which was great.  I really needed that.  My hubby is still worried about this weeked, he heard day 3 is the worst.  So we will see.  I do have one question to anyone that knows.  The girl at chemp said my hair would fall out all at once in week 3.  Really, or did she just mean that it would not be doing it over a month but more like a few days.  I already have me GREAT wig that I have been wearing to work and doctors since the Friday before Haloween, cuts down on the shock of it later.  My hair is just braided up under it.  Feels great, was able to find one that will only need a tiny bit on work once I go bald.  I was thinking of doing the buzz cut thing right after my next chemo maybe that Staturday.  If it is going to fall out fast I don't want to risk lossing it since I an donationg it to Locks of Love.  Here is hoping today is better for every than yesterday.  And ((((((((((((((((HUGS)))))))))))))))) to all both old and new.  Thanks again,  I wouldn't beable to do this without you.  I may seem strong on the outside but the scared little girl is having a harder time on the inside.  Love Kimmy P.S.  I don't if we the November's every talked about it.  So how are we all?  I'm 38.  Well thats what my mom says but I think see telling fibbs.  I only feel somewhere between 4 and 25. thanks .",
      "MessageIndex": 161,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 6, 2009 11:04AM MeNeverMind wrote: Ok, not feeling so good right now.  I don't think I had enough water yesterday or today.  I am fixing that now.  Thanks for the hair info.  Since I am donation it I don't want to wait to long but I don't want to do it to early either.  My husband and I have been married 4 years.  We got this bc gift right before our aniversery.  It is really hard on him.  He is used to fixing things that are broken but he can't fix this.  We don't really talk about it much.  He listens to when I'm telling people on the phone and then he will ask questions if he didn't understand something.  He is really being helpfull around the house with the cleaning.  I totaly know about that wrench effect.  It sucks.  We have no kids by choice but we do have a sweet little cat.  It makes vacations and small hicking trips so easy.  The first year we were married for New Years we were board, looked at each other and took off to Saint Louis for 3 days.  From idea to car less than 2 hours.  Can't do that with kids or dogs.  My hubby is also 38.  He was born 3 days, 2 hours and 1 minute apart.  Not not at the same hospital.  LOL.  Well I am starting to feel a small bit better so I should go back to work.  Keep on trucking kids - WE WILL SURVIVE!!!! AND SEE THE END!!!!  ((((((((((((((HUGS)))))))))))))))) love kimmy",
      "MessageIndex": 169,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 7, 2009 03:51PM MeNeverMind wrote: Oh and I am so full of burps.  I have more acid reflux issues but the burps and getting more common.  Love Kimmy",
      "MessageIndex": 201,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 10, 2009 07:39PM MeNeverMind wrote: Ok so I spent the money on the price mouth wash and it was all I could do to spit it out before I puked.  I was thinking of doing the salt water anyway.  I just feel like crap.  I have had a whole bottle of tums today and I just want to sleep.  For like a year.  I think I have to go to work tomorrow but I might stay home Thursday or Friday.  Who know.  I talk to ya'll in the morning. Love Kimmy ((((((((((((((((((((((((((((((((((((((((HUGS))))))))))))))))))))))))))))))))))))))))))))",
      "MessageIndex": 280,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 18, 2009 03:17PM MeNeverMind wrote: So girls I am here.  2 treatments down.  I am going to shave my head tonight cause I can't stand the iching.  I was crying last night and most of this morning.  I was afraid that I was going to be crying here but with the time I finally got here, 3 hours later, I was fine.  The doctors office was a bit behind today.  Maybe I will post more later.  But I need to go now, I just wanted to let all my warrior sisters know I was ok.  Love you all.  Kimmy.  (((((((((((((HUGS)))))))))))))))))))",
      "MessageIndex": 473,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 19, 2009 04:45PM MeNeverMind wrote: Good Evening sisters.  Glad to hear the good new Brenda.  I had a good day.  I took my emend and only 2 other antnausa pills today.  I am hungary and feel great.  I know I need to drink more water but other than that it was a good day.  Talk to you later.  Love Kimmy (((((((((((((((((((((((HUGS))))))))))))))))))))))))))))))))",
      "MessageIndex": 507,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Oct 30, 2009 01:28PM MeNeverMind wrote: This is the post I did on the October page but this works also.  I   Good Morning all.  My name is Kimberly and I am a stage 2a, grade 3, triple negative breast cancer winner.  I had zero margins and no node involvment.  I have 3 aunts with more than 1 round each of breast cancer.  I have had a lump removed and my port installed and will be going to my pre chemo lesson today.  I will start the chemo on Wed.  I will be getting AC 4 x's 2 weeks apart and then something else 1 week apart for 12 weeks.  I have a great husband who is feeling total left out and left in the dark, I know he is scared.  We don't have any kids but we do have 1 cat.  I have a wonderful support system of friends and family.  My mother in law had been the biggest blessing for me.  I bought a GREAT little bob wig and am trying it out at work today since tomorrow is halloween (costume - breat cancer winner).  I will be donating my hair to Locks of Love and my husband has agreed to be the one to shave my head when the time comes.  I was talking to a friend yesterday about maybe just wearing the wig full time a work and the doctors so there will be no time for the pitty face when I do lose my hair because no one will know.  Does that sound silly?  I have been a work for almost an hour now, trying to get as much done as I can now so I don't have to worrie about it next week.  Oh and if you can't tell I tend to ramble when I am scared.  And I am scared.  I had everything planed about when I wanted to do the chemo but the doctors schedual stoped that.  I am just affraid the I will not feel up to working and eventhough I have the worlds greatest office, I don't want to have to miss work alot.  I am mostly scared about how I am going to feel after the chemo.  Like an hour later, 5 hours later, a day, 2 days, 3 days...Well you understand.  I know everyone is different and there is no way to know how anyone is going to handle it.  I have heard that anywhere from day 1 to day 5 I might get sick.  But sick could be so many different things that there is no way to know.  I seem to have turned into a bit of a perfectionist and over planer since I was told about this \"lovely gift\" on Aug 28.   Everyone here seems great.  I am looking forward to all the support and wonderful info that I know I will be getting.  OK so I am going to go breath now and get back to work.  I feel better now.  Thanks I had to put off the chemo for 3 weeks so I could go see a cardiologist and ended up having a angiogram, then had to wait to see the doctor.  Good news, my heart is perfict just beats on the low side of normal.  I am sure I will feel better once I have my lesson today.  I have been reading EVERYTHING I can get my eyes on.  Sometimes I make myself sick because I know to much.  But I feel so much better knowing what is going to happen.  I don't know what I would do without the internet.  You guys are so wonderful.  I feel so much better.  Thanks",
      "MessageIndex": 35,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 2, 2009 01:24PM MeNeverMind wrote: I am just so at peace knowing that I am not the only one going through all this.  I stated think about it last night, big mistake, I have been so worried about Wed that I forgot all about my next set of treatment.  And then there is radiation after that.  But I am not as worried about Wed.  You girls are all amazing.  I am, by the way, proud of being a whimp.  It is part of what makes me so cute.  And I do use it to find my strength in some strange way.  I will be praying for everyone and sitting on the edge of my seat waiting to here how everyone did.  Good Luck All.  Thanks again.  Kimberly",
      "MessageIndex": 67,
      "PostDate": "02/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 6, 2009 01:19PM MeNeverMind wrote: Water is always good for me, and I am trying soup.  The apple juice it was going to drink yesterday tasted crappy.  I always drink a big glass of green hot tea in the morning and just add water to it throughout the day.  I did see a post about raisin bread so now I am hungary.  I guess thats a good thing.  I think tomorrow I might just sleep. SHEL... God bless you.   ((((((((((((hugs))))))))))))) to all. ",
      "MessageIndex": 173,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 7, 2009 04:11PM MeNeverMind wrote: Really quick.  The nurse at chemo told me about a web site that would email updates for me to everyone and all I would have to do is go to one place.  I am unable to find it in the big book they gave me.  Does anyone know what that site would be?  Thanks Kimmy",
      "MessageIndex": 202,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 9, 2009 05:44AM MeNeverMind wrote: Good Morning.  I'm not feeling so cool this morning.  I was a bit backed up this weekend and shall we say I had a breakthrough this morning.  But now I just feel week.  What I really want is a big good glass of apple juice, but the other day when I had one it sucked so I don't want to be upset by more crap the doesn't taste good.  I just wish I could be at home in bed instead of here at work.  Sorry to be such a bummer.  I had a good weekend.  We finally got the fire in last night, it was nice to just sit and talk to my sweetie.  He and I had a few talks yeasterday that we needed to have.  He feels total left out.  Because of his work he isn't able to get off to come to doctors with me, so he feels that this is not something he has any control over.  I keep trying to get him to talk but... He is a guy.  And he is scared.  I know one of the first things he said was that this was so hard for him because he is always able to fix stuff.  But not this.  I have started to ask him for help more which I think is helping alittle.  So when I came home on Friday from work I took my wig off and it felt weird.  i spent this whole weekend not reallying feeling like myself.  When I took my wig out this morning I had this great feeling of having found myself.  I think that I will be cutting my hair on this weekend.  Quick question... Is the second set of drugs harder on the system then the first?  I know it all builds up but I really don't know anything about what is to come after the 16th od December for me.  Thanks all.  I think I should go to work now.  Have a great safe and happy and healthy days. (((((((((((((((((((((((((((((((((((((((((((((( HUGS ))))))))))))))))))))))))))))))))))))))))))))))))))))))))) Love Kimmy",
      "MessageIndex": 235,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 11, 2009 07:49AM MeNeverMind wrote: Good Morning All.  I hope all my great sisters had a good night.  I was good till about 2:30am.  About an hour before the alarm was to go off I woke up feeling like crap.  I finally today let my guts out, so to speak.  Not nice.  So I am at home.  And I must admitt it feels nice to get some sleep.  I just wish I felt better.  But atleast now I have puked on chemo.  I can not stand the smell in my nose.  I first noticed it on Monday, but it's so bad now.  I just wanted to let everyone know  how I was and now I am going back to sleep.  Maybe I will go into work later?  Maybe not.  Have a great day all.  Love Kimmy ((((((((((HUGS))))))))))))))))",
      "MessageIndex": 284,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 11, 2009 12:11PM MeNeverMind wrote: Good Afternoon.  So I have slept all morning and feel better.  I let myself upchuck this morning in hopes that I just had a bug and that it would get out of my system.  I am on a pepcid a day and yes tuns of tums.  I feel lucky that I am not having the headaches like lots of people seem to be dealling with.  I am sleeping good with very little pain.  So maybe I just needed to baby myself today.  My hubby is WORRIED that this is only me a week after treatment 1, and how am I going to feel in 3 months.  I quess I am afraid of the same thing.  Before this morning I had a screaming crying fit in the bathroom.  I can't be strong forever.  I think I did good for a week.  Now I had my breakdown and I am set for another week.  I am really going to have to pay alot more attention to what and when I eat.  It seems that meat and cheese is not good.  But bread is great.  And soup is my favorite.  Chocolate seems to be nice as well.  I am just trying to figure a way to get this smell out of my nose.  I was thinking about it and I know that OLD people near the end get a smell.  I think that is what I am smelling.  Thank goodness nobody else can smell it but me.  But it still gross.  Oh had blood work done yesterday.  My numbers were down but right where they should be.  They said Ilooked really good.  I quess thats good.    Hope everyone is going to have a great day.  Talk to you later.  Off to take a nap.  Love Kimmy ((((((((((((HUGS)))))))))))",
      "MessageIndex": 294,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "MeNeverMind…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89518/profile",
      "Content": "Nov 19, 2009 05:38AM MeNeverMind wrote: Good Morning girls.  I only have a minute to talk.  I feel great today.  Better than I did 2 weeks ago.  Fear of the unknown was strong last time.  But this time I knew what was going to happen so it wasn't bad.  The doctor agreed that I had a bug. She and the chemo nurse both sad a week is really odd to be still having the nausea from chemo.    We shaved my head last night and lucky for me there are on major deformities or marks.  I have one spot the swirls like a tornado my husband thinks is cute.  We took a bunch of pictures of the before and after and some with both wigs.  It feels funny to have this wig on with no hair under it. I will have to go this weekend to get the not as good wig styled and this one needs a bang trim.  It was cool at the doctors yesterday a bunch of new people said they loved my hair.  Little did they know its a wig.  I can never hear that enough.  Is it wrong to have ice cream for breakfast?  I stopped to pick up some yummy chocolate milk and the ice cream looked good.  It has 4% vitamin A and 6% calcium per serving.  So it's not all bad for me.  My chemo, my food choices.  Becca S:  So sorry you are having trouble.  (((((((((((((((((((((((HUGS))))))))))))))))))))) Pam: Things I miss most on chemo= Eating spicy foods, like ketchup .  Yes ketchup is to spicey or tangy for me to eat.  I have always had low spice tolerance but this is ridiculous. Things I miss least on chemo = House work. Most annoying side effect= The smell from my brown/red anti nausea pill I can't think of the name of.  Or should it be memory loss?  I forget. LOL  Silver lining= Both my relationship with my husband and families are greatly improved.  We talk, I mean really talk.  And my faith is growing stronger by the day.  I mean there must be a reason that I am going through all this.   ((((((((((((((((((((((((((((((((((((((((((BIG HUGS)))))))))))))))))))))))))))))))))))) to all the brave warriors.  Good luck that today will be a great day for all.  Love Kimmy",
      "MessageIndex": 479,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    }
  ]
}