{
  "AuthorID": "meny",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
  "Posts": [
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Mar 14, 2012 06:18PM meny wrote: Thanks Judy,   THe facility I'm at only does rads in the prone position.   They explained to me how everything was positioned so as to not to touch any vital organs and it sounds far better than traditional positioning. They also told me I'm a candidate for the 3 week procedure - which gives you the same amount of radiation as 5 or 6 weeks but in higher doses for a shorter period.  But I'm still not convinced.  There IS scatter and that's a big concern for me.  I'm also small, I don't mean breast wise, I mean in general so I figure all my organs are closer together. (?)   I asked the RO about the breath holding, which I read about here.  She said that's often done when doing rads in the 'traditional' position.  Not necessary in the prone position because with the breast hanging down everything else is kept away.   Just don't know what to do.  After the medical onc telling me DCIS in itself is never dangerous because it's contained - and then having it cut out, he goes on to say I really have to have rads.     ",
      "MessageIndex": 76,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Apr 14, 2012 06:52PM meny wrote: Thank you for posting that rianne",
      "MessageIndex": 92,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Mar 17, 2012 09:48PM meny wrote: This was just posted here in a new thread. It kind of speaks to what my gut's been telling me. http://www.breastcancer.org/treatment/radiation/new_research/20120309.jsp   In the course of gathering familiy history I've discovered most of one side of my family died of heart failure..  ",
      "MessageIndex": 79,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Mar 14, 2012 07:55AM meny wrote: All good info here.  I'm in decision making mode and it's tough.  DCIS,  grade 3, lumpectomy,  clean margins - left side.  I don't want to do rads.  I'm concerned about damage to the heart and lungs.  I use my voice for a living and anything that could create breathing problems terrifies me.  I'm single and my sole support.  If something were to prevent me from working, well,  then I'd have no insurance - nor roof over my head.   Surgery frightens me less.  I'm almost convinced not to do them - but today the med onc scared me after I told him that.  I just don't know that any benefit from them would offset the fear/possibility that my breathing could be compromised down the line.   Have another couple weeks or so to decide, but having a tough time.    Are there any studies at all that have looked at people 10 or 15 years out who have died or come down with serious heart or lung - or as I've just learned on this thread, thyroid - issues and tracked back their medical history to see if they ever had radiation?  I'm afraid that the reason many doctors say there's little chance of long lasting effects is because no one has ever looked at the possiblility that rads may have caused issues causing people to die or become ill from things OTHER than bc.  ",
      "MessageIndex": 69,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Mar 30, 2012 09:59AM meny wrote: I've been learning more about rads - especially the IMRT - and it appears they really do map it so as to keep organs out of the way.  Each rad onc I've spoken to has a different method. Some advocate prone - one - at msk - says until they map they don't know which position is better for one's particular body.   But they've all concurred I need to do something - either rads or mx and recon.   ",
      "MessageIndex": 89,
      "PostDate": "30/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Apr 20, 2012 02:41PM meny wrote: Thank you!  Both of you ease my concerns somewhat.  It's really been bothering me.  I put in a call to my ENT - who specializes in those who use their voices professionally - but he's on vacation.    Shachar,  thanks for the explanation - it helps to visualize it - and I will most certainly make them aware of the importance! Cherilynne - how interesting you mention reflux!  In fact I just was at my regular doctor - who's a gastroenterologist - and he advised/ordered me to take nexium starting 2 days before surgery right through 2 days after the surgery.  Especially if it'll be LMA anesthesia.  He said reflux could be a serious issue and since I did have it at one point he wants to make sure it wouldn't be an issue. I have been blown away  by the amount and quality of the information on these forums.  I've learned SO much I never would have learned had I not found this place.  And it's given me questions to ask my doctors I never would have known to ask  - and had I not asked I would never have known enough to make the decisions I've made.  Another benefit is, when you become the ultimate question box, you see how well your doctors take being questioned on everything.  I'm very comfortable with my surgeon - in part because she always answers my questions with patience and detailed explanations and has never shown signs of being put out by them.  Her entire staff is the same.  I don't know if it's a quality found in all cancer doctors but I have had the experience with many other doctors who get bent out of shape when questioned.  It makes the whole ordeal much easier.",
      "MessageIndex": 3,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786134",
      "Title": "General Anesthesia and vocal cords meny Cherilynn64"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "meny wrote: Hello all! I'm about to have a uni MX and then fat grafting reconstruction.  Everyone says the procedures have to be done under general anesthesia,  which I've never had.  General anesthesia frightens me because I make my living with my voice and I'm scared of the risks intubation can pose to the vocal cords.  My doctor has told me about LMA - a type of anesthesia that is done by laying something over the vocal cords as opposed to going through them - but I read there are risks involved as well.  Has anyone here had any problems or changes in their voice after undergoing general anesthesia - of either type?  I think this frightens me more than any other aspect of this disease because any damage to my voice will prevent me from working (which eventually will  result in loss of insurance)  - and I'm my sole support.  Besides I love my work!  Would love to hear your experiences with general anesthesia as related to your voice.  It's not something I've been able to find information on, since I guess - in the scheme of things - for those whose livelihood doesn't depend on it, it's not as important as other factors.  Thanks!  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786134",
      "Title": "General Anesthesia and vocal cords meny Cherilynn64"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Apr 23, 2012 12:11AM meny wrote: Not singing fortunately, Nancy.  It's a narration. And I'm not having immediate recon.  In fact,  I'm supposed to fly 5 days later to another surgeon for recon.  AND more anesthesia.  It all makes me very worried.   But thanks for elaborating, Mary. Now it is encouraging.  I'm supposed to be in the hospital only the night of surgery and released the next day.  My surgery is supposed to be around 1hr and a half tops I think.    ",
      "MessageIndex": 17,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786134",
      "Title": "General Anesthesia and vocal cords meny Cherilynn64"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "meny wrote: This is a study from 2007 but I thought it was really interesting.   http://www.cancer.gov/clinicaltrials/results/summary/2007/hypnosis0907 Women undergoing surgery for breast cancer who received a brief hypnosis session before entering the operating room required less anesthesia and pain medication during surgery, and reported less pain, nausea, fatigue, and discomfort after surgery than women who did not receive hypnosis. The overall cost of surgery was also significantly less for women undergoing hypnosis.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/785096",
      "Title": "Hypnosis Before Breast-Cancer Surgery meny Blessings2011"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Apr 22, 2012 04:59AM meny wrote: Thanks,  this sets my mind at ease.  One of the anesthesiologists called me back yesterday and I'll be speaking to the other on Monday - so they'll be aware of the situation.  They both say they use Zofran right before surgery.  Didn't mention a patch.  Good idea - I'll ask!",
      "MessageIndex": 8,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786134",
      "Title": "General Anesthesia and vocal cords meny Cherilynn64"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Apr 28, 2012 03:47PM meny wrote: Update.   I had my first surgery tuesday under LMA anesthesia.  I woke up ravenous, ate all the crackers in sight and was blabbing away immediately.  Incoherently probably.  My voice that night was perfectly normal - I could have narrated had I been in my studio. NOW,  I head off for another surgery on Monday - in another state.  This one they tell me will have to be under general. No LMA.  So I'm worried all over again.  ~sigh~   The surgery should only be about 2 hours though.",
      "MessageIndex": 19,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786134",
      "Title": "General Anesthesia and vocal cords meny Cherilynn64"
    },
    {
      "AuthorID": "meny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146405/profile",
      "Content": "Apr 22, 2012 01:03PM meny wrote: Downey, that concerns me.  Mary - although you meant it to be encouraging it concerns me also.   If I didn't work for 4 weeks, I'd lose half my work.  I have a recording session scheduled 4 days after surgery.   And I have deadlines that mean I'd be ramping up work.  My doctors have told me - since I record from home - that working won't be a problem.  ",
      "MessageIndex": 13,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786134",
      "Title": "General Anesthesia and vocal cords meny Cherilynn64"
    }
  ]
}