{
  "AuthorID": "mepic",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
  "Posts": [
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "May 2, 2013 10:54AM mepic wrote: Thank you for that information Voraciousreader. It was only IMHO that in the future, when more is known about vascular invasion, that I think they will take into account the degree of invasion as the woman told me on the phone they do not do that now, as that study concluded it does make a difference. Maybe the reason I haven't found studies on my own is I have been specifically looking for mets but the studies just use the word breast cancer \"recurrence\" which could include local recurrence and distant mets? (I just had a lightbulb moment!). But I will look for the study I read before...it was really long. Voraciousreader you seem very knowledgeable and so may I ask, if you were in my shoes, with the high sensitivity, 29 year old aunt who died of uterine cancer, focally present vascular invasion (tiny), and already low end of estrogen would you take Tamoxifen? I am losing weight, will return to exercising, am avoiding sugar, eating more veggies and fruits and staying away from preservatives and white foods as much as possible. Oh and I am already taking DIM and iodine (I have Hashimotos Thyroiditis). I am not asking you to be a fortune teller, just for your opinion on what you would do. This is all so overwhelming I don't even know if there are alternatives. Meds scare me more than surgery ever did :(",
      "MessageIndex": 64,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "May 3, 2013 07:52PM mepic wrote:",
      "MessageIndex": 72,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "Apr 23, 2013 09:10PM mepic wrote: Hi Violet_1, my dx is similar to yours except I'm stage 1b because my tumor was .9 mm (still under 1cm), other than that our dx and surgeries are the same.  I am awaiting the results of my oncotypedx test.  At first my breast surgeon said the same thing, that she thought they probably wouldn't even ask me to take Tamoxifen given my final pathology results but then on my next visit, apparently she forgot she said that and was talking like of course I would be taking Tamoxifen.  I too had an aunt die at the age of 29 of uterine cancer and after all I have been seeing about the side effects of Tamoxifen I'm not convinced it is the right choice for me.  I did the adjuvent on-line and at my age Tamoxifen only improves my odds of not getting reocurrence by 4%  I figure good diet, exercise and losing 20 pounds gives me a good portion of that same percentage with GOOD side effects.  I don't regret having a bmx at all.  Like other women here have posted I keep getting very positive remarks for choosing bmx.  I really wasn't a good candidate for lumpectomy anyway because it was going to be hard to get good margins given the shape and size of what had to be removed and I really didn't want to get rads either.  Since we had bmx and I haven't found any studies that confirm that Tamoxifen helps reduce distant mets, only local reocurrence, I just don't understand why it is even being suggested.  I know a bmx doesn't 100% prevent local reocurrence but the chances are so small compared to the risks of Tamoxifen.  I am leaning towards keeping a healthier lifestyle as I mentioned unless of course my oncotype dx score comes back unexpected crazy high.  For me, my faith keeps me from freaking out about that unknown percentage and I'm just not going to be willing to throw a carcinogen (Tamoxifen) into my system for such a small percentage of possible prevention.  I will post again when I get my oncotypedx score because I find it really interesting to see what other women's results were and maybe mine will help someone else playing the waiting game.  Be well ladies.",
      "MessageIndex": 36,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "Apr 30, 2013 07:46PM mepic wrote: My oncotype dx came back 15 (reocurrence rate 9%).  I am confused about the 9% rate as it is based on my taking Tamoxifen.  Does this mean if I don't take Tamoxifen I am actually at an 18% risk of distant mets?",
      "MessageIndex": 47,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "May 1, 2013 07:00PM mepic wrote: I spoke with Genomic Health today (the company that does Oncotype DX) test and no, it is not correct to assume my risk is 18% of reocurrence without Tamoxifen.  She said it would probably be higher than 9% but she couldn't say how much.  The reason given is the Oncotype DX test was based on a study of women who ALL used Tamoxifen.  So it really is more for someone to see if chemo would benefit them, but can't be used to decide on taking Tamoxifen or not.  Another thing I found interesting was that vascular invasion was used towards obtaining the score (gathered from the pathology report) but all persons with vascular invasion are grouped together, instead of diferrentiating between \"focally present\" (minimal invasion), moderate invasion and extensive invasion.  The only study that has confirmed that vascular invasion makes a definitive difference was in persons with extensive invasion found.  The study found that minimal invasion has the same outcome as patients with no invasion.  Since I had \"focally present\" invasion I believe my score should be lower than what it was, 15.  My estrogen levels are positive but on the low end of positive so to me that means someone 100% estrogen receptive would take Tamoxifen to lower their estrogen....but I'm already there.  I am perimenopausal.  My biggest concern is developing distant mets and I have looked extensively and I cannot find a definitive study that Tamoxifen prevents distant mets.  I even found a study that confirmed it doesn't, that Aroma Inhibitors were better for that.  So Oncotype confirmed for me I don't need chemo, which my doctors were pretty sure of already.  Unfortunately it is not helping me at all make a decision about Tamoxifen.",
      "MessageIndex": 50,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "May 4, 2013 02:39AM mepic wrote: Big hug to you Violet. With all you've been through you write with such grace. Vora, thanks again for your information. I am perimenopausal. My ER was 8.3 which is on the low end of the Oncotypedx dx scale. Not sure what percentage that would translate to but 6.5 is the cutoff for being ER+. I am taking DIM which I know doesn't have a lot of expensive studies behind it but I must say I've been on it a week and I feel great. Don't know if its because I'm recovering from bmx or if its the DIM but I definitely feel stronger and healthier this week. I wonder if I could get baseline blood work done this week and then in 2-3 months to see if DIM is bringing my estrogen down even lower. To me feeling great translates to my having the energy to exercise and eat healthier. When I don't feel well is when I tend to eat bad and would be less inclined to be active. May I share this: the night before my surgery I woke up at 2 am as I had been doing for a few weeks due to stress since my dx but that night when I woke up I smelled beautiful flowers, like being surrounded by Hawaiian leis. It was so wonderful and I just knew I was being comforted. Not only did it smell fantastic but I just got this overwhelming sense of peace, beyond understanding, and I fell right back asleep. I had the most restful night of sleep I'd had in weeks! Anyway that sense of peace hasn't left me. I pray for peace beyond understanding for all of you too. Bless you ladies. Thanks for sharing with me.",
      "MessageIndex": 85,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "May 2, 2013 12:18AM mepic wrote: I can only say that is what her response was and she did say the reocurrence risk would be higher than 9% but she couldn't say by how much which actually falls in probably to the range you gave Voraciousreader, of between 11% to 18%  As the Oncotype dx test is fairly new I do believe they will fine tune it in the next few years to include a variation in scoring for extent of vascular invasion instead of just lumping everyone with vascular invasion as the same.  I will read the link for the study on mets and Tamoxifen.  The last time someone posted a link saying it did prevent distant mets I read it and found in two locations on that study that it really didn't.  I will admit I do not have rose-colored glasses on with Tamoxifen and I have a very good reason for that.  I am highly sensitive to all meds, am allergic to alcohol, have very low blood pressure, tend to run anemic, can't even take Benadryl and fainted and then threw up from the pain meds after bmx.  I don't metabolyze meds well at all, I know this about my body, so the thought of taking something for five years like Tamoxifen scares the heck out of me.  So I have spent hours researching it and I know there are many women who don't have problems on it.  Unfortunately on the inernet you will find more women who posted that do have problems with it which makes someone like me, who is prone to having side effects from all medicines, step back and say hmmmm.  For me, taking it can be seriously life-changing and potentially fatal, so I have a good reason to question the risk versus the benefit.  If my cancer had been found later I would be doing the recommended chemo and everything else.  But for a stage 1 low grade cancer with bmx, I've got to do a thorough assessment of risk versus benefit.  I will be asking my oncologist about alternatives to Tamoxifen given I already have lower estrogen levels than I realized.  Stay well all.    ",
      "MessageIndex": 61,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "May 3, 2013 01:23AM mepic wrote: Thank you sincerely Voraciousreader.  So many of us learn from people like you who researched, and more importantly understood what you researched, and explained it in easier to understand terms on these boards for people like me who are still having a hard time reading the signs whizzing by on this speeding train I never expected to be on.  I still can't believe less than 3 months ago I had no idea I had breast cancer.  If it weren't for the tissue expanders and my new Chesty LaRue looking chest I swear I would think it was a bad dream.",
      "MessageIndex": 66,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "May 3, 2013 08:23PM - edited May 3, 2013 08:27PM by mepic I called to ask if I could get my Ki67 expression results but apparently they don't release that, not even if your doctor were to call and ask for it.  I also got a different answer as to the vascular invasion.  This person said they don't really look at that - that they look at the gene expressions.  I must say the customer service reps where they do the Oncotype dx testing are super nice.  So nice I'm not even upset I got two different responses.  I feel the same as Annette47, I just don't feel a strong fear that I will get distant mets.  I know local reocurrence is possible but I don't fear that at all because the probability is so low as I had a BMX and small, low grade tumor.  I realize all my fear is about taking Tamoxifen-and unlike cancer where I had no choice, I do have a choice what meds I take.  It's all a gamble anyway...I'm just going to curl up in God's palm and let Him take care of it.  Be well all. ",
      "MessageIndex": 73,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "Apr 25, 2013 12:29AM mepic wrote: 47, still 47, stage 1b, grade 1, er/pr+, her negative Microcalcifications on yearly mammo that weren't there year before. Initially thought to be only DCIS but after bmx had .9 mm IDC, another area of .1 mm IDC along with 4 cm DCIS all in right breast. No symptoms. No family history. God is going to protect me from this bully.",
      "MessageIndex": 909,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "mepic",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170983/profile",
      "Content": "May 26, 2013 12:40PM mepic wrote: My fills were pretty quick. I came home with 300 cc, got 150 more cc 2 1/2 week later and last fill of 125 cc 3 weeks after that. I have very stretchy skin so it was uncomfortable but not painful (I took no pain meds). I can wear a bikini top no problem. The tissue expanders do sit a little high on my chest but my husband thinks they look great and I have actually had several compliments. In clothing you would never know I had a bmx so recently. I can go in pools and the ocean this summer no problem per my PS. I gave up jiu jitsu (Brazilian) until after my permanent implant surgery heals which my PS also recommended. I sometimes get a bit self conscious of my new \"perkiness\", especially around people who don't know I had breast cancer, but I am old enough to not care if people wrongly judge me by first appearances.",
      "MessageIndex": 6,
      "PostDate": "26/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805113",
      "Title": "Wondering About Tissue Expanders BoatinGirl mepic"
    }
  ]
}