{
  "AuthorID": "mermaidmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260129/profile",
  "Posts": [
    {
      "AuthorID": "mermaidmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260129/profile",
      "Content": "Dec 10, 2017 10:49PM mermaidmom wrote: it’s been awhile since I’ve checked. I had my first round on Nov 28th. First couple days weee ok and then I felt like I got hit my a truck. Cramping and so much muscle and bone pain. On day 7 I spiked a fever and had to be in the hospital for 2 days on antibiotics since my blood count was almost nothing. Since I’ve been home i have felt almost normal then I try and do normal things and feel so so tired. At this rate I should feel like myself just in time for chemo next week. My hair still hasn’t fallen out but it’s super sensitive sometimes- wonder when it’s going to happen. Tomorrow is day 14 so I’m guessing anytime now I’m going to run my head and it’s just going to come out in my hand. Tomorrow is my first day since my dmx and chemo that I have no help- fingers crossed I’m able to take care of little kidlets ok.",
      "MessageIndex": 561,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "mermaidmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260129/profile",
      "Content": "Nov 13, 2017 12:15AM mermaidmom wrote: Hi everyone, just wanted to introduce myself. I was dx 09/22 and had my dmx 11/02 with tissue expanders. Found out a few days ago that I start chemo on 11/28. I am doing 4 rounds of T+C as right now, that may be upped to 6 depending on the lymph node pathology. I am a bit nervous on how this is going to hot me as I have 3 little ones 7 and under, and of course not sure how I will keep my immune system up with all the colds etc coming into the house from them. I've done the chemo things before almost 20 years ago, had AC, methotrexate and cisplatin and they hit me really hard. Hoping this time it's not as bad. My partner is amazing but I think he s overly optimistic on how I'm going to feel. Happy to have a safe place.",
      "MessageIndex": 122,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "mermaidmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260129/profile",
      "Content": "Dec 11, 2017 11:15AM mermaidmom wrote: nonahope- I cut my hair short soon after I found out I would need chemo and then I buzzed it a couple days before chemo so hopefully it won’t be too bad. Blair2- I was also on the shot and it didn’t work at all! Not sure what the plan is for next chemo. There is talk of either a lower does of taxotere or of increase the amount is the shot. I just got the kids ready for school and my energy is gone. It’s going to be a long day.",
      "MessageIndex": 573,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "mermaidmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260129/profile",
      "Content": "Nov 17, 2017 05:23PM mermaidmom wrote: stage2ire- my littles are 7, 4.5 and almost 2. I have a lot of amazing support. My Aunt is coming in from out of town the day before I start chemo. My partner is also great and his company is pretty understanding of whats going on. Plus lots of people offering meals etc Im going to see about starting my 2 younger ones in daycare twice a week so I can just rest and I don't have to worry about asking for help. Found out lymph nodes are all clear! Will only need 4 rounds and no port.",
      "MessageIndex": 181,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "mermaidmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260129/profile",
      "Content": "Nov 17, 2017 08:53PM mermaidmom wrote: Blair2- my oncologist said it was the amount. If I was having anymore than 4 rounds we would have done a Port. ",
      "MessageIndex": 184,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "mermaidmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260129/profile",
      "Content": "Dec 10, 2017 10:50PM mermaidmom wrote: oh also- I’ve lost no weight. I didn’t really eat for a week between just feeling so cramped answer full and the horrible taste in my mouth. Has any one else statesman steady on their weight?",
      "MessageIndex": 562,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    }
  ]
}