{
  "AuthorID": "mesharon195…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223563/profile",
  "Posts": [
    {
      "AuthorID": "mesharon195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223563/profile",
      "Content": "Nov 11, 2015 02:11PM mesharon1959 wrote: So - I will be meeting with my RO for the first time Monday. I'm new to this. Don't know what I'm going to have in terms of type, length of treatment, etc...scared to death. Any pointers will be appreciated. Also - how do RADS affect what you can comfortably wear? I will be working during treatment. I've heard it makes a person tired. What time of day is the best time to go based on fatigue? Thank you ladies!!!",
      "MessageIndex": 1490,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "mesharon195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223563/profile",
      "Content": "Nov 11, 2015 04:56PM mesharon1959 wrote: Molly50 - ChiSandy - thank you for your apparel suggestions. I want to be prepared before I begin treatment with lotions, potions, etc. as well as attire. I am seriously NOT looking forward to the experience...but with all of your inspiration, I will do my very best to be brave. Additionally, how painful is it or does it vary depending on the person and the treatment? Thank you so much for your help!! JPay - sorry for what you're going through!! I hope all works out well for you!!",
      "MessageIndex": 1494,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "mesharon195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223563/profile",
      "Content": "Nov 12, 2015 10:30AM mesharon1959 wrote: Thanks Outrunning for your input. I just want to look normal in my clothes, and be comfortable. I appreciate you sharing.",
      "MessageIndex": 1513,
      "PostDate": "12/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "mesharon195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223563/profile",
      "Content": "Nov 11, 2015 10:54AM mesharon1959 wrote: I have NO family history of cancer on either of my parent's side anywhere, nothing with any of my kids either. However, I have the distinction of being the \"Cancer Queen\" of my family. I defeated ovarian cancer at age 14, and I can beat my DCIS too. Waiting on my second surgery - surgeon didn't take a large enough margin - so I have the thrill of that coupled with the pathology....fingers are crossed. Trying to stay as positive as I can. When I was diagnosed with ovarian cancer, my attitude was \"People are cured of cancer every day\". I went through my surgery, chemo etc.....never had a recurrence. It wasn't until my annual mammo last year the technician told me that ovarian cancer is related to many types of breast cancer. Somehow in my psyche I think that knowing that 'fun fact' brought it on.....of course we're all looking for a reason.....an excuse.....for having breast cancer. That's mine. Ignorance is bliss! And, somehow I just knew when the imaging place called me back for an ultrasound on something they saw on my mammo in August (and yes I'd had MANY ultrasounds and one FNA that were B9 over the years) that I had cancer. I had a very strong feeling, and even went so far as to tell the HR dept. so I could get my short term disability paperwork in the event I might have to take extended time off. I'm mentally blocking the discomfort of the upcoming RADS and the estrogen blocker side effects....only because I think the surgery is going to be the easy part. Also blocking out medical billings that are probably already rolling in - so I'm not checking the mail....I will face every event as it comes and not before. I'm eating this elephant one bite at a time because I know it's not going to be eaten in one day. That's my version of 'one day at a time'. Of course I'm telling all of my friends to go get regular mammograms!! It's shocking to me how so many women don't go regularly. It's like playing \"Russian Roulette\" in my opinion, but I've been cysty and lumpy my whole adult life - and have been going annually for mammos (and well woman checks) since my late twenties. I finally told all my adult kids and my brother (sparing my 83 year old mother unless it gets messy for me down the road), have only told one of my girlfriends, and of course my S/O has been with me through this experience from the beginning. I can't stomach the idea of telling all my friends - I have enough issues with anxiety and telling people about it sends my anxiety through the roof! Plus I HATE being pitied. And my friends will all pity me - except the one I told. She's not the type to exude pity. So - bottom line - we're all vulnerable to BC, no matter how healthy our lifestyle is. We just have to accept our fate, get the best team of doctors, make the decisions that are best for us and get busy fighting. Best wishes to all with warm gentle hugs, and may our worst fears be squelched and our fight be brave!!!",
      "MessageIndex": 18,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/836493",
      "Title": "Just found out today - I have breast cancer. etnasgrl mesharon1959"
    }
  ]
}