{
  "AuthorID": "MFB",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102988/profile",
  "Posts": [
    {
      "AuthorID": "MFB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102988/profile",
      "Content": "Nov 21, 2011 12:54PM MFB wrote: Hi, I don't want to be a Debbie Downer and I certainly hope and pray that this is the guy - he sounds wonderful.  Just a word of caution - don't let yourself get all caught up in the romance - lovely as it is.  Now would be a real good  time to look beyond the roses and cooly ask your self if the two of you would be compatible even if things weren't going so well.  Is he even tempered and fair with everyone?  Do you and he have shared interests?  Things like that.  I believe the romances that last are build on strong friendships..  Be sure you two have the makings of that.  If so then go for it - actually enjoy either way but long term only if all is in order. Maey ",
      "MessageIndex": 11,
      "PostDate": "21/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778460",
      "Title": "New guy update tammie GatorGal"
    },
    {
      "AuthorID": "MFB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102988/profile",
      "Content": "Dec 7, 2011 11:07AM MFB wrote: Hi I have worked right along full time - financially I've had to.  I have a wonderful and very understanding boss, I really enjoy my job and the people I work with not to mention the fact that I only have a 2 mile commute.  I've been fortunate to have this going for me and for me I think work has been good.  I love the interaction with other people and for 8 hours a day I can forget I'm a sick person.  That said, however, if you can afford to retire and have family and friends to spend quality time with then certainly gracefully retire and devote your energies to them. Best of luck Mary ",
      "MessageIndex": 1,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779172",
      "Title": "to work or not? lem_kenny lem_kenny"
    }
  ]
}