{
  "AuthorID": "MGNewYork",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246876/profile",
  "Posts": [
    {
      "AuthorID": "MGNewYork",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246876/profile",
      "Content": "Feb 10, 2017 09:52PM MGNewYork wrote: Dcbc you look absolutely beautiful! No I did not have a 3D MRI. They found it on a Mammo and then sent me for an MRI with contract to see if their were more and to clear theleft boob.",
      "MessageIndex": 1958,
      "PostDate": "10/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "MGNewYork",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246876/profile",
      "Content": "Feb 10, 2017 02:53PM MGNewYork wrote: Hi, I'm new to this site. I have just been diagnosed with stage 2 breast cancer. I'm here to share my story and I'm looking for support and knowledge as I prepare for this road ahead of me. I am 46 a mother of 2. I went for a mammo on 11/28/16 and by 12/15/16 my biopsy came back that I indeed had cancer. Invasive lobular. I went in for surgery on 1/9/17 I had a lumpectomy and 3 lymphnodes removed. All margins were cleared and 2/3 lymphnodes came back postive. I met with my oncologist on the 1/26 and he sent me for a CT of abdominal, pelvis and chest and also a bone scan and blood work. A sample was also sent to Oconotype DX. So my next scheduled appt is 2/16 to discuss my result. I have been able to read my scan results. (Today's technology they upload to an account) the downside my doctor is on vacation so no help for me through the medical reading. So anyway it seems that all my organs are good no metastasis. The bone scan also came back with no metastasis but they are asking for an MRI because their are multiple sclerotic lesions seen in visuals skeleton on CT scan. I've googled but that seems like a bad thing sometimes. All comments are welcome! I hope I entered the right group!!! Thank you!",
      "MessageIndex": 1911,
      "PostDate": "10/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "MGNewYork",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246876/profile",
      "Content": "Feb 10, 2017 06:57PM MGNewYork wrote: Lisabekind: it sure does suck. I wish you the best on your upcoming scans. You are in my prayers. DCISinAZ: Thanks for the tip. I updated my profile Diagnoses. PUgsmama: thank you, I love the hair! Thank you all for the welcoming!",
      "MessageIndex": 1941,
      "PostDate": "10/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}