{
  "AuthorID": "MGT44",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45889/profile",
  "Posts": [
    {
      "AuthorID": "MGT44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45889/profile",
      "Content": "Feb 18, 2007 05:51AM MGT44 wrote:",
      "MessageIndex": 4,
      "PostDate": "18/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/536100",
      "Title": "Sharp needle like pain in left breast and rash MGT44 carolv"
    },
    {
      "AuthorID": "MGT44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45889/profile",
      "Content": "Feb 19, 2007 12:44PM MGT44 wrote:",
      "MessageIndex": 7,
      "PostDate": "19/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/536100",
      "Title": "Sharp needle like pain in left breast and rash MGT44 carolv"
    },
    {
      "AuthorID": "MGT44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45889/profile",
      "Content": "MGT44 wrote: Hi I have had an eczema like rash on my left breast for over a year now. It started just outside the areola area but recently moved into the areola area. Some days it looks more 'angry' than others. I was seen by a breast care doctor when it first appeared and a mammogram was done but nothing untoward appeared on the mammogram. I think the exact wording was 'no significant changes to the breast'. Anyway, I am now experiencing a lot of pain in that breast. It feels like a stabbing needle like sensation. The area where the 'eczema' is, is painful to touch and again it feels very sharp, although I get the same pain intermittently without it being touched. I cannot lie face down as this also produces 'stabbing' sensations in my left breast. My left breast also appears swollen around the rash area although I tend to notice this more in the evening, if that makes sense. The reason I am posting this is because obviously it would make sense to go back to the doctor and have it checked out again but I suffer from agoraphobia and it isn't easy for me to go for hospital/doctor visits. I am hoping that someone out there who has possibly experienced the same symptoms can let me know whether this is just something innocent like 'hormonal' or really does deserve a visit to the doctors. Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/536100",
      "Title": "Sharp needle like pain in left breast and rash MGT44 carolv"
    }
  ]
}