{
  "AuthorID": "miadora",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91589/profile",
  "Posts": [
    {
      "AuthorID": "miadora",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91589/profile",
      "Content": "Nov 3, 2009 11:14PM miadora wrote: The biopsy indicated that the mass was benign. I am relieved, of course. I am thankful for all your support, I still haven't personally viewed the incision site... but believe me... I feel it. Best to all \"waiters\" and \"healers\"   Love - M",
      "MessageIndex": 7,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/742890",
      "Title": "Bruising after excisional biopsy miadora miadora"
    },
    {
      "AuthorID": "miadora",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91589/profile",
      "Content": "miadora wrote: Hi all.  I didn't expect it to hurt this much, or for the bruise to be almost the size of an index card. Is this normal?  I am pretty okay about waiting until Monday for the results... although one can never account for subconscious worries. :)  I had the procedure yesterday afternoon, and unfortunately decided to go to work today. I looked like heck after the 3rd hour of teaching. There was no turning back at that point. Thanks for any response related to bruising and time frame for healing.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/742890",
      "Title": "Bruising after excisional biopsy miadora miadora"
    },
    {
      "AuthorID": "miadora",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91589/profile",
      "Content": "Nov 1, 2009 07:51PM miadora wrote: Hi mimi - I shouldn't have gone back to work the next day. I work about 20 miles from my home, so once I got there, I figured it was too far to drive home. I felt lousy, looked worse, and by the time the day was over, I felt like I was going to faint. I see the surgeon tomorrow ( Monday) at 1:45.  I still hate bending over to pick things up... and have tried using an ace bandage.  The good news is that the bruising is fading.  I will let everyone know the biopsy results tomorrow evening. I did not tell a lot of people about having the procedure done - I figured I could bear the subconsious worries without getting mom and family all \"worried\", etc. :)    Best to you and I hope you get good news! ",
      "MessageIndex": 6,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/742890",
      "Title": "Bruising after excisional biopsy miadora miadora"
    },
    {
      "AuthorID": "miadora",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91589/profile",
      "Content": "Nov 23, 2009 06:41PM miadora wrote: Sorry I didn't see your post, and that there wasn't a response.  My bruising was on the outside, right near the incision. I am about 4 weeks into this, and asked my regular MD about when I could expect the annoying ache will go away. ( Pain lessened each day, by the way.) She said that this area is rich in nerve endings, so it will take a bit longer  to feel 'normal'. A few more weeks. I switched to heat after the 2nd day, because it felt better.  The bruising dimished after 3-4 days, only a light purple/brown.  I think that any time you have concerns or questions, it is not unreasonable to call the surgeon. Also- my bandage was removed by the surgeon a week after the biopsy.  It felt better when it was on.  I hope that you are feeling better, and that the result of the biopsy was good.  -A  PS- Last week was the first time I could actually lay on my stomach for a nap. My cats still aren't allowed to lounge on my chest, anywhere near my left breast. I watch them carefully for signs that they will leap up to snuggle.  ",
      "MessageIndex": 10,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/742890",
      "Title": "Bruising after excisional biopsy miadora miadora"
    },
    {
      "AuthorID": "miadora",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91589/profile",
      "Content": "Oct 28, 2009 05:57AM miadora wrote: Jeannie and Shappy,  Thank you so much for the information.  I am going to try to put some arnica on the bruise to see if that helps.  I had the core biopsy in Sept, with much less bruising, but it was still not \"easy\".  I have no idea how much they removed, at this point. I guess I didn't ask how large the area was, or else I \"forgot\". Yes, I feel the \"pull\"  despite wearing 2 sport bras, and I am 'medium'.   I hear you re: gravity!     I was wondering if my supervisor would accept that as an excuse for staying home. LOL.   \" I won't be in today, gravity\" . Anyway, your responses helped my mood, immensely, not the fact that it hurt(s) for everyone, rather, that I am not being overly sensitive.    I will post update.   Mia ( looking for ace bandages before going to work)  Best to you in this journey.        ",
      "MessageIndex": 3,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/742890",
      "Title": "Bruising after excisional biopsy miadora miadora"
    }
  ]
}