{
  "AuthorID": "Michelle21",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155910/profile",
  "Posts": [
    {
      "AuthorID": "Michelle21",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155910/profile",
      "Content": "Oct 7, 2014 11:19PM Michelle21 wrote: Crone, I feel exactly that same way too. Unless I die of an accident or any other way, my stage IV breast cancer will kill me, and that does NOT make me a survivor. We're either locked into one of two categories: survivor or lost. Is it wrong that this makes me angry? And then I'm hit with people that seem to be almost bragging to me about of how long they have been cancer free. Yes I want to be happy for them, but then I think I might be on my last 6 months that my own family won't even acknowledge. Geesh! I think I need to start a thread and really start talking about this because I've got too much pent up. So if I'm not lost yet, but am not a survivor, what am I???",
      "MessageIndex": 73,
      "PostDate": "07/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823831",
      "Title": "First Puketober sitings! surfdreams sas-schatzi"
    },
    {
      "AuthorID": "Michelle21",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155910/profile",
      "Content": "Jan 15, 2013 11:12PM Michelle21 wrote: Hi Everyone, I am 47 and have been fighting for over 10 years now. Originally dx 2002 stage III, local recurrence 2007, and mets dx to lymph nodes opposite cancer side 2010. Took Avastin and Femara for two years and tumor markers went up. Now on a phase II study with Faslodex and some type of chemo pills that don't even have a name yet. Though they make me very ill and I do not have a decent quality of life taking them. I have 5 kids, girl b 1982, girl b1985, son b1986, girl b1993, and stepson b 2004. We had a wedding last summer, my second daughter, and my youngest girl is marrying this summer. My son is giving me my first grandchild in April and he'll be getting married in 2014. And if my health holds up, my husband and I will renew our vows on our 10th anniversary in 2015 and return to Italy for a second honeymoon. I have so much to look forward to and pray that I can make it at least that far. I need to see my kids into the next phase of their lives. I need to know they'll be in a safe place when I finally have to go. Thank you all for this wonderful community. I feel so very blessed to be part of it. Michelle",
      "MessageIndex": 40,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798841",
      "Title": "Roll Call 2013 LilSchatzie reader123"
    },
    {
      "AuthorID": "Michelle21",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155910/profile",
      "Content": "May 10, 2013 10:31PM Michelle21 wrote: I am #201. First dx 2002 Local recurrence 2007 Mets 2010",
      "MessageIndex": 363,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Michelle21",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155910/profile",
      "Content": "May 10, 2013 05:19PM Michelle21 wrote: I am so very sorry sweetie. I am praying for your family.",
      "MessageIndex": 34,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804351",
      "Title": "{{{ Sandy is an Angel }}} PaulAndSandy justjudie"
    },
    {
      "AuthorID": "Michelle21",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155910/profile",
      "Content": "Nov 13, 2012 05:38PM Michelle21 wrote: I thought you got rid of it. You didn't lose your hair. Said by my neighbor. We're going to be married at least 50 years. Said by my husband last year on our 6th wedding anniversary. Mom, you have to plan your retirement now. Get back to work. Said by my daughter when told the meds failed.",
      "MessageIndex": 415,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    }
  ]
}