{
  "AuthorID": "MicheTheVan…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
  "Posts": [
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jun 1, 2015 05:00AM MicheTheVanquisher wrote: Penny, thinking of you in caring and loving space, in the hands of your God, in the light of this world. A loving smile to you. Michele",
      "MessageIndex": 195,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831418",
      "Title": "Please, Lord redwolf8812 GrammyR"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Aug 9, 2015 08:47PM MicheTheVanquisher wrote: Interesting thread. I lived in a super healthy part of the world, ate lots of veggies, berries, and some other fruits and wild game and fresh caught fish for decades and my own breads and cookies--absolutely no chemicals in my foods yet here I am. I was well exercised, very low BMI, good strength and endurance, yet here I am. My mother fed her children unprocessed foods and lots of veggies and fruit and not much sugar in the house (except for Dad's secret stash). I have never used chemicals to clean my house, never nasty bug killers or anything like that in house or garden and few skin products that weren't organic. Yet here I am. That said, I don't know what my mother was eating, breathing, drinking, using to clean her house with, etc, when I was in utero. I quit dieting when I was in my 20s, telling myself I would eat whatever I wanted as long as it tasted good and I didn't stuff myself. Sometimes I only ate oatmeal chocolate chip walnut cookies and milk for dinner, most times I ate lots of veggies and a little protein. Well, here I am. Was it all the sugar in the cookies I baked that brought me here? Maybe it was too much Haagen Das coffee ice cream. Venison? Salmon? Probably the red wine or gin and tonics? Yeah, too much tonic water. I guess at this point of NED I'm all for quality of life--food that tastes really really good and is grown by local farmers, baked by me or good bakeries and that makes me feel good and energetic. Good restaurants, wine dinners with other foodies--whatever I feel like eating each day (or whatever DH cooks)! I'm lucky in that I don't worry about how much I eat, since I quit worrying about food and started paying attention to my stomach I don't overeat. My Onc too thinks quality of life is first, food doesn't have that much influence but should be eaten in moderation. Fresh air and as little stress as possible. Few drugs, a healthy house. Life now feels, more than ever, short. I aim to enjoy the here and now, food and all. There seems to be other things to stress about-- bigger fish to fry, so to speak.",
      "MessageIndex": 24,
      "PostDate": "09/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834025",
      "Title": "Plant based, vegetarian or vegan diets for Stage IV dlb823 mkinoly"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Sep 30, 2015 07:42PM MicheTheVanquisher wrote: Oh Freebird, so sorry to hear your news yet happy to hear you have such a loving supportive group of family and friends. Cancer sucks! I hope a miracle happens and things change. I hope the radiation is relieving the pain. I hope you manage to find peace of mind and are not fearful but present in each moment and surrounded by love and joy and good times and the knowledge that your love is felt by those around you. Keep the love flowing through it all and rest assured your legacy, your smile and your you-ness will carry on. Thank you for sharing with us. Love, love, love to you. Michele",
      "MessageIndex": 2310,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Mar 6, 2017 09:51AM MicheTheVanquisher wrote: Z--thank you for posting the link MIA in the War on Cancer... I think in the long run the most important thing might be: \"The Sukhatmes hope to create a way for patients to document online the treatments they undergo. Harnessing the experience of cancer patients is also a goal of the American Society of Clinical Oncology, says Lichter, the group's CEO. The society wants to compile and analyze patient experiences nationwide to give better guidance to patients and doctors. \"There is a lot of knowledge out there, but it is locked up in individual files and records,\" Lichter says.\" Too much knowledge locked up in patient files. There needs to be an international data base on cancer treatments and results. Michele",
      "MessageIndex": 4470,
      "PostDate": "06/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Mar 29, 2015 10:05AM MicheTheVanquisher wrote: Welcome Cathy, lots of wonderful people here living active lives with liver mets and lots of information on treatments, strategies to deal with the stress of both finding out and living with the ups and downs. I don't have the same diagnoses as you but my mets, found over a year ago, are for now NED. Seems like there are new ways to attack the beasties so many different treatments for the women here. Sorry you're finding yourself on this thread and hoping for the best for you. Michele",
      "MessageIndex": 1534,
      "PostDate": "29/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jun 15, 2014 07:36PM MicheTheVanquisher wrote: Spicy, that's fantastic that your liver mets have resolved!! Hooray!!! Here's to the other tumors getting knocked to smithereens in the next two rounds! I assume it's because of chemo lowering immune response that they don't want to do surgery and then right away start a new chemo drug? I wonder what sufficiently recovered means.  I'm scheduled for round 7 on Tuesday (it sounds like boxing--in the ring for round 7 is Miche..v. ....) provided the scans show continued response in tumor size and all else looks good. This is something I never would have asked for without reading these threads--thank you all.  Keeping fingers crossed for myself and all of the rest of you...and hoping the magic bullet of treatment arrives soon.",
      "MessageIndex": 360,
      "PostDate": "15/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jan 17, 2015 10:56AM MicheTheVanquisher wrote: RonnieKay, others with pain after chemo. What is it? A year ago I had tumors and spots all over my liver with no pain and no clue I had mets but insisted they investigate an enlarged node under my arm that had been enlarged for years but then changed shape. They biopsied which led to scans and liver mets. Chemo ended May 29th with no pain in my liver even while being poked and prodded and then this fall I started getting pain in my liver area. Ultrasound and PET scan and blood tests in December showed nothing. Still it hurts. Why? It frightens me. It makes me feel like they're missing something. Shoot, maybe it's just back pain--or referred pain. I wish I knew. It's a nagging worry. Otherwise--how are people with liver mets doing? I cannot complain! The Taxotere plus Perjeta and Herceptin knocked the tumors to nothing. Perjeta and Herceptin are keeping them undetectable. Hip-Hip Hooray! Miche",
      "MessageIndex": 1051,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jan 29, 2015 12:03PM MicheTheVanquisher wrote: Syrmom, Carla, mutherflush, I\"m thinking of you and hope the chemos work on the cancer with a vengeance and leave you doing well! Wish I could give you each a big hug and a few moments of calm and an infusion of \"Zest for Life\" or something. And I agree, IMAGINING the drugs getting to all the right places might help. One day, one hour, one minute--look to the beauty that is life, however much of it we get. Syrmom, I also have muscle cramps which started during Taxotere + H&P and have continued with the H&P. Can be feet, calves, hamstrings, arms, between my jawbones, stomach and are alleviated by vigorously stretching the affected muscle but a slight movement can bring it back. Electrolytes, all blood work is good. Taking calcium/Mag doesn't help, exercise doesn't seem to influence it, can happen anytime. So I can't say I've figured it out at all. None of the docs or PAs seem to know what drugs it's from or how to treat it. The Physiatrist just gave me gabipentin in the hope it will help with the neuropathy and just in case it helps with muscle cramps. I'll let you know if it helps. He also sent me to PT thinking that better posture and movement might help. anyone else on Gabepentin for neuropathy?  ",
      "MessageIndex": 1129,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Feb 19, 2014 11:56AM MicheTheVanquisher wrote: Well, this gives me hope and inspiration. In September we packed up, moved across the country from Oregon to Maine, leaving friends and family behind for DH to do one last stint in a full time job before retirement. We bought a 1960 colonial that hasn't had a bit of updating or remodeling thinking what's so hard, a new kitchen and bathrooms, otherwise it's a lovely, well cared for house. My mom died on moving day and so the fall was filled with trips back to Oregon for Celebration of a Long Joyous Life, estate issues, etc. Then the holidays happened and it was the New Year--now, finally must be time for remodeling...oh, no, actually my remodeling with chemo drugs! ugh!!!!  It seems a bit overwhelming to start the remodel now but you've all given me a push--down to the store today to pick out a regular height toilet (we have those fashionable child height ones of the 60s) and fixtures and such. Guess I'll keep the tub I was going to take out and just work around it, tub seems like a good idea now and it's a nice old tub.",
      "MessageIndex": 6,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818172",
      "Title": "OT--Diagnosis: Bats in Belfry? Tina2 susan_02143"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jun 13, 2014 06:12AM MicheTheVanquisher wrote: It is fantastic and uplifting and hopeful to read about those of you with NEAD and NED. Keep those stories coming! So encouraging. Yea!!! for all of you! My sister came for my last chemo and stayed another week--that was heavenly since I usually take care of house, horses, and dogs no matter what's going on. But, hmmm, it was hard to let her do things--I kept having to tell myself--it's ok, you have liver mets and just did your 6th treatment of Taxotere, you can take it easy this one week. We did manage to get to Acadia National Park's carriage trails with 2 horses for a nice hack the day before she left--it was beautiful in the park and, even though I could hardly get out of a walk, a fabulous day to spend with my sister.  I was slated to do 6 rounds of Taxotere but now, if my scans this coming Monday show continued shrinking, I'll do #7 on Tuesday. That is hard to contemplate and has sent me into a spin. I was so looking forward to being done with the big T. My onc told me I was her healthiest patient and while she recommends 6 rounds she's ok with continuing based on tumor response and my response to chemo. I asked for it after reading this discussion. I've had mostly a fairly easy time. Some weakness and cramping in my muscles; mostly mild, sometimes worse, gastro distress; cracking skin; and many very tired days. Now tired and bad tasting food and a little neuropathy and muscle cramping seems to be the new norm. Oh, plus my mind has turned to mush. I think I've just settled in to feeling like crap but not terrible... so I asked for more.  SpiceyPetunia, how long will your MO continue with Taxotere? My MO wasn't reluctant but wasn't totally for it either. She's going along. Looks like we're looking at doing 8--so 2 more rounds. What's your MO's thoughts about more? ",
      "MessageIndex": 358,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jun 19, 2014 07:26PM MicheTheVanquisher wrote: My MO stopped the Taxotere after #6 because of neuropathy. She gave me a little talk on quality of life and how I don't want to have to live with neuropathy. I'm now on Herceptin and Perjeta \"indefinitely\" and waiting for the SEs of Taxotere to be over. Mostly it's lower leg and feet cramps which I suspect is related to neuropathy. It doesn't hurt so much as theirs a weird feeling when I exert my legs and when foot or calf seizes up it's hard to do anything. Well, I take care of 3 horses so it's not that I do nothing, just not the more fun stuff so much. Now I'm wondering how long it will take for it to go away so I can get back to exercise. Today it happened while I was riding my dressage horse and I've been pissed off all spring for the delay this FC has done on my horse training so that really made me mad--plus I wasn't sure how I was going to get off! Luckily it went away before I needed to dismount. Now I'm wondering how long it takes to come down from Taxotere and about SEs from Herceptin/Perjeta and exercise. ",
      "MessageIndex": 367,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jun 2, 2015 10:14AM MicheTheVanquisher wrote: Josalive, I did Taxotere + H+P for 6 rounds last year and then H+P indefinitely. With each chemo my extensive liver tumors shrank and markers went down. By the end of 4 they were about where yours is and by the end of 6 Taxotere infusions my tumor markers were way down in the normal range and liver mets were small and blackish (dying). Sure enough 2 mos later PET scans showed no activity--NED!!!. Before the end I asked about more chemo but then got the quality of life and robust immune system speech plus my tumor markers seemed to be a good indicator and my Onc really thinks 6 rounds of Taxotere plus the monoclonals is usually sufficient. The last 2 rounds of Taxotere kicked me hard. Took months to recover. My onc is big on quality of life and not poisoning the patient unnecessarily. The research shows adding carboplatin doesn't improve results (Cleopatra study I believe). She does what she can according to the latest research and asks her patients to do what they can (eat right, stay active, reduce stress). I'm still NED and am just finishing a vaccine trial and keeping my fingers crossed for more time. I feel pretty good one year out from hard chemo (like being condemned to months of hard labor). You may want to ask about stopping the carboplatin? Hang in there, your tumor is responding appropriately it sound like (heeeeelp, I'm dying!!!) Michele ",
      "MessageIndex": 1917,
      "PostDate": "02/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Aug 9, 2015 11:12AM MicheTheVanquisher wrote: Oh, Ella, have faith, find something to laugh about so you see some sparkling light while in the dark place--I guess that's all you can do til Monday. Then, we are all hoping with you that your Onc will come out with something to annihilate those liver mets. Wish I could send you some tickle juice and some rollicking puppies or your favorite comedian or something to make you howl with laughter. Hugs and Laugher!",
      "MessageIndex": 2184,
      "PostDate": "09/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jun 1, 2015 05:07PM MicheTheVanquisher wrote: Original diagnoses 5/2012. Mx with clear margins and negative sentinel node. Just a few HER2+++ cells in a tiny invasion... Mets to Liver 2/2014. NED since 7/2014. Hooray! And thank you all for posting--it's inspiring.",
      "MessageIndex": 74,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831838",
      "Title": "How long have you been Stage IV? goldie0827 dormouse"
    },
    {
      "AuthorID": "MicheTheVan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154866/profile",
      "Content": "Jan 17, 2015 04:11PM MicheTheVanquisher wrote: The pain isn't severe, just nagging--like a nasty reminder that hey, you may be NED but I'm still here... You bastard! I live with a surgeon and when I suggest to him it's from scar tissue he says, puhh, I've never heard of pain from scar tissue from tumors, and your's weren't that big, I've removed much bigger. My liver however was absolutely riddled with tiny spots of cancer and then there were several 2-3\" diameter tumors and several 1\" diameter. The oncologist did say my liver tissue was in great shape (despite my BFC daily wine consumption) outside of the tumors. Now with zilch on the PET scan and ultrasound the Doctors all just shrug their shoulders as in: what's to worry? Yeah, easy for them to say. Which is why I'm here. Sometimes the info is better and the support, oh, misery does love company.",
      "MessageIndex": 1055,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}