{
  "AuthorID": "MichelleyO",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141715/profile",
  "Posts": [
    {
      "AuthorID": "MichelleyO",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141715/profile",
      "Content": "Dec 23, 2011 08:41PM MichelleyO wrote: Hello Ladies, I have spent the better part of my day reading this blog and feel like I know you all personally.  I had my 1st T/C infusion on Dec. 19th.  So far my SE's have been pretty minimal.  Some nausea & fatigue.  I would have to say it has gone much better than I expected, but I am only on day 5.  I also had the Neulesta shot on Tues but have just experienced some achiness.  Not sure if its from the shot or my recent inactivity.  Reading about all of your experiences definately makes me feel \"normal\".  It is weird to feel so \"alone\" sometimes when I am surrounded by so much support.   I look forward to keeping track of all of your progress and pray this will be over for all us soon.  Wishing all of you a very Happy Holiday filled with love & \"good days\".",
      "MessageIndex": 297,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "MichelleyO",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141715/profile",
      "Content": "Dec 27, 2011 12:50AM MichelleyO wrote: Hello Ladies, I survived the wig shopping although I didn't buy one. Just couldn't commit. I didn't realize how expensive they were.  I am going to check with my Ins and see how much they cover.  I just hate to spend that much if I'm not even sure I will wear it often. Josie..Thanks for the Zofran suggestion.  I actually had some from my surgery and it seemed to work well.  I had been using Compazine and don't think it was as effective. CKK..Thank you for the Ginger Tea recipe.  I will definitely give it a try.  Sorry you are feeling bad.  I also struggle with the unpredictability of these darn SE's.  So difficult to plan anything. Annie, Robin, Heather & others dealing with scalp issues..My Onco Nurse suggested T-Gel shampoo for the scalp.  I know its a medicated shampoo. May be worth looking into. Good luck to BaileyBump & Heather tomorrow.  You will be in my thoughts & prayers.  Here's hoping for a good day tomorrow with little or no SE's for us all.  xxoo",
      "MessageIndex": 342,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "MichelleyO",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141715/profile",
      "Content": "Dec 27, 2011 07:56AM MichelleyO wrote: On my way to buy a wig.  I've been putting it off.  Wish me luck!  ugh!",
      "MessageIndex": 336,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "MichelleyO",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141715/profile",
      "Content": "Dec 26, 2011 02:56PM MichelleyO wrote: Merry Christmas Ladies! Hope you all had a wonderful day with family & friends. ckk- so glad your nausea is better. That is something I am dealing with on a daily basis right now. BJMRN- Hope you are feeling better by now & were able to enjoy your weekend. Josie- Looks like we are on the same chemo schedule.  Also the same age!  I turn 40 on Jan 12th.  Not feeling so Fabulous & 40 this year!!  I too have had bad body aches & will give that gel a try. Heather- So glad you were feeling good & able to enjoy your Christmas with your little one.  So exciting to see the wonder in their eyes. I have an 8 yr old daughter & can't imagine life without her. Kimdy- I have been very emotional this weekend too. Its so much to take around the holidays. I havent bought my wig yet, but think I better get on it this week. Good luck this week with your 2nd tx. Momof3boys- Good luck with your tx this week. Remember to hydrate yourself real well prior to infusion. I havent had any problems with my nails yet. Bring it up to your nurse, they should be able to give u good advise. Has anyone else noticed any kidney pain? I feel like my are throbbing. I drink water all day but it is real noticable at times. Any tips for nausea? I can't keep anything in my stomach. My days are filled with constant trips to the bathroom. So annoying! I wish you all a great week full of no SE's. Thanks so much for being there. So nice to have such a great group of women who really know how you feel. xxoo",
      "MessageIndex": 318,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    }
  ]
}