{
  "AuthorID": "MichelleLak…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
  "Posts": [
    {
      "AuthorID": "MichelleLak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
      "Content": "Oct 18, 2012 09:00PM MichelleLakshmi wrote: Kskier - point well taken on the stress factor. The ultrasound showed no clots or sign of infection around the port or catheter... So everything internal is a-okay. I'm definitely leaning towards stress at this point, too. Heidi - love to hear that you have been living with NED for three years now! That is phenomenal. I truly hope for continued NED-status at your next scan. Selfishly hope some of your good luck rubs off on the rest of us, too!! Thanks for the strength, ladies!",
      "MessageIndex": 8,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795139",
      "Title": "Triple negative, stage IV out there? MichelleLakshmi Claudine"
    },
    {
      "AuthorID": "MichelleLak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
      "Content": "Dec 9, 2012 07:34PM MichelleLakshmi wrote: Thanks for your post, Debbie! I'm definitely in a much more positive place now, though I know there will be ups and downs throughout this journey. I've returned to work and so far my treatment has been going well. We found a 9mm lesion in my brain since my first post, so I have had gamma knife plus 5 sessions of chemo so far (Abraxane). I will have my first scan on December 21, and know that I can just take it a day at a time from here until then and even after that. Of course, still hoping for positive results! :)",
      "MessageIndex": 15,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795139",
      "Title": "Triple negative, stage IV out there? MichelleLakshmi Claudine"
    },
    {
      "AuthorID": "MichelleLak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
      "Content": "Dec 27, 2012 11:00PM MichelleLakshmi wrote: Claudine, sorry you have to join us here. It is hard at the beginning, but it truly does get easier. There are up and down days.. You come here and talk to the wonderful women who know what you're going through and you will find support. Don't be shy, say everything... Also, once you have a starting treatment in place and you are underway, you will feel so much better. I know I did. It was hard being stuck in that limbo, fearing that time was just slipping away. It will get better. One day at a time. Xoxo",
      "MessageIndex": 19,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795139",
      "Title": "Triple negative, stage IV out there? MichelleLakshmi Claudine"
    },
    {
      "AuthorID": "MichelleLak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
      "Content": "Oct 20, 2012 09:28AM MichelleLakshmi wrote: Bak- I think I will have some sort of bone stabilizer added at some point. Not exactly sure if it will be zometa. Barbara, Cathi & Tonya - thank you for sharing your experiences and helping me understand how normal my fears and anxieties are right now. You all are wonderful! Xo",
      "MessageIndex": 13,
      "PostDate": "20/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795139",
      "Title": "Triple negative, stage IV out there? MichelleLakshmi Claudine"
    },
    {
      "AuthorID": "MichelleLak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
      "Content": "Oct 18, 2012 07:24PM MichelleLakshmi wrote: Lotusblossom, LuAnn, Terry & Mary, Thank you so much for responding and helping to calm some of my fears tonight. The mornings and the evenings are the hardest! I've always been such a strong, independent woman and I am ready to get back to feeling that way. Even though my dear husband and wonderful family and friends surround me with love and support, this feeling of isolation can be overwhelming at times. Thank you all for sharing this journey with me... And truly understanding what it feels like... Peace and love to you all...",
      "MessageIndex": 5,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795139",
      "Title": "Triple negative, stage IV out there? MichelleLakshmi Claudine"
    },
    {
      "AuthorID": "MichelleLak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
      "Content": "Nov 9, 2012 01:22AM MichelleLakshmi wrote: Cynthia, I am so sorry. Just here to hear you. I am dealing with what we should do right now, should I file for disability so I can start that 2-year waiting period for Medicare? If so, then start paying cobra for insurance which would be $580/month for me!! And disability payment would be less than a third of what I make now. This is all so overwhelming, frustrating and frankly disgusting. I never thought I'd be 38 years old and facing these questions and decisions.",
      "MessageIndex": 1,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796100",
      "Title": "OMG - My health insurance is going up $200 a month!!! Cynthia1962 MichelleLakshmi"
    },
    {
      "AuthorID": "MichelleLak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
      "Content": "Nov 24, 2012 02:24AM MichelleLakshmi wrote: Thanks, ladies. My hair is still coming out more than normal, but not in huge clumps. Scalp is a little itchy, but not very tingly. I had gamma knife treatment 3 weeks ago and still have some numb areas from the lidocaine, so that doesn't help! As I do/did have a lot of hair normally, I'm just trying to hold out. One of my toenails split when I was fiddling with it the other day (thanksgiving, actually), though there was no pain or sign of fungus. I clipped it short for now and filed it as I'm not sure what to do! Since everyone at my Dr's office is out for the weekend, I'll talk to them on Monday when I'm in for my infusion. Sure hope that the abraxane is doing its job for me and that after my first scans in about 4-5 weeks we see some stability like Stephanie and surfdreams report! Waiting is so difficult... Hope you all had a nice Thanksgiving (if you're in the US)!",
      "MessageIndex": 15,
      "PostDate": "24/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796182",
      "Title": "Nails and Abraxane.. Travelingpants2 SAMayoFL"
    },
    {
      "AuthorID": "MichelleLak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159842/profile",
      "Content": "Nov 18, 2012 08:45PM - edited Nov 18, 2012 09:11PM by MichelleLakshmi Ladies, Thanks for your insight. I'm about to go in for my third infusion of Abraxane tomorrow and my MO told me that my hair would definitely fall out. This is my first chemotherapy treatment, so I have no other frame of reference at this time for what to expect. I have noticed that there seems to be more hair coming out in my brush, but no scalp tingling or large clumps. I'm afraid to shave my head too soon, but don't want to wait until its coming out in droves as I know that will freak me out. Advice??? The nails are also something I was unaware of. My MO told me to 'report any changes', but geesh, sounds like she undersold that! Is there pain prior to the nails becoming brittle?",
      "MessageIndex": 12,
      "PostDate": "18/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796182",
      "Title": "Nails and Abraxane.. Travelingpants2 SAMayoFL"
    }
  ]
}