{
  "AuthorID": "Mickey527",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6750/profile",
  "Posts": [{
    "AuthorID": "Mickey527",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6750/profile",
    "Content": "Mickey527 wrote: It has been a long time since I posted. I tried to \"forget\" everything for a while but it is impossible to forget the BC, the surgery and the lymphedema. I am doing better now that I am on permanent disability. I was working as a nurse but between the neuropathy in my hands and feet and the lymphedema in my right arm I couldn't even open a bandaid wrapper. And lets not talk about all the charting that is required. the neurologist started me on some antidepressants which helped some. I am waiting for SS to get approved, but my disability insurance company takes care of all that, I don't have to go and apply and reapply. But the good news is I get to stay home and babysit for my new grandson whenever they need me. I am tired alot but I get to sleep when Nicky naps. I have been wearing my sleeve and gauntlet daily and doing my own self massage. I got a JoVi for nights and it helps some. Most of my swelling is under my armpit and chest. I have a bellisse bra but it cuts into the area that swells and is sometimes painful to wear. I am seeing the specialist at the store tomorrow to see if there is anything I can use for the swelling in the underarm. It always feels like I am burned under my armpit near the node surgical site. I need to get back to my therapist for massage because I am not draining the underarm as well as she can no matter how I try. I am going to try to catch up on all that I have missed while I stayed away from the boards. I am glad to see that some of you who helped me out with information when I was newly diagnosed with the lymphedema are still here to help others and maybe even answer some of my questions. None of my doctors know anything about lymphedema and have admitted it to me so I have to depend on you when I need help. Peggie Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "24/10/2006",
    "ThreadURL": "https://community.breastcancer.org/forum/64/topics/451095",
    "Title": "hi everyone Mickey527 sccruiser"
  }]
}