{
  "AuthorID": "migallen",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
  "Posts": [
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 8, 2011 09:56AM migallen wrote: I decided on having a BMX with permanent implants put in immediately.  the cancer was only in one breast, but I decided, hey if I'm going to go down this road, then I'm only going to do it once. So, yes I had the BMX with implants put in (No TEs) because I went from a 36dd to a B cup.  It's been 13 days since my surgery and I do feel some discomfort, but the pain is bearable, especially with all of the meds my docs have given me. My surgeon says no radiation for me, but I do meet with oncologist on Friday to be put on tamoxifen and whatever else she feels I may need.  Luckily, we did not get a lot of push back from my health insurance company, they have been pretty good. Lizzymack, I hope you are doing ok? How are things for you now? min",
      "MessageIndex": 22,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764533",
      "Title": "Who decides whether you qualify for a BMX? pejkug3 littleamazon"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 8, 2011 10:25AM migallen wrote: Also, I am so glad that I stuck to my guns, because the BS wanted to do a lumpectomy with snd and I said No, do the bmx.  So, during the surgery, she was able to get a 2mm clear margin up to the chest wall.  So, I am so happy that I did not let anyone make me double guess or doubt my original choice. best to you all min",
      "MessageIndex": 24,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764533",
      "Title": "Who decides whether you qualify for a BMX? pejkug3 littleamazon"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Apr 26, 2011 01:29PM migallen wrote: uh-oh, am I doing something wrong Maria?  I have a port and my physical therapist at the Cancer Institute is having me do arm curls, row-like exercises and the plank (yoga) and other upper body exercises.  I wonder if maybe I shouldn't be working my upper body.  Although I prefer to work the lower body. How are you doing?  I finally got the anti-cancer book in the mail on Saturday. hugs, Min",
      "MessageIndex": 544,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 25, 2011 02:45PM migallen wrote:",
      "MessageIndex": 13,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762656",
      "Title": "My MRI Results migallen julie75"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "migallen wrote: Ok, I need to take a very deep breath.  My BS just emailed me saying that she viewed my MRI, she also said that the 1 cm mass (we already know that one is cancer)  has a 3cm surrounding enhancement around it, and that 3cm could be cancer.  OK!  What does that even mean???? Is my cancerous tumor 1 cm or is it 3cm now? And wouldn't the MRI be able to say definitively if the 3cm surrounding enhancement is cancer?   Have any of you ladies received this type of dx?  I'm not sure why she's only giving me part of the dx, maybe she's waiting for our next appt on january 7.  This waiting su*ks big time.  Thank you all for reading, my thoughts go out to all of you.  I feel like you all are my life line Min bmx w/recon on 1/27/2011. Start 4 cycles of AC on 3/18/11. Followed by 12 weeks of Taxol. 33 rads Dx 12/17/2010, IDC, 1cm, Stage IA, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762656",
      "Title": "My MRI Results migallen julie75"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Dec 31, 2010 09:39PM migallen wrote: Thank you Taranebraska, Julie and Beacon, I see the BS this Friday.  I know that my pathology report also stated other grayish areas.  I think you all for you support and I know that I will get through this.  I'm so thankful for all of the support I have found on this site.  Happy New Year to you all, Min",
      "MessageIndex": 7,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762656",
      "Title": "My MRI Results migallen julie75"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 24, 2011 02:49PM migallen wrote: Well, I was just reading my MRI report and in the comments section there's a statement that says \"slightly prominent Left Axillary Lymph Node\".(My cancer is in my left breast). Does anyone know what that statement means? The size is 1.5 cm x .9 cm.  I'm hoping that my worst fears aren't coming true.  Oh well, just one more thing that I need to battle I guess. Min",
      "MessageIndex": 9,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762656",
      "Title": "My MRI Results migallen julie75"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 5, 2011 11:06PM migallen wrote: Thank you Julie, boy it just seems like something new just keeps popping up, and I just have to deal with it as I go along. The bmx with recon went really well, it was over in 2 1/2 hours. unbelievable.  I hope you are all well, Min",
      "MessageIndex": 15,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762656",
      "Title": "My MRI Results migallen julie75"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Apr 22, 2011 07:39AM migallen wrote: Well, I had a bmx in January and at that time my surgeon said I would not need to do radiation or chemo.  However, after the surgery was completed, I was told that I would have to have both chemo, followed by radiation. Chemo because my onco type number was 30, radiation because the cleanest margin they could get was .2 mm.  Have you asked your dr about getting the oncotype dx?  I don't regret my decisions, you just have to throw everything you can at cancer to beat it down. Oh and I am 47.  Best of luck to you, Min",
      "MessageIndex": 5,
      "PostDate": "22/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/767921",
      "Title": "have idc - radiation? yes/no bethannhg Curlylocks"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 17, 2011 07:12PM migallen wrote: I had my bmx with immediate recon on 1/27/2011 and did not need assistance what so ever when I had to use the rest room, I was able to wipe myself.  Huge relief. I too suffered from constipation afterwards, but trust me, prune juice worked for me, not the stool softeners.  Just know that you will do fine.  It's the unknown that always freaks me out. best of luck to you, min",
      "MessageIndex": 6,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764964",
      "Title": "The little details after mastectomy fluffqueen01 JO-5"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Dec 29, 2010 11:07AM migallen wrote: Thank you Lovegolf, 1badboob, Barbe and Michelle, yes, I will also to reconstruction after the BMX, but I am still waiting on my tests to see if it's in the nodes.  I've looked in my closet and have decided that I need to move all of my button up shirts and pants on the bottom rack for easy access.  I can't thank you all enough for your answers and suggestions and Lovegolf, I will definitely go to the salon to get my hair done, that's a great idea.  OK, so I will give up control and allow others to help, I know they want to help, but it's hard for me to accept it.  But I will, thank you ladies so much. Ah, I think I'll also have to sleep on the couch downstairs or have a recliner moved upstairs. Min",
      "MessageIndex": 7,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762607",
      "Title": "going at it alone? migallen migallen"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 8, 2011 02:46PM migallen wrote: Sue, here's wishing you a favorable outcome.  I will be checking  back on Thursday to hear your news.  Praying that everything goes well.  You will find a wealth of information here, everyone here is caring. min",
      "MessageIndex": 8,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764570",
      "Title": "MRI done today SueI12345 Betterwannabe"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 17, 2011 06:21PM migallen wrote: Hi Geogal, My BS had recommended lumpectomy with snd for me.  However, i flatly said no, thank you I'd prefer a bmx because my cancer was grade 3, strong family history and very dense breasts.  I don't regret my decision.  I'm the type of person that wants to get everything done at once. So I figured, if I'm going to do this, I'm going to do this once.  But that was my reason. Each person has their own personal reasons, and please make sure that you choose the decision that is right for you.  I wish the very best for you, Mignon",
      "MessageIndex": 4,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765075",
      "Title": "What were the reasons that you had a MX versus a lumpectomy geogal anneflorida"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "migallen wrote: Hello everyone, I have a few questions and would appreciate any answer you feel like giving.  I will have a BM in mid-january and two of my children have moved out and are on their own, as they should be.  I have a 14 yo daughter at home with me.   I don't want to be a burden on my children, will I need their help? And if so how much?  I guess I was hoping to be able to get through the surgery and the aftermath pretty much on my own.  I may have the 14 yo stay with her dad while I go through the process. Has anyone gone through the process alone, or did you need help from family and friends? Thank you, Min bmx w/recon on 1/27/2011. Start 4 cycles of AC on 3/18/11. Followed by 12 weeks of Taxol. 33 rads Dx 12/17/2010, IDC, 1cm, Stage IA, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762607",
      "Title": "going at it alone? migallen migallen"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Dec 28, 2010 05:44PM migallen wrote: Thank you Paula, I know the kids will not mind one bit, so I will ask for their help. My best to you, Min",
      "MessageIndex": 2,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762607",
      "Title": "going at it alone? migallen migallen"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 14, 2011 04:38AM migallen wrote: I was really afraid of the pain, but it didn't hurt as bad as others had made it out to be.  But as a precaution, I did take a loratab an hour prior to the removal.  It's done so fast.",
      "MessageIndex": 8,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764846",
      "Title": "drainage tubes geocachelinda barbe1958"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 18, 2011 11:11AM migallen wrote: Hi Cindy, Just wanted to let you know I'm thinking of you, so sorry about the positive lymph nodes.  You just hang in there ok? Min",
      "MessageIndex": 242,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 18, 2011 11:15AM migallen wrote: To Renee, Claire, Jorga, Terry,Vicki and CJ, My thoughts are with you all this week as you undergo your surgeries.  All will go well. Min",
      "MessageIndex": 243,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 28, 2011 10:05PM migallen wrote: Hi ladies, I am back home.  Had the bmx with recon yesterday.  Everything went smoothly.  Ithought it was going to be a 6 hour procedure, but it was over in 2-3 hours.  I'm now a full b cup, used to be a double d. Ok, I did experience nausea and vomiting, so they gave me something for that.  I was given percoset for the pain, but it didn't really help, so they now have me on valium and hydromorphone and it works great. also am on antibiotics. They did a lympocentogram, and guess what?  they did the wrong side, so I had to have done again on the correct side.  Honestly, that wasn't painful for me.  I haven't been able to eat much.  The ps says my drains can come out on monday, thats only 5 days from surgery. yay. All the stuff I packed, I didn't even use.  I'll keep you posted on more, good luck to all, Min",
      "MessageIndex": 362,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 31, 2011 07:43PM - edited Jan 31, 2011 07:44PM by migallen thank you fuzzylemon for posting, I would be interested in anything you'd like to share.  I think everyone here will listen. Sue I am still loopy.  My kids just smile at me and tell me that they love me.  I tried to tell them of my angel story, but they are skeptics and I really believe that there was an angel by my side that day 5 days ago, taking away my pain and helping my surgeons as my bmx with recon was over in 2 1/2 hours. cindy in NM that is an amazing story in the recovery room, I hope you are ok now? we are strong women, we are warriors and we are survivors. Let us not forget that. edited for wordiness :) Diagnosis: 12/17/2010, IDC, 3cm, Stage II, Grade 3, 0/1 nodes, ER+/PR+, HER2-",
      "MessageIndex": 400,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 7, 2011 03:57PM migallen wrote: hi mdg and supersally, I finally got my drains out today 12 days after surgery. 1 drain felt uncomfortable, but the other I didn't feel a thing. Well, I meet with my oncologist this friday.  I think it's because my clear margins were something like 2mm to the chest wall.  I will know more later. All I want to do is sleep.  I can't eat, although I did eat about 1 cup of food during superbowl yesterdaY.  Supersally, what worked wonders for me was prune juice, boy did that work :). How are all of you ladies doing?  Anyone gone back to work? I'm going to try to stay out for another 3 weeks just to see how I do on that chemo. Redsky, why is there a delay? thinking of you all mignon",
      "MessageIndex": 492,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Nov 22, 2011 11:04PM migallen wrote: Ugh, today is my last radiation treatment, 33 in all.  Yes I have severe burns from radiation.  I would categorize it as 2nd degree burns.  I am experiencing bleeding under the breast area.  I was given hydrocodone for the pain and silvadene for the burns.  Are they helping?  Just a little bit.  I'm extremely uncomfortable, but what the heck, I have to get through it right?  thanks, Min",
      "MessageIndex": 48,
      "PostDate": "22/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736027",
      "Title": "Severe radiation burns to the breast RCindy"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 24, 2011 02:45PM migallen wrote: Thank you Vikki.  How is your day coming along? Ladies I know how you feel, you want everything to be ready and perfect before you go in, that's the  wanting to take care of everything side of us women.  I told my fiancee that I needed to clean the kitchen and he said, no, don't do it.  Your famiily and friends want to contribute, they need to contribute, so let them clean the kitchen (there's like 10 dishes in the sink). Ladies, everything will be fine.  The hard part for us, is to allow others to take care of us when we've been taking care of everyone else.  I go in in 3 days.  I'm doing ok right now.  Although today seems to whizzing by and I wish it would slow down a bit. I like what you wrote Sue, just keep on swimming.... Min",
      "MessageIndex": 308,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 26, 2011 04:55PM migallen wrote: Well, I'm ready as I'll be for my surgery tomorrow.  I did spend a great morning with my 14 yo dd, we shopped some, painted our toes and she helped me get a room ready for my incoming family.  I've been pondering what about this journey scares me the most, and I've decided that being a control freak, my control is going to be taken away from me while I'm in surgery for 6 hours.  There won't be any more last minute checking in here to see, \"oh what does this mean\", etc.  I hate that I will feel as vulnerable as a child.  I know my surgeons will do a wonderful job. I'll try to post tomorrow morning before I go in, I have to be there at 6:00 am.  Ladies, I'll be checking in on you all later.  Min",
      "MessageIndex": 333,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 30, 2011 11:45PM migallen wrote: Ladies having surgery this week, I wish you all good luck.  I too am having problems with going \"poop\", my last resort now is prune juice.  I had the bmx with recon on Thursday and am now cutting back on the pain meds.  The PS wants to remove the drains tomorrow, so I will definitely take the pain meds for that, as I hear it is uncomfortable. I did unwrap my ace bandage to take a quick peek at my new breasts, and even though they sit up high on my chest for right now, they look pretty good. My advice to you ladies is please get plenty of rest, don't over do it, just because thepain starts to ease off a little.  relax and let others spoil you.  I cannot tell you, how blessed I feel, I just never knew how many people actually cared about me. Barbara, redskyatnight, slinky and Dmho, you ladies will be in my thoughts tomorrow.  You will all do great. Min",
      "MessageIndex": 389,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 5, 2011 11:12PM migallen wrote: Quick question, how long are we supposed to wear these sports bras?  When can we wear normal bras? min",
      "MessageIndex": 473,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 8, 2011 08:04PM migallen wrote: Hi Gummyworm, I don't have TEs, the ps put in permanent implants and yes I have numbness and I  believe it's there for good.  I have a little sensation in my right breast, but no feeling on my left breast.  I see my PS on Friday, but I do believe the numbness is permanent. Maybe that's not the case for others? min",
      "MessageIndex": 506,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 11, 2011 01:25PM migallen wrote: Jackie, I'm so sorry to hear of your pain and sorrow.  But if you feel like crying then let go and cry and scream if you have to, you will feel better.  My dr gave me xanax the day she gave me my dx because I wasn't sleeping.  Its been 15 days since my bmx with permanent implants, the drains are gone, but I still have not driven and I still can't sleep on my sides.  I try but it is much too painful.  I see the onc today for the first time, another fun day! Ladies, we are getting through this and we will get through this with the love and help from our friends and families and especially you all since we all know what we're facing. Mignon",
      "MessageIndex": 537,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 12, 2011 02:13AM migallen wrote: I saw the onc today for the first time.  I really thought she was going to recommend chemo, but so far she's not.  She is ordering oncotype dx testing that will test my tumor to see what the chances are of me developing cancer again.  I will also be seeing a radiologist soon.  So basically, more waiting around for me. Yuck.  I have to admit, it was weird sitting in the waiting room because I was the youngest person there (even though I don't consider 47 young).  I'm 15 post bmx with immediate recon and I still am having pain and discomfort, but it is nothing like it was a week ago. sweet dreams to all Mignon",
      "MessageIndex": 544,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 11, 2011 11:36AM migallen wrote: Good morning, I just got my blmx surgery date too.  It's January 27, so please add me to the list.  It's amazing to see how many women are on this list each month.  Also, I'm a 36DD and I spoke with my PS, he said since I want to go down to a small C, he might be able to do the implants right then and there and forego the tissue expanders.  Has anyone here ever done that?  Is that even possible? My best to all of you ladies. Min",
      "MessageIndex": 175,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 11, 2011 12:46PM migallen wrote: Hi Mdg, Yes, I know I need to get physically moving within the next two weeks.  So, I would say yes to you :).  Please motivate me. For the ladies that have their surgeries this week, I wish you a fast and painless recovery and for the women that have had it in the past two weeks, how are you doing and thinking of you all. Wishing you all the very best. I agree with you Mdg, let's show off our new bodies with pride in the summer. Min",
      "MessageIndex": 177,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 12, 2011 11:26AM migallen wrote: Hi Cindy,  How are you doing?  Thank you so much for posting.  Are you able to walk around much or do you need help?  I'm having my blmx on January 27 and wow, look at you!  You are an inspiration as are all of these women, Min",
      "MessageIndex": 192,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 13, 2011 12:39PM migallen wrote: Dear Gutsy, Laurie and Alice, Thank you so much for posting and keeping us (pending ones) apprised on your progress.  I find everything helpful and believe me I'm taking notes, my blmx with recon is in exactly two weeks.  I keep hearing about sports bras, so I guess I will go shop for one this weekend.  I wish all of you a speedy and painless recovery (if that is even possible).  You women are truly an inspiration. God bless, Min",
      "MessageIndex": 202,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 24, 2011 11:36AM migallen wrote: Well, my bmx with recon is on Thursday and I'm having a boat load of family coming in on Wednesday. I don't really know what I'm feeling.  I pre-registered at the hospital on Saturday,I have my bag packed (button up pjs, socks, zip up sports bra, book).  I feel like I'm in a holding pattern, justing waiting for surgery. I Thank all of you brave women for continuing to post your results, you are an inspiration. Min",
      "MessageIndex": 302,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Mar 7, 2011 06:34PM migallen wrote: Hi Lindy, Have you met with an oncologist yet?  Your bs should have refered you to an oncologist.  At that point your oncologist will discuss further treatment with you.  hugs, min",
      "MessageIndex": 2,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/765885",
      "Title": "Should I be having chemotherapy? lindylounz lindylounz"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 25, 2011 05:53PM - edited Jan 25, 2011 06:14PM by migallen Best wishes to you Kelly.  My thoughts are with you. Barbara, I know how you're feeling.  My BRCA came back negative and I was so happy because I knew that my daughters now wouldn't have that gene.  I am still moving forward with the bmx w/recon even though the right breast doesn't show any cancer. Cmblastic, please let us know how your evening without drains go.  Good for you! Alice thank you for your honesty.  I appreciate that. Thank you Maria, you are also in my prayers.  We are going on the same day!  We are going to be just fine. Kelly, Sue, and Kwhtmo, best of luck to you tomorrow.  I will be thinking of you ladies.  (edited for spelling errors :)",
      "MessageIndex": 328,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 29, 2011 11:34PM migallen wrote: Maria, so glad to hear that you're back home, and that you have someone so knowledgeable to take care of you.  Even though you might start to feel better, try to get a lot of bed rest.  I know I'm trying to do the same thing too, but I think I over did it today, I had about 6 visitors and I was really exhausted. I really wish that I had worked on my core and strenghtening my legs prior to the surgery. But all in all, two days after the bmx my pain is very manageable. Vikki, sounds like you are doing great, good for you. I think I'm getting my path report on friday so we shall see if I need chemo or rads. Night ladies. min",
      "MessageIndex": 367,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Jan 31, 2011 03:21PM migallen wrote: Hi Cindy, just thinkingof you and hope everything goes ok.  How was physical therapy? I just got back from the PS and unfortunately, he would not remove the drains as there was still too much fluid, I felt depressed and almost cried.  He asked if I had brought a sports bra, which I did, I brought a 36c ('cause normally I'm a 36dd), well, the sports bra was too small, they said I would need something smaller and tighter. bummer.  I see him on wednesday and hopefully the drains will come out. How are you Maria and Vikki, and Terry?  And for that matter, everyone else? min",
      "MessageIndex": 393,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 4, 2011 03:33PM migallen wrote: I just met with my BS, it's been 8 days since my bmx with recon.  she gave me the results of the path report, and I'm a little scared of what she told me.  The report says that the closest margin involved was 2mm of the chest wall.  I guess I will learn more when I finally see an oncologist. Will I need chemo? I am feeling better, but my appetite is still gone.  How are the rest of you doing? Min",
      "MessageIndex": 452,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 4, 2011 03:39PM migallen wrote: Maria, so happy for you, you sound amazing. Good for you! I so totally craving a hotdog with onions and mustard right now. Proud of you girl and all us other women who are enduring this time in our lives. min",
      "MessageIndex": 453,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "migallen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116135/profile",
      "Content": "Feb 17, 2011 03:00PM migallen wrote: Maria - I'm sorry you're having bad days.  You're right bc sucks big time.  it changes everything.  I got engaged on August 4th and bam started getting tested for bc in september.  so my wedding plans are on complete hold.  I don't know yet about the chemo or rads for me, but I'm sure they are in my future. DMHO, how are you doing?  You said you had to go back into surgery?  Did everything turn out ok? Redsky, I'm sorry to hear you're still under the weather.  I know you want to get this over and done with. Mary, I wish you a successful surgery, I didn't have the flap just the bmx with immediate recon with implants.  My thoughts go out to all of you ladies. Mignon",
      "MessageIndex": 577,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}