{
  "AuthorID": "milehighgir…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
  "Posts": [
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Feb 24, 2014 07:27PM milehighgirl wrote: Hello ladies, newbie here so forgive me if I ask questions previously asked! Lymphedema just crept up on me and has now landed in one leg.  The last two days it looks like it may be moving into the other leg.  I've been really discouraged and depressed about this.  I'm all by myself so if I lose the use of my legs I'm toast. I do the exercises faithfully that the LPT has given me and wrap the leg the way I'm supposed to.  So many of you are doing heavy duty exercises.  Did you start where I'm at and build up to where you are now?  It's amazing that in about 6-weeks time I'm barely able to walk when I was able to take the stairs two at a time!  Is there hope for me to also build up to where you are now?  Need some encouragement! Sue",
      "MessageIndex": 4524,
      "PostDate": "24/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 11, 2014 10:22AM milehighgirl wrote: What a neat idea Lia.  I wonder if soaking in Epsom salts would do the same.  I think I might try it tonight.  My legs are swollen, even though they've been wrapped.  This therapist sounds terrific.  Keep sharing!!!! GMA, it does stink we have to keep going through this.  I was told that my swelling would go down as I went through rads.  I know it's been just under a week.  I'm hoping it's not going to take weeks or months for the rads to kick in and start working.  Praying you get a reprieve from all of this! Sue",
      "MessageIndex": 4573,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 8, 2014 07:28PM milehighgirl wrote: Glennie, my PT suggested Spanx.  I haven't tried them because she said while they work well, they're a \"B\" to get on.  I don't think I couild stand having something on that was that tight.  But worth a look.  Sue",
      "MessageIndex": 5004,
      "PostDate": "08/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 24, 2014 05:06PM milehighgirl wrote: Thank you Carol!",
      "MessageIndex": 5071,
      "PostDate": "24/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 27, 2014 11:06AM milehighgirl wrote:  Well I just lost everything I've written the last 5-minutes.  Will try again. Carol, so sorry to hear about all you're going through.  Tell your friend it's not over 'till it's over.  Doctor's are simply the messengers.  God has the real answers.  I'll be praying for you, your parents and your friend for the duration. I finally got in to  see the PT yesterday.  We did the massage and wrapping.  She taught me how to do the massage and it does make a difference.  Carol, I still swell more after I exercise.  I'm wondering if I'm just doing too much.  Now I exercise, elevate the leg afterward and massage the fluid up and out.  It is making a difference. Binney, I agree that gardening is huge when it comes to exercise.  I want to know how you're cooking your beets and cooling them for a snack.  Aren't they mushy after you cook them?  Share, share, share what you're doing with the beets!  I want to try it. I also have a friend who swears by the Epsom salt soaks for the hands and feet.  He has cured his neuropathy by soaking daily.  I'm going to give it a try today and then see if I can get the swelling down far enough so as to give myself a pedicure.  Doesn't that count as exercise?  ha ha. Sue ",
      "MessageIndex": 4626,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 28, 2014 12:18AM milehighgirl wrote: Binney, thank you for the instructions.  Can't wait to stop at the produce store on the way home tomorrow!  Swelling is going down as I do the massage.  It's pretty easy to do so I am able to do it more often.  I was put on the diuretics several months before the blood clot but I actually don't take them very often for a variety of reasons. ( I forget.  I have 14 other pills to take today.  Can't keep running to the bathroom at work so can't drink the required water, etc., etc., etc.,).  I've been pretty faithful doing the Lebed exercises.  Mostly upper body and breathing which my PT says is the very best for us to do.  Lots of oxygen!  I'll work up to the rest of it as I go along. Sue",
      "MessageIndex": 4639,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "May 2, 2014 05:32PM milehighgirl wrote: Jeannie you are indeed lucky to have Sherry come to your class.  Everyone and their mother likely has recommended books and literature to Sherry but I'm just about finished with a newly released book (March) called \"Radical Remission\" by Kelly Turner.  It is an awesome book and she's one of the first to collect research on people who have healed themselves of all kinds of cancers.  Her data is from people she's talked to all over the world.  I've been recommending it to everyone who will listen, lol.  The last guy I recommended it to took it to one of his classes and the entire class went online and ordered themselves a copy! Anyway, just a thought.  Sue",
      "MessageIndex": 4736,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 22, 2014 11:42PM milehighgirl wrote: Carol, I bookmarked all of the Lebed openings.  I think there are 10 of them.  I also went to the website to look at ordering the DVD but wasn't sure which one it was.  Could you please post the link to the right one? I'd like to know how you're all doing these exercises.  I have trouble walking along with breathing issues.  I'm having another surgery next week to hopefully take care of the lung problem so maybe that will help with the exercise.  It's hard to exercise when you can only go two steps without feeling like you're going to pass out.  I do try to force myself to do the walks and such but end up with more swelling.  I do have the bands and use those here and there.  Haven't been able to do the rebounder because of the breathing.  Any ideas of what else I could do?  I'm especially interested in trunk/abdomen exercises. Thank you all!  Sue",
      "MessageIndex": 5063,
      "PostDate": "22/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Feb 24, 2014 11:02PM milehighgirl wrote: Thank you Carol.  I'll go through the links when I get home from work tomorrow.  Hoping this is short lived!  Sue",
      "MessageIndex": 4527,
      "PostDate": "24/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Feb 28, 2014 09:57PM milehighgirl wrote: gmafoley, all of you are way ahead of me on the LE.  I'm going to pray that an answer comes fast for you.  My left leg went down a hair this morning but I noticed that my right foot had some swelling that wasn't there before.  Grrrrr.  I think I'll set the alarm for early tomorrow morning and do some easy exercises. Sleep well all.  Sue",
      "MessageIndex": 4535,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 22, 2014 04:57PM milehighgirl wrote: Okay ladies.  I don't know how you're doing all these exercises without things getting worse.  I emailed my PT today to ask about what might work to get the fluid moving again.  All the exercises I've done and what she's given me have made the leg more swollen to the point I can't bend my leg to reach my foot to put a wrap or sock on.  Eeeeek!  Also waiting for the blood thinning shots to start working on the blood clot.  Anyone know how long that might take before some of the swelling goes down?  I'm nervous about the leg being so swollen.  Also done the diuretics today and lots of water along side the exercise and walking.  Getting discouraged. Any and all ideas are welcome.  Keep up the good work!  Sue",
      "MessageIndex": 4618,
      "PostDate": "22/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 23, 2014 09:27PM milehighgirl wrote: Wonderful ideas ladies.  Thank you!  Sue",
      "MessageIndex": 5069,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Apr 9, 2014 08:16PM milehighgirl wrote: mnm, when I was taken off the hormone blockers last June and went back to chemo, the weight that wouldn't budge dropped off of me very quickly.  That was pre-LE.  The only weight I've put back on is the 20 lbs of lymphatic fluid that I have trouble moving out of my leg.  My LE pump is due here Friday and I can't wait for it to get here.  Should make a huge difference in my swollen legs and a lot easier than trying to do the manual myself.  I would love to be able to go back to my long walks but I can barely walk now. I'm also convinced that my LE got worse when I had radiation to the tumor in my LE leg.  Swelling went from just my calf to my calf and thigh.  My arm also started swelling again after a long hiatus.  Doesn't matter whether I wear my compressions or exercise.  I'm just having a hard time getting this to go away.  It doesn't mean yours will get worse or won't ever go away.  I think we're all pretty much different in what works and what doesn't. Laurel, what a great picture!  Glad you were able to make an \"escape\"! Sue",
      "MessageIndex": 4667,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "May 3, 2014 09:58AM milehighgirl wrote: Carol, the book is about people who were sent home to die with no more conventional treatments that would work.  I believe there are a few people who did both but I'm only about 2/3rds of the way through the book.  I was sent home to die 5-years ago and I'm still kicking.  I'm convinced that it was the alternatives that have kept me going so I've read literally hundreds of these types of books.  So far, this is one of the best one's I've come across because she actually researched what people were doing.  Whereas the medical profession isn't interested in alternatives so she set out to give them something to really look at.  Very much worth a read.  Sue",
      "MessageIndex": 4742,
      "PostDate": "03/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 30, 2014 02:56AM milehighgirl wrote: Flimsicle, welcome to the neuropathy club.  I've had the same foot issue in one foot along with lymphedema up the leg.  Thus, I am numb from the knee to the toes and yes, it is neuropathy you're experiencing.  I have tingling in my other foot (toes only) and the fingertips of both hands.  I've had to deal with this for awhile and I'm nervous about the Halaven making it worse.  It doesn't sound like yours is too bad though so we'll keep our fingers crossed. I feel for you on the appetite.  I'm not a big eater to begin with so when/if this drug really cranks up, I'll be able to give you some insights.  Maybe trying to eat smaller meals throughout the day would help you.  I've had the extreme fatigue you talk about.  Today I made it to 5:00 before crashing for a late afternoon nap.  I tried so hard not to take it lol. Good luck!  Sue",
      "MessageIndex": 138,
      "PostDate": "30/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 30, 2014 05:40AM milehighgirl wrote: Flim, I'm going to have to try the headache thing as it sounds wonderful.  I can't take anything over the counter so I just have to live with the aches and pains when they come. I'm guessing that your onc. would agree to giving you two weeks off.  Mine would if my fatigue got really bad.  The last drug I was on did a number on my platelets and we kept postponing the next infusion until they came back up over 100 (the acceptable, lowest number to get chemo).  I had also asked to have my dosage reduced and spread further apart.  My tired, old body just wasn't bouncing back like it did the first go 'round 5-years ago.  Guess it's harder the second time around.  I do wrap my leg almost every day for the lymphedema.  I see the PT tomorrow to try to figure out what to do about the abdominal/trunk swelling.  My swelling started out in my arm and then went away.  Then my leg ballooned and now the trunk.  I'm with you that I just want all of this to GO AWAY, lol.  I keep saying though that for each day that we live on, someone out there is getting that much closer to a cure.  Just think.  I was dx'd in 2009 and most of the drugs I've had this go around didn't exist then.  We are going to beat this ladies.  So let's push on! Thanks for the info flimsical!  Sue",
      "MessageIndex": 141,
      "PostDate": "30/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 15, 2014 05:32AM milehighgirl wrote: Flimsicle, what great news!  You've only been on this for 2.5 months.  If my counts ever come back, I hope to have similar good results.  I'm still dealing with pleural effusion issues.  I'm hoping to have the second pleurodesis next week to get it over with but my lymphedema is making the surgeon pause....I just want to be able to breathe again and am tired of having to go in every week for a lung drain along with all my other appointments.  Maybe this time next week I'll have some good news to share. Have a great time at the beach!  Sue",
      "MessageIndex": 154,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 16, 2014 02:16PM milehighgirl wrote: Karen, so sorry to hear your news.  I never even got the chance to try it since the doctor proposed rads and then another combo chemo to address the endometrial and breast cancers.  It sounds like you've had a rough go of it so we'll pray they find something to reverse it all for you.  Be blessed.  Sue",
      "MessageIndex": 66,
      "PostDate": "16/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 5, 2014 12:20PM milehighgirl wrote: Thank you ladies for the warm welcome.  Sophie, when did you start the Halaven?  It looks like you've had a few more side effects than the others.  I'll pray they go away! Nancyh, will your neuropathy eventually go away?  Or will it stay with you while on the drug? Hoping it will be an easy one for me as well.  Sue",
      "MessageIndex": 43,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 14, 2014 09:52PM milehighgirl wrote: Well gang, looks like I won't be trying the Halaven yet.  The doc. put together carboplatin with taxol to cover both the breast and the endometrial cancers.  Keeping my fingers crossed that this combo works.  In the meantime, I'm praying you all get a good long ride off of the Halaven! Blessings.  Sue",
      "MessageIndex": 59,
      "PostDate": "14/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 10, 2014 12:04AM milehighgirl wrote: Hi ladies. I follow this thread because Halaven is in my future - I'm  not on it yet. Dancing Veg, I get an Xgeva shot once a month for the bones.  Does a good job in both strengthening the bones but also did away with the few bone mets I had.  I've not had any pain with it but I do take Claritin daily.  I picked up this little tidbit from those who were getting the bone shots and the neupogen shots.  No one knows why but the Claritin takes away the bone pain from these types of drugs.  You may want to give it a try! Blessings.  Sue",
      "MessageIndex": 114,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 18, 2014 08:31PM milehighgirl wrote: Hello all.  Well, the day has come that I'm being switched to Eribulen.  I'll be starting next Friday.  My onc. is upbeat about this drug and says my side effects should be minimal.  I already have some neuropathy and she and I are both concerned about it getting worse on this drug.  I know everyone is different but I'm going to have to psych myself up for yet another change and a new drug and possible new side effects.  Anyone provide any insight into their start on this drug? Looks like I'll be around for awhile.  Blessings.  Sue",
      "MessageIndex": 120,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 9, 2014 03:48PM milehighgirl wrote: Barb and Judie, I'm so sorry this didn't work for you.  So far I've only been able to get the first half of the first round because my platelets and neutrophils tanked.  They're too low for the 2nd half which was due two weeks ago.  Unless and untill I can get the neupogen shots, I may be joining a different club. I wish you the best - there is something out there with your names on it!  Sue",
      "MessageIndex": 148,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 3, 2014 08:47PM milehighgirl wrote: Hello ladies.  I'm going to be joining this thread as I'm scheduled for my first Halaven on the 14th.  Am hoping my SE's are as minimal as yours have been.  I'm supposed to have rads to a muscle tumor in my leg first....which is why I'm being switched to the Halaven in the first place.  Last chemo did a great job on the breast tumors but nothing to the leg tumors. Looking forward to all of us having good results with this one! Sue",
      "MessageIndex": 40,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 15, 2014 06:13PM milehighgirl wrote: Jean I'm with you on the waiting game.  Monday will be here in no time.  And what's up with the lung issue?  Mine returned with a vengeance this weekend.  I didn't think taking a hiatus from chemo would bring it back so fast.  Had 3 thorocentisis last summer and then started on the chemo.  Lungs seemed to be drying up nicely after that.  Jean we'll keep our fingers crossed you get a good result on your tests. Today I can barely walk because of the shortness of breath.  Sat in the Dr.'s office yesterday and we decided my oxygen levels were at or above normal so no need to schedule the thorocentisis.  I can't believe how out of breath I am only 24 hours later!  Hope I don't end up in the ER tonight.  I'm scheduled to work on Monday so I'll have to call for the appointment on one of my breaks.  Why do these things only pop up on the weekends?  I'm wondering if the rads I had this week and last are causing the reoccurrence along with the leg swelling.  I was so hoping not to have to have this again and let the new chemo do it's thing with the lungs.  I'm bummed.  Sue  ",
      "MessageIndex": 63,
      "PostDate": "15/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 22, 2014 04:19AM milehighgirl wrote: Danish, I take Claritin for bone pain.  I get an Xgeva shot once a month.  Many take it for the neupogen shot.  I take it every day, not just when I have chemo.  I really haven't had much bone pain until recently.  I had to stop the Xgeva shot because I  need to go to the dentist.  Hopefully it will go away when I get the shot again in a few weeks. Sue",
      "MessageIndex": 128,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 29, 2014 08:54PM milehighgirl wrote: P.S.  I also have had headaches.  I never get headaches!",
      "MessageIndex": 136,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 1, 2014 05:28PM milehighgirl wrote: Well ladies, I was supposed to have my second week of the Eribulen today (round 1).  I've been really tired yesterday and today.  The onc. is on vacation so I dealt with the NP.  My platelets are too low as are my white counts, the latter of which are almost 0.  So........they handed me a mask and said to come back next week.  I asked about getting a shot and she said to wait until next week to see if the counts come back up.  I doubt it since they didn't budge when I was on the Taxol/Carbo combination. Flimsical, looks like I'm going to get to try out the two weeks off routine.  I'll let  you know how it goes or if I get any energy back. Is anyone else getting the shots post chemo?  If so, what are you getting and when (how often)? Sue",
      "MessageIndex": 142,
      "PostDate": "01/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 10, 2014 04:55AM milehighgirl wrote: Dancing Veg, thanks for checking in.  I too have been neutropenic and running a low grade fever that went away today.  Today I slept all day.  I haven't had the 2nd dose of round one yet so who knows why I've been so fatigued - it's been two weeks.  I also noticed my hair started falling out (what little I still have).  This must be a real potent drug.  I haven't had the shots yet.  The NP keeps putting it off but I'm whipped.  I need to get some energy back.  My doc doesn't get back until the 18th but I'm not waiting any more.  The info is really helpful Vegg. Sue",
      "MessageIndex": 151,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 11, 2014 01:31PM milehighgirl wrote: Great news Jean.  I'm trusting that I'm going to get a good long ride out of the Halaven.  How are the side effects?  I'll be coming off radiation (one day) before getting the Halaven so I'm hoping mine will be nice and mild or none at all. Hang in there with your mom JC. These drugs can produce all kinds of weird SE's and hopefully this is just an anomaly.   I haven't started yet but other drugs I've had have bounced some of my counts up and down for no reason before they level out.  One \"bounce\" out of several doesn't mean it's not working.  Just pray that it's her body getting used to something new. Blessings for success for all!  Sue",
      "MessageIndex": 52,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 29, 2014 08:25PM milehighgirl wrote: Pearlady, you are one of the lucky ones.  I dealt with the \"c\" from one of my anti-nausea drugs (Zofran).  The only thing that worked for me was a natural product called Perdiem.  I got it at Walmart and it was very gentle and they guarantee it to work.  It did. So far, I've just had the first infusion.  I've had extreme fatigue and a runny nose - go figure.  A bit of a funny stomach here and there but no real nausea. Barb, I read that one of the side effects was anemia and low red and white counts.  If that's what you're experiencing, then you would have some dizziness.  My last chemo did a number on my counts.  I got dizzy at work one day and didn't know what it was from.  My onc. told me I was anemic but I had no idea until then that I was. Dancing veggie, are you doing better?  Hope you got that fever under control! Sue",
      "MessageIndex": 134,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 9, 2014 04:24AM milehighgirl wrote: Well, it's been quiet in here for a week now.  How is everyone doing?  Dancing Veg, did your neutrophils come back up?   Fever go away? Flimsicle, how were your scans? My blood work yesterday showed that my white count came up a little and my platelets are finally over 100 for the first time in several weeks.  Unfortunately my neutrophils went down even more so Dancing Veg I'm joining you in the neutropenic club.  No chemo again this week!  Yesterday I also had another thorocentesis (lung drain).  I was bummed but at least I'll be able to breathe over the weekend.  Looks like I'll be having another surgery now on the other lung (Just had one at the end of May and spent a week in the hospital). I asked about getting gthe neupogen shots and the NP said to wait (again) until next week.  Just give me the stupid shots! Have a good weekend all.  Sue",
      "MessageIndex": 144,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 9, 2014 04:23PM milehighgirl wrote: Sophie Jean, tell us about ginger and jello (your comment from above).  I'm gearing up for my first dose of the Halaven on the 14h.  I'll be coming off my 5-radiation treatments so I'm praying there's not cross over in terms of SE's.  So far, only had one bout of vomiting on the first day of rads.  We think it was the lunch we had afterward. Raro, great advice on the B complex.  My onc. says that the neuropathy will eventually go away...(I'm assuming when we get off of all this stuff).  In the meantime, I'm glad to have an alternative to turn to in the mean time. You all seem to be doing so well.  I'll be scheduled for work just a few days after my first treatment on Friday.  Hope I can handle being on my feet for 7-hours! Sue",
      "MessageIndex": 49,
      "PostDate": "09/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Mar 13, 2014 05:54PM milehighgirl wrote: Well ladies, I may be out of the Halaven club before I ever get a chance to get in it.  My doctor left a message for me this morning that after talking with the radiation oncologist today, they believe my leg tumor may be a result of a recurrence of my endometrial cancer.  Instead of treating the breast cancer at this time, they may look for another chemo to treat the endometrial cancer, if that's truly what it is.  She said I likely won't have chemo tomorrow as I have to go farther out from the radiation on a different drug - whatever that may be.  Give my body a rest.  Here I finally get past the rads and have psyched myself up for the Halaven and now have to do it all over again. I'm okay with waiting another week but it will be hard to re-psych myself up all over again.  I sure hope they come up with a drug that will treat both. I'll let you know tomorrow night!  Sue",
      "MessageIndex": 55,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 27, 2014 07:20PM milehighgirl wrote: Whew, I had my first infusion on Friday and didn't seem to have any reactions.  Last night I started fading big time so I just gave it up thinking I needed to go to bed a little early.  Well, today I woke up with a huge headache and felt as if I hadn't been to bed at all.  I took my morning pills and crawled back into bed and slept another 4-hours!  I've been having some trunk and abdominal swelling from my lymphedema which results in shortness of breath and have been wearing my oxygen pretty much full time.  I hope this goes away 'cause I have to work tomorrow. The SE's could be a lot worse I suppose.  Anyone dealing with these?  Sue",
      "MessageIndex": 129,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jul 28, 2014 04:11AM milehighgirl wrote: Dancing Veg, I'm so sorry to hear of your se's.  I really was hoping this was going to be an easy drug.  My onc. sure thought so.  I'm still early in the cycle - only had the first one so we'll see what next week brings.  I ended up sleeping ALL day tonight and most of tonight.  Sure hope I can sleep tonight because I have to be up at 4:45 for work in the morning. Wish the OTC drugs worked because I need to take something for my headache.  Maybe my pain meds will do the trick. Blessings.  Sue",
      "MessageIndex": 131,
      "PostDate": "28/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Aug 11, 2014 04:25AM milehighgirl wrote: P.S.  How much hair did everyone lose on this one?",
      "MessageIndex": 152,
      "PostDate": "11/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817167",
      "Title": "Halaven anyone? JimmieBell Roddy-Brazil"
    },
    {
      "AuthorID": "milehighgir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181043/profile",
      "Content": "Jun 12, 2013 07:45PM milehighgirl wrote: Marsha, DO NOT give up.  I agree with everyone here that a second opinion is worth pursuing.  My younger sister battled for 12 years before all of the current drugs and treatments were available. She was told over and over that \"there was nothing else we can do\".  Hockey Puck!  She went somewhere else, got a different treatment and low and behold was back in remission - at one point for three years! You can also look into alternative and/or complementary therapies.  I've used several on the cancertutor.com website which has an assortment of things you can try.  My (old) doctor told me to go home and wait to die four years ago.  That doctor is no longer there but I am and still going strong and no one can figure out why I'm still alive. You go girl.  You've got a ton of support here and hundreds of us cheering you on. Blessings, Sue",
      "MessageIndex": 22,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806021",
      "Title": "out of options onedayatatime NickyJ"
    }
  ]
}