{
  "AuthorID": "MimiD",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226730/profile",
  "Posts": [
    {
      "AuthorID": "MimiD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226730/profile",
      "Content": "Jan 13, 2016 08:49PM - edited Jan 13, 2016 08:50PM by MimiD Hello Ladies - this is my first post. I've been researching and reading through some of your posts. Hope to be able to offer support and receive some as well. My Dx is below. SNB and double mastectomy is scheduled for 1/22. Just celebrated my 57th birthday. Still waiting on genetics - expect to get results the day before surgery. There is a saturated cancer history on my Mom's mother's side of the family. My Mom is a 30 year survivor of pre menopause BC (BMX, ER/PR -, no other treatment, no recurrence). My grandmother and great-grandmother had BC. My grandmother had 9 siblings - 2 died in early childhood (not sure why), my grandmother survived cervical cancer when she was about 40, then died of vaginal and breast cancer in her 70's; 3 sisters had BC - one was pre menopause and 2 were post menopause; 1 sister had ovarian cancer at about 40 and passed away soon after diagnosis; 2 brothers had prostate cancer - one in his early 50's, one in his late 50's. That's 8 of 10 siblings in one family who died from cancer. My Mom has 6 siblings - 2 brothers have died with cancer, another is battling cancer, 1 sister had uterine cancer and suspected early cancer in an ovary. (There is also some cancer on my Dad's side - but heart disease was the demon for most of his family). The geneticist reminded me that they can only provide so much information - they don't know about ALL genes. With my Mother's family history she recommended I carefully consider my options because even if I'm negative for the genes they know about, it's likely there's something going on within our family.  I have dense breast tissue (my mom did, too) which has made it challenging/impossible to read mammograms. I've had ultrasounds every 2-3 years and have been diligent about self-exams. Also, I've been under the care of a breast specialist/surgeon for over 10 years. I've had a couple negative needle biopsies in the past and hoped this one would be the same. I had a \"clean\" mammogram in October - not even a speck in the place where the cancer is on any mammogram of the past. I found the lump in early December - I did not feel it even the month before. But with the size – if it is growing at an average rate of splitting every 100 days, it has likely been there for 8 years more or less! Mind blown! So, I’m scheduled for BMX – no recon for now – need more time to consider additional surgery. Not leaning that way right now but want to have the ability to reconsider if I feel differently later. I have the opportunity to change my mind up to the day of surgery and just do the left breast, but I am not a good candidate for radiation. I’m leaning towards the double since I was blessed to find what the mammogram missed. If something happens in the right breast it could be in a place I couldn’t find it – and a mammogram could miss it again. Since it will be a battle for insurance to pay for yearly MRI’s for screening, I would be anxious something could be missed (again). My wonderful husband is completely supportive of whatever I chose to do. In addition, my husband’s job is in flux and we don’t know what our insurance coverage will look like after March 30, especially if he is employed by a different company. Wow, sorry this is so long, but just thought I would share why I have made the decision for BMX. We are so individual, aren’t we? Looking forward to getting to know all of you and offer support. ",
      "MessageIndex": 304,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "MimiD",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226730/profile",
      "Content": "Jan 18, 2016 04:59PM MimiD wrote: Still trying to get my brain around the fact that I have breast cancer...I don't feel sick - know what I mean? Just want to get the cancer OUT and get on the other side of the surgery. Hoping for no further treatment following surgery...aren't we all?! I'm so thankful for a place where I can be encouraged by other women who are facing this challenge. Thank you to those of you who are sharing and offering encouragement! BlueHeron - Yay for your negative nodes! Balthus - you certainly have a lovely view! Grandma3x - hope you continue to feel better each day and the constipation is soon an issue of the past! Very best wishes to those having surgery today and tomorrow: Merymete, Kar324, Mominator, 7of9, violethope Surgery center called for preregistration today - I meet with the surgeon tomorrow. Taking one day at a time... ",
      "MessageIndex": 394,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    }
  ]
}