{
  "AuthorID": "Mimi1261",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
  "Posts": [
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Mimi1261 wrote: I just came back from getting my stitches out and my pathology report at the surgeon's office.  I have posted on here recently about the lump my doctor found at a physical that was unable to be aspirated.  Brief history:  I had an exisional biopsy on a lump in 2005 that was found on ultrasound against my chest wall.  It was identified as columnar cell change atypical hyperplasia.  Anyway, since then my doctor has really been watching me closely and gets nervous whenever he finds a lump, especially on the right breast (the one that had the atypical hyperplasia).  Anyway, the surgeon told me that the lump he surgically excised last week was a fibrocystic cyst.  I asked for the path. report and now that I am home I am wondering if anything on it showed increased risk of breast cancer.  The report reads:  fibrocystic changes with macrocyst (1.8 cm) filled with thick grayish/brown mucoid; focal mild to moderate ductal hyperplasia of usual type; focal intraluminal microcalcifications; focal sclerosing adenosis; focal columnar cell change; negative for malignancy or atypia. I was so relieved that it was benign but I was just wondering if there were any markers for risk of breast cancer in this lump like the other.  They are both in the same breast.  Thank you everyone for all the support that you all provide.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719210",
      "Title": "My Pathology Report Mimi1261 Beesie"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Oct 25, 2013 06:34AM Mimi1261 wrote: Thanks Sandra for sharing your experience. I had ADH which is not cancer but puts me at a moderate risk. I also have 100% dense breast tissue. This is what I have been told me by my breast surgeon and the Thompson Cancer Survival Center in Knoxville who did genetic counseling with me. I have read that DCIS doesn't show on MRI either. I had a friend that had DCIS and then one year later had invasive breast cancer in the same breast. I hope I never ever get breast cancer but if I do, I am determined to find it early! I will probably call my breast surgeon and see if I can get her advice. Thanks! :)",
      "MessageIndex": 6,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/813473",
      "Title": "can cancer show up 5 months after a clear MRI? Mimi1261 Melbourne77"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Mimi1261 wrote: I was diagnosed with ADH when I was 37. I am 44 now. I have had several biopsies since then for lumps. They were all benign. They did show proliferative fibrocystic changes. The most recent biopsy I had was a core needle biopsy this past May that came but benign with proliferative fibrocystic change including usual ductal hyperplasia without atypia, stromal fibrosis, aprocine metaplasia, and microcyst formation. I had a MRI this past May that showed no cancer. They have told me that I am 100% dense and that mammograms are useless because they can't see anything. Anyway, I felt a lump a couple of weeks ago that has not changed. My internist felt it too plus another lump in the same breast. This is the breast that had the ADH. On ultrasound, I had numerous complex cysts. There is one of the cysts that the radiologist did not like the look of but he said since I had a MRI this past May (5 months ago) that did not show any suspicious masses, then he thought I could wait 6 months and then come back for another ultrasound. The ares of concern was described like this on the ultrasound report, \"at the 10 o'clock position there is a hypoechoic lesion measuring 14x7x15 mm with adjacent complex cyst lesion measuring 9x5x12 mm. There are no other suspicious lesions.\" My question is, do you think I am okay since the MRI 5 months ago showed no cancer? Can cancer or atypical hyperplasia show up in 5 months? I would really appreciate any input. My doctor has still not called me about the report. I had to go get the report from the hospital myself. Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/813473",
      "Title": "can cancer show up 5 months after a clear MRI? Mimi1261 Melbourne77"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Oct 24, 2013 07:11PM Mimi1261 wrote: I found a round lump on my left breast when I was 37 that turned out to be a fibroidenoma but this lead them to do my first mammogram and US. The US tech that did it that day was great. She took a long time and found the ADH against my chest wall behind the nipple. Neither I nor the doctors could feel it. They put a wire in it to surgically remove it. The breast with the ADH has had 3 surgical biopsies so there is probably a fair amount of scar tissue. I was just worrying a little about it because the radiologist this time kept looking at the right breast where the complex cysts were and hypoechoic nodule was and was telling the US tech he did not like the look of the hypoechoic lesion with attached cyst. So, they kind of made me wonder. Is the measurement 14x7x15 mm a taller than wide measurement or a wider than tall measurement? I was not sure how it was stated and it looked taller to me on US. Thanks for answering me! It has really helped!",
      "MessageIndex": 2,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/813473",
      "Title": "can cancer show up 5 months after a clear MRI? Mimi1261 Melbourne77"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Oct 25, 2013 06:55AM Mimi1261 wrote: Thanks Melissa for finding this article for me. I guess I should trust the radiologist and just wait 6 months. As I mentioned earlier, his talking to the US tech about how he did not like the look of the lesion near the complex cyst did not make me feel so grand! :) It made me worry more. I guess I am just tired of always being on edge when I have tests or when I find a lump.",
      "MessageIndex": 7,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/813473",
      "Title": "can cancer show up 5 months after a clear MRI? Mimi1261 Melbourne77"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Aug 2, 2008 07:18AM Mimi1261 wrote: Thank you dhettish for replying so soon.  It does feel hot to the touch and the redness seems to be getting brighter too.  I can't tell if it has a foul odor.  I haven't taken the bandage off yet.  It is a bandage with gauze and a clear piece of tape.  The nurse said that I should leave the bandage on until the edges of the tape start to curl up.  It hasn't done that so I have left it on.  They did not give me any antibiotics to take at home and I am not sure if they gave me some through my IV on Thursday.  Thanks for you advice.  I will call tomorrow if it has not gotten any better or if it worse for sure. ",
      "MessageIndex": 2,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718939",
      "Title": "Red circle around surgical biopsy site Mimi1261 leaf"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Mimi1261 wrote: I had the excisional biopsy surgery on Thursday and made it through!  Yeah!  The surgeon told my husband that it was a cyst.  I am confused because he tried to aspirate it before he did surgery and no fluid would come out.  How could it still be a cyst?  I didn't get to talk to him after surgery.  I am supposed to go get the stitches out and the pathology report on Thursday.  Are cysts totally benign all the time and can he tell by just looking at the the lump duriing surgery that it is a cyst?  Also, I have developed a hemotoma on the left side of the incision.  Then yesterday afternoon the site was a little red.  Today the redness had spread in a big circle around my incision.  The red circle appears to be getting bigger.  I called the on-call surgeon and he said it was too early for infection to have set up in it since it has only been 48 hours and that I shouldn't worry about it.  He said that hematomas are common after breast surgery.  He said if it was still red Monday to call the office.  My breast hurts more eech day.  Is this normal?  Sometimes the doctors make you feel like you are just a whiner.  If frustrates me!  Especially when it is a man sureon acting like you are whining.  They don't have breasts and I know they haven't had surgery on a breast!! Anyway, I am in not feeling good and maybe I am whining.  I just wondered if anyone else had this symtom after surgery?  Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718939",
      "Title": "Red circle around surgical biopsy site Mimi1261 leaf"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Mimi1261 wrote: Almost two years ago I went to the doctor about a lump in my left breast. The doctor thought it was okay but sent me for a mammogram since I had never had one. My mother's sister has breast cancer, two of their aunts had it and their first cousin died in her 30's. (A little family history) When they did the mammogram they went ahead and did an ultrasound. They found another lump that was deep in my other breast that had uneven edges. So, they did a core needle biopsy on both of them. The one that I found on my own was a fibroadenoma but the one they found on the ultrasound was atypical hyperplasia. The pathologist recommended that I have a surgical biopsy on both and completely remove them. The surgical biopsy found that one was a fibroadenoma but the other one was atypical hyperplasia. 6 months later I found another lump that they did a surgical biopsy on and determined it was a fibroadenoma. Now almost a year after that my doctor felt some nodules that he has been following on the breast that had the atypical hyperplasia. He ordered a mammogram and ultrasound. That breast has a lot of cysts and has very thick breast tissue. I have fibrocystic breast disease. The mammogram and ultrasound was normal according to the radiologist. My doctor has still has been checking them since the mammogram (about 2 months ago) and checking my lymph nodes under my arms. He said that my lymph nodes have been slightly swollen for 3 months. He is sending me for a MRI next Tuesday because he can still feel the nodules and they are close to the place that the atypical hyperplasia lump was found. I talked to the nurse at the breast center that is going to do the MRI. She said that I am at a higher risk for breast cancer since I had this atypical hyperplasia. She said too at such a young age. Do I have reason to worry? I have looked on the internet since then at articles about atypical hyperplasia and have kind of scared myself. Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/607967",
      "Title": "atypical hyperplasia lump at 36 years old Mimi1261 missz"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "May 16, 2007 05:24PM Mimi1261 wrote: I had my MRI yesterday. The insurance company pre-certified only a unilateral MRI but they did a bilateral MRI. Anyway, my doctor called me tonight and said that my right breast (the one that had the atypical hyperplasia lump) just showed fibrocystic changes. The left one showed a spot that the radiologist said was a fibroadenoma. My doctor said that he would leave it in since it was not on the side that had the atypical hyperplasia. He said that the radiologist said that it did not show on the ultrasound and mammogram. Is it a good idea to leave a fibroadenoma? Can they be absolutely sure with a MRI that it is just a fibroadenoma? Also, I got my path reports yesterday from my three surgical biopsies. I never had my own copy. Anyway, it said that the lump that was removed almost two years ago was atypical columnar cell hyperplasia. Is that different from just atypical hyperplasia? Anyway, I had good news to share. Thanks!",
      "MessageIndex": 6,
      "PostDate": "16/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/607967",
      "Title": "atypical hyperplasia lump at 36 years old Mimi1261 missz"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "May 17, 2007 07:23AM Mimi1261 wrote: Do you think I should have a consult with the breast surgeon that my GYN recommended? Should I see if she thinks the fibroadenoma should be removed? She is supposed to be excellent. I have been told that she really follows people that are high risk to make sure they get the right tests done at the right time. My internist that sent me for the MRI is cautious but he said he would leave it in since it was not on the side that had atypical hyperplasia. I sound paranoid but I just want to do everything I can to avoid ever getting breast cancer or catching it early if I do get it. You all have been so wonderful on this site to offer insight and encouragement. It is hard to talk to my husband about all this so it helps to talk to you all. (my husband thinks I am a worry wort! ) Thanks!",
      "MessageIndex": 9,
      "PostDate": "17/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/607967",
      "Title": "atypical hyperplasia lump at 36 years old Mimi1261 missz"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "May 12, 2007 10:28AM Mimi1261 wrote: Thanks everyone that responded. You really helped me not be so worried. Everytime I go through one of these tests I get so nervous and just hold my breath until the results come in. I am 38 years old now and have two precious little boys, 5 years old and 8 years old. I want to be as careful as I can be so I can possibly prevent breast cancer or catch it in the early stages. The nurse at the MRI office told me that I could go to Thompson Cancer Survival Center her in Knoxville, TN (I live right outside Knoxville) and they could do genetic counseling with me. I don't know if I want to do that because I don't know what I would do if they told me I had the gene for breast cancer. Another thing she recommended was to go to a consult with a female surgeon that deals only with reconstruction of breasts after breast cancer. The surgeon that did my surgical biopsies was an older man. He really didn't talk to me much. She is supposed to be real good at following you and trying to help you get the right tests to help prevent breast cancer. I guess I should wait till after Tuesday and see what the MRI says. This site has really been a great place to get support. Thanks so much!",
      "MessageIndex": 4,
      "PostDate": "12/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/607967",
      "Title": "atypical hyperplasia lump at 36 years old Mimi1261 missz"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Mimi1261 wrote: I had a atypical hyperplasia lump removed in 2005 when I was 36.  I have extremely dense breasts with many cysts.  I have been told that I am high risk.  I go to a breast care doctor who is also a breast surgeon.  I went for my 6 month check-up yesterday.  I had felt a lump on my left breast but was not sure if it was anything.  She felt it too and said she thought it was okay but she would send me to get an ultrasound that day to make sure.  They saw a cyst where I felt the lump but then above the cyst they found an indeterminate appearing nodule.  This is what the findings on the ultrasound report says: Benign cyst at 6' o'clock subareolar left breast.  Elongated hypoechoic solid-appearing nodule at 8 o'clock near the palpable nodule.  On real-time imaging this may be within a duct, there are a few punctate echogenic foci which may be calcifications.  Borders are fairly well defined and there is no significant shadowing\" Recommendation:  US directed biopsy. They scheduled a biospy for next Wednesday.  Then my breast doctor's office called and said she wanted me to have a MRI before the biopsy but did not say why.  All the radiologist said was he had looked at my prior mamograms, ultrasounds, and MRI's and thought I should have this biopsied.  Should I be worried?  I had a lymph node that was enlarged in Nov. of last year near this breast on ultrasound but they did not find a lump near my lymph node then.  Of course they did not look at the side of the breast where this lump is.  It is awful to wait and I do not know if I should be worried or not.  Any insight on this would be greatly appreciated.  Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804481",
      "Title": "Birad 4 ultrasound: Waiting on biopsy and MRI Mimi1261 Mimi1261"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Aug 2, 2008 02:53PM Mimi1261 wrote: Thanks everyone for all your answers.  I still don't feel good and one of my friends from church that is an Internist called to check on me.  I told her what was going on and what the on call surgeon said.  She said that you can get an infection already and she called me in some antibiotics.  I finally felt like a medical doctor was listening to me!  I guess I could of called the on-call surgeon back but I didn't have the energy.  I hope my surgeon doesn't get mad at me when I tell him on Thursday that I consulted another doctor.  Oh, well.  I guess I can't worry about that. ",
      "MessageIndex": 5,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718939",
      "Title": "Red circle around surgical biopsy site Mimi1261 leaf"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "May 11, 2013 10:30AM Mimi1261 wrote: Thanks.  I know that I should not worry.  I try not to.  I go for the MRI this morning.  Maybe they will tell me after this test that I don't need the biopsy.  I just want them to say it is nothing so I can breathe and go on with my life.  Everything that I have read is that breast cancer would not be enlongated so that sounds good.  The calcifications can show up in benign nodules on ultrasound too I think.  Anyway, thanks for responding.",
      "MessageIndex": 2,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804481",
      "Title": "Birad 4 ultrasound: Waiting on biopsy and MRI Mimi1261 Mimi1261"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Mimi1261 wrote: I need some advice.  I had a lump removed in Aug. 2005 that was deep against my chest wall on my right breast (I couldn't feel it) that was found to be filled with columnar cell atypical hyperplasia.  I have also had 2 fibroadenomas removed since then.  I have had yearly MRI's since 2007 (May 2007 and Jan 2008) that showed nocancer only fibrocystic cysts, major thickening of the breast (they say from Fibrocystic changes in my right breast) and a small fibroadenoma against the chest wall on my left breast.  This past Jan. I had a tiny lump (like a pea) that I felt on the upper part of my right breast.  My doctor monitored it for a month and decided to send me back to the breast surgeon for further consult.  The breast surgeon felt it immediately and said it was a fibroadenoma that needed to come out since it was on the right breast.  He sent me to have a MRI to make sure nothing else was going on.  When I went (this past Jan) for a mammo, ultrasound, and MRI, they said nothing showed up except fibrocystic thickening and cysts and the same fibroadenoma on my left side, but it had not grown.  ANYWAY, (I know that was a  long story!) I got so confused this past Jan. about what I felt that I have not done another breast exam since Jan.  At my last physical, my doctor felt a lump right above my nipple.  I have never felt it.  I was getting ready to start my period so he told me to see if it changed the week after my period started.  It has been a week after my period and it is still there.  Should I be concerned?   I felt like such a dummy last time when they told me they didn't see anything on the tests.  I got real confused about what I feel on self-breast exams and about when to be concerned.  What should I do? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709145",
      "Title": "new lump Mimi1261 nowheregirl"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Jul 16, 2008 05:49PM Mimi1261 wrote: Thanks so much for all the info.  I went to the site that you gave for the risk calculator,  It calculated my lifetime risk at 29.3% and my five year risk as 2.6%.  My doctor's nurse called me back and said that my doctor was consulting with the surgeon who did my 2 surgical excisional biopsies to get his opinion on my situation and the new lump.  I just want another mammogram and ultrasound!  That way they can at least tell if it is a fibrocystic cyst or not.  The last 2 MRI's I had had to get special approval from my insurance co. but they were both approved due to me being high risk.  That was an answered prayer.  Thanks for all your help.  This site really has helped me.  It is so good to talk to people who understand what you are going through.  The not knowing and waiting is terrible!",
      "MessageIndex": 5,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709145",
      "Title": "new lump Mimi1261 nowheregirl"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Jul 22, 2008 01:28PM Mimi1261 wrote: I just wanted to give a update.  My doctor said last week that he would consult with the breast surgeon that did my other surgical excisional biopsies and get back with me.  I never heard from my doctor but heard from the surgeon's office.  They called to set up an appt, about the breast lump.  The appt. is Monday.   I called my doctor this mrning to see if I needed a ultrasound before I went to the surgeon.  I haven\"t heard from him yet.  In the meanwhile, I am not feeling well today.  Probably not realted, but I felt just bad this morning so I took two tylenols thinking it was because I have been laying tile with my husband this past weekend,.  Then this afternoon, I was still not feeling well so I took my temp.  It is 99.6 degrees even with two tylenol.  (my normal temp is 98.6).  The lump is still there even after my last period and this is the 14th day of my next cycle. So all this to ask, could this fever be related to the lump?  Should I call my doctor about it?  ANd is is normal to go to the breast surgeon before you have had a mammo and ultrasound? Thanks for all your help.  This board has been a lifesaver.  I feel like I have no one to talk to about this.",
      "MessageIndex": 6,
      "PostDate": "22/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709145",
      "Title": "new lump Mimi1261 nowheregirl"
    },
    {
      "AuthorID": "Mimi1261",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50901/profile",
      "Content": "Jul 16, 2008 10:31AM Mimi1261 wrote: Thanks for replying to my post.  It really helps to hear from other people that have experience in this.  I am going to call my doctor and tell him I want to come in to have it checked again  Can cancer develop within six months of a clear MRI?  I am 39 years old and have two children, ages 7 and 9.  My doctor told me that \"I dodged a bullet\" in 2005 when they removed the lump with atypical hyperplasia.  He says I am high risk since I had a lump that had columnar atypical hyperplasia.  Is that accurate?   More questions! ",
      "MessageIndex": 3,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709145",
      "Title": "new lump Mimi1261 nowheregirl"
    }
  ]
}