{
  "AuthorID": "Mimi26",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183778/profile",
  "Posts": [{
    "AuthorID": "Mimi26",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183778/profile",
    "Content": "Jul 7, 2013 07:34AM Mimi26 wrote: With a strong family history of breast cancer (maternal grandmother, mother, and older sister), I have been expecting this news for decades. After \"suspicious microcalcifications\" showed up on my mammogram, a stereotactic biopsy was performed. I just received the pathology results on Friday--DCIS. Oddly, I felt a tremendous sense of relief; the excruciating wait was over and it appears to have been caught early. Since my sister has already gone down this road, she has been a great comfort to me. She's also a nurse and has helped me connect with an excellent breast surgeon and cancer treatment team. I am scheduled for my first consult with the breast surgeon tomorrow. I think she will recommend lumpectomy and radiation therapy. If so, I'm hoping to take care of both before school starts. I am a first grade teacher and would hate for my students to start the year out with a long-term sub, but I'm ready to do whatever it takes to clear this hurdle and move on. I do want to request genetic testing, though. My mother tested negative for BRCA1, but I don't think she was tested for BRCA2. With so many affected women in my immediate and extended family, there must be some genetic link. I have three daughters (30, 27, and 21) and one granddaughter and this genetic testing is crucial for their future well-being. I have tremendous respect and admiration for the countless number of women who have bravely faced this disease. Hold your head up high and remember that you are stronger than you think! You are heroes to all women, especially to those of us who have recently been diagnosed! Hugs and healing energy all around❤",
    "MessageIndex": 6,
    "PostDate": "07/07/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806188",
    "Title": "Just diagnosed Thursday njdall annika12"
  }]
}