{
  "AuthorID": "Mindy703",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159414/profile",
  "Posts": [
    {
      "AuthorID": "Mindy703",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159414/profile",
      "Content": "Aug 31, 2012 04:57PM Mindy703 wrote: Sharon, I was dx'd on the 29th and met with surgeon the 30th, yesterday, seems like forever ago. But i am surprised you have the stage already. I was told they have to do more tests before they could stage it for sure. Oncotype - which is more pathology on the cells themselves MRI- to better asses sizing and location. Also, if there is cancer anywhere else they may have missed (surgeon he doesn't expect this but....) I do this tues the 4th. BRCA testing- They did this in the office but won't get test results for 2 weeks. The surgeon said all this info. will be used to decide the best course of action. He did tell me ultimately the choice is up to me but the test results will give me an insight as to what is the best decision. Like chemo first then surgery or lumpectomy vs mastectomy, ect. I told him I am opting for a BMX with reconstruction. So, he is getting this set up. But while it is being organized and we are waiting on test results , he said I can have time to really think about it. But continue with setting up surgery as not to waste time. He said if we need to stop surgery set up at any time we can. I actually though am leaning towards chemo first then BMX with reconstruction. He said chemo first addresses the whole body and will let us be able to monitor the tumor and see if I am responding to the chemo we use. By seeing if the tumor is shrinking. It will also address other cancer cells IF there are any others in my body. I know everyone has different experiences but I just thought I would share. I want my process to move quickly, like yesterday. I guess we all feel this way. Goodluck and keep me informed. This sight has given me a lot of comfort. I love when I get a return message! Mindy",
      "MessageIndex": 9,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792778",
      "Title": "seeing breast surgeon tomorrow for results of my biopsy sharonb56 sharonb56"
    },
    {
      "AuthorID": "Mindy703",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159414/profile",
      "Content": "Aug 30, 2012 09:28AM Mindy703 wrote: I meet with my surgeon tomorrow at 2:30. I will keep you posted. I definitely want to look into the diet and supplements,though. I need to educate myself. I thought soy would be better for you. Talk to you tomorrow. Goodnight, Mindy P.s. is the melatonin for sleeping? I can' sleep at all!",
      "MessageIndex": 36,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792550",
      "Title": "34 and just got diagnosed Aug 22, 2012 and have many concerns... Amy4978 annabug12"
    },
    {
      "AuthorID": "Mindy703",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159414/profile",
      "Content": "Aug 30, 2012 09:02AM Mindy703 wrote: Amy, You sound so positive and upbeat. I was just dx today with IDC grade 2. So far that is really all I know. I am so devastated. I am 41 with 3 children 11,9, and 5. My husband keeps saying be positive, but I am finding it hard. I also am worried it has spread , so that is part of my worry ( infobabe knows, I chatted with her on another site). I have had some signs of liver cancer but it is also signs of fatty liver. It has been going on awhile though so.....not sure what the pains in my liver and back are. But now that I have been dx'd , of course I am terrified it has spread to my liver. Anyway, curious about how you came up with those supplements. I actually went to an organic market tonight to get things for dinner, it is very expensive! Yikes! Mindy",
      "MessageIndex": 33,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792550",
      "Title": "34 and just got diagnosed Aug 22, 2012 and have many concerns... Amy4978 annabug12"
    },
    {
      "AuthorID": "Mindy703",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159414/profile",
      "Content": "Aug 31, 2012 09:20AM Mindy703 wrote: Amy, Went to meet with surgeon. I feel soo much better. He explained a lot to me. Did an ultra sound and said he didn't see any lymph nodes under my arm that look concerning, but of course will not for sure until a few come out. He actually mentioned doing chemo first then surgery. Of course, I still have to do a few more tests. MRI, etc.. However, he is proceeding with scheduling a BMX with reconstruction. He said it takes awhile to get all this coordinated so wanted to get started on it even if we end up doing chemo first. He even did the genetic testing in the office. I told him I do not want to drag my heels in anyway. Which I am sure everyone feels this way. I am definitely a little more positive today. Where do you get the melatonin? Wal-mart or is there a special kind somewhere? Mindy",
      "MessageIndex": 38,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792550",
      "Title": "34 and just got diagnosed Aug 22, 2012 and have many concerns... Amy4978 annabug12"
    },
    {
      "AuthorID": "Mindy703",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159414/profile",
      "Content": "Aug 29, 2012 02:49PM Mindy703 wrote: Rider girl, Got my results. IDC grade 2. Meet with surgeon tomorrow@ 2:30. Will he be able to tell me anything? What surgery does he recommend? Has it spread? I have had some problem with an enlarged liver and a pain in my middle back. I am worried it has gotten into my liver. Do you know anyone that has had this and symptoms? Would it have mets before I ever found a lump????? Mindy",
      "MessageIndex": 24,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Mindy703",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159414/profile",
      "Content": "Aug 29, 2012 04:49PM Mindy703 wrote: Rider girl, Thank you for responding. Just to talk to someone in the similar boat is somehow comforting. What is your story? I would love to hear it , only if you want to share. Mindy",
      "MessageIndex": 27,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Mindy703",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159414/profile",
      "Content": "Aug 28, 2012 09:38PM Mindy703 wrote: Bennymuffins I know exactly how you feel. I have always been healthy. I have not been officially dx'd but had bilateral biopsies today. They said the irregular mass on my left breast is most likely malignant. I have recurrent pain in my back and liver area but always brushed it off as possible gall bladder problems coming on. Now I feel like I have cancer everywhere. I am 41 with 3 children. So tired and sad. My left breast is burning and my procedure was at 2:00. Anyone experience that after biopsy? Also, did they check your lymph nodes when they did your biopsy or does that come later? I should've asked but new to this! Btw today is my 13th wedding anniversary, what a way to celebrate!",
      "MessageIndex": 17,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    }
  ]
}