{
  "AuthorID": "ming",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
  "Posts": [
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Feb 20, 2008 02:09PM ming wrote: Thanks Tender. Looks like you don'g have to be all bone mets but just has to be the same no or more bone mets than other mets. You can keep taking Herceptin if you are Her2+. If you are ER or PR+ you have to have progressed on at least one hormonal therapy. You can have had no more than 1 chemo tx. I hope I've interpreted it right. Have you heard any results coming in yet? This trial started in March of 2007.   ",
      "MessageIndex": 2,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700706",
      "Title": "Dasatinib Trial for Stage IV Bone Mets ming JoyRebecca"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Feb 20, 2008 04:46PM ming wrote: Tender - maybe I'm misunderstanding. I will have had three hormonals for mets: femara, faslodex and tamoxifen. The research nurse didn't tell me I couldn't have three. Not sure if that is what you were saying. Maybe you were saying it's a bummer that no other chemo or hormonals can be taken along with the dasatinib (other than Herceptin). I would be coming in taking nothing but the dasatinib. My zometa would stop for the period of the trial. So scan results will really make a difference in this decision. If only minor progression this might be good. If more progression this might not be such a good trial - we might want stronger \"regular\" chemo like Lori is starting. I think Musa discussed this issue in the bcmets archives. And I'll talk with my onc next week. Sure would love to hear from someone in this trial and how they're doing. Thanks Tender and Lori - Lori good luck with your new tx.",
      "MessageIndex": 5,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700706",
      "Title": "Dasatinib Trial for Stage IV Bone Mets ming JoyRebecca"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "ming wrote: Over on BCMets Musa gave us a link to cancercare telephone conference yesterday regarding options for stage IV treatments. I signed up and listened. One of the drs spoke of a clinical trial for dasatinib for patients with stage IV breast cancer predominantly in the bones. I went to clinicaltrials.gov and found this study. It is a Phase II trial identifier NCT00410813. I have my pet/ct tomorrow and onc visit next Thursday. If progression, and we think there might be due to rising tumor markers and liver enzymes, my onc wants me to give up on hormonals and do the taxol and avastin/sutent trial. I have called the local contact for the dasatinib trial and they are sending me the packet to discuss with my onc. Has anyone taken this treatment? I think this is a src or sarc inhibinitor. Any help on this would sure be appreciated!! Ming - my grandmother name Dx 10/17/2005, ILC, 6cm+, Stage IV, Grade 2, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700706",
      "Title": "Dasatinib Trial for Stage IV Bone Mets ming JoyRebecca"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Aug 26, 2007 05:26AM ming wrote:",
      "MessageIndex": 2,
      "PostDate": "26/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/684757",
      "Title": "New at this and seeking opinions margieb Annie62"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Nov 28, 2007 10:09AM ming wrote: Thank for checking on me. I go this afternoon for the pet/ct scan. Since your thread got me thinking I signed up for bcmets and have been posting and getting some good information there. Seems to be quite a few with lobular mets there and we're discussing what scans are best to show lobular mets. Maybe you could read some of the thread - \"New to BCMets - lobular mets.\" I am to call Dr. Cristofanelli after the scans. I'll update about what scans show. I'll be praying for you as you go on the 12th. If this is mets at your ovary faslodex can help attack them! My next scan after I started turned things back around pretty well. Hope you do well too! One of the things I've read recently at bcmets (or maybe it was the lobular section here) is that it might be a good idea - and I'm gonna do it today - to get a note to the radiologist that I have lobular mets. They don't get that information and it can target them to look for \"thickening\" of some surfaces rather than \"tumors.\"  The trick will be not sound like a know-it-all who is insulting his or her ability to read and interpret the scan. I'm praying for just the right way and words to use.  I'll report how that went too - God bless ",
      "MessageIndex": 4,
      "PostDate": "28/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695490",
      "Title": "lobular mets? waterlily waterlily"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Nov 15, 2007 05:04PM ming wrote: I am wondering the same thing. I have been on faslodex since June after Femara stopped working. My tumor markers have continued to rise although a scan 2 months ago showed improvement. Tumor markers last week were 112 and they are scheduling another Pet/CT scan.  I told my onc about My local onc first said we could do a contrast CT which might reveal something a Pet/CT might not, but the nurse said she now wants the Pet/CT. If the scan shows progression we will move on to chemo. Like you I'm wondering if there could be lobular type mets that are not showing. I'm trying to get to see Dr. Cristofanelli at MDAnderson who is a lobular specialist. I wonder if lobular mets respond differently to chemo and need different tests? Me and my husband are trying to be calm and patient. Three other oncs have said lobular is not treated any differently than ductal. I have been told that lobular mets can spread to surfaces like LuAnn mentioned abdomen - and other areas I can't remember the word - something like serretal surfaces within the body. What kind of symptoms are you having?",
      "MessageIndex": 2,
      "PostDate": "15/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695490",
      "Title": "lobular mets? waterlily waterlily"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Jun 28, 2007 03:04PM ming wrote: Congratulations on this scan - this looks like a good treatment. I continue to pray for you.",
      "MessageIndex": 16,
      "PostDate": "28/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/642608",
      "Title": "Scan results jacqniel WendyV"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Aug 21, 2007 01:57PM ming wrote: Thanks - I love that aspect of forthemoment too. Tonight I'm going to take a little break in your honor from trying to figure things out and trying to know the answers and just live forthemoment just separate from past and future. Thanks.",
      "MessageIndex": 12,
      "PostDate": "21/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/681256",
      "Title": "New treatment plan in place... ForTheMoment jacqniel"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Aug 21, 2007 01:26PM ming wrote: Erin - yes we are praying for you as you start this new treatment plan. I would love to know what \"forthemoment\" means to you and how you picked it for your name here. It makes me think of things like we're upset or afraid but only forthemoment. Mostly we're fighting and knowing we're in God's gentle,powerful hands not left alone.",
      "MessageIndex": 10,
      "PostDate": "21/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/681256",
      "Title": "New treatment plan in place... ForTheMoment jacqniel"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Aug 16, 2007 10:52AM ming wrote:",
      "MessageIndex": 2,
      "PostDate": "16/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/678360",
      "Title": "Scan results :( Kasey Buzz"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Jul 8, 2007 06:48PM ming wrote:",
      "MessageIndex": 6,
      "PostDate": "08/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/650000",
      "Title": "Anterior Mediastinal Mass boobbuster katie11"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Aug 20, 2007 10:26PM ming wrote: So glad to hear you are responding to this tx. Praying for you -",
      "MessageIndex": 16,
      "PostDate": "20/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/679754",
      "Title": "From physical exam - slight improvement joanne1428 AusAla"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Jul 14, 2007 05:02PM ming wrote:",
      "MessageIndex": 15,
      "PostDate": "14/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/652876",
      "Title": "Not the news I expected... RobinWendy RobinWendy"
    },
    {
      "AuthorID": "ming",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/22213/profile",
      "Content": "Jun 22, 2007 07:29PM ming wrote: Kari - glad things are looking good and that you're feeling good.",
      "MessageIndex": 15,
      "PostDate": "22/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/638181",
      "Title": "Latest MRI Good KariLynn ming"
    }
  ]
}