{
  "AuthorID": "MiniMacsMom…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
  "Posts": [
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Sep 27, 2012 06:15AM MiniMacsMom wrote: How long were your drains in before they pulled out.  Mine pulled out about 4 days after surgery and I was down to about 50ccs a day.  I got a tiny bit of swelling but nothing really bad.  Its not the end of the world!  As long as your fluid output has started decreasing you should be ok! ",
      "MessageIndex": 4,
      "PostDate": "27/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/794084",
      "Title": "Breast drain pulled out by accident....seroma started gonzard222 gonzard222"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 15, 2012 09:48AM MiniMacsMom wrote: Veronica:  I think based on what I looked up the D docitaxol is usually refered to as T here or taxol.  A lot of women are on this treatment, the FEC or FAC (adriamiacin or epirubicin).  Some hospitals do the taxol first then the FEC.. I am on my taxol and then I start FAC in February.  I hope this helps you be able to search the forums better so you can find more info :)  I do know that the FAC combo can be kinda creepy the first time because the E/A part is red.  Good luck, I hope you find the info you need :)",
      "MessageIndex": 3,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781036",
      "Title": "Have you had the FEC -D protocol? VeronicaX VeronicaX"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 5, 2011 04:44AM MiniMacsMom wrote: I was initially offered the trial by another onc, but ours refused for us.  We were going to refuse anyway because I didn't want to risk being on the \"AC\" only arm which wasn't an aggressive enough treatment by our or our Onc's standards.   I am surprised they are still running the trial, though the meds from avastin are free, some insurances won't cover complications due to avastin now because it was revoked by the FDA (we had been told).  Tower:  Wow, thats terrifing, its wonderful to hear you are doing well.",
      "MessageIndex": 4,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779016",
      "Title": "Avastin clinical trial for Stage 3 BC myrtle1 Kay_G"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 6, 2011 04:30PM MiniMacsMom wrote: One leg of the trial (that was proposed to us) was just the AC, no AC-T or  AC plus avastin.  Our onc didn't the the AC was a strong enough approach.  I still have a superclavical node and some pet scan low grade activity in my armpit that my surgeons from home missed.   I am now on Taxol x12 the FAC in February.  Its routine chemo for MDA.  :)  I know I could pull out of the trial if I got the AC leg, but I just didn't feel comfortable doing that.  Also, I would have had to move to a different city or travel for a year if on the avastin :(",
      "MessageIndex": 7,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779016",
      "Title": "Avastin clinical trial for Stage 3 BC myrtle1 Kay_G"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 9, 2011 09:23AM MiniMacsMom wrote: Alright, I just got tested today and the counseller told us about this possibility.  Now, I am not an expert and I could be wrong but she said that if you are unspecified they don't know what the difference does.  There is the normal gene and the BRCA mutation but the unspecified is a mutation on the BRCA gene that is not the same as the BRCA mutation.   Does that make sense.  She said that they would \"follow us\" for a few years until the could pinpoint how or why the mutation works.  She also said the more people in your family that are tested for BRCA that have your unspecified variant (the better it is for understanding your type of mutation).  I hope this helps and I hope someone comes along who has gone through this and can help you :)",
      "MessageIndex": 1,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/779309",
      "Title": "BRCA 2+ Unspecified Variant anyone?? sanbar8771 sanbar8771"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Oct 2, 2012 02:28AM MiniMacsMom wrote: Oddly enough, you can get a second opinion NOW before you start rads.  They won't change your chemo plan, but the rads team at MDA is AMAZING and their pathology department is some of the best in the world.  The path regionally at home said I had clean margins, MDA reviewed more tissue and their slides and said my margins were not clean.  I had a revision surgery and then rads at MDA.  I did 12 weekly taxol and then 4 x FAC... My MDA Onc said that protocol allows for the maximum allowable doses of chemo.  There are reasons behind why different doctors do different things.  A lot of chemo is regional.  At home I was given the \"choice\" of 3 regimines... TAC x6 /  DD AC + DD T / or DD AC + Tx4)   At this point, you are getting what is considered to be a normal treatment for stage 3 and their is no point in worrying about it since you can't change it.   If you do go to MDA, I used Dr. Bucholz as my RO and I LOVED him... was kinda unsure about him at my first apt, but he quickly became my favorite Dr.    Also Dr. Strom has an amazing bedside manner.  He is fun and spunky.  Didn't meet any other ROs ;) ",
      "MessageIndex": 10,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794174",
      "Title": "Chemo question. NicoleJasien NicoleJasien"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Aug 21, 2012 06:54PM MiniMacsMom wrote: I can tell that there is a little swelling, no one else can really tell.  With 3x per week mld this summer while I was getting rads in tx we had my swelling down to a 5% difference, which was great!  I know its not that low, but its mostly what I can feel not see, if that makes sense.  We haven't been measuring and I didn't get a copy of my TX measurments to know what my arm is doing.   I don't try to fall asleep it in, its more of a result because its so relaxing :)  Once the kiddo get full swing into his half day preschool I will prolly try to get it done earlier in the day so I can wrap before bed until I get my solaris.  I am in an pseudo appeals process to get a night sleeve, but they don't cover anyone locally, nor do they cover the place that was recommended in TX :( Ugh.  I do have great coverage on garments and my flexi was paid for at 100%.  I just need to get in a better routine with all of it, without having to be completely consumed by it.  I had a total of 30 lymphs removed between two surgeries and 30 rads, so this is part of my new normal :( The fitter did stay the whole time, but I guess I didn't know what I was supposed to be feeling.  It just seemed weird to me that I felt like I was getting better results before the fitter came when the hubs and I experimented with it.  He, by the way, is super happy to be released from having to help me do MLD on my back every nights, so I don't think the machine is going to get to disapear :)",
      "MessageIndex": 2,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/792325",
      "Title": "Flexitouch fit MiniMacsMom MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So I have had my flexi for a few weeks and had the fitter out and all that.  I am wondering what your fit feels like.  She said its supposed to be pretty tight fit all over.  I have the harness system for my right arm.  I find though that when I fall asleep and wake up a few hours later, it feels to tight.  Also, with the system being fit super snugly the pump channels feel very firm.  MLD is supposed to be soft and gentle, so I wanna make sure I am doing this right.  The lady who fit it is a former Lana therapist.   Thanks.  I have a 2 year old and I can't keep wrapped all day with food and diapers and such.  One of the lana PTs I have seen in the past used to get mad at me for non-compliance, but its really hard to comply when everything you are supposed to do ends up taking so much time :(  Sometimes I feel like its more harmful to keep taking my glove on and off as much as I have to, so the flexitouch is pretty great for our family. Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/792325",
      "Title": "Flexitouch fit MiniMacsMom MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jun 14, 2012 10:58AM MiniMacsMom wrote: Thats great that there is concentration on this. I was thinking more along the lines of growth externally then inplant instead of growth from within. for instance wne making new tissue they baste a graft form over time. Once it reaches a certain volume they transplant. Maybe someday. :-) that way they could more easily control the start and stop volume. My science background is being resurected without full brain capacity!",
      "MessageIndex": 2,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/789099",
      "Title": "Have researcher tried to grow lymphnodes invivo. MiniMacsMom Binney4"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: so they can grow skin, viens, small organs..... Why cant researchers grow us new lymphnodes. I just had a resection surgery post chemo to clean up my umx and they took All of my lumphs. 13 from the umx 17 now. Im already starting to have more swelling issues than before. i s it because we dont have enoug presence or that lymphs arent as exciting as growing a heart. Sorry for the venting. Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/789099",
      "Title": "Have researcher tried to grow lymphnodes invivo. MiniMacsMom Binney4"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 9, 2012 06:30PM MiniMacsMom wrote: All the Taxol info I got from the hospitals says it can.  The more condensed your dose, the harder it will hit your WBC.  I am on the weekly taxol and I have been tracking my CBCs on a spreadsheet (gotta love a researcher ;) ) anyway, my WBCs were slowly dropping from 6.2 ku/L on week one to 5.3 on 5.  Not much of a drop.  I started taking B6 and a mutli-vitamin for preventing neuropathy and my WBC jumped to 6.9 ku/L on week 6 and its gone down a little for week 7 (only took the vitamins once last week.)   Now my doctor says CBCs like that are expected on weekly taxol because its more \"gentle\" than DD or Tx4 But my nurses say my CBCs are abnormally good even for weekly taxol.  Who knows. I hope your CBCs pick back up for you next treatment.  good luck and I hope you get more answers. Also take a look at your Abs neutrophils, they are the baby WBC (like the batters' on deck) growing up to take over for the WBCs, so if they are low your WBCs aren't prolly going to go back up. ",
      "MessageIndex": 2,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780180",
      "Title": "Does Taxol also lower WBC? TectonicShift MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Nov 26, 2011 09:20AM MiniMacsMom wrote: That would definately be something for her to discuss with the oncologist, its definately a scary concept of dying from the chemo, BUT she should still seek one or two or even 3 different medical opinions about her specific chances of having a reaction to the chemo.  She may not be on the same chemo as your moms' were... I am new to this, but I can definately understand how difficult it would be for her. If chemo is that scary try to get her to at least get the cancer removed.  I did, I had a single mastectomy on my right side and I was cuddling my son the day after.... and holding him on the other side within a week or so.  I am a little over three weeks out and I can now do almost everything I could before!  I just have a little more range of motion to get back.  Cancer is basically an overgrowth of cells, every single person has microscopic little cancers but its our immune systems job to step in an remove or fix the cancers.  Our bodies have many systematic redundancies to make sure these overgrowths don't happy, but when things get miswired and the redundancies don't work we get the microscopic cancers.   When the immune system malfunctions our cancers get out of control.  I have lived a very holistic low chemical green lifestyle for almost 3 years now and it did not prevent my cancer from getting out of control.   We eat organic, use all VOC free products ect.... and I still had a 9x6x5cm tumor stage 3 agressice with 5lymphs involved ;) Goodluck with whatever happens, I will send good mojo your way ;)  Again,",
      "MessageIndex": 49,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Nov 25, 2011 10:52AM MiniMacsMom wrote: Fufu:  I am in a similar situation to your relative.  I found my lump after nursing, now stage 3 high grade aggressive. I am willing to \"go through this with her\"  I don't have a young women's support group locally and I am a stay at home mom to my 16mo old son.  I start my chemo on Monday after getting my second opinion at MD Anderson in TX.  Basically I have been told that chemo sucks but that its managable.  Do I want to do chemo, NO but I will do anything to spend every second I can with my son :)  My tumor was huge and in my lymphs also, so I understand her hesitation.  It seems like there is no point, that everything is already over, but its not true.  The treatments work. and a good center will make sure that she gets the best treatment with the lowest side effects.  Also there are tons of meds I have been given to manage the treatments.  That being said, I have been told it will be a sucky 6 months, but I will trade that for a wonderful 20+ more years.  Good luck, it sounds like she is lucky to have such a loving wonderful friend who cares so much about her.  Keep caring, she will need the support no matter what decision she makes in the end!",
      "MessageIndex": 6,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 24, 2013 02:07PM MiniMacsMom wrote: Kelley. That's wonderful that u have souch help. My mom would come for chemo weeks and we had other help on and off. I know the feeling of feeling grateful but resentful that u need the help :( my hubbys grandparents were here for 4 solid weeks at the end of chemo and tried to help with stuff.... anyway. D was a great crib sleeper but we didn't have a choice. The PEDs recommended putting a tall baby gate on his door in case he got up early. That way he could get out to explore or fall down the stairs. Its definitely helped. The hubs put it up so we can still shut the door to the room. D can open the door but the gate stays shut. Hope things start to settle for you soon! Hugs.",
      "MessageIndex": 40,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/799080",
      "Title": "Path report kelly279 pupfoster1"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Nov 26, 2011 07:24AM MiniMacsMom wrote: I believe, I could be remembering this wrong that 1% of people get an infection during chemo and 0.5% die from the infection during chemo... Compared to her comparable mortality risk, I would say its worth it.  And that is from chemo for all ages, including the really young or old who are more immune compromised than your average person :)  My onc told us this like 2 or 3 weeks ago, so feel free to correct me, but I believe its what she said.",
      "MessageIndex": 46,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 19, 2013 04:19PM MiniMacsMom wrote: I have a similar pathology to urs. I just had my 6 mo check up and I'm all clean. Treatment sucks my son was 16 mo at my DX but he is doing well. Also I had complete response with the tumor that was left after mastectomy. Most of us do really well. Mda statistics say 78 % survival at ten years. Being young also helps. Your healthy and ready to fight. Big hugs. Pm whenever u want we are all here to support each other.",
      "MessageIndex": 15,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/799080",
      "Title": "Path report kelly279 pupfoster1"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 23, 2013 06:10AM MiniMacsMom wrote: Kelly, I definately found that there are some consequences with the little one.  They may not seem noticable to others but are definate to me.  Some I love and some not so much.  For instance, he is SOOO compasionate.  When a baby is crying in the store he wants to make sure its ok.  When mommy gets an ouchie, he wants to kiss it and give me hugs.  More so than some other kids I have seen.  On the down side he tends to be more moodie.  For instance we went to TX for 3 days for my check up and my mom came to stay with him.  He had fun with my mom but he has been cranky and clingy since I got back.  Its been a few months since momma disapeared so I think he was getting used to his new normal.  We had prepared him for us to leave but when we would call he would hang up on us.  Its normal from hwat I understand, but annoying.  When I had my first surgery he was 15 mo I could only let him sit on my lap at first, no holding.  Then gradually moved up to holding after about 2 weeks, with approval.  I had help with my first surgery, my second I didnt.  So we tried to prepare in advance.  He was around 22 mo for the second surgery so we deconstructed his crib and put the mattress on the floor with the toddler rail up.  He has done really well with that.  I wasn't able to lift him for 2 weeks, but I was on my own, so we improvised.  We got lots of stools so he could climb in his chair easier and wash his hand.  It really helped.  D is super cuddly but also very self sufficient.  When I was on chemo and really sick and alone I would \"talk\" him through how to get to things. So he is really great at figuring stuff out.  You do what you have to do to get through it.  Will there be issues he has to deal with, YUP but I was told by a child therapist that as long as they are loved and surrounded by love nothing that happens is insurmountable.  Other quirks are my hair, he didn't care about my hair when I had long hair but after being bald and now with short hair he loves to run his hands through it.  Mostly just a bunch of little things.  But he is also 2.5 now so a huge part of the problem is his age as well now ;)  It sucks and their are no guidebooks for kids this age, just do what feels right for your family!  At first we just said mommy had an ouchie boobie, now we are starting to define it more as mommy has a cancer boobie.  We were told that around to they start to need to know the difference in ouchies or they will think they have to have surgery if they get a small cut :(  it helps to define the severity of ouchies.  Its weird but he does seem to understand.  And when other little kids ask I always make sure to say I have a cancer ouchie but its not contagious.  Gotta love the little things!  Sorry, its alot of info, but we have learned a lot on this whole journey.  :)",
      "MessageIndex": 30,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/799080",
      "Title": "Path report kelly279 pupfoster1"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 4, 2012 05:32PM MiniMacsMom wrote: I guess the rotters node is an intermammary node... I thought it was under my collar bone but I guess its just a little lower down on my chest.  There are some pretty scary stats about the subclav lymph.... :) ",
      "MessageIndex": 3,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781962",
      "Title": "Rotter's Lymphnode MiniMacsMom Grace59"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: For some reason, I have had a resurgence to re-research my reports and such.  Well i made a mistake before, apparently I thought I had a subclavicular lymphnode involvement but I really have right subpectoral node (Rottor's lymph node) per my reports at MDA.  Is this better or worse or the same.  I know the SCL is not great in terms of prognostic tools, but from what I understand the rotters node is not a subclavicular.  I can't find a lot about it ;)  Any info is welcome.  Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781962",
      "Title": "Rotter's Lymphnode MiniMacsMom Grace59"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 13, 2012 11:43AM MiniMacsMom wrote: There are also prothesis you don't have to have pocket bras for.  Just got and amoena Contact breast form and I love it.  I had a UMX and I like my original \"young person\" bras.  I know there are cute MX bras but they just don't fit me right.  Anyway, as long as the dress is fitted well I think something like that would work just fine.  The structure of the dress holds it up, not the boobies!  I am sure a great salon will be able to help you find something to make you beautiful )",
      "MessageIndex": 15,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/765758",
      "Title": "Wedding Dress Shopping bimmer2011 MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Aug 24, 2013 09:01PM MiniMacsMom wrote: Dpms: i will say i havent had fat grafting yet. But i do have scar tightness. i see a really amazing theraputic massage therapist about 1/2months and she is amazing. its really helped my scar tigtness/range of motion. she spends an hour on my scar area and it feels so amazing. it might be something to consider until she can get the fat grafting done.",
      "MessageIndex": 9,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 6, 2011 06:16AM MiniMacsMom wrote: I am no le expert but when i had my first chemo, via iv on the left, my le arm is the right they put the bp cuff on my leg. the nusre said it would be a little lower but it would still work. Just my experience, :-) good luck!",
      "MessageIndex": 14,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/778992",
      "Title": "What are negative effects of taking BP on lymphedema arm? MrJoseph serenitywisdom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 20, 2012 03:02PM MiniMacsMom wrote: Thanks guys.  The list idea is HUGE.  My mom is coming tomorrow and she is amazing.  I don't have to worry about a thing.  Its like crazy 1950's stepford wives.  I take a nap and when I wake up the house is clean, the baby is fed and happy and playing and she is painting my house or working on some other long term project.  Don't know how she does it, she puts me to shame ;)  Anyway, she is going to help me make a project list for the SIL.  I love my SIL but in small doses.  I like to spend time with her, but with other people already being here, it just seems overwhelming.  My SIL is very caring, but sometimes a little self involved.  Granted we all get that way, but she is the baby princess in the family, so her moreso than some ;)  Thanks for listening.  Its a great idea about the project lists and to inform everyone upfront that its a do-your-own laundry and meals situation.  I kind of took for granted my dad would know that when he visited last week ;)  Big Hugs!  I feel much better now. ",
      "MessageIndex": 12,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781346",
      "Title": "Venting: She understands it won't be a fun visit... MiniMacsMom myrtle1"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: What are your family and friend boundaries.   I am on weekly taxol, #8 this week, post UMX, with an 18 month old.   In terms of SE, I am just now starting to hit my wall. This week was my first achy nausea week so far.  But I am tired, wayyyyy tired all the time and cranky and moody.  My 18 mo old doesn't always sleep through the night and when he does I feel like the steroids or something have made it harder to sleep . Poor Hubby, anyway.  So far family has been coming to help.  Do dishes, laundry, ect so things are easier.  I have my FIL and Aunt IL coming to visit in a few weeks.  THe FIL is going to work on house projects and the Aunt is going to help with the 18mo old and other chore type things.  Now my SIL wants to come the same weekend.  I had my hubby call (his sis) and she says she understands that it won't be a \"fun weekend\" but she wants to come visit.  I don't know what to do. She says that its the best weekend for them to come.  I am a cross between pissed off because I don't get anymore \"best weekends\" right now.  This is a right now thing too, they are on the computer looking at tickets to come in 2.5 weeks or so.  No previous mention of a visit until after they found out other fam would be here.  I am kinda of mad about it.  I feel like I am having a me me me me temper tantrum and I should just let them come but shit, having them here will be so tiresome.  I love her dearly, but guests wear me out... helpers are fine, but I don't think she understands.  I donno.. stupid chemo brain makes my thoughts run on endlessly.  THanks for listening regardless.  Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781346",
      "Title": "Venting: She understands it won't be a fun visit... MiniMacsMom myrtle1"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 20, 2012 01:04PM MiniMacsMom wrote: Ugh, I talked to the hubby and I got vetoed.  He thinks it will be fine and they understand that its not about having fun.  I however, remain un-convinced.  I am definately not a last minute person in general.  I am much more of a planner.  I know she wants to see us, but it just bothers me that its so spur of the moment and it wasn't really, is this ok thing... but more of we are looking at tickets right now to come visit.  Oh well, I don't really have much of a choice anymore.   I tried to set up a care calendar and I have a caring bridge site where I posted the times I would need the most help, but it didn't seem to take.  Thanks for listening, I wish my hubby was more assertive with his family.  He tends to be the calmer more PC person but sometimes he just lets things go to easy. ",
      "MessageIndex": 5,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781346",
      "Title": "Venting: She understands it won't be a fun visit... MiniMacsMom myrtle1"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 8, 2011 07:31AM MiniMacsMom wrote: Maybe for the sake of forum sanity we should shut down this post and open another about general effect/affects (not good at grammar :) ) of BP or blood draws on a LE affected area and other locations to have blood or bp done.  I find the topic very interesting but the originator of this post causes too much controversy from the important part of the issue.   I really value all the advice given on this board, I troll off and on every day and the back and forth hurt feelings are sad.   So can we please put it all aside and start fresh?",
      "MessageIndex": 26,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/778992",
      "Title": "What are negative effects of taking BP on lymphedema arm? MrJoseph serenitywisdom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 16, 2011 07:32PM MiniMacsMom wrote: I am on weekly taxol, I get them on mondays and I have had 3 so far,  I am on taxol first then FAC, so I have not had any hairloss yet.  i just started thinning today a little and my bloodwork is still normal.  No drops in my WBC, platelets, neutraphils, ect.  The nurse was really excited that my bloodwork was so \"healthy\" on the weekly taxol.  Aside from some minor constipation (which Is easly fixed with smooth moves tea :) ) I have been feeling pretty normal on the weekly taxol.  Going into winter, depending on how careful you are able to be about staying away from sick people, you may not want to go on DD taxol and risk getting sick.  :) Good luck!",
      "MessageIndex": 1,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779654",
      "Title": "4 DD taxol vs 12 weekly taxol TectonicShift LuvRVing"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 29, 2012 09:41AM MiniMacsMom wrote: I have a sonicARE toothbrush with a uv sterilizer. We put it in the sterilizer everynight and its great. Also i see the dentist for a cleaning every 3 month during chemo :-) i actually went today and things are going well.",
      "MessageIndex": 11,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783362",
      "Title": "Pre-Chemo Haircut renaedarlene Momine"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 29, 2012 11:09AM MiniMacsMom wrote: Oh yeah, definately get the house as clean as possible.  My mom comes often now to visit (loves to see her grandbaby)  and helps me catch up on housework and whatnot.  But before I got my MX and started chemo she really really did a cleaning number on the house to make sure it was as germ free as possible.  When people come over we ask them to wash their hands or use hand sanitizer (right next to the door).  I also DONOT use the guest bathroom at all.   You can get biotene stuff on amazon shipped to you, or if you feel up to it and the germies are low in your area, I have seen it at walmart and walgreens so its prolly most places. ",
      "MessageIndex": 14,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783362",
      "Title": "Pre-Chemo Haircut renaedarlene Momine"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 21, 2011 02:51PM MiniMacsMom wrote: Tina,  Thank you so much!  I will definately make sure they do the MLD and the wrapping.  I saw two Lana PT down at MDA the last time I was there.  I guess we will just have to stay on top of it and make sure they come wrap me :)  Luckily my LE isn't so bad that I have really needed to wrap, but that also means I am not very good at it :(  Happy Christmas!",
      "MessageIndex": 3,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779724",
      "Title": "LE and Surgery on bad arm MiniMacsMom MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: I am on taxol and not really sick pers say, but there are definately foods I like that make me kind of disgusted right now.   I am trying to get foods in the house that I might actually want to eat.    What foods do you crave or love to eat during chemo.  Is there anything that is an absolute keep that away from me.   For instance Hard boiled eggs sound great but scrambled or any other kind of eggs just make me feel icky.... Chocolate always sounds good but fish sounds gross.   Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780597",
      "Title": "Ok foods and Oh No foods? MiniMacsMom gillyone"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So my solaris tribute finally came in YAY!  I got it from the only insurance accepted dealer in the region.  The fitter however specializes more in prothesis (leg/arm).  Based on others' experience he did a really comprehensive job of measuring, however I am having trouble with my hand.  I have worn it for two nights now and every night/morning I feel like I have super super bad arthritis.  Lots of trouble moving my fingers, but I don't have any real visible swelling.  Normally my LE feels achy but not like this.  This is advil popping kind of pain.  So last night I wrapped my hand and the pain wasn't there this morning.  Do you think the hand is too tight/too loose? Do Maybe I have arthritis and keeping my hand straight all night aggrivates it?  The rest of my arm doesn't hurt during the day/morning.   I will call the fitter on Monday but as he doesn't do much of this I am not sure how much he can help trouble shoot.  Thanks for any insight! Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797085",
      "Title": "Solaris tribute fit questions/troubleshooting? MiniMacsMom Kicks"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So, I know its early, but its kinda been worrying me.  In May I have to have surgery on my right side (my LE side)  to remove more lymphs and generally clean the margins.  I will already have gone through chemo and then I will follow with rads 4 weeks later.   Whats the protocol for surgery on an affected area, is there anything I should do to prepare, or something I should make sure is being done by the docs/nurse before during and after.   Everything I have found so far says to not even scratch the affected arm, so what is having surgery going to do.  So far my LE has been mild.  I don't wear my compression most days and I am comfortable with MLD almost every night.  But after the first surgery and then flight, ect I swelled to 20% increase in size over my other (non dominant arm).  Thanks a bunch, my brains not good a shutting down when I try to figure things out. Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779724",
      "Title": "LE and Surgery on bad arm MiniMacsMom MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 3, 2012 04:28PM MiniMacsMom wrote: So I go back in tomorrow to get re-measured.  We broke out our scale yesterday and I have lost 20lb since finishing rads in July and prolly 15 lbs since getting measured initially (long story).  I tried to get the insurance to pay for someone experienced but everyone seemed to be out of network.  The fitter I used is very nice and was pretty relaxed about having to send it back.  Hopefully it works better with the next go around.  I get my day sleeves from MDAnderson, but they don't do custom stuff like this :(  So I guess I have to give it a shot. ",
      "MessageIndex": 4,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797085",
      "Title": "Solaris tribute fit questions/troubleshooting? MiniMacsMom Kicks"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 4, 2012 03:57PM MiniMacsMom wrote: I hate being a guinea pig, but people have to learn on someone, at least with solaris  they fix it for free.  So my arm was reameasured at a half CM smaller From shoulder to hand.  And he is going to have the thumb made 2cm longer.  I have long fingers, and the thumb part was way below my knuckle.  We shall see how all this works.  I did order the Palmar Swell Spot along with some new wrap stuff, and a EZ Roller.  I have to say I am most excited about the bandage roller ;)",
      "MessageIndex": 7,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797085",
      "Title": "Solaris tribute fit questions/troubleshooting? MiniMacsMom Kicks"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 18, 2012 02:07PM MiniMacsMom wrote: I had both an US guided core biopsy and a fine needle biopsy.  With the first one, the bigger needle needed a litte incision, they requested that I not hold my son (anything over 10 lbs) for 24 hours.  My boob was pretty yellow/green for a few weeks, but they told me that would be normal.  The radiologist said that the bruising doesn't heal as fast on the breast tissue.   If possible, see if you can have help at home with the little on ;)  I know its a scary time but we are all here for you!  The sooner you know the sooner you can get better!  Big Hugs!",
      "MessageIndex": 15,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So can visiting a chiropractor help you lymphedema.  I saw a chiro today for the first time and I was very very out of whack.  She was fully aware of the LE and respected the need to stay away or be gentle with my right side.  Anyway, I have had some residual hand swelling from last weekend, nothing huge but enough for me to notice.  Its only been a few hours and my swelling is down.  I haven't done anything differently today vs yesterday.  She said that being in correct alignment can actually improve lymph flow....?   Also she showed me some pictures of lymph taping that chiros and PT can do.  She didn't say she wanted to or would but its half in tape that kind of swirls around the arm and you leave it on for 3 days.  She says it pulls the LE flow up the arm.  Is the a legit treatment or something just for atheletes?  I have never heard it before.  I am going to see her a few times a week to stay in alignment for the next few weeks as my finger numbnes/tingling is better also.   Thanks! Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/780201",
      "Title": "Lymphedema and Chiropractor MiniMacsMom kira"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 18, 2012 03:13PM MiniMacsMom wrote: Congrats Ker! ",
      "MessageIndex": 16,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780639",
      "Title": "27 Scared and Anxious Ker10 liveit56"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Oct 11, 2012 02:55PM MiniMacsMom wrote: Just a word on the flu mist.  Our son gets it, since his peds said it has a broader coverage of viruses than the shots.  BUT since its a live virus and I am only 6 mo out of chemo he said to pass on the mist for myself this year, our son D can get it after I get my flu shot.  He said next year I \"should\" be fine to get the flu mist, but that as far as he knows there really isn't a study on when its ok to get a live virus after chemo.  I haven't yet looked myself.  Its good to know about the side effects, I might try to pass on the new one if possible this year and stick to the old style shot in my non MX side :)",
      "MessageIndex": 5,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/793048",
      "Title": "New intradermal flu shots kayakgirl ksusan"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 30, 2011 11:13AM MiniMacsMom wrote:",
      "MessageIndex": 1,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/780228",
      "Title": "Military Spouces Help with BRCA Test Code for Tricare Lori-ann Tammy2012"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 19, 2012 07:58PM MiniMacsMom wrote: Its not an easy thing to do, but you have to do whats best for YOU.  For some that means not telling anyone, for others it means sharing everything with everyone all the time ;)  For me, I called a select group of friends and family and (maybe 10 people) and then to all the satelite friends and family I wanted to tell my hubby and I drafted a email.  We didn't want second hand info getting to people so we put in everything that we considered pertinent.  We then set up a Caringbridge account, that way we didnt' clog people's emails all the time for people to get updates.  For me it was less invasive.  People knew they were getting direct correct info as it was available and we weren't bombarded with questions ALL the time.   :)  They also now have a care calendar where people can sign up to help you if you need it, for food or house cleaning, lawn mowing, rides whatever/whenever you need it.  I also love that its password protected and you get total control over who sees your page.  For me though, mainly it was to keep people informed properly.  I didn't want any \"telephone chains\"  ending up where I am at deaths door...  It worked well for me but everyone has their own method.  Mainly you need to focus on YOU, whats easiest for you right now and what makes you happy.  These next few weeks are usually the hardest and most uncertain so minimizing your stress level is Key!",
      "MessageIndex": 1,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790809",
      "Title": "Telling people you have BC MarS676 gardengumby"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 17, 2011 02:35PM MiniMacsMom wrote: We have a front load Samsung model that we got last summer.  We do a fair amount of laundry, but I have done small loads no problem.  If I let the laundry sit for like two days without putting it in the dryer, it gets a moldy smell (I plead mommy brain after having my son :) but rewashing the load gets the smell out and my machine never carries a residual musty odor.  I do leave the door open from time to time just to let it really dry out but its not really needed.  Good luck finding your new machine!",
      "MessageIndex": 4,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/779666",
      "Title": "Washer Questions garnet131 barbe1958"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Sep 2, 2012 09:34PM MiniMacsMom wrote: I could be wrong but I \"think\" I remembered a journal art reposted on the forums a while back that said that fasting the day of may increase the effectiveness of chemo.  Please don't jump me, I could very well be wrong.  I personally wouldn't fast a ton, the weaker you body is the harder it will be to fight things off.  My docs pushed eating as much protein as possible to help speed healing.  I just found out that one serving of good chicken stock contains 5 g of protein and is pretty easy to keep down!   I ended up with the 72 hr nausea, I was mostly fine the first two days on FAC, but at the 2.5-3 day mark I got crazy sick.  My MO started giving me IV emend on treatment day.  If you do the IV emend on treatment it works on the 72 hour nausea much better than zofran and the other pills, plus the insurance will pay for it if its givin iv at the hospital or infusion center.  At least thats what my MO said/did and the insurance did pay for it.  It really helped me get through that tough spot.  In the end, just keep up good communication with your doc, and they can help keep you on meds to help with side effects.  I also remember articles I think on the effects of various relaxation techniques during treatments.  So I would google the chemo and yoga ect... they might help.  Good luck, I did a different chemo overall, but I made it through even though there were some  times I didn't think I would and during the every 3 week chemo, weeks 2 and 3 I felt well and was able to be active. ",
      "MessageIndex": 10,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792911",
      "Title": "Fasting and Chemotherapy borjo dlb823"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 14, 2011 02:05PM MiniMacsMom wrote: Pet scans carry an added risk due to the radioactive dye that is injected into you.  CT, MRI, Ultrasounds, and Mammograms carry less risk and are less expensive than PET scans.  If your biopsy comes back positive then you may still get a PET scan at some point but its not routine unless youhave a positive biopsy.  If you are not comfortable with your doctors or worried that they missed something, request copies of all of your scans (they may be on DVD) and make an appt with an NCI (National Cancer Institue) accredited center.  most NCI centers will have breast cancer specialists that are experts in their field!  They will be much less likely to miss something.  Good luck and I hope everything comes back normal for you!",
      "MessageIndex": 3,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779540",
      "Title": "What if they miss something? catlewis22 April2"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 12, 2012 08:42PM - edited Feb 12, 2012 08:42PM by MiniMacsMom Thanks guys, somehow this post got lost and not added to my favorites.  So thanks for the answers.  I am on week 12 of taxol tomorrow (woot) and I have my appt at MDA on Mon the 20th.  I think I am going to as the Dr if I can call him directly.  The nurse is such an idiot (or at least her non answers make her seem that way).  I finally added my stats to the bottom.  I am not triple neg, I am 99% er pos but stage 3 with an enormous tumor and Lymph involvement.  I would much rather have 8 weeks of extra chemo now than go through ALL this again in a few years :(  I really wish someone had told me about chemo testing when they remove the tumor but my regional hospital is not that great.  Oh well regrets regrets.   I'll let you know what the MDA onc has to say. ",
      "MessageIndex": 4,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780808",
      "Title": "Carboplatin Question MiniMacsMom MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 21, 2011 07:41AM MiniMacsMom wrote: No words.. My heart goes out to her family, especially her daughter.",
      "MessageIndex": 6,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779805",
      "Title": "Former miss Venezuelan dies at 28 Amyf Juliebell22"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: Has anyone heard of this.  I just got off the phone with my NP at MDA.  I asked her what rads I might be expecting this summer as I am trying to generate a timeline.  Apparently there is no notes in my chart from my multiple disciplanry hearing about what rads they were thinking.  She thought I might be getting radiation 2x per day for for weeks.  I know Eric Strom has an article on APBI with multi beam proton, but I was just wondering if anyone has done this, and if the APBI proton is two times per day?  Basically I am aksing for any info period on anyone who has done anything even similar.  Whats it like, did you get burned.... Sorry I dont' have more info, they say they won't know more until I see Dr. Strom again in May after my chemo finishes before my MX revision surgery :)  Thanks again!.  Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781964",
      "Title": "Radiation 2x per day for 4 weeks? MiniMacsMom purple32"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Sep 18, 2012 12:48PM MiniMacsMom wrote: Hugs! Where you are now with no info and a total lack of control is the hardest place to be in this whole process. Whether its cancerous or not its much easier to pull on your big girl pants once you know something. If it is, its not the end of the world though everyone is hoping its not. You are also entitled to have dark days and be scares. Its normal just try to not let it consume you 100%. Try to focus on your son and all the happy in ur life until u get am answer.",
      "MessageIndex": 8,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/792485",
      "Title": "28 and Worried Sick With Waiting BlondeBunni MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Mar 22, 2012 10:56AM MiniMacsMom wrote: K:  Good point about knowing your body will still be able to produce hair!  Oh well, I guess everone is different, but it was such an exciting perk!  I actually still have some hair on my head, not a ton and eyebrows and eyelashes.  I made it through taxol and 1 FAC with a fairly cute, though thin pixi cut!  Everything is a Trade Off.  My hair is really really thin now, but I am curious to see if it actually goes all the way with the FAC, my body just doesn't want to let go.",
      "MessageIndex": 7,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784468",
      "Title": "Do you still have to shave? MiniMacsMom MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So I started weekly taxol to be followed by FACin February.  i found out in Dec (after starting taxol) I am BRCA2+.  I have read that BRCA tumors have been shown to respond better to Parp inhibitors like Carboplatin, but how is it dosed.  Is it normally given with taxol, would I not get the FAC anymore and just get the Carboplatin when I am done with the taxol.  My onc at home is not the best at answering questions, and I don't go back to MDA until February.  When I ask the nurse quest at MDA she jsut says wait until you come to see the doc.  I want to call the doc, but at the first appt, the onc nurse said that I should always contact her first, but she really doesn't answer my questions.  Any experience with the Carboplatin is greatly appreciated! Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780808",
      "Title": "Carboplatin Question MiniMacsMom MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 10, 2011 03:57AM MiniMacsMom wrote: Congrats, thats an amazing Holiday gift!",
      "MessageIndex": 8,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779272",
      "Title": "just got home from mammo, 3 yrs NED! myrtle1 pupfoster1"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: Is this normal: after 12 weekly taxol and 2 rounds so far of FAC I still have to shave my legs and bikini like.  I was SO looking forward to this side effect, but it seems to have passed me up.  Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784468",
      "Title": "Do you still have to shave? MiniMacsMom MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So Thursday was the \"anniversary\" of my Dx.  I had my US/mammogram/biopsy on 10/24 last year and the results on 10/25.  I feel like I am having trouble not re-living those days last year.  Its kind of a weird feeling, not anxious per-se but almost groundhog movie ish.  For each of the major events post DX I remember the day/date clearly and how I was feeling that day.  I try to push it away, acknowledge it  but not think about it, but its making me cranky.  I don't want to think about it, I would rather think about the exciting fact that I am still here doing great.   Does this get better, will next year be easier?  Do you eventually forget so you don't think about \"those days\".  I would say 95% of the time I do well without anti anxiety meds or anything, so I really don't feel like going on anything like that.  (sorry if this isn't very coherant- my bf is having triplets who we just found out are coming tomorrow morning at 30.5 weeks, I am tired but wound up excited)  Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/795611",
      "Title": "How do you cope around your DX time? MiniMacsMom edwards750"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 28, 2012 10:27AM MiniMacsMom wrote: Mda bs: 6 mo check and done Mda ro: 6 mo then yearly for 3-5 years longer if theyblike you :-) Mda ro: 6 mo for a few year then yearly but i have yo go 6 mo for brca screenings Regional mo: monthly til blood work is normal then 3 mo for a year then 6 mo for a few years then yearly :-)",
      "MessageIndex": 252,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 9, 2012 05:51PM MiniMacsMom wrote: 27 Stage 3 BRCA 2+ (found out after)",
      "MessageIndex": 741,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 22, 2012 08:04PM MiniMacsMom wrote: 27 Stage 3",
      "MessageIndex": 748,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 3, 2012 01:35PM MiniMacsMom wrote: I am on the weekly taxol and I think its great. I am tired and cranky, but otherwise no other side effects.  I see a chiropractor now and the minor neuropathy like symptoms were just pinched nerves :)  I also take (though not with good regularity)  B6, L Glutamine and Acetyl L Carnatine.  I started this last week after treatment 5 and my CBC labs were up this week!!  I have more baby WBC now than I did pre chemo!!!  I have heard a lot of different opinions on the effectiveness of weeky vs  bi weekly.  I think both are superior to the 1 every 3 weeks, but  I don't think there is a diffinative answer otherwise on which has a better effect on progosis.   I know that going into the winter, with a little one and germies I needed the treatment that would be the kindest to my immune system.  Dr. Alvarez at MDA didn't give me the option for every 2 weeks, but I am really happy with the weekly treatments overall.  I still even have some of my hair on my head and all my other hair.  tmetz: interesting to hear it starts to grow after the 6th treatment, I will be looking forward to it!  I think its important to take into account your likely hood to get sick from germs on the treatments.  If there is a high chance of illness, the weekly is better because they will delay your bi-weekly chemo if you get the flu or something, which would reduce the overall effectiveness.  Good luck!",
      "MessageIndex": 11,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780279",
      "Title": "Taxol Regimen Question! youngmommy youngmommy"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 23, 2012 11:21AM MiniMacsMom wrote: This is kind of an experiential question for a situation I didn't know how to handle.  I was waiting in the Rads waiting room and there was one other lady, she was visibly upset and kept asking people who walked through if they had had brain radiation.  I was the only one left but I haven't had brain radiation.  She was very upset and I didn't know what to say or if I should get someone.  She just kept talking about how she was scared and just wanted to die, it would be easier than treatment.  I told her, honestly that I miss both of my granddads who had passed, even the one from when I was really young.  The most recent GMPA passed from metastatic prostate cancer when I was in college.  I treasure all my memories with him, and even though he was at peace and I got to spend some great time with him before he passed, I still miss him and wish he as here.  She said she didn't want to be a burden, but I wasn't sure what to say.  I told her that I wouldn't see my mom, if she was dealing with this as a burden.  She had been through chemo at a lower stage a few years ago and the mets were new.  I asked her if she had been on the forums, and told her the stage V section of BCO was a great resource.  I wrote down the site for her.  I got called back to my appt, before her.  I think she had been called but was ignoring it  because she was scared.  I told my techs that there was a woman in the waiting room who was really scare, if they could do anything.  In the future, what do you say.  I felt very inadequit, I didn't want to step on her toes... I didn't know if I should tell her things would be ok....  Sorry this is random, but it really bothers me that I didnt' know what to say in this situation. Please help. ",
      "MessageIndex": 598,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 22, 2012 04:44PM MiniMacsMom wrote: I was told no shaving no deoderant on rads side. The long hair grosses me out but its over soon. Honestly I havnt needed deoderant on that side and we have been in tx for the duration of my treatment. I havent sweated at all. The rads i think damages those cells some. Sorry for mistakes... on my phone.",
      "MessageIndex": 195,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 23, 2012 03:36AM MiniMacsMom wrote: There is great advice on the LE tread about lymphedema.  Basically when you get an injury to the at risk arm you want to rest, drink lots of water, take deep breaths through out the day, breath as full as your stomach can get and then let air out and compress your stomach as small as it can get, it stimulates the Lymphs in the stomach area, which is your largest concentration of lymphs... When your LE are is compromised and you get an injury, your body brings fluid to the arm to treat the injury and may not be able to get the fluid to leave. its harder to get it out.  When there is fluid buildup you increase your risk of cellulitus, a PTA infection... When doing rads or chemo any infection needed antibiotics will slow your treatment.  So they say minimize risk as much as possible.  Wear gloves and long sleeves hwen gardening, gloves when dishwashing, bug spray, no sunburn, ect.  I am only 28 with NO lymphs on my right side PLUS rads, so lymphedema is part o my new normal :(  But my arm looks normal with some work that we are doing, and over time, hopefully, I can decerase the amount of time it takes to keep the LE under control.  Sorry for the rant ;)",
      "MessageIndex": 209,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 26, 2012 09:15PM MiniMacsMom wrote: I have itching on the peripheral radiated area, but most of it is numb.  I can't feel when the draw on me, change the tapes or the itching in the main area.  Its actually been a major blessing.  I hope it proves to make it easier for you also!",
      "MessageIndex": 238,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 29, 2012 03:13PM MiniMacsMom wrote: If you have a SOMA I would try them I love my SOMA bras.",
      "MessageIndex": 263,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Mar 1, 2012 05:12PM MiniMacsMom wrote: momof2 : we really havent gotten much snow :( only about 1 in 2 times early in the morning before im up. Its so fun to play with them in the snow! You prolly have had a ton so its tiring but enjoy the snow angels!",
      "MessageIndex": 4,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783465",
      "Title": "My Crocuses are Blooming! MiniMacsMom AnacortesGirl"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 18, 2012 12:57PM MiniMacsMom wrote: Lynn this absolutely sucks... But its not the end of the world. If u r worried about the spinal spots ask the stg 4 ladies. They are genious when it come to questions like thats. The pet scan vs bone scans differences are interesting but if u are at an integrative center and you had a multiple disciplinary hearing thats a huge step and a lot of educated minds focused only on your case to come up with thebest plan. I know untils u have your difinative dx its petrifying but you will get through it. :-) we r here to hold ur hand and give hugs :-)",
      "MessageIndex": 7,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/782840",
      "Title": "recently diagnosed and it keeps getting worse kokonut ali68"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So, this may be not the place to share but I don't really care.  In 2010 we bought a house and then my son was born so we really didn't get a whole lot done.  So in 2011, in the spring I ordered a bunch of fall bulbs that came at the beginning of October.  The weekend before my US/Mammogram and subsequent DX my hubby and 1 year old helped me plant a whole bunch of bulbs in front of our house.  I have been watching the shoots come up for weeks now, every time thinking about that last \"normal\" weekend.  Though I guess it wasn't really normal because I had all these HUGE nesting instincts to get stuff done.  Anyway, when I went out to get the mail today the crocuses had bloomed.  It just makes me so happy to see them come up.  And know that as I continue on through this crappy FAC, I will get to watch all the other pastel tulips and daffodils come up.  I know this is sentimental, but its our first house and my first and now only baby.  It was just such a happy thing to see today.  Thanks for listening :) Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783465",
      "Title": "My Crocuses are Blooming! MiniMacsMom AnacortesGirl"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 27, 2012 10:34AM MiniMacsMom wrote: Holy Bejezez!  Thats amazing!  May we all join you at the 10 year mark (and beyond)!",
      "MessageIndex": 7,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783260",
      "Title": "Diana50!!!!!! ck55 kimf"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 29, 2012 11:33AM MiniMacsMom wrote: When I was admitted to the hospital two weeks ago, they put me on a special half peds/half cancer patients floor, so the nurses were very familiar with LE.  Luckily!  When I talked to the first nurse, she had her nursing student immediately print NO BP or pricks in right arm signs for both the door and above the bed.  It worked great.  Just another adition to all of the other precautionary methods. ",
      "MessageIndex": 23,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783244",
      "Title": "How do you get DR and nurses to recognize limits on arm use? lvtwoqlt kira"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 9, 2013 11:22PM MiniMacsMom wrote: I didn't get a pet but I had one before chemo with no mets. During chemo I got mammos and us and after chemo another MRI. Everything showed major shrinkage. Pathology on a revision surgery post chemo was clean. If you didn't have mets on a pet before chemo ask for an MRI. Its regional but much less radiation :). Hugs",
      "MessageIndex": 1,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/798629",
      "Title": "Follow-up PET Scan Angie57 MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 7, 2012 12:44PM MiniMacsMom wrote: Sent you a PM.",
      "MessageIndex": 7,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782305",
      "Title": "Anxiety venting and MD Anderson question Ysa Ysa"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 7, 2012 07:06PM MiniMacsMom wrote: Yeah, the initial cost is overwhelming.  My insurance.  United Healthcare paid for the second pathological opinion.  ITS WORTH IT.  They found out my KY path made a mistake and my margins were not clear.  Also.  Definately be prepared to stay the longer amount.  THough if you book tickets through their travel agent, they are medical tickets and if you get delayed coming home there is no hassel no fee tcket changes.  Do you have someone to stay with down there?  When you go to Houston, there is downtown Houston and then Medical City, so there is all the hospitals includng MDA.  Everythng you need is all in the Mays Clinic.  Don't be overwhelmed the whole collection of hospitals is huge though :)  I love the Mays clinic.   They will try to condense all your appts as much as possible, but sometimes its not.  If they want to do a Multiple Disciplinary Hearing with doctors from all aspects of your breast healthcare those are only on certan days.  You will have some down time so look into other things to do, lke the zoo or the parks.  Definately have books or a little laptop for wait time.  Things can definately get delayed :) Feel free to keep throwing questions out there :) ",
      "MessageIndex": 12,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782305",
      "Title": "Anxiety venting and MD Anderson question Ysa Ysa"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 26, 2012 05:39PM MiniMacsMom wrote:",
      "MessageIndex": 3,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781679",
      "Title": "Don't understand pathology. please help. Canchaser LuAnnH"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Nov 10, 2011 01:11PM MiniMacsMom wrote: Statistically speaking your risk is low.  I believe it is something like 80% of masses are nothing, BUT there is a growing fraction of us young pregnant or post pregnancy women who are getting breast cancer.  I absolutely do not want to scare you, but it is in your best interest/piece of mind for you to get this checked out.  It is also possible for a biopsy to be negative if they \"missed the tumor\".  The most sensitive test for breast cancer (as I was told) is an MRI,  it will light up on a lot of benign things though, so if you get one be prepared for more biopsies.  But again, especially with what has already come back negative and with statistics on your side we should be able to hope that its nothing confidently.  I hate these \"safety\" claused but its hard to give a definate yes or no!  The best thing I can recommend is get copies.  Get photocopies of your path reports and your doctors notes.  Get copies of your ultrasound and biopsy scans, so if something (god forbid) does happen in the future, you know where you started and when you were clean.  ;)  Best of luck and I hope you don't have to join our family!!! I am a newbie and as much as I love the support, I would rather be sleeping or playing with my son than trolling forums for answers and support!",
      "MessageIndex": 2,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777871",
      "Title": "only 29 do I need to worry about breast cancer? cmurtaugh Deep81"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 19, 2012 08:29AM MiniMacsMom wrote: I just got out of the hospital, via the ER with a rogue infection :)  Its definately a good idea to go.  And keep stressing the whole chemo thing.  She will get the best care that way.  I had 3 doctors checking on me everyday making sure they \"got it\"   They will also replace all her electrolytes and anything else that is \"off\" as well.  I really hope she gets better soon!  I know up here there is a really fast hitting virus goign around, which I somehow got exposed to, but for me was wayyyyy worse than for my son (who got it after). Big hugs and good luck.  I also wiped everything down or my hubby did.  They have those cleaning wipes in the room and we would wipe down the iv pole if I had to go potty or the bed rails and buttons if people came in the room and touched it.  Even though they are careful its better to be safe than sorry. ",
      "MessageIndex": 4,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782899",
      "Title": "Help! On chemo and with a fever! monroy01 sincitydealer"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 18, 2012 01:38AM MiniMacsMom wrote: One kind of backhanded positive is u get really fast really extensive care when u have to go to he ER. Granted my lips were purple but they were busy as hell and they got me in right away :-)",
      "MessageIndex": 22,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/782658",
      "Title": "So, you won the chemo lottery? TRY to find the humor! PlantLover fredntan"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Apr 11, 2012 12:59PM MiniMacsMom wrote: Thanks. I had an us this morning. There was a clear little cyst i saw on the left side. Couldnt see the screen for the right. The right feels more swollen. They said the offial results will get to my doc today.. so anxious.",
      "MessageIndex": 2,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/785615",
      "Title": "Can Chemo cause enlarged Thyroid? MiniMacsMom Megadotz"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 6, 2011 01:23PM MiniMacsMom wrote: I have an 16 mo old son, and I was DX 10/25.  I agree with Momof2inME, see if you can get your surgeon on Onc to do a PET scan prior to surgery.   If mine had, I wouldn't be going back in post chemo for a surgery revision to fix stuff they missed.  I am st 3, so I don't know what it feels like to have mets, but its better to be safe than sorry.  I think, though its only a really small percentage of women who are DX with mets on their first round!  I'm so sorry you had to join our family, good luck with your BMX.  I had a unilateral MX and it wasn't bad.  I didn't really have any pain the next day, even though I took pain killers for 2 or 3 days post surgery I don't think I really needed them.  When I went home, I just used a pillow when holding or cuddling my son.  I took it real easy for about a week and then started to gently do things like make food and stuff!  One thing I would recommend is getting to see a lymphodema therapist and having your arms measured in case they have to remove any lymphnodes, its hard to determine the swelling without pre surgery measurements :) (if you get it)",
      "MessageIndex": 3,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779100",
      "Title": "I'm probably psyching myself out....... Kite bak94"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jun 14, 2012 02:05PM MiniMacsMom wrote: Originally i was going to keep mine in. My mda breast surgeon recommended removing it rigt after chemo during my revision surgery. My onc agreed, he said he was very optimistic! I would do what you are comfortable with. I think for me seeing it would just be an everytday reminder. They said putting a new one in is just a hassel... Not a huge deal. Hugs.",
      "MessageIndex": 21,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787697",
      "Title": "PORT REMOVAL many MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So, I had a well-check on Monday and the PCP is sending me for a thyroid US tomorrow.  Apparently my thyroid is enlarged, he also ordered a bunch of blood work. Grrr.  I saw the Onc last Monday and he either didn't check or didn't notice the thyroid.  Thanks for any advice. Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/785615",
      "Title": "Can Chemo cause enlarged Thyroid? MiniMacsMom Megadotz"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 6, 2012 09:25PM MiniMacsMom wrote: Jag... the big thing my RO department tells me is protein.  They say choose protein over every other food group if you aren't hungry and have to choose a food.  They also say protein from dairy does not count.  I go to MDAnderson, so I trust they know what they are talking about.  Anyway.  Meat, beans, or nuts is what they push.  Says that it will help your body mend faster and less skin damage...  I had Adriamyacin as well, and my port was on my left side (heart side :) )  Makes me kind of worried about my heart.  I guess we all just have to be careful.",
      "MessageIndex": 74,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 25, 2012 07:23PM MiniMacsMom wrote: It depends on your treatment plan and your skin.  They were worried because with the bolus every other day for 2 weeks, my irritation came on after a week.  But it plateaued an didn't really get any worse once bolus was over.  I have 3 boosts left and I just started to itch.  Some reddness (mostly tanness) and some black heads from the skin flaking.  Other than that, my skin is doing ok. ",
      "MessageIndex": 231,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So I was just diagnosed with IDC on 10/25/11 and have a bilateral mastectomy on 11/3/11.  I need to have egg/embryo harvesting asap before chemo.  We were just told that our insurance specifically excludes fertility treatments of any kind.  I don't understand why the government covers breast reconstruction and not preserving the fertility of a person whose won't be allowed to have kids in the future is important.  I'm sorry, I have been dealing with insurance companies and stuff all morning and over whelmed.  Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/777369",
      "Title": "Newbie and overwhelmed MiniMacsMom rachelvk"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 10, 2012 05:42PM MiniMacsMom wrote: Oh, during your US if you need a biopsy, Dr. Santiago ( i think) did mine.  Its a she and she has a 2ish year old son.  She was great at putting me at ease, I was paniced since my old hospital told me I was NED after my surgery :(  Anyway if they let you ask, shes great!",
      "MessageIndex": 29,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782305",
      "Title": "Anxiety venting and MD Anderson question Ysa Ysa"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "May 10, 2012 07:15AM MiniMacsMom wrote: So my mda mo said you should never check your thyroid during chemo because chemo can damage the thyroid... I do have an enlarged thyroid with one mass in each side. The kind that are more likely to be cancerous. I guess ill just have to wait and follow up in a few months.",
      "MessageIndex": 3,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/785615",
      "Title": "Can Chemo cause enlarged Thyroid? MiniMacsMom Megadotz"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 16, 2011 04:34PM MiniMacsMom wrote: I thought the same thing, before find out my BRCA status.  But there are many cons to being ovary free that you have to be prepared for.  There is the obvious menopausal state and the hot flashes and such... but also the significantly increased risk of hear diseas and bone loss as well as many other.  They say all things considered, ovary removal early can significantly lower your lifespan, though when going through treatment a 10 year decrease from 80 years doesn't seem like a whole lot when the average survival for stage 111 BC may not get us to the 70 to begin with depending on your age.  If you search there are a few threads dedicated to pros and cons of ovary removal earlly.  Good luck, its definately a hard decision to make. ",
      "MessageIndex": 4,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779623",
      "Title": "Removing Ovaries CherylinOhio cinnamonsmiles"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 7, 2012 08:25PM MiniMacsMom wrote: YSA:  You don't have to have those papers.  Its recommended but not absolutely needed.  :)  No stress on the advance directives and such.  I believe they have forms you can fill out there except for the power of attorney one.  Galsa:  Yeah, they practically shoved the cancer resource down my throught.  I don't know how the travel works... if its on all the plans or if its an amendment to each plan.  I just know mine has it.  The nurse I talked to was really nice though and not pushy :) ",
      "MessageIndex": 23,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782305",
      "Title": "Anxiety venting and MD Anderson question Ysa Ysa"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Nov 10, 2011 04:37PM MiniMacsMom wrote: I was in your shoes \"a few weeks ago, and it gets both easier and harder.  I had my Mastectomy (rt side also) on 11.3!  At this point, I know the pathology of my cancer and what treatments I get.  My uncle who is a Dr. Said it best, He said \" Oh Shit girl, strap on your boxing gloves and be prepared for one hell of a fight\"  Despite the fact that \"failure is not an option\" is now our family motto, you will get scare, and angry and up set.  Its not all sunshite and positive attitude all the time.  Greive, feel the emotions, talk at home, talk on the forums, start a family blog... There are alot ofthings to do.  I started a blog on caringbridge.org thats private but I can update my family :)  I don't have to call everyone or wait for things to get distorted in the food chain, they can check on us without being invasive and leave little notes of encouragement.  It helps.  I am not sensored on the blog, tell people how you feel.   Its ok to be terrified. No one wants to leave their kids... I say this and earlier today I was crying during a cat scan praying for no mets...  Everyone on here is here to support you, I have learned that much in two weeks!  Sending you all the best wishes from our home!",
      "MessageIndex": 18,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/777865",
      "Title": "Terrified. New here. AmyLB maryhelen"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Mar 2, 2012 12:19PM MiniMacsMom wrote: No pictures today, we are right in the pathway of that big tornado storm :(  BOO!  (not that my pictures are much to see, we haven't mulched or anything yet) But the storm is terrifying.",
      "MessageIndex": 10,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783465",
      "Title": "My Crocuses are Blooming! MiniMacsMom AnacortesGirl"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 29, 2012 07:07AM MiniMacsMom wrote: MDAnderson prefers aquafor but I couldn't stand the goopy-ness.  I also didn't liek that it was petroleum based.  My gf who works for an RO says her RO says ONLY aloe... I think they are all different. ",
      "MessageIndex": 260,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Nov 2, 2011 07:33PM MiniMacsMom wrote: So, I have my own update for people.  I guess it's called \"fertility preservation\"!  Fertile Hope in conjunction with livestrong will send you one courses worth of 4 specific types of fertility drugs if you qualify.  AND some doctors will give discounted rates.  The process with livestrong is very fast, as long as you have the paperwork in, it can get approved the same day and the drugs sent same day or next day.  This can be a savings of up to $4500!  Our reproductive endocrinologist actually told us about this.  It doesn't cover anything but these 4 specific meds, but thats still a HUGE savings.  The patient paperwork is easy, the biggest qualification is income limits and for a couple you have to be less than $100K.    The oncologist and fertility doctor paperwork is also a page or so!!! I am sure this is posted somewhere else, but... it helps.   At 27 my husband and I had to bring this up and INSIST we are given the option of finding someone to help us.  The surgeon was going to just send us to chemo 3 weeks after surgery and we could be screwed in the end....  The fert specialist says we can have this done in 2.5 weeks since I am not infertile now and I don't need all the extra time to follow a normal cycle!!  There is HOPE!",
      "MessageIndex": 3,
      "PostDate": "02/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/777369",
      "Title": "Newbie and overwhelmed MiniMacsMom rachelvk"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "May 21, 2013 03:26AM MiniMacsMom wrote: I see a chirpractor but honestly her massage therapist isnamazing and gives me more relief. She is young and a metastatic ovarian cancer survivor. ned 7 years. she has the same problems i have just in her groin area. my point is that she is caring and experienced at theraputic massage. at my last sessions she found an inflamed nerve and helped ease it. it sounds like hoopla but shes wonderful. it would prolly take experimentation to find someone skiled enough to help but thats whatbhas worked te mostbfor me.",
      "MessageIndex": 5,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/804380",
      "Title": "chiropractor? fredntan fredntan"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 7, 2012 07:38PM MiniMacsMom wrote: They should get you in fast.  They called me on Tues and wanted me there Friday but I didn't have my drains out :)  Also, with UHC, our has a cancer service to call for help and advice.  They told me about a program where they re-imburse you up to 10K in travel expenses to one of 22 \"Cancer care of excellence\" centers in the us as long as you are 30 mi or more away for one.  It covers mileage, flight and housing costs.  I am not sure about your plan, but it wouldn't hurt to call.  I also have a Myuhc account and I can check my insurance billing live.  Wth MDA It was all covered snce I was n my out of pocket but MDA billed one insurance code wrong.  I got a $500 bll and had to call them and have them re-bill it :)  It was pretty simple.  Since all the doctors work for MDA you should only get one bill.  Its pretty awsome compared to getting like 8 different bills for my MX.  I think they pathology for the biopsy was only like 200 and the BC tumor path was like 800.  Hope it helps. ",
      "MessageIndex": 14,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782305",
      "Title": "Anxiety venting and MD Anderson question Ysa Ysa"
    },
    {
      "AuthorID": "MiniMacsMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "MiniMacsMom wrote: So I have really small wristes and an Medi non-custom glove and sleeve.  I got the sleeve last november and a 30/40 glove with it.  IN Feb at a check up at MDA the lana tech switched the glove to a 10/20 and kept it.  The wrist on both types is large, but the 30/40 was so much tighter I didn't have issues.  After my surgery 2 weeks ago where they removed my last 17 Lymphs, I have been having swelling issues all day.  At night I wrap during the day I wear a sleeve and a glove (I ahve a two year old and I can't keep it wrapped during the day).  Anyway, During the day my wrist seems to collect fluid beneath the glove and the sleeve.  I am going to go hunting for a new glove sleeve combo, but If you have any recommendations I would appreciate it.  going shopping with a two year old to a medical supply place is not so fun.  I won't have an unlimited amount of time to experiment.  Granted my overall arm size is still small.  I have been very anal retentive about being proactive, but I can tell a difference even if the general public can't about my arm size. It is measurable.  In Feb the Lana tech talked about getting a night sleeve and a fllexitouch.  At what point do you decided you need to invest in a 10K machine, or in my case 2k because the insurance only ever covers medical supplies at 80%.   Thanks Diagnosis: 10/25/2011, IDC, 9cm, Stage IIIa, Grade 3, 4/15 nodes + Rotter's Node, ER+/P+-, HER2-, BRCA 2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/788788",
      "Title": "Sleeve and glove with a small wriste? MiniMacsMom moogie"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 3, 2012 03:20AM MiniMacsMom wrote: In terms of heart damage, my tumor was on my right side, but i am getting treatment to my breastbone are.  On that area, the MDA docs use electrons instead of photons because they degrade at a much lower distance.  They shoot the photons at an angle across my whole breast and then localize electrons to the breast bone.  The boosts to my breastbone, superclav, scar and arpit (seems like almost the whole thing :) ) will also be straight on with electrons.  I am not sure how common this is for centers to use, but my RO says its what helps to midigate the damage to the internal organs.  Big HUGS! I started in June but I will continue my rads all they way til July. :)",
      "MessageIndex": 38,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jul 30, 2012 02:33AM MiniMacsMom wrote: I bought that bra and talked to the lady a bunch. I told her it couldnt be tight at all so we went up a band size! Its beet great. She seemed really understanding about it. I had a umx and revision surgerg so i am fairly numb... Just really started to get inane itching 2 days post rads :-)",
      "MessageIndex": 268,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jan 29, 2012 11:14AM MiniMacsMom wrote: Can you post those papers and what hospital you go to?  What kind of machine is it.  I am not sure what my rads process will be, I am not quite half way through chemo, but I would be interested in any info you have :)  Thanks",
      "MessageIndex": 5,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781672",
      "Title": "Anyone have boosts at same time as whole breast? Jennt28 Jennt28"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Feb 8, 2012 01:15PM MiniMacsMom wrote: I can only answer number 4:  Yes the travel for medical can include 1 \"caretaker\" same for the tax deductions, the travel is tax deductible for 1 caretaker also :)",
      "MessageIndex": 1,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782372",
      "Title": "Questions about actual surgery experience at MD Anderson Ysa MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Jun 19, 2013 09:51PM MiniMacsMom wrote: I had chemo surgery and rads. Mine were normal looking at 1 month after rads... 3 no after chemo. But the no said there are still microscopic systems that they can't test for that still qualified me for immune compromised at that point. I'm a year out of chemo and still measuring normal. But the barometer is hard. I am under 30. Otherwise healthy and I try to eat well. I really hope u feel better soon. Oh I had taxol weekly and then FAC. Mda uses that regime because they say it gives u the maximum doses of chemo while preserving you immune system as long as possible. I got two neulasta shots 3 weeks after my last chemo... when my ABC tanked for the first time. go figure.",
      "MessageIndex": 6,
      "PostDate": "19/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806330",
      "Title": "When do WBC recover completely after final chemo? indenial MiniMacsMom"
    },
    {
      "AuthorID": "MiniMacsMom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138644/profile",
      "Content": "Dec 31, 2011 06:21PM MiniMacsMom wrote: I think the best thing is to have confidence and acceptance.  By that I mean accepting what you have been given with this illness so that you are ready to fight and confidence in your medical team.  I was a hot mess until I got a second opinion at the best cancer treatment facility in the country.  I was thinking that I only had to live for the short term before hand, why put my body and famil through all the stress if I was goign to die anyway.  Then I got a new medical team.  I still get cranky but I am so confident in my medical team that I truely don't have those death and dying thoughts anymore.  Its weird, but I am planning for the long term again.  Seeing my son graduate college, ect and he is 17 mo old.  I am even (gasp) thinking of having more kids in a few years once this is all over and originally I thought it was hopeless.  :)  I hope you find something that works for you to keep those deep dark thoughts at bay, but I truely believe that stage 3 isn't the end of the world, and if things do stay the same or progress that there will be new/amazing treatments in a few years that will work wonders!",
      "MessageIndex": 16,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780275",
      "Title": "Can we survive? CherylinOhio Josiekat"
    }
  ]
}