{
  "AuthorID": "Minnie72",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194642/profile",
  "Posts": [
    {
      "AuthorID": "Minnie72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194642/profile",
      "Content": "Jun 10, 2015 04:34AM Minnie72 wrote: hi everyone, I have been on Faslodex for a year and half and my rumors were stable although markers were slowly rising. My last pet scan showed some progression so oncologist suggested Nevelbine and Xeloda. He said navelbine has shown to work better with herceptin which I am taking. Glad to have found this. Not too happy about the constipation but it looks like SEs ar e manageable. I haven't read if anyone is working thru treatment. Pls let me know if there is anything I have to watch for. Thanks!",
      "MessageIndex": 21,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829928",
      "Title": "Navelbine Maureen813 Leah_S"
    },
    {
      "AuthorID": "Minnie72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194642/profile",
      "Content": "Jun 19, 2015 10:24AM Minnie72 wrote:",
      "MessageIndex": 24,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829928",
      "Title": "Navelbine Maureen813 Leah_S"
    },
    {
      "AuthorID": "Minnie72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194642/profile",
      "Content": "Jun 19, 2015 10:34AM - edited Jun 19, 2015 10:34AM by Minnie72 Susie, hope you can start Navelbine soon! Good luck!",
      "MessageIndex": 25,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829928",
      "Title": "Navelbine Maureen813 Leah_S"
    },
    {
      "AuthorID": "Minnie72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194642/profile",
      "Content": "Aug 8, 2014 12:57PM Minnie72 wrote: Hi everyone!  Im gald to have found this topic!  I have been dx with mets in Feb.  I log in and read once in a while but only posted couple of times. Havent had much time lately working full time and commuting.  Hence I am posting to ask if anyone of you are still working full time?  I have 2 kids in elementary.  The first few months of treatment hasnt been bad (herception, faslodex and zometa) but lately I am noticing I am getting a lot more tired lately plus I have started getting very achy esp on my back (i have mets from t1 to my sacrum).  I get home and Im just wiped out that I cant even spend  time with my kids.  I just feed them and get them ready for bed  so I can sit on the heating pad to ease my achey back.  But my kids which I think most of them are, onece they see you calm they want your attention so that sitting down doesnt last much.  I am thinking that working will keep normacly in my life but I think its hurting me at the same time.  My insurance is through my work and I cant afford to lose it.  I was thinking of working part time but then I would lose my benefits as well in doing so.  My husband's work offers insurance but at a very high price.  He is also not stable with his job.  This is causing me so much stress I have been getting a lot of heartburn which can also be from herceptin I guess.  Sorry this is so long, thanks for listening",
      "MessageIndex": 224,
      "PostDate": "08/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Minnie72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194642/profile",
      "Content": "Jan 13, 2014 07:06AM Minnie72 wrote: Mine was between 5.5-7cm with othet smaller ones around it. I never felt the big one which was up close to my clavicle.  I felt the smaller ones but took me couple of months to get them checked because I do get lumpy breasts before my period.  I just turned 39 so never had mammo before.  ",
      "MessageIndex": 480,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    }
  ]
}