{
  "AuthorID": "Minny",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87021/profile",
  "Posts": [
    {
      "AuthorID": "Minny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87021/profile",
      "Content": "Minny wrote: I am so nervous about this strange cluster of lumps I found in my axillary breast lymph node area near my armpit. I swear it's either one big lump or several small lumps. The location is at the very top of my breast far away from my nipple near my armpit. I have a mammogram scheduled for tomorrow and I am freaking out! It doesn't feel like a cyst and I've read what those feel like. I keep hearing that I shouldn't worry because most breast lumps are benign but it doesn't help. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/737985",
      "Title": "I'm only 35, could it be? Minny nash"
    },
    {
      "AuthorID": "Minny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87021/profile",
      "Content": "Minny wrote: I have met with two surgeons now regarding a lump that I have in my left breast. They seem to be so flippant about my breast concerns because I am 35. It's as if this disease doesn't affect young women? I know the odds are statistically low, but it's wrong to treat patients this way. The doctor I saw today said to wait 6 months and do nothing, maybe a second ultrasound in 2 weeks since he suspects my two suspicious and probably connected lumps is just fatty tissue. I want to know 100% that it's just fatty tissue and not wait 6 months. I mean at first I only felt 1 lump and when I follow it it actually has a connective line to another lump! I don't think I can wait another month or worse yet 6 months to evaluate the damn thing while it grows and spreads!  Everything I read says that when young women do get breast cancer it's usually aggressive and they are more likely to die from the disease especially African Americans. So why am I getting this type of treatment? Only 5-10% of breast cancer is genetic yet this doctor today placed so much emphasis on my having no family history of breast cancer. I am definitely not going back to him! It's like do I read too much on the internet, am I being overly critical? No. I think, I have a right to have a diagnosis, not a general best guess when it could make all the difference in the world. He even refuses to order a breast MRI. WTF! I know that mammograms and ultrasounds can be normal and there can still be cancer, so why am I going through this dance? Just venting! I'm frustrated. This has been going on for weeks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739108",
      "Title": "Age Discrimination. ACK! Minny DJ64"
    },
    {
      "AuthorID": "Minny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87021/profile",
      "Content": "Aug 18, 2009 07:32PM Minny wrote: Mine doesn't show up either. Maybe you have dense breasts? I have done a lot of research and those tests are not 100% accurate, sometimes they miss cancer. I am getting a biospy done to make sure because I need a diagnosis because there is something there and I am not taking their guesses as fact. If you feel something, there is no harm in getting a biopsy to make sure even with a negative mammogram and ultrasound.",
      "MessageIndex": 1,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/739131",
      "Title": "What kind of Lump kimgod lilldeb24"
    },
    {
      "AuthorID": "Minny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87021/profile",
      "Content": "Apr 7, 2010 05:13PM Minny wrote: yes, definitely I am going to ask for a biopsy. Thanks!",
      "MessageIndex": 3,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750933",
      "Title": "Benign Lump that increased in size? Minny Minny"
    },
    {
      "AuthorID": "Minny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87021/profile",
      "Content": "Minny wrote: I'm keep going back and forth to the doctor to check on this lump. Initially I was supposed to watch it and see if it changed in size and that was 8 months ago. Now the lump has gotten more pronounced but it doesn't show up on the ultrasound. My new doctor has scheduled a mamogram but I'm thinking it didn't show up last year so what if it doesn't show up again. I will be constantly thinking, what if it is something to worry about and I won't find out until it's too late. I am so frustrated. I kinda want to just demand a biopsy to give myself some peace. Do benign harmless lumps increase in size? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750933",
      "Title": "Benign Lump that increased in size? Minny Minny"
    },
    {
      "AuthorID": "Minny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87021/profile",
      "Content": "Minny wrote:  I am so confused and upset. I have a palpable lump in my left breast, but the mammogram and ultrasound picked up absolutely nothing. No cysts, no diagnosis of fibrocystic tissue, nothing. They said I had very dense breasts but the report just says it found no suspicious malignancy. However it did say that my axillary lymph nodes are likely reactive. What on earth does that mean? If he couldn't see anything how does he know they are likely reactive and isn't that bad anyway? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738050",
      "Title": "Axillary Lymph Nodes likely reactive? Minny Minny"
    }
  ]
}