{
  "AuthorID": "Minnesota",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81031/profile",
  "Posts": [
    {
      "AuthorID": "Minnesota",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81031/profile",
      "Content": "Apr 27, 2009 01:36PM Minnesota wrote: How about prophylactic surgery 2 years out, after having already gone thru recon for the first mast?!",
      "MessageIndex": 20,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/732028",
      "Title": "contralateral prophylactice mastectomy 2 years later ally2 mythreesons"
    },
    {
      "AuthorID": "Minnesota",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81031/profile",
      "Content": "Mar 2, 2010 01:57AM Minnesota wrote: Wow! This is such an interesting thread! I don't remember having any dreams about my breasts during the 4 months between my mastectomy and my recon. But many months after the recon, I did have a dream where I looked down at my chest and the reconstructed breast was gone. I was totally devastated in the dream and woke up crying really hard. It took me a long time to settle down, and i just sat there holding my reconstructed breast until I stopped crying. It was really a powerful experience and I ended up writing to my recon surgeon, thanking him.",
      "MessageIndex": 10,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748785",
      "Title": "When you dream, do you have breasts or not? barbe1958 barbe1958"
    },
    {
      "AuthorID": "Minnesota",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81031/profile",
      "Content": "Jun 18, 2009 11:50PM Minnesota wrote: Let's back up a step. How about, in response to telling someone you have breast cancer, \"Did you have a mastectomy?\" while their eyes slide to your chest. Why do people think it's any of their business, if you don't volunteer the information yourself? Why do they want to know what kind of surgery you had?",
      "MessageIndex": 102,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "Minnesota",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81031/profile",
      "Content": "Nov 16, 2010 01:34AM Minnesota wrote: Anne, I wasn't thrilled with the idea of implants either - I wanted my new breasts to be all me, and I didn't want to have to worry about having them replaced sometime down the road. Also, though you don't have to heal from a donor site, like you do with DIEP, I've read plenty of scary stories about capsular contraction and infections from the expanders and implants, so I know there is no guarantee at all that the implant route is easier than using your own tissue. If you ever do have to face issues with your immune system, I would think it would be better if your breast were made of something not foreign to your body. \"She\" - The procedure you describe is different than how things are done at NOLA - the surgery is shorter (tho not short) and there is no time spent in a \"hot\" room. Also, since Anne is having immediate skin-sparing reconstruction, she will not necessarily need a second surgery, unless she decides she wants one, and she can determine how extensive she wants it to be. I do agree, tho, that DIEP reconstruction is not easy. But no type of reconstruction is easy, unfortunately. Implant reconstruction does not guarantee that the process will be less physically demanding. It depends on how each person's body reacts to it. The expansion process sounds painful and grueling to me. Also, I'd like to add that living up here in Minnesota, I don't think I'd want to experience having the cold breasts that some gals with implants have described having in the winter. I mean, it gets down to -30 degrees up here! Anne, I think it's great that your time-frame extends far into the future - go for what you really want, don't settle, but go into it with your eyes wide open - it won't be a walk in the park, that's for sure, but then neither is cancer.",
      "MessageIndex": 13,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    }
  ]
}