{
  "AuthorID": "MissSierra",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83645/profile",
  "Posts": [
    {
      "AuthorID": "MissSierra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83645/profile",
      "Content": "MissSierra wrote: Hello... Recently I have had two ultrasounds that the radiologyst said showed that my \"lump is growing\" quite quickly.  My grandmother died of breast cancer... my aunt has it now.  I know im only 23 but isnt it really rare for someone my age to have it?  I am scheduled for the biopsy next week?  Would I have any other symptoms?  Everyone keeps telling me it is probs nothing and it probs is... I just want to know what I should be prepared for? Sierra Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/734077",
      "Title": "So worried... MissSierra stephanie1"
    },
    {
      "AuthorID": "MissSierra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83645/profile",
      "Content": "May 13, 2009 06:12PM MissSierra wrote: Thank you so much for the responses.  Everyone keeps telling me it is nothing but I can't help  but worry.  I have a two year old and a 4 month old and all I keep thinking is what if... It really helps that someone has told me I am not crazy for worrying.  And  Tango1... that is what I am worried about.  A soon as I got my test done... I wasnt even done getting dressed and I had an appointment for the biopsy... (they wanted to do it like the next day but I just got my tonsils out and they didnt want to do it  back to back... so they gave me a week).  They told me at first not to expect any results for 72 hours.. here I don't even have my clothes back on and we are talking surgery?  Does it happen that quick?  That is what got me so worried?  Again thanks so much!!!!",
      "MessageIndex": 4,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/734077",
      "Title": "So worried... MissSierra stephanie1"
    }
  ]
}