{
  "AuthorID": "Missycakes",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74903/profile",
  "Posts": [
    {
      "AuthorID": "Missycakes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74903/profile",
      "Content": "Dec 1, 2008 07:45AM Missycakes wrote: Hi Lily, you should be just fine for your event on Saturday.  Just make sure you ice your breast all day today.  That really helps.  Where they went in for my biopsy was exactly where the side part of my bra hit, so it helped to wear a jog bra instead of a real one.  Take a few Advil before your party and you should be good to go.  You should have your results before Saturday, and hopefully they're great and you'll have the best party ever.  For some reason, I just have a good feeling.  If you're up to it, let me know how the biopsy went. Hugs, Claudia",
      "MessageIndex": 8,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724847",
      "Title": "Calcifications Birad 4 LilyEve Beesie"
    },
    {
      "AuthorID": "Missycakes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74903/profile",
      "Content": "Dec 1, 2008 02:00AM Missycakes wrote: Hi LilyEve, On 11/11 I had a stereotatic biopsy on my right breast with a very similar report such as yours, Birad 4, suspicious abnormality.  As you are now, I was too...very scared.  When I got in there, the first thing they said to me is that my case was going to be very difficult (my calcifications were in the middle of my breast, close to the chest wall).  They ended up being able to get to the calcifications, so that was a relief.  I received my results in three days.  The pathology report stated that although calcifications were found in the samples taken, none were found in the slides.  (My doctor checked with the pathologist, and he confirmed that he saw the calcifications and was satisfied they had the right area).  Anyways, my report was B9, and indicated only seeing fibrosystic changes in my breast.  The recommendation is a follow-up mammogram in six months.  So...even though it is very hard not to worry, please think of me when you are and remember mine were B9. :) .  I also like to be cautious though, so I am going to a breast specialist on December 4 for a second opinion.  My mom was diagnosed two months ago with breast cancer, and her doctor thinks I should be getting yearly MRI's.  I'll let you know what she says after my appointment, to give you more knowledge to work with.  One more thing...I am one day shy of the three week mark since my biopsy, and I am very tender at the biopsy site and small area around it.  I also have a lump near the entry point of the biopsy.  The wonderful people on this board have explained to me that this can often happen.  So, if you still feel tenderness after 3 weeks, don't panic.  I'll keep you posted on that too.  Good luck today.  I'll be thinking about you. ",
      "MessageIndex": 6,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724847",
      "Title": "Calcifications Birad 4 LilyEve Beesie"
    },
    {
      "AuthorID": "Missycakes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74903/profile",
      "Content": "Dec 3, 2008 08:36AM Missycakes wrote: Hi Lily,  I'm hoping you'll get a preliminary report today.  How are you feeling? Please let us know when you hear.  Saying prayers for you. Missy",
      "MessageIndex": 11,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724847",
      "Title": "Calcifications Birad 4 LilyEve Beesie"
    }
  ]
}