{
  "AuthorID": "missmelissa…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265453/profile",
  "Posts": [
    {
      "AuthorID": "missmelissa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265453/profile",
      "Content": "Mar 18, 2018 03:02PM missmelissa90 wrote: ShimmerGal- I have just had a similar conversation with my oncologist. I have a PALB2 mutation and my paternal grandmother died of BC at age 43 (I'm 46), so I'm looking at a BMX with no reconstruction because I want to only have one surgery. Because of what I have heard about the the growing thinking that PALB2 is very similar to BRAC, I asked my OC about the idea of having an ooph at the same time as my BMX - especially since he recommends that I begin a drug treatment to induce a chemical menopause. He shocked me by saying that his recommendation is to wait 5 years before doing so! His response was that having an ooph is irreversible, and at least if I try chemical menopause I can reduce the meds if the symptoms are too bad. This has definitely given me more food for thought and the #1 take away was not to try and rush into anything, which sounds very similar to what you heard!",
      "MessageIndex": 20,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/862333",
      "Title": "Simultaneous Prophylactic BMX & Oophorectomy/Hysterectomy? ShimmerGal ShimmerGal"
    },
    {
      "AuthorID": "missmelissa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265453/profile",
      "Content": "Jun 7, 2018 06:43AM missmelissa90 wrote: Marina and FasterPussycat- Thanks for sharing your thoughts! I have been following the message board, but haven't had a chance to post. I had BMX without reconstruction on May 2nd and I have gone through a wide range of feelings about it. I have a PALB2 mutation and a grandmother who died at age 43 (I'm 46) from breast cancer, so I really decided to get them lopped off to try and prevent this from ever happening again. I went without reconstruction because I wanted it to be one and done and I feel that I'm a slow healer, so the thought of keeping the process going for months made me crazy. I have to admit that when I first saw my breasts without bandages the massive incisions made me balk because they were lumpie and I had two large swellings on each side of the center that I call my \"foobies\". My breast surgeon said that they would probably get smaller as the swelling went down and thankfully I have noticed that they are getting a little smaller at four weeks post-op. In some ways I absolutely love being flat and yet when I put on a shirt that is cut for someone with cleavage I get a little sad because I can't wear it without it being noticeable that I am lumpie. I do think that being flat makes me look younger and it is a great incentivizer to work on streamlining the lower half of me! I think that I might have the record for the most lymph nodes removed (I had 23 on my right and 1 on my left) and it has really done a number on my right arm's range of motion. Does anyone else have any issues like that? I'm meeting with a PT and she has given me exercises for it and to try and prevent lymphademia (dun, dun.....dunnnnn). I am experiencing periods where everything is really tight, like a band around my upper chest, and I don't know if it is a result of carrying too much when I went on a trip last weekend or from doing exercises that stretch parts I haven't stretched before. I do know that I am trying to not take Tylenol every day and I also wonder if this has something to do with it. I appreciate everyone's sharing and advice and feel very fortunate to have such a great resource.",
      "MessageIndex": 366,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "missmelissa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265453/profile",
      "Content": "Jun 13, 2018 05:14AM missmelissa90 wrote: Saw the doctor on Monday and he said that up to 3000 of Tylenol daily wasn't a problem and I'm glad he said that because since I started radiation on Friday everything seems to be sore (top to bottom). I think that the radiation is making things shrink up so I'm focused on doing my PT exercises regularly. Thanks for sharing the pic Ready, it is very helpful to see what it looks like. I've noticed that I can't fully stretch my right arm without a really weird sensation in my armpit and it kind of aches most the time, so I'm going check in with my PT and see what she thinks.",
      "MessageIndex": 415,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "missmelissa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265453/profile",
      "Content": "Jun 24, 2018 10:54PM missmelissa90 wrote: SPDgirl- I hear you about the tightness around the top of the chest- it still comes and goes, even with exercise. I will say that for anyone who is experiencing that sensation I would highly recommend getting a referral for a PT!!! I went to my first real session last week (the one before was more of a conversation and initial review) and she did some manual muscle manipulation on me that made a huge difference on my range of motion right away and felt really good! I'm dealing with the effects of daily radiation on my right side right now, so for every step forward the radiation seems to be pushing back, but I would think that if I wasn't in this state the manipulation would be really effective! She also gave me advice that no one else has regarding the use of a compression cami to help with some of the swelling I am experiencing (both in the front and under my arms).",
      "MessageIndex": 501,
      "PostDate": "24/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "missmelissa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265453/profile",
      "Content": "Oct 1, 2018 03:37PM missmelissa90 wrote: ctmbsikia- I came across your post after searching for content related to itchy skin and I am happy to have found a page with several people in a similar predicament as me! Like ksusan, I developed a rash post mastectomy, but mine was under the bandages on my back and it was so bad it would wake me up at night and I had to use an ice-pack to try and deal with it. I contacted the surgeon's office and after describing the issue the nurse had me come in to take them off, but the itching stayed around for weeks afterwards. Since then I've had random rashes break out on my belly, groin, side and middle of my back and recently they seem to be popping up in areas where my skin is exposed to heat/moisture. I've been to the Drs. office six times - each time was when the rash becomes unbearable and didn't seem to get better with OTC (benedryl and cortaid) remedies. My latest one popped up the day after I went on a 2-mile walk in mild weather, but the rash corresponded to the places where my camisole straps touched my back! My personal Dr, my OC, and all of the other Drs and nurses I've seen at urgent care have no explanation, but my OC did say that one of the side effects of Arimidex was a rash. Since these rashes were occurring prior to me starting Arimidex and then didn't start again until after a month of taking it, I'm thinking that whatever they used during surgery must have done something to my skin and maybe the Arimidex has contributed to it? I have heard of too many women talking about similar itching to take them off before I was scheduled for my post-surgery check. I definitely have a visible raised rash on my side, but the spots on my back that really itch don't appear until I take a shower and then I can see red spots that correspond directly to the itchy spots. I've done two rounds of prednisone and that helped kick it way down, and I've been using a prescribed cortizone cream on the visible rash and that has been getting less noticeable, but the itching on my back and now my lower legs is just as bad as ever. At this point, I'm thinking that standard western medicine can't help me, but I still haven't yet seen a dermatologist, so I'm thinking that might be the next step before I go to a naturopath or maybe I will do it simultaneously because this is driving me nuts! Maybe we should start a forum (if it doesn't exist already) regarding this issue?",
      "MessageIndex": 7,
      "PostDate": "01/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/866902",
      "Title": "Post radiation skin issues-away from site? ctmbsikia ctmbsikia"
    },
    {
      "AuthorID": "missmelissa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265453/profile",
      "Content": "Jun 10, 2018 10:12PM missmelissa90 wrote: Hello all! As of this Wednesday I will be 6 weeks post-surgery and wanted to check in. I had my first full week back at work last week and honestly, though my energy was great all week, my body feels worn out. In fact, I feel a little bit like a did some major physical event, which I didn't, and I've been moving slowly. I must also say that I've started using a standing desk at work and I am sure that this is part of it, but I think that the biggest issues is using muscles that I haven't for four-weeks. Secondly, after the extreme tightness I experienced during my radiation set-up appointment, I started doing the post-surgery exercises that were in handout from my doctors office. I found that I was able to do them all without much problem, but I also took a solo airplane trip and did way too much lifting of my carry-on bag, and when I returned I had a throbbing ache from my right shoulder to my elbow. I finally met with a Physical Therapist who specializes in lymphedema last Monday and she gave me a different set of exercises to do and told me that my surgeon's advice to start walking my hand up a wall once I got home from surgery was a no-no, as they don't want you moving your arm up over your shoulder, and that they have told this to the surgery department before! Thankfully I was only doing it once a day, and I hope that it didn't impact anything too much. I have noticed that my right arm (the one with the 23 missing nodes) has a crook to it when I raise it to the sky and when I try to straighten it out I feel a definite uncomfortable tug. I'm wondering if that is the same feeling that ReadyAbout describes and if that means that I have cording too? My PTs advice with all my exercises was to stop if it hurts, but I will have to ask her if that also applies to the feeling of pulling something. What I have noticed today is the rubber band feeling around the top of my chest (front and back) has returned, although not as tight as it was before. I chalk this up to laying absolutely still with my arm up on a caddy for 20 plus minutes for my first radiation treatment on Friday, but I wondering if others are noticing the same feeling returning even several weeks out from surgery? For those of you with Mastectomy w/o reconstruction, I have been seeing lots of posts about the use of compression bandages and wondered if you were told to do that? I had a tight surgical bandage that was taped from both sides of my back to the front for 10 days, but had it removed because I developed a horrible itchy rash and terrible sores on my back and have had nothing since. I have since learned that allergy to surgical tape is a thing, even though the ER doc seemed to think it unlikely :( Since it was removed I have had very noticeable swelling on both sides, right next to the breast bone, to the point that I have little mini-boobs which I call my fauxbees. At my two week check up my doctor saw this and said that I'm just still swelling and it should eventually (hopefully) subside, but I'm now six weeks and they are as perky as ever. I am also wondering if anyone was told/prescribed anything to help lessen scarring? I'm starting to get to the point where I'm ready to start focusing on things that are less life and death and more vanity, and I was thinking that I probably should start doing something now. Finally, I know that everyone is at different levels of pain management, but for myself I have always tried to take the least amount of medication possible and have been able to just take extra-strength Tylenol for the past four weeks. I was taking 1000 in the morning and 1000 at night, up till last week, mostly because of what I have read about inflammation and the connection to breast cancer www.mdvip.com/about-mdvip/blog... but now I'm more worried about the impact of taking large does of Tylenol for long duration and wondered if anyone else had discussed this with their doctor? I have an appointment on Monday to see my regular doctor for some hearing issues I'm having, and I will definitely ask him, but I always think that is way more helpful to hear what others are being told by their docs.",
      "MessageIndex": 395,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    }
  ]
}