{
  "AuthorID": "misshopeful",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168567/profile",
  "Posts": [
    {
      "AuthorID": "misshopeful",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168567/profile",
      "Content": "misshopeful wrote: I felt a lump on my right breast 1st week of nov 2012 .. went through mammogram and u/s. Was referred to a surgeon and had a biopsy last dec 28. My surgeon was on vacation do i dint get to see him until january 8,2013. I have been an oncology nurse for 7 years and recently moved to maternity unit. My primary care doctor called me just before I left for work on Jan 7 and told me the biopsy result, he said its IDC... It felt like the world just ended and everything turned black. My husband at that time was out of the country to attend his father's funeral, so even before my diagnosis I was emotionally unstable bec I was very close to my father in law.I have 2 children, a girl and a boy , 12 and 11 years old. I was not scared for myself... i was scared for my kids. To be honest when I heard the word carcinoma I was thinking about death right away. As an oncology nurse and i have seen so many cases of cancer, my mind travelled so quickly. Went to my oncologist and he referred me for a second opinion, to a breast surgeon. My Mri and bone scan are okay. My surgery is on feb 7 which worries me because I wanted it sooner. Knowing that i have this in my breast is scary and i just wanna get rid of it right away. I think bet the day I felt the lump and the surgery date is kind of a long wait, dont you think?But my oncologist and my BS said its okay. I chose to have double mastectomy and I hope I made the right decision. Thank you for this forum, it really helps alleviate the anxiety and the fear. God Bless us all 😊 Dx 1/7/2013, IDC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2- Surgery 2/6/2013 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799483",
      "Title": "recently diagnosed misshopeful misshopeful"
    },
    {
      "AuthorID": "misshopeful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168567/profile",
      "Content": "Jan 27, 2013 02:31PM misshopeful wrote: Thank you guys for the encouragement and support. I just hope that i will be one of the lucky ones who were able to go through this with flying colors. This is not easy, now i can totally relate to my patients. What sucks is that i just got cough, colds and sorethroat. I hope this will go away before my surgery so it wont be delayed again. Waiting and the fear of the unknown is killing me.So far my kids are taking it well. Gave it to them in small portions. I'm just praying that everything will be fine.",
      "MessageIndex": 6,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799483",
      "Title": "recently diagnosed misshopeful misshopeful"
    },
    {
      "AuthorID": "misshopeful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168567/profile",
      "Content": "Feb 27, 2013 09:23PM misshopeful wrote: msphil.... wow thats great. I am glad you are doing great ...19 years is awesome. I am praying you will have more and more years of being a survivor. Hearing stories like yours is very inspirational. Thank you for sharing. God bless :)",
      "MessageIndex": 14,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799483",
      "Title": "recently diagnosed misshopeful misshopeful"
    },
    {
      "AuthorID": "misshopeful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168567/profile",
      "Content": "Feb 27, 2013 07:05PM misshopeful wrote: thank you guys... so sorry it took a while for me to reply. I had my surgery feb 7 bilat mastectomy. Everything went well, I'm recovering well. I had immed breast reconstruction so im still having some discomfort from the tissue expanders. Its a stage 1, margins are clear as well as the lymph nodes. Now I am facing another challenge and it is whether to have chemo or not and just tamoxifen. Im not sure if you are familiar of the oncotype dx score, this determines the percentage of the recurrence risk. Mine is 20 and its the score where its up to me to decide what treatment I want. My oncologist said with my score he strongly recommends for me not to have chemo since it would only lower my recurrence rate by 2 %. If I decide not to have it, he will start me immediately on tamoxifen immediately for 10 years.Of course I dont want chemo but In the future I dont want to blame myself for not getting it if \"god forbids\" the BC will recur.... I am soooo confused :(",
      "MessageIndex": 12,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799483",
      "Title": "recently diagnosed misshopeful misshopeful"
    }
  ]
}