{
  "AuthorID": "Miss_Chris",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140512/profile",
  "Posts": [{
    "AuthorID": "Miss_Chris",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140512/profile",
    "Content": "Dec 1, 2011 11:02PM Miss_Chris wrote: I, just hours ago, got a call from my doctor about the biopsy i received yesterday. \"Good news and bad news. the good news is the pathology came back negative for cancer, however, it does show you have a radial scar. you will have to get a hold of the surgeon to get that taken out.\" I asked if its not cancer why do we need to do anything? She said that often cancer cells are hidden within the tissue so its best to remove it and a bit of healthy surrounding tissue...  \"often\" means to me that there is a BIG possibility of there being cancer in there. I don't think that i am too reassured about this? I am 37 and only because i saw a special on breast cancer did i even check... and found a lump. I don't think i have done a self check for over 6 months before that? My primary doctor said (in the past) i don't have history of BC in my family, I breast feed my babies, and am fairly young so you shouldn't have anything to worry about....   So my next step is to call the surgeon tomorrow to set up a time to have this removed. I believe it is 3 centimeters and deep. now i am not big in the chest area, a B cup only, so i am thinking its near my ribs since the biopsy hurt like hell. What is the healing time on this and since i work a desk job how much time do i need to take off if more then the surgery day? I am not a huge baby but i am not too excited about getting cut either. what is the pain level after? This may be silly but will my boob look the same or smaller from this? ",
    "MessageIndex": 28,
    "PostDate": "01/12/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730063",
    "Title": "Radial Scar ?'s cemjo3 marie5890"
  }]
}