{
  "AuthorID": "misty123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
  "Posts": [
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Jul 15, 2009 05:24AM misty123 wrote: My prayers are with you and your family during this difficult time in your life, my you know peace in the coming months/years.",
      "MessageIndex": 24,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737409",
      "Title": "my beloved rooni has went home to the lord rooni janie44"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Jan 27, 2009 09:55PM misty123 wrote: Hobolt- Did you have CA in both or just one.",
      "MessageIndex": 815,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Jan 29, 2009 10:25PM misty123 wrote: Hi group,  I am 15 days post first tx, no head hair lost yet, who in the group held on the longest. I wonder because my ong and the nurses swear it falls out before the 2nd tx. Next tx on tues and I am already worried about it instead of looking forward to a well weekend. I am going wig shopping tomorrow just in case, I have been putting it off just in case I am that 1 person who doesn't lose their hair : )) Anyway I am glad I found this group it does help to know that you are not alone in the battle and for me it keeps the \"why me\" away, why anyone when you look at all the women who face this each year, the numbers are scary. I was looking into the claritin for the bone pain but I think I will get something RX because I do not want to take a chance with that severe bone pain again, I wanted to throw myself out the window it hurt so much. One of my friends asked how did I know it was bone pain if I never had bone pain before. I told her if she ever has bone pain trust me you will know what it is and not doubt it. I pray that all of you have minimal SE and breeze thru your next tx, good health to all.",
      "MessageIndex": 876,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 8, 2009 10:51PM misty123 wrote: Sweeeetpam ~ call your doctor right away if you haven't already please don't worry about your next tx, you have to make it thru the current one.",
      "MessageIndex": 1072,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 25, 2009 11:29PM misty123 wrote: ddlatt- congrats on your article, I think it is great how you are encouraging others. All you Jewels, continue to have better days and more good news from all our doctors, we all deserve a great summer vacation don't you agree? I plan to do something this summer with Malcolm once he gets healed and stronger, thank you all for your support and prayers, both he and I are growing stronger each day. I hope to have my last 2 drains out this weds, it will be 19 days post op at that time.",
      "MessageIndex": 2132,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "May 9, 2009 09:54PM misty123 wrote:",
      "MessageIndex": 2285,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Jul 29, 2009 08:14PM misty123 wrote: Thank you all ladies and I promise to keep you updated, YES I think this liver will keep him healthy as he waits for another one, that is what I am praying for. Continued healing to all you jewels, bless each and every one of you.",
      "MessageIndex": 2987,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 2, 2009 08:40PM misty123 wrote: Hi Group,  I am going for my second tx tomorrow and full of anxiety, am I alone. I hear that the second one is a bit easier for some but I and still afraid and dreading that bone pain from the nuelasta. Does anyone use a Rx pain reliever, I am not trying the claritin I want something I know will work but I never needed anything strong so could someone please recom something that I can ask my onc for tomorrow, something that you have used and it works. I am asking because I have a sic son at home and I need to be able to walk thru the house to at least assist him with some care and last time I wasn't able too and he ended up in the hospital, not because I couldn't help him but because he became dehydrated and pain issues and I wasn't able to keep a better eye on him. Good health to all.",
      "MessageIndex": 950,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 19, 2009 08:51PM misty123 wrote: Hi Ladies. Question for the group, I take the Nuelasta shots after TC each tx and it's suppose to be better then nupegene because it last longer, I was told yesterday that my bone marrow count was to low and I have to take the nupegene shot every day until Mon to build it up or I cannot get my next tx #3  what the **** and how is this possible, has anyone else had this happen and were you able to get your next treatment, please help I am stressing about this. I need to finish my tx and get back to work and help my son more with his illness.",
      "MessageIndex": 1245,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 25, 2009 01:51AM misty123 wrote: HELLO Ladies, I had 3 of 4 TC today 75% done. I feel more tired but the steroids won't let me sleep tonight even after taking numerous things to get me there. I spoke with my ong today about having a prophylactic mast on the other side, I hate the look of my body and am truly scared of reconstruction surgery at this point. I am now thinking about having my other breast removed just to take that worry off my chest, ong doc made an appointment with my BS for next week to discuss that option compared to reconstruction. I am not sure if ins will pay for this since CAT scan showed no active disease but there is a high recur for triple negatives and I just last week found out I do have a history on my biological fathers side, very strong. Just wondering if all this is over stress or on target, has anyone else had these thought or actually done this before a second dx? Any and all input would be greatly appreciated from anyone. Good Luck to all you beautiful strong ladies.",
      "MessageIndex": 1343,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 28, 2009 09:39PM misty123 wrote: jillyG ~ I always have that effect but I take the TC then the nuelasta shot, it hurts all over and if you look at me too long it hurts even worse. The skin on my neck seemed to hurt the most this time and I cannot cross my legs (a habit) at all, any pressure hurts like hell, even the water from the shower but this time my nose has been bleeding also. So is chemo, I pray all of this means it's working very well.",
      "MessageIndex": 1400,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Mar 16, 2009 11:52PM misty123 wrote: Hobolt-Sorry for your loss, that would hit anyone very hard even if they weren't going thru what we are. Hi Ladies, Last TC tomorrow and nervous/excited/scared about it. I am tripneg so no more treatment after this and pray that this is my last ride down this road. It's been hard but doable, bone pain was the most bothersome s/e for me. Most of you know I have a son on the transplant list (liver) we found out today he is #6 (yeah) so hopefully it won't be much longer, he was admitted to TGH for severe ascites (swollen painful Belly) so they will drain that off and treat him for the infection in the fluid, I ask that you remember him in your prayers, just like us, he cannot go thru a transplant with infection so he is temp on hold until the infection is cleared (IV ABT) hopefully he will be home in a few days and transplanted soon. SE free week wishes to all, GOD bless all of us.",
      "MessageIndex": 1571,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Mar 18, 2009 07:25PM misty123 wrote: ladyjane54-thank you for the continued prayers and you are in mine for a complete recovery from this virus you are fighting holtbolt- thanks you also and I will add your BIL to my prayer list, Malcolm has been waiting for 13 months so it is quite normal to wait a long time for some people, I actually learned that some people wait for over 10 years for a transplant. kmmd- I have a feeling that he looks at it this way but from a mothers standpoint I see him as being so much worse off, I deal with pain and inconvenience for a week and he is 19 and lives mostly in bed or the hospital (currently there) Thank you for your thoughts, please continue to pray for him. Renrel- Hope the little one feels better after his Tylenol and you are able to catch a little nap. I am sending healing, positive thoughts and  prayer to all of you strong women not only fighting for your lives but the right to raise your children. grow older with spouses. meet your grands and make more lasting memories, this dx has opened my eyes to the smaller things and life and you all have hit on them, we are not alone by a long shot and thank you all for making this journey a little easier by sharing your hopes, fears and advice.",
      "MessageIndex": 1591,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Mar 28, 2009 12:52AM misty123 wrote: Hi ladies Haven't been on the board for a minute. I am asking for all prayer warriors to please pray for my son Malcolm, he is in desperate need of a liver and currently at Tampa General, been there since the 16th and they just put him in ICU a few hours ago. He is on a steady decline but I continue to pray and believe that he will pull thru this and come home soon. He was so weak when I went to see him today but he was able to tell me he loves me very much, that felt so good because he has been lethargic for a few days and now this. I was feeling good about finishing my treatment but now it just feels like a slap in the face, me getting better and my son worse, life is not fair but we have no say in the matter so I will continue to pray. I decided to have a prop L mast the 9th of next month to get what I see as a better outlook on the future with less of that recurrence scare hanging over my head so I can just concentrate on him and now this. I cannot imagine losing my son and I don't know how to tell my oldest he is so sick because he is stationed in VA and I don't want to scare him if it's a false alarm....just scared and confused and needed to let this out. Thanks for listening.",
      "MessageIndex": 1684,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 10, 2009 06:32PM misty123 wrote: Hi Ladies, Thanks for keeping an eye out for me/Malcolm Malcolm is at TGH, they found a donor last night, finally got the call and I am stuck in the hospital. His granny, brother and aunt are there with him and I spoke with him via phone about and hour ago, they are waiting for the donor liver to be havesed so we are on standby but he does have a new liver in the wings!!!!!!!!!!!!!!!! I am trying to type this all bangaged up, outpatient prop mast did not work, blood count dropped and I am still in the hospital, hopefully home tomorrow. Continue to pray for him he is not out of the woods just yet.",
      "MessageIndex": 1881,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 13, 2009 07:50PM - edited Apr 13, 2009 07:52PM by misty123",
      "MessageIndex": 1944,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 16, 2009 11:16PM misty123 wrote: jess- I am sorry for your lose but don't blame it on chemobrain or yourself, a thief is a thief and always looking for a chance to take from trusting people which is your only fault and I find that a great fault to have, I also admire your desire to give to our children and the community by being a teacher. i know their are many honest students whom appreciate the gift you share with them daily, keep up the good work. Good healing energy to all the Jan jewels!!!!!!!!!!!!",
      "MessageIndex": 2007,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Mar 12, 2009 12:39PM misty123 wrote: Hi ladies, I had a R skin sparing mast on 12/17 and decided to have a prop L after chemo for the same reason as most of you on here, scared of waiting for the other shoe to drop. I have made plans with my BS to do it next month because my last chemo is 3/24 and she said she could do it after 3 weeks post chemo. I have an appt with a PS next week, what I want to do is a skin sparing with immd implants, large B currently a lopsided DD with pros on R. When I had my original mast back in Dec I was under the impression that skin sparing was a good idea for better cosmetic results when it comes time for recon, I recently read that it is useless if it is not immd, has anyone else had delayed reconstruction after a skin sparing with implants instead of expanders and how were the results. Good luck to all those fighting for the right for an prop mast, my understanding is that when it comes to ins they have to go with the patients choose once you have a dx of BC, I have Atnea and that is what was explained to me by the education nurse at the time of my initial diagnosis.",
      "MessageIndex": 48,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/727659",
      "Title": "Bi-lateral prof mast? runalot08 runalot08"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "May 6, 2009 09:20PM misty123 wrote: Hi ladies, Does anone now how long the hot flashes continue post chemo, they are really starting to bother me now, thanks.",
      "MessageIndex": 2247,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Jul 31, 2009 09:24PM misty123 wrote: Thanks ladies for the kind words, they do mean a lot. Lisa - I am so very sorry for the lose of your friend and my heart bleeds for her 2 little babies, so young to lose a mother, I will pray for them and you as you face surgery. Blessings to all.",
      "MessageIndex": 2993,
      "PostDate": "31/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Aug 3, 2009 08:19PM misty123 wrote: Hi Jewels, Thanks you all for the well wishes and I see everyone has been busy..busy...busy.. a day at the beach with a little one sounds so much fun...those were the good old days I must say...watching our little boys explore the world and little trinkets meant the world to them then.",
      "MessageIndex": 3006,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Aug 9, 2009 04:09PM - edited Aug 9, 2009 04:10PM by misty123 hawaii808- You will do fine with your mast, look at it as a blessing in so many ways....one being that they will catch all the little cancer critters and get them out of you, It really cuts down on the worrying as to whether the got it all with a lumpectomy...good luck and healing to all my fellow sisters.",
      "MessageIndex": 3029,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Jan 28, 2009 08:29PM - edited Jan 28, 2009 08:30PM by misty123 Hi ladies,  ddlatt-  That is so true, I have been feeling very down today, sorry for being a burden to others and scared about losing my income and paying bills while going thru chemo. I too also put off so much just raising our kids, dreaming of the day they would be off on their own and I could splurge on clothes, vacation in other countries or just plain not worry about their daily needs. NO instead my son get a chronic condition and is now sick and needs a liver transplant. I cannot believe I told my surgeon \" I can't have cancer, do you understand my son is sick and I have to take care of him \" she looked at me with understanding and told me I cannot take care of him if I don't take care of myself first. That statement really just hit me after reading the last post, we as women at least me spend so much time taking care of others that when it is time to take care of ourselves or let others attempt to help us we don't know how. I am trying to learn this lesson while taking care of myself, letting others be of assistance and not  like I should be supermom/ woman all the time. Just needed to let that out what I am really saying is I am scared of all that is going on and I don't truly know how to deal with it, how can I take care of my son if I myself am sick and if something does happen to me who will take care of him like I do.",
      "MessageIndex": 843,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Mar 8, 2009 11:03PM misty123 wrote: Hello ladies, 8 days until last treatment and already nervous about it because 3rd one hit me the hardest, I pray this one is going to go better and this will all be behind me forever. I know a few of us are having the last treatment over the next week or two, as for me no further treatment just scans to follow (triple neg) so I pray for all of you whom are going on to another chemo regime or rads. Guess what, I'm bald (smile) and wearing it just like that. I made a mistake because I had a hot flash while running errands and took wig off in the car, needless to say when I went in Walgreen's to pick up DS Rx i forgot to put it on and I am a regular there, the young lady whom waits on me regularly commented on how cute I looked with my bald head, I had an instant of shock/humiliation and then I saw she really meant it, haven't worn the wig since and have honestly received many compliments on my baldness, even at the ong office from other patients wishing they could go bald like me. Just wanted to share a positive note in my life right now, the little stuff means a whole lot more in the scheme of things here recently. i wish all of you well and a s/e free week if at all possible.",
      "MessageIndex": 1481,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Jan 27, 2009 12:06PM - edited Jan 27, 2009 12:08PM by misty123 Hi Group,  I am triple negative and had right breast removed 12/17/08 and first chemo TC on 1/14 and it hit hard the bone pain lasted for 5 days staight after my nuelesta shot so I am not sure if it was the chemo or the shot. I still have all my head hair 13 days out but the pubic hair is shedding like crazy LOL, not a cute picture, My head itches and tingles like crazy, it fells like I have bugs up there. I haven't had n/v but the fatigue is unreal sometimes just walking to the kitchen gets me all winded. I see alot of women working thru this and kudo to you strong ladies. I am a hospice nurse and am more afriad of my patient giving me thier germs than anything so I am going to live of savings and family (smile) for awhile because I don't have the energy to walk those halls and care for others at this time. I am so glad I found this site, it is a good source of information and support, I don't feel like I'm all alone in this fight for life. I am dreading the hair lose because my hair is already short I hope it won't be a total shock with the new look and I don't want a wig they itch to me. I am also second guessing reconstruction after hearing some stories and I really don't won't to go thru a long healing process agian if I can help it but I will see because I haven't even seen a PS yet but I did have skin spraring surgery and I wish I had not, honestly I wish I would have had both removed and went flat.  Good luck and healing to all.",
      "MessageIndex": 798,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 3, 2009 09:35PM misty123 wrote: Hi Group jrgolomb ~ Yes, my scalp hurt all the time and I actually started pulling my hair out because it felt better when I was ripping it out and it tingled all the time. I shaved all my hair off today because I had so many patches from pulling at it and no one will believe this but I love my bald head and when all this is over I have already decided to keep it very short like this my SO other says I look very sexy like this and I agree, I was very surprised to look in the mirror and see a much younger women looking back. With all my stress over the last few years with my sons illness I looked more like 50 then my 38 and now I feel like I look my age, who knows it might be wishful thinking on my part but my spirits are up so I'll live with it. I had my 2nd dose of chemo today and it went very well, not tired yet but I am sure it's the steroids and tomorrow is Nulastu shot I am sure I will be down then but I got a Rx for lortab from the ongc today. I also asked him to look at a lump in my mid chest, he thinks it just a small cyst and says he will keep an eye on it, has anyone else had anything like that an it was nothing? just wondering, once you get CA I think you become paranoid about everything or maybe just me. Good health to all, may your SE be minimal.",
      "MessageIndex": 979,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 10, 2009 08:33PM misty123 wrote: Thanks ladies, I think I confused you all. I came in thurday for an outpatient L prop mast w/TE and I am still here. I did have my surgery I just haven't made it home yet, lots of drainage and low counts are keeping me admitted in the hospital. Malcolm is due for pre-op at 9 my oldest just called and hopefully surgeryat 10. I will keep you posted thru the night as I will just be laying here.",
      "MessageIndex": 1887,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 16, 2009 11:54PM misty123 wrote: mimi07 ~ My son has hospice and they are great, he has a wonderful social worker whom has been a great help to me with my issues with bc. I also have been blessed with a supportive family and angels for friends. Malcolm has a volunteer group of ladies ages 50-65 whom call themselves Malcolm's posse and they are there for fund raising, dr visits or just to lend a hand. I think we all have different obstacles to deal with while trying to fight our battle, the women on here with little ones I can only imagine how they do so with all that comes along with being mommy and then trying to work or just keep to house running so hubby can work, these always makes me remember we are never given more than we can bear. Love and good wishes to all.",
      "MessageIndex": 1185,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 13, 2009 12:09AM misty123 wrote: Hi Ladies, I finally was released this afternoon, blood count still low, probally related to chemo is what was explained, I am still very sore and tired but this too shall pass. I went right to the hospital to see Malcolm upon my release and he looks so much better, face is even feeling out already, he should transfer to a regular room tomorrow. The new liver is working like a charm, he was so excited to show me how he could use his arms and legs again, of course I was ecstatic because a few days ago he was too weak to even turn his head or form words. They were concerned if he would have any deficient since he was so ill going into surgery but mentally and physically he is progressing better than expected in a short time. Thank you all for your support and prayers, a community combined is what made this miracle happen.",
      "MessageIndex": 1926,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 13, 2009 07:58PM misty123 wrote: Lisalisa- good for you, the last one is so exciting for us all. jrgolomb- does aspirin help you, I was told not to take while on chemo but I know each doctor says diffrent things, it all goes away after chemo.",
      "MessageIndex": 1945,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 21, 2009 12:20PM misty123 wrote: Hi Ladies, When do the s/e finally end. I also have the central retention kt57 spoke of and I am 1 month post chemo, i look like I am pregnant and I have never had a noticeable stomach, not washboard hard but no protrusion, how long does that take to go away or should I be asking for a diuretic to lose it, all other places are still in pre chemo stage, kinda funny I am glad i don't have the munchies anymore and I find myself eating much more healthy mostly trying to keep my body in top shape for this recon bit. I had prop mast 4/9 with t/e placed and it is wierd to see the work in progress, i think I look like Frankenstein but the PS says they look great so far, not to much pain if I keep my meds going in on schedule which I do and rest as much as possible which I am enjoying for the moment, I want to heal up as soon as possible so I can return to work i miss the daily grind of it all and the friendships I have there. I really don't like my coworkers to visit me at home while I am sick, being in the nursing field they want to come and treat me like a patient instead of a friend so that is a little to much for me, phone calls will do just fine. My son Maillol is doing better with his new liver and begging to come home (good sign) he is bored to death in the hospital now that he is awake and alert, hopefully it will only be another week, 2 at the most they are giving him rehab trying to build his strength back up and improve his nutrition so he can heal better and faster, thanks to all for your prayers and support when I was worrying myself sick over his condition, this board is the greatest thing that came out of my BC dx and i do appreciate the caring and sharing we all receive here, good healing to all Melissa",
      "MessageIndex": 2068,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 23, 2009 10:37AM misty123 wrote: Renrel- i also agree with you and have been going bald 1 week after shaving head, wigs and hats are hot here in Fl, why am I trying to make other comfortable while making myself more miserable. If I can deal with hot-flashes and chemo, then they can deal with the reality that people get canser and chemo makes women bald, part of life so deal with it. Bev56- I am 4 weeks out and have fuzz on my head, so start looking it will be coming. Good wishes to all.",
      "MessageIndex": 2098,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 29, 2009 07:53PM misty123 wrote: lisalisa- I cast my vote, good luck sweety. Hi Jewels, sending healing energy to all.",
      "MessageIndex": 2171,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 16, 2009 09:20PM misty123 wrote: lisalisa ~I thought I was the only one with that problem. I am not an invalid and when I have a little energy i want to vacuum the floor or change the sheets, do laundry or whatever to help out around the house but everyone has a fit, I'm not going to keel over if I do a little house work. My oldest came home on emergency leave from the navy, the youngest son being sick also with liver disease and he almost wrestled me down to the ground when I tried to mop the kitchen floor, he actually yelled at me(not like him at all) that I wasn't being a good patient and wouldn't let others take care of me, I wanted to stay in control even when I am sick. I enjoyed the extra help because he was able to shuffle thru the hospital to take care of his brother when I couldn't but I was also glad to see him  go. He would actually sleep on the floor at my side in case I needed anything, or to make sure I was alright. He kept telling me he was so afraid he was going to lose me or his brother, even though I understand what he is going thru you don't want to think of losing your battle while your going thru this fight. I know everyone means well but it can be a little much at time. That's my vent and I wish all a SE free week.",
      "MessageIndex": 1184,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Mar 17, 2009 07:38PM misty123 wrote: Hi ladies, I am finished and it feels so good to say that and be joining the ones who have said this in the last week, many will be joining us next week I am sure. kt57-Renrel-jillyg- My sons name is Malcolm and thanks you very much prayer does help, I sent out a prayer call last night to all my prayer warriors and can you believe it they called today and told me he is #4 today, 2 spots in 24 hours, yes he will be blessed with a liver in no time I am sure. Thank you all for your thoughts and prayers, it's extra special because I know that you truly have your own problems right no but take the time to care about others.",
      "MessageIndex": 1579,
      "PostDate": "17/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Feb 28, 2009 09:33PM misty123 wrote: ddlatt ~ thank you for sharing those beautiful photos, you are truly talented and as inspiration to us all. I have made up my mind to do the bi-lat mast without recon because I see we can still be beautiful w/o the extra work. good luck with the article and keep up the good work. Ladies ~ I wish you all less SE, 3 down and 1 to go and I am so looking forward to this chapter in my life to be over, #3 is truly kicking my a** and I pray the last one is better.",
      "MessageIndex": 1399,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Mar 29, 2009 01:44PM misty123 wrote: Thanks to all for your prayer and support of Malcolm, he is still in ICU they gave him 2 units of blood and his blood pressure came up quite a bit so he is doing a little better, still waiting for that miracle phone call to get a new lease on life, please continue to keep him uplifted, I thank all of you for that.  I am so relieved to be finished with chemo, I am so very tired still but I try to push myself a little bit further each day to build the strength up. I am scheduled for a prop mx on the 9th and after healing back to work, I am really looking forward to that because savings are done, I pray that Malcolm will have the surgery by then and everything will fall into place just perfect and it is time for something to go right. Good healing and strenght to all.",
      "MessageIndex": 1707,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 15, 2009 11:06AM misty123 wrote: Holybolt and Lisa, congrats on being done with chemo, it feels weird to hear all you ladies talk about rads and oral treatments when I have nothing else to do, I am happy in a way that but I am kinda scared that there is nothing else that I can do that is why I choose to have a prop mast to feel proactive and have a sense of control over my life. I am so happy for all of the Jan Jewels for being strong and supportive for each other.",
      "MessageIndex": 1988,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Apr 27, 2009 03:03PM misty123 wrote: Hi ladies, Just the mention of (people) wanting everything to go back to normal nearly brought on tears, my SO has been so supportive and I know that has been a blessing because some of us don't get that but I cringe every time I hear \"you should be fine now that chemo is over\" I still have drains hanging out of my armpits and stitches in both boobs that have yet to be removed but I should be fine since chemo is over. Even my son whom I love dearly(transplant boy) is crying because I cannot come and sit with him in the hospital everyday just to keep him company because he is bored of course, I am not physically or healthily enough to do such things but he dosen't seem to understand, as soon as I get there he wants to know how long I am staying and when I am there he wants to know when I am coming again, forget the fact that I don't need to pick up the hospital germs as my body is still open. I am also not allowed to drive yet, bad range of motions of arms and still on around the clock pain medications. I should be able to be mom of the year and sit in the hospital among all those germs and entertain my son then come home and entertain my SO because everyone has been so understanding about my BC. Did I mention I had emergency hemmroidectomy surgery 1 week after my last mastectomy on 4/9 because I had neglected my health so much because I was always at the doctors office or hospital with my son since he was so sick. I am just tired of feeling sick, yes I still feel sick after chemo and the additional surgeries and people not understanding that you don't just bounce back to being your old normal self, there is a new me who know I need to take care of myself in order to be around for awhile. I hate the guilt that I feel when I cannot do something others want or expect me to do but I am learning to say NO that dosen't work for me right now. Since I am triple neg, they don't know how you get it but stress seems to be in all the information I have received about this dx, being everyones caregiver and superwoman is a very stressful lifestyle, one I plan on giving up and taking better care of myself. I have noticed during my down time most of the people I am always there for have suddenly disappeared but my true friends have been a staying force. Thanks for listening to my rant.",
      "MessageIndex": 2140,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Jul 29, 2009 09:35AM misty123 wrote: Hi Jewels, I haven't been over here in awhile, post chemo and going thru the reconstruction stages. I wanted to stop by and let you all know....Malcolm....my son whom received the liver transplant in April.......thanks again for the support during that difficult time.......well he was put back on the transplant list a few days ago....he is home....he is doing good and looks really good...the doctors say this liver is failing and fast for whatever reason, I wanted to let you ladies now and thank you for the continued prayers.",
      "MessageIndex": 2980,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Aug 10, 2009 09:00PM misty123 wrote: holtbolt - sorry that you are taking meds and not benefiting from it, hope the surgery is soon and you have quick healing, good luck sister.",
      "MessageIndex": 3032,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "misty123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78400/profile",
      "Content": "Mar 9, 2009 09:12PM misty123 wrote: Sending prayers your way, all will be fine.",
      "MessageIndex": 8,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730383",
      "Title": "Surgery Tomorrow Hopeful101 bmdaley"
    }
  ]
}