{
  "AuthorID": "Misty879",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238792/profile",
  "Posts": [
    {
      "AuthorID": "Misty879",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238792/profile",
      "Content": "Sep 16, 2016 06:22AM Misty879 wrote: Hello all, I just had surgery a week ago and my pathology report came back yesterday. My BS got clear margins with surgery, no lymph node involvement, no lymphovascular invasion and the tumor size was 1.4cm. I'm 37 (36 when diagnosed) and had IDC. My Oncotype dx score was 25, so in that gray area. I have an appointment with my MO team in a week to go over treatment plans and options and my BS said they will discuss chemo with me at that time. I am not sure if my BS sent a sample of the tumor for Mammaprint, I had to ask for the Oncotype test to be done and I don't want to make her mad if I ask for the mammaprint one, like I'm telling her how to do her job but if this test will show more accurately whether or not chemo would benefit me or not I want to know. My BS said that she has seen people with my onco score need chemo and those who haven't. She said with everything that came back after surgery it's different. Off the top of her head she said she believes the risk without it is 16% which I don't think is all that high and am not sure what the risk will be lowered to with chemo. Should I just wait until meeting with my MO team to ask about the mamma print or should I ask my BS now to send it for testing",
      "MessageIndex": 85,
      "PostDate": "16/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842209",
      "Title": "Oncotype DX results are in... Nachout818 Lisey"
    },
    {
      "AuthorID": "Misty879",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238792/profile",
      "Content": "Dec 14, 2017 02:55AM Misty879 wrote: Hello, I was diagnosed in June 2016 with IDC, Stage 1, Grade 2 with no spread to the lymph nodes or to the blood vessels. I had surgery in September 2016 and it's been a year and I have had good blood work since then every 6 months my doctor tests me. But a month ago I came down with a cold and had a cough and it's been 3 weeks since the cough started, but there are still remnants of it. It's the kind of cough you get when you go outside in cold air and breathe in, it's a catching cough I would describe it as. I also find myself short of breath when doing simple things like walking up the stairs. I was wondering if anyone here has had BC spread to the lungs and what your earliest symptoms were like? I made an appointment with my MO just for him to check it out for me, but in the meantime thought I would reach out to the BC community to see what early onset symptoms are in some people. Thanks in advance, Misty",
      "MessageIndex": 4327,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Misty879",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238792/profile",
      "Content": "Jan 27, 2017 01:59AM Misty879 wrote: I was 36 when diagnosed, 2 months shy of my 37th birthday.",
      "MessageIndex": 701,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Misty879",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238792/profile",
      "Content": "Nov 18, 2016 09:07PM Misty879 wrote:",
      "MessageIndex": 19,
      "PostDate": "18/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/850131",
      "Title": "Oncotype 17 --what have others decided about Chemo Tbirdy321 GLK"
    }
  ]
}