{
  "AuthorID": "MistyJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
  "Posts": [
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 25, 2010 02:24AM MistyJ wrote: Hey Liz, I am not feeling too bad really.  I am.....here we go.............(constipated).......!  I am on Colace, miralax and senna and none of it has worked yet.  I am full up!  That is on the list of first things to fix this morning!  My chest is tight, and I have been having a few muscle spasms on the right side and of course I am tired but the oxycodone is keeping me comfortable.  I sure can not believe you are doing hours on the bike!!  Kudos to you girl!!!!  I am sure it is probably helping you heal faster!  How are you feeling other than that?  Remind me again, did you get recon? Circe-how are you fairing? Be patient Jsmiley60, you will get there.  It has only been two weeks.  Healing and strength vibes to all our June women today!",
      "MessageIndex": 370,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 7, 2010 06:51AM MistyJ wrote: YAHOO LAURIE!!!  DOING THE HAPPY DANCE WITH YOU!!!!  NO INVASIVE!!!!",
      "MessageIndex": 602,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 20, 2010 06:16PM MistyJ wrote: P.S.  Liz thank you for the reminder about Orchidgal!",
      "MessageIndex": 777,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 21, 2010 07:01AM MistyJ wrote: Laurie, you totally crack me up sometimes!  How about a Dove dark chocolate bar-mmmmm  AND Breyers makes a new Dark Chocolate Velvet icecream that is delicious!!!  (and half the fat so no guilt later!) MRDRN- right there with you on the long recovery and bored in the heat.  Makes me weepy somedays.  My DH just keeps reminding me why I did it.  But my mind is saying lets go.....then my body says.....Oh no.  We will get there, slowly but surely the turtle won the race right?",
      "MessageIndex": 780,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 23, 2010 03:39PM MistyJ wrote: MRDRN-boy girl!  And I am sitting here thinking...gee am I overdoing it by walking around at work all day as long as I don't use my arms too much?  You are superwoman pulling weeds!  Be careful in that heat though, it will make it way worse!  I was trying to walk outside and could only do like 20 minutes and then felt depleted the rest of the day.  I think the heat was just too much.  I am doing much better on the treadmill inside.  I get tired easy still, but then I think \"is it because of surgery or because I have sat on my butt for a month and now have to build my stamina back up???\"  I am not really sure. Kitwe-I am sorry your husband is not dealing well!  Maybe he is just worried to hurt you?  Did you try asking him outright what he is thinking?  I got so lucky like Laurie did.  My husband actually got in the shower and helped me wash.  He helped me change my dressings too.  The second day I showered I actually looked in the mirror at the incisions and almost fainted.  I had to lay down on the bedroom floor in my birthday suit and put my legs in the air.  I proceeded to cry, not because I was worried about vanity but because those were some damn big cuts on my body!  It was overwhelming!  He laid down beside me and (thinking that I was worried about vanity) rubbed my head and told me how beautiful he thought I was!  Now let me tell you....I don't look pretty when I cry!  Also back to being frisky about 3 weeks after.  Maybe your hubby is just concerned and treating you with kid gloves??  Anyway, I'd ask him.  Tell him it is hurting your feelings.  Hope all the rest of you June ladies have a great weekend.  Try to stay cool. :)",
      "MessageIndex": 801,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 2, 2010 12:21AM MistyJ wrote:",
      "MessageIndex": 82,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 3, 2010 04:29AM MistyJ wrote: Valerie,  Hope your fill went well today",
      "MessageIndex": 102,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 7, 2010 09:06AM MistyJ wrote: Circe-Right there with ya in the vice grip.  I told my PS I was kind of glad to have the compression bra on all the time as it lets me pretend the tightness is from the bra!  I too have lots of \"pains\" from the TE's.  Just like you I am wondering if it is going to last all through the process.  I got my last 2 drains out yesterday!!  So happy about that!!  PS put gauze and tape on and when I tried to take them off today to put on a waterproof bandage so I could shower......the scabs were sticking.  So here I am putting neosporin on them to soften it up and trying to pull them off....Well I once again found myself having to lay down naked on my bedroom floor so as not to faint! (Had to do this the first time I looked at myself in the mirror) Funny how my tolerance for pain that is inflicted by other people is high, but I sure am a huge baby when it comes to inflicting pain on myself!  Spent 15 minutes on the floor doing yoga breathing and guess what?  When I sat up.....the gauze fell off on its own!!!  Too funny.  All that stress for nothing, didn't even hurt!  I am scheduled for my first fill next Monday.....kind of nervous about that!!  PS said not to expect more than 50cc at a time bcuz my skin is tight.  I am ok with that!  He said I could take the oxycodone before the appt. if I wanted, but that stuff is not worth the side effects!  I will take some ibuprofen and tylenol and call it good.  Are you afraid to touch your TE's too much?  I find myself babying the areas.  I have good range of motion, but wonder how much is too much?  I am worried to do something wrong, silly I know at this point but thats where I am.  I went for a 20 minute walk today woohoo!  Needed a nap after though!  Well, hugs and healing to all us June ladies!",
      "MessageIndex": 608,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 20, 2010 06:12PM MistyJ wrote: hugs hugs and more hugs to you jeanne!  You have every right to be down today.  That is alot of new to be surprised with and have to process!  Take a minute and breathe girl!  You can do this.  Hopefully you will wake up and feel better tomorrow!  I wish I could give you a hug in person.",
      "MessageIndex": 776,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 31, 2010 02:48AM MistyJ wrote: Hello everyone!  I hope you all have a wonderful and healing weekend!  Stcardsfan- I too am actually still reasonably sore to the touch under my arms where the alloderm and muscle were stitched esp. in the area of the drains.  It pulls sometimes too.  I hurt more when I overdo it, but I def. hurt to touch it even when I don't.  I will do like your husband says and not touch it...tee hee.  I am also getting some burning feelings under the TE's where my IMF would be and also in random spots throughout the foobs that come and go.  I don't know about you, but I know I had irregular posture and sort of caught myself rounding my shoulders to protect the front area.  That would put abnormal stress on your shoulders.  Maybe that is why you are hurting.  If you have a spasm in a muscle or a pinched nerve in there it can make your hand numb.  Happens to me sometimes when I get out of alignment.  I would most def. ask the dr. but maybe it is just that?  I get relief from ice and a massage chair thing.  Hope you get feeling better soon! Dee-goodness girl, take it easy on yourself  for sure!!!  I know it is frustrating, but it takes a little bit longer. I am a good healer and I consider my tolerance for pain pretty high and I can honestly say it was a good 4-5 weeks before I felt like I was close to my normal energy level.  And even now at 5 and a half weeks sometimes my arms just get tired and I ask my DH to help me do somethings like take my shirt off, etc.  You will get there!  Hopefully you can catnap during the day!  That helped me...I still took them last week even. Man, I would love love love a pink garbage can!!!  I wonder if pre-vivors would count?",
      "MessageIndex": 875,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 4, 2010 04:20PM MistyJ wrote: Happy Friday ladies.  Thoughts and strength waves to ihatescreenames today! Orchidgal-I have your Mond. appt in my calendar...will be thinking of you!  Hope you get the 21st too!  Get it behind you!! Laurie, I must tell you that I read everyones posts and read several of the forums, and you always stick out to me.  One, because your pic seems so young...Two, because you have young children, Three, because you always seem so strong and positive in your posts.  All Moms have days like that, even when they are not facing the other trials and tribulations you are.  So you are especially allowed to have your moment outside with wine getting away from it all!!!  It helps you deal better with it after the mental time out I think!  I feel like it helps to release here in posts too!  Obviously we are all good listeners :) so vent as needed!!!! almagetty, thanks for taking the time to post so quickly.  It helps me be reassured that you are able to get on the computer so soon after.  I am glad you are feeling comfortable enough!  Prayers for a speedy healing process!  I am getting alloderm too.  My PS is using it almost every time he says it allows for more cushion between the implant and the skin, while also giving more support.  People do look at me funny when I tell them it is cadaver skin though!!!",
      "MessageIndex": 115,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 22, 2010 05:30AM MistyJ wrote: jillyg, thanks for the hugs and thoughts!  I may not be on the computer before your surgery as I am not taking it with me........so strength vibes and hugs to you!!!!!   Travel safe and hopefully all goes smoothly.  We CAN do this.",
      "MessageIndex": 320,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 23, 2010 02:58PM MistyJ wrote: Hey ladies!  I am feeling pretty well considering. I am home thank goodness!  They sure don't let you sleep in the hospital!:)  Just wanted to let you all know this is sooo doable. The anxiety is really the worst before hand.  Not really in that much pain, just feel very very tired and kind of loopy from meds right now so I can not focus long enough to read all the posts, but I am thinking of all of you who are healing and those going in to surgery this week.  Hope to read up tomorrow after a good nights sleep. ",
      "MessageIndex": 351,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 24, 2010 06:07AM MistyJ wrote: Good Morning all you beautiful June ladies!  So I am sending super healing vibes to everyone esp. jillyg for her 1st day post.  Good luck webstermom and joystar.  You will do just fine, you CAN do this.  Some things that I have had to do are making a list with all my meds and the times I take them.  That way no one forgets a med and it is too hard to remember when you are drugged.  Also I have a scrub top that I cut down the center and am wearing for the drains.  That way the pockets hold the drains but I don't have to put it on over my head.  Ducki, I am sorry you find yourself here, but it is a good place for info and support.  You have alot on your plate right now, and just coming off treatment for colon cancer is a very valid reason to feel a little like an emotional wreck.  It does not mean you are not strong......you will get your head wrapped around this too.  Give yourself time to digest it and keep reading and researching and this forum will help also.  There is a page here on the website called abbreviations for newbies, that may help you.  Circe and lizzymack, so glad you are feeling well.  The antihistamine I take (Zyrtec) helped tremendously with the itchies!  My Mom and husband kept telling me to stop itching my face and I was like.........but I itch!!!  I am itching gently! Had a little rougher night.  My DH took great care of me though.  Just remember to not let the meds wear off.  And food with the pain meds helps keep from getting nausea.  Feeling better now, gonna go take a nap and will post more later.  Hugs to you all!",
      "MessageIndex": 365,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 25, 2010 05:45PM MistyJ wrote: Circe-I totally have not had a problem eating solids :)!  In fact I ate homemade mac and cheese, cheese grits and turkey and cheese grilled at the hospital.....in hind site...yeah the cheese on everything may not have been the best of my ideas....but it sure tasted good!  My surgeon has me on Miralax, Senna and colace.  I am still constipated.  Going on 3 days now and about to burst!  Eating tons of fiber and drinking water too.  I talked to the nurse today who told me to take some Milk of magnesia to kick start it.  For my drains I am wearing a scrub top (like the nurses) that I cut straight down the front.  The two drains on either side fit into each pocket and the tubes hang down the side a little.I am just wearing this over whatever top I have on.  I have not dressed in anything but pjs yet....I figure why should I right?? I am not going anywhere yet but the couch :)!  I also have heard of people using a lanyard to hold the drains, which is one of those long key ring type things you hang around your neck.  Hope this helps.  I have PT exercises, but I did not hear about any exercises to help prevent clots.....do tell please!! Robin- I think you should be June\\July girls :).",
      "MessageIndex": 380,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 26, 2010 01:00PM MistyJ wrote: Welcome sespebadger and speech529!  I too had BMX with TE's last Tuesday and am cruising along fine!  Pain is completely controlled by meds.  Mostly just tightness in the chest area anyway.  I talked to the nurses in the hospital about all the variations in directions for after and she said it was really just different doctor philosophies.  I have two drains on either side, came home in a compression bra that I am supposed to wear all the time.  I was allowed to shower whenever just had to use press and seal around the drain area.  I have PT exercises to do but was told not to lift my arms above my shoulders just so I don't pull the drains.  I asked not to have hydrocodone because I have had it and hallucinated......not pretty.....so have used oxycodone.  Soooooo very bound up even with 4 stool softeners, I am going to try to go the day without the oxycodone and use just tylenol and ibuprofen.  So far it is working :)!  I slept pretty well last night, but I do wish I had followed some of the other recomendations on here and borrowed a recliner.  Also, you may want to take a few granola bars or something in to the hospital.  They don't have alot in between meals, and it helps to eat a little something with the pain meds to prevent nausea.  Laurie, you are going to do great.  I am sure of it.  You have handled all the rest of this too well to do otherwise!  I was so nervous the day of surgery, but I promise u it is nothing you cant handle!  And the relief when you wake up is immense!  Just make sure someone is going to help you with your children for the first few days if possible.  You will probably get tired easily and sleep alot. Getty, I really like your picture!  You look so friendly :)! Have a healing weekend ladies!  Physically and mentally!",
      "MessageIndex": 404,
      "PostDate": "26/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 29, 2010 12:02AM MistyJ wrote: jblcsw10, speech529 Prayers for you today going in to tonight for healing after surgery!  laurie peace waves to you~~~~~~~~~~",
      "MessageIndex": 468,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 30, 2010 03:30PM MistyJ wrote: jsmiley I got a new bra at the Cancer Center I am treated at.  I came home in a surgical bra that was uncomforable, but this new bra is softer but still has compression.  It has clasps in front and comes with removable drain pouch holders.  It also has two fiberfill forms that can be added to the pocket of the bra to restore the look of breast size.  When the woman put it on me....I had her cut the tags so I could wear it home because I was in love.  Maybe this could help you?  The one I have is called an Amoena bra style #2160K but they have all different styles.  You could just order one and use that one when you are going out somewhere.  I googled Amoena and got lots of links to buy them.  Hope this helps you!  I have decided to rock the flat look until I get more fills.  I hope you are feeling less down!  Hang in there, you are doing great and will only continue to get better!  Slow and steady wins the race you know!",
      "MessageIndex": 499,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Mar 11, 2011 07:25PM MistyJ wrote:",
      "MessageIndex": 1436,
      "PostDate": "11/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 30, 2010 01:35AM MistyJ wrote: I feel great today!!  Two drains out...two to go.  Going to Eclipse premier with my girls!!!!!!!!! Laurie- Getty's right!  Think of all the firsts!  You are going to breeze through all of this, you'll see.  I have faith in you :). Jeanne- Vent on!  Sometimes letting it all out in writing and even having a good releasing cry makes it all seem more bearable.  My thoughts are with you~~~~ speech529- So glad you are finding it as easy as I did.  May you be blessed with a path that continues like that! Webstermom-YAHOOOOOOOO!!!!!!!!!!!  SO SO HAPPY FOR YOU! stlcardsfan-I got two drains out today too!  And I will be getting the other two out next Tuesday also!  Right there with ya sista!!!! lizzymack-Concentrate on the positives!!!!!  Thoughts and prayers to you :) joystars-I am yellowish too.  I think it is just bruising and will resolve eventually.  I have not heard of the back pain though.  Prayers to you and your baby! jblcsw10-DONE!!!!  SUPER!!!!  Looking forward to hearing more from you later!  Rest well now!!! Sweet Laurie- Peace to your heart and mind tonight and all the wishes I can send to you for a super surgery and speedy recovery!!!!  Will be thinking of you!!!!!  You will soon have this behind you and feel the relief.  You can do this :).",
      "MessageIndex": 486,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "May 31, 2010 10:35AM MistyJ wrote: Hello. My name is Misty and I was diagnosed with LCIS this last winter.  I do not have Invasive BC, however I did lose my youngest sister to BC when I was 22 and she was 18.  In large part because of that, I have decided to do a prophylactic BMX in the hopes of never having to deal with a BC diagnosis.  I am hoping to never have to go through the wait for pathology results again also, as those have been some of the worst days of my life.   I got my final date for surgery, and it is June 22nd.  I know I am in a different situation than you ladies, but I too am facing the fears of the surgery and would like to join your June group :)!  I am very positive most of the time, and feel very secure and confident in my decision.  Despite this, I am sure that as the date rolls closer I will be unable to repress the anxiety as much.  thanks :)",
      "MessageIndex": 59,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 3, 2010 04:20AM MistyJ wrote: Orchidgal,  goodness!  I am so sorry to hear about your brother!  And as if that was not enough to get a diagnosis so close to that is unthinkable.  But you are right that you are in a good place on this website!  Tons of good thoughts and strength to you~!  You are one day ahead of me, so we will be healing together! Reneemac , almagetty , lucylou , Reneew53 prayers to you today!  Hopefully this post will find you feeling reasonably comfortable Stacey2275-strength waves and peace to you before your surgery tomorrow! Jilly, thanks for updating the list :)  Can you add TE's to mine?  I don't know how to do it. So my day consisted of 1) talking and helping my 13 year old daughter to understand and be less afraid of my surgery because today for some reason she came home from school upset and worried about it. 2) then deciding that her friend from NY could come down with my Mother and Grandmother when they come for my surgery 3) then holding my daughter while she cried her eyes out because when she called her friend to tell her the good news that I said it was okay for her to come despite my surgery.....her friend's mother (who has been screened high risk for a while due to LCIS) was diagnosed today with BC.   Ack. ",
      "MessageIndex": 101,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 8, 2010 01:48AM MistyJ wrote: Hey all, So I know that it is very irritating to have people say stupid things.  Pretty much every woman I have told about my upcoming surgery has commented on how I will get a nice (and bigger since I am small) set.  I do find it kind of rude, and it would be even worse if I was having to deal with CA and treatment rather than a prophy bmx and recon, but I try to just think about the fact that these people probably have no idea what to say to us.  I have personal experience with someone being sick and dying from CA and even I don't know what to say sometimes out in the real world to people.  It actually can get just as irritating for every person to tell you how sorry they are for you.  What do you say to that, thank you?  I think they may possibly be trying to find a positive for us, since really.........what can you say that is positive?  There is nothing nice to say about it all, I don't think most of them mean to be stupid....unless you have been there you may not even realize how to say things that will help.  I just forgive them their ignorance, and hope they never have to find out first hand.  Anyway....just thought I might offer up a different way to look at it that may help with the irritation of stupidity.",
      "MessageIndex": 137,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 8, 2010 12:35PM MistyJ wrote: ok, so I must say..........the losing weight comment.............STUPID person!!!   And heartless too.  Good riddance.  Prayers for you Jilly, and sending strength waves for this weeks appt. orchidgal, you sound like you are in a good place.  I sometimes wonder if it is harder for women who have as you call it \"perfect\" breasts vs. someone like myself who has never really felt mine were anything special to crow about.  Mine have always been small and had weird stuff going on, and usually have odd hurts and lumps all the time.  I think I will actually be thankful to not have the worry of wondering what each new lump and pain is.  I know it sounds weird, but I am thinking it may be better for me to have no sensation than all the burning, soreness and funky nipple discharge! Wish all you wonderful ladies that are recovering are reasonably comfortable and healing well! Esp. gettingpastthis who should be on day 1 of the aftersurgery :) and many thoughts today for MRDRN!",
      "MessageIndex": 140,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 16, 2010 03:43PM MistyJ wrote: wifemomx2 and staceyA, Strength waves coming at you <3 ~ <3~ <3~.  I hope you find a comfort from the anxiety before, and peace of mind after! ",
      "MessageIndex": 235,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 17, 2010 04:59AM MistyJ wrote: Melissa, I love your positive vibes.  You seem like such a warm person!  Thanks for asking about me.  I am doing ok during the day.  Staying busy and not thinking about it.  I am having trouble sleeping at night now though.  This just started about 2 days ago.  My Mom and Grandma will be here tomorrow from NY though so that will give me some comfort.  Just still seems surreal.",
      "MessageIndex": 244,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 29, 2010 12:03AM MistyJ wrote: jblcsw10, speech529 Prayers for you today going in to tonight for healing after surgery!  laurie peace waves to you~~~~~~~~~~",
      "MessageIndex": 469,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 1, 2010 02:48PM MistyJ wrote: YAY LAURIE!!!!!!!!  SO HAPPY FOR YOU!!! DONE!! Circe- I am still tired too when I do alot of walking.  Try to take advantage of the time we are allowed to be lazy and lay around :)! ",
      "MessageIndex": 516,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 4, 2010 02:42PM MistyJ wrote: Melissa, I am so sorry you are feeling so down and anxious.  Trust me when I say the hospital stay is so so not scary.  Now, it may be a little irritating because someone is constantly waking you to talk to you, check on you, take vitals, etc. But it is also kind of reassuring that someone is always watching over you, by this I mean medical personnel.  So try to take some comfort in that.  It also will go very quickly, more so than you realize because you will be pretty medicated. You have remained so positive through all this, you are due your down days for sure.  Just hang on and try to find some comfort in the fact that all the June ladies have found it to be easier than expected!!!!  Strength waves to you!!!!!!!!!!!!",
      "MessageIndex": 565,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 9, 2010 04:23PM MistyJ wrote:",
      "MessageIndex": 645,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 9, 2010 11:56AM MistyJ wrote:",
      "MessageIndex": 642,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 27, 2010 08:16PM MistyJ wrote: Sorry this is so short tonight, post more later.  I am working full days this week so I am late getting on the computer. Will not be on much till the weekend.  Money for girls school clothes, here I come!  I drove myself to all my fills, and back, and had no trouble at all.  Just take some Motrin before.  I got what I now know (I didn't know until I read how much all the other women wrote theirs were) were huge fills of 120 each time.  It is tight afterward but not really painful.  Just back to the vice feeling.  Night time was a little harder, definately take the Ibuprofen again before bed.  Hope this helps.  talk soon-Misty",
      "MessageIndex": 840,
      "PostDate": "27/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Aug 14, 2010 03:23PM MistyJ wrote: Laurie, I too get the burning. I think it is related to the muscle also like the other ladies said.  Sometimes it is in one area and sometimes it radiates. I asked the PS and they said no worries.",
      "MessageIndex": 937,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 25, 2010 04:29PM MistyJ wrote: Hello Robin!  Grrr from me too on no date for you yet. Liz-thx for the Orchidgal update! And Hooray for the appetite!  Laurie-I don't know if it helps to know or not but I hit a point about the same time you are where I was just like....this freakin sucks.  I think that we try to pretend to others that it is all good and we try to go on like nothing is holding us back thinking we need to be positive all the time. I kind of got irritated when people took my lead and started acting like it was not a big deal.  Then I was left feeling like **** still and tired as all get out thinking that it was taking alot longer to recoop. than I thought it would....and everyone was telling me how great I was doing and how wonderful that was. And I didn't have an exasperating MIL here!!!!  That would have made everything much much worse!!!!  Does she have a date to leave or is it open ended?  What would she do if you just looked at her and said exactly what you just wrote to us?  Marm-So sorry you are still going through such a time with your incision!  That really does stink.  All my toes and fingers crossed that this week brings super healing and you get to go on vaca. Getty-Happy Sunday to you too!!!  You sound good. :)",
      "MessageIndex": 816,
      "PostDate": "25/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 20, 2010 01:00AM MistyJ wrote: melissa, I am sorry to hear about your nips.  I feel bad that you were so sad.  But remember, you are beautiful on the outside and seem very beautiful on the inside from all your posts to everyone.  That is what really matters.  You will still be you, just with a different look.  I would bet money that your amazing personality defines you way more than your nipples!  I hope you can find peace with it.  They really can do amazing things to make them look real. almagetty, I hope you are feeling better and better.  Thank you for taking the time to include us in your healing!  Prayers for speedy healing to all the June girls. Stillcardsfan Good luck on Monday.  Strength vibes to you.  Circe.....we are in it together on Tuesday...Good luck and strength vibes to you too! Jillyg, Webstermom, joystars, I may not be on the computer, but I will be sending you strength vibes nevertheless. Good luck next week!",
      "MessageIndex": 286,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 21, 2010 11:22PM MistyJ wrote: Good Luck to all you ladies this week, and strength vibes galore!!!!!!!!!!  Circe, my surgery is at 12:00, I have to be there for preop at 10:30.  I will be thinking of you.  We should be having surgery together at some point.  We can do this. Stlcardsfan...hoping you are doing ok.  Healing vibes. I must admit, the not waking up fear does strike me a little..........even though I have had anesthesia several times in my life.  But I must say I think waiting in the waiting area is worse for our families. I will keep Dorothy in my head.  I keep singing Whitney Houston's \"I'm every woman in my head also\".  That and Oh my gosh, Oh my Gosh! Truthfully though, I have an eleven and a thirteen year old watching me.  I need to show them how to be ok with this so that if they face it in their future someday I have given them a good base on how to deal. Basically feeling kind of numb?  Weird I know. Getty, nice picture!!!!!!!!!!!  Glad to see you!!!!!!!!!!!  Thank you all so much for the support!  I hope to post as soon as I get home.  My the force be with us!",
      "MessageIndex": 315,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 28, 2010 11:54PM MistyJ wrote: circe- I am doing so much better today.  Have not been on the computer for about 2-3 days much.  Been very very sick after getting too bound up.  Started to swell in the legs and feet and had a rock hard distended stomach.  Over two days I took 6 doses of Miralax, 1 dose Milk of Magn., 6 Colace, 4 Senna and 2 Dulcolax suppositories.  About the time we called the Dr. on Call Sat. night is when I finally started to have relief.  I am cleared out now but was a little dehydrated. I slept last night in my own bed with my DH and woke up today at 8:30 feeling like a new person!  I saw the BS today and he said I was healing well from his end.  Got a way more comfortable bra in the Cancer Center Shop for free, but did get a 45.00 parking ticket!!  Darn the luck!! I see the PS tomorrow and hopefully get 2 of the 4 drains out.  He told me in advance to expect 2 to stay in longer.  I am ok with it.  I showered and had my DH wash my hair....HEAVEN!!!  Now that I am feeling better though, my Mom will be leaving soon.  There will be more tears!  It is funny....I read a few posts yesterday and one of the girls who had surgery the same day as you and I said she was really weepy yesterday for no reason...so was I.  And it has really been the only day so far?  Thank goodness for Ativan.  Anyway....today  I am GREAT!  I can do this!!!  Wait...I AM doing this! I hope you are fairing well too!  I think of you often!  Misty",
      "MessageIndex": 467,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Apr 29, 2010 09:52AM MistyJ wrote: mlrbelle,  I am deciding which reconstruction right now, and would love to access the photo gallery to see all the phases.  Like you say, I would like to have some sort of idea in my mind of what to expect.  I know how to PM, but I don't know what you mean by BCO?  Can you explain?  Thanks! MistyJ",
      "MessageIndex": 6,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/751837",
      "Title": "These %$@* TEs! joyko mawhinney"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 30, 2010 06:54AM MistyJ wrote: scrabblelady, Please please don't worry about the drains!  They are nothing terrible, and completely doable!  I did not want to spend a bunch of money for extra stuff that was temporary so I cut an old scrub top down the front and wore the drains in the pockets.  I wore the top over my pjs.  When I started getting dressed, I refused to try to hide the drains....that would have been stressful.  I wore them out like a badge of honor.  One day I had on cargo shorts and they fit perfectly in the side pockets.  Once I got 2 of the 4 out, I just tucked them into my front pockets of my pants/shorts.  I usually had on a tank top of stretchy material, so it held the drains down my sides and then just had a bit of a loop sticking out at the bottom.  I did wear a short sleeve \"jacket thing\" that went over tanks and slid the drains in the side pockets one day.  So the tubes came out the bottom of the shirt then went up in the pockets. I did get a wonderful bra from Share our Suzy part of the shop in our Cancer Center.  It is a non profit program and gave me a wonderful front closures compression bra that I could wear instead of the surgical compression bra I was sent home in.  It had little cloth pockets that velcro'd to the inside and hung down the front to hold the drains.  I used them at night to keep everything tight and tidy.  A couple of times my drains dropped down from the counter when I had them loose...didnt really hurt.  Made me nervous for a sec, but it was fine.  when I changed clothes I usually stood in front of the bed and just let them sit on top of the bed.  the roping is long enough. when I showered, I threaded a large ribbon belt through a part on the top of the drains that is made for this and hung them around my waist. I had 2 drains on either side, but I had TE recon immediately.  I got 2 out yesterday and they said once the other 2 are putting out less than 30 cc's every 24 hours they can come out. Hint for milking the drains-My Mom did it some, My husband did it some, and I did it some once I was not so tired.  We put aloe germX on our hands when stripping the drains....that way it is slippery and easier to milk and also cleans it at the same time.  I just always made sure to hold tight at the top by the sutures while someone else did the milking.  It never hurt if the stitches were tugged on, but did feel odd and I tried to avoid it. Hope this helps!  It really has not been hard to do at all, and no pain.  Just tedious of course, but not terrible.  Good luck to you :) Misty",
      "MessageIndex": 16,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754382",
      "Title": "Drains Scrabblelady bigdogmom2"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jul 15, 2010 09:24PM MistyJ wrote: The picture forum is on a separate site but is controlled by a member on BCO with the name of TimTam.  It is going to be ending in August due to several reasons.  If you private message TimTam she will possibly give you the passwords to log in, but I know there are minimum requirements to meet as far as posts.  She is very careful about who she allows access to, as I am sure you can understand due to the privacy issues involved.  There may also be a membership time requirement, I am not sure of the exact guidelines.  Just PM her to find out.",
      "MessageIndex": 1,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/755414",
      "Title": "Picture forum notsure MistyJ"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "May 2, 2010 07:18PM MistyJ wrote: Thank you for sharing the Scar Project, very moving. MistyJ",
      "MessageIndex": 16,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752024",
      "Title": "Questions from a student Ugh KorynH"
    },
    {
      "AuthorID": "MistyJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99862/profile",
      "Content": "Jun 3, 2010 05:54PM MistyJ wrote: I had my excisional biopsy with conscious sedation, which I do believe is the same as the twilight.  I went asleep.........then woke up.  No pain, no awareness, no worries.   Hope this helps!",
      "MessageIndex": 5,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753560",
      "Title": "really scared of surgery next week and not being put out totally tovahsmom NativeMainer"
    }
  ]
}