{
  "AuthorID": "mitch39",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46017/profile",
  "Posts": [
    {
      "AuthorID": "mitch39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46017/profile",
      "Content": "Mar 5, 2007 12:30PM mitch39 wrote: thats great news, i hope the same is for me to won't know for a while they said thurs. how long did u have to wait?",
      "MessageIndex": 3,
      "PostDate": "05/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/549843",
      "Title": "path results lindalane winggirl2"
    },
    {
      "AuthorID": "mitch39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46017/profile",
      "Content": "Feb 26, 2007 07:53AM mitch39 wrote: I am positive i am having a lumpectomy as i have already signed the form. Last tuesday i went to see the surgeon about the bruising and he didnt seemed concerned and htat the best thing to do is to remove this mass as he calls it, i can hardly feel it because of the swelling. The bruising today is alot better still a little bruising and the swelling is still there. I am wondering dont you need all the symptoms of IBC to be, the areola is a mishaped and slight bruising and the swelling is all i have. The bruising came five days after the FNA so i dont know if the bruising is from that, beings i had a small bruise were the needle went in which cleared in two days after the biopsy, then on the fifth day the breast was extremely bruised with raised veins and the areola was dark and swollen, warm to the touch. I am just so confused but i am worried for the lumpectomy on Wednesday, my husband thinks just get the mass removed.",
      "MessageIndex": 4,
      "PostDate": "26/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/540975",
      "Title": "not diagnosed yet but have question mitch39 mitch39"
    },
    {
      "AuthorID": "mitch39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46017/profile",
      "Content": "Feb 28, 2007 06:06PM mitch39 wrote: well i had my lumpectomy. he removed a fairly big lump. i am still frozen from the local. i asked about the FNA biopsy two weeks ago and all he said was only showed cystic fluid inconclusive, so he said this is a good choice to remove it. Is cystic fluid a concern. Inever asked him i was already scared for the lumpectoomy.",
      "MessageIndex": 5,
      "PostDate": "28/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/544404",
      "Title": "question, i am not sure what to do mitch39 leaf"
    },
    {
      "AuthorID": "mitch39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46017/profile",
      "Content": "Feb 25, 2007 02:27PM mitch39 wrote: Well now wondering if this is good, but some of the bruising has subsided andthe only bruise i have is on the areola. But my breast is still swollen and a little mishaped around the areola, and it still feels warm the breast but it is not red at all, some the veins are still noticeable. I go and see the general surgeon on wednesday for a lumpectomy but iam worried still, and he still has not let me know about the biopsy that was done on the 12th. I am wondering if it was all from the biopsy, but this didnt happen the first time i had a biopsy so i am not sure.",
      "MessageIndex": 2,
      "PostDate": "25/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/540975",
      "Title": "not diagnosed yet but have question mitch39 mitch39"
    },
    {
      "AuthorID": "mitch39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46017/profile",
      "Content": "Feb 28, 2007 09:02AM mitch39 wrote: first thanks for the responses it has really helped. I am still scared, for the lumpectomy which is today. The bruising is better even today so that makes me happy, i do feel that i think it is B9 but what concerns me is the size. I also noticed the left breast is not as swollen but still bigger then the other. I ve decided on having local for this procedure i hope all goes well and i feel nothing. Thanks again and i will post soon with the outcome and results.",
      "MessageIndex": 3,
      "PostDate": "28/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/544404",
      "Title": "question, i am not sure what to do mitch39 leaf"
    },
    {
      "AuthorID": "mitch39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46017/profile",
      "Content": "mitch39 wrote: Has anyone had extreme bruising and swelling and some blood vessel were raised five days after a FNA. Its been 11 days now and around the areola it is still real dark bruising and the breast is still swollen, i went to the doctor last tuesday and he thinks it is ok and that the biopsy wasnt in yet and he has decided to do a lumpectomy next wednesday. When i first went to him the lump i felt was small and was at the the 3 oclock on the left breast when he did the biopsy he was more over in the center above the areola and he told my husband the lump is here so iam a little worried. My husband said he called it a mass, should i be concerned. The mammo and ultrasound were ok mammo done in Oct and ultrasound in Jan. I had no swelling in October but near the end of Dec i noticed the left breast was bigger then the right about a cup size difference. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/540975",
      "Title": "not diagnosed yet but have question mitch39 mitch39"
    },
    {
      "AuthorID": "mitch39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46017/profile",
      "Content": "mitch39 wrote: I have my lumpectomy for a mass on the left breast tomorrow, but the biopsy i had on the 12th i still dont know the results when i see him tomorrow i have choosen a local so i am going to ask him what the results were first. But i am so scared, what do they mean when they say a mass?? My husband thought the surgeon said a mass of breast tissue, do they remove that and then take to pathology. If my left breast wasnt bigger then the other i would probably wait and get a second opinion but it is a cup size bigger then the other since the end of dec. and it hasnt changed in size but it hasnt really got bigger, oh so confused and dont know what to do. Another thing that has me scared is that i had a biopsy in Oct and never had much bruising very very little and then this last biopsy same biopsy and five days after that biopsy my breast got hot, bruised black and purple with raised veins and swelling of the breast, and it has gotten better but i am still concerned has this happened to any one else. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/544404",
      "Title": "question, i am not sure what to do mitch39 leaf"
    }
  ]
}