{
  "AuthorID": "mix",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58533/profile",
  "Posts": [
    {
      "AuthorID": "mix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58533/profile",
      "Content": "mix wrote: i've been around the boards before - a while ago when i found another fibroadenoma (i have a history of them). there is one i haven't had biopsied recently, and it's been around for a year.  however, i THINK i might have had it biopsied over 10 years ago, when i had another one removed (i was in my 20s then, i am 37 now).  i cannot remember if it's been biopsied or not, and i really don't want to get it poked again if it's already been stuck with a needle. i guess my question is... if it hasn't grown in a year and a half, do you think it's ok?  i would say it's about the size of a grape.  it gets painful once a month - around the time of my period, i get shooting pains in it.  other than that, i don't get much pain unless i am laying on my front.  it gets a bit squashed as it's so close to the top of the breast now. i do remember a lump in the same area years ago, but it was more in my breast (at the 12 o'clock position), but now my breasts have gone south, i think it's more exposed. has anyone had a similar experience?  can someone calm my fears? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/695309",
      "Title": "i need your input, please mix Beesie"
    },
    {
      "AuthorID": "mix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58533/profile",
      "Content": "Nov 12, 2007 01:01PM mix wrote: yeah, i know... it's best to get it looked at.  just WISH i'd made a note of what i found before.  or that i had a crystal ball lol. bah humbug. ",
      "MessageIndex": 4,
      "PostDate": "12/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/695309",
      "Title": "i need your input, please mix Beesie"
    },
    {
      "AuthorID": "mix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58533/profile",
      "Content": "Nov 12, 2007 12:26PM mix wrote: thanks for your input. i meant to say that the lump seems to swell a bit during my period, and then shrinks down a little bit and becomes painless afterwards.  something i have always been confused about.  is having multiple fibroadenomas the same as having fibrocystic breasts?  or are the totally different things?  are fibrocystic breasts made up of fluid filled cysts?   i don't think i have ever had a fluid filled cyst. the thing that puzzles me though is that this lump seems to swell and then subside on a monthly basis.",
      "MessageIndex": 2,
      "PostDate": "12/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/695309",
      "Title": "i need your input, please mix Beesie"
    },
    {
      "AuthorID": "mix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58533/profile",
      "Content": "Nov 12, 2007 10:50PM mix wrote: that would be great if you could post here if you find out :) haven't had any swelling underneath my arm, but i will watch out for that.   then again, i'm not exactly small, so it'd be hard to tell if it was me or swelling anyway.",
      "MessageIndex": 6,
      "PostDate": "12/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/695309",
      "Title": "i need your input, please mix Beesie"
    }
  ]
}