{
  "AuthorID": "MJ1030",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253480/profile",
  "Posts": [{
    "AuthorID": "MJ1030",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253480/profile",
    "Content": "Jun 5, 2017 10:22AM - edited Jun 16, 2017 05:24AM by MJ1030 Thank goodness that I found this support group and I appreciate all of the advice and info that you friends are sharing. I was having shortness of breath and some tightness in my chest. My father, and best friend, died at the age of 63 back in 1988 of heart disease so I wanted to have some test ran. My mother will be 90 years old in August and I did not want to worry her...so I did not tell her about the heart issues or that I was going to have a stress test until I knew if there really was an issue. My cardiologist instructed me to have a stress test. I decided that since I would need off work for 4-5 hours that I might as well make a complete day of fun and have a mammogram. I was getting mammograms about every 1-2 years as I had no problems before. I called my Mom from the Mammogram office as I knew she might call my work and be worried if I wasn't there. I didn't think a thing about telling her that I took off to have a mammogram, thinking it would be a non issue. The stress test came back that I do have a high risk of heart disease and they put me on 2 kinds of heart medicine...but I had no blockage, Praise The Lord. The next day I received a notice that my mammogram results were abnormal. From there I had another mammogram with an ultrasound and a few days later a needle biopsy. I received the news that I had invasive ductal carcinoma on Thursday, April 27th and had surgery scheduled the following Friday, May 5th. My surgeon did a fabulous job with removal of the lump which was 1.4 centimeters with clear margins and there was no cancer in my lymph nodes. However, that nasty HER2 was positive and my cancer was a grade 3 so it was very aggressive. My oncologist said that had I waited 6 months, my cancer would have probably been stage 4 and in my lymph nodes. I have made peace with the diagnosis and I am not mad at all...but still really sad and scared. The unknown is what is scary to me. I think I have also made peace with losing my hair..but I have always been known for my \"big\" hair as I refuse to let the 80s go all together! :-) I get my port put in this Tuesday and will have my first chemo on June 14th. I will have treatments every 3 weeks for 6 times. Radiation will start October 17th for 16 days and then a year of Herceptin infusions. It is going to be a long road but I love my life and am going to fight every single day and pray this journey will be a distant memory and I will only come out stronger than before. I have an awesome husband (who lost his mother to breast cancer), my sweet Momma and a wonderful group of friends who are my prayer warriors and such an awesome support team. Actually 3 of my best friends and co-workers have been though cancer and chemo within the last year or 2 and have held my hand many times when the tears started to flow. SO many people are affected by this ugly disease and I will continue to pray for them as I will for you all in this group. We WILL beat this and hopefully pay it forward and share our success stories and be there for those who need us just like our friends...and even strangers have been there for us. Much Love to you all.",
    "MessageIndex": 48,
    "PostDate": "05/06/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
    "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
  }]
}