{
  "AuthorID": "mjm1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
  "Posts": [
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 13, 2014 09:22PM mjm1 wrote: So glad to hear you got good news",
      "MessageIndex": 6,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820138",
      "Title": "please help!!!! Found a lump - Lump is HARD NOT MOVING AND BIG?? Sunny85 mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "May 1, 2014 12:32AM mjm1 wrote: Hi Billy, I'm going to post twice - the first one a quick one to say - there is a good chance it's going to be ok, please breathe. My Mum has HER2+ as well. I will write a longer reply to your qs now, but had to post that first in case you are in turmoil. xoxo- Miriam",
      "MessageIndex": 1,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820702",
      "Title": "Biopsy results/HER2 +3 billy1973 SpecialK"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "May 1, 2014 03:12AM mjm1 wrote: Hi Billy, the medication he was probably expecting was the pills that women with hormone receptor positive (er+ or pr+) cancer are given, such as tamoxifen. With HER2+ but hormone receptor negative, chemo + herceptin is the standard treatment, and the pills they give for hormone+ cancers won't help . Herceptin is given as an infusion like chemotherapy. I don't know the chances that it will have metastasised, waiting to find out the results is hard. HER2+ is aggressive meaning that it is usually a grade 2 or 3 out of 3, which means the cells divide and grow quickly. I think this means it can grow quickly in the breast, spread quickly to the lymph nodes, and is more likely to spread. But it certainly doesn't mean any or all these things will have happened. Mum's was 2.2cm, negative lymph nodes and no metastases. She was told that after surgery (she had a mastectomy), if she didn't have further treatment (she had chemo and herceptin), there was a 45% chance it would be back within 5 years. The scans are to check the main areas that breast cancer goes to if it spreads - one for bones, and one for liver, lungs and brain. Some doctors do these scans more often than others. The surgery is designed to stop the primary cancer developing and get rid of it. The radiation is to kill any remaining cancer cells in that area. Systemic treatments such as chemo and herceptin are to try and get rid of any metastases, and/or to kill any tiny cancer cells that may still be in the body after surgery, to try to prevent future metastases. I didn't know that either until this year - you would think surgery gets rid of it all. It would have been better not to have the delay, but delays do happen for various reasons. My Mums surgeon says he prefers to start people on chemo 3-4 weeks after surgery, but she had an infection and couldn't start til almost 6 weeks after surgery. Other people have longer delays. I don't understand not giving her radiation after removing a lump and lymph nodes though? Here in Australia, you either have just the lump removed plus radiation, or you have a mastectomy. I do think your doctor may not have done the best thing, however delays are not altogether uncommon so try not to let it add to your worries at this time. Just make sure she gets to a good oncologist, ideally with good breast cancer & HER2+ experience. It might be worthwhile trying to find a good oncologist yourselves if you don't trust the surgeon? Are there any highly regarded breast cancer clinics / hospitals where you live (or close enough to travel to for treatment)? Or another doctor you trust more that could give you a referral to an oncologist (I don't know if you need a referral in greece or can go directly to an oncologist)? I'm so sorry you are going through this. I found the time when we didn't know if it had spread or not, and before treatment was underway were very hard. Once you have the scans, and a good oncologist you can trust, and the rest of the treatment begins, hopefully it will feel better. best wishes",
      "MessageIndex": 6,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820702",
      "Title": "Biopsy results/HER2 +3 billy1973 SpecialK"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "May 1, 2014 01:04AM mjm1 wrote: Ok, post 2. First of all, yes, HER2+ is an aggressive form of cancer, however they have developed some excellent treatments. The main one of these is Herceptin, which is given in combination with chemotherapy. This brings the survival rates for HER2+ more or less in line with more common types of breast cancer. 2.4cm is medium sized. Not great, but not awful. Any positive nodes is bad, but fewer is better than more. You will only know if it has spread based on the results of the scans they are doing. If it has spread, in some cases women can survive for many years on Herceptin - my mums oncologist says she's got patients who have been on it for as long as 13 years (and still going) after their cancer spread. There are women on these websites who've been going even longer. Obviously not everyone with cancer that has spread is this lucky, but it's nice to know that sometimes they can keep it at bay very well. However, hopefully it has not spread.  If it has not spread, and she gets good treatment, her chances of not only being alive, but having no active cancer (although always a chance of relapse) in 5 years are good. I am concerned that they did a lumpectomy without giving her radiation - in many parts of the world they only do lumpectomies with radiation afterwards. I am concerned that it has taken them 50 days to get these results to you, and are only organising treatment now. I don't know whether it's better for her to have radiation then chemo+herceptin, or the other way round, but I think given HER2+ is aggressive, she should be seeing an oncologist and starting treatment as soon as possible. My mum is 62 and was diagnosed in January.  How is your Mum's health otherwise? Does she have any heart problems? I only ask because Herceptin can have some effects on the heart. There are all sorts of wonderful new drugs being developed for HER2+ cancer. It used to be a terrible kind of breast cancer to have. It is not anymore. I am wishing you well on the scans - I so much hope they are all clear. xo-Miriam PS they are not silly questions at all and your English is very good.",
      "MessageIndex": 3,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820702",
      "Title": "Biopsy results/HER2 +3 billy1973 SpecialK"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 14, 2014 10:17AM mjm1 wrote: If you have the option of taking a little extra time off or keeping your options open, I'd do that. Was it the Friday we've just had, or this week that you've got your surgery? (the international time differences confuse me!). Hope it goes/went well!",
      "MessageIndex": 7,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/820029",
      "Title": "New here - Getting ready for surgery and nervous!! Ccsmom Ccsmom"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 10, 2014 01:22PM mjm1 wrote: Is ultrasound an option? That's what they always use on me because of youngish age + dense tissue. And it's more comfortable than a mammo. Good luck with your surgery & results. As farmer lucy said, there's lots of threads from others facing the stress of 6 monthly testing. Best Wishes!",
      "MessageIndex": 3,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/820029",
      "Title": "New here - Getting ready for surgery and nervous!! Ccsmom Ccsmom"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 11, 2014 07:15AM mjm1 wrote: What sort of biopsy are you having - since you say surgery, I'm thinking an excision biopsy to remove the lump? Most ladies seem to recover from these pretty well, but you may well be feeling the effects of the general anaesthetic a bit on Monday.  Personally, I was surprised how long my recovery took - had an excisional done 2.5 weeks ago, and was very fatigued and sore for at least 2 weeks - only just starting to feel capable of concentrating again, and I still eye up a full 2L bottle of milk warily before I lift it. I think it depends on how much tissue they need to take, where etc. My surgeon said 6 weeks to be 80% recovered. But I think I'm a bad example:)",
      "MessageIndex": 5,
      "PostDate": "11/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/820029",
      "Title": "New here - Getting ready for surgery and nervous!! Ccsmom Ccsmom"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Jul 18, 2014 05:57AM mjm1 wrote: How frustrating! I agree that the most likely outcome is that it will tun out to be something benign like fibrocystic changes, but you are doing the right thing trying to identify what a lump is and its annoying that they are not giving you an answer. I had several lumps ultrasounded and biopsied in my 20s - often a fine needle aspiration is enough to assess what a lump is in a relatively non-invasive way. I've had an excisional biopsy too, and I'm surprised your surgeon would skip straight to talking about that before a fine needle or core biopsy. An excisional is definitely worthwhile if less invasive biopsies raise concerns or leave doubt about a lump, but are not something I would want to do often or lightly (painful, left a scar, and for some can cause other cosmetic effects such as indentation - all better than having cancer, but not a first line response to a new lump in my opinion)  Hopefully the breast centre will be of more help.",
      "MessageIndex": 67,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821595",
      "Title": "29, not taken seriously because \"I'm too young\" Sparkle2829 Lionesse2"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 7, 2014 01:24AM mjm1 wrote: Hi Clickety-Clack, I'm so sorry to hear about your mum's diagnosis, and it's awful that you guys had to wait so long to find out!  The benefits of chemo and other treatments vary a lot depending on the type and stage of cancer it is etc. I have read a lot of research studies on the type of cancer my mother has, and the treatment she is having (chemo + herceptin) GREATLY increases the chances she will still be in my life in 5 years.  I know people have different opinions on treatment options and would support anyone in doing what they feel is best after looking closely at their options, but chemo is generally recommended when they're worried that there could be metastases or micro-metastases - ie some cancer cells however small remaining in the body perhaps in the blood/lymph systems. Surgery and radiation are targeted just at the local area (breast/armpit), whereas systemic treatments like chemo address existing or possible cancer cells elsewhere in the body. It would be very worthwhile to get as much info as possible including from her doctors in order to know about the benefits of different treatments - including the 5 year survival or recurrence rates they would expect with chemo vs without chemo. This is just my opinion, but given that the cancer has reached at least 1 lymph node there is increased risk of it spreading, so I would be throwing everything I could at it. There is a page for Stage 3 cancer - you could also ask there about what treatments the other ladies in that situation have chosen and why. Best wishes.",
      "MessageIndex": 10,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815538",
      "Title": "Worried about my mom clickety_clack clickety_clack"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 4, 2014 01:58AM mjm1 wrote: Hi Dree - I'm glad you posted how you were feeling. I think sometimes feeling lonely and let down is, sadly, part of this stressful rollercoaster ride. Along with every other emotion under the sun. Hopefully you feel better now xo",
      "MessageIndex": 14,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819838",
      "Title": "I'm scared too ... why such little support for me?! dree2014 marie5890"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "May 1, 2014 12:15AM mjm1 wrote: Hi WolfsLady, I can't answer many of you questions except about what its like having an excisional biopsy. This varies for different people - you will have seen Melissa's comments on that other recent post, and a few other people have described their experiences in older threads. Mine was a long distance out from the nipple, so hopefully others can comment on whether there will be a loss of sensation (or maybe the surgeon can answer that too?). I had mine as a day procedure, so I went to the hospital in the morning. I first went to radiology as my lump was non-palpable so they used the wire-guided process, so they inserted a small wire while using ultrasound to find the spot. If you have a marker this probably won't be necessary for you (but they use a local anaesthetic and it was fine). Then I went and checked into the hospital, filled out some paperwork, changed into a surgical gown and waited for a couple of hours in the patient lounge. Then wheeled down on a bed to wait for my turn in the operating theatre. The canula they put in my hand really hurt going in (I couldn't help but swear, and the anaesthetist said I had 'tough skin'). But then I was out like a light. Was tender for a few days - if you have a soft sports bra (no underwire, but padding feels very protective) this is good day and night. I also found from about 6 days in til 2 or 2.5 weeks had a lot of skin sensitivity - like a bad chafing feeling all the time even when nothing was touching it, plus a bit of clenching pain whenever I did too much with my left arm. The incision/scar really didn't hurt. The top half of my boob was numb, and I still have a small numb patch about 5 weeks in but it's getting smaller, and I have virtually no pain now - just starting to get back into exercises and can feel it if I overdo things. I was also really exhausted for about 2 weeks - I didn't realise why I was having so much trouble concentrating til my Mum pointed out how tired I was and that my body was still recovering - obvious looking back, cos I'd get up thinking \"oh no, now I've got another 15 hours til I can go back to bed\". I think mine may have taken longer than average to heal because the lump was so far from the nipple (so they had to dig a long way to get to it) and/or because of dense tissue and the cosmetic procedure the surgeon did to redistribute tissue to avoid any 'dents' (more likely to be a problem in dense tissue apparently) so at least about a third of my breast circumference was affected by the surgery despite only being 2 very small lumps. Raise any concerns you have (e.g. whether there'll be a loss of sensation) with the surgeon. Its always a bit hard making decisions when there isn't the clear cut right and wrong (e.g. if it's cancer removing it is a no brainer), but good luck getting the info you need and the pain sorted out.",
      "MessageIndex": 1,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/820701",
      "Title": "Pain after core biopsy - papilloma - Probable excisional biopsy WolfsLady WolfsLady"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 7, 2014 12:51AM mjm1 wrote: Hi Sandy, good luck with the pain. I'm almost 2 weeks out from an excision biopsy (turned out to be benign thankfully!), but most posts about excision biopsy just say its minor surgery and people got back to normal quickly. This differs from what my surgeon said (he said a lot of tissue was affected, and that it's going to take 6 weeks to be 80% healed - I think it varies enormously depending on the amount of tissue taken, where its located, what nerves and tissue get damaged in the process, how many internal sutures there are and how much tissue is affected in remodelling work to smooth out the dents, possibly whether the lump is located in fat vs dense tissue etc etc. During the first few days I was telling everyone I hardly had any pain as long as I took it easy - then day 6 suddenly things stopped being numb and started being sore. The pain / skin sensitivity has been driving me nuts for about a week, and the lumpectomy/mastectomy pages seem to have more info on this. Its soo nice finding other people who understand what this feels like and can talk about how long it lasted and what they found helped. For me, if the 'skin' pain was only for an hour or so at a time I could handle it more easily, but its sort of like fingernails on a blackboard...after a couple of days of it non-stop it makes you want to scream.",
      "MessageIndex": 48,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/680051",
      "Title": "Post surgery NERVE PAIN seacat mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 2, 2014 04:29AM mjm1 wrote: Hi MichMom, I'm no expert in the different things it could be, but as Leaf said, fibroadenomas are one example of hard benign lumps. I have about 10 of these, and can only feel some of them (probably the ones nearer the surface), and the doctors aren't worried about them. Waiting on biopsy results from a different type of lump now, so fingers crossed we both get good news.  Good luck!",
      "MessageIndex": 2,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/819763",
      "Title": "Unexpected....questions michmom14 michmom14"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 9, 2014 12:28AM mjm1 wrote: Also possible that it looked very clearly like cancer (Mum's radiologist wouldn't say cancer, but 'very suspicious' and her tone of voice made it pretty clear), and was large enough that they thought neoadjuvant chemo before surgery would be unlikely to shrink it enough to choose a lumpectomy instead? You'll get a fuller picture after talking to the surgeon though, and after biopsy results. For example, the surgeon explained that the staging is based only on the invasive cancer part not the ductal carcinoma in situ part, so we went from thinking mum had an absolutely massive cancer that must be advanced to more of a medium sized one. Big hugs!",
      "MessageIndex": 4,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819999",
      "Title": "Sucker Punched Ever45 mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 15, 2014 09:59PM mjm1 wrote: Hi Rosie, if in doubt, see your doctor. That's the only way to know for sure. But try not to worry too much in the meantime (although we all do of course).",
      "MessageIndex": 1,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820227",
      "Title": "Lump & swollen armpit. Please help! Rosiee2011 FidChick79"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 8, 2014 11:52PM mjm1 wrote: Yes - thinking of you today.",
      "MessageIndex": 11,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819893",
      "Title": "Where I'm at...just needing a little support Nikkito Ddkath70"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 9, 2014 08:30PM mjm1 wrote: Oh yuck - more waiting!  Great though that you have a good doctor who is so thorough. Hopefully once you do get some answers that'll reduce the chances of more surprises later (I was kind of surprised how many women go into surgery thinking they have a smaller lump than it turns out to be - we were very grateful that Mum's radiologist was very thorough and accurate, as it must be quite devastating to feel things are worse than initially thought combined with getting over the surgery). We are having a very nice day, went for a lovely walk this morning. Chemo was on Friday, so this is the bad week, but today is much better than yesterday. She is actually sitting next to me now and sends her love and best wishes. Hope you can ease the waiting with some more nice outings with your son. Sounds like you two have a wonderful relationship.",
      "MessageIndex": 14,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819893",
      "Title": "Where I'm at...just needing a little support Nikkito Ddkath70"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 6, 2014 03:04AM mjm1 wrote: Hi Nikkito, Just wanted to let you know I'm thinking of you and hoping for good results for you. I was sitting with my Mum in her gps office 3 months ago when she heard those dreaded words (the day after her mammo the dr rang to say \"please don't wait for your friday appt -come in right now\" so I drove her, knowing it was going to the worst day of our lives), and as TB90 so accurately said, you do fall a.part...but then you start dealing with it. The early bit is the worst - the diagnosis, waiting to know just how bad things are, the grieving for everything you may be about to lose, but somehow once you have all the info, as horrible as it is, you can start the action plan to beat it. I know that primal scream you mean too. It is great that you have a good hospital, and quick diagnostics. And that you are on here. It took me a few days after the diagnosis to be able to face what I might read on any websites or research studies, and once I did, and once we had the first appt with the surgeon I finally started to get past the terror that this would be the year I lose my Mum, and start to appreciate the amazing medical breakthroughs they've made in breast cancer research (e.g. the herceptin & perjeta that Jeslyn having). I'm hoping for a very good outcome for you (preferably without the \"fun\" of chemo, rads etc, but if you have to do it I know you will get through it. xo",
      "MessageIndex": 6,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819893",
      "Title": "Where I'm at...just needing a little support Nikkito Ddkath70"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 16, 2014 08:07PM mjm1 wrote: Hi Ever45, I'm so sorry you got bad news. As  Alex said, breast cancer is often very treatable. It's still a massive shock though, and so much to adjust to with the surgery etc. We found the days after Mum's diagnosis and before we knew the full picture the worst - once we knew more and had an action plan for treatment it began to get easier. You'll find lots of info on the surgery pages from women who have had a mastectomy, and if you have questions I'm sure you'll get good advice and support. Wishing you well xo",
      "MessageIndex": 6,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819999",
      "Title": "Sucker Punched Ever45 mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 15, 2014 01:37AM mjm1 wrote: Hi Nikkito, sorry it's wearing you down. Hopefully not too long now to get some answers. I too am a lumpy gal. If you have a good breast clinic, they should be able to advise on how to monitor, and when its necessary to remove. I have 11 lumps in a pair of smallish b-cups, so if they removed all mine I wouldn't have much left either. The decision is often not just based on how big the lump is, but what they think it is. Some lumps are completely safe, some are ok now but may develop into something later, some are probably ok but have a small risk of containing something nasty now, etc etc. If they do want to remove something and you are concerned about the cosmetic effects, you could see if the surgeons can use oncoplastic techniques such as glandular remodelling (which is what my surgeon used). I do not understand how he could remove 2 different 3cm areas, without leaving me noticeably smaller, just by moving the rest of the tissue around (surely there should be less in there???) but he managed to work some magic. I try to notice any major changes, but it does get hard when there are so many lumpy bits! I get ultrasounded approx once a year (frequency goes up and down depending on what they find), and the poor technician has to line up all the ones from the previous scans to see whats new or changed. If any of the cysts are liquid filled they may be able to get rid of them just by aspirating. I'm not sure what size they suggest removing fibroadenomas - I think my biggest are 2.5 or 3cms ish and they have been allowed to stay.  Once you know what you're dealing with (i.e. hopefully hear those magic words \"not cancer\") dealing with busy boobs won't be so stressful. Hang in there! xo",
      "MessageIndex": 29,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819893",
      "Title": "Where I'm at...just needing a little support Nikkito Ddkath70"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 7, 2014 02:59AM mjm1 wrote: Hi Nikkito, one thing about the horrible waiting is those beautiful moments look extra beautiful don't they?. It must be so hard having been there with family members then finding yourself there. Good luck with the biopsy tomorrow and results. Some of the women here talk about waiting for weeks for results - several days is bad enough! Mum is doing pretty well now. She's halfway through her chemo. The first cycle was really hard on her - the side effects she got weren't the one's she was prepared for, but she's been really amazing in finding ways to get through it so the next couple of cycles haven't been as horrible (daily walks, food choices, medications etc).  We are very close, and had always taken for granted that she would live well into her 90s like our grandmothers. I am hoping to start a family soon, and those are the sort of experiences you want your mum around for (well, if you're lucky enough to get along well). We've pretty much got through the bomb going off stage of diagnosis, and Mum's coping amazingly well with all the adjustments (this was not what she had planned for 2014!). Now she's dealing with getting through the chemo fatigue, I'm trying to get my head back into my PhD (and recovering from surgery to remove a couple of small lumps - benign after all thank goodness!), and every now and then we both have to deal with that fear of her having a recurrence. But things are getting better. And I'm still hoping she'll make it to 95. Let us know how you get on.",
      "MessageIndex": 8,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819893",
      "Title": "Where I'm at...just needing a little support Nikkito Ddkath70"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 13, 2014 11:22PM mjm1 wrote: Hi NSwrites, Hopefully it is just a pimple. I'm prone to breakouts, and got more than usual on the 'target area' which i put down to some combination of the gel they put on for the ultrasound, the dressings they put on after the biopsy (and accumulated oil while it was covered), and me poking prodding and inspecting it. If so, the red spider veins could just be a minor bleed from squeezing it. But mention it to the doctor - always good to check these things. I'm sorry I can't remember if you had it biopsied yet - if so various things can happen at the site, some of which disappear of there own accord, but some of which are signs of infection - if it could be an infection, see the dr and get on antibiotics if needed. Best wishes",
      "MessageIndex": 1,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820145",
      "Title": "new issue on breast? NSwrites snorkeler"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 15, 2014 06:25AM mjm1 wrote: I would have thought with your family history they would order the test - how frustrating! Good luck. Start with calm and rational, but be the squeaky wheel if you have to.",
      "MessageIndex": 1,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820184",
      "Title": "Frustrated eyeh8beer cocourt"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 8, 2014 12:27AM mjm1 wrote: Hope the wait isn't driving you nuts and that you get good news tomorrow.",
      "MessageIndex": 3,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819965",
      "Title": "Waiting for diagnostic mammo results abbeyesque abbeyesque"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 3, 2014 06:38PM mjm1 wrote: Thanks Caryn. Beesie, I wasn't trying to inflame things by bringing it up, I'm sorry if I've added to any hurt feelings, but I really felt it needed saying. And as you would know, 3 weeks in the world of breast lumps is not all that long, so the OP may still be around even if she hasn't posted lately. Perhaps she's been to the gp, perhaps she's stressing over biopsy results, or perhaps she's had her results - hopefully good news, and not that gut wrenching moment when your world crumbles. If she's going through any of that, I would hate for her to feel she wasn't welcome here.  I and my family have gained enormous comfort from the wisdom and kind words of the lovely women on these sites, and feel they can play a very important role in coping with some of the darkest days. I'd be very sad to see some women excluded from that because of cultural misunderstandings.",
      "MessageIndex": 27,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818943",
      "Title": "Is my condition severe? Need help Swastika mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 4, 2014 09:45PM mjm1 wrote: Hi Tangandchris, hopefully the one aspiration does the trick. My Mum had a seroma after her mx also left side, across the scar and also under armpit. Was having up to about 500mls removed 2 times a week for a month. Also got infected - try to avoid that if you can - get on antiobiotics asap if you get signs of infection. The good news was that it got smaller every week. And she was advised to seriously minimise use of that arm (and not start exercises of that arm) til it healed. Best wishes!",
      "MessageIndex": 6,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/819791",
      "Title": "Seroma Question tangandchris lynnlyre"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 13, 2014 01:46AM mjm1 wrote: Hi DDkath, When my mum was diagnosed, she read online somewhere that women who are involved in picking their own medical team had better outcomes - but we had no experience in this area and freaked out a bit.  Her doctor had referred her to a surgeon, but at this point we didn't know if we should go with him or hunt around. What I did (and this was before we found these websites) was contact the 2 people I knew through work who I thought were most likely to know people who might know, and they put out some feelers for me. We were so grateful to hear back through this grapevine from a number of women including doctors and patients (or both). Different surgeons names came up, but one MOs name kept coming up as being 'the best' - both by patients and by a doctor who said this onc was 'who her dr friends go to'. i figured that means she's got the expertise + the bedside manor. (and bonus, turns out she's married to the original surgeon mum was referred to).  Other factors in their favour - involved in research, which I figure further increases the chances they'll be at the forefront of new developments, work at a specialist clinic so loads of experience in the area, and both are great communicators. I had no idea I had such great 'networks' - it's amazing how many people have a friend/mother/sister/aunt who has had bc, and they were so generous with their advice. I adore  mums doctors and hope you find a fantastic mo. Best wishes.",
      "MessageIndex": 3,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820076",
      "Title": "What to look for in a MO - any veterans who can help? Ddkath70 vbishop"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "mjm1 wrote: I had an excisional biopsy last week to remove 2 small lumps, and I'm curious about a couple of things: 1) Was anybody else surprised at how much tissue was removed? I had 2 tiny lumps (0.5cm in the largest dimension), and had asked the surgeon about margins (I wanted to be sure it was all OUT) and he said they don't like to be too radical if there's a low risk of malignancy - they would re-excise if there was cause to. But my path results show 2 chunks of tissue removed (approx 3 cm x 2 cm x 1 cm).  2) Did anybody else get worse pain in the 2nd week than the first week? In the first few days I was mostly just tender and numb, and only took a few painkillers, but from day 6 on I have had a lot more pain. Manageable, but really annoying, especially at night. I alternate between wanting the support of a bra and not being able to bear anything touching the numb-sore area. The surgeon said a lot of tissue is affected because they had to tunnel a long way out from the areola to remove the lump (6cm away from nipple), plus moved extra tissue around to fill in the 'dents' so I'm in the 'very early days of healing'. Is week 3 likely to be better or worse? I am so grateful that my results came back benign, but I feel like between my mums cancer diagnosis in Jan and now chemo, and my own biopsies and surgery that boobs are completely derailing 2014 for me. When will I feel normal again???? PS Never felt more pathetic than sitting in the chemo lounge with Mum today, wanting to cry from how friggin sore I am, while I'm surrounded by women going through chemo and still able to smile. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/819848",
      "Title": "Excision biopsy questions...and vent mjm1 mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 2, 2014 08:24AM mjm1 wrote: Hi Nancy, just wanted to let you know I'm thinking of you and sorry you are going through all this stress. There are a few different types of ultrasound guided biopsies, and I've had 3 of them in the last month! Fine needle aspiration didn't hurt a bit.  Core biopsy wasn't too bad - I'd scared myself by reading a few reports of people who'd had very painful ones, so mostly I was just relieved it didn't hurt too much. Tender for a couple of days, felt slightly shaky afterwards (I'm a wuss) but fine to drive myself home. Bruises for a coupla weeks. Excision biopsy where they take the whole lump seems to vary a lot for different people depending on the size and location of the lump. A bit more ouchy, but manageable. Having to take it very easy, but the pains not too bad. Be gentle on yourself.  The waiting and not knowing is so horrible, especially having lost a parent to cancer - your mind is naturally going to go to the worst places. But most biopsy results come back with good news. And as one of my friends said when my mother was diagnosed with cancer a couple of months back \"if it had to be cancer, at least it's breast cancer\" - because its usually not the death sentence we fear. Not sure if that's comforting or not, I hope so! But fingers crossed its all beautifully benign, and you can breathe a big sigh of relief when the results come back clear.  ",
      "MessageIndex": 19,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819718",
      "Title": "No response Nancy40 marie5890"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 2, 2014 08:00PM mjm1 wrote: The sensitivity around the topic is certainly understandable, but it's her real NAME, and given in a cultural context where it has none of the more recent and terrible associations. I'm sure everyone means well, but isn't it being a little unfair to push someone into changing their (first) name just because she's from a different culture and language background? It was reasonable to raise the issue, but now she has explained the context, there's clearly no racism in the name (in this context), surely this is a place to focus on the bigger battle we all share here?  Understanding goes both ways. So can oppression - let's rise above that.",
      "MessageIndex": 21,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818943",
      "Title": "Is my condition severe? Need help Swastika mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 5, 2014 05:30PM mjm1 wrote: Thanks SarahJane. Definitely sounds like nerve pain. I'm sorry to hear you went through that pain, but it's nice to know that I'm not the only one who has had this. I read so many posts from women who had excisions or lumpectomies who seem to be breeze through it and be out riding bikes and running marathons at this point! Took a restavit last night and managed to sleep almost through the night, so am feeling a bit better about everything today",
      "MessageIndex": 2,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/819848",
      "Title": "Excision biopsy questions...and vent mjm1 mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 15, 2014 06:36AM mjm1 wrote: I hate to be negative, but there's research showing that starting chemo (if you need it) sooner rather than later increases the chances it'll work. Sometimes there are medical reasons to delay (complications after surgery, fertility-related). And ultimately it's your choice. But discuss with your doctor. Hopefully being low grade and early stage will mean the treatment will be in a form that can fit in with your holiday. Best wishes!  ",
      "MessageIndex": 4,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820176",
      "Title": "Can I delay treatment after surgery? goofytoo goofytoo"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Jul 15, 2014 01:40AM mjm1 wrote: Hi Denise, has your mom had her biopsy results back yet? I hope they are good news! Sounds like there is a very good chance that it won't be cancer. If it is, what happens next takes a little while to determine - they may need to do more tests and biopsies to find out more about the cancer and how best to treat it - e.g. surgery (lumpectomy or mastectomy), some women need chemo either before or after surgery (others don't need chemo), some need pills that affect hormone levels, some need other targeted therapies, some need radiation therapy.  Being caught early is a very good thing too. If it turns out to be cancer, you guys will get through it, but hopefully you will get good news and not have to!",
      "MessageIndex": 1,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822575",
      "Title": "Wait for my mother to get her biopsy done Denise0236 mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 5, 2014 03:40AM mjm1 wrote: Hi Jaxzgirl, it's a bit overwhelming how many doctors appts there are at the beginning isn't it?! No one tells you just how BUSY you'll be after a diagnosis. Things do seem to settle down into a bit of a routine before too long where you at least have a chance to take a breath and process things instead of constantly bouncing around between doctors and nurses and testing places. All the best. PS, if the blood boosting shot is Neulasta, a lot of women seem to report benefiting from taking Loratadine/Claratine (an over the counter antihistamine medication) to avoid side effect of bone pain. It's still being scientifically tested, but if your oncologist says it ok for you to take, may help avoid one more side effect.",
      "MessageIndex": 4,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819878",
      "Title": "moving so fast Jaxzgirl Holeinone"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 3, 2014 04:30AM mjm1 wrote: The waiting can drive you crazy can't it - hopefully going ok. If the stress is getting worse not better, you could always ring either the doctor and just confirm that he's not too worried, or call the radiology clinic and ask them to put you on the waiting list if there are any cancellations.",
      "MessageIndex": 6,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819655",
      "Title": "Wishing I had more answers... NSwrites juliaanna"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 17, 2014 12:39PM mjm1 wrote: Fantastic news!",
      "MessageIndex": 13,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820036",
      "Title": "Need Advice busymom3 TifJ"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 2, 2014 01:03PM mjm1 wrote: Hi Renee, I had a very small, non-palpable lump removed last week (excision biopsy). Doesn't sound like exactly the same procedure, but I was starting to get a bit worried because it took the radiologist ages to find the lump using ultrasound in order to place the guidewire, which the surgeon then used as a marker of where the lesion was. Part of me was thinking \"I hope she doesn't just give up and tell me to come back in 6 months, or just stick it in a random spot'...sounds funny looking back, but on the table you start thinking these things:) So far I've had the ultrasound, the fine needle biopsy, the core biopsy, and the excision biopsy -hopefully that's the end of this lump!. Don't think I've had a stereotactic one though. Good luck, hope it's not too uncomfortable & you get good news!!! And even if not, there is often an excellent prognosis these days if caught early, which it sounds like yours is. Lina - best wishes for good results!",
      "MessageIndex": 13,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819301",
      "Title": "Biopsy results: benign vs pre-cancerous Lina999 awb"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 7, 2014 05:00AM mjm1 wrote: Mel, hi from Perth! Good on you for getting it checked, hope your results are good news. I had a couple of lumps removed 2 weeks ago, so am lurking around in the afternoons when the fatigue kicks in",
      "MessageIndex": 1,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819948",
      "Title": "hello.... my first post Mel63 Mel63"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 15, 2014 06:28AM mjm1 wrote: You might get a more informed opinion from someone in a similar poition, but in my opinion, if in doubt, tell them. It's their job to decide if it changes the follow-up plan or not.",
      "MessageIndex": 1,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/820165",
      "Title": "Questions on follow up michmom14 mjm1"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 15, 2014 04:14PM mjm1 wrote: Welcome to the site. It's so stressful finding a lump, but as you've probably read, many turn out to be benign. Sorry you are experiencing so much pain as well as the anxiety of waiting for the biopsy appt - hope you get good news.",
      "MessageIndex": 1,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/820225",
      "Title": "help newbie TCcheermom MrsLce"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 4, 2014 05:13AM mjm1 wrote: Hi, sorry, I have dense breast tissue and am about your age, but they usually ultrasound me, so I don't know about MRI options. Have they biopsied the cyst/lump? That might be a way to get the answers your looking for? Good luck!",
      "MessageIndex": 1,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819811",
      "Title": "breast MRI for dense breast tissue mommy0608 janet58"
    },
    {
      "AuthorID": "mjm1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198593/profile",
      "Content": "Apr 16, 2014 06:10AM mjm1 wrote: Hope it went well - let us know how you are doing, once you're up to it",
      "MessageIndex": 5,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/820191",
      "Title": "Wish me luck! ncsue0514 ncsue0514"
    }
  ]
}