{
  "AuthorID": "mjs",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94807/profile",
  "Posts": [
    {
      "AuthorID": "mjs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94807/profile",
      "Content": "Dec 25, 2009 08:48PM mjs wrote:  ok you guys here is my dilema. my med onc sent me for a consult with rad onc, who says they can improve my 10 year survival by 3% if I have radiation after my chemo. She thinks it is not worth it and is not recommending it, but says ultimately it is up to me and she had me sign a consent to begin.  She also said that compared to chemo \"it is a walk in the park\" Down side is it can really mess up my TE and future implant. Not sure what to do.  (My current statistical model says my 10 year recurrence is about 12%.) Anyone else dealing with this sort of thing? I don't have a bong of any shape but I did get some pot so I am ready for round three! I think I will have it after the Zofran and befor the Phenergan!",
      "MessageIndex": 1101,
      "PostDate": "25/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "mjs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94807/profile",
      "Content": "Dec 22, 2009 02:10PM mjs wrote: Hi All I just discovered you all today. I wish I had found you earlier when this all started. So lots of questions... I had a mastectomy in Oct. with an expander.I am now having chemo with taxotere and cytoxan. I have my third infusion out of four schd on 12/31. Met with radiation onc and trying to decide whether to have rad tx, worried about expander/implant. Also looking for tips re fatigue, weight gain, and head covering options. Happy Holidays Meri",
      "MessageIndex": 1062,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "mjs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94807/profile",
      "Content": "Dec 23, 2009 06:06PM mjs wrote: Thank you all for your warm welcome. You are all truly amazing. I am not alone!!! You get it (all too well.) So I will try to not get you all confused and tell you just a little about myself. I am 50 yo single mother in rural Vermont. Alicia I am originally from Massapequa but left in my 20s.I am a family practice PA. Feeling a bit guilty for not working on the days I feel well.  I too am bothered with body aches, which my onc insists is from the neulasta but I suspect is from the taxotere as well. I have been using ibuprofen and hot baths for the mostly low back pain. Other SE this cycle is nosebleeds (maybe from the ibuprofen?) and vertigo.  I also have a history of migraine and was worried about the zofran  but it has not caused headaches and I get it IV with the infusion, as well as by mouth afterwards. Unfortunately it did not prevent the nausea and vomiting which luckily only lasted about 12 hours. Has anyone tried marijuana?  On the positive side, I dont have to shave my legs anymore. Hooray! And what is a DH anyway? Peace and Joy my Fellow Travelers",
      "MessageIndex": 1084,
      "PostDate": "23/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "mjs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94807/profile",
      "Content": "Dec 25, 2009 10:04PM - edited Dec 25, 2009 10:05PM by mjs  suepen Me too!!! I am on TC and when it started to fall out after the first cycle I had it buzzed because everyone assurred me it was all going to fall out very soon. Well I am 2 weeks past my second infusion and there is still a lot of hair on my head. Very,very,very short hair. meri",
      "MessageIndex": 4120,
      "PostDate": "25/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}