{
  "AuthorID": "mkell",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201337/profile",
  "Posts": [{
    "AuthorID": "mkell",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201337/profile",
    "Content": "mkell wrote: Hey guys. I posted previously on another board but I wanted to try here too. I am 36 and 32 weeks pregnant. A few months ago I noticed some dimpling on my breasts that just looked to me like enlarged pores to me. I thought nothing of it. I noticed some thickening of the breast skin later as well. I ignored it but saw something about Inflammatory Breast Cancer and freaked! I saw my OB and she said it looked like peau d'orange and sent me to a breast specialist. They did an ultrasound and said it was clear and that what I was experiencing was due to pregnancy.  I felt better when I left but the next morning I woke up panicked. I knew that this was something often misdiagnosed.  The specialist said I did not need a biopsy. I went back and saw a different doc. He is the most trained doc at the breast center.  He looked over my ultrasound and my breasts and said he has seen IBC ans this is not it. He said he was so confident he refused to do a biopsy as well. He told me if I needed more reassurance then to see a dermatologist.  I got in to a dermatology office and saw a doc that isn't a dermatologist but he is a doc with extra training in dermatology. But he only works in dermatology so he knows his stuff. He told me the same as the others. He however said he would give me the biopsy if I wanted. We did it...he took the sample from the thickened skin part. It came back negative for cancer. He said that it showed stretching of skin due to hormones. So here is the problem. One is how does the biopsy show that? I've never heard of a result like that. Next is has anyone else had these issues while pregnant and it not be IBC? My family says that I need to just calm down and let it go because I am okay. My anxiety is so bad my doc had to put me on meds. Any advice anyone? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "15/06/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821987",
    "Title": "Pregnant with Symptoms mkell Morwenna"
  }]
}