{
  "AuthorID": "mkinoly",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
  "Posts": [
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Apr 19, 2016 04:31PM mkinoly wrote: Ali, your original post has been deleted so not sure what your questions were, but I had dimpling. Feel free to ask here or message me.",
      "MessageIndex": 3,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843503",
      "Title": "Breast flattening and indented. Anyone?? Ali81"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Apr 19, 2016 09:45PM mkinoly wrote: I was having mammos every two years and they always contained the disclaimer about how my breasts were dense so basically a mammo wouldn't see anything anyway (wow, so reassuring). I was having a lot of burning pain upon pressure in my right breast for about a month so I was studying my breasts trying to figure out what was going on. Then I palpated a spot on my left breast that I'd never noticed before. It felt kind of flat and thick and really I didn't think it was cancer because I'd always heard it would feel like a hard pea. So when I went to the doctor about the pain in my right breast and mentioned the thick part in my left, I didn't expect it to be the dreaded C. Doctor felt nothing on manual exam and didn't notice dimpling. The tumor did show up on the diagnostic mammogram and on the ultrasound. It also showed on MRI but was misinterpreted/mischaracterized by the radiologist. Although I had been looking at both breasts a lot I didn't notice the dimpling on the left until it was pointed out to me at the diagnostic mammogram. How could I have missed that? I don't know... I had also had random itching of the left nipple for several months and ignored that but didn't have pain. The painful right one is fine, the left one is gone now. I've heard it takes many years for tumors to grow, so I figure mine was present on at least two of my previous mammos and went undetected. Tests and technicians are not infallible and if you think something is wrong you need to keep pursuing it. Find new doctors or whatever you think you need to do to get the answers you can live with. Since tumors generally grow slowly, I would think waiting until after your baby is born to get the MRI would be fine. But do get the MRI as soon as you can after that so you know where things stand and don't have to keep wondering.",
      "MessageIndex": 7,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843503",
      "Title": "Breast flattening and indented. Anyone?? Ali81"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Aug 11, 2016 08:11PM mkinoly wrote: I had mine removed and it seems the only side effects I have are what normally occur with menopause anyway.",
      "MessageIndex": 3,
      "PostDate": "11/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/846854",
      "Title": "Ovaries: Please respond if you had them removed NoWhyToIt NoWhyToIt"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Mar 13, 2016 04:42AM mkinoly wrote: My scans were clear and then after surgery pathology results found out 1 sentinel node had a macro met of I think 6mm (can't remember exact size right now). Was quite shocking to me after all the imaging and being reassured nodes looked fine.",
      "MessageIndex": 3,
      "PostDate": "13/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/836998",
      "Title": "Positive lymph nodes after MRI and ultrasound showed none? Truffles1968 Artista928"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Aug 8, 2015 12:50AM mkinoly wrote: I've been vegan for maybe 10 years, vegetarian for about 10 years before that, and recently diagnosed with IDC. Some people are surprised vegans get cancer, but there is a whole spectrum of vegans on the junk food vs healthy food scale, just like people that aren't vegan. For me, I had a 32 BMI, ate tons of candy, overate on salty snacks, and didn't do much exercise. Plus, I ate more fruits, vegetables, and whole grains than the average person, but not as much as I should. Do I think being vegan was for nothing since now I have cancer? Definitely not. I was vegan for ethical reasons, not health, though I have reaped many health benefits from it. No high blood pressure, no high cholesterol, no diabetes, no heart disease... in spite of having a widespread family history of such things. But I wasn't taking care of myself and putting my knowledge into action. You better believe I am now! There's no way to truly know if what we do works, as in a direct cause and effect. Your time being vegan may very well have helped your pain (lower inflammation) and kept recurrence at bay, but it may not have. Maybe the bigger question is what do you have to lose? A varied and balanced vegan diet is the healthiest way to eat and it can affect how you feel. There's tons of scientific evidence that antioxidants and phytonutrients do help. Maybe there's a recurrence but it's not as bad as it might have been? Maybe it's not working on cancer but it is working keeping your immune system and organs working well to avoid something else? I believe in the science of nutrition (am majoring in it in college) and that food is medicine. Remember, we have more than just what we eat causing potential problems for us. Genetics, spontaneous mutations, environmental pollutants, bad water, bad air, lack of exercise, lack of sleep, stress.... I think eating a vegan diet for prevention or treatment of disease requires one to be very vigilent and pretty hardcore about making sure all nutrition needs are met, plus adding useful herbal supplements and exercise. There are a lot of resources to learn from, and it can be overwhelming. But ultimately we can choose what make sense to us and do the best we can to stay on track. I'm going hardcore--I won't do chemo or radiation--just having surgery the 17th of this month. I'm not sure regular oncologists are the best people to ask about nutrition. I just dont' think they know that much about it. A naturopathic oncologist would likely recommend a vegan diet and supplements (the one I saw did). Personally, any doctor that recommends animal food, especially to sick people, needs to go back to school so they can learn to give good advice!",
      "MessageIndex": 11,
      "PostDate": "08/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834025",
      "Title": "Plant based, vegetarian or vegan diets for Stage IV dlb823 mkinoly"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Aug 15, 2015 01:44AM mkinoly wrote: Thanks for the info Shetland. I'll have to look into getting those when I have some money. The question about edamame I say yes to. I asked my naturopathic oncologist about soy and he said foods made from whole soy (such as edamame, tofu, tempeh, some soy milks) are ok 2-3 times a week. He said avoid soy foods that are \"concentrated\" with soy isolate protein (such as energy bars, most faux meat products, some soy milks).",
      "MessageIndex": 42,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834025",
      "Title": "Plant based, vegetarian or vegan diets for Stage IV dlb823 mkinoly"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Aug 13, 2015 11:45AM mkinoly wrote: Shetland, I've been thinking about that lately, about freezing in something other than plastic. I'm afraid glass containers will be quite expensive and so bulky. Also, do you have to fill the container to the top to get out the most oxygen? I'd love to hear more about your experience.",
      "MessageIndex": 36,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834025",
      "Title": "Plant based, vegetarian or vegan diets for Stage IV dlb823 mkinoly"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Nov 12, 2015 02:02PM mkinoly wrote: Hi Marijen. My MO wants me to do chemo and radiation for having 1 out of 2 nodes positive. Plus she's having me get some scans done to get a baseline.",
      "MessageIndex": 15,
      "PostDate": "12/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/836282",
      "Title": "ALND for micromet? Cubbie2015 badger"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Aug 8, 2015 11:20AM mkinoly wrote: I'm in the process of finishing up a Kindle ebook on vegan protein, so if anyone has concerns about getting enough or how to get it, I'm happy to share what I know. :)",
      "MessageIndex": 14,
      "PostDate": "08/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834025",
      "Title": "Plant based, vegetarian or vegan diets for Stage IV dlb823 mkinoly"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Jan 16, 2016 07:47PM mkinoly wrote: I've been taking amitriptyline for several years. It was supposed to help with fibromyalgia pain and also help with sleep, but I haven't noticed it doing either thing. I can take up to 50mg but that didn't seem to do anything better than taking 30mg, so I take 30mg about an hour before bed. What I have noticed it helps with is my depression and anxiety. I take sertraline for that and it works fairly well but together with amitriptyline it works even better. Louisap, I also have dysthymia along with major depression and social anxiety, also along with the chronic pain from fibromyalgia and arthritis. These have all been going on for years, and like you, I guess I just had to get breast cancer to make things even harder! Now today part of my mastectomy area has started hurting pretty badly (5 months post-surgery) and it's really ticking me off. I'm glad you're trying the amitriptyline and it seems to be helping your hands. Musical, you mentioned you didn't like the amitriptyline side effects... what were they?",
      "MessageIndex": 12,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/839031",
      "Title": "Is anyone taking Amitriptyline for pain? Louisap Soniatoronto"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Nov 12, 2015 01:37PM mkinoly wrote: I was stage IIA with 1 out of 2 nodes and ALND was not recommended for me. The surgeon and onc met and talked it over and the surgeon decided not to recommend it because he said studies show it does not improve survival rates. The onc did recommend chemo and radiation because of the 1 positive node (though I'm not doing their treatment) . Even if they had recommended ALND, I probably would not have done it. In my mind, it's overkill and the chance of quality of life complications is big. Everyone has to decide for themselves, but I wanted to share that my surgeon seems to following current thought and studies and didn't do ALND.",
      "MessageIndex": 13,
      "PostDate": "12/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/836282",
      "Title": "ALND for micromet? Cubbie2015 badger"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "Sep 5, 2017 07:33PM mkinoly wrote: I had been getting mammos every 2 years since age 40. Every time the results were noted with a disclaimer about how my breasts were dense so they might not see anything. I read that, so I knew my breasts were dense, but I had no idea what that meant! Nobody suggested a different test or a follow-up. My records just showed I had a negative (normal) mammogram. How can they say it's normal while at the same time saying they can't see enough to tell?!?! And why keep sending someone with dense breasts for a test that has no value?!? At age 49 I felt a thick, firm area on my left breast, and I decided to get it checked. Physician's assistant couldn't feel anything and looked at both breasts while I was sitting up. Couldn't see anything (dimpling, etc.). Sent me to a diagnostic mammo \"just in case\" and the tech saw dimpling I hadn't even noticed. Obvious spiculated mass on mammo. Probably there for 8 or more years to get to the size it was. They looked back at my previous mammos and said it had been there but was easy to miss with dense breasts. WTF?! I have zero faith in mammograms and it makes me angry how it's presented to women as some kind of assurance that they don't have cancer, when in fact they just might. Plus sometimes they lead to women being diagnosed with pre-cancerous situations where they go through hell (chemo, surgery, etc) unnecessarily. I really have little faith in just about any scan. Even the MRI I had before mastectomy didn't accurately show what was really going on according to pathology after surgery (there were 2 tumors instead of 1, and yes a lymph node was involved even though they said it wasn't from all the imaging). Now the only thing I really trust is pathology.",
      "MessageIndex": 55,
      "PostDate": "05/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/634136",
      "Title": "Cancer missed by mammogram? joanne_elizabeth HoneyBeaw"
    },
    {
      "AuthorID": "mkinoly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217886/profile",
      "Content": "mkinoly wrote: My surgery is scheduled one month from now on August 17 (would be sooner but my surgeon will be out of the office for 1.5 weeks). I know that I should expect 1 night in the hospital (that seems so short!), but I don't know how long I should expect to feel bad and have enough pain to take meds for. I'm asking because I have a specific situation: My wonderful daughter bought tickets for she and I to go see Cheap Trick in concert on August 28 as a birthday present to me (this was before we knew surgery date, etc). It would mean so much to me (and her, I'm sure) if I were able to go to that concert. It would involve driving 1.5 hours, sitting outside in a chair in likely hot weather for however long the concert is, then driving back. Is that too much to expect 11 days after surgery? Is it even possible? Foolish? Possible with risk? Dx 7/2/2015, IDC, Left, 2cm, Stage IIA, Grade 2, 1/2 nodes, ER+/PR+, HER2- Surgery 8/17/2015 Mastectomy: Left Surgery Prophylactic ovary removal Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/833484",
      "Title": "Unilateral mastectomy recovery time mkinoly Noor46"
    }
  ]
}