{
  "AuthorID": "mlc96",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162813/profile",
  "Posts": [
    {
      "AuthorID": "mlc96",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162813/profile",
      "Content": "Oct 31, 2018 01:37PM mlc96 wrote: I have the bad skin reaction too. This is the third time on Taxol and it happens every time, 2012, 2017 and again this year. My onc switched me to Abraxane, but I'm still having the same skin reaction from day 2 - 5 following infusion. I'm taking Claritin daily, one Benedryl every 6 hours during the day, 2 at night. Plus Aveeno oatmeal bath before bed, hydrocortisone skin lotion, and on 10 mg Prednisone. This is just to manage the symptoms, it won't be better until I'm done with chemo, 6 down and 6 more weeks to go.",
      "MessageIndex": 22,
      "PostDate": "31/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867216",
      "Title": "Anyone have delayed allergic reaction/hives on TC? Need opinions Appyfan Anxious789"
    },
    {
      "AuthorID": "mlc96",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162813/profile",
      "Content": "Mar 7, 2017 12:33PM mlc96 wrote: My eyebrows did not grow back very thick after chemo. I waited a year, then got them tattooed. I should have done it sooner!",
      "MessageIndex": 9,
      "PostDate": "07/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851859",
      "Title": "Eyebrows Goincrzy8 mlc96"
    },
    {
      "AuthorID": "mlc96",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162813/profile",
      "Content": "mlc96 wrote: Has anyone else received this diagnosis? If so, are you getting any treatment for it? Did anything help? I completed radiation to right chest wall in 2013. In the last year and a half I've had right arm swelling, lymphedema, a new lymph node tumor, then 16 weeks of Taxol which shrank the tumor. I still had arm swelling, tightness, loss of strength and motion. Following an MRI of the brachial plexus, the nerve root that controls hand and arm function, and a nerve conduction study, finally got this diagnosis. The doctors are happy that it's not tumor related, however I'm left with loss of use of my right hand and I'm right handed! The neurologist says he hasn't seen this before in his practice and that it will be permanent. So I can't fasten clothing or jewelry, I'm putting on makeup and penciling eyebrows with my left hand, I can't hold a razor to shave my left armpit, I can't open anything that requires 2 hands, not even a zip-lock bag. I'm basically operating with one arm and not the dominant one. The doctors suggest I have Occupational Therapy to learn how to function with one arm, learn to write with left hand, get voice recognition software; yet no one says I might be disabled from work. I'm very frustrated as I've also lost the ability to do crafting hobbies. Dx 4/26/2012, IDC, Right, 6cm+, Stage IIIC, metastasized to bone, Grade 3, 0/8 nodes, ER+/PR+, HER2+ Targeted Therapy 7/10/2012 Herceptin (trastuzumab) Surgery 11/1/2012 Mastectomy: Right; Prophylactic mastectomy: Left; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Radiation Therapy 1/26/2013 Whole-breast: Chest wall Hormonal Therapy 4/30/2016 Femara (letrozole) Dx 12/22/2016, IDC, Right, 6cm+, Stage IV, metastasized to bone, Grade 3, 1/8 nodes, ER+/PR+, HER2+ Targeted Therapy 1/5/2017 Herceptin (trastuzumab) Chemotherapy 1/6/2017 Taxol (paclitaxel) Chemotherapy 11/19/2018 Navelbine (vinorelbine) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865458",
      "Title": "Radiation Induced Brachial Plexopathy mlc96 Moderators"
    },
    {
      "AuthorID": "mlc96",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162813/profile",
      "Content": "Mar 25, 2019 04:27AM mlc96 wrote: For those of you on Kadcyla, are you getting any other meds with it? I've been on Herceptin & Perjeta for 2 years, added Taxol in September after some bone mets progression, then switched to Navelbine in November after allergic reaction to Taxol. I'm having progression again and my onc says I'll be switched to Kadcyla soon. I was just getting used to Navelbine!",
      "MessageIndex": 1324,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    }
  ]
}