{
  "AuthorID": "mlh031712",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198129/profile",
  "Posts": [
    {
      "AuthorID": "mlh031712",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198129/profile",
      "Content": "mlh031712 wrote: So I've had a negative mam and ultrasound and have seen a general surgeon who feels that it is probably not BC. But my concern is that I've in menopause for almost 6 years and I'm on estrogen and progesterone shots. My left breast is dull and achy and the pain is radiating to my armpit and up near my collar bone. I've read a lot about BC not being painful but have also read that people had the same problem and it was painful. My surgeon recommended going in to just remove the entire area if it affected me that much but stated that he didn't want to just jump to surgery. Any thoughts or suggestions???? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820003",
      "Title": "Pain in breast getting worse mlh031712 Infobabe"
    },
    {
      "AuthorID": "mlh031712",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198129/profile",
      "Content": "Mar 22, 2014 07:49PM mlh031712 wrote: I am going to be 36 in 2 weeks. The concern is that I had a hysterectomy about 6 years ago and have been on hormones since. Never had an issue before but this was really odd to me. I'm hoping my Dr calls me back Monday so that I can move forward with things. I'm learning a lot on here! thank you so much!! ",
      "MessageIndex": 5,
      "PostDate": "22/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819402",
      "Title": "Nothing showing on mammogram or ultrasound mlh031712 mlh031712"
    },
    {
      "AuthorID": "mlh031712",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198129/profile",
      "Content": "mlh031712 wrote: I'm new to all of this and very concerned. I had my annual exam a week ago and the obgyn found a lump on my left breast. She said it maybe a cyst but wanted me to get it checked. I had a mammogram and ultrasound yesterday and they found NOTHING! I could feel the lump yesterday morning and I'm very frustrated with this. I left a message for my obgyn to review the tests and call me back because I'm not happy with this and want to know what my next steps are. I've never experienced anything like this. Any suggestions?? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819402",
      "Title": "Nothing showing on mammogram or ultrasound mlh031712 mlh031712"
    },
    {
      "AuthorID": "mlh031712",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198129/profile",
      "Content": "Mar 25, 2014 11:28AM mlh031712 wrote: My obgyn finally called back and they want me to see a general surgeon asap. Luckily I have an apt today. Not sure what to think right now......just very worried!",
      "MessageIndex": 6,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819402",
      "Title": "Nothing showing on mammogram or ultrasound mlh031712 mlh031712"
    }
  ]
}