{
  "AuthorID": "mmonroe",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217034/profile",
  "Posts": [{
    "AuthorID": "mmonroe",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217034/profile",
    "Content": "Jul 1, 2015 01:51PM mmonroe wrote: to JK.... I just got home at noontime today from my MRI Biopsy and it was a breeze. The radiology doctor was very thorough in explaining the entire procedure prior to the biopsy. She was kind and considerate. I too was very nervous. Do not view any videos. Put your mind at ease. Trust me, I am a big baby when it comes to doctors and procedures that I am not familiar with. Ok so they took me in the MRI room, laid me down on my stomach and placed my left breast in a cup holder and positioned me. They asked me is I was comfortable and I said \"no\" so they repositioned the breast and my body again. Don't be afraid to speak up. On the left hand side of the cup, there was a plastic grid (this device helps guide the needle thru the side of the breast) In my case they inserted the needle on the left side of my breast. First they took an MRI of my breast so they could accurately see the location of the spot where they were going to biopsy. Then they gave me a local anesthetic which didn't hurt at all, just a small pinch. Then they inserted the biopsy needle. Did not feel a thing except some pulling and small pressure. The biopsy took less than 60 seconds. YOU MUST LAY VERY VERY STILL during this procedure so as not to move your body. Not bad at all. There was a doctor assistant next to me and she would ask if I was ok so I really felt relaxed and secure. After the procedure, they had me turn around and lay down on my back on a bed that was positioned next to the MRI table. They applied pressure to the needle incision to stop the very little bleeding I had and placed a few surgical bandages. So far no pain. After the procedure, I had a mamogram to make sure the marker they placed inside of me was in the correct spot for future testing and reference. I took a little nap when I got home. If you are the type of person that needs a relaxant of some sort by all means take one but you will need someone to drive you there and back. Everyone is different. But again, please don't worry too much. It truly was not a bad experience. Feel free to ask me any questions. Now I wait for \"good results\" ",
    "MessageIndex": 6,
    "PostDate": "01/07/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/833091",
    "Title": "Terrified about MRI-guided biopsy jk2468 Beatmon"
  }]
}