{
  "AuthorID": "mmowl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
  "Posts": [
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "Dec 17, 2013 05:35PM mmowl wrote: I can understand it seems a waste but I met with the breast surgeon first and she was the one that navigated everything with the biopsy, and everything that followed and she provided a lot of information before the biopsy and was a direct hit with what she suspected it was and what the diagnosis was.  That was three years ago and she and I have had a pretty stable relationship with a total of 4 excisional biopsies.  My last mammo was a call back (we actually laughed about it today - the here we go again - even though this is looking much different than before), she wanted me worked into an office visit this week prior to the biopsy. She wanted to see the films for herself and she wanted to see if she could feel it. It was helpful to talk with her today to keep things real and in perspective since there are some potentially worrisome features in this mass I haven't had before. She herself has had breast cancer and understands the journey. I will worry when she says worry.",
      "MessageIndex": 4,
      "PostDate": "17/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815869",
      "Title": "Fine linear branching calcs, increased in number PaigeH marie5890"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "Nov 8, 2011 04:15PM mmowl wrote: Had my biopsy yesterday. Wasn't as bad as I anticipated.  It's definitely not an intramammary lymph node and the Radiologist said she thinks what the BS felt is what's showing up on the mammo. She did also find what she called a \"microcluster of cysts\" attached/around the mass. The Radiologist is a specialist in breast imaging, and was awesome. I cannot echo all the wise ladies on this board to say loud enough - a good provider is absolute! Someone you are comfortable with, gives you confidence in providing the pieces you need to make a good decision, and treats you like a person not a number. Hopefully results will be in soon........",
      "MessageIndex": 5,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/776329",
      "Title": "Sigh - Here we go again........... mmowl mmowl"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "Nov 1, 2011 05:26PM mmowl wrote: Had my appointment with the BS today..................I had just about convinced myself it was no big deal and I was over-worrying by the time I got there. After she looked at the reports she said she wasn't overly concerned, there is a dermatitis-something-something (I couldn't repeat the diagnosis if I had to right now) that is probable since I have psoriasis and she'd probably just biopsy it to confirm that and keep an eye on it. Then she did the exam......... On the right side she got that \"oh-no-Doctor-face\", the same one my PA gets when does an exam in the same area, and called it a \"thickening\" but couldn't locate any specific mass or boundaries and said she wasn't comfortable with that area. On the left side she couldn't find the intramammary lymph node but did locate a palpable \"mass\" of concern, there is nothing on either mammo or the u/s that corresponds to this area, and she was able to return to it several times without difficulty. So, looks like Monday will be a busy day. That morning I get the endomitrial biopsy results from my GYN, then \"at least\" 2 u/s guided core biopsies. She is also getting the radiologist - a female that only works in/with breast imaging - to do a \"second\" opinion u/s and scan my breasts for any other \"surprises\". I am a little test-tired and my worry-meter did go back up a few steps, but also have a strange weary peace about the whole thing..........here's to a little more waiting.",
      "MessageIndex": 4,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/776329",
      "Title": "Sigh - Here we go again........... mmowl mmowl"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "Oct 27, 2011 05:16PM mmowl wrote: I finally got to see the official radiology report and have an appointment on Tuesday to discuss it w/my trusted general surgeon.....1.86 cm x 1.1 cm nodular appearing density of relatively decreased echogenicity and increased vascularity........now I am not only waiting to resolve this and move on but also waiting for the results from an endomitrial biopsy yesterday - I really need to have a solid plan of action and move forward, this multiple biopsy stress is getting to me.",
      "MessageIndex": 1,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/776329",
      "Title": "Sigh - Here we go again........... mmowl mmowl"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "mmowl wrote: Awhile back I had 3 excisional biopsies - surprise was only 2 \"things\" showed up on the mammo in the first place and the \"extra area\" ended up being ADH with the seen Fibroidenomas (2), due to complicating co-morbid medical conditions the plan was careful watching. And I had just gotten used to \"normal\" being the end result...... Routine yearly mammo turned into diagnostic mammo turned into ultrasound turned into surgical consult. \"it\" is 10mm x 17mm and \"probably a intramammary lymph node\" and \"most likely benign\" -- the radiologist recommended repeat mammo in 6mo, my PA said *&^%$ no! Gotta love a great PA.  Anyway, the wait begins again. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/776329",
      "Title": "Sigh - Here we go again........... mmowl mmowl"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "mmowl wrote: You all were such a wealth of information before, figured my smartest move was to tap into that knowledge.  I had a dx of ADH almost 2 years ago - due to my neurological condition elected out of Tamoxifen and have just done \"close watching\", even though I have a slight family history (maternal grandmother).  Have been feeling poorly for awhile and finally got an ultrasound done - enlarged uterus, evidence of multiple fibroids, and left ovarian cyst.   Waiting on GYN appt next week and will opt for a hysterectomy (I'm 42 and way done w/kids) but concerned about the links between BC and the ovaries. Anyone have this sitation or any welcome info/insight? Thanks, Emily Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/738787",
      "Title": "Wondering about any connection ADH/Fibroids/Ovarian Cyst mmowl holly123"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "Dec 14, 2006 12:02PM mmowl wrote: I was sent to a surgeon for my biopsy - and I also got a 2nd opinion, even though the bottom lines were similar, I liked one of the surgeon's MUCH better than the other - driving a little bit further but it's going to be worth it.",
      "MessageIndex": 7,
      "PostDate": "14/12/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/480655",
      "Title": "2nd opinion hawaii89 crunches1"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "Dec 18, 2013 02:48AM mmowl wrote: Thanks guys! My breast surgeon is awesome and requested they work me into her schedule before the biopsy - she wanted to see the films for herself and if she could feel it. She couldn't, and the u/s had 3 areas in them, although 2 are pretty close together she is going to f/u with the Radiologist and confirm the areas of concern. She also is a breast cancer survivor and understands the journey. I feel better knowing she's involved (this was a 6 month screening mammo and hadn't had the follow-up appointment with her yet when all this happened) and put things back in perspective.  So we play the waiting game -- again  :-)   We actually laughed at the \"here we go again\" thoughts, and I know there won't be the weeks of waiting I've seen some have to endure (which is awful) she schedules a follow-up a week after the biopsy at the time the biopsy is scheduled so you are \"on the books\", but if anything concerning she will call as soon as the results come in. Makes the process manageable when you have a trusted provider.",
      "MessageIndex": 3,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815673",
      "Title": "Biopsy Pending - Got Mammo and u/s report today BiRads 4 mmowl mmowl"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "Dec 20, 2013 01:28AM mmowl wrote: Ziggy and Marie you are both so right.  I read some of the posts and cringe at what some others go through on these journey's. Biopsies are done - manageable - but the Radiologist was great and upfront - he showed me everything before he started. There were three areas noted on the original films, he had them relook and said he didn't think it needed testing and was secure that it was a normal duct. Of the remaining two, one is \"concerning\" and even the way he did the biopsy one that area was different from the other. He said conservatively the results will be back by Monday, but will start looking for them tomorrow afternoon. One step closer to the answers.........",
      "MessageIndex": 6,
      "PostDate": "20/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815673",
      "Title": "Biopsy Pending - Got Mammo and u/s report today BiRads 4 mmowl mmowl"
    },
    {
      "AuthorID": "mmowl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41043/profile",
      "Content": "mmowl wrote: Short history - 5 biopsies over 3 years, 3 fibroadenoma, 1 ADH -- mom diagnosed with IDC  and DCIS Called back on screening mammo, did diagnostic and u/s Two areas of left breast (2 quadrants) 1) focal asymmetry which persists on compression view, solid, 1.7 x 1/1 x 0.8 (lower inner quadrant) 2) focal asymmetry, elongated hypoechoic mass with possible intraductal extension (upper outer quadrant) I'm not looking forward to Thursday............. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815673",
      "Title": "Biopsy Pending - Got Mammo and u/s report today BiRads 4 mmowl mmowl"
    }
  ]
}