{
  "AuthorID": "mmtdrsn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200568/profile",
  "Posts": [
    {
      "AuthorID": "mmtdrsn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200568/profile",
      "Content": "mmtdrsn wrote: Hello Everybody, I am sorry for starting a new topic as I am sure someone else had done that before but I just dont have much of time; My sister (36 years old, single) was diagnosed 4 months ago with IDC Breast Cancer and all the doctor she visited so far have said \"chemotherapy\" to start with asap. ( I dont have much info about the level of her disease, the type of chemotherapy that doctors indicated etc and she doesnt want to give me much information either). But the problem is she doesnt want to go through any surgery/chemotherapy becase she thinks that it will never work anyway, she will just have to stand all those pain and what chemo requires and then die. Furthermore, she met many with IDC cancer who went through chemo and it didn't work and they now feel worse and the disease has spreaded all over their bodies... I know, you never know and everybody's situations are different but she just doesn't want.. And she thinks doctors just want money and directly suggest chemo.. My questions are that is that really true that chemo only delays the death and not much work on IDC? Are all those Chemo types requires you to be desperate, bald and so on? How big the chance of getting rid of the IDC after chemo? And lastly, how can one live with IDC without receiving any threatment? I will try to get her to another hospital hoping they can offer any other treatment than chemo.. I thank you so so much in advance and hope everybody a good health. Mehmet Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821181",
      "Title": "Breast Cancer mmtdrsn juneping"
    },
    {
      "AuthorID": "mmtdrsn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200568/profile",
      "Content": "May 19, 2014 08:34AM mmtdrsn wrote: Thank you a million for your posts. I would LOVE to visit BCO with her but we are currently located in Istanbul, Turkey. Well, she did her research and docs didnt speak to her promising about the situation of her IDC.. I will stop nagging at her for the time being since this only makes her huff and puff and feel worse.. She thinks she will recover though.. The only thing I could do is that either finding a doc who is really willing to help her or find someone here who has been going / has gone through her type of IDC and make her talk to that person. And as docs didnt speak promising to her about the future (cos of the situation of the tumor i reckon), they just seemed to her offering a chemo straightforward and then let's see what happens attitude..she doesnt want to depend on chemo either even tho she gets rid of the tumor for some time.. anyways.. Thank you all again and I will keep you updated if the situation gets any better.. wishing you all a rapid recovery.. Mehmet",
      "MessageIndex": 3,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821181",
      "Title": "Breast Cancer mmtdrsn juneping"
    }
  ]
}