{
  "AuthorID": "MMunday",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87385/profile",
  "Posts": [{
    "AuthorID": "MMunday",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87385/profile",
    "Content": "Sep 21, 2009 05:34PM - edited Sep 21, 2009 05:36PM by MMunday Welcome to the Flip Side....that's how I feel a lot of days, especially the week following treatment. My name is Michele and I am 36....I was diagnosed beginning of June with IDC stage 2b  with two out of eight lymph nodes involved. I had a right mastectomy and full lymph node dissection. I am on dose dense AC (4) with Taxol once a week for 12 weeks either with Herceptin or I am trying to get into the ALTTO trial which also includes Laptinib. I had my second cycle this past Monday and am starting to feel good again this week only to return next Monday :P . I call my treatment week kinda my wash week and the second week gets better and better. With the first treatment I had major brain fog...was sooo strange.. really hard to explain as well as fatigue 48 hours after....Wends day is usually my worst. I took Claritin for the Neulesta but it just dried me up too much. Went without this last one and yes was achy but tolerable....no fog this time but nausea for two days :P and lots of fatigue. I also have a 12 year old football playing son and remembered sun screen for the game except my lip which is badly scorched...LOL...which does not help the already food challenged! Hair has been gone since late last week...it coming out was making me more nauseated so hubby buzzed it :). This is the craziest trip I'v ever been on and I am so not one to want to rush life by....especially now....you should want to savor every moment ....but if I could fast forward through this with all the wonderful people I have met and truly remember how wonderful life was before this diagnosis I would in heart beat!  Blessings to you all! Love, Michele",
    "MessageIndex": 315,
    "PostDate": "21/09/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738978",
    "Title": "Starting chemo September 2009 krcll sanaisa"
  }]
}