{
  "AuthorID": "Mncteach",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
  "Posts": [
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 20, 2019 02:20PM Mncteach wrote: Each of us has to make the decision that feels right for us. I had all options on the table but after the mri and finding (yet) another area of concern on the non cancerous side, I opted for having both removed. Like laughinggull I have dense breast tissue and needed the peace of mind of not having to be called back after every mammogram. My surgeon fully supported it and understood my concern the entire time. Also, since I wanted to do a Diep reconstruction and not implants, It made sense to do both since Diep is a one and done chance (or at least that’s how I understood the PS). If you are comfortable not having the second breast removed, stay the way you are. If not, find surgeons who do understand and have it taken off. You are the one who has to be comfortable with your decision.",
      "MessageIndex": 11,
      "PostDate": "20/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869388",
      "Title": "Should I have gone for preventive 2nd breast mastectomy Vgmggroup claireinaz"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Feb 8, 2019 03:59PM Mncteach wrote: You are absolutely correct! The waiting is the hard part! I have had issues with mammograms and my cancer is triple negative so I went with mastectomy. However, my surgeon said she would support lumpectomy as well. It is a very personal decision and I am glad I went with this although I know several women who went with lumpectomy and are healthy and happy as well. Survival rates and recurrence are the same based on the other treatments you will receive.",
      "MessageIndex": 6,
      "PostDate": "08/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869749",
      "Title": "Just diagnosed Buzzandmax Mncteach"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 16, 2019 12:31AM Mncteach wrote: We are all kinda crazy here! Welcome to the gang",
      "MessageIndex": 10,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869361",
      "Title": "Feeling Frustrated! Mom2Sarah Spookiesmom"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 15, 2019 10:47PM Mncteach wrote: I too am a planner and the waiting was the WORST! I had no family history and am under 50 so I also had to wait until genetic testing was done to make my final decision. Most of my doctors had a suspicion I would need chemo (in part because of my age) but they could not make a plan until all my tests were back. I also had a BMX and as far as reconstruction, I will be happy to share with you how mine looked, but remember every person is different and it will also depend on what kind of reconstruction you have. There will be time while you are healing to get the second opinion if you need or want it. ",
      "MessageIndex": 5,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869361",
      "Title": "Feeling Frustrated! Mom2Sarah Spookiesmom"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 15, 2019 11:02PM Mncteach wrote: I won’t tell your husband if you don tell mine 😂 If any of my genetic tests had been abnormal I would have opted for a hysterectomy too! Hang in there! We can help and you have this!!",
      "MessageIndex": 8,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869361",
      "Title": "Feeling Frustrated! Mom2Sarah Spookiesmom"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mncteach wrote: Hi there! I am just about to finish up 4 rounds of AC and will be starting 4 biweekly Taxol. Looking for others who are in the same boat or had same treatment Dx 8/31/2018, IDC, Right, 1cm, Stage IB, Grade 3, 0/4 nodes, ER-/PR-, HER2- Surgery 11/5/2018 Lymph node removal: Sentinel; Mastectomy: Right; Prophylactic mastectomy: Left; Reconstruction (left): DIEP flap; Reconstruction (right): DIEP flap Chemotherapy 1/30/2019 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870270",
      "Title": "Bi weekly AC followed by biweekly Taxol Mncteach Kkmay"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "May 20, 2019 10:33AM Mncteach wrote: TWills— i know where Clearwater is and it’s not too far when I’m down there( DH grew up there and we now own the family home)! Only problem is I’m only a week pfc so no hair to cut Thank you all for sharing your pics as the growing back in part is stressing me... what’s it going to look like, will I like it, how quickly will it grow!",
      "MessageIndex": 26681,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Dec 23, 2018 08:04PM Mncteach wrote: I am so glad I found this thread! I am relatively newly diagnosed. Here’s my story: I’m a teacher with no children (by choice) and a very loving older hubby. We have been married 20 years as of this past October. I was diagnosed on August 31 at the age of 44. I have had call backs for every mammogram I had (started at 40) and had a negative biopsy on my left breast last year. When I was called back in for further testing and biopsy, my husband was out of town for work but I wasn’t too concerned. He was headed back when I got the call and fell apart. Luckily my mom lives close by and my best friend also came over and kept me calm til he got home. Two tumors, one 10mm and the other 18. Initially the test had me weakly PR positive, however after surgery and sending out tumor for Oncotype, they couldn’t Oncotype due to Negative hormones, so basically triple negative. Underwent genetic testing and other than finding that colon cancer and precancerous polyps were running rampant on my dad’s side of the family, no genetic defects at this time. Decided to go the double mastectomy route since I already had scares on left side as well and since my tumors were high grade I will be starting chemo the end of January. And lucky me, I have chemo scheduled for Valentines Day! I am going to try to work through chemo as I used up all my paid sick time for the double mastectomy recovery, but will see how I react. Thanks for listening, I have so many things to vent about other posts I have read on this thread but this is long enough!",
      "MessageIndex": 15680,
      "PostDate": "23/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Dec 30, 2018 10:54AM Mncteach wrote: Borogirl, I started seeing a therapist even before my surgery since I was overwhelmed with what was going on. That being said, the fact that you went through all of this to avoid cancer is stressful in and of itself. Be kind to yourself and honor your feelings!",
      "MessageIndex": 349,
      "PostDate": "30/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Dec 23, 2018 08:28PM Mncteach wrote: I had surgery on November 6th. Wish I found you guys earlier. Double Mastectomy with immediate reconstruction Revision surgery on 12/7 to remove necrotic tissue and minor revision",
      "MessageIndex": 345,
      "PostDate": "23/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 8, 2019 01:27PM Mncteach wrote: I am glad you have decided to go with second opinion. At first I wasn’t but because of where I was there are no PS, so if I wanted reconstruction I had to go to another hospital. I am so glad I did. It all felt wonderful for me. As for the drains, I hear you! I had to have revision surgery due to necrotic skin and PS did say drains would be possible but unlikely. Yet, low and behold I woke up with drains anyway. At least I was prepared there might be a possibility. I do not have ER positive BC so I cannot speak to that well, but can say that chemo has been on the table the whole time because of the ER/PR status but was told if lymph nodes were involved then I would have to have radiation. So try not to stress too much about lymph nodes. Keep posting, researching, and being your best advocate. We’re here for you! The waiting is horrible!!! ",
      "MessageIndex": 37,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 9, 2019 01:50PM Mncteach wrote: Have you made your second opinion appointments? I would find out results and see what next steps the doctor wants to take so you can hear that viewpoint vs what you hear at the second opinion. Ask why they doctor thinks this is the best option?",
      "MessageIndex": 42,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 10, 2019 01:46PM Mncteach wrote: Hope your appointment went well! I hope that your team gets a treatment plan quickly for you.",
      "MessageIndex": 51,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 10, 2019 05:13PM Mncteach wrote: So glad you are getting the second opinion. Do you have a breast health navigator? They should be able to speed things up and help during this difficult time.",
      "MessageIndex": 54,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 12, 2019 06:57AM Mncteach wrote: Such great news! Having confidence in your team and a plan makes the worry so much easier to handle!",
      "MessageIndex": 66,
      "PostDate": "12/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 8, 2019 12:33AM - edited Jan 8, 2019 12:34AM by Mncteach 44",
      "MessageIndex": 945,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 4, 2019 09:01PM Mncteach wrote: There definitely is an age component. I’m under 50 and was told almost from the beginning thatbecause of age and grade I would definitely have chemo.",
      "MessageIndex": 15747,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 7, 2019 07:51PM - edited Jan 7, 2019 07:52PM by Mncteach January, check out the AC Treatment board. It has tons of useful info on AC chemo, Side effects, and ways to deal with them. Edited to post correct group name",
      "MessageIndex": 1,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869211",
      "Title": "AC-T Chemo JanuaryJones1 Mncteach"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 10, 2019 09:01AM Mncteach wrote: Yes the medical oncologist and radiation oncologists are the ones who make the plan. Make sure you have a copy of the pathology report though so you can use it in the future. Eventually you are going to have to know your pathology as it will dictate the next steps. I am just one of those people who wants to have all the information so I can research it before meeting with doctors so I understand more of what they are saying and can ask knowledgeable questions. I wish you the best with today's appointment.",
      "MessageIndex": 46,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 23, 2019 03:14PM Mncteach wrote: Glad to hear you clicked with the doctor and the setting. It is amazing what a difference it can make!",
      "MessageIndex": 84,
      "PostDate": "23/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 8, 2019 05:18PM Mncteach wrote: I know it’s frustrating! Unfortunately this is not a quick evolution. I was 2.5 months post diagnosis when I finally had my surgery, after many tests, a scare and an additional biopsy. I will be exactly 5 months post dx when I finally start chemo. Then there is the time for the treatment. Someone once said that a cancer dx will take a year of your life. If you count worry, I’m sure it’s much longer than that! ",
      "MessageIndex": 39,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Feb 1, 2019 08:05AM Mncteach wrote: I am on that same treatment. I had my first dose yesterday and yes, I seem to feel the same way. I am trying to work (as a teacher of young elementary school kids) but already know I am not going to make the whole day today. My mom is in the same boat, trying to be supportive and scared for me (I am 44).",
      "MessageIndex": 3,
      "PostDate": "01/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869211",
      "Title": "AC-T Chemo JanuaryJones1 Mncteach"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 4, 2019 10:11AM Mncteach wrote: It feels real for different people at different times. For some, it's getting the port, some its the diagnosis, some it's losing or altering hairstyle. I still don't want to believe it at times but then the SE hit me and I can't ignore it! I wish you well on this journey none of us want to be on.",
      "MessageIndex": 44,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 15, 2019 07:48AM Mncteach wrote: LizzieAG— that’s what they did with me too with the port, makes it easier except the sleeping part :) Hope today goes well! Betterdazeahead- you must be on a slightly lower dose of AC than me or a slightly quicker drip rate!My A takes 20-25 minutes and given by the nurse from a syringe but my C is a full hour drip. I am at the cancer center no less than 6 hours every time and that includes blood work, meeting with doc to discuss bloodwork , premeds, and chemo. Makes for a very long day. Kudos to you for taking a walk afterwards, I just nap usually but that’s probably the Ativan. My echo also had some notes about having issues reading due to breast implants ( which I guess fat from my tummy would be an implant but not what I think of when I think implants). Hopefully that is all it is with you too!",
      "MessageIndex": 148,
      "PostDate": "15/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 23, 2019 10:29PM Mncteach wrote: Hi knmtwins! I start my Taxol portion on Thursday but it will be Taxol by itself and every 2 weeks. When the doc told me about the steroids the night before and morning of along with more there and benedryl... I was like, woah....Will I even be able to function? I guess I’ll find out. Everyone keeps saying it’s the easier of my two cocktails... just finished 4 rounds of AC, also know as Red devil! And it was a devil for me. Guess we’ll find out together! Unbreakable— here’s wishing that you continue with minimal SE! My third round was the worst. The second and fourth were the easiest for me and the first was learning about how to handle my SE.",
      "MessageIndex": 233,
      "PostDate": "23/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 25, 2019 06:43PM Mncteach wrote: Jag- what a supportive husband. Each chemo is different and each round is different. Definitely share with the doc how your wife feels and she may be able to adjust meds to help. Ufcknights— don’t worry about hair yet! It was after my second treatment that I started noticing it going. Poky— I’m sorry you are so drained and have had to get fluids. Hope they are able to get nausea and vomiting under control for next treatment",
      "MessageIndex": 259,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Apr 4, 2019 09:49AM Mncteach wrote: Welcome Adhoney. So sorry you have to join us, but you have found a good resource for advice and information. Please ask us questions if we can help!",
      "MessageIndex": 334,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 24, 2019 11:01AM Mncteach wrote: KitKat— I know it’s hard, but try to to focus on the here and now..... my MO said she does the AC first because it is tougher, but just know you are tough and maybe you won’t have most of the side effects because you’ll already have a plan for the SE! ",
      "MessageIndex": 109,
      "PostDate": "24/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 26, 2019 03:14PM Mncteach wrote: Round 3 hit me the hardest too! There were times it hurt just to move. I was much better after round 4 and start Taxol Thursday",
      "MessageIndex": 112,
      "PostDate": "26/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 15, 2019 11:46AM Mncteach wrote: Betterdazeahead— I would definitely question the blood draw from your arm. Sounds like you have a different setup from my cancer center since I go right into the same chemo room I stay in for the day. Then they acess my port after about a zillion well being questions, most of which I can answer in advance but a nice safety and well being check up! Then they do blood draw and after results are in doc or nurse practitioner comes in. 5 hours is what they told me it would be but it has always been longer even with no complications. If your infusion rate for c is faster that definitely could be the cause of some issues. Mine is 1:1, I forget the ccs of the bag but something like 345. I may be getting more premeds so that could affect times too. They did not send me to cardiologist but since you do have a history they may be being overly cautious. I am going to ask after my post chemo echo if it is changed and anything to worry about. Poky- glad to hear you are doing well and be careful with that head banging. The 13yo reaction is as expected as is the dogs! It is comforting to be in your own bed and read everyone’s stories. Hope everything keeps going well! Also, I echo that the next visit is for a wbc booster. I get the Neulasta onpro because my insurance covers it but many still do not. Dawmar- I'm surprised the Ativan drip helped but glad it did, it will probably be added to your premed stuff now. Hope everyone is doing well. I am doing slightly better today than usual but didn’t have to work normal schedule as it is an inservice day and I could do most of it from home. Only had to go in for about an hour.",
      "MessageIndex": 153,
      "PostDate": "15/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 24, 2019 11:51AM Mncteach wrote: Lizzie, make sure your MO knows about nausea and appetite. I had that problem my first AC. They added dex - a steroid- and it helped with nausea and appetite. In fact I’ve gained a few pounds from my starting weight after losing over 5 pounds the first go round! I do not have the problem of being too thin so I’m kinda sad about not keeping it off, but it’s much better than the horrible nausea! Welcome Kvz— I am not on the same chemo as you and have had only mild irritation, but I did look up a site on here about TC chemo and mouth sores. It was a list of things to prep. I actually bought a whole case of the 8oz water bottles so I could mix up a baking soda rinse and take it with me if needed. I haven’t needed it, but if I feel any tingles I brush and use my waterpik (a prep for chemo buy) and that seems to help",
      "MessageIndex": 238,
      "PostDate": "24/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Apr 3, 2019 05:57PM Mncteach wrote: I wear my mask in public places because who knows what is lurking out there. Yes, I do get looks, but of course with my bald head I’m pretty sure they know what’s going on. I have fun masks because I work with kids and wanted something fun around them and it’s usually the kids who stare the most and I’m ok with that. I am more lax about wearing my mask at school unless I know one of my germ factories (aka kids) is not well. At home and around friends I don’t wear it and my friends are really good about not visiting if feeling ill. I have one woman in my support group that does the mask and gloves.",
      "MessageIndex": 330,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Apr 18, 2019 03:32PM Mncteach wrote: no, taxol was better, have more things to eat, just don’t have a big appetite!",
      "MessageIndex": 370,
      "PostDate": "18/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Feb 27, 2019 10:30AM Mncteach wrote: The port placement was traumatic for me too. They had to stick me 5 times before an IV was actually working. I got mine the day before chemo but they left it accessed so I didn't need another needle stick for the port. I think it actually bothers me more now than when I first got it. ",
      "MessageIndex": 19,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 1, 2019 04:50AM Mncteach wrote: As for chemo bags— I found I didn’t need blanket, they have nice warm ones available at my cancer center. I did take a stuffed animal( forgot it 1st one and cried) just for moral support if you like those things. I always have more stuff packed in my bag than I need or use but the one thing I apparently took out and never put back in was fuzzy gripper socks. I have found I like to take my shoes off and so much easier and warmer to have the socks than have to put shoes back on every trip to the bathroom. As for timing, I was told 4-6 hours total and yesterday was my first no complication chemo and I was there 5.5 hours for my AC treatment. The taxol will be longer because it takes 3 hours to infuse vs 1.5 for AC. Good luck to everyone starting this week",
      "MessageIndex": 32,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 6, 2019 05:45AM Mncteach wrote: Hi all, I am going to try to answer as many questions as I can but chemo brain has set in big time. I pee constantly while I am getting chemo. I just unplug the IV pole and roll it into the bathroom with me! Only been tangled up in it once! As for my period. I had an odd day of spotting after my first treatment and then a full on period about a week after my second. Nothing so far with third. As for nail changes, Taxotere is definitely harsher on nails based on my cancer support group. I have had only some discoloring due to low rbc and they are very brittle. Wishing everyone very little SE",
      "MessageIndex": 66,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 7, 2019 09:30AM Mncteach wrote: Santabarbarian- thanks for the melatonin tip, I looked into it a little bit more and it looks like it is more beneficial for those who are estrogen positive but I am going to ask my MO as well.",
      "MessageIndex": 77,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 9, 2019 06:06AM Mncteach wrote: Pokyspider— I was wondering what they had put on your head! Thanks for sharing, hopefully an “easy” recovery before starting chemo! Dawmar- so sorry you had to go through that! I was “lucky” and had mine before the port went in. I was still tender in places from surgery but nothing like what you experienced!",
      "MessageIndex": 99,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 14, 2019 12:44PM Mncteach wrote: Welxome Lis— you have the same chemo regimen I am doing! I am currently receiving my last AC treatment as I’m typing this. Feel free to ask any questions. Good luck on the haircut. ",
      "MessageIndex": 142,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 31, 2019 07:06PM Mncteach wrote: I have learned not to question the why. I too was healthy, no family history, and bam! I use all my effort to fight this beast and win",
      "MessageIndex": 318,
      "PostDate": "31/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Apr 5, 2019 03:23PM Mncteach wrote: I agree— Cancer Sucks!!! Sorry you are missing out.... I did fine with Neulasta but apparently the easy Taxol memo didn’t get to my body... hopefully it gets easier... I keep telling myself I am so close to seeing the finish line of chemo, but it’s hard",
      "MessageIndex": 339,
      "PostDate": "05/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Feb 26, 2019 06:22AM Mncteach wrote: Hi gang, I am in the January group and started the February group. I go for 3rd treatment on Thursday. Check out other months groups for great ideas and tips!",
      "MessageIndex": 17,
      "PostDate": "26/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Feb 27, 2019 06:52PM - edited Feb 27, 2019 06:53PM by Mncteach I went short before surgery and then shaved before clumps fell out (just before 2nd treatment). I haven't had really long hair in a while so it wasn't a huge shift for the first cut and was much easier to care for during surgery and recovery. I surprised myself by handling the shave without any immediate tears. There have been tears since but I know it was easier for me than having clumps fall out. I even had tears when the little hairs started falling out. ",
      "MessageIndex": 24,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 9, 2019 06:16AM Mncteach wrote: Good luck and I am so jealous you get to escape to Florida! Didn’t get there at all this winter and I miss it! Kept thinking I would feel ok to travel but then the time got close and Nope!",
      "MessageIndex": 103,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 17, 2019 02:50PM Mncteach wrote: Chickywicky— so sorry that you have all these delays, the waiting is really the worst, once you are doing something, it makes it easier. That being said chemo is tough and don’t let anyone tell you it’s not! Lizzie AG-glad your first treatment went well. I battled a ton of nausea my first round but it definitely was the best, even with that! Just finished my fourth and final AC and hanging in there. Really trying to push myself to do a bit more than usual and see if that helps",
      "MessageIndex": 158,
      "PostDate": "17/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 18, 2019 07:04AM Mncteach wrote: I did the first round, but then balanced it with senna. I start with one the morning of chemo and then I take 2 at night and 1 in the morning for 5 days, it has kept me going!",
      "MessageIndex": 169,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 26, 2019 04:12PM Mncteach wrote: Sparklegirl— I know exactly how you feel, I was going to be perky, have no SE, and still do everything I wanted to while getting chemo! Ok so most of those things did not happen and I am finding peace in taking help when I need it. Poky— Congrats!!",
      "MessageIndex": 265,
      "PostDate": "26/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Apr 11, 2019 04:37PM Mncteach wrote: UFCknights— hope your mom is better. It’s scary. I just finished Taxol #2, no steroid SE and slept through most of the infusion. They added an extra premed anti nausea med so hopefully none of that either",
      "MessageIndex": 353,
      "PostDate": "11/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 4, 2019 06:59PM Mncteach wrote: They tried to run an oncotype but that’s when the tumor decided it really was triple negative, had been slightly PR positive in earlier test. I was basically told I was in chemo group from the start just weren’t sure if it would be big guns (of course it was). Wishing everyone minimal SE and lots ofrest!",
      "MessageIndex": 53,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 27, 2019 05:32AM Mncteach wrote: Farfalla6- yes it is possible to have anticipatory nausea. Google is good, but limit it. Make sure you have a good contact at your center so if the anti nausea stuff isn’t working they can help. I was very nauseous my first round, never did get sick, and they ended up adding a steroid to my anti nausea meds. It helped tremendously! Also, share how nervous you are, they can help. Chickywicky- glad it went well! I’m worried about sensitivity when I start Taxol tomorrow as I have chronic hives(although I haven’t had a flare up in a couple years now). Lizzie- welcome back to land of the living! Glad you are feeling better and hope you stay on top of the nausea this round! Knmtwins- funny you mention uncarbonated things. I have been living on chocolate milk and soda for my liquids and the doc wasn’t concerned as long as I was drinking. I actually want to try seltzer since it seems like the carbonation is what is helping settle my stomach, if my soda goes flat, I dump it and start a new one",
      "MessageIndex": 277,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 28, 2019 06:43AM Mncteach wrote: Kamboka- How awesome that you have access to the integrative health center! I am offered reiki but tried to find someone to do acupuncture but there is no one really close ( not too far but just far enough to not feel like the drive in my current condition). I have heard about the IV vitamin c but not the mistletoe. Dawmar— I have been having back pain, but like solobroker I thought it was just because of my weight and lack of usual activity. Maybe there’s something more",
      "MessageIndex": 290,
      "PostDate": "28/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Apr 12, 2019 03:53PM Mncteach wrote: Margun— I had a cough all through AC. Always a dry cough with no fever. Second round of Taxol is better... red sunburned look today but not as bad as last time. They did give me an extra long lasting anti nausea med in my premed and just took my first zofran tonight (yesterday was chemo day and usually need Zofran that night). I think I have more energy this time, but still wiped out easily. Falls church- sorry about the yucky SE. I have had chronic hives so I feel your pain! Hope everyone has a wonderful, SE free weekend",
      "MessageIndex": 363,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Apr 18, 2019 04:33AM Mncteach wrote: I’m glad you can get water down, I haven’t since about day 3.... I have tried about every kind of water out there! As for tastes, they change all the time. I was doing potatoes, either mashed, French fries, or shredded and that worked well for a while. Sweet stuff was good but even that I have to be careful of the combo. I am now doing some meat again, that changed when I started taxol. Good luck finding something yummy",
      "MessageIndex": 367,
      "PostDate": "18/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "May 8, 2019 05:23AM Mncteach wrote: I’m sorry pokyspider— I’m a little worried that my final one will have to be postponed too since I had slightly elevated liver enzymes last time... glad everything was okay. Cancer sucks but this too shall pass",
      "MessageIndex": 408,
      "PostDate": "08/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Jan 31, 2019 10:52AM Mncteach wrote: Well almost done with first treatment. Started with tears as they were hooking me up to saline but got better from there. They all were very caring and compassionate and my mom and DH were here with me. I am getting the Neulasta onpro so DH has added Claritin to the shopping list. I also am anemic already so adding another vitamin. Flintstone chewable with iron were recommended since they are easier on tummy than the straight iron ones and have added vitamins to help! Now to wait and see what SEI might have.",
      "MessageIndex": 95,
      "PostDate": "31/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Feb 4, 2019 03:16PM Mncteach wrote: RadagastRabbit—- thank you, thank you, thank you! You have hit the nail on the head as to how I feel and I was just rereading all these posts to see if I was “normal” I am trying to stay positive but really felt like crawling up in a hole the past few days. I dread it getting worse, but know I will get through to the other side thanks to wonderful people like I have found here",
      "MessageIndex": 98,
      "PostDate": "04/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Feb 25, 2019 03:00PM Mncteach wrote: My friend said my losing my hair was God’s way of saying it worked. However I am receiving it post surgery so there is no real way for me to know if it worked. My tumor is out already so basically if I stay cancer free it worked",
      "MessageIndex": 106,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Mar 28, 2019 04:24PM Mncteach wrote: UCFknights— it is tough to be calm when a loved one is sick. And just remember everyone reacts differently to chemo. Sending hugs,",
      "MessageIndex": 118,
      "PostDate": "28/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    },
    {
      "AuthorID": "Mncteach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283687/profile",
      "Content": "Feb 4, 2019 04:38PM Mncteach wrote: radagastrabbit— I had my first AC last Thursday.... keep trying to go forward but keep getting pushed back by my body.... so tough for someone who usually is constantly on the go...",
      "MessageIndex": 100,
      "PostDate": "04/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867853",
      "Title": "AC treatment yellowb brittandherboobs"
    }
  ]
}