{
  "AuthorID": "mnleck",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117267/profile",
  "Posts": [
    {
      "AuthorID": "mnleck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117267/profile",
      "Content": "May 4, 2011 08:58AM mnleck wrote: Radiation is such a different experience for everyone, but I'll share something that has helped me out tremondously. A friend emailed me that when her mother went through it she used an aloe gel in the dressing room right after each treatment. I ordered it from drugstore.com - the product is Fruit of the Earth 100% Aloe gel. I also use some of the lotions, but I apply it (sometimes actually mix the gel and lotion in my hand) 3 or 4 times a day - and go bare while it dries a little. I am fortunate and don't have to work - or that would be a problem :)  I only have 3 out of 28 treatments left. I do some other things during radiation to make things tolerable for me. I suck on a piece of licorice and count (I figured how many counts are in the whole process - I get to about 200) then I know exactly how much longer I have. I close my eyes, suck my licorice :), count and relax. I asked the technician how my skin was doing compared to what he had seen - he said excellent. Wish you well. A day at a time...  I have had chemo - with some bad side effects, double mast., almost through with rad., then reconstructive surgery. Hate the expanders :)  All will be done soon. Quite a journey for sure.",
      "MessageIndex": 383,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766624",
      "Title": "April 2011 Rads sammolisa sammolisa"
    },
    {
      "AuthorID": "mnleck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117267/profile",
      "Content": "May 6, 2011 01:43AM mnleck wrote: Glad you found your necklace and thanks for the warning about mixing the cream and aloe. I did have that similar reaction to one of the creams someone had given me - a sample from the RO actually. Everyone's journey is just a little different but it sure has helped me to get on this forum and get some ideas and positive encouragement. I have one more treatment - tomorrow. I loved the idea of taking a treat to the techs, dr.s and others in the waiting room. I have felt so much love and support from them all. I have a son-in-law who took a year out of his life to fight cancer at age 17 and he stated that once we have survived we need to support others on this journey, as there is nothing that takes away fear like talking to someone who has gone through what you are going through. Thank you all for sharing. Love, M",
      "MessageIndex": 406,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766624",
      "Title": "April 2011 Rads sammolisa sammolisa"
    }
  ]
}