{
  "AuthorID": "Mnsnowflake…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246270/profile",
  "Posts": [
    {
      "AuthorID": "Mnsnowflake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246270/profile",
      "Content": "Jul 16, 2017 08:37PM Mnsnowflake wrote: My start date got postponed. I had a follow up MRI that showed a small spot in the other breast. So that led to an MRI biopsy 8 days later and a weekend of waiting for results. Tests lead to more tests. I hope to get the news tomorrow that I can start on Tuesday. I called the oncology nurse about my start date and she said \"your probably nervous aren't you\". Umm yes I think I have a right to be nervous!!",
      "MessageIndex": 38,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "Mnsnowflake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246270/profile",
      "Content": "Aug 5, 2017 03:31PM Mnsnowflake wrote: After a later start due to a biopsy scare I'm 13 in with 6 left. Things were going well but they couldn't get me positioned. I was painting so my muscles were sore so that may have had something to do with it. Now I just can't seem to get into the right position and the breathing is hard. The tech told me to hold my breath but try not to hold it in. Wtf did that mean? Then she said you need to relax! Only 2 more whole breast and then boost so I hope they are easier. I do now feel the fatigue especially when I sit in my car after work. I miss 45 mins of work in the am to do rad. My coworker made a comment that I should be able to get an earlier appt as spots open up. Ugh I worked through chemo why do I have to be a hero? The funny thing is my job is mammography tech. Only 6 days left then Herceptin only. This too shall pass",
      "MessageIndex": 108,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "Mnsnowflake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246270/profile",
      "Content": "Jul 2, 2017 07:33PM Mnsnowflake wrote: Hello Fellow July Rads, I start July 6 th and finish Aug 2. I finished chemo 6/12 and will continue with Herceptin every 3 weeks until March. They are letting me start rads a little early as I was supposed to wait a full month. I'm glad to get this phase going. I was told by my MO that I would have 5-6 weeks rad but they have me set up for 4 weeks. Just wondering many weeks others have to do? I go in for my infusion tomorrow and I'm reluctant to question the length of treatment as I like the shorter plan😄 Wishing smooth sailing to you all",
      "MessageIndex": 8,
      "PostDate": "02/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    }
  ]
}