{
  "AuthorID": "moborn63",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
  "Posts": [
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Mar 29, 2009 01:41AM - edited Mar 29, 2009 02:02AM by moborn63 my suggestion is to continue being tested. But don't do the surgery unless it is necessary. My family is high risk for cancer. I am one of 9 children. I have lost 1 sister, 1 father, 2 brothers (twins) to bone cancer, colon cancer, breast cancer and met of brain. My twin sister has been tested for the genetic mutant gene and we do carry it. Currently my twin sister was diagnosed with bc stage 3 in her right breast. she has just finished chemo and is being scheduled for surgery. I was diagnosed a week after her for bc stage 3 in my left breast. I have had a double mastectomy. and I have begun chemo treatments. We both will be going through radiation. So do the test people. Its important to be well informed and proactive. .",
      "MessageIndex": 11,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/730422",
      "Title": "mom with ovarian, sister with breast cancer, am i doomed? mardissis Eldub"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Apr 3, 2009 09:44PM moborn63 wrote: Hi All. Had a Double Mastectomy in December. Had to wait to start chemo. Had to get an unknown ulcer under control and get my Hemoglobin count up. It was around 7 which is Highly anemic. (did not know I was anemic until they told me LOL) now counts are up to 10 and ulcer in under control so they allowed me to begin Chemo on March 13. I go every two weeks. I am on the E5103 trial which is a Double blind study phase 3 using Doxorubicin and Cyclophosphamide followed by Paclitaxel with Avastin or Placebo. I follow my treatments 24 hours later with a shot of Nuelasta. I have had 2 treatments so far and my third is scheduled April 9. So far so good. No sickness, only a couple of aches and pains from the Nuelasta those aches usually hit me on day 5 after the shot. After the second chemo treatment my hair started falling out in handfuls. I am currently wearing scarves because I am uncomfortable in the wigs the cancer center gave me. I think I look stupid in the wigs. Have not lost my lashes or my eyebrows as yet. Hopefully I won't.  The Chemo is making me gain weight which I hate. But the good news I got my fake boobs last week. I had been a 44D before BC. So I liked being flat chested LOL. So I had her fit me for an A size. and I am just loving it. Thanks for all the info in the forums it is a great help",
      "MessageIndex": 834,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Apr 11, 2009 09:13PM moborn63 wrote: loved the picture of the dog. I have a friend scheduled to shave my head in the next few day. I would insert a current picture of myself and one of my dogs but I don't know how.",
      "MessageIndex": 1132,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Apr 9, 2009 03:56AM - edited Apr 9, 2009 03:56AM by moborn63 hi ladies. Boy my insomnia really kicked in tonight. Can't sleep. Which I should be doing since I have my 3 treatment in the morning at 8:30. Another round of Doxorubicin and Cyclophosphamide followed by Paclitaxel with Avastin. Yeah !!! I have no hair left but thats okay. Have some really pretty scarves and hats to wear. May buy a real hair wig because the other just make my neck itch. LOL. Hope everything is going good with all. My only complaint right now is the back spasms I get about 5 day after my nulesta shot and the fact that I am gaining weight. Uggg. Blessings to all Robin",
      "MessageIndex": 1044,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Apr 14, 2009 01:59AM moborn63 wrote: thanks for the info  on how to add a picture crusader1. Going to try it out now. Here is a picture of one of my dogs Rocky. And here is a current picture of me in my car. scarf on because I have very little hair left ",
      "MessageIndex": 1205,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Apr 14, 2009 02:03AM - edited Apr 14, 2009 02:09AM by moborn63 i have to mention that last week I was able to get my mastectomy bra and my silicone breasts. And I just love the freedom of deciding whether I am going out with boobs or boobless. My friends have a blast when I told them that today was a boobless day. Because I really did not want to be bothered to where them. LOL Also reading all the posts about getting a port. My suggestion is get one. I makes everything so much easier. Mine was put in while I was in surgery. And My treatments and labs are a breeze. Everything goes through the port. So I do not have vein issues nor do I have to worry about leakage nor do I have to worry about scar tissue build up from the poking and prodding of my veins.",
      "MessageIndex": 1206,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "May 12, 2009 04:23AM moborn63 wrote: Hot flashes are a bite are they not. I was always cold natured until I started chemo. ",
      "MessageIndex": 1958,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "May 19, 2009 05:27PM moborn63 wrote: ok back from college graduation at Morehouse in GA. It was great. The speakers were Cecile Tyson, Harvard Professor Henry Gates, and Baseball great Hank Aaron. The only bad thing was that it was outside and it rained through the entire thing. So now I think I may have caught something because I have a headache, chills, and my muscles ache. I took my temperature and it is 101.4. I know I am suppose to go to the hospital if it is 100.4. But I really don't feel that bad and I am a work and no one to cover the floor. Plus the hospital in my town is filled with stupid people. (I have a chemo treatment tomorrow morning) I think I will just wait unless my symptoms get worse. What do you ladies think.",
      "MessageIndex": 2120,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "May 24, 2009 04:31AM moborn63 wrote: Hello Ladies Well after a two hour wait they did give me my chemo on WED.  My temp had dropped to 100.3 but they were more worried about my blood pressure which was up to 178/98. They gave me tylenol and kept checking my pressure and once it dropped they decided to go ahead and give me the chemo. That was Wed as I mentioned. I have continued to spike fevers since usually in the mornings it will run around 101.4. They told me to keep taking the tylenol. And I have to go to drug store or walmart every other day to keep check on my pressure. I have my next appt on Thursday and we will see how it goes.",
      "MessageIndex": 2168,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Apr 21, 2009 10:38PM moborn63 wrote:",
      "MessageIndex": 1496,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "May 19, 2009 08:53PM moborn63 wrote: I will call the after hours ONC To see what they say. I only have another 2 hours here at work and if they tell me to go I will. My temp has dropped some it is now 100.8.",
      "MessageIndex": 2124,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Jun 6, 2009 02:36AM moborn63 wrote: It depends on the dr. My twin sister who was diagnosed 1 week before me. Her doctor did her chemo first and she just had her surgery this week. Where as my dr did my surgery first (in dec) and then my chemo. We will both have to have RAD. But it does depend on the cancer type. The tumor size and the dr you got to and what they feel bets the best results.",
      "MessageIndex": 2339,
      "PostDate": "06/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "May 9, 2009 02:10AM - edited May 9, 2009 02:16AM by moborn63 I wanted to wish all the mothers out there whether your kid are human or the pet variety a Happy Mothers Day.  I thought this was cute so I thought I would share   Mother's Day The kindest face I'll ever see, The kindest voice I'll ever hear. The one who cares the most for me Is my own mother dear. All through the year I'll try to do The things that show My love for you. And not be happy just to say, \"I love you, Mother,\" on Mother's Day.",
      "MessageIndex": 1919,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "May 13, 2009 08:05AM moborn63 wrote: Go for Tox number 2 tomorrow and then Thursday.....Yeah Vacation in warm Atlanta GA. To see my nephew graduate. 5 whole days to do nothing but enjoy my family and the weather. Watch it rain LOL LOL.",
      "MessageIndex": 1979,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Apr 13, 2009 12:26AM moborn63 wrote: I think the chemo is frying my brain...LOL how do you put pictures on here.",
      "MessageIndex": 1155,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Aug 31, 2009 12:05AM moborn63 wrote: Starting my last week of RADS...",
      "MessageIndex": 3024,
      "PostDate": "31/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "May 9, 2009 01:30AM moborn63 wrote: I don't know 5times winner. I have the same problem with my toes and fingernails. They are all discolored and my big toe aches like the devil on both feet. And the discoloration on the bottom of my feet is horrendous. I have mentioned this to all my doctors but they do not seem to be concerned just tells me this is just a random side effect of the chemo but to let them know if I start feeling heat along with the sensitivity ( I guess this would mean a possible infection if my feet, toes and fingers start getting hot).",
      "MessageIndex": 1918,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Jul 28, 2009 06:29AM moborn63 wrote: Hi Ladies. Wanted to wish all a good day. May we have more and more. Here an angel for you all. She is the angel who protects all with Breast Cancer. Boy she has been working overtime lately. LOL ",
      "MessageIndex": 2799,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Apr 27, 2009 06:02PM moborn63 wrote: Just curious, How many of you ladys are from Missouri.",
      "MessageIndex": 1659,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Jun 11, 2009 07:16AM moborn63 wrote: Another Chemo trip tomorrow. Next week will be a real bummer because i will have Chemo on my Birthday... Oh well hopefully with this treatment I will continue to have Birthdays for a long time. Hope all are doing well.",
      "MessageIndex": 2373,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Aug 10, 2009 01:00PM moborn63 wrote: I started rads this last week. I will be getting it 5 times a week for 6 weeks. So far no major side effects.",
      "MessageIndex": 2878,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Jun 24, 2009 08:53PM moborn63 wrote: Toxel #8 tomorrow. Hey when do they usually unblind you anyway. Chemo has caused my blood pressure to stay in the hypertension level so last week they put me on blood pressure medicine (mild) to see if it helps. Did have one question. I don't know if this is result of Toxel or blood pressure medicine or just the heat (and boy has it been hot in mid missouri this week) anyway. the pointing finger on my left hand and the thumb on my left hand as well as the area between all the way to my wrist has been swollen and tight and painful. As well I have felt the area between my arm pit and my elbow feeling tight as well. I will talk to dr about it tomorrow but wanted to know if this has happened to any of you. The left side is also the side where I had the nodes removed and I have been very careful on that side because I did not want to develop lymphoma.",
      "MessageIndex": 2533,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Jul 23, 2009 02:11AM moborn63 wrote: yeah, today was technically the last day of chemo. Since I was in the trial e5103 and was in arm c. I will continue with arm d. So i will only receive astvasin every 3 week until March. I will  have to have 2 weeks of PT for the lympodemia. But other than that I have completed my treatments. Happy Dance ",
      "MessageIndex": 2778,
      "PostDate": "23/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Sep 14, 2009 06:18AM moborn63 wrote: skin is starting to peel in the radiated area. itchy but i don;t dare scratch, lubercating myself 6-4 daily with the lotion and gels I was given by my radiolgy nurses. But does anyone else have any suggestions.",
      "MessageIndex": 3148,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Mar 31, 2009 12:43AM moborn63 wrote: morning ladies. I started my chemo in March, Had the first one March 13 and the second March 26 they have me going every other week. Also on a trial the E5103. Taking Doxorubicin and Cyclophosphamide followed by Paclitaxel with Avastin or Placebo. I also get a Nulastea shot 24 hours after treatment. So far no sickness. but I did lose my hair fairly quickly after the second treatment. ",
      "MessageIndex": 87,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "moborn63",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80976/profile",
      "Content": "Mar 31, 2009 12:50AM moborn63 wrote: how do you get on the list alyad for the free head wrap. I did not see where to sign up on the web page you posted.",
      "MessageIndex": 88,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    }
  ]
}