{
  "AuthorID": "mohonda",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
  "Posts": [
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 19, 2010 08:16AM mohonda wrote: Robin I feel for you. I hope the doctor is wrong on this. Many are. I will say a prayer for you.",
      "MessageIndex": 141,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755270",
      "Title": "The prognosis in not good RobinWendy BrokenHeart"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 30, 2010 03:17AM mohonda wrote: Well I have had the pleasure of meeting someone who works in upper management of the makers of Coke and you know what he does not allow any of his kids drink diet coke and tell people to stay away from it. You know how much money the makers of aspartame have contributed to politicians and how many lobbiest have worked to get it approved. I don't care how many supposed studies say its safe I don't believe it. What about the studies that showed it caused cancer in lab rats? Bet u don't know about them. Nah have a real coke with sugar if you have to have it.",
      "MessageIndex": 13,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755195",
      "Title": "Aspertame and BC mcbird mcbird"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Aug 16, 2011 01:32AM mohonda wrote: Great idea Medi. There is just so much info on these boards and so many chemo's possible this would be terrific. Is there a search box when you are in a discussion? I did not see one. You know type one word and then you get all the discussion for that word. Mo",
      "MessageIndex": 1,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772623",
      "Title": "Dear Moderators medinorth Moderators"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Nov 1, 2010 07:15PM mohonda wrote: LC wishing you good results soon. I know the waiting is awful, glad you have caring coworkers that are looking out for you. ((LC))",
      "MessageIndex": 59,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759886",
      "Title": "Really scared now LC815 lwd"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Oct 23, 2010 04:31AM mohonda wrote: Well today I plan on doing the Oxy for the first time. I am nervous about the sdx. I don't want to be intoxicated and try to get through the day. I will not drive today, I will have my sis in law do that. I do believe the 3 vic's a day have been doing the trick for me. But I will stop that and try the oxy. Wish me luck, hope I can do no 2. Oh brother, I hate changing meds, you don't know what to expect.",
      "MessageIndex": 6,
      "PostDate": "23/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759668",
      "Title": "Pain meds the good bad and ugly mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "May 27, 2010 07:21AM mohonda wrote: I am right there with you all except not so angry. I am living life to the best of my abilities. When I was dx the dr said 1-3yr. OMG I was in shock. It took about 6 months to stop the inside voice repeating those words 1x3 now I am more optimistic it will be longer. But I am not in chemo right now and I know it can change at any moment. These boards help alot and proves anything is possible. Hang in there! I go to dr today to get result of PET comparison hoping for the best.",
      "MessageIndex": 19,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753125",
      "Title": "5 yrs lisa34lisa ChocolateLover"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 28, 2010 12:21PM mohonda wrote: Good for you! If your loose your hair wear a scarf or wig. Or nothing at all be proud your fighting and alive.",
      "MessageIndex": 24,
      "PostDate": "28/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755116",
      "Title": "ha.. i got a job apple mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Oct 22, 2010 11:36AM mohonda wrote: Hi, I was on a Fet 100mg patch but I was not able to function slurring and walking like a drunk. I do notice being groggy and irritable on 3 Vicodine a day. But it has only been 2 days so I need to wait a week or so. Mari that sounds interesting the ear clips (alpha-stim)? It is not a drug at all?I will have to do some research. I would like to come down on all my meds eventually. Thats another problem. I missed my patch for 2 days and was having drug withdrawls. I know being on pain meds can do long term damage to your organs too another concern. I just received my Oxy in the mail. I will wait until tomorrow to try. I can't wait to see how much that is costing me. BTW there is no good in pain, maybe I should take it out of my title. thanks ladies, hugs Mo",
      "MessageIndex": 5,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759668",
      "Title": "Pain meds the good bad and ugly mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Oct 25, 2010 03:14PM mohonda wrote: Wow,, lots of advice here. I think I will go to a pain specialist. I have been on Oxy 3 days now. My first day I felt speedy, like my heart rate was up. I did not have pain and over did it playing goalie soccer with my 8yr old nephew. The 2nd day, very groggy, sleeping in car as passenger. Today not to sleepy. I will continue on the Oxy for a few weeks and see how it goes. I am having poopy issues even though I took miralax and docuclax. I am still waking up at nite so I probably need something to help me sleep. I like the idea of a pain pump. Cat I was hospitalized for 3 weeks upon dx and on morphine, dulated, vicodin. When I left I continued the patch and vicodin. I had very bad bowel problems for several months. I have been on Zometa and it is working according to the last blood test. I already have fractures in spine and don't think it would be a good idea to stop at this point. I will definetly get a specialist. You ladies have been great. Hugs Mo",
      "MessageIndex": 12,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759668",
      "Title": "Pain meds the good bad and ugly mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "mohonda wrote: Hi Ladies, I thought of starting a pain thread. I have been taking them over a year for bone mets and it seems like I still could use advise. I thought taking less would be better for my organs ie liver and kidneys. But it turns out if I am not on a consistent pain plan I have more symptoms. I don't know what is normal anymore when it comes to pain. I did not want to take too much because like in the poopy post we have problems in that department. So for a year I have been on a Fentynal patch 75mg every 3 days and vicodin as needed. Well I was only taking 5mg in the am and 5 in the pm trying to be conservative. But at nite I had so much pain. I could not sleep in one position more than a few hours without waking up with pain. I saw a new dr traveling and she is going to change my rx to Ocy because it last 12 hours. I have no idea why my other drs would not prescribe this. Maybe because the pharmacy thinks your a drug addict when you try to fill. They don't even carry it in the CVS they have to mail it to you. Last nite I took 3 5mg vicodin spread out am, afternoon and before bedtime. This is the first time in a year I did not have pain sleeping in a position and having to wake up. When your sick and in pain you forget what is normal and don't realize the pain is too much. Anyone have anything to add? Has anyone switched from vicodin to Oxy? Mo Maureen K Dx 8/23/2009, 1cm, Stage IV, mets, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759668",
      "Title": "Pain meds the good bad and ugly mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Oct 13, 2010 02:55AM mohonda wrote: Bopeep great question. I was dx last aug, did chemo until March 10 did tamx until July when mets worse by scans. I don't think tamx ever worked, now on armx but scans in Sept more progression. However, a bone biobsy in Sept on spine mets negative for cancer. Happy for that, but tumor markers keep going up. Nov I will do new tm tests to determine if hormones are working. If still up maybe chemo soon. I think after reading responses here I may want to wait another month before I rush to judgement. Hoping for results for all of us.",
      "MessageIndex": 18,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759192",
      "Title": "Switching hormonals...does it ever really WORK? bopeep mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jun 9, 2010 11:38PM mohonda wrote: I had great vision at 47 and did not even need reading glasses. After a few rounds of chemo I needed to use reading glasses and noticed not as good vision. It is now 4 months since I had chemo and I still need reading glasses, especially when I don't have alot of light.",
      "MessageIndex": 8,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753731",
      "Title": "Chemotherapy and eyesight question tania_s jeanne46"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jun 7, 2010 11:59PM mohonda wrote: I had the same concerns about addiction. I am taking Fetynal 75mg patch and the generic Vicodin 5mg 2X a day plus Aleeve 2tabs 2X a day. But if I miss taking my patch on time or the vicodin I am in pain and we don't know how much time we have so we shouldn't worry about that. I lived in C A until March of this year. While I hadn't smoked pot since HS some 29 yrs ago I decided to try it during chemo because I couldn't eat from the side eff of chemo and rad. I will say it helped tremendously, with my eating and relaxing and pain. But now in FL and technically its not legal for pain here. I also was constipated during the first 6 months taking these drugs but now I am fine in that department from eating lots of greens, fruit and oatmeal. I also think your body adjusts.",
      "MessageIndex": 14,
      "PostDate": "07/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753746",
      "Title": "Do you ever feel you will get addicted to pain meds? Reneepals barbe1958"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Sep 13, 2010 05:34AM mohonda wrote: Skiddo, they screw up alot in these onc offices. You would think after you specifically asked 3X;s they would get it right. I have a question for you, I feel kind of stupid because I have been dealing with my cancer a year and don't even think to ask about a FISK test again. I had back surgery a month ago on my spine Kyphoplasty. They did a biopsy in 2 spots while in there and tests confirmed no cancer just decalcified bone damage. Should I also ask for a fisk to see if my status changed? I saw a nurse practioner on my last visit for follow up. I met with the neur dr for like 10 minutes to discuss surgery and that was it. Thanks",
      "MessageIndex": 9,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757571",
      "Title": "bone biopsy results ?! 33skidoo mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Sep 13, 2010 11:51PM mohonda wrote: Thanks Bonnie you know your Fisk!",
      "MessageIndex": 11,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757571",
      "Title": "bone biopsy results ?! 33skidoo mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Apr 30, 2010 07:28AM mohonda wrote: Hi, Thank you all for the feedback. I realize from the feedback that each person's cancer is individual and treatment will vary according to size and location of primary. I do believe my Onc did not want to do surgery for several reasons. I was weak after the chemo and I needed to gain back some strength and weight and stabilize my blood counts. Secondly, as mentioned above there is no research to support whether removal of a small tumor is beneficial when it has met to the bones. I think I had a problem with his recommendation because I recently moved from CA and he is my new Onc in FL and he disagreed with my Onc in CA treatment plan to have me on chemo. He stated and showed me a website that was put together by all onocologists in the country with its protocol for treatment plans for various cancers. In it for my stage 4 cancer with met to bones there was no call for chemo. But I think because I was in such pain from met of hip and bone they need to stabilize my condition. I do want to get a 2nd opinion though despite everything. However, the hospital my onc recommended is 2 hrs away and my onc is affiliated with it and probably will recommend the same treatment plan. So to me it makes no sense to get a 2nd opinion there when it would most likely be exactly the same treatment. I will most likely look for another hospital that is not affiliated with my doctor. thanks again and stay strong!",
      "MessageIndex": 11,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jun 8, 2010 12:42AM - edited Jun 8, 2010 12:43AM by mohonda",
      "MessageIndex": 22,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jun 8, 2010 01:33PM mohonda wrote: I had a bone scan today too. I am not going to see my onc until June 24th because I am traveling back home to NJ for 2 weeks. I am going to pick up the report written tomorrow and read myself. If I have any questions I will call my dr and see if I can speak to him or a nurse practioner. I just cant wait 2 weeks to get results. I wish u good luck and me too.",
      "MessageIndex": 5,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753760",
      "Title": "Bone Scan neogirl mthomp2020"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "May 4, 2010 08:38PM mohonda wrote: Hi L & J Mom, I hear you about not finding anything. It took 6 months for them to find it in my breast by MRI. I too have had yearly Mamos, I don't think they work well to dx. I had gone to an Ortho for pain in my hip for 5 months and he wouldn't authorize a MRI. The pain started moving to back and ribs and sternum. Finally, I could barely breath or walk from pain and stopped at a redi med on my way home from LA to SF. They sent me in an ambulance to hospital a 20 min ride which they billed me over 4k. Unbelievable! How are you managing the pain? I am taking fentynal patch and 10 mg of vicadin a day.",
      "MessageIndex": 19,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 28, 2010 11:27AM mohonda wrote: I thought I would update this forum since I went to Mofitt cancer center in Tampa FL> I was suprised to learn that taking out the source of the cancer, tumor in breast can actually exasperate the cancer in the bones or other locations. So, it was not recommended to take the tumor out. It can also serve as a way to measure the cancer to see if it gets bigger or smaller. I am happy to keep my breasts.",
      "MessageIndex": 24,
      "PostDate": "28/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 30, 2010 07:15PM mohonda wrote: Hi L good news for you are you dancing for joy? Hope to meet u there someday. But I read the study of nearly 2k women and positive info but my onc said their cancer was stable. Not like mine so were gonna wait.",
      "MessageIndex": 30,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 30, 2010 07:20PM mohonda wrote: Hi Cat I notice same thing with the nails and hot flash increase and a PET and MRI did confirm 5 fractures. This sucks cause I try to be active bike motorcycle boat. Anyway that was only 3 months after getting good results. I would not wait until OCT go and change now.",
      "MessageIndex": 2,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756012",
      "Title": "Tamoxifen losing it's effect? survivorcat mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jun 8, 2010 12:41AM mohonda wrote: I thought I would post an update. So I still did not have a lump or mas. I am going to Mofitt in Tampa to get their opinion. I have been taking my pain meds and tamoxofin. No chemo since Feb since my new Onc did not recommend it. So what have I been doing with my self? Living life as best I can. Riding my new motorcycle, camping in a 1978 RV. Going fishing with my brother I caught a 15lb Maui. Which nearly broke my back reeling it in. But I did it with my bone mets. Wah Hoooooo! I go on July to Mofitt and will update again.",
      "MessageIndex": 21,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 29, 2010 08:55PM mohonda wrote: Wow IBC lucky u to have healing bone mets and a smaller tumor. I am going to ask Moffitt again about the new research but I think its too new and maybe not a big enough study for all the onc to jump on board in aggreement. Hi Jenny and wow to that study too. I would like to find it somewhere. That stat sucks we go through it once and then have to do it again. With me it was the bone mets they discovered first then 5 months later they found breast as primary. But i don't know I wonder if its estrogen related because I have been on tamox for 8 months and it aint working. What if they got it wrong and its a different primary and their treating it wrong. Jez I am tired of this going to doctors layng in a tube with loud noises UGH let me out of this crazy cancer world. May they find a cure before I die I hope. Hope your doing well.thanks for your response",
      "MessageIndex": 28,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "mohonda wrote: Hi, New to the site, I was diagnosed with bone cancer in Aug of 09. It wasn't until Jan 2010 that it was confirmed I had a breast primary. I had 5 rounds of chemo and months of radiation to stop pain in hip and sternum and back. Currently I am at a stand still with treatment and only taking Tamoxofin. I do have a small tumor in my breast and my Oncologist want to wait a few months before a masectomy is done. I asked why and his response was to wait and see if the cancer spreads to organs. I told him I did not understand that if I have a tumor in my breast shouldn't it be removed. It is small but it could spread. Thats my reasoning. I am finally able to do some normal things like walk my dog. But the doctor says this is standard protocol for my diagnosis. Anyone have any feedback on this? Thanks Maureen Maureen K Dx 8/23/2009, 1cm, Stage IV, mets, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Apr 29, 2010 07:41PM mohonda wrote: I took the survey and never was asked any information on address or name. I assumed it would go to a donation to breast cancer research. But I think its a scam to make you want to take the drug Avistan. I am glad I am not the only one who noticed. They should take it off the website.",
      "MessageIndex": 4,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751986",
      "Title": "Re: Interview Opportunity: Metastatic Breast Cancer... redskies Helmie"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "May 5, 2010 08:39AM mohonda wrote: Hi MC, Thanks for the link, what a difference in price. I will do more research on the products and decide which one to buy. I mind as well invest in a good bed we spend alot of time napping and sleeping.",
      "MessageIndex": 5,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752202",
      "Title": "Temperpedic bed for bone mets? mohonda exbrnxgrl"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Aug 23, 2010 01:21AM mohonda wrote: Great loved your post> Needed a boost today. thanks keep on enjoying",
      "MessageIndex": 41,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756854",
      "Title": "2 years ago...I was diagnosed with mets Fitztwins jenny66"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "May 31, 2010 07:12AM mohonda wrote: Congratulations Nancy doesn't that feel great for once going through this. I will share my good news too. I had a comparison of 2 PETs one from Sept 09 and April 10 and there is no new growth in the bones and lesions and they seem to be getting smaller. I also wiped out on my patio when I was watching where I was going and hit a step. I fell hard on the ground and nothing broke. I was in some pain but it all felt better the next day. My doctor told me my bones were not at the point to fracture as they were in Aug of 09 and I guess he's right. Yeah for good news keep on rocking on!",
      "MessageIndex": 20,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753226",
      "Title": "Great PET scan! nancyh olisad"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "mohonda wrote: Hi I am looking for anyone has had this procedure for spine fractures or compressions. I am going to go ahead and have this done if insurance approves. I have 5 fractures and more compressions. I will have to do 2 or 3 surgeries because they can only do 4 spine cells at a time. Some benefiets are stablizing the spine to prevent breaks and paralysis. Also, the procedure uses a liquid heated up to 90 degrees which can kill cancer cells on spine. The surgeons insert a needle like device with a baloon attached it opens up the spinal cell and then they insert concrete. YIKES can u imagine. But I am told they have done over 300,000 of them. Thanks for your feedback Maureen K Dx 8/23/2009, 1cm, Stage IV, mets, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756256",
      "Title": "Kyphoplasty for spine fractures mohonda Lynne"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Aug 19, 2010 05:00PM mohonda wrote: Oh Norma what a bummer after surgery to find out more tumors. I hope there is a way to treat them. I don't understand waiting 6 months for scans Suzanne. I have been on a 3 month schedule. I had kyphoplasty surgery yesterday and was able to go to my hotel afterward. I had done research on their website and talked to the pre-op nurse but no where or no one explained that the dr was going to hammer the instrument into my spine. I opted for the new procedure not using anthesia. I was given something intravenously that made me sleepy but not knock me out. So, I awoke to a hammer banging on my spine with something like a chisel. I was not a happy camper. Anyway I am home now and hope to see the next few days how it will help me. I have several fractures on my spine and lost 4in in height. Not to mention the pain which I hope I will have less of. This procedure should protect my spine from breaking. I need to have 2 more of them. I think I will opt to sleep over and do the anthesia. I don't know if this helps Suzanne, but maybe someone will write on a similiar issue with your femor. Good luck girl and get more frequent scans.",
      "MessageIndex": 6,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756700",
      "Title": "Bone Mets Surgery?? undecided8 mohonda"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "May 22, 2010 11:01PM mohonda wrote: HI MCTHO, I went on line and bought the 11in memory foam from bedinabox. The price was much better than tempurpedic. So far, its comfy better than a regular mattress. Its not a miracle worker I still hurt in the morning but not as bad. Thanks again for the suggestion",
      "MessageIndex": 7,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752202",
      "Title": "Temperpedic bed for bone mets? mohonda exbrnxgrl"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "mohonda wrote: Hi, I have difficulty sleeping and moving around, It seems I can only fall asleep on one side because of damage to hip and back. When I get up in the morning it hurts to move. So, I was in a store and layed on the temp beds and it seemed so comfy and felt like the bed gave to my body parts. These beds are so expensive though like 2-4 grand. Does anyone own this bed and did it help the pain? Thanks, Maureen K Dx 8/23/2009, 1cm, Stage IV, mets, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752202",
      "Title": "Temperpedic bed for bone mets? mohonda exbrnxgrl"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 29, 2010 07:05PM mohonda wrote: Hello Sea thanks for your suggestions. But I have to question whether you are on this site to get patients to try your products it seems suspicious that you are not registered as a cancer patient here. Do you work for these companies. I hope u are not here just to sell.",
      "MessageIndex": 25,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752202",
      "Title": "Temperpedic bed for bone mets? mohonda exbrnxgrl"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Aug 3, 2010 05:24PM mohonda wrote: That was a bummer. But I bet if u did not have the cement it could have been worse, like parylisis. Having rods and pins put inside you I can't imagine. But did the procedure help with pain and mobility? Now when u fly  ur going to have to be hand searched.",
      "MessageIndex": 3,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756256",
      "Title": "Kyphoplasty for spine fractures mohonda Lynne"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Aug 22, 2010 11:33PM mohonda wrote: An update on the Kyphoplasty. I had on the 18th not quite a week and I actually walked out of hospital the very same day. I opted for out patient which they do not give anthestia, instead another pain and intravenous medication which doesn't completely knock you out. So, I awoke during surgery when they were hammering the instrument into my back. They never mentioned that either now I know why. It was painful and awful listening to them hammer this thing in my back. It felt forever because they had to do it 4 times for each vertebrae. Its not quite a week yet and I cannot tell if it will help me because I still have pain where the incisions were made. I mistakenly took a bike ride 2 days afterward not a good idea. I was in pain afterwards. I will update again in a week or 2 if there is improvement",
      "MessageIndex": 6,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756256",
      "Title": "Kyphoplasty for spine fractures mohonda Lynne"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "May 23, 2010 10:57PM mohonda wrote: ThanksBarbe, You know I am premenopause and I am on Tamoxofin. So, I am sweating like crazy in this new foam bed. I wake up drenched every nite. I think its been worse since I have been sleeping on the memory foam. I could send it back its still under the 60 day trial period. I'll have to sleep on it.LOL",
      "MessageIndex": 13,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752202",
      "Title": "Temperpedic bed for bone mets? mohonda exbrnxgrl"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jun 10, 2010 12:21AM mohonda wrote: Girl  you should not be on the floor. Yes, for that money you can definetly find something nice with a frame that can take you off the floor. Thats alot of money and the bed in box foam matress I purchased was less than that. Sometime you can find a used frame on craigslist for free or cheap. I don't know if you have a freecycle.org but I have used this site to get rid of things. I post what I want to give away and someone comes over and picks it up and reuses it. I hope you look into finding a nice bed for yourself.",
      "MessageIndex": 22,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752202",
      "Title": "Temperpedic bed for bone mets? mohonda exbrnxgrl"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Jul 29, 2010 08:21PM mohonda wrote: Dave I had just seen an OC at the Moffitt center and she is inclined to not believe in removing primary tumor if patient has other bone mets. Maybe in my situation I have it all over so they can't remove all lesions on spine. But 2 onc aggree that taking out the primary in breast can exasperate the cancer in bones. So, not all are in aggreement with that idea.",
      "MessageIndex": 6,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755992",
      "Title": "Article Can Metastatic Breast Cancer Be Cured? dhmeiser katie31"
    },
    {
      "AuthorID": "mohonda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101130/profile",
      "Content": "Oct 23, 2010 07:27AM mohonda wrote: Hi, I have been on the Fenytal patch 75mg for over a year. But in addition I need other pain meds. I have been doing Vicodin 5 mg 2x daily and Alleve 2 2x daily. This has not been working as by late afternoon I have extensive pain in my back. I just started taking 3 vic's and it has helped tremendously. I just had gotten used to being in pain and thought I would have to live with it. At nite, I could not sleep in 1 positon for to long. Now I sleep without pain unbelieveable. But my new dr wants me to switch to oxy 2x a day. Hope your getting it right. Mo",
      "MessageIndex": 18,
      "PostDate": "23/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758820",
      "Title": "pain meds jleigh mohonda"
    }
  ]
}