{
  "AuthorID": "Mojojennijo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
  "Posts": [
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 12, 2017 08:45AM Mojojennijo wrote: I actually got lucky. I have a general surgeon who had a specialty in breast cancer. They are out there. But he's also part of the Seattle cancer care alliance. It's a good group where I go. Your oncologist will become the ring leader. It would be good if you could find an alliance where they work as a team. Your surgeon, mo, ro, radiologist, pathologist etc. it's comforting when everyone is on the same page. Best wishes! So sorry about your diagnosis :(",
      "MessageIndex": 7,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858548",
      "Title": "Second guessing?! Meshell5324 MTwoman"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 8, 2017 05:48AM Mojojennijo wrote: My best friend and my niece had breast cancer at 30. For both of them the drs said the same thing. Don't worry it's nothing. But they both persisted for a referral to breast clinic and both were diagnosed. Both are survivors.",
      "MessageIndex": 6,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858492",
      "Title": "Stinging sensation. Trust my gut instinct or my ultrasounds Staceyatmiss Moderators"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 8, 2017 01:29AM Mojojennijo wrote: I think having an MRI is a good thing to do when in doubt. The MRI I was finally given saved my butt cause I was about to be dismissed till the next time at my last Mamo and us. But I spoke up. But I should have done it sooner. I am hoping this resolves for you with a good outcome!",
      "MessageIndex": 4,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858492",
      "Title": "Stinging sensation. Trust my gut instinct or my ultrasounds Staceyatmiss Moderators"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 12, 2017 05:47AM - edited Sep 12, 2017 05:47AM by Mojojennijo eek yes. I made a post then felt embarrassed about being nervous.But I too am scared. I have a full body bone scan and a chest abdomen and pelvis Ct today. I'm scared because I felt like I fell through the cracks and was ignored before and maybe this all doomed me to more problems. But at first I thought I'm gonna freak if I have breast cancer. Then when diagnosed I thought \"I'm gonna absolutely freak if I have To have chemo\" well i have breast cancer and I'm having chemo and I'm getting ok with it. So I know, even though I feel scared, that I am capable of adapting eventually. Again, though, I think for me I don't feel like I have control. And not knowing things definitely makes one feel out of control",
      "MessageIndex": 12,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857724",
      "Title": "MRI this Tuesday, scared queenofwands Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Mojojennijo wrote: so until today I was t even worried about my full body scans I have tomorrow. Does tumor size and her2+ play any role in chance of metastasis? I won't ever know my node status cause I can't have surgery first. (Before chemo Anyways what I'm finding myself anxious over, is waiting for onc to come into the room Wednesday at my appointment and waiting for him to open his mouth. I'll be going crazy trying to read him. I'm sure this is all probably a build up from my whirlwind past couple weeks and I probably am borrowing trouble worrying about it now. Dx 8/29/2017, ILC, Left, 6cm+, Stage IIB, Grade 2, ER+/PR+, HER2+ Chemotherapy 9/26/2017 AC Targeted Therapy 11/19/2017 Perjeta (pertuzumab) Chemotherapy 11/19/2017 Taxol (paclitaxel) Targeted Therapy 11/20/2017 Herceptin (trastuzumab) Surgery 3/12/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right Radiation Therapy 4/22/2018 Whole-breast: Breast, Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/858593",
      "Title": "I thought the nerves were done... Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 12, 2017 05:29AM Mojojennijo wrote: I was just an anxious mess when I posted this. I do have lorazepam my onc gave me. I took one and felt less nervous. But I can't delete the post. So I guess worst thing is I can't pretend I'm not a little scared. I hate feeling like I have no control.",
      "MessageIndex": 1,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/858593",
      "Title": "I thought the nerves were done... Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 12, 2017 07:06AM Mojojennijo wrote: pere, that's a good way to feel like you have some sort of control! I'll try to do some of that. It's nice to know I'm not alone in how I feel! I will keep updated how the scans go (probably on my ilc post) haha I never know where to post what 😂 I'll try to imagine there will be no surprises and focus my mind on that. Dang this cancer crap! It really messes with you!! I could do without it",
      "MessageIndex": 3,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/858593",
      "Title": "I thought the nerves were done... Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 17, 2017 06:21PM Mojojennijo wrote: farawaytoo: Waiting sucks! I got my port a last Thursday What's crazy in my mind is that I went in on the 5th to have my full biopsy results and had the port put in 3 days later. Seems like that was so long ago. Weird. I got the results back from the Ct and bone scan and at my tumor board meeting they discussed some nodes, a spot by my spinal cord and a spot on my lung. My oncologist didn't think much of it but the radiologist insisted on a pet scan and ultrasound. So I had those Friday. I go to radiation oncology Tuesday and back to oncology Wednesday to get the results of the last two tests. Oh and maybe my brca but I know that can take weeks. Anywho oncology said chemo should start this coming week or the week after if Nothing showed on these last two scans. I hope you get through the waiting for results game quickly! It's definitely hard on the nerves!  Also lol beach, I started taking my lorazepam and it's helping!!",
      "MessageIndex": 8,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/858593",
      "Title": "I thought the nerves were done... Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 12, 2017 07:52AM Mojojennijo wrote: also is this standard to have these tests? I was told I had very diffuse her2 receptors in my biopsy. He said they were everywhere (isn't that what they are supposed to do?) anyways this doesn't mean they suspect mets tight",
      "MessageIndex": 4,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/858593",
      "Title": "I thought the nerves were done... Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 20, 2017 08:39AM Mojojennijo wrote: Personally I do not like the effects of the lorazepam. I think it makes me grouchy. Today I will first get a nice short haircut (never had short hair before) and then off to oncology for pet scan results and will find out when I start chemo. This should be the end of the waiting for results for a while. I am not looking forward to chemo but it will give me the opportunity to figure out my new normal and settle in. Even if it sucks. I do know it's temporary. My insurance had a counselor call me yesterday and she gave me some tips to stop \"killing time\" before everything gets started. Gave me some things to focus on and plan. It was actually really helpful to talk to her.",
      "MessageIndex": 10,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/858593",
      "Title": "I thought the nerves were done... Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 2, 2017 08:36AM Mojojennijo wrote: I had a core biopsy and got a large hematoma (I am a bleeder) so some advice with that, make sure your sports bra for after is tight and that they hold good pressure after. Both of those things didn't happen for me. But my rainbow colored boob is rather impressive looking ;) Also use ice. And don't life heavy stuff after (another thing I failed on) I was expecting a fine needle type biopsy so I wasn't prepared. So it's good to ask!",
      "MessageIndex": 8,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858375",
      "Title": "What can I expect from a biopsy?? swg MTwoman"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 4, 2017 01:57AM - edited Aug 6, 2017 04:12PM by Mojojennijo",
      "MessageIndex": 4,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 6, 2017 01:44AM - edited Aug 6, 2017 04:12PM by Mojojennijo",
      "MessageIndex": 8,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 6, 2017 04:11PM - edited Aug 6, 2017 04:20PM by Mojojennijo I honestly understand what you're saying wrenn. Of course not from you position. I felt rather guilty posting here after the fact that it could be insulting to those who do have to live through such things. I have watched so many I care care about fight through bc. which kind and led to my poor choice. I Felt stupid asking them my questions and felt better asking strangers. Thinking too much isn't going to help me in any shape or form in any situation. I am sincerely sorry that things here have become what they are. I will delete my postings and hopefully I won't be back here. I did not intend to trivialize anything with my concerns. I just didn't know who to ask these things. I will just wait and see what the dr tells me to do. And for my MRI results and such and try to figure it out for myself from there. I wish you all the best.",
      "MessageIndex": 11,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 03:29AM Mojojennijo wrote: thank you for the info! I am trying not to be the queen of denial so o can be better prepared but still can't shake the thought that the biopsy may say \"oops we were wrong\" dr said the biopsy is for further information. He just kept saying that I had breast cancer. And again my mind is screaming \"no!!! You can't say that for sure without a biopsy!!\" Again thank god for work the next 4 evenings. I'll call up to the breast health center before I leave for work at 2. Not the news I was hoping for since all my imaging before they thought they were seeing cysts. I'm a little shocked. But my boob changing probably saved me if it ends up being malignant.",
      "MessageIndex": 32,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 6, 2017 04:26PM - edited Aug 6, 2017 04:27PM by Mojojennijo I didn't think that it was. I just get what you're saying. Before you even posted I felt really dumb posting about my concerns. It honestly isn't going to help me any. I will just tell the surgeon at my MRI follow up appointment about the discharge and go from there ;) I honestly, from the bottom of my heart,would not want to hurt or insult someone who did not get benign results by being here posting about hoping for them. I hope that makes sense. However reading others posts and seeing so much of my same questions answered, I feel a little better armed with information.",
      "MessageIndex": 13,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 6, 2017 07:01PM - edited Aug 7, 2017 02:11AM by Mojojennijo makes sense. Sorry I got all weird. This was the gist of all I had posted. So I have a lump, dent below lump and nipple retraction. Mri appointment Wednesday (2 month follow up Mamo and us said more imaging needed) then appointment with surgeon next week. I am 41. Non brca family history. Both paternal aunts had bc a couple years ago. I have nipple discharge when I sleep. It has no color and is not very much. Just the one breast. I cannot express anything. I also have an annoying letdown feeling in that breast. Could this be something related to whatever my breast is doing? Should I mention this to the general surgeon or call my family dr? My son is almost 6. I haven't nursed in 5 years. And had no discharge until this week. I think on my diagnostic us that I had 4 month ago (they did a repeat follow up two month ago) that they said my ducts were enlarged. I don't have my reports. Again sorry I got weird and reacted by deleting. I work in a memory care in a nursing home and with the heat and everything we've been short staffed and it's been crazy. I have been a little on the tired side from work. ",
      "MessageIndex": 18,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 9, 2017 06:49PM - edited Aug 9, 2017 06:50PM by Mojojennijo Someone needs to design a more comfortable MRI bed for breast MRI :)",
      "MessageIndex": 24,
      "PostDate": "09/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 10, 2017 04:07PM Mojojennijo wrote: thanks For the advice! I'll call my Pcp before I head off to work!",
      "MessageIndex": 28,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 11, 2017 01:39PM - edited May 19, 2018 01:02AM by Mojojennijo so my pcp called me and said he didn't have good news. said the MRI showed 3 tumors that looked to be connected by a string andwere said to be breast cancer (I didn't think they could say that for sure from mri) he actually said it looks like they are diagnosing breast cancer. Then said thank god the radiologist looked at your breast itself cause the Mamo wasn't showing this result.  Someone will be calling me from breast health today to get a biopsy then I still see the surgeon. Again is this for sure? Can they even say this from an MRI?",
      "MessageIndex": 29,
      "PostDate": "11/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 05:53AM Mojojennijo wrote: I'm super confused right now. Breast center called to schedule an us only. My dr said it would be a us guided biopsy. I am sorry I'm just venting cause I'm confused about the chain of events to expect.",
      "MessageIndex": 39,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 4, 2017 12:44AM - edited Aug 6, 2017 04:12PM by Mojojennijo",
      "MessageIndex": 3,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 8, 2017 08:09PM Mojojennijo wrote: my MRI is tomorrow. I'm a little claustrophobic. How long do they usually take",
      "MessageIndex": 20,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 03:42AM Mojojennijo wrote: thank you! When I speak with breast health I'll ask them for a breast surgeon instead. I appreciate all the advice! I feel a little distracted.",
      "MessageIndex": 34,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 07:58AM Mojojennijo wrote: the breast center called me back and pretty much repeated what you said dj. I feel better knowing there is a plan. My dr had already submitted for prior auth for biopsy and I go Monday for the location us. Thanks everyone for talking with me! I'm heading off to work, never a dull moment in memory care!",
      "MessageIndex": 45,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Mojojennijo wrote: This Post was deleted by Mojojennijo. Dx 8/29/2017, ILC, Left, 6cm+, Stage IIB, Grade 2, ER+/PR+, HER2+ Chemotherapy 9/26/2017 AC Targeted Therapy 11/19/2017 Perjeta (pertuzumab) Chemotherapy 11/19/2017 Taxol (paclitaxel) Targeted Therapy 11/20/2017 Herceptin (trastuzumab) Surgery 3/12/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right Radiation Therapy 4/22/2018 Whole-breast: Breast, Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 6, 2017 04:54PM - edited Aug 6, 2017 09:04PM by Mojojennijo I'm sorry. I got the feeling the welcome was wearing off. Made a snap judgement based off of that. I didn't want to take part in something that may be hurting or offending others. I can repost my remaining questions after work. But again it is not meant to trivialize anyone's experiences",
      "MessageIndex": 15,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 05:02AM - edited Aug 12, 2017 05:03AM by Mojojennijo I am having trouble wrapping my head around the drs words. I was getting mad cause he repeated that I had breast cancer like 3 times. Which is funny cause when I went with my best friend for her biopsy results I was angry that they kept saying it to her. I called breast health already and they are just waiting for the dr to fax back the signed requisition and said would call me back today to schedule. I'm confused right now. I didn't expect this to be the outcome of the MRI. I expected to have a biopsy but not a diagnosis. So I'm gonna still cling to maybe the biopsy will show benign. My bestie said I should arm myself with knowledge but dr google is a jerk. I really just don't know what to think. I have been through this diagnosis with my two aunts, my best friend, my niece and my mother in law. But when you're faced with a probability of something that could possibly be real to yourself, it just feels weird. And ugh it had to be a Friday I am told this lol. Again thank god I work all weekend. I am going in late today so I can wait for the scheduler to call from breast center. But really I'm itching to head in and get busy taking care of my favorite demented seniors :)",
      "MessageIndex": 37,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 06:40AM - edited Aug 12, 2017 06:45AM by Mojojennijo thank you dj! I really appreacite your expertise! Yeah my diagnostic us always show benign appearance. Unless they weren't looking at the same spots that showed up on MRI. I have dense tissue, does that make it harder to see? But I have only had one area of concern show up and they thought it was a cyst. Never heard I had three. When they read the report they did say what you did. Us for location then us guided biopsy. So my dr probably shouldn't have said it's breast cancer just yet...Cause it's highly likely they will see the same thing on us as they did a few weeks ago. Again I didn't know you could diagnose bc from an MRI. I still don't feel like that's the final answer.",
      "MessageIndex": 42,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 06:49AM Mojojennijo wrote: thank you again!",
      "MessageIndex": 44,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 27, 2017 07:02PM Mojojennijo wrote: leaf, I am currently a beautiful hue of yellow, purple and red. I am always a bleeder and they only held pressure for about 5 mins. So I suspect that's why I have the huge hematoma. also my sports bra was too big (recent weight loss) so no time nearly enough compression. That's my word of advice lol make sure I your sports bra fits",
      "MessageIndex": 3,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858252",
      "Title": "Which type of biopsy if possible hemangioma Esperanza123 MTwoman"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 4, 2017 12:34AM - edited Aug 6, 2017 04:13PM by Mojojennijo",
      "MessageIndex": 2,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 4, 2017 12:17PM - edited Aug 6, 2017 04:12PM by Mojojennijo",
      "MessageIndex": 7,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 6, 2017 01:24PM Mojojennijo wrote: I realize by reading that your site has become inundated with not diagnosed but worried and I'm sorry about that. I hope you know how helpful it can be to just spit it out to people who have something to say other than \"everything is cancer you're doomed\" like dr google says. I appreciate your time reading my blabbing so much.",
      "MessageIndex": 9,
      "PostDate": "06/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 8, 2017 10:57PM Mojojennijo wrote: so glad to hear that! Thanks!!",
      "MessageIndex": 23,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 10, 2017 02:54PM Mojojennijo wrote: ok so waiting isn't fun haha I said nope I'm not gonna worry but I kinda feel like I just want to know right now. Good thing I work evenings for the next 5 days. Also this is once I'm so glad we are short staffed. There is some confusion about who's going to give me the MRI results. At the MRI they said the breast health center would be calling me in the next 24 hours. But I didn't go through a breast health center. My pcp and the radiologist talked and pcp ordered the MRI and scheduled an appointment with general surgeron next Thursday. So I have no idea who will give me the results or when. So I guess I shall wait and see! I'm really thankful for this site. It's made me less concerned. I feel more sure than ever that the odds are low of it not being benign. Thank you to all that put in the time to chat with people who feel co fused about how this line of testing works! It isn't greatly appreciated!",
      "MessageIndex": 26,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Mojojennijo wrote: This Post was deleted by Mojojennijo. Dx 8/29/2017, ILC, Left, 6cm+, Stage IIB, Grade 2, ER+/PR+, HER2+ Chemotherapy 9/26/2017 AC Targeted Therapy 11/19/2017 Perjeta (pertuzumab) Chemotherapy 11/19/2017 Taxol (paclitaxel) Targeted Therapy 11/20/2017 Herceptin (trastuzumab) Surgery 3/12/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right Radiation Therapy 4/22/2018 Whole-breast: Breast, Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 06:18AM Mojojennijo wrote: called the surgeon and they said that's why I'm coming in to him is for a biopsy but he is doing a consult and then scheduling the biopsy. So ok I'm done with my initial freak out. I know what's happening and who's doing what. I put a call in for a breast surgeon too. I can now try to put this out of my mind for the weekend.",
      "MessageIndex": 40,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 12, 2017 03:10PM Mojojennijo wrote: thank you! And will do!",
      "MessageIndex": 48,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857639",
      "Title": "questions. Just want to talk. Mojojennijo Mojojennijo"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 8, 2017 04:21AM - edited Sep 8, 2017 04:24AM by Mojojennijo I have had two annual mamos with ultrasound , and two diagnostic Mamo with ultrasound and a second opinion by a surgeon (who said he couldn't feel anything anchoring and thought it was just a cyst and nothing to worry about) in total since this started. All that time I had a lump, an indent and nipple retraction it got worse and worse.they also had been noting thickening on my Mamo. At my last annual Mamo and us (late July) i got dressed and the radiologist came in and was saying he thought it was a cyst and nothing to worry about, I showed him my breast and told him my concerns. He said he'd order an MRI to er on the side of caution. Boom breast cancer and it also showed my lymph were lit up (but only biopsy can say why). I do not know how all of them missed a 7.3cm tumor and a satellite 1cm tumor. 7.3 cm is pretty Big. I am just completely stumped and angry. I have to have 6 months of chemo before I can even have surgery. I'm a stage 2b without nodal involvement considered. I'm also having a full clinical staging work up Tuesday to get more accurate staging. Ct, and bone scan both of chest abdomen and pelvis. Then an echo. I wish they would have found this sooner. It's rather frightening. It was so easy for him to order the MRI. I had it approved in a couple days.",
      "MessageIndex": 59,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/634136",
      "Title": "Cancer missed by mammogram? joanne_elizabeth HoneyBeaw"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 27, 2017 01:57PM Mojojennijo wrote: I had lidocaine with my core biopsy that did not have epi in it. So that is an option.",
      "MessageIndex": 1,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858252",
      "Title": "Which type of biopsy if possible hemangioma Esperanza123 MTwoman"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Aug 16, 2017 12:35AM - edited Aug 16, 2017 06:43AM by Mojojennijo I currently have two radiologists who don't seem to agree. Had a MRI was apparently given a 5 (my dr actually called me when he got the results and told me I had breast cancer)and then went to a different radiologist for a location ultrasound and she had trouble seeing anything (I don't know if it's cause I'm super dense or if it's just bcause the masses are deep) but she said \"I'd call this more like a 4\" but I'm having biopsy with MRI next week. So I'm not sure what led her to downgrade if she can't see anything. Or if that's why she did. I don't know how that works. Or if it's because I didn't tell her until after she said that that I had retraction, a dent, and spontaneous discharge (no color), if that plays a factor. Or if it's because the lump I am feeling is a cyst and the suspicious areas are not near that. So that would leave me without a palpable mass I guess. Unless you count the hardening under the dent. Haha I don't know. But I'm just gonna wait and see what the biopsy says. Cause I've been trying to figure it out and it's bugging me. Bottom line is they scheduled me for the first available hold slot for MRI guided biopsy and stents making me sit and wait long. Maybe my surgeon appointment Thursday will have more info.",
      "MessageIndex": 3,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857943",
      "Title": "Wrong Bi-rad Lmcnz MTwoman"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 4, 2017 10:42AM - edited Sep 4, 2017 10:43AM by Mojojennijo I feel your frustration. I had for the last year been asking my dr why my nipple had been starting to pull in and why I had a growing dent in my breast. They kept looking at the dent in ultrasound and saying they just saw a cyst. My mamos reported retraction and thickening. I think I've had 2 diagnostic and two yearly sets in all of this. I kept getting told to come back in two months. I even went to a surgeon for a second opinion who said it was just fat causing my weird looking boob. At my last set which was my annual back in July the radiologist came in to talk to me and said he wasn't especially worried. I showed him my breast itself and he ordered an MRI. They called me on that and told me they were sure it was bc. They also said the scan showed nodal involvement. Biopsy confirmed ILC. I know ILC is sneaky but I had symptoms. At my biopsy the radiologist said my previous mamos and us had been looking in thebwrong place on the diagnostic. I'm beyond frustrated and angry about this",
      "MessageIndex": 7,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858413",
      "Title": "A 2nd Tumor Left Inside After A Lumpectomy MFPM MFPM"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 8, 2017 03:04AM - edited Sep 8, 2017 03:37AM by Mojojennijo did you get a hematoma? The entire top and sides of my breast was a hematoma after my two were taken, I just kept bleeding and bleeding into my boob. I had it done on the 24th of August and am still purple and sore when I bump it or wear the wrong bra. I had a port placed yesterday (today still for me cause I'm still awake but technically yesterday) and The biopsy was way worse! However it's currently 130am and I'm up cause laying down is so uncomfortable. Probably not going to sleep tonight. My port is in my right side of my chest and my not comfy to squish cancerous biopsied breast in on my left.so no comfy side to sleep on tonight. But I think that's the norm. Glad you're biopsy site is feeling better! Hoping for peace in your time of waiting and for benign results!",
      "MessageIndex": 17,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858467",
      "Title": "Just had biopsy..SO MUCH PAIN swg EveryTime"
    },
    {
      "AuthorID": "Mojojennijo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251261/profile",
      "Content": "Sep 1, 2017 10:24PM Mojojennijo wrote: I had a biopsy on Thursday last week and was told that they would have results Monday or Tuesday at the latest. I asked to have the results forwarded to my pcp and surgeon. The surgeon called me Tuesday with results (I preferred a call instead of waiting to come in so I could digest it and have my questions ready). My pcp called me Wednesday with results. Anyways both of those drs prepared me for what was likely to be found (I was a birads 5) so it really wasn't a surprise. However I was on vacation this week so I felt like I had my phone glued to my hand all of Monday and Tuesday cause I didn't get a call till Tuesday at the end of the day. I didn't answer the call when my pcp called cause I went back to enjoying my vacation. I just called him back later and left him a message that I already knew. So in the end, I was prepared for the results I got ahead of time, so for me a call was best. I'll go in Tuesday to see the surgeon and get the rest of my report as they only had preliminary when they called. Waiting is hard! Hang in there! Hoping for benign results for you!",
      "MessageIndex": 3,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858348",
      "Title": "How would you rather receive your results? FarAwayToo Susug"
    }
  ]
}