{
  "AuthorID": "Mojo56",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238171/profile",
  "Posts": [
    {
      "AuthorID": "Mojo56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238171/profile",
      "Content": "Apr 4, 2017 09:17AM Mojo56 wrote: hi all I had a single modified radical mastectomy on March 29. I had axillary lymph dissection and was told by surgeon that he took levels 1 and 2. I am still waiting to hear the pathology results although it has been a week. Does anyone else have experience with the results from one of these and also how treatment went from there? Thanks anxious ",
      "MessageIndex": 625,
      "PostDate": "04/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "Mojo56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238171/profile",
      "Content": "Sep 26, 2016 04:02PM Mojo56 wrote: Thanks. I started right behind you all on 7/7. I too am starting with 4 rounds of AC dosage dense. I am also not really willing to risk the side effects and the minimal percentages associated with taxotere after surgery. It is still up in the air whether I will have a single or double mastectomy. My disease is multifocal and as such they must have missed it along the line because there is a lot of cancer in just one breast. I am getting a second opinion on the surgery portion. Thanks for all of your posts. It helps to know I am not alone.",
      "MessageIndex": 909,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "Mojo56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238171/profile",
      "Content": "Sep 22, 2016 10:45PM - edited Sep 22, 2016 10:47PM by Mojo56 Well I started on 7-7. My team chose to start with chem, reassess after the first 4 rounds of DD AC. I will likely have a mastectomy then or go on to 12 rounds of T. I also was diagnosed with Multicentric. 5 tumors altogether. I havent heard much about anyone else with multicentric. I did very well on the first two rounds. I was able to work all last week and two days after the port was put it and I had my first round of chemo. I consider myself pretty lucky. Wishing you all the best.",
      "MessageIndex": 674,
      "PostDate": "22/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    }
  ]
}