{
  "AuthorID": "Molly09",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234094/profile",
  "Posts": [
    {
      "AuthorID": "Molly09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234094/profile",
      "Content": "Nov 8, 2016 09:41AM Molly09 wrote: Hi gmmiph, Thanks for the info on the mets thread, which I'll look up and for the prayers. I had no symptoms before we found the mets. It was discovered in a routine Dexa Scan which I have every two years for my Osteoperosis. Thank God the only place in my bones was in the L2 which shows in the Dexa Scan was started on hormone therapy immediately. Within a month I also had radiation on the L2 both because pain had started and to stabilize the cancer. What we didn't do and I hope I don't regret was my medical team did not check my internal organs for signs of Mets. We don't know if it returned to my liver before it was in my spine. It was found in my liver, after I had muscle spasms in my back and they were trying to figure how why the pain was there. In a lumbar MRI, the liver was somewhat visible and then another MRI of my liver was done. A word to the wise would be if mets are suspected, an ultrasound of all internal organs, in addition to the bloodwork and bone scan should be requested. Since this thread is for the first timers, make sure you have a conversation with your specialists about radiation exposure to ensure you don't exceed your radiation load in case radiation is part of your care plan.",
      "MessageIndex": 199,
      "PostDate": "08/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Molly09",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234094/profile",
      "Content": "Nov 8, 2016 12:38AM Molly09 wrote: Hi everyone, I'm starting chemo next Tuesday, November 15th. My port goes in a couple days from now on Wed. the 9th. This is my second round of breast cancer, the first was April of 1995. I've done well until the metastasized Breast Cancer was found 2014. We found it again in my L2 vertebrae and have been on Letrozole and Xgeva since then. I'm continuing on those meds, as one is my hormone therapy and the other is for my bones. Last week it was confirmed that it is also in my liver, so now we are going to add the chemo Abraxane. I'm nervous about the possible drug interaction and somewhat frustrated that I'll be on chemo over the holidays. Next week I'll know more about how this is going to go and hopefully I'll be able to enjoy my family while they are visiting. I hope all of us can enjoy the holidays, and our daily lives as we go through this challenge. Being a Christian I know that God won't require anything of me that He won't help me to get through.",
      "MessageIndex": 188,
      "PostDate": "08/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    }
  ]
}