{
  "AuthorID": "MollyWoods",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141139/profile",
  "Posts": [
    {
      "AuthorID": "MollyWoods",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141139/profile",
      "Content": "Jan 4, 2012 03:17PM MollyWoods wrote: Sorry for the late reply. I went to my local breast clinic- they told me it was most likely to be eczema (as it is more common than you'd think to have eczema in one nipple my doctor said), but there was a chance it was Paget's. I had to have a biopsy as this is the only way to tell the difference. It involves and injection of local anaesthetic and I don't know after that I didn't dare look! I get my results on Friday at 10.10. I've had to wait 10 days. I am very nervous. My Mum is a nurse and she said it's almost unseen in people as young as us as it is very rare anyway and in the small percentage of the population that get it the average age is 60-65. Don't worry too much but definately get it checked out x",
      "MessageIndex": 4,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779513",
      "Title": "I am very worried I have Paget's disease of the nipple MollyWoods Katy_a"
    },
    {
      "AuthorID": "MollyWoods",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141139/profile",
      "Content": "MollyWoods wrote: A few months ago I started to get an itchy rash around my right nipple. I hate doctors and generally believe the body will clear up most stuff by itself, so I left it for about a month but it got worse and worse. The itching was dreadful, my skin was flaking off and there was some sort of watery substance underneath and sometimes blood. I made an appointment and my doctor seemed concerned because it looked awful, and of course because it was only in one nipple. She gave me a cream to help the symptoms and reffered me to a breast clinic. I was stupid and for varying reasons didn't make my appointments. The cream helped clear it up but it still itched a lot, and now it's getting bad again. Today I noticed some discolouration around my nipple, only very light, but there is a definate purple/blue darkening. So I decided to do some research, and my symptoms matched Paget's very closely. I got even more scared when it said the nipple can line up with the skin (and not \"stick out\" as normal) as this has also happened to me, but I am not sure if my breasts do this normally anyway. I am making another appointment tomorrow but was hoping someone could tell me the likelihood of me having the disease or what else it might be. I am 19 years old. There are a lot of other things that it could be, but allergies would effect both nipples, as would eczema (most of the time), and a lot of infections are associated with breast feeding and I am not pregnant, nor have I ever had a baby. I am on the pill, but from the side effects portion of the leaflet it says there is an increased risk of breast cancer and that's pretty much it when it comes to this sort of side effect. I am really scared because the treatment would be surgery- I would loose my whole right breast- a long with radiation and chemo. It's a very rare form of breast cancer but someone has to get it, and I'm sure the chance of me having it rises with these symtpoms. Please somebody help D'= x  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779513",
      "Title": "I am very worried I have Paget's disease of the nipple MollyWoods Katy_a"
    },
    {
      "AuthorID": "MollyWoods",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141139/profile",
      "Content": "Jan 5, 2012 03:47PM MollyWoods wrote: Thanks so much guys for your support. I will let you all know tomorrow my news. It has been a nerve wracking 10 days! I am feeling kind of positive that I'll be ok, but I keep going through patches of doubt. I hope you all had a good Christmas and have a great New Year x",
      "MessageIndex": 7,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779513",
      "Title": "I am very worried I have Paget's disease of the nipple MollyWoods Katy_a"
    },
    {
      "AuthorID": "MollyWoods",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141139/profile",
      "Content": "Jan 6, 2012 11:36AM MollyWoods wrote: Just to let you all know I just have eczema. Went in and she told me before she even shut the door which is good because I was almost in tears. Thanks so much for your support. tek0218 let us know what happens with your results. I am sure it will be fine x",
      "MessageIndex": 8,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779513",
      "Title": "I am very worried I have Paget's disease of the nipple MollyWoods Katy_a"
    }
  ]
}