{
  "AuthorID": "mollyann",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
  "Posts": [
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jun 22, 2011 03:02PM mollyann wrote: Julie, Your father isn't crazy. I use iodine tablets as part of my integrative breast cancer protocol and I've started sweating during exhertion for the first time since I was 12. I didn't know I had low thyroid until I felt better and my temp went up. My dry skin went away. No hand or body lotion needed now--just face cream. There is a 5,000 member iodine group discussion on Yahoo. My blood tests always showed my thyroid as normal. Hah! I didn't know a good doctor evaluates your thyroid by symptoms as the blood tests are unreliable. I can vouch for MBJ knowing her stuff! She is fortunate to have access to one of the best integrative docs and she has researched carefully. Because of my sister I get to attend integrative medical conferences and they all back up this information-- you can check.",
      "MessageIndex": 57,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770606",
      "Title": "Low Body Temperature anyone? MBJ mapat"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Apr 29, 2010 08:38AM - edited Apr 29, 2010 08:39AM by mollyann I will save my pros for when I am appointed to the Supreme Court. We grow up thinking everybody is looking at us but they really aren't.",
      "MessageIndex": 57,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/751436",
      "Title": "I'd rather be flat than fake...I think. Suzybelle robinlbe"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Sep 11, 2010 07:38PM mollyann wrote: Ana, This is the strategy they are using at the Siteman Cancer Center in St. Louis. The opposite of androgen therapy. See Video: http://news.wustl.edu/news/Pages/13124.aspx",
      "MessageIndex": 3,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757877",
      "Title": "ANYBODY ON ANDROGEN THERAPY ana Annie4"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jul 3, 2010 11:13AM - edited Jul 3, 2010 11:14AM by mollyann I believe adjuvant rads is effective in about ten women out of a hundred for recurrence in the same breast within the next 5 years. It doesn't have any (OS) overall survival benefit (death from all causes). As soon as I found out there was no survival benefit, I declined rads. I have run into two women whose radiation oncologists actually said their local recurrence was caused by rads. I don't know how they can tell this--- maybe there's some characteristics to rads-caused tumors? But the big concern is how rads impacts the coronary arteries in ten or twenty years no matter which side was radiated.",
      "MessageIndex": 1,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754894",
      "Title": "Mucinous Carcinoma - Can I skip rads? lfc123456 mollyann"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jul 3, 2010 06:26PM - edited Jul 3, 2010 06:26PM by mollyann Hi ifc, No I don't feel any regret. Why would I? I was only interested in survival, not local recurrence. So far, so good on refusing rads. The 1 out of 10 statistical benefit of radiation only lasts five years anyway. I'm beyond five years. Knock wood. Hymil, many women have gone full-blast everything to nuke so-called \"escaped cells\" and their disease has progressed anyway. So I don't get the feather dusting /Hoover analogy. Best of luck with your decision-making. Sometimes I think the decisions are harder than cancer. But once you've made them based on evidence you can tell yourself, I made the most educated choice and I'm not looking back.",
      "MessageIndex": 6,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754894",
      "Title": "Mucinous Carcinoma - Can I skip rads? lfc123456 mollyann"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jan 29, 2011 06:46PM mollyann wrote: Lynn, Could it be a nerve pain? If tradtional painkillers don't affect it (advil, aspirin, vicodin), it may be a nerve. What do you think?",
      "MessageIndex": 24,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762717",
      "Title": "Not sure if this is serious or not? Lynn97 Sherryc"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jan 7, 2010 08:24AM mollyann wrote: I think somebody else mentioned this but I've forgotten. Is there a blouse/shirt with safari pockets that I can stuff? I was small breasted to begin with so I don't need much but I do need something. I was wondering if Speigel or Eddie Bauer catalogs had this kind of normal clothing we bilats could stuff. Molly",
      "MessageIndex": 269,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/737036",
      "Title": "Wardrobe pics for boobless days mom2two ShadePink"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jan 15, 2011 11:41AM - edited Jan 15, 2011 11:44AM by mollyann Iago, You were just diagnosed so I can understand how you don't know about all the earlier studies that show the same thing that the most recent study proved. The tumor biology is the ultimate staging device. You don't want to risk being crippled by an additional high risk procedure when you already know from your pathology report that you will or will not get chemo. Please take Makingway's advice and review the earlier studies. http://breastcancerchoices.org/faqlymph.html http://www.stepup-speakout.org/   ",
      "MessageIndex": 13,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jan 15, 2011 01:29PM - edited Jan 15, 2011 01:30PM by mollyann To all reading this board:  Here is a short video that spells out the 2010 research findings that axillary dissection is obsolete and dangerous. http://www.youtube.com/watch?v=Jnq-LVlgyIw If you are not convinced by the medical evidence, read at all the threads on women suffering with lymphedema.",
      "MessageIndex": 19,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jan 15, 2011 10:42PM - edited Apr 17, 2011 12:48AM by mollyann  You reply to messages before reading the evidence from peer-review literature. You have already made up your mind so you feel you're above reading the scientific record since Halstead. Most people are like you, they get the surgery without researching and their doctors don't provide full disclosure. I'm sorry you got lymphedema.  What I object to is your trying to recruit people into repeating your mistake and encouraging them to disregard the medical findings.",
      "MessageIndex": 39,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Dec 30, 2009 09:51AM mollyann wrote: i drove a few days after my bi-lat but I didn't have lymph node surgery. That makes a big difference in pain. My friend had the node surgery w/ her bi-lat and she was still in the hospital taking morphene a few days later. ",
      "MessageIndex": 8,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/745974",
      "Title": "When were you able to drive etc after surgery? cleomoon mollyann"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Oct 19, 2010 06:11PM mollyann wrote: Barb, I use a tiny bit testosterone cream applied to the labia three times a week. Great for the libido.",
      "MessageIndex": 19,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759583",
      "Title": "Chemo Brain Ok, but chemo vagina? Help!!!! Shanagirl BlondiShanagirl"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jan 15, 2011 09:56PM - edited Apr 17, 2011 12:49AM by mollyann Every study finds the same thing. You can follow the studies back through Fisher and Halstead. Remember them? And as far as not changing the surgery rules, there are no rules. Many of the more educated surgeons absolutely will not invade the nodes because there is no survival value. The node invaders will be left behind in the medical world as butchers who crippled their patients. I would not want to be the last patient a surgeon operated on and took nodes before he changed his mind and modernized his procedures.",
      "MessageIndex": 37,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jan 15, 2011 10:17AM - edited Jan 15, 2011 10:18AM by mollyann From the NY Times:  No survival value in axillary node removal. An obsolete procedure. \"The more extensive removal, called axillary node dissection, can cause restricted mobility of the arm and painfully swollen arms or fingers. The study presented here involved 991 women who had had lumpectomies, radiation therapy and a positive sentinel lymph node. Half had the other lymph nodes removed and the others did not. After five years there was no difference in survival or disease recurrence between the two groups. Some 82.2 percent of the women who had the dissection were alive and disease free compared with 83.8 percent of those who did not. Cancer recurred in the breast or nearby in 4.3 percent of those who had the operation and 3.4 percent in those who did not. \"The evidence is overwhelming that the operation might not be necessary,\" the lead investigator, Dr. Armando Giuliano of the John Wayne Cancer Institute in Santa Monica, Calif., said.\"",
      "MessageIndex": 9,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Jan 15, 2011 10:41AM - edited Jan 15, 2011 10:49AM by mollyann See the studies. Axillary node dissection is an obsolete staging technique. The pathology report from the tumor has become so sophisticated that they don't need to do a procedure that causes lymphedema 49% of the time. You can stage without it. At San Antonio Breast Cancer Symposium they discussed that it was going to take time for some surgeons to stop doing this unnecessary but profitable procedure.",
      "MessageIndex": 11,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Feb 10, 2011 08:59AM mollyann wrote: Does anybody know how long it takes for them to change the cancer treatment guidelines to fit the research findings? The surgical oncologists' group is saying they will meet on this.",
      "MessageIndex": 69,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Oct 19, 2010 06:21PM - edited Aug 20, 2013 05:58AM by mollyann My doctor is an integrative medicine doctor. Some of these doctors prescribe bioidentical hormones to breast cancer patients. They have proven that it is the synthetic progestin that is the problem, not the estrogen or testosterone. It takes a while (ten years?) for mainstream doctors to catch up with the evidence.",
      "MessageIndex": 21,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759583",
      "Title": "Chemo Brain Ok, but chemo vagina? Help!!!! Shanagirl BlondiShanagirl"
    },
    {
      "AuthorID": "mollyann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79508/profile",
      "Content": "Sep 24, 2010 01:44AM - edited Aug 20, 2013 05:48AM by mollyann Simple masts are being done with local anesthesia and sedation in a half hour to 45 minutes. She will have drains and pain medication to go home with. But really, you want her to be in the hospital as short a time as possible. Less chance of infection or complication. Staying longer than absolutely needed in the hospital is risky. The hospital stay for a heart bypass is 9 days here-- and they crack all your ribs to get to your heart. The stay used to be a month.",
      "MessageIndex": 3,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/758456",
      "Title": "Aftercare,or any care TigerPuss CoolBreeze"
    }
  ]
}