{
  "AuthorID": "Molly2001",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55029/profile",
  "Posts": [
    {
      "AuthorID": "Molly2001",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55029/profile",
      "Content": "Molly2001 wrote: Yesterday I met with my team of doctors and I must say it wasn't how I expected. I thought they would give me alot more info than what they did.... they said I had invasive ductal breast cancer and they did locate the swollen node under my arm. The radiologist said my tumors were 2.4 cm and 6mm but yesterday these drs examined me and said 4 cm... I about dropped my teeth! They noticed the red area and said that there was some inflammation but did not say what that was due to... they both want to do chemo first. 6-8 treatments, one a week and then surgery. I suppose because of the node and inflammation. I had never heard of chemo first but then I don't really know that much about it. I had read on here about the stages, etc but I had to ask and they said I would say 2 and then they looked at one another. I thought that would be what the core biopsy would show... I have gone to the bathroom so much my lower stomach is just tender and sore... I hope that this will clear up before chemo starts... I am just thinking every ache and pain I have now is all attributed to cancer, is that normal? I just can't get my jitters to go away. I do take a sleeping pill at night or I think I couldn't manage at all. Hope all of u have a nice weekend! Oh I went and picked out a wig today... that was not too fun because my hair is medium length in a bob and very thick so they kept poofing up like Dolly Pardon's wig! I have dark brown hair so I am going with that...but might just get a blonde one too! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/679039",
      "Title": "chemo first?? Molly2001 whoopsiedoodles"
    },
    {
      "AuthorID": "Molly2001",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55029/profile",
      "Content": "Aug 19, 2007 06:02AM Molly2001 wrote:",
      "MessageIndex": 6,
      "PostDate": "19/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/679039",
      "Title": "chemo first?? Molly2001 whoopsiedoodles"
    },
    {
      "AuthorID": "Molly2001",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55029/profile",
      "Content": "Aug 17, 2007 08:10PM Molly2001 wrote:",
      "MessageIndex": 3,
      "PostDate": "17/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/679039",
      "Title": "chemo first?? Molly2001 whoopsiedoodles"
    }
  ]
}