{
  "AuthorID": "Mom2MissBee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118129/profile",
  "Posts": [
    {
      "AuthorID": "Mom2MissBee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118129/profile",
      "Content": "Jan 7, 2011 08:53PM Mom2MissBee wrote: I remembered I \"knew\" of someone from another internet forum that worked at a Rapid Diagnostic Centre in Toronto.  Emailed her yesterday and she gave me info...my doc sent a referral this morning...and this afternoon, they called to said they'll see me!  I just have to courier my past images on Monday and once received, they generally see patients within a week.   I dread the wait still...but it is so incredibly better than waiting until mid-Feb!   ",
      "MessageIndex": 8,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762975",
      "Title": "focal asymmetry - new and worried Mom2MissBee marie5890"
    },
    {
      "AuthorID": "Mom2MissBee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118129/profile",
      "Content": "Jan 6, 2011 04:14PM Mom2MissBee wrote: mdoak - Thanks for that post - encouraging - and I'm so hoping this is the issue.  meme31 - I just called the breast assessment clinic and while the guy was super empathetic, he said they are \"really busy\" and my test (lateral and spot magnification views and an ultrasound) was extra hard to reschedule because it involves two things.  And, here I was going on the theory that the wait was a good sign... :(  I hate this.  I don't know how I'm going to make it through the next month I'm so on-edge already.  I think I've spent more time crying over the past few days than I've spent awake. ",
      "MessageIndex": 6,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762975",
      "Title": "focal asymmetry - new and worried Mom2MissBee marie5890"
    },
    {
      "AuthorID": "Mom2MissBee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118129/profile",
      "Content": "Jan 13, 2011 06:28PM Mom2MissBee wrote: marie5890... I'm not sure if you'll come back in to this post but, I've been thinking of you and wondering the biopsy went.   Thank you to all who've written.  This forum is great...although, I must stop myself from reading too much.  I tend to jump to all sorts of conclusions.  I continue to have a wee, ever so slight soreness in the left breast area (often where I think the focal asymmetry is location).  I'm not sure if that is psychosomatic or whether something is in there...and hurting...   Still waiting to hear from the Toronto clinic...waiting is the worst.  :(   ",
      "MessageIndex": 10,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762975",
      "Title": "focal asymmetry - new and worried Mom2MissBee marie5890"
    },
    {
      "AuthorID": "Mom2MissBee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118129/profile",
      "Content": "Jan 18, 2011 12:34AM Mom2MissBee wrote: Hi - Wanted to report back in case anyone comes looking for \"focal asymmetry\" posts as I did!   I'm relieved to report that NOTHING was seen in my breast!  Normal, healthy....just tissue folded strangely.   The past two weeks have been agonizing and I thank this board for the solace it provided me.  I read many many posts (probably too many, if I'm being honest...;) Thank you to all who post and provide such kind and caring words of wisdom.   Thoughts and prayers to all.  You are all such strong women!  ",
      "MessageIndex": 12,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762975",
      "Title": "focal asymmetry - new and worried Mom2MissBee marie5890"
    },
    {
      "AuthorID": "Mom2MissBee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118129/profile",
      "Content": "Mom2MissBee wrote: Hi, I recently had my annual screening mammogram and it came back showing a focal asymmetry in the upper left quadrant (middle).  I'm freaking out.  My mom was diagnosed with BC at age 38 (I'm 36) and passed away from it.  My follow-up appt isn't until Feb 17 - for a cone impression (I think...I left the mammo results at work) and ultrasound.    There were no calcifications and the ranking is BIRADS 0.    My GP says that she's not panicked and hopes I'm not either... but I MASSIVELY AM!  I've had two previous mammograms that didn't show anything.    On top of all this, I've been going through a series of pelvic ultrasounds for fibroids, cysts etc...all of which are relatively new too.  I can't help but wonder if there is a connection?!   Would love to hear any experiences of focal asymmetry findings.... Ever since I've heard the finding I've had a pain in that area of my breast.  Could be cyclical...or stress-related, I guess....  Sorry this post is so jumbled!  And, thanks for any info you can provide!    Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762975",
      "Title": "focal asymmetry - new and worried Mom2MissBee marie5890"
    },
    {
      "AuthorID": "Mom2MissBee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118129/profile",
      "Content": "Jan 6, 2011 02:12AM Mom2MissBee wrote: Thanks for your quick replies!   marie - For certain, I'm following up...I wish I didn't have to wait until Feb 17!  My doctor said that the wait is reassuring for her...usually if the radiologists are very concerned, they have people back within the week.  She said she's seen biopsies on the spot.  Sending you good thoughts for your biopsy next week.... hopefloatsagain - I'm so scared of genetic testing yet, I know it is something I must deal with.  My mom is the only family member who has/had BC.  Right now, I feel overwhelmed with everything.  Once I figure out what this is (and hopefully, get a clean bill of health), I'll be in a better place to really consider it...   Can I ask you though....what about the counselling was so helpful (I have some idea, but I'm curious and wanting to learn more!)     ",
      "MessageIndex": 3,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762975",
      "Title": "focal asymmetry - new and worried Mom2MissBee marie5890"
    }
  ]
}