{
  "AuthorID": "Mom2JJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141601/profile",
  "Posts": [
    {
      "AuthorID": "Mom2JJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141601/profile",
      "Content": "Feb 21, 2012 05:45AM Mom2JJ wrote: All, I am in the February TC group, but am hoping to get some insight from this group. I'm scheduled for my second chemo on Thursday. I felt terrific all last week, but ended the week with two long days (a business trip to New York on Friday and then a gymnastics meet for my daughters on Saturday). I took it very easy on Sunday, but I am sitting here at work feeling really weary. I don't have that awful fatigue that we get after chemo, but I just feel soooooo tired. Has anyone else had this experience? I have been exercising (45 minutes on the treadmill yesterday) but today I'm thinking I shouldn't push at all. Any advice from those of you wrapping up your TC treatments?",
      "MessageIndex": 1183,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Mom2JJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141601/profile",
      "Content": "Feb 21, 2012 02:28AM Mom2JJ wrote: ckk, I gave up fighting the hot flashes and agreed to take Effexor. It has reduced them about 50% in intensity without any other obvious side effects. It does cause drowsiness, so I take it at night with some food. My MO approved it during chemo. You might try it.",
      "MessageIndex": 1181,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "Mom2JJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141601/profile",
      "Content": "Dec 21, 2011 10:45PM Mom2JJ wrote: I am just joining. I am scheduled for a bilateral mastectomy on December 28th with DIEP reconstruction if my SNB goes well. If not, I have to wait while undergoing radiation/chemo. This is a lot to swallow in a short time (this process started for me on November 22nd) but I am doing my best. From reading the posts, it seems that many of you have waited several months for surgery, so I am very fortunate -- the stress of waiting is so over the top. I am also so concerned for my daughters, who are only seven and are on their second mom as we adopted them from China. I can't imagine how difficult the next few years will be if they lose their second mom. I am lidocaine refractory, so my most immediate concern is making it through the SNB, which is scheduled immediately before the mastectomy. I have had three biopsies thus far, each more painful than the previous one, as the lidocane does not work. I tell myself that in the scheme of things, this is minor. Anyone else scheduled for next week? Let's talk now and regroup when we rejoin the world post-surgery.",
      "MessageIndex": 135,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777059",
      "Title": "Mastectomy Dec 2011 hawaiik Blessings2011"
    }
  ]
}