{
  "AuthorID": "Mom2boys1900",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188290/profile",
  "Posts": [{
    "AuthorID": "Mom2boys1900",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188290/profile",
    "Content": "Mom2boys1900 wrote: About a month ago I went to my OBGYN because I woke up and it looked like I had lactated on my pajamas with some tiny blood spots on the right side. He tested my prolactin levels and they were normal so he sent me to see a Breast Surgeon. I didn't lactatce again, but did have another episode of bloody discharge from my right breast. Flash back a year prior I had a fibroadanoma found in my left breast. So the breast surgeon had me get a follow up mammogram to check the fibro and it was unchanged and the mammogram was otherwise clear. The surgeon also had the ultrasound tech check a place on my right breast were I have chronic noncyclic pain and ofcourse the nipple area because of the discharge. The only thing they see is an area of very dense breast tissue were I am having the pain and the ultrasound didn't see anything in that area of dense tissue. The Breast Surgeon wanted me to have an MRI just incase the ultrasound is missing something. ( my fibor was seen on mammo, but not on Ultrasound so they biopsied it). Well, the insurance has denied the MRI even with a peer to peer call from the surgeon, because I am only 37 with no history of breast cancer. Eventhough I have bloody discharge and an area of dense tissue. So now I am to see the Breast Surgeon again next week. I just don't know what to think. I am stressed that something really is wrong. I just want to know for sure that there's nothing hiding in that area and why did I have blood come out of my breast. I also noticed yesterday that a lymph node in my arm pit is swollen.  Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "19/09/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811264",
    "Title": "What to do next? Mom2boys1900 Mom2boys1900"
  }]
}