{
  "AuthorID": "mom2twins34",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
  "Posts": [
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Oct 24, 2011 12:59PM mom2twins34 wrote: It is important that she let her oncologist know.  When mine was progressing a bit too much for my oncologist's liking, he had me take a short break from the Taxol.  Not sure if it was a coincidence, but that seemed to help keep it from getting worse...  Good luck with everything! ",
      "MessageIndex": 1,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/776966",
      "Title": "taxol and neuropathy momand2kids SheriA"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Apr 25, 2012 01:10AM mom2twins34 wrote: So glad you got good news! And so glad you like your new oncologist--it really helps to have someone you like and someone who listens to your concerns--so glad you've found that, especially after your last one... :-) ",
      "MessageIndex": 23,
      "PostDate": "25/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786224",
      "Title": "Red blotch....could it be :( jennyboog pupfoster1"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Apr 21, 2012 07:28PM mom2twins34 wrote: Hi Jenny-  No advice, just wanted you to know someone else is thinking of you.  It's so hard to strike that balance between being hopeful and being fearful--I know I struggle with it, too...   You are doing the right thing by getting it checked out.  I hope it is something benign...  You'll be in my thoughts!  Keep us posted... ",
      "MessageIndex": 6,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786224",
      "Title": "Red blotch....could it be :( jennyboog pupfoster1"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "May 18, 2012 11:54PM mom2twins34 wrote: Oh, Allison, I'm so sad to see this news...  What a difficult blow.  Cancer is such a beast.  You are in my thoughts...   Gentle hugs as you heal from your surgery... ",
      "MessageIndex": 25,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/787491",
      "Title": "having surgery tomorrow allisontom911 Momine"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "May 16, 2012 09:47PM mom2twins34 wrote: So glad it is benign!!!  :-)",
      "MessageIndex": 19,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787218",
      "Title": "I really hope there's nothing lurking!!!!!! faithfulheart AnacortesGirl"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Apr 21, 2013 04:31PM mom2twins34 wrote: Good luck, Tammie... I am SO glad you are getting it checked out as Binney advised. She saved my life last year when she suggested that I had cellulitis -- and I hadn't a clue as to what I was dealing with. We are so fortunate to have her here... Binney is right, if it is cellulitis, time is of the essence. But whatever this turns out to be, I am so glad you are pursuing it and not waiting. And I am so sorry you have this added worry. Warmest thoughts are with you...",
      "MessageIndex": 7,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/803609",
      "Title": "Unexplained swelling in leg? tammie mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "May 15, 2012 02:05AM mom2twins34 wrote: Best wishes, Allison...  I hope your surgery goes smoothly & hope it is something benign...  You will be in my thoughts... Hugs to you... ",
      "MessageIndex": 1,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/787491",
      "Title": "having surgery tomorrow allisontom911 Momine"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "May 16, 2012 10:40PM mom2twins34 wrote: Sending wishes for a clean report...",
      "MessageIndex": 12,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/787491",
      "Title": "having surgery tomorrow allisontom911 Momine"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Jan 24, 2012 10:49PM mom2twins34 wrote: Hi Lisa, I also had neoadjuvant chemo.  I was told that the reason was two-fold.  1) I was considered inoperable because of the size of the tumor area & because I had chest wall invasion and 2) because of extensive lymph node involvement.   I did dose-dense AC and then Taxol before I had my BMX (followed by more Taxol, rads, herceptin, tamoxifen after surgery).  I had a great response to the chemo, but I can definitely relate to your feelings of how rough it is.  I know not everyone has the same side effects, but I thought the chemo itself was going to kill me.  The fatigue was overwhelming, I had to do daily Neupogen injections because my counts were so poor, and I was very nauseous and vomiting so much that after a few emergency trips I ended up requiring home IV hydration for the length of the treatment.  I know you asked about shortness of breath--this was a big one for me.  The shortness of breath coupled with a great deal of leg and abdominal swelling actually gave us a congestive heart failure scare--my MOs were almost convinced that I had developed CHF and that we'd have to stop treatment.  Thankfully, we learned this wasn't the case, just that this was how my body reacted to the A & C especially, but it was a scary time.   To be perfectly honest, there were days when I didn't think I'd survive the chemo.  I only tell you this because I did make it through...  And it was a really effective protocol for me & prepared me well for the surgery (I'm hoping it is just as effective for you!).  It did take a long time to recuperate (I still struggle with fatigue and chemo brain), but I started to notice a big improvement in side effects even weeks after finishing.   Hang in there...  You are almost there...  I know it's tough, but we are all here for you...  Big hugs!   P.S. You asked if anyone else had hot flashes--yes!  And lots of night sweats, too.  This also improved for me within a couple of months of finishing chemo.  ",
      "MessageIndex": 15,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781526",
      "Title": "Anyone else doing TAC neoadjuvant chemotherapy lisa224 GeorgiaRai"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Jan 4, 2012 02:28PM mom2twins34 wrote: Hi Lyn, It will get better...  I had my bmx in sept. 2010 and can't remember when I adjusted to my new body.  I think it happened gradually, but for a long time I would walk by a mirror and see my missing chest and my bald head & think 'who the hell is that?'  Eventually it just got easier.  I find the foob too uncomfortable on the side where the surgery was more invasive, so instead of just wearing one, I am just flat-chested most of the time (unless it's a special occasion & I break them out of their boxes!)  I NEVER thought I would be okay with that, especially at 34 (now 35), but, as you certainly know, cancer changes everything & forces you to accept a new 'normal'.  For me that means flat, but that's definitely not true for everyone.  I know a lot of women who can wear their foobs just fine...  You just need to give your body time to heal.  It's been through hell!   These first few months are the hardest...  Plus, you went right from diagnosis to surgery with very little time to digest it all--and it is a lot!  Even though all of the hoopla has died down, you still aren't recovered--physically or emotionally.  Though it may be hard for people in your life to understand that, remember that there are a lot of wonderful people here who understand...  Please be kind to yourself and remember that it's okay to grieve what you've just lost...  We are all here for you...     Hugs... ",
      "MessageIndex": 6,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780431",
      "Title": "processing what just happened lynliz mebmarj"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Dec 21, 2011 01:21PM mom2twins34 wrote: So sad to lose another strong and courageous woman to this terrible disease...  May she rest in peace and may this encourage more people to fight for a cure...  ",
      "MessageIndex": 22,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779805",
      "Title": "Former miss Venezuelan dies at 28 Amyf Juliebell22"
    },
    {
      "AuthorID": "mom2twins34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "mom2twins34 wrote: Hi everyone, Rather than consult with Dr. Google, I thought I'd ask for more trusted opinions.  Has anyone experienced pain & had small lumps in their forearm?  It's been going on for about a month or so now (and seems to be getting worse) on my left side--the side where my axillary lymph nodes were positive & removed.  I don't know if it makes a difference, but I also had extracapsullary extension from some of the nodes but never really understood what this meant, if anything, with respect to any kind of recurrence in the area? And, silly me, I've been trying to avoid Dr. Google so much that I never bothered to see where other lymph nodes in the arm are until today, so I feel a bit ignorant.  It looks as though there is a chain of lymph nodes right where I'm experiencing the pain & lumps.  Can the cancer spread down the arm through lymph nodes?--stupid question! I know it can go anywhere it wants!--I honestly hadn't even thought of the arm as a possible site for recurrence before because I haven't really heard of that.  Plus, after surgery, chemo & radiation to the axilla, etc. I didn't think the rest of the arm was anything to worry about. At first I thought it might be lymphadema, though I wear my ugly sleeves and hand gauntlets all the time & I just had my physical therapist measure me because I was concerned & she said there is no change in size--and I've only experienced minor swelling in the upper arm, not in the forearm, all along.  And when I went for my Herceptin, the nurses at the hospital said they saw no signs of infection but could feel the lumps. Has anyone else experienced anything similar?  I hate to run paranoid to my onco to ask for some kind of testing if it's nothing, but I'd be lying if I said I wasn't worried... Thanks for your help... Blog: cancerinmythirties.wordpress.com/ Diag. 4/2010, IDC, IIIc, Gr. 3, Posit. lymph nodes w/extracaps ext., Supraclav node+, er/pr+, Her2+, Neoadj chemo (DD A&C, Taxol), BMX, more chemo, rads, hyst/ooph (masses), herceptin, tamox, Zometa Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774650",
      "Title": "Anyone else have pain & lumps in arm (same side as cancer)? mom2twins34 mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Sep 12, 2011 03:14AM mom2twins34 wrote: Thanks Sharon, Jenny & Jackie... Thanks for the encouragement to call the doctor--even after everything I still find myself not wanting to look like a hypochondriac or a complainer--sometimes I just need someone to remind me that it's important to get these things checked out.  I guess even if it's not cancer, there probably shouldn't be lumps or so much pain in there... Jackie--I've never heard of that before!  This week marks one year since surgery for me, so am I too far out for fatty necrosis?  (I'll probably google it after I finish typing this.)  :-) Sharon, did anyone ever tell you whether there's any significance to having the extracapsular?  I was just told it's not a good thing, but not much more than that.  And I never really found much on the internet about it.   Sorry about your LE, jennyboog...  I've only had minimal swelling in the upper arm & underarm (and neck??-but they've told me LE isn't supposed to go there?).  Sorry to hear your whole arm is affected.  Terrible that after everything you go through, you still have to worry about LE, too.  Such a cruel disease... Thanks so much for responding...  I'm going to call the doc...  ",
      "MessageIndex": 4,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774650",
      "Title": "Anyone else have pain & lumps in arm (same side as cancer)? mom2twins34 mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Mar 15, 2012 03:30PM mom2twins34 wrote: Hi Invisible, I am so sorry you are dealing with all of this... It is no wonder you feel uncertain.  It is a huge decision.  And no matter how prepared you think you may be to make a decision like this before you are faced with it, it is still different when you actually have such an unimaginable choice looming before you.  On the one hand, you feel like you are doing 'everything you can' when you remove the whole breast, but, on the other hand, it is not a simple surgery and I think a lot of doctors downplay it's significance.  Not an easy choice.  I think CoolBreeze's post is terrific--lots of honest information there...   I had a bilateral mx and was not given a choice, but, honestly, I was almost grateful to not have to be forced to make that decision.  I was struggling with the decision before all of the facts were in and before I met with my surgeon.  So when he actually sat down with me and told me there wasn't a choice, I felt relieved more than anything else.  So I certainly feel for you--especially because I know what it feels like to want to go with your gut on major decisions like these, but to feel like you don't know what your gut is telling you.    But I have to say that, maybe I'm wrong, but it almost sounds like your gut feeling may have come in through your last post...  It sounds like you trust your surgeon, and if she feels like there is no danger in waiting a few weeks to get all of the biopsies back, then perhaps going this route will give you the answers you need to feel more at peace with your choice.  It is such a big and difficult decision to have to make that it would probably give you a bit more confidence if you go forward with the biopsies and have a more complete picture of what is happening in your breast before you decide between lumpectomy and mastectomy. I think that whatever decision you make will be the right one for you...  One of the most important things I've learned in this process is that once I go through with a decision, I have to accept that it was the right decision for me and not spend any time or energy (easier said than done, I know!) rehashing the decision or wondering if I made the right choice.  To not rehash or second guess myself completely contradicts my nature!, but I find that it does help me feel less anxious about my choices and really helps with that 'stomache tied in a knot' feeling.  I'm sorry you are being faced with this decision...  You've come to the right place, though.  Please feel free to lean on all of us for support!  Sending warm thoughts... ",
      "MessageIndex": 6,
      "PostDate": "15/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/784150",
      "Title": "Help..need advice...just diagnosed invisible2 invisible2"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Sep 22, 2011 03:55AM mom2twins34 wrote: Glad you talked to your doctor, jennyboog.  Sorry that this is all so scary.  I hope your scan goes well... I was more confused after I left the surgeon's office.  He said LE can go anywhere where you have lymphatic vessels--up, down, wherever it wants to.  So he said it's possible that that is what is going on with my neck.  He told me not too worry.  I love him, but I was thinking \"that's easy to say when it's not your neck & not near lymph nodes that had cancer in them before.\"  I don't want to seem like a hypochondriac, but I'm thinking of just asking for an MRI when I see the onc again next week?  As for the arm, he said there is definitely LE down the forearm & that could account for some of the pain.  He wasn't too sure about the lumps, though.  Maybe it's axillary web syndrome like cmdczc said?  He didn't say anything about this.  I was hoping to come away with answers, but feel more confused than ever.  At least he was able to diagnose the LE, though hearing that really upset me.   Sorry for the \"low\" post!  I'm sure you understand...  I'll be thinking about you as you go for your scan & wait for your results...  ",
      "MessageIndex": 11,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774650",
      "Title": "Anyone else have pain & lumps in arm (same side as cancer)? mom2twins34 mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Jun 17, 2013 12:10AM mom2twins34 wrote: Hi infobabe, Though I can't speak about which is easier, I can tell you about my experience. I had a bilateral MX without reconstruction -- no choice. It was followed by radiation, chemo, herceptin, etc. anyway. The cancer was so extensive on the left side that it was initially inoperable. I had dose dense chemo to shrink it so that surgery would be possible. I had chest wall invasion, spread to my axillary and supraclavicular nodes, etc. so the left side was a pretty extensive surgery -- he took as much as he possibly could, including as much skin because they believed it had spread to the skin. I still suffer from severe pain on the left side and had many complications with swelling and seromas. I developed lymphedema on the left side. And the LE has made me prone to cellulitis and systemic infections (requiring multiple hospitalizations). I saw a physical therapist for a year to try to get some of my range of motion back, but just couldn't continue because I got so tired of it all -- my ROM is pretty limited still. That said, my right-sided mastectomy was a breeze in comparison. Though the skin is tight, I do not have the nerve pain, swelling and tightness that plague me on the left side -- or I don't notice it. I wish that the left had been so easy! I hope this is helpful and doesn't complicate your view. And I must add that I have to agree with INDENIAL. I felt completely unprepared for what happened to my left side. The right, no problem. But the left... Best wishes...",
      "MessageIndex": 11,
      "PostDate": "17/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806221",
      "Title": "Guidance on MX with no reconstruction. Infobabe Infobabe"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Jun 29, 2013 01:07AM - edited Jun 29, 2013 01:11AM by mom2twins34 Georgie, I had by bilateral mastectomy with no reconstruction almost 3 years ago at the age of 34.  My surgeon wouldn't even entertain the idea of reconstruction at the time, so it wasn't a decision I had to make then.  More recently he gave his half-hearted approval if I want to pursue it, so I am considering it, but given my propensity toward systemic infections (I'm sorry that you are also infection-prone!) and given the work it would take on my left side (I had chest wall invasion, etc. so the plan for that side would be pretty intense), I am not sure I will ever go through with it.   That said, if the last two factors weren't an issue, I think I probably would, simply because there are times when I really do miss the idea of having breasts and do feel less womanly (mostly just with my husband -- I think his attitude is rubbing off on me!) and because seeing my chest is a reminder of what this disease has taken from me (only when I stop to think about it, which really isn't that often). But it's nothing I can't live with.  I'm sure that from what I just wrote it probably sounds like I am not very accepting of my new body and that it has been very difficult for me.  To be honest, though, no one in my life would even guess that I have these feelings on any level.  The only time I ever wear my prosthetics is with a bathing suit.  And I never talk about it, so everyone just assumes that I have completely accepted life as a breastless woman.   And I'd say that I pretty much have.  I'm sure I will always feel a sense of loss, but it doesn't keep me up at night.  I would never have chosen to be breastless.  But now that I am, I just accept it as a trade-off for life, I suppose.  And I'm not sure I am willing to accept the risks of the surgery.  Maybe one day.  Or maybe never.  For now, I'm \"okay\" with how things are.   I know it is such a personal decision.  And it's hard to know how we are going to feel.  I realize that you already have experience with this because of what you've been through.  Even still, it is such a big decision, so try to be kind to yourself as you make it.  I'm sure that whatever you choose will be the right decision. Sending my warmest thoughts your way...",
      "MessageIndex": 41,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806221",
      "Title": "Guidance on MX with no reconstruction. Infobabe Infobabe"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Sep 25, 2011 03:12PM mom2twins34 wrote: Thanks for the information & advice, VictoriaB.  I was seeing a LE therapist who also helped me with my range of motion after the surgery and I stopped going a few months ago when we decided that my ROM was better and that I wasn't having too many issues with the LE.  I guess I was too quick to stop going... and I should probably go back to see her...  I'll google AW after this...  Glad you are getting some range of motion back...  Hope you continue to improve.  Thanks! Hi jennyboog, thanks for your words...  I'm seeing my other oncologist tomorrow (because I've gotten most of my treatment at the cancer center but I have to get my herceptin at the hospital & need to see an entirely different oncologist there--long story!), so I'll bring everything up with her, too, and see what she says.  I'm sure the neck must be LE (at least I think so most of the time!) and that there's LE in the arm, but I'm still really leary of those lumps in the forearm.  I guess that, along with some of my other symptoms, still makes me worry about something going on in the lymph nodes down there...  I haven't checked your thread yet, but I hope your MRI went okay.  I'm sorry that you have to wait now.  Sometimes I think that's the worst part...  I'm hoping that things are okay...  I'll be thinking of you... ",
      "MessageIndex": 14,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774650",
      "Title": "Anyone else have pain & lumps in arm (same side as cancer)? mom2twins34 mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Sep 28, 2011 03:15PM - edited Sep 30, 2011 10:00AM by mom2twins34 Hi Victoria, Yeah, I probably would have stayed on for PT longer had I known that I'd have to go back...  I was doing so well compared to when I started, so I thought that I'd be fine.  The first couple of months were fine--my PT had me going in for 10 mins. every few weeks after I stopped seeing her just to measure my ROM and measure my arms for LE.  It wasn't until the last couple of months that she measured a big drop in my ROM--nothing compared to the first couple of months after surgery, but still pretty significant.  So now I have to go back.  So, I'd probably say to finish out your 8 weeks if you can.  And to be better about doing the exercises at home than I have been!  Thanks for asking about my appt., too!   :-) Hi jennyboog, my appointment went okay.  She seemed concerned about some of my blood counts & other symptoms so she wants me to talk to my primary oncologist about having a PET.  But she didn't have anything to say about my neck except that she didn't know what was going on in there!  When I showed her my arm, she said she could see the lymphadema in the forearm but didn't want to speculate about what the lumps were.  I also had her feel some lumps in my leg (since I was there anyway) which she said \"Hmmm\" to and that was it.  So, I still don't feel any less confused--but I am becoming more and more convinced that my neck is LE.  Thanks for hanging in there for all of my confusing and uninformative appointments!   :-)    I'll post it on your thread, too, but I wanted to say how glad I was that your MRI was okay!  I'm sorry that you are still dealing with all of your symptoms though...  I hope that your visit with the LE specialist goes okay.  I liked your swimming & trying to keep your head above water analogy.  I think that's the perfect way to explain everything!... Thanks, girls!",
      "MessageIndex": 17,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774650",
      "Title": "Anyone else have pain & lumps in arm (same side as cancer)? mom2twins34 mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Jan 12, 2012 05:28AM mom2twins34 wrote: Thank you for sharing...  You are beautiful!!!",
      "MessageIndex": 41,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Sep 12, 2011 01:12PM mom2twins34 wrote: Sorry to hear you are having neck issues, too, jenny... How long have you been having problems?  Mine started in March.  I was still getting radiation, so I showed it to my radiation oncologist first--actually, he saw it when he walked into the room--because I figured maybe the radiation was causing it (I was getting radiation near the area for positive supraclavicular nodes).  But he told me that radiation didn't do it and sent me down the hall to my medical oncologist--who immediately sent me off for an ultrasound because he was worried about a jugular clot!  It wasn't a clot, but that was the end of the diagnostics.  I asked if it was LE and they told me what they told you, it goes down, not up.  So I still have swelling in my neck 6 months later & no one seems too concerned--except me every few weeks when I worry that it's cancer in the middle of the night!  :-)  I haven't heard the \"throat infection\" reason yet, though I've been on antibiotics for other things a number of times since the swelling started and they haven't affected my neck size, so I'm curious to see whether the antibiotics work for you.  I'm personally leaning toward LE as the reason--sounds like you're not convinced it's not that, too.  Seems like too much of a coincidence that we both have it only on the BC side!  I certainly get your frustration!!!   :-) I'll let you know how my appt. goes.  I called the onc today to ask him about the arm & they said \"you know you have an appt. tomorrow, right?\"  I had completely forgotten, so I guess I'll be able to ask him in person! Thank you--so nice to talk to people who understand...",
      "MessageIndex": 6,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774650",
      "Title": "Anyone else have pain & lumps in arm (same side as cancer)? mom2twins34 mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Sep 16, 2011 02:56PM mom2twins34 wrote: Thanks, girls...  Showed my arm to the onc and he told me to see the surgeon, so I'm going there on Tuesday.  Didn't even bring up my neck--seems like everyone is just accepting that the swelling there is normal for me now, which is probably not good because I'm beginning to feel like I just need to live with it instead of finding out what it really is! (I am going to ask the surgeon what he thinks while I'm there, though)...  It sounds like my swelling is pretty much in the same place you are having the pulling/burning sensations, jenny...  I really hope you do bring your neck symptoms up to your onc and that you are able to find a good LE specialist.  I certainly understand your feeling of being freaked out because there are LN there...  This can all be so scary... Sending you good thoughts...  Good night!  ",
      "MessageIndex": 9,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774650",
      "Title": "Anyone else have pain & lumps in arm (same side as cancer)? mom2twins34 mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Nov 8, 2011 07:13AM mom2twins34 wrote: Hi lyndawatkins, I'm sorry I can't offer much in the way of answers.  The lumps that prompted me to start this thread are still there.  When I wrote my last post, the onco wanted to send me for a PET, but the next day they found something on my ovary that after more ultrasounds and a CT a few weeks ago, they determined to be an ovarian mass, so that has taken any focus away from the arm and neck lumps.  But they are still there and still troubling.  Are yours are in the axilla?  Mine are around the inner crook of the arm and into the forearm and it seems like there is a possibility they may be related to LE??--I would think that lumps in the axilla would be a lot more concerning than the location of mine--did they take all of your lymph nodes during surgery?  I can understand your anger and fear, especially if they told you you still have cancer in your body.  It's a travesty that your insurance won't pay for the PET unless you go through having a biopsy done first, especially since a PET would be helpful anyway if they know there is active cancer in your body.  Do they want you to have a needle biopsy or to have them surgically removed and biopsied? The only thing I can think to suggest is to talk to the doctor who ordered the PET and see if there is anything he/she can do to make this happen.  Or, whenever I have an issue with insurance, I talk to the social workers at my cancer center and the hospital--the doctors and SWs always seem to be able to do more than I can as the patient. I am so sorry that you are going through this.  It's bad enough to have cancer, but to not be able to get the things you need medically because of insurance is just horribly wrong...  Thinking of you...  ",
      "MessageIndex": 20,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774650",
      "Title": "Anyone else have pain & lumps in arm (same side as cancer)? mom2twins34 mom2twins34"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Apr 21, 2012 01:13PM mom2twins34 wrote: Big hugs for you, Ann...",
      "MessageIndex": 28,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786193",
      "Title": "Bald again CoolBreeze JillThut"
    },
    {
      "AuthorID": "mom2twins34…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124842/profile",
      "Content": "Apr 8, 2012 12:20AM mom2twins34 wrote: So sorry, Michele...  My heart goes out to you and your family...",
      "MessageIndex": 1,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785463",
      "Title": "My Sister Passed Away Tonight Curlylocks kaycancer"
    }
  ]
}