{
  "AuthorID": "mom24boyzs",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152802/profile",
  "Posts": [
    {
      "AuthorID": "mom24boyzs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152802/profile",
      "Content": "Jun 6, 2012 07:16AM mom24boyzs wrote: Hello ladies, I have enjoyed reading all the post. Just a quick question....I am 6 days post first chemo treatment (tch) and it feels like I have dry, itchy scalp. Is this an indication that my hair is getting ready to fall out or am I just over analyzing things? Thank you! Blessings",
      "MessageIndex": 15666,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "mom24boyzs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152802/profile",
      "Content": "Jun 20, 2012 10:26AM mom24boyzs wrote: Good morning ladies! I don't post on this forum much, but I love reading all of your post! They are so helpful and encouraging. I am day 21 past my first chemo (tch) and will have my second treatment on Friday. My hair has slowly started to fall out. I can run my fingers through it and about 15-20 strands come out at a time. My hair is about chin length. My question is, have any of you just let it fall out? What about just getting a pixie cut first before you buzzed it? It seems like a lot of you just buzzed it off and I don't think I'm ready to do that. Blessings",
      "MessageIndex": 16021,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "mom24boyzs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152802/profile",
      "Content": "Aug 24, 2012 11:39AM mom24boyzs wrote: Uffda, I have gone topless since the beginning. I just feel more comfortable that way. I shaved my head all over to about 1/4 inch 21 days after my first treatment. I have lots of hats and a wig, but they just seem hot and itchy. For me this is just part of my journey, I know not everyone feels the same. For the record my hair has actually grown and is now about 3/4 an inch long. It has never fully fallen out. I still have eyebrows and eyelashes, although they have thinned. I have 1 treatment left, and I'm hoping I never loose all of my hair!",
      "MessageIndex": 17268,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "mom24boyzs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152802/profile",
      "Content": "May 29, 2012 08:48PM mom24boyzs wrote: Does everyone going through chemo loose their hair. I start TCH on Friday June 1. Not sure what to expect, seems like everything is happening so quickly and I'm trying to play catch up with all the info. Rhonda",
      "MessageIndex": 15544,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "mom24boyzs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152802/profile",
      "Content": "May 31, 2012 09:59AM mom24boyzs wrote: Thanks everyone for all the encouragement!! It is so helpful to talk with others who have \"been there done that\". I've already purchased a couple of hats and a scarf. I don't think wigs are for me. I'm just going to embrace my baldness! Bald is beautiful because, it's a step towards healing, the meds are doing their job. I just have to focus on that! Blessings!",
      "MessageIndex": 15566,
      "PostDate": "31/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "mom24boyzs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152802/profile",
      "Content": "Jun 8, 2012 10:13AM mom24boyzs wrote: Quick question for you veterans, My first round of TCH they gave me a lower dose of Herceptin because my muga came out a little on the low side. I had an echo done yesterday and everything looked great, so I'm assuming they will give me the normal dose of Herceptin. My question involves se. I barely had any se after the first treatment, which I'm VERY grateful for. Do you think the se will increase with the normal dose of Herceptin? Thank you for your input!",
      "MessageIndex": 29,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787983",
      "Title": "Chemo advice from veterans? Please post!!!! ElleBee pamelahope"
    },
    {
      "AuthorID": "mom24boyzs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152802/profile",
      "Content": "Jun 8, 2012 12:10PM mom24boyzs wrote: Moonflower- my first treatment was June 1. I have had some nausea and diarrhea starting on day 5. It usually occurs in the evening. This morning I woke up feeling great. I hope that it continues.",
      "MessageIndex": 33,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787983",
      "Title": "Chemo advice from veterans? Please post!!!! ElleBee pamelahope"
    }
  ]
}