{
  "AuthorID": "Mom35",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186653/profile",
  "Posts": [
    {
      "AuthorID": "Mom35",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186653/profile",
      "Content": "Sep 1, 2013 03:55AM Mom35 wrote: Hi, breast feeding is a big overwhelming deal! Especially, when you first start doing it. I did it with all four of my babies and soreness and engorgement is very normal. I have smaller breast so I know what those lumps feel like when the milk becomes full. They are the same lumps that bother me right before my menstrual cycle. I hope things turn out well for you and you get the answers you seek! I feel somewhat relieved because my blood work came back and I was really low on vitamin D. I'm being treated 50,000 units of vitamin D twice a week. I'm hopeful that this will take away some of my pains and aches! Also I hope it it gives me some energy. I still am not able to make it a couple hours awake before I am utterly exhausted. I'm am still nervous because this discoloration which is not painful on my breat seem to be filling in. Also my aunt who just beat breast cancer said her vitamin D levels were low and the same treatment I'm giving is what she was giving when she found out she had cancer. I say listen to your gut and body. And I'm a big supporter if the vitamin D now! It helps prevent cancer. I am dreading the manogram but will be relieved when its over! Best wishes!",
      "MessageIndex": 3,
      "PostDate": "01/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809834",
      "Title": "Feel like I'm becoming a hypochondriac Mom35 Mom35"
    },
    {
      "AuthorID": "Mom35",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186653/profile",
      "Content": "Aug 24, 2013 05:23AM Mom35 wrote: Ha, now I want to ramble the poor me syndrome. The reason I came here is because I have had night sweats the last few night and feel extremely dry mouthed at night. It's hard to sleep. Then in the morning I'm so nauseous and dry heave for no apparent reason. I am not pregnant! I am successfully blocked.",
      "MessageIndex": 1,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809834",
      "Title": "Feel like I'm becoming a hypochondriac Mom35 Mom35"
    },
    {
      "AuthorID": "Mom35",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186653/profile",
      "Content": "Mom35 wrote: Hi, I'm a 35 year old mother of 4. I stop breast feeding 10 months ago after my baby got breast milk jaundice. I mention this because about 5 months ago, randomly my nipples, especially the left will leak a small drop. After the small drops by breast and nipples got very itchy. Then random pain my breast and armpit. Now I noticed this light but blotchy under mark in my left breast. It looks like it wants to from a ring. I haven't injured my breast and it just seems wrong. Now that I have noticed these breast discomforts I seem to see warning signs, literally signs about breast cancer everywhere. Maybe it's because it's in my mind. I finally went to the doctor and she poked a couple times at my breast and said she didn't feel anything but ordered me a routine Mano in a month. I feel like a hypo! Should I be concerned or does this sound like normal 35 boob things?! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809834",
      "Title": "Feel like I'm becoming a hypochondriac Mom35 Mom35"
    },
    {
      "AuthorID": "Mom35",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186653/profile",
      "Content": "Mom35 wrote: Hi, The last place I ever thought I would be is on a Breast Cancer concern discussion board. This is now my second post and I am beginning to feel overwhelmed and defeated. I am typically not a complainer and deal with many aches and oh that's odd or different. Usually, if something is important enough my body will let me know. I know that you woman have way more to be worried about and have gone through heartaches and pain I couldn't even imagine. My heart goes out to you all. I started having random stabbing pains, itching and an occasional drip on my nipples around April or May. I originally thought maybe it was an after thought from the breastfeeding I quit 6 months before. But the aches kept being persistent. Then in July I noticed a small ovalish discoloration that is inside my breast. That was completely odd to me so I went to the doctor. She poked at my boob a couple of times and said everything feel perfectly normal. Although you are only 35 I will send you to a mammogram to ease your mind. I had the mammogram and it came back normal but they were concerned about the discoloration so they sent me to have and ultrasound. The lady ultrasound only one spot, exactly where the discoloration is and it was clear. She told me if the discoloration grew to 1/3 of my breast come back, otherwise see a dermatologist. I was extremely relieved and tried to put everything on the back burner. My exhaustion got so bad and when they called me and told me my vitamin D was really low, I thought maybe that explained the pain and aches I had. A couple weeks later the discoloraton has formed many different oval blotchy discoloration that sometimes, in some lighting appear to be bumpy around my nipple. It looks like a ovals hooking together to make a U shape around and under my nipple. I went back to the doctors and this time saw a different doctor. She asked me all my symptoms so I shared: fevers, night sweats, dizziness and joint pain. She looked at the \"rash\" and said she did see it, but it didn't look like BC she was concerned for two different kinds of blood cancer. She sent me on my way to lab. My blood work came back normal, and when I went into the appointment they suggested I see a rhuemotiod specialist and made me an appointment in January. Today I had my annual checkup at the obgyn. I saw a new doctor today and the nurse must have told him my story outside the room. He busted through the door and said, \"Listen you ultrasound and mammogram were perfect, there's no need to worry.\" I try to explain that the discoloraton has grew 3X's the amount and he said lay down. I laid with my arms down and he quickly, and almost literally tickled my breast a couple of times and said everything is perfect. I tried to show him my discoloration and almost rash and he glanced quickly and said, \"It is completely normal to get skin rashes don't worry.\" Now to now, the last few nights when I try to sleep I feel like something is trying to pull at my nipples. I just tried to give myself an self examine with my hands raise and I felt 3 tiny almost pellet like bumps and my rib or bone seems to be enlarged in that breast. The one bump I felt almost felt like to BB pellets stuck together. I feel like they think I am crying wolf or being a hypochondriac. I am not sad or depressed. I am a busy mom of four trust me I don't want to cause any problems I just feel like something is off. I am afraid with the way I feel, the dizziness, the fevers and night sweats plus the rash could be something and I don't want to wait until there is no way to deny it before I address it. I know I made a huge run on sentence! But, my kids need me and I need this off my mind so I can be there for them. Does any of this sound familiar? Thanks sincerely Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813905",
      "Title": "Interested in IBC stories Mom35 NancyHB"
    },
    {
      "AuthorID": "Mom35",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186653/profile",
      "Content": "Nov 2, 2013 11:27PM Mom35 wrote: I do have an appointment scheduled in a couple of weeks. Thanks",
      "MessageIndex": 2,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813905",
      "Title": "Interested in IBC stories Mom35 NancyHB"
    }
  ]
}