{
  "AuthorID": "mom38yo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/109545/profile",
  "Posts": [
    {
      "AuthorID": "mom38yo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/109545/profile",
      "Content": "Oct 13, 2010 04:32PM mom38yo wrote: Hello Ladies - I've been waiting a few weeks and all of a sudden I'm starting to get a bit anxious. Yesterday I got a Rx from my PS for one valium to take the night before my surgery. My NS BMX is on Monday 10/18. Cancer is on my left and on that side, the incision is going to be a line from near my ribs towards my aerola. I have a previous augmentation from December so I have scars below my breasts and that is where they are going to access on the right side. I have a fantastic BS PS team here in Seattle and they have worked together multiple times doing this NSM procedure. In fact it was my amazing PS who brought up NSM w/me. Once they remove the tissue, test the cells, send the rest to the lab, core the nippless, place the TEs, sew in the alloderm, put in 100cc of saline and close me up...I'll be ready to find out the results of the SNB...and the next chapter of this journey.  ",
      "MessageIndex": 57,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    },
    {
      "AuthorID": "mom38yo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/109545/profile",
      "Content": "Oct 15, 2010 12:20AM mom38yo wrote: cc4npg: could you please send the link to Tim Tam's profile...can't seem to find it even when I search.  I'm glad that you are doing so well and the prelim on the nodes is neg...Hurray!  Also encouraged that you actually have sensations, especially so soon. Congrats. JanetinVirg - Amen, I'm gonna be so relieved to get this over :) Thanks for the advice.",
      "MessageIndex": 79,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    },
    {
      "AuthorID": "mom38yo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/109545/profile",
      "Content": "Oct 22, 2010 05:36PM mom38yo wrote: I'm in awe of how strong we have to be to fight this. At times it seems so far away and yet after surgery, it finally hit me. I was sitting next to my 6yo son and so thankful for the gift of life I have today. So today, four days after my 7 hour surgery, with ripply lumpy dimpled black & blue skin over TE, and still in a haze, I'm gonna celebrate my gift of life. I'm going to use this precious strong body that God gave me and go for a walk. I want to smell the autumn crispness and see the beautiful fall colors. I'm going to have my mom take me to the store and that is actually at total treat! It will be so nice to get out of the house for a bit. I pray for encouragement, joy, strength, and that His Peace fills your life in these scary anxious days. Thank you for posting your story and blessings to all of you.",
      "MessageIndex": 170,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    },
    {
      "AuthorID": "mom38yo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/109545/profile",
      "Content": "Nov 12, 2010 02:39AM - edited Aug 20, 2013 06:09AM by mom38yo Hey my fellow Octoberans; I'm still in a haze three weeks post op.  This two steps forward, one step back healing process that a lot of us have been going through really bites. DMX went great, TE were filled to 300 and left the hospital the next day. A week later I noticed little red bumps and then some heat. I went to PS and was immediately admitted to hospital for IV antibiotics for a few days. Infectious diesease MD was awesome and let me go home w/a boatload of antibiotics so I could attend a play I had scheduled w/my son. A week later things turned around and the redness is now gone. Got 90cc fill on Mon. I woke up in horrendous pain and popped a pain pill ASAP. I then went back to sleeping upright immediately. (Was sleeping on my back 2 weeks after BMX but now sleep upright w/pillow under my knees to help support my lower back) TE are loosing up again and I'm scheduled for fills on Tues which I'm hoping I can get at least 60cc in. I'm 38 and my BS at our 1st consult said based on my age she thought I would have to do chemo.  I met w/Onco 2wks ago and she didn't think I would need it but wanted onco test. ER 100% PR 95% 1cm 0 nodes grade 1. I was so stoked that I wouldn't have to do chemo. Onco test came back yesterday - Score 25. See her on Tuesday as well. One step forward, two steps back - glad I'm alive but also nice to have others to share with and not have to say \"everything is great\" It does suck! Yay, I said it. I'm over it but it's still true.  Meglove - glad you got your tooth taken care of and your surg went so well Mryyl- so glad that you got those drains out...freedom hurray! ECoastGirl - prayers are with you for today and congratulations on your onco score! Yay! cc4npg - 97 in cali, holy smokes that sounds fabulous...and totally agree that none of us are cry babies! Annette - Have you tried a pillow under your knees? That really helped me out. It still surprises me that as advanced as the imaging technology is these days that they can still be that far off. Same thing here the size of my lump was actually double what the MRI, mammo and ultrasound showed. Janet- I didn't think I had enough time for my previous life and now with all the MD/PT/PA/CNP etc appoints I'm amazed. I've started to try and juggle the appointments so they are back to back as much as possible to save on travel time and parking costs. Alhaun - glad you are feeling better and I just wanted to encourage you because you are brave enough to truly feeling the loss that comes from this disease. At times I tend to block off or avoid the emotion but I admire the strength that you have to feel it and start the healing process. Glad that you are talking to people and your doctors.  I better be getting to bed. My mind thinks I'm doing just fine, with lots of energy but then I end up paying for it if I don't take it easy. Thank you all for sharing your experiences!",
      "MessageIndex": 425,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    },
    {
      "AuthorID": "mom38yo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/109545/profile",
      "Content": "mom38yo wrote: This Post was deleted by mom38yo. Dx 9/9/2010, IDC, 1cm, Stage I, Grade 1, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759432",
      "Title": "Should they remove the core biosy tract? mom38yo MarieKelly"
    },
    {
      "AuthorID": "mom38yo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/109545/profile",
      "Content": "Nov 14, 2010 11:31PM mom38yo wrote: Boatgirl: After my firt expansion, 90cc, I woke in the middle of the night w.the worst pain I had experienced to date sine BC diagnosis. It was a burning/searing pain in the lower pole/rib cage. I could barely roll over but did and popped a pain pill. It think it's the expansion process of the lower poles and tissue that may still have nerve sensation under my breast. Immediately went to sleeping upright again. Now my right nipples itch...hmmm?",
      "MessageIndex": 452,
      "PostDate": "14/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    }
  ]
}