{
  "AuthorID": "Mom4gma3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
  "Posts": [
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 09:21AM Mom4gma3 wrote: I see we are all being women locked in a room and getting a little catty today. Lol. Meowmmy- enjoy the good feeling for a couple more days. I am almost on the same regimen and I felt great for the first 3 days. Infusion on Wednesday and Sunday was my first down slide, lasted until Wednesday. And by noon Wednesday I was pretty much back to myself. Still having a little bathroom issues but other than that nothing else. So I am after some TMI this morning. Is it just me or does anyone held have freaky BM??? Meaning it just doesn’t look right at all. No big D it’s normal but it don’t look normal at all. I’m wondering if it’s connected to what I am eating or it’s just supposed to look like that. Since I’m throwing (hushed about) stuff out there, I never got mouth sores but I did get some little bumps all over my face, some on my neck and scalp, then in my bikini line area, they have pretty much healed now, but this morning I have one on my lady bits...ouch! Seriously??? It’s amazing how treatment is varied so much from clinic to clinic and state to state. I switched oncologists 3 times until I found one I was comfortable with, so for those of you having issues with your doctor, switch...it’s worth it in the long run. I’m in Clearwater Florida and our clinical support system is amazing here. We have CapSS which give us free support, they have classes for makeup and hair, they have yoga, counseling and just pretty much anything you need. I’m sure they have something in every state. On this site look up the “freebies” you can send away for free stuff like care kits and hats and even enter for trips later on. LIVESTRONG is a company that offers help, they do free classes throughout the country at local YMCA’s. Help is out there you just have to dig for it. On a somber note, saw the update on my insurance app last night and just about had a stroke!! 54,000.00 for 1 chemo treatment. OMFG! That’s more than my car! I’m going to be worth about a million dollars when this is over, wonder if I can insure my self for that much like the stars do??? Take today to be a little less serious and enjoy Tina. ",
      "MessageIndex": 474,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 10:36AM Mom4gma3 wrote: blair2 - I’m not at moffit, but I am familiar with there reputation and they are amazing. I am a dialysis tech and I have a few patients that go through them, but they are in Tampa and I didn’t want to make that drive. I’m at Susan Cheek here at Morton plant. 5 min from my house!! My dr referred me to Florida cancer specialists twice to different doc and each time it was horrible. I felt like cattle being ushered in and ushered out. So I had a friend who suggested the onco I have now and she is awesome. I have friends in Lakeland and I go there a couple times a year for holidays not to mention I drive through there for Disney which I do about 6+ times a year. I told my mom I would have to get a rascal next time to make it through the park. Living near the water is definitely good for my healing, that and the lovely weather. Tina",
      "MessageIndex": 480,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 12:56PM Mom4gma3 wrote: Hope99-I had to have a baseline echo because I am on herceptin between that and the carboplatin I’m at risk for cardiac issues, my heart itself is fine, but I throw PVC’s regularly so I was worried about cardiac issues. I had a brother die of a heart attack at 29 so I am always careful, they think it was genetic that caused his death but so far everyone has tested negative so it’s a lingering thought all the time. They will do an echo on me every 3 months and if there there is a 10% change from baseline they will stop the herceptin until the cardiac function bounces back and then restart it again. I am also having special blood tests with the carbo to monitor that as well. Tina",
      "MessageIndex": 486,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 9, 2017 07:04PM Mom4gma3 wrote: blair2- I didn’t hear it but I was in the mall most of the day, I saw it on the news on FB. We have been having a lot of booms out here lately, to the point it rattles the windows, my mom was worried about sinkholes because they say it makes that noise but apparently it was heard by a lot of people. Mcdill base isn’t far from me and the concluded it was their jets doing it. Are there any bases nearby you? It was pressure freaky the first time it happened. Tina.",
      "MessageIndex": 535,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 11, 2017 10:08AM Mom4gma3 wrote: Good morning all! 1st appt today post chemo, get to see where my numbers are at. Nothing really significant has been going on, those of us close to the same schedule are kind of in a holding pattern until round 2. The only symptom I still have is being achy and this damn runny nose! Back to work tomorrow, I have been out since November 5th. So excited to get back to my patients. Definitely starting to shed today. I have a ton of hair and I lose a lot all the time anyway, but it seemed to be more when I showered so I cleaned my hair brush before I brushed my hair and sure enough, filled the whole hairbrush when I was done. ðŸ˜©. It won’t be noticeable for a little bit because I have so much but it won’t be long. On a good note I barely had to shave anywhere else and I haven’t done it in over a week so that is a plus! Love all the pictures of the puppies. I have a 10 1/2 year old golden and he is my baby. Sweetest thing I have ever known. I also have a 2 year old snowshoe cat who weights about 15 lbs and a new kitten who keeps us all entertained. He’s a little ass most of the time, into everything!! Hope99- hope you are doing okay and thinking about you today! These are all my babies. Tina",
      "MessageIndex": 569,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 12, 2017 05:47PM Mom4gma3 wrote: First day back to work was amazing!!! So happy to be out of the house an back to normal for a change. I did wear a mask all day at work because I am in nursing, it’s actually required when we are putting patients on and off but I just kept it on around the patients. Which of course caused patients to question why I was wearing it and did I have a cold etc. etc. Once my hair disappears I won’t be able to avoid those questions as easily. But I don’t want them feeling sorry for me. I am supposed to be taking care of them, they don’t need to worry about me. I’m in dialysis so I have the same patients 3 days a week so everyone is like family to us and to each other. Rljes- my white count on Monday was 2.2 and that was day 12, my MO said she could tell by the other labs that is was on its way up and today I had zero aches, so I’m assuming that low white count is causing my achy feelings. I can’t imagine how low it was at day 7 if it was 2.2 5 days later. Meowmmy- I didn’t have itching per se, but I had a break out down there. It was mostly on my bikini line but some creeped a little further in. I also got it on my face, neck and hairline. They were a cross between blisters and acne. Kinda weird. But I’m a picker, so I pretty much popped them when they showed up and they quit itching and healed up fairly quickly. My MO put me on Claritin for my constant runny nose and it has worked wonders. No runny nose at all. She thinks I probably have allergies that my body usually fights off but now it can’t, hence the Claritin. I’m so happy it worked. She also changed how I take my steroids post infusion hoping to keep me feeling better longer after chemo so I don’t have to take so many days off work and to keep me from feeling miserable over Christmas. Fingers crossed it works!! Hope everyone is doing well, have to catch up on reading everyone’s posts! Hope99- how are you feeling today girl? Stay strong, you can do this!! Tina",
      "MessageIndex": 593,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 20, 2017 07:02AM Mom4gma3 wrote: Round 2 today, hoping I do as well as the rest have done on their second round. I work tomorrow and Saturday, then off til Tuesday so I am hoping I can keep nasty SE’s at bay during work days. Shaved my head with a razor yesterday, I just couldn’t stand that Brillo pad feeling under my cap, now it’s smooth as a baby’s butt. Had my mom in the bathroom with me helping me get all the spots I couldn’t see. We were laughing our asses off as she was taking pics and sending them to my little brother in Pittsburgh. He’s bald and 10 years younger than me and has been having a hard time dealing with this since I am the only sibling he has left. We lost our other two brothers in a car accident in 2002. Needless to say, she said we are twins now since are sporting the same hairstyle. My son on the other hand was not happy with the laughter. Thought my mom was rude by doing it. I explained that you just have to find some sort of happiness is this whole thing. I enjoy the funny moments and I do love to laugh!! Tina Cancer is probably the unfunniest thing in the world, but I'm a comedian, and even cancer couldn't stop me from seeing the humor in what I went through. — Gilda Radner",
      "MessageIndex": 698,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 22, 2017 05:59AM Mom4gma3 wrote: Good Morning ladies! Day 2 post infusion 2. Doing good so far, MO put me on lasix Wednesday and I have lost 6 lbs in water weight! Go me! Cut steroids down to 1 twice a day for 4 days then half of one twice a day for the next 3 days and so far no big C, I was regular this am. No nausea meds needed so far and I worked 11 hours yesterday will very little swelling and just a couple aches. Took ibuprofen and knocked those out to finish the day. Keeping my meds to min seems to help minimize and SE’s. I only take claritin, Prilosec, lasix and steroid in am and lasix and steroid in pm and it seems to be working so far. We will see by Sunday when my bad days seem to start in. Off today so getting last minute Christmas shopping done. Blair I feel so bad for you being in so much pain, it’s not fair to have that on top of everything else. Nonahope- good luck with your infusion! Meowmmy- I have allergies SE something horrible. The Claritin is working, im taking it once a day and if I am and hour late the nose just starts running, sneezing and runny eyes. I agree it may be lack of hairs, but also your immune system is needed to fight allergies and with it being reduced there’s no extra to fight it. My son is allergic to dust and as a child his poor body couldn’t fight off anything because it spent all it’s time fighting his allergies. They checked him for HIV and Cystic Fibrosis because they were so sure he had some horrible disease, but it was all just allergies. Luckily he outgrew it, but his childhood was spent mostly in hospitals. Mkn86- I’m the same way with foods when my taste goes. Orange soda is the only thing I can drink besides water. And I throw turmeric and ginger from the health food store into my water. Nothing with sugar substitutes tastes good. Potatoes and toast are a big go to food. Even peanut butter which I hate normally. And sweets...I live on sweets. Especially at work right now since we are overflowing with them from patients for the holidays. Loving my baby butt bald head, but wish I could get some sun on it. There’s a skunk stripe tan line where my part used to be right down the middle. Wearing a Santa hat to work tomorrow!! Tina At the height of laughter, the universe is flung into a kaleidoscope of new possibilities. — Jean Houston",
      "MessageIndex": 726,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 22, 2017 06:51AM Mom4gma3 wrote: nonahope- no, they just gave me the oral pills, which are fine, a little inconvenient at work having to run and pee like Sea Biscuit every 20 min. Pushing 8 bottles of water a day and lasix is not the greatest combination! Speaking of water, so I left the clinic on Wednesday after my infusion and the nurse reminds me to push the fluids, which she just saw me drink 3 bottles of water while I was there. So I told her that and she tells me that it can’t be just water because it will reduce my sodium content. Has anyone been told this? I am a dialysis tech and have been for 13 years so I know how fluid balances and chemical leaching works, so I did look at her like she was an idiot. Apparently she isn’t aware that’s most bottled water has sodium in it so that isn’t an issue. Just my little rant for the day. She was obviously new to the chemo work because she had a hard time figuring out how to connect my lines between each bag. Tina",
      "MessageIndex": 728,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 23, 2017 02:31AM Mom4gma3 wrote: Last good day if my post infusion follows the same course. Hoping to work until 1, supposed to have a Christmas party at 230, then veg till I go back to work Tuesday. I am down another 4 lbs and I’ve been eating like crazy, I can’t believe that was all water weight. I did do a ton of walking yesterday to finish Christmas shopping. Hope everyone has an amazing day!!!",
      "MessageIndex": 750,
      "PostDate": "23/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 23, 2017 04:54PM Mom4gma3 wrote: Rljes- next two days off and I think I’m going to need it. Definitely over did it today. But it had to be done. Christmas shopping and wrapping is done, now just have to grab food but I know I don’t want to deal with crowds tomorrow. I should go at like 5 am.",
      "MessageIndex": 756,
      "PostDate": "23/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 24, 2017 12:39PM Mom4gma3 wrote: Meowmmy love the professor Quirrell, I’m a Harry Potter junkie!! Salt is a major issue for me, I have to have everyone taste what I cook now too because I usually do all the cooking and I can’t trust myself. New Star Wars was awesome! Still left us hanging again, now two more years to wait for the next one!! Grr!! Tina.",
      "MessageIndex": 764,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 26, 2017 03:38PM Mom4gma3 wrote: rljes- I think stretching the steroids worked to get me through the holidays, but since I had to go back to work today and today was my first day with no steroids i was really exhausted, we will see how tomorrow goes. I work the next 3 in a row then off one and back one and off New Year’s Day. It’s going be a rough one. Didn’t help that I was up at 1 with the big D and my alarm goes off at 315. So the lack of sleep may play into it as well. Meowmmy- I love the wrap, just beautiful! I haven’t got to creative yet because well as early as I get up I don’t really care. Lol. I throw a cap on and run out the door. Maybe if I go somewhere besides work and chemo I will try to wrap something pretty. Blair2- sorry you are feeling so poorly, wish everyone would just sail through with no issues or SE’s. Still tired but made it through the day. Going to force myself to stay up till at least 730 otherwise is will be up before my alarm. Still starving as well, which makes me crazy! Hoping that stops tomorrow too once the steroids are completely gone from my system. Glad everyone made it through the holidays as best as they could! Hope Santa gave you what you wished for! Tina ",
      "MessageIndex": 785,
      "PostDate": "26/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 7, 2018 06:31PM Mom4gma3 wrote: magari- I give you props for you “break-up”, I have an ex who I broke up with months before I ever found the lump. He sends me random texts about his “emotional issues” very weird and cryptic. I am sure he is drinking, which was the reason for the breakup in the first place. I can’t bring myself to be mean, I know I need to, but it’s just not in me. But it’s so annoying for him to text me and whine about his issues. I don’t give a damn about his issues, we broke up, I have enough on my plate without his garbage too. There are a couple of people I would like to throw out with the morning trash and just say enough! Wishing strength to all of us going after round 3 this week, I am not looking forward to starting the next two weeks all over again. But this is my halfway point. We can do this!! Tina.",
      "MessageIndex": 950,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 9, 2018 09:18PM Mom4gma3 wrote: Good Evening all...getting ready to crash for the night. I have to get up early on my only day off so they can draw my labs at 8, see my MO at 9 and chemo at 10. Hopefully my labs are back in time. Started my steroids tonight and ran to the market and grabbed all kinds of healthy, low calorie snacks to eat when the steroids make me hungry. Making a big batch of chicken and cabbage and I even made ranch dip out of Greek yogurt, grabbed carrots and celery to dip. Mind you I came home from work to find a whole strawberry cheesecake in my fridge, straight from New York. It’s killing me not to eat it. Maybe I will treat myself to a slice for breakfast....ðŸ¤” There are so many of us it’s so hard to keep up. Blair2 I keep praying you wake up and your pain is completely gone. Rljes- hope everything went smooth today. On a side note, it must be true when it rains it pours. Like we don’t have enough going on that things have to start breaking on us. Last week my tire pressure light was on, fixed it, the next day my change oil light on, fixed that. Now today there is a little wrench light that came on when I left work. Really??? Apparently it’s a really bad thing and it’s part of a class action lawsuit against Ford. So I will be calling the dealership if it comes back on tomorrow. I don’t have money for a huge repair bill. I sure hope you got your car fixed. I would go insane if I were stranded. Idk where everyone is, but my daughter is in Omaha and she text me that there is a winter storm heading across the Midwest, that’s the last thing everyone needs up there. Hope everyone stays safe and warm. Sending out good vibes that everyone having their next treatment finds it to be a walk in the park!! (One can hope!) Tina.",
      "MessageIndex": 988,
      "PostDate": "09/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 11, 2018 04:21PM Mom4gma3 wrote: Decided to check out the Look good feel good class, but the next one isn’t until March, so that was kinda depressing. I don’t wear makeup anyway but I thought it would help. I’m just so out of the loop anymore. I don’t have the energy to go out except one weekend every 3 weeks. There’s no beach days this time of year. I feel like a fat cow all the time. I had a friend from nursing school text me this afternoon talking about how class is going (they kicked me out when they found out I was doing chemo, said I couldn’t participate I clinicals so I couldn’t graduate) so I guess I’m feeling sorry for myself a little bit. Took me 28 years to raise kids and finally go back to school and this happens and everything is put on hold. I’m usually more optimistic than I am right now, And I don’t like it. Feel like Alice going down the rabbit hole. Probably just a little chemo brain, after a really long week of work. 1 more day then the weekend off. I need more sunlight, at least it’s warmer out right now. Just my little vent for the day, I don’t vent to anyone because people tend to pity you when you do, and I am so glad I can just say what I need to to people that get it. On a plus note one of my patients got me scrub hats from a nursing shop that are so cute, I can’t wait to wear one tomorrow. Tina.",
      "MessageIndex": 1009,
      "PostDate": "11/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 12, 2018 05:24PM Mom4gma3 wrote: sdk- luckily it looks like the noodle legs didn’t last that long for me. No side effects right now, I’m stopping my steroids a day early because I have to be to work on Monday morning and I need the big D to kick in a day early. My MO said to do whatever I needed to make it easier on me, so we will see how it goes. Legs are still so swollen with the lasix but I’m on them for so long during the day there isn’t a lot I can do about it. Sleep is what’s I need most. I woke up at 130 this morning and have been up ever since. Grrr! But on the plus side I have dropped 7 lbs this week, I’m going to keep moving in that’s direction, pretty bad when I have to jump to get my scrubs over my hips! Damn holidays mixed with steroids!! Supposed to be cold this weekend! I hate when it’s cold. Florida is supposed to be the sunshine state. All I’m getting today is gloom and rain!! Hope everyone has an amazing weekend! Just one more step forward!! Tian",
      "MessageIndex": 1026,
      "PostDate": "12/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 16, 2018 01:03PM Mom4gma3 wrote: Good afternoon ladies! I had a surgical f/u this afternoon, figured he was just going to look at me, say we’re good and send me on my way. Nope, sure didn’t. Apparently I have to do radiation next, which I was never informed of, even though he swears he told me. I know he didn’t because I expected him to. But whatever, it is what it is. Does anyone know how often they schedule it? From what I am reading, they do it daily for 5-7 weeks. There is no way I can accommodate that kind of schedule unless they are open until 6 or 7. I’m freaking out over this. I can’t take 7 weeks off work. I know a big fat brownie sound really good right now...lol. Stress rant over... I’m so sorry everyone is feeling so bad. Knowing this is cumulative, I’m getting worried about the next one. No bigD yet but I keep waiting for it. It’s going to come when I least expect it. Positive vibes to everyone! Tina",
      "MessageIndex": 1068,
      "PostDate": "16/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 16, 2018 03:21PM Mom4gma3 wrote: My work schedule is 4a-4p so unless they have a late schedule this is going to be a mess. Their biggest concern is because it was a grade 3 and ki-67 of 70%, he said the growth rate is just too fast and aggressive to risk missing even 1 cell. My lump nearly tripled in size in less than 4 weeks. I guess I will just let it play out and hope for the best. Tina",
      "MessageIndex": 1072,
      "PostDate": "16/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 27, 2018 06:27PM Mom4gma3 wrote: rljes - love the pic. Had a blast but couldn’t make the whole parade. My son kept worrying about my legs swelling and he wasn’t just enjoying the day so we came home early. Love the “pirate battle” and the taking of the city. Corn dogs and cheese fries, and I did have 2 rum drinks...it’s required right? All in all it was a beautiful day for it. Some people have no tact when it comes to what comes out of their mouths. Being in a large area no one even notices, or maybe there are so many odd people here no one thinks anything of it. I do give people looks and move away from them if they get too close or have any symptoms of illness. I saw a woman today, bald as can be with nothing on her head. I wish I could find the courage to do that. Instead I had a “pirate” bandana on. I have a costume with fishnet stockings but as swollen as I am, my legs would look like a Christmas hams. Day of rest tomorrow, except laundry, I have to get my work uniforms done tomorrow. Tina.",
      "MessageIndex": 1194,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 31, 2018 06:36AM Mom4gma3 wrote: Infusion #4 today, hoping I slide right through as I have been. Took my steroids last night and praying the fluid starts dropping off, even though it only lasts 2 weeks and it comes right back. I will find out today if we are only doing 4 instead of 6. Praying for only 4 so I can start the radiation and start putting all this behind me, even though I still have to do the herceptin for a year. I keep forgetting that part. I too wonder what side effects may become a permanent fixture in our lives. I’ve seen stories where people are dealing with fluid retention for a year after, hair loss, bone pain. We will never know I guess until we know. Good luck to all of us hitting our next infusion this week. Tina",
      "MessageIndex": 1222,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Feb 22, 2018 07:49PM Mom4gma3 wrote: klvans- yep all done with chemo. I need to contact my RO and let her know I finished early, but with work going the way it is right now I may not be able to start before April anyway. We just don’t have the staff to cover the regular shifts, let alone me trying to snag out early every day to make it to rads. I will know more once I see March schedule when she gets it out. I didn’t have the heart to tell her to rearrange the whole staff schedule at this late date. Maybe I can still work around it. I just want all this over and done, and I can’t start radiation for 3 weeks at least anyway, so it is what it is. For this worrying about the “funny” hair growing in, italjed to someone today that told me her dad had a head full of fuzzy gray hair post chemo and it all fell out and his normal black hair came in just fine, so apparently this is all normal. Fingers crossed. It did ease my mind some. Swimming pool is nearly up to 75, maybe by this weekend I can get out there and get some snorkeling practice in. For some reason I just float and have to keep practicing to dive to the bottom so I can do some good snorkeling in the gulf this summer. That and this fat lady needs to do some laps. I never ever want to take steroids again in my life!!! Tina",
      "MessageIndex": 1383,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Mar 14, 2018 10:52AM Mom4gma3 wrote: Dr Clearerd me to start going to the gym!! But sadly she said no to the mani-pedi I so desperately need. Maybe in a few more weeks. She said my nails aren’t strong enough, but I am cutting them every week so I don’t see that as the case. Mindy- the dropped my Taxotere and carboplatin two infusions in a row by 20% and I didn’t get the neuropathy until after the dropped it. No said the feeling should start returning in 30 days or so, I hope she’s right. My feet are so uncomfortable by the time I am done with work at the end of the day. She did send a script for the echo before next infusion, so that got checked off the list, and so far I am still hanging on to the April 4th appt with the RO. Although I’m a little concerned because for some reason my insurance didn’t pay anything on my consultation appt with her, and I need to find out why. I may have to switch if there is an issue with them and my insurance. So happy for everyone who is finished with their chemo, it’s been a harder road for some of us but a road we have taken together and walked out the other side of the tunnel in one piece. I know some of our journeys are being taken in different orders, but I wish everyone the very best there is. Tina.",
      "MessageIndex": 1478,
      "PostDate": "14/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Mar 31, 2018 06:07PM Mom4gma3 wrote: okay ladies not only do I have hair envy....now it’s mani-pedi envy. My MO said no mani pedi yet. I am 6 weeks PFC, she said my nails couldn’t take it yet. I think they would be fine putting it on, but it would trash them if I had to remove it. I’m waiting patiently... Star- I also still have to get herceptin every 3 weeks so no port removal any time soon, a lot of people leave their ports in, just in case. The downfall with that is they have to be flushed every 6 weeks. Which would be annoying after a while. Mine used to feel deeper than it is now. Now it feels like it’s barely under the skin. Still have all the same lingering side effects. Swollen feet, tingling toes and fingers. The toes are way worse after being on my feet for 12 hours at work. I hate that I can’t go barefoot anywhere. I am off the Prilosec completely and today was my first day where I didn’t need tums as backup. So I am down to vitamins, biotin and lasix (my best friend these days). I have some dark hair on the back of my head, it’s very promising! Unfortunately like blair2 it’s a dark haired version of her Johnny Carson. Nothing on top!! I should go get that spray on hair!!! Lol. Hope everyone has an amazing Easter tomorrow!! Cooking has commenced at my house! Love to just do something normal again without worrying how I am going I feel. Our whole holiday season from thanksgiving through New Years was overshadowed by the things going on to each of us, this is the holiday to rejoice and give thanks that we made it through (for the most part) to the other side!! Tina",
      "MessageIndex": 1595,
      "PostDate": "31/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "May 6, 2018 06:21AM Mom4gma3 wrote: blair2 and iris- hope you both are on the road to recovery and being pain free soon! Blair I love the story with the grand cat, my cat is exactly the same and I have had her since she was a baby. She will come up and rub and get lovings for exactly 10 seconds, then the teeth and claws come out. Lol. Star- I was about to post the question to everyone asking if they have been brave enough to go out yet without covering. I just can’t bring myself to do it. Last night I had my drink on quite a bit for cinco de mayo, so I went to dinner and dancing in tarpon springs without it. Now that the liquid courage is gone, the cap goes back on. I’m just so tired of wearing it, but too self conscious not to. As for me, I have 1 day left of rads, I get to ring the bell tomorrow! I can not wait to be done with this, it has just taken so much from all of us! It really wasn’t that bad and the therapists were awesome, but it was just so inconvenient to get there every day. Some redness, but no sores and just minimal discomfort, especially when I am trying to sleep. Now just herceptin infusions every 3 weeks, and then go from there. Anyone with a port get any information about keeping it or removing it when all is done? People keep asking me and none of my doctors have said anything about it. I have a follow up with my surgeon on the 15th so I am going to try to remember to ask him about it. Hope everyone is having an amazing weekend! Tina.",
      "MessageIndex": 1728,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Nov 30, 2017 01:15PM Mom4gma3 wrote: I am not getting neulasta, which I am grateful for since it seems to have a lot of pain involved. I took my own steroids the day before, I the day of tx and two more days of my own so that covers me a couple days out.",
      "MessageIndex": 326,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 1, 2017 03:25PM Mom4gma3 wrote: So far so good today! Little nauseated this am, mainly after taking my vitamins and steroids. Ate some toast and took a compazine, just to cover my basis. Good day except being tired, but I haven’t really slept all week, just a few hours a night. May pop a sleeping pill tonight just to get a good nights sleep in. I wasn’t given anything for sleep but I do have my OTC go to. 48hrs post first infusion...",
      "MessageIndex": 353,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 4, 2017 04:01PM Mom4gma3 wrote: Props Meowmmy, I can’t bring myself to do it! I have hats and beanies I’ve made ready to go, but I can’t even bring myself to cut it short!! I love my hair, I have taken all this in stride, but they say it starts falling out is the day I’m going to break a little bit. On the plus side, looking forward to not shaving!!!",
      "MessageIndex": 395,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 5, 2017 12:17PM Mom4gma3 wrote: Hope-tried the flavored water but again it tasted awful. Probably just have to stick to regular water. Which luckily tastes fine. Ran and grabbed some Imodium, Prilosec and tums. After my energy burst doing laundry and breakfast, all hell broke loose. even took a compazine and still feeling funky. Grabbed one of those holiday boxes of cookies hoping I can at least eat something without feeling horrible or running to the BR. I’ve already lost 4 lbs in two days but that’s partly from fluid loss and the big D. Heartburn and throat pain from it are my biggest complaints. Passed on coffee this morning hoping it would help. My MO is on vacation til Monday so just trying to combat symptoms for now. Rljes- maybe that’s why I have the drippy nose too, it’s annoying to say the least. Funny it looks like my lip hair grew an inch. I don’t want to pluck because that’s just more pain I don’t want. Lol. Tina",
      "MessageIndex": 409,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 5, 2017 02:16PM Mom4gma3 wrote: I had chemo brain too Hope99, mine was more a fog. I had to really focus on my day to day movements, like walking and driving. Everything was kinda fuzzy and just off. By probably day 5 it was gone. My vision was off with my glasses driving as well, but that didn’t go away. I can’t drive anymore wearing them or everything is fuzzy. Tina",
      "MessageIndex": 415,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 5, 2017 05:37PM Mom4gma3 wrote: hope99- you’re scaring yourself again. I am 46 and pretty healthy before I found the lump, chemobrain is just the way you feel after the infusion, the 5 days is post infusion. I’m sure everyone takes it differently. Mine was just foggy for a few days then it got better. I have never gotten sick just a little nausea. I drank a ton of water the first 3 days to flush the chemo. The infusion was actually a breeze it just took forever. I am going into day 7 now and think I’m feeling pretty good compared to what I expected. Everyone is scared about how they will react to the meds but your MO will make sure you are prepared. Make sure you are comfortable with the oncologist you are going to, I switched before I started because the told me nothing at all and I wasn’t comfortable with that and found someone awesome. As for age most people with BC are older so some with BC have other age related issues including forgetting things. I had to go through a ton of genetic testing because of my age and no family history of it. They don’t know where it came from or why I got it. But it’s here and we just keep fighting forward. Tina My new mantra is going to be Dory.... Just keep swimming.....",
      "MessageIndex": 424,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 6, 2017 07:53AM Mom4gma3 wrote: binniebin- 104? I was told 100.4, 104 seems awfully high to wait so long. You may want to clarify that. Tina",
      "MessageIndex": 439,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 6, 2017 11:28AM Mom4gma3 wrote: blair2- I was the same with the constipation. Told myself if nothing happpened by day 5 I was hitting the laxative, fortunately (or unfortunately) the big D kicked in first thing day 5. Felt amazing to be cleaned out finally, unfortunately it never stopped....doing day two of Imodium now. So far only one episode this morning and nothing since.Make sure you have the Imodium on hand just in case. Feel pretty great today, went for a walk though a nature park trying to increase my energy. After an hour I was so beat. Grabbed some things at Walmart, found out orange soda tastes good. Yeah!! And grabbed me a huge platter of apples, grapes and caramel sauce....currently my lunch today! I figured I am down 7 lbs I can splurge a little",
      "MessageIndex": 443,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 7, 2017 05:43AM Mom4gma3 wrote:",
      "MessageIndex": 450,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 09:39AM Mom4gma3 wrote: hope99- I know your first infusion is Monday, couple of tips. Drink tons of water leading up to, the day of and the days after to flush the chemo out of your system. I was drinking 8 bottles a day. Take stuff to keep you busy and comfortable. I made a blanket to take, fuzzy slippers, took a book, my iPad, water, snacks, my iPad and a set of headphones, (I watched Netflix the whole time). I had some mints and ginger candy in case I got nauseated. They gave me lunch (vending machine sandwich and chips) but it was bad so I will bring my own next time. For 54,000.00 they should of fed me steak and lobster. ðŸ˜‚ i literally took a whole bag of stuff because I wasn’t sure what I needed. Next time I bringing a little pillow too, they didn’t offer one, but they did have heated blankets. They have TVs but you had to share and I don’t share well. I wanted my own. I know I’ve mentioned it but I will put it out there again. I’m using an app called Chemowave, it lets you put in how you feel and each symptom and it tracks it so you can remember how you felt and when. That way if I forget I can go back and make sure I don’t schedule work or things to do on those bad days. It also helps me see that I’m improving as the days go on. Kinda like seeing the contraction is almost over in labor only a very long contraction. Tina",
      "MessageIndex": 477,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 9, 2017 08:14AM Mom4gma3 wrote: blair2- about day 6 I felt like someone used me as a punching bad. Just hurt on my back, my arms, legs. Just this achy feeling. It came in waves and if I laid real still for a little while it would let up a bit. I ended up giving in and taking ibuprofen for it and it went away eventually. Oh and the cold has arrived to Clearwater, what was I thinking wanting I cool down.... Heading out to the mall to do some Christmas shopping, I’m going into day 10 and I think my numbers are pretty good to go into public. I burned myself on thanksgiving a week before chemo and it’s just now finally healing well. I figured that’s a sign I’m on the upswing. Got my trusty bottle of hand sanitizer because I have learned people are nasty!! I had a lady at Walmart cough in her hand and then try to hand me my change back... yeah no. Orangedaisy- I was all for hoping facial hair and body hair would disappear forever! No more shaving or plucking...how awesome would that be. Just keep that brows, lashes and head hair!! Meowmmy- keep your chin up, we have all been there. Everyone have an awesome weekend!! Tina",
      "MessageIndex": 515,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 9, 2017 08:03PM Mom4gma3 wrote: rljes- for the Chemowave app when there is a symptom I have that’s not on there, after I pick how I’m feeling for the day I go back in there and edit it and gives you the option to add a note so I just put a not in there. Especially if you are at less than 100% for that day a note gives you a reason for that. When tracking your numbers either weekly or monthly you will see the drop in your trend which is mainly what I am watching plus what’s meds I take on what days. As for numbers, your counts drop around day 7 or 8 then they are supposed to start trending up, most have their nadir done at day 7, unfortunately my MO was on vacation so I couldn’t get mine done on day 7, mine is getting done on day 12 which, whatever it isn’t going to be accurate anyway. That said I am kinda winging it so I would think you would feel tired and generally off of your counts were down. Which I don’t, so I am assuming they are fine. I did take major precautions the whole time I was out when it came to touching things and public restrooms, etc. the escalator just freaked me out. Idk how many people touch that thing. You see germs, and cooties everywhere!! Tina",
      "MessageIndex": 538,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 14, 2017 04:48PM Mom4gma3 wrote: Well I keep chickening out on cutting it short, it’s shedding something fierce, almost took the scissors to it after my shower. I think Sunday will be the day I will just take the clippers to it. I have a Christmas party tomorrow and tickets to the new Star Wars on Saturday, so hoping I can stand it that long. Klvans- welcome. You are on the same schedule as me and Blair2, my second treatment is the 20th. Tina",
      "MessageIndex": 632,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 26, 2017 05:44PM Mom4gma3 wrote: diveslikeagirl- I take claritin, Prilosec and lasix regularly. Everything else is as needed. There are so many side effects from meds that I don’t think I would know what Se’s were med related and which were chemo related. I see from everyone’s posts that they all do it in a way that works for them. I had to take compazine twice during round 1 and not at all during round two. Figure compazine causes fatigue and constipation so if I can avoid it I will. I take tums as needed for the heartburn and 2 Imodium only if I have the big D, so far this mornings dose is working. I’m taking the fight the symptoms that show up approach instead of the prevent the symptoms that may never show up anyway approach. If that makes sense. The runny nose, heartburn and swelling last through my whole 3 weeks between cycles which is why I take those three meds regularly. Meowmmy- love it!! It’s so freeing when you aren’t fighting the hair anymore!! Beautiful!! Klvans- I had the same issue about the privacy when it came to work. It was easy to hide what I was going through when I had hair. Now that it’s gone, the questions keep coming. I don’t want my patients feeling sorry for me, it’s my job to take care of them and to worry about them. My Tuesday Thursday Saturday patients have seen me all week with no hair so the questions have stopped mostly. Tomorrow is my first day back with my Monday Wednesday Friday patients since I shaved the head, so it’s going to be a little overwhelming with their sympathy, even though they mean well. As for small town, I live in a pretty big area, and I don’t run into people I know. I can imagine how uncomfortable that could be. It’s the fact that people are feeling sorry for you that makes you feel uncomfortable, you aren’t dead you don’t need people to say how sorry they are. I wish people realized that’s it just makes it worse when they do that. That was my rant of the day....ðŸ™„ Tina",
      "MessageIndex": 789,
      "PostDate": "26/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 27, 2017 05:06PM Mom4gma3 wrote: rljes- sorry you are feeling so bad this time around. I was told to be careful from day 7-14 due to our white counts dropping so low, we are at risk to pick up infections. The nadir number is when you drop, that’s why most had a set of labs drawn at 1 week post first infusion to see what their numbers were. Mine wasn’t drawn until day 12 due to my MO being on vacation and on day 12 my wbc’s were 2.2 which is pretty low but it was already on its way up so idk how low it got. I can feel when it starts dropping, I start getting achy and it gets worse until it comes back up. I wear a mask at work on those days and I sanitize constantly. If I go in public, I keep a 3 ft distance from people (droplets only got 3ft from people coughing), and sanitize every time I touch something I know a lot of people have touched. Shopping carts, escalators, money...before I eat or even put my hands near my face for anything I wash them. You can protect yourself without being in a bubble. I have the same regimen as you, just without the neulasta. You’re probably getting a little cabin fever going on if you’re staying cooped up all the time. I was told to get out and walk a little everyday, and that helped a lot. Being back at work has been a tremendous help so that I’m not sitting at home wallowing. Hope you start feeling better soon, hopefully it is just from chemo and you haven’t caught a bug. I don’t know where you are or what the weather is like, but fresh air might help too. Tina.",
      "MessageIndex": 808,
      "PostDate": "27/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 28, 2017 05:13PM Mom4gma3 wrote: welcome jods520- we have all been exactly where you are......wondering... am I going to be sick, tired in pain. Anything you can think of everyone has worried about. Most of us are through round 2 so far, some further and a few not as far. What I have learned so far is chemo day is a piece of cake, boring and long, but Netflix will travel with some headphones, snacks, lots of water and a nice fluffy blanket to make the day go by comfortably. I don’t think anyone has been throwing up all the time, I haven’t at all yet...today was close but that was my own fault. Depending on your regimen, which is different from mine, the next 3 days aren’t too bad. Taste disappears by day 2. Day 4 is when I started feeling frumpy in round 1 ( tired, digestive issues). Lasted about 2-3 days, then felt achy like the flu was coming on. Ibuprofen kept that under control, by day 10 I was almost myself. Everyone has their own idiosyncrasies with chemo SE’s which we take meds for regularly. Mine is fluid retention, runny nose and watery eyes and heartburn. Others have bone pain, neuropathy, mouth sores etc. there are a few cold capping, I did not. So they can let you know how that is going. Wasn’t worth the effort for possibly not working. Hair has gone for most of us here and we are embracing it with humor!! Good news is, I get an extra 15 min of sleep since I don’t have to do my hair, showers are a breeze, no shaving or plucking chin hairs. It’s all good and 1 more step forward to being cancer free! Tina",
      "MessageIndex": 826,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 5, 2018 01:51PM Mom4gma3 wrote: rljes and klvans we are right in a row on # 3, mine is on the 10th. Not looking forward to it starting all over again. I saw my schedule at work for the following week and I’m scheduled for 55 hours that week, Idk how I’m going to manage that at all. I know what to expect and I stocked up on meds I was getting low on to be ready for it. I feel so bad for everyone locked in where it is so cold right now. It’s cold here but nothing compared to what the rest of you are dealing with, the cold is so isolating. I’ve been here for 5 years now but I still remember the depression every winter living in Illinois. I dreaded it every year. Finally went out and bought a wig today, I wasn’t going to bother because they are so expensive, but I have a few invites where I need to dress up and I want to look respectable so I broke down and bought the wig. My daughter laughed and said I looked like an old lady ðŸ‘µ. Not good for ones self esteem, but it is what it is. Tina.",
      "MessageIndex": 925,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 10, 2018 04:12PM Mom4gma3 wrote: Idk why my labs are always good. I didn’t even ache that much after the second round, not like the first one. I am younger than most, so I’m sure that plays a part in the decent count and less side effects. I don’t have any underlying medical issues except a little cardiac wonkiness. I feel guilty that I don’t feel miserable like some. Tina",
      "MessageIndex": 999,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 26, 2018 10:16AM Mom4gma3 wrote: good morning ladies! I finished my 9 day stretch with work and I am finall off until Monday. Infusion 4 is next Wednesday so I am going to take advantage of feeling good the best that I can before then. I have an appt with the radiation oncologist today and I will see what they say before I decide what I am doing on that route. My main lingering side effect is the swelling. It didn’t get real bad until last night my hands were tight and my feet and ankles were non existent. Got on the scale and I had gained 6 lbs in one day. So took two potassium supplements and ate a banana, took an extra lasix and a steroid pill this morning. Trying to keep the feet up and it’s gone down some. I may get my MO to change my water pill to a potassium sparing diuretic. I just don’t get enough in my regular diet plus all the water I drink leaches it out of my system. Blair2 I am so sorry you aren’t finding relief from anything for your back. Steroids are anti-inflammatory and the may do wonders for your back. I’m surprised they don’t give you any with your chemo, it’s standard here. I take 2 pills the nights before, they give it to me iv before infusion and I take 2 pills twice a day for 2 days after treatment. They give me great energy, keep the fluid down and make me ravenous. Hope everyone has a great start to their weekend!! Gasparilla craziness tomorrow and it’s supposed to be near 80, I can’t wait!!! Tina.",
      "MessageIndex": 1183,
      "PostDate": "26/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Nov 30, 2017 01:11PM - edited Nov 30, 2017 01:11PM by Mom4gma3 Thank you, trying to get a handle on what to expect next is the worse part. Everyone is different and every tx is different, you just feel like you are wading in the middle of the ocean waiting for the shark attack. Lol.",
      "MessageIndex": 325,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 4, 2017 09:04AM Mom4gma3 wrote: Is anyone still working? I plan on going back to work on the 12th. I wanted to see how I felt through the first cycle and schedule my job around the bad days, even though it will be unpredictable in the future. I know there are worries about being around sick people, I do dialysis for my patients and most of the time they aren’t sick, but I do have access to PPE when it comes to masks and sanitizer. I just can’t sit here anymore. I’m loosing my mind. I’ve been out since surgery on the 5th of November. It’s going to be rough because I’m on my feet for 10 hours straight, but just wondering if anyone has attempted to keep working and how it went",
      "MessageIndex": 380,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 6, 2017 12:44PM Mom4gma3 wrote: hope99- the stage is really just size and metastasis, mine is 1A, it was 7mm when I found it, it was 1.6cm by the time they removed it. Still a 1A due to size but it had grown exponentially in 4 weeks. That being said mine is a grade 3, that tells you how many abnormal cells are visualized. Higher the grade the more abnormal with 3 being the highest. I’m HER2+ so I know that’s what’s feeding my tumor, so herceptin is the med they are using to block that. Lymph node involvement let’s you know if it’s travelled. Triple negative becomes more difficult because they don’t know what’s feeding it. The other numbers you get are the oncology score (which I don’t have) and your ki-67 which mine is 70%. That is the rate of growth. The one I had was growing extremely rapid. If I hadnt found my lump purely by accident, I would have been in big trouble. So stage really has little to do with the big picture. They removed all of mine, but if they missed anything it will come back, so I have to do the chemo. Blair2- glad today is a good day today for you too (for the most part anyway). I wish I was getting my numbers today like I was supposed to but MO is on vacation so just watching for signs of low numbers. Today has been my best day so far, hoping we are good for the next two weeks. Tina",
      "MessageIndex": 446,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 02:05PM Mom4gma3 wrote: hope99- I’m er negative so I can’t at least from what I have read. It’s for er positive cancer. Tina",
      "MessageIndex": 490,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Feb 20, 2018 08:51PM Mom4gma3 wrote: Good evening ladies! I haven’t posted much, but no news is good news. #5 tomorrow, I’ve got my bag and lunch packed and ready to go. Frozentoes- I was really worried about lymphedema, I have seen what it does to a person in several patients. My dr did a sentinel node mri before my surgery. This will sound horrible (and it really was awful) but they gave me injections into my nipple and traced the path of the lymph nodes. That way they knew which ones fed where in the body and they could avoid the ones needed to drain fluid to the arms. Idk if they do this for all surgery’s or only specific ones. It was worth it, no signs so far of lymphedema, but I really wanted to punch the radiologist and I called him a choice few names, it hurt that bad. Pain was over as quick as he did it but OMG! Meowmmy- sorry about your fur baby, mine is getting older by the day and I worry about the day I have to say goodbye. He’s almost 11 but he has bad hips and some questionable spots that may be cancer. I just keep him and happy and pain free as I can until the day comes. We love them with all our hearts and miss them when they are gone, but always do right by them no matter how much pain it causes our hearts. He won’t be my first to say goodby to, and not my last, but he holds a special place in my heart as I know yours did. She was very beautiful! Good luck to everyone making their rounds this week!! Tina.",
      "MessageIndex": 1367,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 05:53PM Mom4gma3 wrote: Today was the first day I didn’t need to lay down and rest! Go me! Although I got a new symptom but I think I have it figured out. My stomach keeps cramping something fierce, I did a little research and I am either dehydrated, which okay I have been a little lax on the water lately, or my white count is down and it’s causing a little instestinal upset. So I was good girl and chugged a bottle of water and it eased up some, of course then I proceeded to eat 6 spicy chicken wings and I will be paying for that tomorrow, but it was so worth it!!! Okay tomorrow I won’t think so, but we all swear on Sunday mornings we will never drink again and oh yeah we do it again. So I may say I will never do the chicken wings again but it will be a lie so I won’t bother. Welcome Diveslikeagirl a girl to our little corner of the board, I wish I would of though to creep in October to find out all the ins and outs ahead of time. Instead I walked into my first chemo like a deer in the headlights. Live and learn. Tina",
      "MessageIndex": 499,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 9, 2017 06:57AM Mom4gma3 wrote: Hope99- I think some start chemo before surgery to get any spread sooner. If you have surgery first you have to wait until you heal from surgery before they can do chemo because your surgery won’t heal very well once chemo starts. My cousin is 4, he was diagnosed with Wilma tumors on both kidneys in may 2017, they did chemo from may until August trying to shrink the tumor on his kidneys. It worked a little on his one but in August they removed his really bad one. Now he’s back doing chemo but not as aggressive as they were. so that would be the reason behind chemo first. I was glad they did mine first because they put the port in at the same time and I was relieved the tumor was gone because it was growing so stinking fast. As a nursing professional I can understand the reasoning behind doing chemo first, but as a patient I would rather have it out ASAP! Since yours was in the nodes they are wanting to destroy any cells that have escaped through those nodes before they worry about the cells in the breast. It’s way more important to stop any cells from growing anywhere else. They are doing the right thing. Have Faith Hope99! Tina.",
      "MessageIndex": 512,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 13, 2017 04:29PM Mom4gma3 wrote: rljes- we don’t have scrub caps at work but they would still notice, I really do have a ton of hair. It’s shedding like crazy and kinda getting annoying. I almost stopped today and cut it shorter, but chickened out. I keep it up at work so it won’t shed that much but it won’t be long now before it’s noticeable. Blair2- I’m sure the bumps will thin out some. After my lumpectomy I had bumps at the edges of all my incisions, I think it was the dissolvable stitches, once they dissolved the bumps disappeared. Hope99- take it one day at a time girl. You got this. You are already stronger than you were when you first started on this group! As for the extra steroid, I am supposed to take 2 pills so it shouldn’t hurt you, but check with your MO to relax your mind. Tina",
      "MessageIndex": 616,
      "PostDate": "13/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 14, 2017 03:57AM Mom4gma3 wrote: 19501952- I had horrible reflux, and that’s a symptom Thad didn’t go away, it got better but was still there. I was taking Zantac but it didn’t give relief for very long, I switched to Prilosec and it’s been gone ever since. Prilosec is just 1 time a day so for those of us that are pill heavy, I prefer less pills. Tina",
      "MessageIndex": 625,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Apr 11, 2018 04:16PM - edited Apr 11, 2018 04:18PM by Mom4gma3 iris- my feet started swelling after my 4th chemo and never stopped. I've been on lasix daily since then. Idk which med caused it, but if it's the herceptin, it's here to stay for a while. I have neuropathy now, which started a little after my 4th and worse after my 5th. Last week she put me on b12, l-glutamine and folate for that, and it seems to be helping.i hate the swelling because it's Florida's and swimsuit season and I have no idea what my weight is because it fluctuates so much. I started a new diet to try and get some of it off. I thought i would loose weight during chemo, no such luck. Blair2- I am so glad they are working on your back pain. You suffered way too long with no real answers. Hope you find some relief soon. Just finished my second radiation treatment. The first one took forever with all the X-rays they were taking. I didn't even know they did my actual radiation until she told me I was done. I paid more attention today, no I realize the radiation part is the machine with the teeth like the movie alien. Every time I look at that thing with the teeth opening and closing that's what I see! Tina ",
      "MessageIndex": 1644,
      "PostDate": "11/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Apr 12, 2018 02:26PM Mom4gma3 wrote: hope- it makes my feet feel numb, mostly my toes and the bottom of the front half of my foot. It is sometimes painful when I am in bed and interferes with my sleep. I worry because I am on feet all the time and I am not sure if I would feel pain if I had any. They mostly tingle and like you my right is worse than my left. I even get it in my right fingers from time to time. Blair2- praying He mri reveals a solution for you! As for blurry eyes. I got new glasses the day of my biopsy, they weren’t any good to me until 4 weeks after chemo, just used cheaters. It was like my whole prescription changed. Tina",
      "MessageIndex": 1654,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 23, 2017 09:53AM Mom4gma3 wrote: Day 3 post infusion.At work, very fatigued and a little tummy rumbling but that’s about it. Ate a good protein full lunch and hopefully I will perk up a bit. Doesn’t look like I’m getting the early day. Probably 4 more hours but it’s OT, so it’s all good. Tina",
      "MessageIndex": 752,
      "PostDate": "23/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 31, 2017 11:28PM Mom4gma3 wrote: I want to wish everyone a Happy New Year! Decided to go out with my boy down to Clearwater Beach and join the festivities, watch the fireworks at midnight! It’s cool out so a stocking cap doesn’t look out of place! Me an by oldest!!",
      "MessageIndex": 876,
      "PostDate": "31/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 2, 2018 08:01PM Mom4gma3 wrote: LizabethM- it is very cold here right now. Someone posted snow in st Pete last night. We aren’t used to it and our vehicles definitely aren’t. Idk if I have antifreeze in my truck, I never have to mess with it. Praying I do, they usually take care of that when I get my oil changed. Most in Florida don’t even own a heavy coat, I know I don’t. I had to wear a hoodie to work today, and a warm cap for the naked head!! Jrzygrl- I’m not a nurse but I am am a tech, and I have been in nursing for 30 years. Hospitals are hard places to go to work when on chemo. I run patients on dialysis and for the most part my patients aren’t sick. It is flu season so there are some colds floating around. I wear a mask any time I am within 3 ft of my patients on days 7-14 just to be safe. Going back to work has been a Godsend. I went to work the day after chemo two and worked straight through this cycle. 12 hrs day/4 days a week. I had way less SE’s while I was working. I am also on fmla but now I am in intermittent, only if I need it. Tina",
      "MessageIndex": 895,
      "PostDate": "02/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 10, 2018 10:10AM Mom4gma3 wrote: rljes- so glad yesterday went well, sorry you aren’t feeling well today. I had to switch from Walgreens to cvs after they called in my first scripts because Walgreens no longer take my insurance. WTH, it’s 3 blocks from my house and now I have to drive 1.5 miles to CVS I have UHC, I have no clue why Walgreens no longer accepts it. Hopefully your problem is solve with Walmart, I don’t like using them, the wait is so stinking long there. Tina",
      "MessageIndex": 995,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 10, 2018 04:56PM Mom4gma3 wrote: Sdk- I had to go back in the posts to find what I was looking for but I had my 3 tx today and my legs are so weak. I take the stairs at chemo (it’s on the second floor) and in the parking garage. I was exhausted by the time I got to the car. I watched tv for a bit and went to let the dog out and they are like noodles. Hope I can move them in the morning, I have to be there at 430 tomorrow am. And Friday at 500. Then I’m off until Monday. I am sitting here trying to decide if I could crawl out to my truck if I have to. Lol. I can’t be stuck in bed. Did they give you anything to do for it? I already take claritin daily. Tina",
      "MessageIndex": 1002,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 14, 2018 01:07PM Mom4gma3 wrote: hope- I’m a Pittsburgh fan all the way! I am all dressed in my Bettis jersey, Pittsburgh stocking cap and sweats! Even have my terrible towel ready! I would die without my caffeine, I can’t drink soda because it just tastes horrible, but I have to have my coffee in the morning. Blair2 I am sorry you are feeling so miserable. I’m achy and tired but I refuse to let it beat me. I dosed on and off most of the morning. Running out to the store helped a bit. Put some Parmesan chicken and fries in the oven and turned the game on. One thing I haven’t had is lack of appetite, I wish I did. Some things taste bad but I am hungry so I can eat. I’m working on getting my weight down so I’m trying to be really careful about what I eat. Sticking to lean proteins shakes and fruit. Today is my cheat day, but I dropped nearly 10 lbs last week but I know part of that was water. Tina",
      "MessageIndex": 1045,
      "PostDate": "14/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 17, 2018 07:06PM Mom4gma3 wrote: kat- your puppy looks just like mine just younger, mines and old boy now. Blair- I am so sorry you are doing so bad this go around. I’m finally feeling normal, still some aches and pains and the runny nose which makes me crazy. Meowmmy- I found my first seroma last week, so it was 2 months 5 days after my surgery. It was pretty painful but it’s better now. It’s still there just not as painful. Klvans- so sorry about your mom. I couldn’t imagine having to go through that on top of everything else. Since we are sharing- I am 46 and I got my diagnosis on oct 5- 2 days before my 46 Birthday. Makes me one of the younger ones, but I sure don’t feel like it some days. There’s my boy bringing me his duck! Always has to have something in his mouth. Tina.",
      "MessageIndex": 1095,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 31, 2018 03:46PM Mom4gma3 wrote: well all done with infusion 4 she didn’t stop me so it looks like I’m going to 6 but she did cut the Taxotere by 20% and she reduced the carbo hoping it cuts back on the edema. Nothing out of the ordinary right now but the weak muscles which is just par for the course. Regardless I still took the stairs out of the hospital and into the parking garage, even though it was an effort going up two flights. Back to work tomorrow and Saturday, but it’s a light schedule. Looking forward to loosing all this fluid in the next week even though I know it’s going to come back. Tin",
      "MessageIndex": 1229,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Feb 3, 2018 12:57PM Mom4gma3 wrote: rljes- yes I have to do 4 weeks of Rads, 5 days a week. Luckily they are scheduling me the last appt of the day so I can work. Meow- love the scarves. I stick with bandanas because they are just easy to throw on at 4 am. And I hate wearing the wig. Blair2- don’t think of yourself as a failure ever! You have given everything you had and then some. You have suffered so much more than the rest of us and are still willing to go further. I give props to your MO for taking the option off the table for you and not leaving the choice up to you. (Even though she would of given you the last Tx if you pushed). They know how you are suffering, and as bad as chemo is, no one should have to suffer needlessly. Hoping this starts to improve your health and brings you some peace and relief. Because deep down you had to feel some relief from know you won’t be subjected to anymore chemo. I know I would have no matter what. You just move forward from here and that’s that. No looking back. Tina. ",
      "MessageIndex": 1256,
      "PostDate": "03/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Feb 26, 2018 05:40AM Mom4gma3 wrote: Kate- I use the Prilosec and it has done wonders for me. I feel you for the tiredness and worrying about how you are going to feel at work. I feel like crap today but I’m trudging on, now I have someone who says oh they can’t close tonight, so someone has to do it and I’m afraid it’s going to be me. That makes a 16 hour day on top of feeling like crap. This has definitely been the worse tx with the tired and Short of breath. Couple more days and I will perk up but I have just been exhausted all weekend. I wish I would of brought my steroids to work, I would of popped one just to give me a little energy. Just keep facing forward and thanking God this was my last one and I don’t have to deal with this any longer. Tina",
      "MessageIndex": 1400,
      "PostDate": "26/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Mar 20, 2018 06:58PM Mom4gma3 wrote: good evening ladies!! I am definitely feeling hair envy, 4 weeks PFC and still hardly anything growing up there. I still don’t need to shave and lucky me, most of 1 eyebrow fell out. Really??? Now!!! Neuropathy started after 4th chemo, just minimal but after 5 my feet are pretty numb and tingly. Just feel cold all the time. Still swelling like crazy, all the lasix is causing me to have really low potassium so I have added supplements to my daily meds along with biotin. Come on hair!!!! Slowly getting off all the meds I was put on for side effects, down to vitamins, lasix and the occasional steroid well swelling gets ridiculous. Still weighing my options for rads, I was on board until another technician at work put their notice in. So now we are 5 short starting April 1st. So now it’s up in the air again. I need to decide by April 4th which is my initial appt pre rads. I did get my echo today, I will check my online portal and see if the get it transcribed by tomorrow. Otherwise no new is good news and hopefully I don’t decrease more than 15%, changing tx days will really throw a monkey wrench into the balls I juggle every day. So happy for all of us for finally making it across the line with chemo. Everyone’s journey is different, but everyones journey is towards the same goal. We are rocking it no matter how we chose to take our path!! We should be so proud of ourselves and treat ourself to something special. Something frivolous, that you wouldn’t normally splurge for yourself. That way every time you look at it you can give yourself a sense of strength and empowerment! Tina",
      "MessageIndex": 1514,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Apr 15, 2018 05:14AM Mom4gma3 wrote: klvans- I am the same with my hair, the pack looks pretty decen, it’s coming in normal andnthick, but I’ve got this horseshoe thing going on in the front and it’s not growing very fast!! I just want to quit wearing caps all the time!! I may have to trim it a little, I have these stray hairs, that are two inches long, sticking up in random areas. My eyebrows went south way after I finished chemo and they are finally coming back slowly. Crazy how long the side effects are lasting. My nails are still shot, but I did put gel polish on them here at home in the hopes to keep them from breaking off. They were fine during chemo and they are shot now. Grrr Tina",
      "MessageIndex": 1664,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Apr 22, 2018 06:17AM Mom4gma3 wrote: good morning ladies! So here is one that I don’t think has been put out here yet. Since there has been so much going on with all of us, I know it’s been the furthest thing from my mind, but now it’s front and center so I thought I would ask all the single ladies anyway. Is anyone dating? If so how do you handle it? I hadn’t no plans what so ever, I figured I would get through what I needed to and then go from there when I felt and looked more normal. This kinda just fell in my lap and now I’m not quite sure what to do with it. I’ve known him a year, so he knows me before and after. But I am so self conscious about how I look now, between the weight, scars and hair. It’s intimidating. We spent all weekend together with others as a group, but last night we went out alone and hung out by the beach and just talked. Today we are going to the flea market. I guess im just nervous and wonder why he would be interested at all. He is also a little bit younger than me which is unusual for me. Idk just wondering how everyone is handling the body image changes. Tina",
      "MessageIndex": 1693,
      "PostDate": "22/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Nov 30, 2017 12:37PM Mom4gma3 wrote: How soon after treatment should you start feeling sick? I had my first treatment yesterday, and nothing. Not wanting I look a gift horse in the mouth, but no nausea, no stool issues. I’m taking my steroids like I’m supposed to but haven’t touched the zofran or compazine. I just keep waiting for the shoe to fall and I actually feel great.",
      "MessageIndex": 322,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 3, 2017 06:19PM Mom4gma3 wrote: Still hanging in there here. No nausea or vomiting, felt the need to make pizzas today so I ran to Wally World to get everything and then stopped at wawa to get a cappuccino with a protein shot (at least I still love coffee and chocolate) and by the time I got home I was just beat. Laid on the couch for a couple hours, then got up to make the pizzas and I couldn’t function, sweaty lightheaded, thought I was going to be down for the count. Fought through it and feeling better now, but wow. Little aches and pains but nothing severe. Trying to avoid extra meds at all costs, but my vitamins and Zantac because heartburn is killing me. This is day 4 for me, and thinking tomorrow may be the start of my downhill trend. Felt good enough yesterday that I went fishing and hung out with friends for a few hours. Maybe that’s why today was rough. After today I can see how easy it is to forget to be careful. We don’t know what each day is going to bring. Tina",
      "MessageIndex": 369,
      "PostDate": "03/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 4, 2017 12:26PM Mom4gma3 wrote: I know work will be supportive and flexible so that’s a big plus, I am a single person so I have to get back to work to pay bills. I only have about 8 weeks paid time off and I don’t want to use it all up now. Luckily all my kids are grown so no worries there. Larajv- I was halfway through nursing school when this came about, they basically said sorry you can’t continue and that was it. Being in nursing my whole life it’s hard to not be able to do your job and care for people. It’s what we need in our lives. They should have given you a lighter load when you returned, and made sure they were the safest patients possible. My mom made me go for a walk today at the park, she has become my personal cheerleader making me get up and move. As long as it’s before noon I do pretty good. But good Lord it’s crazy how weak we have become. Strength and prayers to everyone... Tina",
      "MessageIndex": 387,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 4, 2017 03:35PM Mom4gma3 wrote: Blair- no fever here, but I check it twice a day, crept up to 99.8 but never any higher. Hopefully it will start coming back down soon. My MO didn’t want me taking anything for fever because she wanted the temp to fight any infection. Was everyone told the same? What’s everyone’s plans on their “hair”? Are we cutting short before hand or waiting it out and praying to hold out at long as possible? I thought about cutting, but then what if it doesn’t fall out right away and I cut it for nothing. Hope99- As hard as it is....don’t make yourself crazy. If you file away every piece of information and SE that you are given, you will lose your mind. Absorb each step a little at a time. I took the common SE and prepared for them. Grabbed suggestions from others to have on hand. IE: ginger, lots of water, bag for chemo, lotions, mints, mouthwash. Then take each SE as it comes. I track mine on Chemowave. So far I have been very lucky, day 5- no vomiting, little nausea, horrible mouth tastes,some fatigue and aches and pains. Every combo is different and person is different. I believe in mind over matter, you have to be strong mentally to be strong physically, don’t let the fear overrule that. Tina",
      "MessageIndex": 393,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 5, 2017 08:23AM Mom4gma3 wrote: Feel pretty good today, except for tired from lack of sleep! Big D hit yesterday which I was kinda grateful for, feel loads less bloated. It just decided to hang out all evening and through the night. So sleep was sporadic all night. Seems better this morning, if not I will grab Imodium but I don’t want to take that route if I don’t have to, it will start the cycle all over again. Need to get my sheets and blankets washed today and a long hot bath, see if it gets me feeling human again. New symptom today is a runny nose. Literally just sitting here and it starts running out, everyday is something new. Also facial “bumps”, I have a few on my face and my neck, they hurt a little. I’m going to try a couple different skin care tricks and see if they will disappear. Learning to deal with my food tolerance, soda is so horrible right now I might as well be licking my grill. Ex had a suggestion, thinks since I drink diet that maybe it’s the fake sugar that tastes so bad. May test that out today. Unfortunately or fortunately depending on how you look at it chocolate and sweets still taste amazing. Cheese is way too salty, and I normally love cheese. Protein shakes are my go to, may have egg beaters this morning but it’s going to suck not having cheese in them. Tina Day 6- Keep moving forward...ðŸ‘ŠðŸ»",
      "MessageIndex": 404,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 6, 2017 07:58AM Mom4gma3 wrote: I am using the biotine mouthwash and so far no sores. I bought a couple packages of the really cheap toothbrushes since I normally use the spin brush and figured that was too harsh. Besides hair loss, mouth sores were my biggest fear. I’m trying to be proactive there. Mkn86- the proportions I got were 3:1 ratio. To me that’s pretty strong but I guess they ant it that way. Tina",
      "MessageIndex": 440,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 7, 2017 12:44PM Mom4gma3 wrote: hope99- I am 46, as for checking the performance, I was told that they could do a head to tow PET scan and still miss a cancer cell which is why I have to continue with the chemo. I’ve contemplated many times not doin the chemo since they believe they removed all the cancer and my nodes were clear, but I decided it isn’t worth the risk of something getting missed. Tina",
      "MessageIndex": 457,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 9, 2017 02:24PM Mom4gma3 wrote: Shopping day was good, didn’t get tired but I was freak every time I had to touch something. Hand sanitizer after everything and didn’t get myself crowded between too many people. Gave myself bangs...that was about 10 inches I cut off.. baby steps. I may to a pixie but I haven’t decided yet. My hair is so thick and curly I need to find the right one. But the bangs will cover the forehead breakouts. Tina",
      "MessageIndex": 529,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 12, 2017 07:21PM Mom4gma3 wrote: OMG I just took my hair down from work and brushed it out and I had to empty my brush twice. Ugh! It’s starting! Luckily I have about 5 lbs of hair, it’s going to take a bit before it’s noticeable.",
      "MessageIndex": 599,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 16, 2017 10:47PM Mom4gma3 wrote: rljes- I’m ready for the next round. My side effects weren’t horrendous but I am going to be working through this cycle. MO change a few things so that I’m not so tired. I am concerned about working when the big D hits me though. Still haven’t did anything about my hair yet, I have probably lost half of it but it was so thick that it’s barely noticeable, I can tell there is a huge difference but no one else can. Although I can see my scalp a little more at my part. Love the pic! You have a great shaped head. I have big ears and OMG are they going to stick out!! Blair2 I am so sorry the muscle relaxers didn’t work. I have lower back pain when I am at work and I just turn the heat and vibrate on one of the patient chairs and sit there a little bit and it helps. I couldn’t imagine going through it all the time. I would try the chiropractor, at this point it couldn’t hurt to at least try it. Went and saw Star Wars tonight...amazing. Going fishing tomorrow with my boy for his 30th birthday. Sure makes me feel old. Got to enjoy this weekend before the next round. Have 1 person left to finish for Christmas! Hooray! Tina",
      "MessageIndex": 655,
      "PostDate": "16/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 18, 2017 11:52AM Mom4gma3 wrote: klvans- I just take beano or gas-x. It seems to do the trick. Meowmmy- I didn’t have any scalp pain just tingling, it’s coming out pretty good now. Tina",
      "MessageIndex": 668,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 18, 2017 05:51PM Mom4gma3 wrote: Well ladies I thing I am going to have to take the leap and shave my head. Ugh. I had to wash it today and that was a big mistake. I pulled out just as much after my shower as I did in the last week. So basically it looks like the Chewbacca in my wastepaper basket multiplied. For future reference I know what dreadlocks feel like and I never want them. I did get all the dreds removed but when I braided it I can see my scalp through it. I’m going to let it dry and see what it looks like then. I never realized how much I had until I see a completely full bathroom can and I still have quite a bit on my head. Tina.",
      "MessageIndex": 677,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 22, 2017 07:50AM Mom4gma3 wrote: Blair2- I saw this on FB today and I know the properties of ginger and turmeric are amazing, but this is all second hand so idk really know if it works or not. But someone was going through back pains and they started a regimen using this supplement and they got relief the first day. So I thought I would throw it out there. I know one more pill sucks but if it works it’s worth it. The picture is what they had and they said you can take up to 2000mg per day. But maybe do a little research on it and see what you can find. If anyone tries it let us know. Tina",
      "MessageIndex": 731,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 25, 2017 05:51AM Mom4gma3 wrote: mkn86- the taste bud thing really has gotten to be a downer this year. Mostly it’s drinks for me. Only water and coffee tastes good. I really pigged out yesterday, but no midnight margaritas because they just tasted awful. Have to save what’s left for when my taste is back. Hope everyone is having a great holiday! So far still no SE’s this go around except a little fatigue but it’s really not bad at all. Still regular in the bathroom department so hoping that holds since it’s back to work tomorrow. Last day of my new steroid regimen today so no more tomorrow. We will see if the energy goes with the steroids. Tina.",
      "MessageIndex": 767,
      "PostDate": "25/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 27, 2017 07:56AM Mom4gma3 wrote: Blair2- I know my steroids are for the carboplatin, it can cause inflammation around your heart. Not sure about everyone else. I suppose it depends on the regimen you are on and your MO, I just know I get tons of energy from it and I’m hungry. Tina",
      "MessageIndex": 796,
      "PostDate": "27/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 29, 2017 07:48AM Mom4gma3 wrote: Good morning ladies!! I hope everyone is well into recovery mode after their last rounds. Today is so much better than yesterday! The extension of the steroids put my SE’s further into the week and gettting through work has been a challenge. Bid D keeps starting at 1 am when I have to be up at 4, toss two Imodium and it keeps it at bay, but the achy feeling is annoying and nausea and sweats started yesterday. Took ibuprofen before work today and have compazine on hand if needed. 12 hours today and off tomorrow. Yeah me. Made it through the 4 day stretch. Keeping my mask affixed to my face near patients, hand hygiene non stop. Day 9 for me so numbers are tanked I’m sure. So protection prevention. Getting ready to roll in the new year. Thinking pineapples margaritas since my taste is back! Tina",
      "MessageIndex": 841,
      "PostDate": "29/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 30, 2017 07:34AM - edited Dec 30, 2017 07:41AM by Mom4gma3 Frozentoes- I'm 46 aand single ( marriage doesn't agree with me, tried it 3 times) who works full time and was in school for my RN. I had friends in school, but they told me I had to quit because I couldn't do clinicals with chemo, so I don't really hear from them at all anymore, except 1 who works at my MO office. I took me 20 years to raise my kids and go back to school and this happens halfway through, idk if I will try it again. I had such plans for when I finished. I share a house with my mom and my oldest son, but all my other kids and grandkids are spread all over the country so I don't get to see them. I had a male “friend\" I would go out with a couple of times a month, but he has just kind of faded into the woodwork. I get a text every once in a blue moon. Saying hey let's get together for dinner or whatever and I let him know my schedule and then I don't hear from him. So I think that's a wash. He was a good friend too. I miss talking to him. So I work, a lot. It's not like we can join tinder or dating apps right now. My son is my plus one for my Christmas party next week, and his friends (who are mostly my age) are my social contacts. It's funny, we go fishing and out to play darts or pool. I am the designated driver since I'm not drinking and it's gives me a chance to get out of the house and socialize. They really have been great and they don't ask stupid questions and act just like they did before all this. So now that I'm a little teary-eyed writing this down, I feel a little better realizing who you're true friendsare. On a good note I slept 9hours straight through last night, no big D and feel great this morning. My mom bought a whole cut up fryer chicken and is making her fried chicken we had as kids in my new electric skillet I got for Christmas! Made Swedish meatballs in it Thursday, I love it!! Have a great weekend ladies! Tina",
      "MessageIndex": 854,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 30, 2017 07:41AM Mom4gma3 wrote: blair2- if you go under the freebies tab there are places we can go for free when this is all over. They are like weekend trips and getaways but it’s something I looked at once. They have them all over so people can go. I haven’t looked in a while so I don’t remember where all of them were. I know there was one here in Florida that I was eligible for, that I may look into later. Tina.",
      "MessageIndex": 855,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 31, 2017 07:58AM Mom4gma3 wrote: blair2- I got a sea salt scrub from a flea market ages ago for my hands. I am using it on my head. It scrubs the loose hair and itchy scalp and after I rinse it off it leaves an oil behind. Then I lotion it up when I get out of the shower. It’s working wonderfully. Tina.",
      "MessageIndex": 864,
      "PostDate": "31/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 8, 2018 04:41PM Mom4gma3 wrote: rljes- luckily he was just an ex-boyfriend, he text me last night because since we broke up I haven’t asked him how he is doing...really??? So I kind of went off stating I am so sorry with everything else going on that I haven’t found time to deal with your insecurities too. He text back apology accepted. Hmm...not really what I meant. Such and ass. If his truck wasn’t still in my name too I would just block him and be done. Grr... Trying to come up with a plan to deal with the steroids that I have to start tomorrow night. I am so hungry when I am on them that I have gained to much weight since I started chemo and now I can’t get it back off. Made a whole pot of chicken and cabbage soup. High protein and low calorie. Hoping I can just eat that every time I’m hungry and avoid the junk! Good luck ladies with round 3 this week!!! Tina.",
      "MessageIndex": 970,
      "PostDate": "08/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 10, 2018 09:18AM Mom4gma3 wrote: Craziness this morning. Got to Susan Cheek, they accessed my port, drew my labs and then it’s off to next door for dr appt while waiting for labs to come back. Labs great, wbc 9.5 hgb 11.2 still waiting for the cmp. So I tell MO I am having a little bit of incision pain. And there’s a little lump in there. So she wants me to go down to have an ASAP U/S, so off I go. This takes an hour and a half. Finally the dr comes in and says the think it’s a seroma, explains it and now I am in the chair for chemo. At least it wasn’t anything worse, you can imagine the thought that we’re running through my head while I was waiting. A little possible good news, they may cut me from 6 chemo to 4. She said she would decide later. So now time to relax, eat and watch the Ranch! Love me some Sam Elliot. Tina",
      "MessageIndex": 993,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 13, 2018 10:11AM Mom4gma3 wrote: hope- it’s The Taxotere that they say is causing all the edema, the steroids don’t help either which is why I play with them so much. By the time I get it figured out I will be done. I don’t get time to rest normally and I think That’s why it's so noticeable on my legs. I am literally on my feet for 11 hours or so running around all day. I took a little nap this morning since sleep was evasive last night. Heading out for a short shopping trip after I can find something warm to wear, it’s getting colder here as the day goes on. Bald head makes for cold body, maybthrow a wig and a hat on. Even beat my mom to turning on the heat this morning and she is always colder hands I am. Hope everyone enjoys their weekend! Tina",
      "MessageIndex": 1033,
      "PostDate": "13/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 14, 2018 09:55AM Mom4gma3 wrote: blair2- I haven’t taken any nausea meds this time. But I have only taken 3 total since the start. I don’t like meds and only take what I need when I need them. I figure the side effects from meds can sometimes be worse than the ones from the chemo, so I don’t want to add to what I already have. So far no big C or D but I am waiting for it. The fatigue is kicking me down this time, but it seems to let up once I rest for a bit. It would help if the neighbors dogs would bark at 5 am and wake everyone up. I think tomorrow is going to be a challenge at work but I’m off Tuesday and I should be back to normal Wednesday. The cold here isn’t helping, it’s sapping any energy I have, I’m going to bundle up in a little bit just to get out of the house before football game at 1. Grabbed some chicken wings and fries for the game and will hunker down the rest of the day. Every morning is one day closer to being done!! Tina",
      "MessageIndex": 1041,
      "PostDate": "14/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 15, 2018 04:24AM Mom4gma3 wrote: hope99- I can’t help you with possible period issues since I haven’t had one in so long and don’t have the equipment for one. Maybe someone else has some thoughts. Most of us are older or had a hysterectomy as well so we don’t have to deal with that on top of the rest of the issues. I’m sorry you are having such a rough go with all of this. Hoping you feel better soon. Tina",
      "MessageIndex": 1051,
      "PostDate": "15/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 31, 2018 08:28AM Mom4gma3 wrote: yeah it’s the her2+ and the ki-67 of >70% plus a grade 3 for aggressive. I don’t get the onco score I get the other numbers instead. It tripled in growth in 4 weeks so they were starting out fairly aggressive against it.",
      "MessageIndex": 1225,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Feb 10, 2018 04:40PM Mom4gma3 wrote: hope99- I haven’t had any pains from my Taxotere, just the swelling in my feet. The only aches and pains I have are when my counts are low, which after my 4th infusion I haven’t even had the aches which should have started on Thursday, but she did decrease my dose which may be why, my SE’s were nearly non existent this go around. Tina",
      "MessageIndex": 1301,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Mar 2, 2018 11:24AM Mom4gma3 wrote: rljes- I am supposed to do rads next but I am still weighing my options. I have an appt in April and I will decide by then. Tina",
      "MessageIndex": 1410,
      "PostDate": "02/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Mar 13, 2018 09:47PM Mom4gma3 wrote: Rljes- I remember being told I would have to have an echo every 3 months on herceptin. They did one in the beginning but haven’t since. I am going I have to ask about it when I see my onco tomorrow. Not that I want to do another test, but I already have a wonky heart, I don’t want it getting any worse. Tina",
      "MessageIndex": 1474,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Mar 29, 2018 05:52PM Mom4gma3 wrote: rljes- I haven’t noticed any side effects from the herceptin. My numbness in my feet is still there, but it started after chemo 5 so I don’t think it has gotten any worse. Still have swelling, again I think it’s left over from chemo. So I really can’t tell what’s hanging on and what hasn’t left yet. Hair is like a baby duck. Soft, fuzzy and white. My nails are worse. It’s like they aren’t attached from halfway up, I just keep them real short so they don’t rip off. One tore off pretty short. Still have heartburn. But no nausea, or tiredness. Still have weakness in my muscles. I signed up for a free 5 day at the gym, but waiting until I know I have may strength back. It’s much better. I am 5 weeks post last chemo, I hadn’t my firstborn herceptin only 2 weeks ago. Blair2- praying for good results on your PET scan. Orangedaisy- so excited for you getting to see your hair again. I think I would go cap free with what you have now. I can’t wait. (Hair envy going on here). Radiation appt next Wednesday, still on the fence there. Lost one more person at work temporarily, she had a bin close on her hand at work and broke it, has to have surgery to pin it. I’m beginning to think our clinic is cursed. That’s or my radiation scheduling is, maybe that’s it. Tina",
      "MessageIndex": 1572,
      "PostDate": "29/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Apr 4, 2018 04:57PM Mom4gma3 wrote: good evening ladies! Saw my onco this morning, don’t have to see her again for 6 weeks, had my herceptin fat 9 and I was out of there by 1015 so that was awesome! Then when to radiation onco at 11 and got measured and tattooed for radiation starting next Tuesday. 3 tattoos l!! On hurt like hell the other two not so bad. Still trying to do this but we shall see how it goes. It’s only 4 weeks and it’s all preventative since everything was clear post op. So I am going I give it my best effort, unfortunately mynpatients come first so it will be whatever it will be. Tina",
      "MessageIndex": 1611,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 5, 2017 05:40PM Mom4gma3 wrote: Rljes-my comfort food today was Chicken pot pie!! Between the heartburn and the big D nothing is sitting well. Hoping it’s passed me now 3 Imodium later some Prilosec and lots of tums. Tina",
      "MessageIndex": 425,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 09:41AM Mom4gma3 wrote: nonahope- I don’t have Medicare so they can pretty much charge what they want to my insurance. All I keep seeing is my 10% copay when it’s all said and done!! Eek!",
      "MessageIndex": 478,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 01:49PM Mom4gma3 wrote: I can’t do the onco type test either hope99, from what I’m reading you have to be er+ for that test. I did do the complete genetic testing for my kids sake to check if I had genetic markers for cancer. Which came back basically negative, I did have a variant though. I don’t completely understand the results but know the doctors do. Tina",
      "MessageIndex": 488,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 08:04PM Mom4gma3 wrote: blair2- they keep saying cold but everyday it’s not! I don’t think they know what they are talking about! But I have a real nice breeze out here today! I’m usually great with water I just think it’s because I have to drink it I don’t want to. Lol. Going to chug another bottle before bed! Hope everyone has a good night! Tina.",
      "MessageIndex": 503,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 8, 2017 10:25PM Mom4gma3 wrote: blair2- no it was my Halloween costume for this year, my mom is huge about Halloween. Figured I would save it for gasparilla this year!! Wind ispicking up and we got a severe storm warning coming through! Fingers crossed for some good rain. I don’t want to fill the pool. Tina.",
      "MessageIndex": 506,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 13, 2017 06:33PM - edited Dec 13, 2017 06:35PM by Mom4gma3 Meowmmy- my mom will shave it for me when the time comes, she wanted to do her own too but I told her no, she's 62 and it may not grow back. That scared her so hopefully she doesn't try it. It's coming out pretty good and it's getting annoying. I have a Christmas party on Friday, my son is taking me as his plus 1 so I am hoping it will keep until then. Fingers crossed. I still may get it cut before then due to me dropping dna all over the planet. Lol. Tomorrow is a half day for me at work since I open at 430, should be off at noon. I will have to make up my mind before then. I was hoping it would hang on through the holidays but it doesn't look like that's going to happen. The only difference between us is you're triple , are they not doing specific hormone therapy for that? Just curious.",
      "MessageIndex": 618,
      "PostDate": "13/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 16, 2017 06:01AM Mom4gma3 wrote: blair2- you are so much braver when it comes to the hair, I am still holding out but it is really annoying unless I braid it or keep it pulled up. I am sure you don’t look like a little old man, it just takes some getting used to. Get some cute girlie head covers! Praying the muscle relaxant works for your back pain. Gloria-Jeremiah29-11- welcome! I may look at that band later after the holidays. It might help while I’m working. I don’t have to deal with the hot flashes since I had a total hysterectomy back in 2009 when I was 37, but I remember how bad they were back then. I didn’t get the hormone replacement therapy because I heard it increased your risk for cancer...hmm go figure. There is an over the counter med called I-Cool that I used every time the hot flashes got bad and it actually worked wonderfully. Maybe check with MO if it can be taken. Cycle 2 is Wednesday, fingers crossed that I don’t have to call out work next week and the following week. We are back in the 70’s here, getting out this weekend to enjoy this beautiful weather before it gets cold again. Tina.",
      "MessageIndex": 648,
      "PostDate": "16/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 17, 2017 08:09PM Mom4gma3 wrote: rljes- she is stretching my steroids out. I used to do two the night before then two am and 2 pm the two days following. Now I am spreading out the post infusion ones to 1 in the am and 1 pm till Friday or Saturday then 1/2 in am and pm Until I have taken all 8 pills, so hopefully I am not so fatigued. I have had no bowel issues since the first week or so, I’m hoping if I can stay away from any extra meds I won’t this time. But I won’t take anything I don’t have to, I hate pills. We will see how that goes. Hope99- I hope you are feeling better, you made it though the first week and that’s usually the hardest. I took tums for my stomach upset and some anti gas pills. All my SE were stomach related so I feel your pain. Blair2- you crack me up! I am wondering what my head is going to look like when it’s naked. Probably like Yoda with these ears. Haven’t shaved it yet but I can understand the inclination, every time I brush my hair a pile comes out. I’m collecting it in the BR garbage can, my son said it looks like cousin IT is hanging out in there. Went to a Christmas walk last nigh, had funnel cake and hot apple cider, saw The Last Jedi...amazing. Spent all day today fishing with my boy and watching football. The steelers lost, so sad. But it was a wonderful weekend anyway. Back to work at 430a tomorrow and Tuesday, second infusion Wednesday. Good luck ladies for everyone hitting cycle 2 this week Tina",
      "MessageIndex": 663,
      "PostDate": "17/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 18, 2017 07:02PM Mom4gma3 wrote: Ok here’s one I haven’t seen yet, and granted I am on my feet for 11 hours when I work, and I worked all day today, but my ankles and feet are huge. They haven’t been this big since I was 8 months preggo. I had otc diuretics on hand so I popped two of them. Most of my symptoms I can pretty much roll with it, but this kinda freaks me out. I am going to the bathroom just fine, but with the herceptin I’m wondering if anyone else has experienced this. I literally have cankles, left is bigger than the right. No swelling anywhere else just feet and ankles.",
      "MessageIndex": 681,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 18, 2017 07:59PM - edited Dec 18, 2017 08:05PM by Mom4gma3 I did it... omg my head is cold and pasty. Lmao.",
      "MessageIndex": 685,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 20, 2017 12:00PM Mom4gma3 wrote: klvans- it was the hardest part for me too. Here is what I took away from it. I should have cut my hair into a shorter style, I think it would of lasted longer. I had to shave it because it was so long it got into a tangled mess in the shower. So I grabbed the clippers and cut it to the shortest setting with no guard. Yeah that looked horrible because my hair is so thick and dark that what hair I still had connected looked patchy. Next day I grabbed shaving cream and a razor and shaved it. I had someone to help do that, but I think real barbers will do it for you. Be prepared...depending on your level of tan, you scalp is so pale, I have a tan line where my part runs down the middle. So to remedy this, I had on hand, lotion from Avon with a bronzer in it, I put that all over my head to even it out a little. I’m not going to do wigs, just hats and a free head. It feels freaky in the car with the windows down. I don’t need a cap at night I like it cold. I’m pretty happy without it right now, less hassle than it was fighting to keep the hair. Tina",
      "MessageIndex": 703,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 22, 2017 05:57PM Mom4gma3 wrote: rljes- I actually used shaving cream and my leg razor for my smooth baby butt head. I think any real barber can do it for you if you don’t want to do it yourself. Netflix suggestions, I’ve been watching The Ranch, season four just came out so I am trying to finish 3. Call the midwife is good if you’re into that. Tina",
      "MessageIndex": 747,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 24, 2017 09:07AM Mom4gma3 wrote: nonahope- went out really early to get the brisket and some fixings for fettuccine Alfredo, so I beat the crowds. May even make some midnight margaritas tonight. I haven’t had alcohol since all this started. Gotta love Christmas in Florida. Relaxing on the patio by the pool watching Christmas movies on Netflix. So far I am very happy with my new steroid regimen, dropped down to 1/2 pill twice a day today, will do the same tomorrow on Tuesday and that should get me over the hump of feeling fatigued. No big C or D this time around but I’m not sitting around either that may be helping some. I was exhausted by the time I got done last night, fell asleep at 830 but I was up at 4. Food and drinks taste like crap but I know that will disappear in week or so. Blair2- I have been using scarfs and crocheted caps, I am not bothering with a wig, it would be too hot and uncomfortable, luckily I have a Santa hat too that has come in handy running around this weekend. Lol. I get into my car and take the hat off because it does get hot, love the breeze through my naked head, but I wonder if people look when they don’t know you can see them looking. If I was a tanned up there I might get ballsy and just go naked everywhere. I’m all about the comfort. Maybe get some head decals like the movie ConeHeads!! Lol. I’m not that brave though. Hope everyone has a Merry Christmas!! Tina.",
      "MessageIndex": 760,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 26, 2017 08:10AM Mom4gma3 wrote: big D kicked in at 1am, figures on my day back to work it starts! Last day of steroid was yesterday so hopefully the tack I am starving all the time goes away. I pigged all weekend and this morning. Luckily it must boost my metabolism a bit because I haven’t gained anything. Living on tums and Imodium today, but I didn’t make it to work just taking it a little easier. Tima",
      "MessageIndex": 776,
      "PostDate": "26/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 28, 2017 06:01AM Mom4gma3 wrote: orangedaisy- funny how you mentioned tips of the fingers. Mine started hurting today, but I type in a touch screen at work all day so I’m assuming I am aggravating it, aches and pains are starting full force today so my numbers are dropping. Took some ibuprofen, get through today and tomorrow at work and then off sat. Hopefully Sunday I will be going back up and feeling better. Everyone have a great day. Tina.",
      "MessageIndex": 814,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Dec 28, 2017 03:06PM Mom4gma3 wrote: Meowmmy I love the scarves, I have know idea how to do that! I know it’s probably on YouTube but I’m too lazy to look. You look amazing in the scarves and have such a cheerful look about you all the time! Keep rocking it! Tina.",
      "MessageIndex": 820,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 12, 2018 06:15AM Mom4gma3 wrote: Congratulations orangedaisy!! I can’t wait for my day to come!!! Tina",
      "MessageIndex": 1016,
      "PostDate": "12/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Jan 28, 2018 08:10AM Mom4gma3 wrote: hope99- I have a friend who I went to high school with. She was was diagnosed with stage 4 untreatable BC 5 years ago. She was given 3 months to live and her MO refused to treat her. She fought and found a doctor who would. Over 5 years later she has beat it. I know she still has to go in every 6 months for scans but she is living her life now when no one said she would. Tina",
      "MessageIndex": 1199,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Feb 1, 2018 05:55PM Mom4gma3 wrote: rljes-the edema is mainly in my legs and ankles. Some in my clavicle area and my face. She said the Taxotere causes it. The lasix helps some but not very well. Today was pretty rough, mostly hip and thigh pain, almost fell in the garage when I got home from work. Luckily I am off tomorrow, I was able to drop my car off finally and get it fixed, so happy for that. They said it should be done tomorrow late morning. Then I have to take it back sometime next month for them to replace a recalled part. So besides that I’m not going to be doing much tomorrow but resting. I have a feeling this round is going to hit me a little harder than the past 3 but we shall see. Strength and good vibes to everyone! Tina.",
      "MessageIndex": 1233,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Feb 8, 2018 05:13PM Mom4gma3 wrote: Meowmmy- our side effects are nearly the same, the eye twitching makes me crazy, I feel like people can see it when I am talking to them. I also have what I asssume is intestinal twitching. I feel like I have a toddler kicking around in there. I just ignore it. Runny nose constantly, claritin helps there, gassy as well, have anti gas meds for that, works like a champ. Can’t be tooting around the patients. One bout of the big D, always at 1am, popped some Imodium, problem solved. Taste is coming back on day 8. No nausea at all, very little fatigue but muscle weakness. I think it’s from just not moving as much as I normally do. I am bought about getting a membership to LA fitness to use on my days off to start some strength training. I worry about who used the equipment before me though. Swelling is starting, I’m taking less lasix and adding the occasional steroid to combat that as needed. Rljes- I have the bruising as well, my platelets were 112 last go around so I’m assuming that’s why. It’s minor but I keep a close watch for anything major and try not to injure myself. I’m seriously accident prone. No mouth sores, but sores seem to pop up elsewhere like blisters, bought some baby diaper rash cream (balmex) and that keeps them from getting worse. Not so bad this go around, but last one it was really bad. On a good note I made lasagna for dinner (even made my own pasta). So everyone is fed for the rest of the week, Florida state fair starts today, so Saturday I am hoping to get my boy out there for day!! Tina.",
      "MessageIndex": 1292,
      "PostDate": "08/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Feb 22, 2018 01:52AM Mom4gma3 wrote: blair2- loving the weather! I keep checking the pool for the magic number so I can go swimming. About 3 more degrees and we are good to go!! Orange daisy- I was worried about my hair growth but not so much now. They reduced both my meds tx4 and I have fuzzy growth, but it’s white. I too had dark hair. I was getting a little scared. Started Biotin 5000 mcg yesterday just to give it a boost! So good news at infusion 5, I am officially done with chemo! Yeah!!! She said my labs aren’t recovering well even with the reduced chemo amount so she is stopping the chemo. So I need to call my radiation oncologist and give her the heads up. Still have to go in every 3 weeks for herceptin and labs at least the next infusion. I may postpone rads a little bit since my March work schedule is already out and I didn’t put in for the time off. But I can get the first appointment knocked out of the way. Tina.",
      "MessageIndex": 1374,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Mar 10, 2018 08:15PM Mom4gma3 wrote: rljes- I am so glad to see your post about rads. I have been trying to decide whether or not to continue with it. I am supposed to go for my first appt in April, but it’s never going to work with my work schedule right now and I heard that it really doesn’t decrease my chances that much, since I’ve already had no node involvement, clean margines on the lumpectomy, and 5 chemo treatments. I’ve been going back and forth on it I should do it or not, is it really necessary. I’m leaning more towards the no. I’m really glad I am born the only one thinking along these lines. Tina.",
      "MessageIndex": 1452,
      "PostDate": "10/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Mar 21, 2018 04:03PM Mom4gma3 wrote: Orangedaisy- I am 4 weeks today so hopefully pretty soon I will have hair growth. I can’t wait until I can quit wearing these caps to work. I’m s way too hot. I love taking them off and feeling the wind when I’m driving. When did the swelling stop? I am trying to keep lasix to a minimum, because it’s dropping my potassium way too low. Down to one a day after work since that’s when it’s at its worse. Tina",
      "MessageIndex": 1522,
      "PostDate": "21/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Apr 4, 2018 04:44AM Mom4gma3 wrote: # 2 of my herceptin only treatment today. Hopefully I remember to tell them to order my meds ASAP so I’m not waiting in the chair for an hour or more for pharmacy to bring them. Appt with MO at 820, then infusion and then appt with RO at 11. I hate having to squeeze everything into my only day off, and I feel so guilty actually having a day off. We are so short staffed at work it is borderline unsafe for the patients. Luckily we have about 100 years experience combined with the staff we have which makes it easier. Put in 30 hours Monday and Tuesday combined. No wonder my feet are still swollen. On the plus side my pool is up to 78 degrees yesterday so that’s means swimming temps today. Bout dang time. I am usually in that pool a month by now, but the weather has no taste cooperated. Started getting the “ridges” on my nails, it’s only at the bottom half where the new nail has grown in. It’s more of a normal color where the top half is kind of discolored. So once all the discolored part is gone I am heading to get a mani pedi. That’s my sign that the new nail will be fully attached and grown in. Numb feet are making me crazy and it’s worse at the end of the day. Being on them for 14hours probably isn’t helping any. My laugh of the day yesterday, so I spent all day at work, I got home about 630p and jumped in the shower. When I took off my cap to get in, I looked in the mirror and did a double take. Holy hell, there is a large patch of hair in the front that wasn’t there in the morning. Kinda shocked me that it grew that much in half a day. The back seems to moving along, the front not so much. I am waiting on the leg shaving. There is some fuzz there, but I am thinking back to when we were 12 and we were told “ don’t shave your legs or it will come back darker and thicker” maybe those rules apply now. I may look into a good electric razor and no blades. Might keep it down. No pit hair or jay-jay hair yet. If I had a man in my life, they would be oh so pleased. Lmao. It does help make bathing suit dressing much easier! I haven’t braved the beach yet, hoping for a little more head growth before I do that. Maybe next weekend. Hope everyone has a great week and had an awesome Easter. Tina",
      "MessageIndex": 1607,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "Mom4gma3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263232/profile",
      "Content": "Apr 14, 2018 04:37PM Mom4gma3 wrote: Retzie- I gained 30 lbs during chemo. I blamed it on the steroids because they had me starving and I have a lot of edema. I am 7 weeks past chemo and I couldn’t loose anything plus I still have swelling. Last Monday I decided I have had enough! I started my 7 days of the cabbage soup diet and so far I have dropped 10 lbs in 5 days. You can only do it for 7 days at a time. Hopefully I will keep going on the right track and get back down. I’m doing radiation and they told me not to loose weight because it moves the markers and I pretty much told them that wasn’t going to happen. I am not going to be like this anymore. As for memory, I was fuzzy. Not really memory loss, but it took me longer to say what I wanted to and I r ally had to focus. Especially when driving. I have noticed it seems to effect you worse the older you are, and I don’t know your age. Mine is completely back to normal now. The only residual I have left besides very little hair, is the neuropathy which they prescribed vitamins for and the swelling which I take lasix for. I would suggest talking to your MO and see if they have suggestions, but my guess is it will be vitamins that aid in memory function. Good luck with the weight loss. I feel for you, I had to get new work clothes as well since I couldn’t wear my regular ones anymore, I just keep washing and wearing the few I got. It sucks. Tina.",
      "MessageIndex": 1662,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    }
  ]
}