{
  "AuthorID": "Mom_sweetan…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260517/profile",
  "Posts": [
    {
      "AuthorID": "Mom_sweetan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260517/profile",
      "Content": "Oct 2, 2017 02:55PM Mom_sweetangel wrote: Thank you for taking the time to respond to my email. I appreciate it. ",
      "MessageIndex": 4251,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Mom_sweetan…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260517/profile",
      "Content": "Sep 30, 2017 04:21AM Mom_sweetangel wrote: My mom, who is now 83, was diagnosed with breast cancer 17 1/2 years ago. Last September after having pain in her back that wouldn't go away, the doctor gave her a PET scan which showed she had bone mets/Stage IV. The cancer is only in her bones but it is in many places. The oncologist put her on a drug regime of Femara and Xigiva for six months but found the Femara was not effective. Also, she had many treatments of radiation for pain. Since the Femara was not effective, she is now on Embrace and Flaxocil. With the Ebrance she has gone from 250mg to 75mg because it made her too tired and wiped out her white and red blood count. Initially, for the first two months, she was handling it okay.. But now the issue is -- she is tired, weak, sits in the house most of the day and sleeps. When I hear her voice on the phone, because I live away from her, it is so weak. On top of that, she needs to be on oxycodin for pain and takes them three times a day. I'm not sure if the drugs are making her better or worse and I'm not sure what to do or who to ask. The doctor said that he felt the drugs were effective because her recent bone scan showed that there was no new growth - so that was good, but her overall quality of life has gone way down in the past two months. If the cancer has not spread and is the same, why is she suddenly so weak? Does anyone have any suggestions or advice? Thank you",
      "MessageIndex": 4246,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}