{
  "AuthorID": "momcorba",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120146/profile",
  "Posts": [
    {
      "AuthorID": "momcorba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120146/profile",
      "Content": "Jan 27, 2011 08:54PM momcorba wrote: Yes, mine were cluster.  So, after they got me dressrd, they wheeled me down to radiology and using the mamography machine they numbed me and then put in 2 kneedle to mark the spot.  They had a very hard time, because it is way under my arm.  I started to faint before the first one, and I did faint as they were doing the secondf one.  It was not painful, just a very little pinch when they numbed it, but the way I had to stand and bend my back and neck and being under the compressions for so long add to that not eating, and they think that is why I fainted.  I didnt look at the needles or anything.  They brought me back up starts and then did the surgery.  The most painful part is now.  I did not want to use the narc. pain pills, but it is getting pretty uncomfortable, so I am.  And that diffentaly helped. Motrin did nothing. I am staying home from work tomorrow and will learn my results from the lumpectomy next thurs.  Cheryl, after the biopsy, they told me in 5 days.  Have you called them?  Thanks for everyones thoughts and prayers.",
      "MessageIndex": 8,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763973",
      "Title": "lumpectomy tomorrow for atypical cells momcorba vmudrow"
    },
    {
      "AuthorID": "momcorba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120146/profile",
      "Content": "momcorba wrote: I went for my routine mamogram over the christmas break.  I always have a diagnostic one since I have a thickening on my left breast.  When they called, I thought they were calling about that.  But they were calling about the Right breast.  I went for a second Mamo a few days later.  Then a week later they did the biopsy.  When I went for the results they said it wasn't cancer, but atypical cells and that they needed to take them out and a margin.  They said the cells are small and with the margins they are taking about a golfball size out.  I am small breasted anyway!  I am mostly getting nervous about the needles that the radiology dept will put in before.  They said I am awake for that part!  I am getting real nervous about this and being put under. Then I get to start the 2 week wait to see if there is any cancer.  Anyone who has gone thru this and can give me some advice on the procedure tomorrow, I  would appreciate it. Thanks, Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763973",
      "Title": "lumpectomy tomorrow for atypical cells momcorba vmudrow"
    },
    {
      "AuthorID": "momcorba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120146/profile",
      "Content": "Feb 3, 2011 01:45PM momcorba wrote: Well in a couple of hours I go see the surgeon for my post op and to get my results.  Today makes a week since my lumpectomy, and the site is still tender, and the strips are still in place.  Was anyone else still sore?  I thought it would feel better by now.",
      "MessageIndex": 15,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763973",
      "Title": "lumpectomy tomorrow for atypical cells momcorba vmudrow"
    }
  ]
}