{
  "AuthorID": "Momchichi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264778/profile",
  "Posts": [
    {
      "AuthorID": "Momchichi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264778/profile",
      "Content": "Apr 22, 2018 07:32AM Momchichi wrote: I'm so sorry about your lung mets and hope herceptin and perjeta do the job for you. I was also triple negative at my original diagnosis and had AC + taxol over 5 long months. All throughout Taxol but especially during the last few weeks, my lymph nodes hurt and I kept reporting it to my dr who wasn't concerned. Right before lumpectomy, a scan showed double the number of lymph nodes involved. I went from 2A to 3C during treatment. After they retested my residual breast tumor and it was still triple negative, I asked them to retest the lymph nodes and that is when they found those were HER2 positive (the one node tested originally was triple negative). So while not a misdiagnosis per se, I was not treated with the correct chemo protocol for several months and share in your frustration over lost opportunities. I know the fear of it being \"too late\" for the H&P to help me contain my cancer but I am encouraged by reading the experiences of others here who have had a great response with the targeted therapy. There are a lot more options now with HER2 and that is what keeps me hopeful.",
      "MessageIndex": 4,
      "PostDate": "22/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864129",
      "Title": "lung mets after her2 misdiagnosis tzoul tzoul"
    },
    {
      "AuthorID": "Momchichi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264778/profile",
      "Content": "Apr 29, 2019 06:12PM Momchichi wrote: Hi Jmouse, Just chiming in to say I heard similar gloom and doom from my oncologist, something like “even after treatment you remain at significant risk of dying from your disease”. That was at my first appointment! My 3rd opinion MO had a brighter future for me, saying number of nodes doesn’t matter as much as previously thought and it’s the response to treatment that matters. I’ve only been NED a little over a year but plan to stay alive out of spite just to skew my original MO’s stats or whatever it was that prompted her to tell me that",
      "MessageIndex": 38,
      "PostDate": "29/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/868751",
      "Title": "Stage 3c How do I keep from obsessing about recurrence orlando74 Meow13"
    },
    {
      "AuthorID": "Momchichi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264778/profile",
      "Content": "Mar 14, 2018 01:23PM Momchichi wrote: Hi FuzzySocks, Love the user name! I felt the same after my 5 months of neoadjuvant chemo and not getting the desired response. Felt like I was tortured for nothing and also moved stages from 2 to 3. Did your surgeon or MO retest the residual tumor? When I had so many positive nodes still, I insisted they test them and not just the breast one and HER+ was found (I was triple negative originally).So now I’m on different chemo but grateful to have that option. Otherwise, can Xeloda be in your playbook? That was what my MO recommended before the HER2+ was found. Or maybe Tamoxifen will be your miracle drug! My cousin (also diagnosed in her 30s)has been cancer free after a stage 3 diagnosis for 7 years and took tamoxifen for 5. Best wishes to you, sorry we’re here together but glad to have the company.",
      "MessageIndex": 418,
      "PostDate": "14/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Momchichi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264778/profile",
      "Content": "Dec 22, 2018 10:57AM Momchichi wrote: Hi Andi, I don’t know about chemo resistance but I had significant residual disease in the lymph nodes after chemo and asked them to retest it. Turns out I was HER2+ in some nodes and triple negative in the breast. I then received targeted therapy for HER2 after surgery. Not sure how often that happens or if your dr already rechecked you but I wanted to share my experience just in case. I do remember from my cousin’s stage 3 breast cancer treatment, that she didn’t have much response to chemo but her dr had told her not to expect much since she was lower grade and so highly ER/PR positive. She was told tamoxifen was her biggest weapon. That was about10 years ago for her, she took it for 5 years because that was standard of care back then. She also had her ovaries and fallopian tubes removed and was about your age, too. I hope you get the answers you need to feel confident in your treatment!",
      "MessageIndex": 6,
      "PostDate": "22/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/868964",
      "Title": "Chemoresistance and other treatment options Andi622 Andi622"
    }
  ]
}