{
  "AuthorID": "MomDaughter…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110941/profile",
  "Posts": [
    {
      "AuthorID": "MomDaughter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110941/profile",
      "Content": "Dec 1, 2010 11:55PM MomDaughter wrote: Thanks sweeti Nikola, I live in Ontario Ottawa my mom is 56. Yes she is going through a lumpectomy. I am in dark so far what will happen to her after I dont know what ER + and HER2 means...Hope you are doing sooo well now,  and you are enjoying every second in your lovely life.",
      "MessageIndex": 8,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761144",
      "Title": "invasive ductal carcinoma MomDaughter debbie6122"
    },
    {
      "AuthorID": "MomDaughter",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110941/profile",
      "Content": "MomDaughter wrote: well it is a cople of months that afte memos mri's and biopy we found that my mom has been diagnosed. as much as i know about my mom's it is a 1.2 cm invasive ductal carcinoma dont know the grade or stage as the surgen told me he will know after the surgery...I am not sure how fast it grows...I am looking forward to have the surgery done as soon as possible...but have to wait for my turn i wonder where in the world has the best treatments...i live in canada. Hope if we wait it does not get worse i have no idea what to do and how high risk it is please please please tell me about it. I only trust you people because i know it is is and how you feel and you know how i feel. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761144",
      "Title": "invasive ductal carcinoma MomDaughter debbie6122"
    },
    {
      "AuthorID": "MomDaughter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110941/profile",
      "Content": "Nov 25, 2010 01:08AM MomDaughter wrote: Thank you so much Debbie and CrazyKittes...yes i have not much understanding of all the kinds and qualities of the medical terms of the breast cancer,  but i am so thankfull you guys make it clear and give me emotional support...Bod bless you all and give you 100 yearss of happy cancer free so for my loving mom. Please write me more...about things that i should do for my mom and what is the best next step.",
      "MessageIndex": 3,
      "PostDate": "25/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761144",
      "Title": "invasive ductal carcinoma MomDaughter debbie6122"
    },
    {
      "AuthorID": "MomDaughter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110941/profile",
      "Content": "Dec 1, 2010 11:21PM MomDaughter wrote: Thanks Catbill and Debbie, My mom is going for a surgery 07.12.10 hopefully and then the surgen is removing one of the lump nodes and see if they are involved and they will see what else she needs to do. I dont know alot...i am learingi one thing everyday. all i do is pray...hope every one live life to the fullest and enjoy...and wish the same thing in my mom. please keep me updated for what is good to do for my mom. I thank you all ....God blesss!",
      "MessageIndex": 6,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761144",
      "Title": "invasive ductal carcinoma MomDaughter debbie6122"
    }
  ]
}