{
  "AuthorID": "Momeees",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254598/profile",
  "Posts": [
    {
      "AuthorID": "Momeees",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254598/profile",
      "Content": "Momeees wrote: hello everyone, I'm Kim, 47, and just had my first CNB of a suspicious mass on my left breast today. Just like many of you, I'm kind of terrified. I have had routine mammo/US each year because I found a lump in my 20s (no biopsy, turned oh the to be a cyst). Went for my routine mammo earlier this month which showed nothing. Ultrasound found a suspicious \"cyst or mass\" 7mm x 3 mm x 4 mm at 6 o'clock position in LB. went back for another US Tuesday to be told I needed a biopsy. Of course, I spent the past two days reading garbage on google. Had biopsy this morning. Radiologist says it's not a cyst because it's not fully black on sono. Edges \"look more like a fibroadenoma would\" but we will see. Tomorrow, I leave for six weeks overseas. Doc wanted me to see if I could get results before I go (asked what time my flight was) so I was told to call tomorrow at noon for preliminary results. Of course I'm paranoid that she thinks I shouldn't get on that plane. I'm hoping to get the all-clear but if I don't, the soonest I can come home is 2.5 weeks. I'm figuring that will have to do??? Besides, I need to get this adventure trip in and spend time with my kids if I have a problem to come home to. Irresponsible? I hope nothing will happen in three weeks. Of course I read that fibroadenomas are usually in younger women. However, I have extremely dense breasts, a Mirena IUD, and stopped getting my period about three months ago. I just had a blood workup and all wasn't normal and apparently I'm not entering menopause. I'm an only child, my mom died young from complications from rheumatoid arthritis so I have a unknown history. Just wanted to say hello, ask for good vibes, and get any thoughts. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856326",
      "Title": "Biopsy today, international trip tomorrow Momeees Momeees"
    },
    {
      "AuthorID": "Momeees",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254598/profile",
      "Content": "Jun 22, 2017 12:22PM Momeees wrote: thank you! I'm due to actually come back August 4 but will compromise to just go for three weeks. I guess I will see tomorrow. I appreciate your response. Be well xx",
      "MessageIndex": 2,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856326",
      "Title": "Biopsy today, international trip tomorrow Momeees Momeees"
    },
    {
      "AuthorID": "Momeees",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254598/profile",
      "Content": "Jun 22, 2017 03:53PM Momeees wrote: Thank you so much MTwoman and MinusTwo. I'm hopefully optimistic and even if it's not the answer I want, I'm still going to kick its butt.",
      "MessageIndex": 5,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856326",
      "Title": "Biopsy today, international trip tomorrow Momeees Momeees"
    }
  ]
}