{
  "AuthorID": "momgie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192619/profile",
  "Posts": [
    {
      "AuthorID": "momgie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192619/profile",
      "Content": "Jan 23, 2014 12:41PM - edited Jan 23, 2014 12:44PM by momgie",
      "MessageIndex": 245,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "momgie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192619/profile",
      "Content": "Jan 20, 2014 03:06PM momgie wrote: Wow...just got caught up on everyone's posts. It's so wonderful to be able to \"talk\" to other women who are experiencing some of the same things you are (or might be). It's been almost 2 weeks since my first treatment and I'm feeling pretty good. The first week was crazy, something different every day, but things have calmed down and I'm cautiously optimistic that I will be O.K. till the 28th then I can do it all over again! Yay! (please read that as sarcasm). Today being day 13 I guess I can expect my hair to start falling out any moment now. I will miss it...it'll be cold without it...but I've done it once before, many years ago, so I guess I can do it again.  God Bless All and remember...this too shall pass. ",
      "MessageIndex": 298,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "momgie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192619/profile",
      "Content": "Jan 14, 2014 12:18PM momgie wrote: Hello ladies! I've been reading through your posts these past few weeks to try and gauge some potential side effects I may experience. I had my first chemo (TC) last week, the 7th. I will be receiving 4 total. I am 9 weeks post surgery today. This chemo crap is not new to me. I had chemo 14 years ago for Hodgkin's (ABVD). The A in that cocktail stands for Adriamycin. Back then I had treatment every 2 weeks for 6 months! (12 total) I really thought this time around it wouldn't be so bad. I was sadly mistaken. I am very surprised just how quickly my body is being ravaged by this poison. I DID NOT want to do the chemo! I had every intention of fighting this the rest of the way holistically. I only changed my mind after my surgical pathology was elevated from a grade 2 to a grade 3. It seems I'm dealing with a more aggressive type than I was originally told. That being said, I went ahead with the chemo. The first few days weren't so bad, taste buds were the first to go, had myself a funky psychedelic trip Thursday evening (steroid high ??), chemo brain Friday (just felt like my head wasn't screwed on straight), some minor aches and pains (just felt like body aches when you have the flu), went from constipation to diarrhea, my face is breaking out (steroids - ??), already had my right leg and foot go numb on me (that came on sudden after a hot shower and went away after several hours, thank God! I felt great on Sunday. I thought \"Wow, that's it, I'm on the road to recovery till next time?!\"  Ha! Not so fast...Sunday night it started. The dreaded bone pain. Now, I had a drug called Neupogen last time. It basically did what the Neulasta does, only I gave it to myself for 5 days after each treatment. The Neulasta seems to be a concentrated dose given only once. I didn't have much pain from that med. Wish I could say the same this time 'round. What I experienced yesterday felt like labor. Low, back labor. Came on sudden, lasted 5-20 seconds. I was screaming in pain. Mind you, I have a very high tolerance for pain. Tylenol helped a bit. I am reading on here that some of you are taking Claritin in the hopes of dodging this pain. My nurse told me to take it just once, about 1/2 hour before the Neulasta shot. I did. I questioned her...really just the once. She said yes.  Are some of you being given different instructions? If so, how much and when. Next time I'll take more to see if it helps. With all of the other toxic things I'm putting into my body, a little Claritin is the least of my worries.  Also, are any of you taking any supplements to help you get through the chemo? I take l-Glutamine, magnesium, and B6. I drink Essiac Tea as well. Thanks for your feedback. This site has been a God-send. :)",
      "MessageIndex": 173,
      "PostDate": "14/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    }
  ]
}