{
  "AuthorID": "Mominator",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
  "Posts": [
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 19, 2017 04:27PM Mominator wrote: Noni/JJ: thinking of you, and keeping you in my prayers. I hope you had a wonderful trip, with wonderful memories for DH and DD. You can give us an update if you feel up to it. I hope that you are feeling comfortable and well-loved.  I hope that hospice is treating you well, and that you are at peace. Love,  Madelyn / Mominator",
      "MessageIndex": 17,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853446",
      "Title": "Taking some control and scheduling in hospice Noni Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 24, 2017 10:53AM Mominator wrote:  Hello JJ, I am sending you so much support for you and your choices. This is such a difficult decision, but it was made by carefully weighing the pros and cons of treatment, and its affect on your quality of life and your family. The people who may feel you are giving up do not understand all that has gone into your decision. They are the ones who see the rosy visions of cancer patients on TV shows, who look and feel rather good, until they quietly say their good-byes and pass away in their sleep. Many best wishes for your cruise. I hope you are feeling better by May and have a wonderful cruise. Also, sending good luck for the house hunting. I really don't think it matters when you move into the house. The important part is that you pick it out as a family. My only suggestion is that you consider palliative pain relief and/or hospice before June 14. You can find out what's available, and pick and choose the services you want, and when you want to start them. I've seen people wait before calling hospice, and they always wished that they had started hospice sooner. My friend Lori really would have benefited from hospice much sooner, but husband was reluctant to \"give up\" as he called it. Her children were 15, 13, 13, 13 (triplets), 12, and 10 when she passed. ",
      "MessageIndex": 13,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853446",
      "Title": "Taking some control and scheduling in hospice Noni Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 8, 2017 02:54PM Mominator wrote:  Noni, thinking of you. Sending love and peace.  Hoping you and your husband, daughter, and brother are surrounded in love and peace. Love, Madelyn / Mominator  ",
      "MessageIndex": 25,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853446",
      "Title": "Taking some control and scheduling in hospice Noni Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 14, 2017 10:45AM Mominator wrote: Noni, thinking of you. I'm hoping that hospice continues to be as nice as possible. Wishing you peaceful days and restful nights, and many warm memories that will sustain your husband, daughter, and brother.  Love, Madelyn / Mominator  ",
      "MessageIndex": 19,
      "PostDate": "14/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853446",
      "Title": "Taking some control and scheduling in hospice Noni Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 6, 2017 06:47PM Mominator wrote:  Hello JJ/Noni, I hope you are feeling better (as the toxins clear out) and you are preparing for your vacation by now. Keeping you in my thoughts and prayers. love, Madelyn ",
      "MessageIndex": 14,
      "PostDate": "06/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853446",
      "Title": "Taking some control and scheduling in hospice Noni Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Sep 11, 2017 06:50PM Mominator wrote: Noni, thinking of you. Sending peace and love to you and your family. ",
      "MessageIndex": 23,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853446",
      "Title": "Taking some control and scheduling in hospice Noni Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 13, 2017 10:06AM - edited Jan 14, 2017 06:33AM by Mominator Hello Maggie, I don't think having a new lump automatically changes cancer staging. First, we need to find out what your new lump is: cancer or benign. (most common causes of breast lumps here http://www.webmd.com/breast-cancer/benign-breast-lumps#1) Second, if it is cancer, it could be either a new primary or a local/regional recurrence. Breast cancer is only metastatic if it leaves the breast and immediate lymph node system. Holding your hand, Madelyn",
      "MessageIndex": 23,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 11, 2017 07:33PM - edited Jan 12, 2017 03:20AM by Mominator Hello Laura25, Suezie23, and natei4143. You are NOT a walking time bombs!! You have been given some information, and now you need to decide what to do. I would suggest learning more, from a genetics counselor, FORCE, PROMPT, NCCN, and other sources. BTW, both BRCA1 & 2 genes are actually tumor suppression genes. We all have these genes. Some of us have mutations on these genes. These mutations cause the genes to work differently. Some mutations have been associated with cancer, some we don't know yet. I have a BRCA2 deleterious mutation and a STK-11 VUS - Variation of Unknown Significance. Cancers associated with the BRCA gene deleterious mutations are: BRCA1: Breast, ovarian, male breast, pancreas, and prostrate. (sorry I don't have the percentages for BRCA1 handy) BRCA2: Breast age 50, up to 28%, age 70, up to 84%; ovarian 27%, male breast 6.8%, pancreas 7%, prostrate 20%, and melanoma elevated risk. Compare these figures with General population: Breast age 50, 1.9%, age 70, 7.3%; ovarian 0.7%, male breast less than 0.1, pancreas 1%, prostrate 8.2%, and melanoma 1.6%. (from Myriad My Risk) Please note that neither BRCA1 nor 2 are associated with uterine cancer. If you want prophylactic surgery, you do not need a full hysterectomy. You do not need to \"have it all\" out. However, you do need to remove both the ovaries and the Fallopian tubes. The Fallopian tubes tissue is similar to the ovaries. In one study, approximately half of the ovarian cancers started in the Fallopian tubes. The surgery is called BSO = Bilateral Salpingo - Oophorectomy. People with BRCA1 and/or 2 mutations have HBOC = Hereditary Breast/Ovarian Cancer Syndrome Although BRCA 1 and 2 are similar, there are some differences: (from Wikipedia) \"BRCA-related breast cancer appears at an earlier age than sporadic breast cancer. It has been asserted that BRCA-related breast cancer is more aggressive than normal breast cancer, however most studies in specific populations suggest little or no difference in survival rates despite seemingly worse prognostic factors. BRCA-related ovarian and Fallopian tube cancer is more treatable than average because it is unusually susceptible to platinum-based chemotherapy like cisplatin. BRCA1-related ovarian cancer appears at younger ages, but the risk for women with BRCA2 climbs markedly at or shortly after menopause.\" My mother is BRCA2 positive. Her first cancer was DCIS at age 62, her second was ILC stage IIIA at age 79. Both of her cancers were post-menopausal. She was 17 years cancer free between her breast cancer diagnosis, and the cancers were different (duct, lobe) and different breasts (R, L). My Grandmother died of ovarian cancer at age 48, right at menopause. My grandmother was an only child. My aunts seem to be fine, and they have only boys. My sister is BRCA2 negative. Currently, there are three treatments for HBOC: 1. increased surveillance (alternating mammograms and breast MRIs every 6 months), 2. chemo-prevention (taking a medication that suppresses estrogen), and 3. prophylactic mastectomy and Salpingo - Oophorectomy. So Laura25, Suezie23, and natei4143, take some time to research and then decide. Since Laura25 and natei4145 are BRCA1, you may wish to do the prophylactic surgery sooner, since BRCA1 tends to appear about two decades earlier than the general population (around age 50). Suezie23, with BRCA2 you probably want to do the surgery at least before menopause, since that's when BRCA2 tends to appear. In other words, yes, you all have a high risk of breast cancer and ovarian cancer, but cancer isn't going to get you in the next several months. You all have enough time to research and decide what to do. lintrollerderby: your daughter had the PBMX. Is she having regular screenings for ovarian cancer? Another good source is Dr. Susan Love's Breast Book. She mentions that there are many factors that determine if cancer develops, and we don't know all of them. Genetics, nutrition, and environmental causes are some of them. My best wishes to all of you. I'll be happy to answer any questions you have. Mominator",
      "MessageIndex": 17,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 12, 2017 01:54PM - edited Jan 12, 2017 01:56PM by Mominator BayouBabe: thank you for that study. It looks like there is still much research to be done, as that 2014 study states:  It could be that 2 of the 4 cancers were caused by tamoxifen, not the BRCA1 mutation. In that case, the other 2 cancers were about at the same rate as the general population. When I was preparing for my prophylactic surgeries, I consulted with Genetics Counselor, my OB/GYN, my Gyn Oncologist and my Breast Surgeon. My OB/GYN and Breast Surgeon both suggested that I \"get everything out\" but the reasoning was \"just because.\" My Genetics Counselor said that uterine cancer is not associated with BRCA mutations / HBOC. My Gyn Oncologist went further: \"I could do a full hysterectomy on you. However, you do not need it. Uterine cancer presents with abnormal bleeding, so it is more easily detected than ovarian cancer.\" Thus, I had BSO, not a full hysterectomy. I do continue to see my OB/GYN for my annual exams and she said that everything looks good. Best wishes to all.",
      "MessageIndex": 20,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Sep 15, 2018 10:14AM Mominator wrote: Thank you ladies for all this information on skin cancer.  I am BRCA2+ (maternal side) and I had some great uncles on the other side of the family with skin cancer.  My brother (not yet tested for BRCA) has had some skin cancer removed from his face. He's an environmental engineer and works outdoors a lot. He's not as good with medical details, so I don't know what type of skin cancer nor the type of biopsy or excisions he had. I spent my first 32 years in Massachusetts, and I wasn't an outdoorsy person. I've lived here at the Jersey Shore for 25 years. I'm noticing a few dark spots on my face that may need attention. ",
      "MessageIndex": 43,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/866661",
      "Title": "High Number of Certain Skin Cancers Linked to Increased Risk Moderators santabarbarian"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 13, 2017 12:51PM Mominator wrote:  Dear husband and son of Ebru, Thank you for sharing Ebru with us. She was a kind and generous person.  May she rest in paradise. My deepest condolences to you.  ",
      "MessageIndex": 73,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/859918",
      "Title": "Stagefree's last journey stagefree Brendatrue"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 23, 2018 06:53PM Mominator wrote: FTM (Female to Male) Top Surgery is a gender affirming procedure for transgender men and non-binary individuals that creates a masculine chest. Top Surgery involves breast removal (Subcutaneous Mastectomy) and male chest contouring, and may also include free nipple grafts, or nipple/areola resizing and repositioning. You probably would want to discuss your goals with your surgeon. What you want is mastectomy with nipple sparing without reconstruction. I'm not sure if you want \"male chest contouring.\"  Almost anything is possible these days, probably even saving nipples without reconstruction. Best wishes.",
      "MessageIndex": 12,
      "PostDate": "23/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/799924",
      "Title": "nipple sparing surgery without reconstruction Bettyboops snowcones"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 17, 2016 05:29PM Mominator wrote: Grandma3x: That sounds like the dressings which were on my drains. The dressings got really gross and I called the PS. The nurse had me come in. She changed the dressings and cleaned me up. I'm glad you're calling your PS in the morning. In the meantime, I'm so happy about your pink nipple!! Woo-hoo!!",
      "MessageIndex": 376,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 24, 2016 12:50PM Mominator wrote: @SVGsurvive: this was my last surgery for reconstruction, although I certainly have had plenty of surgery in the past year: neurosurgery, BMx & BSO, debridement, and Exchange surgery. My PS gave the black areas a couple of weeks to pink up. Some of it did recover. The debridement was OK, although it was weird to be awake while he worked on me. It is what it is. You'll do fine.",
      "MessageIndex": 501,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 25, 2016 02:44AM Mominator wrote: champo: welcome At the top and bottom of every thread you will see a link to \"add to my favorites topics\" If you click that link, you will get a notification when there is a new post. Also, there is a list of acronyms here https://community.breastcancer.org/forum/131/topic... Add that to your favorites list to make it easier to find. It takes a while to learn the language but you'll catch on quickly enough. You found us and have written up you profile / signature already. Best wishes on your journey.",
      "MessageIndex": 504,
      "PostDate": "25/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 27, 2016 11:31AM - edited Jan 27, 2016 11:34AM by Mominator I had the chills and was shivering from 5pm on all last evening. I finally just took some Tylenol around 8 because the spasms in my chest muscles was bothering me. I woke up at 3:30am and felt hot and my chest hurt. I took some Tylenol. I was still feeling really hot at 4:30 and decided to take my temp: 99. Then I realized maybe I should have taken my temperature before the Tylenol. At 9:00 my temp was 100.2 and the area around the right drain looked swollen to me. I called the PS office and they had me come in. My doctor wasn't available, so I saw another doctor. He thought everything looked good and started talking about \"the 5 w's: wound, water, wonder drug...(can't remember the other w's).\" Since my wound looked fine, he thought it could be a UTI (water) or a delayed reaction to the wonder drug (anesthesia from last week) or maybe I'm just coming down with something. I don't have any UTI symptoms, I had my flu shot in September, and I haven't been near anyone who is sick. He renewed the script on the Keflex and wrote another script for a urine test. I'm going to keep on taking Tylenol, push fluids and citrus, take it easy and ride this one out.",
      "MessageIndex": 545,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 2, 2016 06:44PM Mominator wrote: Jr114: my drains came out once output was less than 30 ml for two whole days. So that's about the same for you. You had a mini-debridement. Onward and upward. Hope you're healing well.",
      "MessageIndex": 661,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 13, 2016 06:53PM Mominator wrote: Wow, so many posts! And silly me wrote my last few posts while refreshing the screen while on the previous page. Merymete: that is so scary! Prayers that never happens again. You're one tough cookie! BlueHeron: between your RO/MO, it looks like you're closer to a decision. Best wishes on your treatment going forward. stellamaris: good to see you on the other side. Wishing you a smooth recovery. Grandma3X and moondust: yeah no chemo for you both! Chambo: I hope chemo treats you gently. DecisionFreak: glad you got out to your church function. Sounds like an interesting time. Saying prayers for your mom. We had a similar situation with our pastor and a ventilator. He was on the ventilator, and he wasn't able to wean off of it. That is a very tough situation. Iwannacookie: please call Monday to report what you told us, and please call immediately if there is any fresh blood. Nolagirl: welcome. I'm sorry to hear of your infection and seroma. My mom had her seroma drained several times. I hope yours clears up soon. katja: I second Gardengirl's advice about calling immediately, and want to add please call Monday anyway about the rash. Your surgeon should be kept up to date on that. Melgirl: you may be still swollen, and it sounds like your muscles are stretching and/or spasing. My muscles still have spasms when I am very cold (like the shivers). It does get better. Also, you can ask to have your fills smaller and more spaced out in time. You may want to come visit TEs - a Beginner's Primer https://community.breastcancer.org/forum/44/topics/819027?page=71#idx_2119 and Exchange City https://community.breastcancer.org/forum/44/topics/728266?page=1265#idx_37941 I haven't seen SVGsurvive here recently, so I sent her a message with our newbies and dates Iwannacookie - revision surgery on 1/20 Nolagirl1126 - MX on 1/29 Melgirl - BMX with TEs on 1/29 Apologies if I missed anyone. love to all, Mominator",
      "MessageIndex": 804,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 14, 2016 08:15PM Mominator wrote: Hi edwsmom: My PS's and BS's rules for driving were no drains and being able to make sharp turns without pain. My PS's rule for drains was also less than 30 cc of fluid for 48 hours. My drains were under 30 cc and he allowed me to drive 2 weeks after BMX and 8 days after exchange. Especially after BMX I kept those first few weeks of driving to local trips. If your drains are still putting out 40-50 cc's each day, you are still healing. Give yourself some time. I'm sorry, I missed driving myself as well. I hope you heal quickly and can drive again soon. Take care. Love, Mominator",
      "MessageIndex": 813,
      "PostDate": "14/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 21, 2016 04:43PM Mominator wrote: Katja23 and Bjsmiller: there are about 25 genes that have been associated with hereditary cancers, including 13 associated with Breast cancer. Of them, the BRCA2 mutation is associated with Breast cancer, Ovarian cancer, Melanoma, Pancreas, and Prostate cancer. There are two other genes associated with Melanoma,CDKN2A and CDK4, but they do not have breast cancer. Hope that helps, Mominator",
      "MessageIndex": 848,
      "PostDate": "21/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 20, 2016 02:58AM Mominator wrote: painterfarmchick, if your surgeon \"forgets\" to tell you what to expect (trying to be nice on his behalf), you can call back and ask to speak with the nurse navigator or the surgical coordinator. These people are supposed to answer all such questions so you can be prepared and not so anxious before such a procedure. And if they can't answer your questions, then they'll get the answers for you from the surgeon. I had a plugged duct while I was nursing my first child. It soon developed an infection (mastitis), and then a hard lump formed. Breast surgeon tried to aspirate it and didn't get any fluid. A biopsy revealed that there was a small infarct after the plugged duct. That small area of my breast died, leaving necrotic tissue, which was removed during the biopsy. It was all benign, but of course very worrisome during breast-feeding. Best wishes, Mominator",
      "MessageIndex": 3,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/846107",
      "Title": "Pregnant with Very Large Mass painterfarmchick Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 15, 2016 06:26PM Mominator wrote: Final preparations for Monday's exchange surgery: I stocked up on non-perishables, especially heavy items, and I have been doing a lot of cleaning, organizing and paperwork. I got two pre-op calls from the surgery center today. The first was from the anesthesiologist to re-check medical, especially surgical, history. The second was from the nurse to re-check all my medical history (yep again), pre-op instructions, medication check, and so on. I think they forgot about me, as there is a list of meds that should have been e-scripted already: hibiclens, Zofran, scopolamine patch, and Keflex. At least we caught that in time, and the scripts have been sent to the pharmacy. I have all weekend to pick them up. I am sooooooooooo looking forward to getting rid of these TE's.",
      "MessageIndex": 344,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 1, 2016 07:31PM Mominator wrote: mltdd, I'm so sorry to hear of your misery with the side effects of your chemo. I hope you are getting the support you need. Although many ladies here are doing chemo, you may get more responses in the https://community.breastcancer.org/forum/69 Best wishes on your journey, Mominator",
      "MessageIndex": 922,
      "PostDate": "01/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 23, 2016 12:55PM Mominator wrote: Hi Grandma3X: I just saw my BS this week, and I told her all about BreastCancer.org and all the wonderful people I met and the wonderful support everyone gives each other. I also asked her about SLN biopsy on a prophylactic mastectomy. She said she doesn't do SLN biopsy on a prophylactic mastectomy, but would mark the SN in case occult cancer is found on the pathology. I remember one of the other January ladies was talking about marking as well. DecisionFreak: so kind of you to take in your mother in-home hospice. The neighbor across the street is doing in-home hospice as well. I am watching her two mornings a week so the husband can run his business, another lady watches her 3 mornings a week. My mom is stage III, but is not a chemo candidate because of her other health issues. Gardergirls: so happy to hear of your vacation with hubby. Coolgrammie: I found the Exchange City and TE's: A Beginner's Primer threads to be very helpful while I was going through reconstruction. There may be a similar thread for your surgery. So nice to see everyone doing well. Mominator",
      "MessageIndex": 934,
      "PostDate": "23/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 19, 2016 07:49PM Mominator wrote: Hello ladies, thank you for the prayers and kind thoughts. Waves to all our ladies as you go through your surgeries . I'm feeling much better today. I'm still wearing the scopolamine patch and the nausea has been very mild. I've been able to eat today. I also had a nap. My PS's staff really excel at follow up. I got two calls from the surgery center: the nurse and the anesthesiologist both were checking up on me. Anesthesiologist told me the gunk in my throat is from the anesthesia gases as she didn't need to use the tube on me. I also had a post-op appointment with the nurse to check my incisions and change my dressings. I looked in the mirror but I really couldn't see my new breasts yet as they were completely covered in surgical tape. Thursday I see the PS himself. I'm hoping to get clearance for showers. I suspect it's too soon to hope for driving. My drain totals were R=83, L=73 yesterday and R=58, L=48 today, so those will be staying for a while. How's everyone doing these days? Love, strength, and prayers for everyone.",
      "MessageIndex": 417,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 21, 2016 01:13PM Mominator wrote: I just got back from my post-op appointment with PS, and I found out why it was more extensive than just an exchange. As we expected, Plastic Surgeon had to do a lot of \"pocket work\" on both breasts. Also, PS removed some fat tissue that was just under the skin on the lower halves of both my breasts. The fat was keeping the skin stiff and slowing down the healing. The fat was \"not exactly necrotic\" but it was \"definitely not happy\" where it was. I don't know how much total he removed, but it was a lot. PS said he removed about 50 grams more from the right breast than the left. So that's why he put a bigger implant on the right side (495 gm) than the left (450 gm) to even them out. PS thinks the breasts look even now, or perhaps the left is possibly slightly bigger. Both breasts are really swollen, but are starting to shape up much better. I am happy with the results. SVGsurvive: I saw my nipples about 3 days post-BMx when the dressings were changed. My nipples were very bruised and purple after BMx. Be prepared for that: it is completely normal. I just saw them today, 3 days post-exchange, when the nurse took off the steri-strips and they looked pretty good. I empty my drains twice a day, and try to milk/strip them at the same time. I find it frustrating because the liquid seems to go back up. I didn't make a big deal of rinsing out the bulb. I used water most of the time. I only used the rubbing alcohol toward the end as the bulbs were getting nasty. A \"scopolamine patch\" is a patch of anti-nausea medication. I think \"doing too much\" is whatever causes yourself pain.",
      "MessageIndex": 450,
      "PostDate": "21/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 27, 2016 07:16PM Mominator wrote: Balthus, I'm so sorry none of us have responded to your questions so far. Sometimes the board goes by so fast that I miss posts. So thank you for reposting your questions. In terms of going flat that isn't as flat as you expected, I think a second opinion is in order. Bring photos of other women and what you expectedwith you to your appointment. With your other health issues, yes, losing weight and exercising will help so much in your overall health. I know it's not easy. I am 5' 2\" and weighed 190 at my heaviest. I had sleep apnea and had to wear a CPAP mask. I lost nearly 50 pounds and was able to correct my sleep apnea. Estrogen (which is linked to many breast cancers) is stored in fat tissue, which is another reason to lose weight. I'm sorry I have no advice on your MO treatment, other than to suggest a second opinion there as well. Sending strength and healing thoughts your way. Love, Mominator",
      "MessageIndex": 549,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 30, 2016 05:11AM - edited Jan 30, 2016 05:55AM by Mominator Balthus, I am so sorry that your current MO has left you with so many unanswered questions. As I reread your pathology report, there's a lot to digest. Here's what I see. Right breast: DCIS and LCIS; negative margins and >10mm; and no nodes involved. The in situ for both is very encouraging to me, although I am even more concerned about two types of cancers present. What are the implications of multiple types of cancers? Left breast is even more complicated: Stage 1a and DCIS invasive ductal carcinoma, extensive LCIS, and atypical lobular hyperplasia involving preexisting fibroadenoma and adenosis. Again, two types of cancer, plus there is an invasive component. Hyperplasia, fibroadenoma, and adenosis are changes occur in our bodies as we age, but atypical hyperplasia is associated with an increased risk of cancer. So, there was a lot going on in both breasts, not just the two types of cancer, but the atypical hyperplasia suggests that more areas may have been heading towards cancer. Note, these are just my first impressions. I would have many more questions about the pathology report, plus questioning whether you need the Mammorint or Oncotype testing. Have you seen Dr. Susan Love's Breast Book? So, to ammend my earlier suggestion to get a second MO opinion: Please get a second opinion. Before your appt, go over your pathology report very carefully with Dr Love's Breast Book and make a list of questions. Make a copy of the questions and give it to the MO. Get your questions answered and you'll have a better plan.",
      "MessageIndex": 587,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 3, 2016 07:26AM Mominator wrote: Good morning, Balthus, I am one of the November surgeries women, as well as January. I am 12 weeks out from BMX and 2.5 weeks out from my exchange. It was mostly a gradual recovery from each surgery. The BMX was much harder than the exchange, but my exchange included a lot of pocket work and additional tissue removed. I had some set-backs, including a debridement at 3 weeks from BMX and a major infection at 10 days from exchange. However, I was just thinking this morning, I feel pretty good! I'm getting over the infection. Nothing really hurts, and my range of motion is really improving. I am even shorter at 5' 2\", so I have been stretching more. I was just wondering when I'll swap out these darn button-down tops and start wearing my usual over-the-head jerseys. We all heal differently. But since you were improving steadily, and now feel more tired, you may have overdid it last week.",
      "MessageIndex": 669,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 12, 2016 10:51AM Mominator wrote: Balthus, if you're concerned, I think either Nurse Practictioner or Physician Assistant would be able to help you. My BS uses PAs, my PS uses NPs. I've had to ask questions of both PA and NP along the way, and all have been helpful. I guess whomever you could see sooner. Stellamaris: check in when you can. Sending you best wishes and prayers. I had my last dose of antibiotics yesterday. I'm feeling pretty good. No more redness nor constant dull ache in my right breast. Although I think there may be a pocket of fluid at the site of the infection. It feels funny only when I move the right certain ways. At 3.5 weeks from exchange surgery, and 2 weeks from infection, I still can't quite sleep on either side yet. So things are still settling and healing. I didn't do any of the shoveling this winter. I am building up my ROM and the weights of things I carry. Despite my infection and pocket work, the exchange surgery is still an easier recovery then the MX. I hope that is encouraging for those who are doing reconstruction. Grandma3x: I enjoyed the story of your dog and the car. Today is my dog's 4th birthday. His name is S'more. He'll get extra cuddles all day long and a few pictures on Facebook. He's a good little pal.  Mominator",
      "MessageIndex": 783,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 5, 2016 05:30PM - edited Jan 6, 2016 02:51AM by Mominator Hello lovely ladies, I just got back from my PS and I have a date for my exchange from TEs to anatomical implants: January 18, 2016. That happens to be MLK, Jr. day, so hubby and the children all havethe day off. No worries about getting someone to/from school. I had nipple-sparing prophylactic bilateral Mx and prophylactic BSO on November 11, 2015. I feel like I just got back on my feet a couple of weeks ago. I'm looking forward to getting rid of these TE's and moving forward. Mominator",
      "MessageIndex": 150,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 6, 2016 01:45PM Mominator wrote: @Svgsurvive: I didn't know you were following us on November surgery. I look forward to getting to know everyone over here. I'm particularly glad to be getting rid of the TE's. The left one has drifted into my armpit and spasms first time I move every morning, and other times as well. I had a nipple-sparing BMX, so I won't need nipple recon. @edwsmom: During the nipple sparing mastectomy, the BS will remove tissue right behind the nipple and send it to pathology for testing during surgery. Pathologist will give a report so BS will know whether or not nipple can be spared. The risk associated with leaving nipple behind, presuming it passes above test, is about the same as a Mx. My BS said that she's only had one nipple that could not be spared in all of her NSMx's. Patient had a lump in another part of her breast, and they were surprised that the nipple also tested positive. She also had one patient have a recurrence in the scar tissue of a Mx, non NS. So, anecdotal, the odds of recurrence were similar. Sending good thoughts to our surgery sisters for this week.",
      "MessageIndex": 170,
      "PostDate": "06/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 19, 2016 08:53AM Mominator wrote:  OK, deep breaths, painterfarmchick. Welcome to BCO, where's there's a lot of information and support. My breasts were very different sizes while pregnant and breastfeeding. My right was about twice the size of the left, very heavy, and always produced so much more milk than the left. You are pregnant, so all those hormones are making big changes in your body. The odds that it happens to be cancer are small. I'm sure you'll want to know right away what's going on, but sometimes it takes a few steps (ultrasound, biopsy, etc.) to get your answers. While you're waiting, I did some quick research for you: A lactating adenoma is a benign tumor which usually occurs in younger, pregnant and lactating women. It is a variant of a class of benign breast lesions called 'fibroadenomas', which is essentially a pronounced growth of ducts and  also the fibrous connective tissue including the glandular components. Lactating adenomas are usually benign but in rare instances they can occur simultaneously with breast cancer. Phyllodes tumors are rare breast tumors that start in the connective (stromal) tissue. They are most common in women in their 30s and 40s, but women of any age can have them. Very rarely, phyllodes tumors can be cancer. So take a few more deep breaths while you wait for your biopsy. We'll hold your hand in the meantime. Keep us posted. Mominator “Worry does not empty tomorrow of its sorrow, it empties today of its strength.” Corrie ten Boom ",
      "MessageIndex": 1,
      "PostDate": "19/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/846107",
      "Title": "Pregnant with Very Large Mass painterfarmchick Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 25, 2016 01:13PM Mominator wrote:  Hello January surgery ladies. Look how far we've come!! I had my 3-month post-op visits with both my BS and my PS. BS said that I do not need any more imaging studies now for routine screening. No more mammos for me ever again. If there is a lump or some area of concern, we will image with ultrasound first, and then MRI if needed. I'm to have physical exams with BS every 6 months for the next two years, then annually after that. I next see BS in 6 months. PS was pleased with the reconstruction. I have some rippling and dimpling in both breasts, and some adhesions when I lift my right arm. He talked about the possibility of revision if I wanted. None of this bothers me. I look fine in clothes, my breasts don't get in the way of my flute like the TEs did, and I am happy with the reduction of my ptotic breasts to the reconstructed implants. I next see PS in 9 months, around the 1 year anniversary of the exchange surgery. ",
      "MessageIndex": 936,
      "PostDate": "25/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 9, 2019 06:39PM Mominator wrote: woodstock99 thinking of you today, and wishing you all the best on your thyroid surgery.  My sister had thyroid cancer. Half her thyroid was removed. She is on replacement thyroid medication. She is doing very well and has been cancer free about 20 years now. I recognize your avatar but I seem to remember maybe a different user name?",
      "MessageIndex": 971,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 17, 2016 03:25PM Mominator wrote: DecisionFreak and Grandma3x thanks for the well-wishes. I love our supportive board here. Grandma: If your bandage the self-stick kind (looks like just the pad part of a Band-Aid), it will soften up in the shower and then you can peel it off. Obviously don't do anything that hurts. You can give a call to your surgeon's office tomorrow, hopefully they will be open. At least there should be a nurse or PA available for calls. 7of9: (love your name and avatar): I have leftover Zofran pills from my previous surgeries. PS likes to use a scopolamine patch for same-day surgeries. It can be worn as long as 3 days and gives continuous relief from nausea. Sending good thoughts to my surgery sisters for Monday: Meymete and Kar324, and those for the rest of the week: 7of9, violethope, GardnerGirls, MimiD, and goldenbride. I'm glad to hear everyone is making progress in recovery.",
      "MessageIndex": 371,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 25, 2016 11:55AM Mominator wrote: edwsmom: Sometime surgeons will have the bra put on you at the end of surgery. Sometimes it will be given to you during your stay or before you go home. Some leave you to find what's comfortable for you. I had no bra at all for two weeks after BMx (just large bandages taped to my breasts) because my breasts were too swollen and bruised. On my two-week visit, the swelling was down enough I could just barely tolerate a bra. I was put in a bra immediately after exchange surgery. You can call the office and ask the nurse or PA now before surgery what the standard procedure is for your surgeon. Best wishes for your surgery.",
      "MessageIndex": 513,
      "PostDate": "25/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 28, 2016 12:38PM Mominator wrote: My PS had me come in to the office as now I have a red patch on my right breast and a dull ache beneath the patch. PS says looks like an infection is brewing. He's switching me over to two high-powered antibiotics and hoping we nip this in the bud. He wants me to monitor it closely. If it stays the same or slowly gets better, fine. If it gets worse, to call the office over the weekend.",
      "MessageIndex": 561,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 1, 2016 03:57PM - edited Feb 1, 2016 03:58PM by Mominator DecisionFreak, we don't have to let go of this group. We can still be in touch as we continue our journeys. All we need to do is keep it in our favorites, and we'll know when someone checks in. We can also add members to our friends list. I was noticing that the February 2015 surgery group is still active. It would be nice to know how everyone from January 2016 is doing in a year.",
      "MessageIndex": 628,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 7, 2016 01:47PM Mominator wrote: DecisionFreak: you may be losing your posts because your computer might refresh the page while you are editing. That happened to me a few times before I figured it out. If your posts are going to be long, you can write your posts in Word or Notepad and save periodically. If you don't want to use another program, then select all and copy while you're writing your posts. Then if your computer refreshes, you still have most of your post (although much less reliable). Another work-around is to submit your post, and then go back and edit it. At least the main part of the text doesn't get lost. I've also noticed that there's a bug in the editing program if one pastes some text and then hits a key, the text erases. My fix for that is to hit one of the arrow keys rather than a text key. If I do get caught by that bug, immediately hit Control-Z to undo, and my text comes back. In fact, I'm going over to the technical thread to report that bug. Mominator.",
      "MessageIndex": 739,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 12, 2016 05:57PM Mominator wrote: Kaybee and Jr114: There's an entire forum for Positive Genetic Test Results https://community.breastcancer.org/forum/112 Just keep scrolling down and you will find threads about BRCA and CHEK2. You can also start a thread if you want.",
      "MessageIndex": 286,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 5, 2016 07:05PM Mominator wrote: Kessa, good luck on your appointment with your doctor this week. Let usknow when you schedule your biopsy.",
      "MessageIndex": 941,
      "PostDate": "05/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 4, 2017 06:43PM Mominator wrote: Hello lford_az  and welcome to BCO You may not get too many answers here as this particular thread in not very active right now. Most of us had our surgeries in January 2016, have moved on to other threads. I suggest you post your question directly on the main page of the surgical forum: https://community.breastcancer.org/forum/91  with a title that asks your question, such as: Looking for pros/cons regarding Biozorb and radiation schedules Sorry, I don't know anything about Biozorb or radiation.",
      "MessageIndex": 952,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 10, 2016 11:53AM Mominator wrote: Sending healing thoughts to our trailblazers who have completed their surgeries: Kaybee2545 , Gemma12 , Neen56 , Vidrine1 , MKTCA Gemma12: Great news on your results! I'm so glad to hear you're doing well. I grew up in Massachusetts as well. Sending calming thoughts to our ladies who are having surgery this week: 1/11/16 - scubagirl01 , 27heart , Unbreakable01 1/12/16 - JulieAggie03 ,Balthus , Snowmagick 1/13/16 - grandma3X , Jr114 , Kessa619 1/14/16 - PositivePeg , BlueHeron , JerseyRenee01 1/15/16 - SVGsurvive , RLM 27heart: a double dose of calming thoughts to you. Unbreakable01: I'm sure any photos you have will be helpful for your journey. I am looking forward to hearing about your closure. I'm sorry about your UTI. I hope that has cleared by now. Blue Heron: wishing your well with your decision for the recon. I am liking my recon so far. I've ask SVGsurvive to add: 1/12/16 Snowmagick lumpectomy with SNB 1/15/16 RLM lumpectomy with wire localization Wishing everyone has (or had) smooth surgeries and speedy recoveries.",
      "MessageIndex": 239,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 16, 2016 11:08AM - edited Jan 16, 2016 12:01PM by Mominator Welcome curlyt, to our community. I hope you find the information and support you need. Please ask any questions. BlueHeron: great attitude on yourseriously badass warrior scar! There are some beautiful photos at Breastfree.com. One woman has a peacock tattoo over her mastectomy scar.",
      "MessageIndex": 361,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 18, 2016 07:15PM Mominator wrote: Hello lovely ladies. I'm home recovering from my exchange. Despite scopolamine patch and two higher dose Zofran tablets before surgery, I woke extremely nauseous and very dizzy. I've been resting. Pain is only slightly less than mastectomy. I had hoped for so much less. Surgery was over 2 hours, although for exchanges my PS is usually takes 1.5 hours. I think PS had to do a lot of pocket work for both sides. Right drain put out 50 ml of fluid and left put out 40 in the first few hours post-op, so I'm glad that PS gave me drains. My hubby and two daughters have been wonderful. Restful recoveries Merymete, Kar324, and smooth surgeries for 7of9, violethope.",
      "MessageIndex": 402,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 20, 2016 05:41PM Mominator wrote: Hello lovely ladies! I think of you all the time, and send prayers and well-wishes for you. I'm two days post exchange and feeling better each day. I've been spreading out the meds and I find the pain kicks in around 6 hours after the last Percocet. I expect to stay on the Percocet just a few more days, and then switch over to Tylenol. I'm still wearing the scopolamine patch and will keep it for the full 3-days. The anesthesiologist was asking about my nausea yesterday. She thinks I will always have nausea after general anesthesia. Not that I'm planning any more surgeries, but something to remember if there's another surgery. Grandma3x: my PS uses drains for anatomicals, as he feels there's too much risk of rotation if there's any fluid build-up. BlueHeron and Balthus: no judgments on recon either way. Recon is definitely more involved than the PS's tell us. 7of9 and SVGsurvive: glad to see you both making progress. Kessa: removal of my Mx drains didn't hurt. I'm glad yours didn't either. JulieAggie: sorry you didn't get rid of your drains yet. Gemma/Amy: I really have no idea about your possible treatments. Best I can say is listen to your doctors and their recommendations. Ask them the pros and cons of each choice, and what would they recommend for a family member. I remember how scared I was when I was facing neurosurgery. The neurologist said if I was his daughter, he would recommend the surgery with that neurosurgeon.",
      "MessageIndex": 432,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 26, 2016 02:09PM - edited Jan 26, 2016 03:22PM by Mominator I had a big appointment with PS today: both drains were removed and stitches taken out, and also received my driving clearance! After the appointment, I got a copy of the pathology report. I am certainly very happy that the removed tissue was all benign. But I surprised that the tissue was listed as \"breast tissue\" as opposed to just \"fat tissue\" or something else. I had a BMx in November, and this was just an exchange, TEs were taken out and some fat. So it makes me nervous that the pathology is calling it breast tissue and makes me wonder if there's more breast tissue in there. ",
      "MessageIndex": 537,
      "PostDate": "26/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 29, 2016 06:46PM Mominator wrote: In other news... After two doses of the two antibiotics, my fever broke. It's been 24 hours since my last Tylenol and no fever. Thank you all for your prayers and thoughts.",
      "MessageIndex": 584,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 10, 2016 05:46PM Mominator wrote: Quick shout outs to: CoolgrammieNC: I hope you're home and recovering. Stellamaris: Praying for clear margins tomorrow on your re-excision lumpectomy. Third time's the charm, right!! Wishing everyone peace and healing.",
      "MessageIndex": 766,
      "PostDate": "10/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 9, 2016 07:23AM - edited Jan 9, 2016 08:46AM by Mominator Wishing everyone smooth surgeries and gentle recoveries. I just occurred to me this morning as some of you are preparing for mastectomies: Consider taking pre-op and post-op photos if you want to record your journey. I've been taking simple photos using the timer setting on my camera. Using the timer allows me to do this myself, privately. I haven't shared these photos with anyone, and I'm not sure that I will. I took two sets of pre-op photos, both before and after the pre-op marking. I took the first post-op photo the morning after I got home from surgery. I took photos fairly often at first (every other day) to mark the progress. I had a debridement procedure along the way, so I made sure to take photos before and after that. And I'll take photos before and after exchange to implants. That first post-op photo was the worst, as my breasts were terribly bruised and swollen. But as time passed, even those first few days, I could see progress. I have made remarkable progress in just over 8 weeks. My reconstructed breasts are healing nicely and are looking better all the time. If you've already had surgery, but didn't take a pre-op photo, don't worry: your Breast Surgeon and/or Plastic Surgeon probably have pre-op photos. Both of my surgeons' nurses had taken photos of me. The PS has several photos including front and side facing. Strength, healing, and love to everyone, Mominator",
      "MessageIndex": 224,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 12, 2016 10:34AM Mominator wrote: Kaybee: Nipples or areoles? I had black patches on the tops of both my areoles, and both of the nipples were really purple. We waited a couple weeks and most of them improved. At three weeks, PS did a debridement procedure to remove the crescent of black patches on the areoles. I kept both my nipples and most of my areoles. Good luck!",
      "MessageIndex": 276,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 15, 2016 01:29AM Mominator wrote: @SGVsurvive: Yes, they put in a catheter for my surgery. I had BMx/recon/BSO all at once, about 5 hours of surgery. Fortunately, they wait until you're asleep. It doesn't hurt, and you don't have to worry about getting to the bathroom with rubber legs. Mine was removed in the evening the day after surgery. Again, it doesn't hurt coming out. Best wishes to all! 😍 Love, Mominator.",
      "MessageIndex": 323,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 16, 2016 07:49AM Mominator wrote: Hello everyone! Some things I'm noticing here are the same things we went through over the November 2015 surgeries thread: how to manage pain, when to change dressings, what type of bra to wear, when to shower, etc. I am not a medical professional. But I am an experienced patient. I had 5-hour neurosurgery in March to correct a Chiari Malformation, and I had 5-hour PBMx (with TEs) and PBSO in November. I was really scared leading up to the neurosurgery, a bit scared for the BMx. Now I am facing exchange surgery feeling rather calm. Here are some of the things I learned along the way. Whenever you have a doubt about anything, ASK your doctor/physician's assistant/nurse. Antibiotics: many surgeons prescribe them as a precaution. Many others are avoiding overuse of antibiotics. If you see any redness, or if you skin feels hot, or if you're running a fever: call your doctor whether or not you're on antibiotics. Bras, camisoles, and coverings are up to the surgeon. Sometime surgeons will have the bra put on you at the end of surgery. Sometimes it will be given to you during your stay or before you go home. Some leave you to find what's comfortable for you. I had no bra at all for two weeks (just large bandages taped to my breasts) because my breasts were too swollen and bruised. On my two-week visit, the swelling was down enough I could just barely tolerate a bra. Ask the nurse before surgery what the standard procedure is for your surgeon. Bandages: follow the directions of your surgeon. Some surgeons use dermabond, which is a special skin glue. Others use tapes. If your bandages get really gross, call the nurse or PA, or ask to come into the office to have it changed. Drains: are a bother. Almost everybody gets them and everybody hates them. Not having a drain can be even worse. A couple of our November ladies didn't have drains, and needed to have the fluid aspirated. Not fun. You will need to empty the drains, and measure and record the liquid that comes out. They should give you something to measure (they gave me as a urine specimen cup). Drains are removed when the fluid falls under a certain amount for a certain period of time. This varies greatly by surgeon. My surgeon requires under 30 ml per day for two whole days. My collection bulbs were getting gross after a while, I rinsed them with water or rubbing alcohol. If you have any trouble with your drains, or if you don't have drains but have fluid building up, call your doctor/physician's assistant/nurse. Pain: you will be given medication for pain. The pain will probably be the worst for the first 24-48 hours after surgery. The first week if often hard as well. Many patients find it helpful to \"stay ahead\" of the pain, by taking medication when the pain reaches a certain level. I found that was helpful the first few days to a week. Then I started to taper myself of pain medication. If it was every 4 to 6 hours, I would try 5 or 6 hours. Being at home, you're in control and you don't have to wait for the next nurse to be available. Do keep a record of when you took your medication so you know when you can take your next. You may be surprised to see that the time between medications starts to spread out. Shower: again, up to your surgeon, and it depends on your bandages, your sutures, and your healing. I had my first shower on the third morning after surgery. I was to have my back to the shower head, and was allowed to have the water run down my breasts. Absolutely no direct stream on my breasts for a week or so. Sleeping: I had a BMx and I could not sleep on either side or stomach, and even sleeping on my back was uncomfortable. I sleep while propped upright in a reading pillow similar to this: http://www.amazon.com/Brentwood-Originals-Brushed-Twill-Bedrest/dp/B002S0NJNK/ref=sr_1_1?ie=UTF8&qid=1452955954&sr=8-1&keywords=reading+pillows+for+bed which was fine. My husband later bought be a bed-lounge: http://www.amazon.com/BedLounge-Classic-Regular-Natural-Cotton/dp/B006VQQOV6/ref=sr_1_3?s=hpc&ie=UTF8&qid=1452948252&sr=1-3&keywords=pillow+recliner which works just the same as the reading pillow. I can roll a little to one side or the other. This is how I have slept for the last 10 weeks. I did not want to rent a medical bed. Swelling and bruising: we all will have some, some will have more. If anything looks scary to you, ask your nurse. BMs: are not something that we usually talk about. Most folks get constipated by the anesthesia medications. Ask if you can start taking Colace (an OTC stool softener) in the days before and after your surgery. I had a 5 hour surgery. Although I was taking Colace before surgery, I did not have a BM until 5 days after surgery. The next several days my body played catch up. Catheter: seems to be standard for long surgeries. I was given one in March for neurosurgery and November for BMx. Fortunately, they wait until you're asleep. It doesn't hurt, and you don't have to worry about going to the bathroom with rubber legs. March catheter was fine. Mine was removed in the evening the day after surgery. Again, it doesn't hurt coming out. My November catheter leaked a bit so the nurse adjusted it. I did have a few drops of blood in my urine for a few days. Also, I was just a little incontinent for about two weeks. I think I got stretched a bit when the nurse adjusted it. I'm back to normal now. Photos: I posted earlier this month that you may want to take photos to document your journey. Best wishes to all. If you have any questions, I will be happy to share my experiences with you. Health, peace, and love to all, Mominator",
      "MessageIndex": 357,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 22, 2016 01:43PM Mominator wrote: Drains for exchange: my PS does drains for anatomicals because it is important that the anatomicals adhere to the chest wall right away and do not rotate. Fluid build up can prevent adhesion and cause rotation, thus the drains. Also, I had a lot of pocket work done on both breasts, including the removal of the fat tissue. My drains put out 75 and 85 the first day, and have been putting out about 50 each day, so I know my drains are doing their job. Don't rinse out your drains if your BS/PS says no. I guess I am a rebel. Yesterday and today I walked the dog 1.5 miles each time. I was very careful putting my hands in my pockets so if he pulled on the lease he wouldn't jerk my arm.",
      "MessageIndex": 475,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 26, 2016 02:54AM Mominator wrote: Wonderful news, SVGsurvive, what a relief!I am so very happy for you!",
      "MessageIndex": 529,
      "PostDate": "26/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 26, 2016 01:56PM - edited Jan 26, 2016 02:06PM by Mominator Logang: good to see you back and doing well. Jr114: congratulations on your good path report. I didn't take anything before my fill. It was fine. Thinking of robinni and DecisionFreak today and Shakapuppy tomorrow.",
      "MessageIndex": 536,
      "PostDate": "26/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 29, 2016 06:45PM - edited Jan 29, 2016 08:03PM by Mominator DecisionFreak: that's a very important point about the tissue being tested. I don't know what the statistics are for lumpectomies and mastectomies, but here on our surgery board we have had ladies go to surgery with the doctors thinking one size tumor(s), and find out it was much bigger (grandma3x among others) or find other tumors. My BS told me about a planned nipple-sparing mastectomy where there was a small tumor in the outer quadrant. They were completely surprised when the tissue under the nipple tested positive. I do know the statistics for prophylactic surgeries: 10% of prophylactic mastectomies test positive for cancer. My PS said it's standard procedure to test ALL removed tissue. But I don't know if that is standard procedure for his group, our state, or the US. I hope it is the standard for all over the word, but it is certainly worth asking about pre-surgery. You ladies amazed me with your knowledge about treatments.",
      "MessageIndex": 583,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 3, 2016 06:23AM Mominator wrote: edwsmom: I'm with you about drains: annoying but not big deal. I'm glad that you're healing well. Straight to implant is a nice option, less surgeries (and less doctor visits). Mostly, I'm praying for NED for you.",
      "MessageIndex": 664,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 4, 2016 01:13PM Mominator wrote: Welcome to Moondust and Carjeanne. I love seeing good news on our thread! Congratulations Grandma3x and DecisionFreak! I'm so happy for you both! What great news. edwsmom: I'm glad your BS is going to get some clarification on the pathology report. Bummer you have to wait some more. BlueHeron: I hope the second opinion will clarify your situation. It's so hard to be in that gray area. Jr114: I hope you are feeling better today. Moondust: I average between 4 and 5 miles a day, which is about 8 to 10,000 steps for me. I am very impressed by your totals. Walk on, girlfriend! Balthus: I hope you are resting today after yesterday's adventure. You may be overdoing it. stellamaris: I'm so sorry you had a reschedule out to March. We'll hold your hand in the meantime. Little milestone for myself: today I wore a pull-over top for the first time since exchange surgery. Love to all, Mominator",
      "MessageIndex": 701,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 12, 2016 12:52PM Mominator wrote: Nearly forgot to mention, DecisionFreak, Grandma3x, and Balthus: I had reported the lost/disappearing post problem back on February 8, and just revisited the tech board again today to ask the moderators if there's been any progress. They have sent the info to the tech team. I'll keep you posted on their progress. https://community.breastcancer.org/forum/93/topics/787232?page=68#post_4639471",
      "MessageIndex": 785,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 9, 2016 07:01PM Mominator wrote: One year ago today was my neurosurgery. No more headaches! I'm so grateful for my complete recovery. Happy to hear everyone's progress. Grandma3x, I'm glad your nipplectomy went well and you are pleased with the results. Happy Spring everyone! I woke up to a chorus of birds this morning.",
      "MessageIndex": 882,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 18, 2018 06:11PM Mominator wrote: Today is the two year anniversary of my reconstruction surgery. I recovered well and went back to my usual activities and routines.  About a year later, capsular contraction developed in the left breast. I had a capsulectomy (scar tissue removed, a new implant placed) in June 2017. That recovery went well.  I'm glad that we had this thread together as we went through our surgeries.  Wishing everyone good health, peace and happiness!!",
      "MessageIndex": 964,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 17, 2016 07:34AM Mominator wrote: Hello to Balthus and DecisionFreak, and anyone else who kept losing posts: that has been fixed! Hi Mominator, We just wanted to update you that the lost post issue you were seeing should be resolved now -- the tech team found a bug they were able to squash, so all should be well. Please let us know if you continue to see any issues! --The Mods.",
      "MessageIndex": 904,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 18, 2016 07:22PM Mominator wrote: GREAT news Merymete!! Grandma3x: tough decision on the SLN! I remember one of the other ladies posted a link to marking the SN prior to or during MX, leaving the option to go back for the biopsy later. Seems like the marker was different than the stitch or clip. Since you have already had one SLN removed you know how much recovery that will be vs how much you want to avoid the surgery. I'm sure you'll be thinking this one thoroughly over the next six weeks.",
      "MessageIndex": 914,
      "PostDate": "18/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 1, 2017 06:31PM Mominator wrote: Happy New Year!! Wishing many blessings, especially health and happiness to all. Happy anniversary to everyone. I hope everyone has recovered from their surgeries, and is doing well with the rest of treatment.",
      "MessageIndex": 949,
      "PostDate": "01/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 14, 2015 07:51AM Mominator wrote: Just feeling up to posting for the first time since BMX and BSO on 11/11/15. Surgery was 5 hours and I spent another 10 hours in recovery because my blood pressure was too low, frequently lower than 80/40. They think it was a combination of anesthesia, pain meds, and nitroglycerin patches they put on my nipples. They bolused 3 units of saline to get my blood pressure about 80. I was sent to a cardiac unit for continued monitoring. They switched pain meds to address the blood pressure The day after surgery, the nurse started me on one Percoset, but it wasn't enough when I stood up for the first time. I was crying. The Breast Surgeon saw me soon after and insisted that I start walking. I thought she was nuts until I remembered that the nurse said that I could have 1 or 2. So I asked for 2 Percosets and that has made all the difference. The nurse was 15 minutes late for the next dose, and I could feel it wearing off. Throughout the day I did laps around the ward. I did a total of 0.99 miles according to my phone health app. They want me to keep walking and to keep doing the breathing exercises. The foley catheter was removed and I had \"good output\" so I was on my own for the bathroom that night. I was in the bathroom a lot exchanging those three units of saline. I have been running a fever of 100.1 but that doesn't seem to bother anyone. I also have been having strange visual disturbance of seeing wavy squiggles when I look at bright contrasts. This also is not bothering anyone. Yesterday I was really tired. It was a day of hurry up and wait. All three surgeons wanted to see me before I was discharged. I have just 4 small BSO incisions, which all look good. I had to go over BMX and drain care with the nurse yesterday. Until then, I had only seen little peeks of my breasts. Wow, what a mess it looks like now! The upper part of my breasts are hard and swollen. I'm sure that's where the TE's are. There is one big incision on each breast, with keyholes for the nipples (the batman marks were where the skin was removed). The lower part of the breasts are swollen and floppy. Both breasts look purple and swollen, with angry incisions, lots of bruising. The nipples are starting to pink up, but may still be in danger. Plastic Surgeon says that if we save them, it will be a major coup, since they had been hanging so low pre-surgery. Breast surgeon says it ain't over until the fat lady sings, they are pinking up. I really want to keep my nipples, but I'm too emotionally drained to worry about them. Today I feel so tired and I was nauseous. I was able to take a Zofran tablet, but I don't feel like eating. I so much want to be past all this. I don't want my two daughters to see me like this, but I can't hide it from them. One daughter was asking about the drains. The fluid in the J-drains went from mostly red in color to mostly yellow. Is that normal? I just put a call in to the doctor's office. Mominator",
      "MessageIndex": 204,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 17, 2015 04:55PM Mominator wrote: Hello again, Taking a moment to catch up on my progress since Wednesday 11/11 surgery. Sunday I had my first shower and my breasts looked better. However, they were very hard, swollen and warm to the touch. I called the surgeon's office and the nurse on call said that it's normal, but I could come in on Monday. Monday and my breasts were still very warm to me. I saw the nurse. She was so good in answering my questions and she changed the gross dressings on my drains. Wow, what a difference! My breasts looked so much less scary with all that bloody mess cleaned up. Nurse said that I am very swollen and bruised, which is why my breasts feel so warm. She said all my incisions looked good. Tuesday, today, was my first post-op visit with the surgeon. (Almost) everything looks good, my incisions are healing well. I am still very swollen and bruised. There is one area on my left areole which is questionable. Surgeon wants to wait and see if it recovers. At my next visit, he may trim off that area. Surgeon also asked about the drains output. I showed him my record of drainage per day. \"Of course you have a record,\" he remembers my list of questions during our consult. He said the drains could come out if there is less than 30 ml of fluid for two whole days. Considering how swollen I am, if the drains help reduce the swelling, I can tolerate them. My mother didn't have drains for her surgery and she told me horror stories of having the fluid aspirated. BTW, everyone loves my telemetry bags for my drains! I've been trying to de-medical-ize myself. I stopped using the Percocet after Sunday night, and I have stepped down to extra strength Tylenol. I've been doing more stuff on my own: laundry, dishes, serving meals. We have plenty of leftovers right now, so I don't have to cook to much yet.",
      "MessageIndex": 244,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 6, 2015 05:08PM Mominator wrote: Oh no, Frill! Thank goodness for your DBF. Is your surgery or appointment next Thursday? Please explain Lucy Lawless. You've mentioned her before, but I must have missed the original post along the way. I bet it's a great story. Love, Mominator.",
      "MessageIndex": 405,
      "PostDate": "06/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 6, 2016 03:48PM Mominator wrote: Aw, Live4them, how frustrating about the insurance! Agreeing with Grandma3x's advice. Also adding that I call right away, and often follow-up with an email to protect my rights, as doing those things helps to keep accounts from going to collection. I used to get very frustrated and ask to speak with managers, but I found that never helps as much as being very polite and respectful when dealing with insurance and billing. katykids: I hope the doctor will help your shoulder get better sooner rather than later. (((Hugs))) to all my surgery sisters. Hoping everyone is healing. Love, Mominator",
      "MessageIndex": 460,
      "PostDate": "06/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 18, 2016 07:51PM Mominator wrote: Hello lovely ladies. I'm home recovering from my exchange. It was a bit harder than I expected. Despite scopolamine patch and two higher dose Zofran tablets before surgery, I woke extremely nauseous and very dizzy. I've been resting. Pain is only slightly less than mastectomy. I had hoped for so much less. Surgery was over 2 hours, although for exchanges my PS is usually takes 1.5 hours. I think PS had to do a lot of pocket work for both sides. Right drain put out 50 ml of fluid and left put out 40 in the first few hours post-op, so I'm glad that PS gave me drains. My hubby and two daughters have been wonderful.",
      "MessageIndex": 476,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 21, 2016 01:17PM Mominator wrote: I just got back from my post-op appointment with PS, and I found out why it was more extensive than just an exchange and why the implants are different sizes. As we expected, Plastic Surgeon had to do a lot of \"pocket work\" on both breasts. Also, PS removed some fat tissue that was just under the skin on the lower halves of both my breasts. The fat was keeping the skin stiff and slowing down the healing. The fat was \"not exactly necrotic\" but it was \"definitely not happy\" where it was. I don't know how much total he removed, but it was a lot. PS said he removed about 50 grams more from the right breast than the left. So that's why he put a bigger implant on the right side (495 gm) than the left (450 gm) to even them out. PS thinks the breasts look even now, or perhaps the left is possibly slightly bigger. Both breasts are really swollen, but are starting to shape up much better. I am happy with the results.",
      "MessageIndex": 483,
      "PostDate": "21/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 22, 2016 11:01AM Mominator wrote: TallnTerrific: I am so sorry for the loss of your sweet sister-in-law. Please tell us her name so we can remember her. Do I remember you were visiting her over the holidays? I hope you had a good visit. (((HUGS))) Mominator",
      "MessageIndex": 486,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 31, 2016 01:14AM Mominator wrote: TallnTerrific: thinking about your sweet sister in law, Denise, and sending love and prayers to you and your family. LovingisLiving: hugs for you and your brother. I saw you over the RoseValley, I'm in Shock, and ** AMEN ** threads as well. I started a thread for my friend who is Stage IV. https://community.breastcancer.org/forum/16/topics/840696 After two doses of the two antibiotics, my fever broke. It's been 2 days since my last Tylenol and no fever. Thank you all for your prayers and thoughts.",
      "MessageIndex": 497,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 20, 2015 03:18AM - edited Dec 20, 2015 03:33AM by Mominator Smurfette, I'm happy to see you are doing well. Happy birthday to your granddaughter! Two years old is a fun age. Katykids, Wow, so you feel the TEs all in your armpit? Yuck. Are your breasts still numb at all? I'm wondering if you only feel it in your armpit if your breasts are numb or if your TEs are pushing into the sides. I haven't taken muscle relaxers for the spasms. This is the first fill since surgery 6 weeks ago and these muscle spasms are all new. I had weaned myself off Percoset 5 days after surgery, and Tylenol about 2-3 weeks after surgery. Right after surgery, my breasts were bruised and swollen and somewhat numb. Everything seemed to hurt, although I couldn't say what. Maybe I hadspasms then, but it was part of the overall pain. Now that the bruising and swelling has gone down, and the numbness is going away, I can now feel different things. These spasms are distinct, and are the worst first thing in the morning. Fortunately, I don't have them very often nor as strong through the rest of the day. I think my PS would expand me even more if I want, as my TEs have a 650 fill capacity. However, I'm at 480 now and my breasts actually look too big to me. My hubby thinks I look great now. But he has only seen me in clothes. He has said he would probably pass out if he saw the incisions.",
      "MessageIndex": 442,
      "PostDate": "20/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 19, 2016 07:30PM Mominator wrote: Hello Katykids and TikkasMom, thank you for the prayers and kind thoughts. Waves to all our ladies as you go through your treatments. I'm feeling much better today. I'm still wearing the scopolamine patch and the nausea has been very mild. I've been able to eat today. My PS's staff really excel at follow up. I got two calls from the surgery center: the nurse and the anesthesiologist both were checking up on me. Anesthesiologist told me the gunk in my throat is from the anesthesia gases as she didn't need to use the tube on me. I also had a post-op appointment with the nurse to check my incisions and change my dressing. I looked in the mirror but I really couldn't see my new breasts yet as they were completely covered in surgical tape. Thursday I see the PS himself. I'm hoping to get clearance for showers. I suspect it's too soon to hope for driving. My drain totals were R=83, L=73 yesterday and R=58, L=48 today, so those will be staying for a while. How's everyone doing these days? Love, strength, and prayers for everyone.",
      "MessageIndex": 479,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 24, 2016 06:22PM Mominator wrote: TikkasMom: I don't think you need to add the clogged drain surgery, if you don't want, as it was a result of the previous surgery rather than an additional treatment (such as Lx, Mx, SNB). I think the purpose of the profile is so people can get an overview of each other's journey so far. Some people specify if the Mx is prophylactic, which I'm guessing your right Mx was prophylactic if your Dx is on your left. Some people also mention if they've had TEs or other reconstruction done. I think of the profile as a quick introduction to the others on the board. You can say as much or as little as you'd like.",
      "MessageIndex": 491,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 27, 2015 02:17AM Mominator wrote: Hello! Newbie here. I am BRCA2 positive. I have decided to have prophylactic surgery. I will have a bilateral mastectomy (nipple-sparing, w/recon) plus bilateral Salpingo-oophorectomy during same surgery on November 11. My MRI showed an area of enhancing mass, an ultrasound was inconclusive, and the MRI-guided biopsy was benign. My mother had DCIS at age 62, and now has Stage IIIA invasive lobular cancer in the other breast. Tumor was 5.3 cm, and 11 of 12 nodes removed were positive, most were completely replaced with cancer. My maternal grandmother died of ovarian cancer when she was 48.",
      "MessageIndex": 30,
      "PostDate": "27/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 20, 2015 12:29PM Mominator wrote: Frill, I'm happy to have you back. I'm so sorry about your half surgery. I'm sorry only one boob was done. Was the other boob prophylactic? Once you get the other MX, what is the surgery two weeks after that? Hey, look at it this way, you get to rest and recover before you experience the \"joys\" of TEs. I'm cursing my TEs \"Every breath I take / and every move I make.\" Modern medicine is an art and a science. My bp dropped very low during recovery. They think it was the nitroglycerin patches that they put on my nipples to encourage blood flow. My bp was down for 10 hours. I was so scared. I hope your pathology is good news and that you will have a clear path from here. Madelyn AKA Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young ",
      "MessageIndex": 274,
      "PostDate": "20/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 20, 2015 01:10PM Mominator wrote: Hello all, just got back from my appointment with the Breast Surgeon. I am very sore, bruised and swollen, but I am recovering. My incisions are healing well. Since the drains are putting out 30+ ml per day, they stay in for now. I didn't get my wheels back. Breast surgeon wants me to heal some more, and to get my drains out, before I can drive. One surprise is that the surgeon now wants me to start wearing a soft bra or camisole for support 24/7. No one had mentioned any bra until now. I thought most patients get a surgical bra if they need one. Since no one mentioned it, I thought I had a pass. Believe me, nothing is moving there. Rock hard TEs in the midst of swollen breasts. Now I have to go find some support. Next Tuesday, I see both the Gynecological Oncologist (for the BSO) and the Plastic Surgeon. The Gyn Onc will need to check my incisions. The Plastic Surgeon wants to check the questionable tissue on Leftie. Maybe it will slough off, or maybe he will trim it off. If my drains are below 30 ml for two whole days, the drains can come out. Maybe I'll get my wheels back then. A big question is what our little of 5 family is doing for Thanksgiving. We had made plans to travel to Massachusetts to visit with our family. Hubby's brother is hosting Thanksgiving on Thursday at his house, we would see the entire side of hubby's family then. My brother is hosting a smaller Thanksgiving for our side of the family on Friday. I would see my Mom, who has been in treatment for Stage III Invasive Lobular Cancer since Sept 2014. We will see how I feel on Tuesday, and make a decision then. Madelyn AKA Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 275,
      "PostDate": "20/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 21, 2015 04:37PM Mominator wrote: Hi Diane, Welcome home! The first few days are the worst, but each day does get a little better. Keep on your pain meds for the first few days, then you can wean yourself down. Rest as much as you can, and add in a little walking around the house to keep your circulation going. Madelyn / Mominator",
      "MessageIndex": 290,
      "PostDate": "21/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 27, 2015 09:41AM Mominator wrote: Frill: the drain output goes down eventually. The fluid in mine turned a bright yellow the day after discharge, then back to red, and then reddish-orange. Remember these drains work on a very weak vacuum. The tubing can get flat, then return to round. That happened to me once the flow dropped below 40 per day. Just remember after you empty the drains to squeeze the bulb/juice box before you put the stopper back on. That will help keep the vacuum. Do give your surgeon a call whenever you have a question. There are no dumb questions. I called twice over my first weekend home, on Saturday for the yellow fluid, and on Sunday the feeling of really hard, really warm breasts. Both turned out to be normal, but I went in to see the nurse on that first Monday and she was great. She cleared up my bandages, and told me that I was very bruised and swollen, and that was why my breast were hard and warm. By the time I saw the PS on Tuesday, I had three big questions answered. Good luck and let us know how you do.",
      "MessageIndex": 344,
      "PostDate": "27/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 30, 2015 06:05AM - edited Nov 30, 2015 06:07AM by Mominator new_me/Diane: I'm so glad to see you back! I hope you are recovering. I miss hugs as well. TikkasMom: YEAH!! YEAH!! YEAH!! TallnTerrific: thanks for your support. I asked my nurse last week about exercises and she said it was too soon. I'm going to ask when can I start. I'm thinking even if I do simple things very slowly that might help ease the tightness in my chest. Welcome Portmana. I hope you find some information for your friend. There is a lot of information on this website. Live4them: sending you lots of positive JuJu. We're in the same boat. My black patches looked worse to me this morning. Today is my debridement procedure, I hope I don't lose too much areole tissue. Smurfette: I hope you are feeling much better. Frill, I'm glad my observations made sense to you and DBF. Yeah!! This is what this thread is all about. Each of us can share and help the other. November is over, but our journey has just begun. It will be months before all of us are healed. We will travel this road together. I joined a pregnancy board back in January 2001 when I was over 35 and pregnant with #3. Not only did we share that journey, but many of us are still friends more than 14 years later. Whenever any of us travel, we try to meet up with others. Love to all, Madelyn / Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 355,
      "PostDate": "30/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 9, 2015 05:50PM Mominator wrote: I saw the PS yesterday. The incisions on both breasts are healing nicely from the debridement from last week (week 4) . I'm at week 5 and the swelling has really gone down a lot this week. Rightie is still oozing a little bit, and he would like to give the incisions another week to heal fully. So, the stitches won't come out until next week (week 6). Next week he will start fills. I was filled 420 ml during surgery. I had so many questions about sections that still hurt, or are bruised, ribs that hurt, the tightness in my armpit, and I can't lie or sleep on either side. All are normal. I had a lot of swelling and bruising because so much tissue was removed (812 gm on the right, 666 gm on the left). My antibiotic finally ends tomorrow. I don't have to put triple antibiotic cream on my incisions any more. I can use smaller gauze pads rather than the big ABD surgical bandages, as long as I have just a little something between me and the bra. I can start slowly with some exercises, just walking my fingers up the wall. He said BS can give me more exercises when I see her. This is not his area. I can also take my multivitamin (includes Vit E) and calcium/Vit D supplements again. Both were discontinued two weeks before surgery and had to stay off of the because of the debridement. I can stay on my supplements until two weeks before exchange surgery. All in all, I'm healing and getting back to normal. Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 415,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 5, 2016 05:15PM - edited Jan 6, 2016 02:44AM by Mominator Hello lovely ladies, I just got back from my PS and I have a date for my exchange: January 18, 2016. That happens to be MLK, Jr. day, so hubby and the children all have the day off. No worries about getting someone to/from school. I'm looking forward to getting rid of these TE's and moving forward. TallnTerrific: I live 300 miles away from my mom, so it's hard to help her. I read all her pathology reports and make lists of questions for my brother who goes with her. katykids: do you have a treatment plan yet for your shoulders and arms? That sounds so painful. Sending gentle (((HUGS))). Mominator",
      "MessageIndex": 453,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 15, 2016 06:41PM Mominator wrote: Hello to everyone! Special waves to Smurfette, britheal, and Frill on your journeys through chemo. Thanks for the updates. I'm completing final preparations for Monday's exchange surgery: I stocked up on non-perishables, especially heavy items, and I have been doing a lot of cleaning, organizing and paperwork. After November's BMx/BSO, this should be a piece of cake. I am sooooooooooo looking forward to getting rid of these TE's.",
      "MessageIndex": 474,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 28, 2016 03:43PM Mominator wrote: It's been quiet on our November surgeries board. I hope everyone is doing well. I guess you ladies have all gone off to other forums. Wishing you all the best with your treatments. Check in when you can. Love, Mominator",
      "MessageIndex": 492,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 10, 2015 04:58PM Mominator wrote: Hello ladies, I'm taking a break from packing to say hi! I went in for my marking 5:00 pm local time. I love my doctor. He was all over me with that marker. First he drew landmark lines down my mid-line and the inframammary fold on both breasts. Then he started on rightie, my larger breast. Two mostly crescant-shaped incisions above my nipple, with keyholes for my nipple, and about two inches between the incisions. Looking down, it looks like the batman sign. He made similar marks for leftie, although just slightly smaller so that they will match for size. I should mention that I am currently 36C or D, although I was 38DD before I lost about 50 pounds. Both my breast surgeon and the plastic surgeon have mentioned that I have \"pendulous\" breasts. My PS made a point of \"warning\" me that he could not reconstruct me as large as I am now. \"Thank goodness\" was my reply. Anyhow, I'm feeling much better now that I have a general idea of what I'll look like post-op. IrishEyes: Thanks for the update.",
      "MessageIndex": 170,
      "PostDate": "10/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 19, 2015 02:18AM - edited Nov 19, 2015 02:24AM by Mominator Marie711: I'm sorry for two diagnoses, and two surgeries, for you. As I understand it, pathology will be slicing and dicing the entire sample, no matter how big it is. Their job is to prove or disprove that all the cancer has been found, removed, and identified. They will be checking the areas and identifying the types of tissues found,and the margins on the cancer. I've had 3 different biopsies this year, and everything has been sliced down to about 1 cm or so. They are very thorough. I'm praying for a good pathology report for you. Love, Mominator ",
      "MessageIndex": 260,
      "PostDate": "19/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 30, 2015 02:04PM Mominator wrote: Hello Lovely Ladies, I hope you all had a great weekend and Monday has been good to you!! katykids: My son is 20 years old with autism and a bunch of other Dx. DD#1 has Major Depressive Disorder, Generalized Anxiety Disorder, and panic attacks. DD#2 has ADHD and fibromyalgia. Also, I had a big reduction when they did the BMX and expanders. Both the Breast Surgeon and the Plastic Surgeon noted that I had pendulous breasts. About 2 pounds of tissue was removed from each breast. Smurfette/Donna: praying that round 2 of chemo goes much more smoothly for you. TallnTerrific: thanks for the exercises. I'm nervous about the fills hurting, but I think I need to heal a lot more before he starts filling mine. He hasn't mentioned fills at all, as we had been working on those black patches. Also, thank you for the devotionals. Live4them and anyone else who wants to know: The debridement procedure was weird, not painful, and was like having an out-of-body experience. I was in an OR, on a table, freezing cold, and covered in blankets. He used plenty of local anesthetic and I was draped. Before he started, we talked about how we had waited to let the areas come back, and both breasts had pinked up considerably, however, there were still areas that weren't coming back and now it was time to take care of them and prevent infection. I didn't watch the proceedings, but I knew what he was doing, between the equipment in his hands and what he was saying to me and the assistants. Rightie, which was the better looking of the two, squirted out a bunch of fluid right at him. He joked that it was out to get him. He removed the dead tissue from both breasts and used two layers of sutures to close, which means that the black areas went deep. I'm glad that's behind me. I won't know how much was removed until I change the dressings tomorrow. I'm really not ready to look today. Nurse gave me some special bandages to use on the incisions over the next few days. You ladies are going to laugh at me. Remember that I had not been given any bras and I was not wearing any bras for two weeks? Well, once I got my surgical bras last week, I have been wearing them 24 hours daily, even though I had asked if I could not wear them overnight!! I noticed that both breasts were better shaped after just 8 hours in the bras, so I kept them on that first night and every night since. However, some days my ribs feel so sore, I had been leaving the last few hooks undone overnight to give myself a breather. I asked today's nurse if the bras were feeling a bit tight because I'm still swollen or are the bras are too small? She said it's hard to know. She gave me two bras of the next size bigger to let me try. She said that I could wear the new bigger size or the smaller bras with the last few hooks undone. Love to all, Madelyn / Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 361,
      "PostDate": "30/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 18, 2015 06:57PM - edited Dec 18, 2015 07:07PM by Mominator sonyaryan: welcome! This is a great bunch of ladies here. live4them: hoping for a great score for you. marie711: I hope you lymphedema is better. britheal: congratulations on 47 years together. Here's to many, many more! Frill: thank you for the Lucy Lawless stories. I'm sorry your boss is such a jerk. ChiSandy: I'm glad you enjoyed your trip. Natjordlee: I'm sorry about your drainage. My mom had no drains for her lumpectomy, axial dissection. She had to be drained several times and it was very painful. I hope yours settles better, especially with your new drains. Lovingisliving: I'm so glad you got a second opinion. Smurfette: Thinking of you and hoping that this chemo is treating you well. new_me/Diane: I hope you are well. Miss you.",
      "MessageIndex": 438,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 18, 2015 07:56PM Mominator wrote: Appointment with PS yesterday. Now that the debridement area has healed, I had my first fill since surgery. He added 60 ml, so now I'm at 480, and my breasts are rocks again. I am having a problem with the left TE. It seems to have shifted towards my armpit and it sticks out a little bit from the side. When I move my left arm, I feel I'm brushing against my breast. Even worse is that TE is also poking and hurting me in the middle of my breast. First thing every morning it spasms and really hurts. PS said he could see it poking out just a little bit, and it would be corrected at exchange. He also had the nurse take pictures of my breasts from the sides. Nurse says I still look swollen to her, though much better than that first visit after surgery. Stitches came out also, and that looks so much better. There was a lot of the durmabond all over the incision lines. I tried to help it fall off. Then that creeped me out and I got nauseous so I stopped. Between the holidays and his schedule, I get almost 2.5 weeks until next visit.",
      "MessageIndex": 439,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 20, 2016 06:15PM Mominator wrote: Katykids, I am so sorry to hear you're in that much pain. Besides your PT, do you have any other treatments going on for your diagnosis?",
      "MessageIndex": 481,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 28, 2016 07:28PM Mominator wrote: TallnTerrific, congratulations on halfway through rads. I hope it goes smoothly for you. I put this thread on my favorites because we have been through so much together. I've been running a fever for two days. This morning a red patch developed on my right breast and a dull ache beneath the patch. PS says looks like an infection is brewing. He's switching me over to two high-powered antibiotics and hoping we nip this in the bud. He wants me to monitor it closely. Never a dull moment",
      "MessageIndex": 494,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 12, 2016 09:54PM Mominator wrote: Frill, I'm happy to see. I'm confused by the long list of treatments and their dates. Do you have stuff planned out through 2017? Re-reading your post, yes. Yowza!! So I want to see you in some of these wigs, hats, and scarves, most especially your near butt length platinum wig!! And while we're sharing pictures, this is me September 2015 at the St. Baldrick's Shaving Event to conquer Childhood Cancer, and me early December 2015, and a before of me back in March 2015 (OK, I needed a hair cut in that one). So Frill, your pictures will be much better than mine.  Good to see you Diane/new_me! Your exchange is coming up next month. You'll love the squishy, non-rock side. Good to see you too, Donna/Smurfette. I hope the Ariimidex is treating you well. Love to all, Mominator",
      "MessageIndex": 504,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 27, 2015 11:17PM Mominator wrote: Hello Diane/new_me Why are you having SNB? Is it because of your sisters? I am impressed that you already have your silicon implant surgery scheduled. Welcome, surgery buddy.",
      "MessageIndex": 35,
      "PostDate": "27/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 2, 2015 04:12PM Mominator wrote: Miss Bee, wishing you all the best as you recover from your surgery. You are a super duper rock star and I hope your recovery is smooth sailing. IrishEyes, sending you calm vibes for a restful night tonight and a smooth surgery tomorrow. Looking forward to seeing both of you on the recovery side. Love, Mominator",
      "MessageIndex": 76,
      "PostDate": "02/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 29, 2015 09:20AM - edited Dec 29, 2015 10:33AM by Mominator Hello lovely ladies! I see all was quiet on the board during Christmas break. I hope everyone had a wonderful time with their families and friends. We visited both sides of our family in Massachusetts. My Mom is healed from her lumpectomy and axial dissection surgeries, and has finished her radiation treatments. She (80) and Dad (84) have both hurt their backs recently and are having trouble with daily activities. My brother and I are glad her doctors didn't recommend chemo. Live4them: I hope you are healing well, and lefty is doing well. I wanted the black patches to heal naturally, but PS felt it had pinked up as much as possible and he wanted to prevent infection. Let me know how your appointment went. As for my armpits, I'm a little less tight, but there is still muscle and tissue in my armpits. I told PS that I am a flutist, and when I play now I'm pressing against my breasts. He said that would be corrected during the exchange. Katykids, thanks for all that info. Natejordlee, I'm glad to see you're progressing. I'll be thinking of you as you start radiation next week. My Mom had rads both in 1997 and 2015. New_me/Diane: good to see you back. I'm glad your PBM was clear. TallnTerrific, I had some leakage during debridementand and a week after as well. We are still healing, which is so hard to tell family members who have been waiting to see us. I'm so sorry your sweet sister is dying. I hope you had a lovely visit with her. It's so good to see you Letsdothis/Cindie! I looked for you in the December thread but didn't see you. My drains got a little gross towards the end so I started rinsing them out, mostly with just water, but a couple of times with rubbing alcohol. Good to see you TikkasMom. My very best wishes to everyone and praying for a Happy and Healthy New Year. Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 450,
      "PostDate": "29/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 12, 2016 10:04AM Mominator wrote: Oh my! We've all been busy haven't we? Thinking of Live4them and TikkasMom and hoping that the insurance/money issues get resolved. Natejordlee: very best wishes as you start your next round of rads. My mom did rads with each of her Dx's, I think about 30 treatments each. She did very well until maybe the last week or so both times she got some burning on the skin. You can ask you doctor about creams or ointments to help protect the skin. letsdothis/Cindie: I'm happy to see you posting here on November thread. Kudos to your hubby for taking care of your incisions and removing the drains. Wow. I hope that your pneumonia has cleared by now. I am very sorry for the loss of your dear, sweet grandma. No driving still is also very hard. Enjoy the Game of Thrones. In case you haven't been warned: any character can die at any time. My heart has been broken a few times, but I let them live on in my imagination. Frill: I bet you would look cute in a sassy short haircut. In honor of you and all chemo sisters, I am changing my avatar to my shaving day when I participated in a St. Baldrick's fundraiser (http://www.stbaldricks.org/) in September. Are you having your recon before or after your Mx on the other side? I hope you gain your ROM soon. My hubby can't even look at my incisions. So no, I had no help at all with incision care and drains. I have my exchange surgery next week and I know I will have to do it all over again by myself. But I am looking forward to getting rid of the TE's. My left one has moved into my armpit and really hurts. Strength and healing to all. Love, Mominator",
      "MessageIndex": 469,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 19, 2015 04:56PM Mominator wrote: mulligan, Sandib65, Citrinetiff, TikkasaMom, and Frill: looking forward to you all coming home and resting. new_me/Diane: wishing you all the best tomorrow, smooth surgery and easy recovery. BTW: new_me is Diane. I was using both her screen name and her name from her signature. love to all my surgery sisters, sending lots of love, prayers, and strength, Madelyn AKA Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 268,
      "PostDate": "19/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 24, 2015 02:17PM Mominator wrote: Hello Lovely Ladies, Big day today at 13 day post op: I saw both the Gynecological Oncologist (for the PBSO) and the Plastic Surgeon (PBMX w/TEs). In the morning I saw the Gyn Onc. My incisions were checked and everything is healing nicely. The incisions feel thick, which is the sutures under the skin. My belly is still all stretched out. All will return to normal eventually. In the afternoon I saw the Plastic Surgeon. PS says most of the incisions are healing up nicely. Both Lefty and Righty have patches of black skin that has started to slough off. PS spent some time debriding those patches, but he is concerned. Some of the black seems to go deep. He wants to be proactive and prevent any possible infections. He wants me to come to his surgery center next Monday to trim up and re-suture the black patches. Surgical coordinator says she's trying to get insurance approval today or tomorrow. I'm thinking, the patches have been getting better each week, and have really gotten a lot better these last two days. Do I really need another procedure? In regards to the bra issue: PS did NOT want me to wear a bra these past two weeks because he didn't want any pressure on those black patches. Now that the patches are settling down, he wants me in a surgical bra for support. I asked if 24/7 or just daytime, and he (relented?) said just daytime. Nurse gave me two nice, soft surgical bras. The bras are mostly comfortable, although some pressure on the bruises, and actually are quite pretty in a metallic gold fabric. ChiSandy, thanks so much for your post about bras. I bookmarked the HerRoom.com page. The bras looked very nice, and that will give me plenty of options down the road. Both Lefty and Righty have been putting out >30 ml per day for the last two days. So the drains came out today! Woo-hoo! Nurse was super gentle taking them out, and it was just uncomfortable not painful. She says each hole is the size of a pea. I don't know, I couldn't see and I'm not going looking. *I'm tired of seeing my body all beat up. I'm just going to leave those bandages on for a day or so. Another big deal is that I got clearance to drive again. Breast surgeon didn't give me clearance last Friday as she really wanted me to heal some more. I'm not going to push myself (promise), but it has been very difficult for me being grounded. I do not have family in the area, and my friends are dealing with their own issues. One friend's daughter is just completing treatment for Hodgkin's, and another friend's father had heart surgery. Other friends' work schedules are too demanding. Hubby works full-time, and already took off 3 days for my surgery. He's worried about jeopardizing his job (he was unemployed for 6 months last year). *Just a little whine: I'm the only one taking care of myself. No help at all from hubby or my daughters on any medical thing. I had to hide my drains at all times because it made my family feel woozy. No one helped me with my bandages or drains, or helped me put antibiotic on the sutures. Especially those first few days when I was so sore and everything felt awkward. Hubby will help me get in or out of a car, and get scripts and supplies from the pharmacy, but he didn't want to see anything. We're going to have a quiet Thanksgiving as well. Despite my progress, hubby & I have decided not to travel to Massachusetts for Thanksgiving. The long travel is going to be too much for me this early in my recovery. Madelyn / Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 321,
      "PostDate": "24/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 27, 2015 01:12PM Mominator wrote: Argghh, I'm very stressed about this. At Tuesday's appointment, Plastic Surgeon cleaned up the skin that was sloughing off the black patches on both breasts. But there was still at lot of black on both, so he wants me to come to the Surgery Center on Monday morning to have a debridement procedure on the rest of the black patches. It will be done under local anesthetic. So then I was to make arrangements with the surgical coordinator. She gives me some paperwork and tells me that the Surgery Center will call me on Friday with my arrival time. The Surgery Center called. They don't have an arrival time for me. They just want to know how long it will take for me to get there. They will call me when it's time to come in. SC coordinator was not helpful at all. So I called back a few hours later, hoping that they will have gotten the schedule fixed by now. Nope. Another lady answered. All she could tell me was that the surgeon does all of the general anesthesia procedures first, then the local procedures. All she knows now is that I won't be first thing in the morning. I said I have young children. I can't be hanging by the phone all day. I would prefer it in the morning while the children are in school. She said, well, we will work with you. So I'm just supposed to go about my day, except be ready to drop everything and drive 45 minutes each way to the Surgery Center and have a little procedure done. Sheesh! I have a conference called scheduled Monday morning with the intake coordinator for DDD for my son. Then we have an orthodontist appointment scheduled for 3:30 for one daughter, and Physical Therapy at 4:00 for the other. Of course, I will have my phone with me at all times, prepared to tell these other professionals, Ooops, we can't come in today because I have to go have a procedure done. That should go over well. Madelyn / Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 347,
      "PostDate": "27/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 2, 2015 09:54AM Mominator wrote: Welcome Deaconlady! We are a lively bunch of ladies with several different diagnoses in this thread. Most of us had surgery in the month of November, and a few ladies had their surgery earlier and dropped by to guide us. (One lady, letsdothis, was scheduled for November and got bumped to December because of a respiratory infection.) I hope you find the support you need. We talk a lot about our surgery and recovery here. If you want more info about your situation, there are many other boards as well, such as lumpectomy lounge and DCIS. I'm not saying we can't help you, just that many ladies are active on several boards, so that's an option.",
      "MessageIndex": 374,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 2, 2015 10:33AM - edited Dec 2, 2015 12:55PM by Mominator new-me/Diane: (((gentle HUGS))) We are in the same boat. I had black patches on top of my aureoles along the stitches on both breasts. It is caused by the lack of blood flow to those areas post surgery. My beast and plastic surgeon doctors watched the patches very closely. Part of them both recovered but not all. Last week, day 13, my PS made the decision for the debridement, which took place this Monday, day 19 I trust my PS that he got all the dead tissue. I'm sure that this is one of the many reasons we all are followed closely week to week. There are many other causes of necrosis in wounds (diabetes, infection, etc.), but both you and I were in excellent health before our PBMX and we don't have those risk factors. Our black patches were caused by the trauma of the surgery. I don't expect more patches to develop. You can talk with your PS about your concerns and ask if he expects this to be an ongoing problem. It sounds like he's striking a balance between being conservative not to take too much tissue and being careful that he got all the dead tissue. Sending you many more (((gentle HUGS))) Love, Madelyn",
      "MessageIndex": 375,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 9, 2015 04:32PM Mominator wrote: Frill: I hope your drains are behaving now and that you are feeling better. lovingisliving: I hope the cording works its way out. I have some tightness and ropey feeling under my arm, but only when I move certain ways. My PS said it was normal, but yours sounds worse than mine. Congratulations on your score. jblmom: Woo-hoo! No chemo. Congratulations! Live4them: good luck on your score. katykids: so sorry for your frozen shoulders. I hope they get better. Smurfette26: so good to see you! I hope this round of chemo is treating you better. Love to all, Mominator",
      "MessageIndex": 414,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 6, 2015 06:11PM Mominator wrote: Welcome Jblmom and Thundergal64 !! Thanks for the new list, TallnTerrific, you're scheduled the day after me. I'm sending healing prayers to the ladies who had surgery this week. I hope your surgeries went smoothly and recoveries are gentle. Nov. 2 MissBee123, debiann, katykids Nov. 3 IrishEyes39 Nov. 4. zzlady, Quiddler, Natejordlee, EllenMC Nov. 6 cjafarm, PattyMeg, Love, Mominator",
      "MessageIndex": 112,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 8, 2015 04:16PM Mominator wrote: Warm welcome to letdothis15 and sugar-and-spice!! Congratulations cjafarm on good node news! Frill, I'm sorry for your surgery change. I guess you're not hosting Thanksgiving this year. Sending prayers and healing thoughts to all the ladies for Monday and Tuesday this week: Nov. 9 Truffles1968, Live4them, catfurr, scsa Nov. 10 TallnTerrific, lovingisliving Love, Mominator",
      "MessageIndex": 134,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 14, 2015 07:42PM Mominator wrote: lovingisliving and Freeland thank you so much for the information and support!! I was nauseous this morning and took a Zofran tablet, which took away the nausea but made me dizzy. I was nauseous again this afternoon, and couldn't eat much for supper. Then I remembered the nurse had me eat some crackers the first time I took the Percocet. She said it's better than taking it on an empty stomach. I had totally forgotten that little tip until now, and there's no warning on the Percocet to take with food. I had two graham crackers and a banana, and then I felt much better. I had a benefit from being in the cardiac unit: my nurse put each of my drains in a telemetry bag. We hung the bags from my shoulders when I was walking. I hang the bags from my waistband now that I'm home. When I pull down my pants to pee, I hang the bags from my knees. brithael: I'm glad to see you back. I hope you had a nice nap today. Goodnight lovely ladies, I hope we all have a restful night.",
      "MessageIndex": 210,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 17, 2015 03:40PM Mominator wrote: Hi Everyone! Wow, so hard to keep up the post fly by here. lovingisliving, britheal, sugar-and-spice: I am sending thoughts and prayers as you all wait for your pathology reports. Natejordlee: I'm so sorry all you're going through without drains. I hate my drains, but I would be even worse without them. I hope your drainage calms down real soon. klmorales76: thanks for all the good information so far. You have been a very big help to me and I want you to know how much I appreciate your posts. letsdothis15: I know how disappointed you are for having your surgery postponed. I remember my nurse at my last pre-op visit: \"let us know if you get sick. Believe me, you don't want to go through surgery if you're sick.\" BTW, letsdothis, I love your name. I was so ready to get this done. I went into surgery feeling 110% ready to handle anything. Now on the other side, I feel like I've been through the wringer. I'm getting stronger every day, but I'm glad that I don't have an illness to fight on top of this. I will read some more posts and catch up with the rest of you later. Sending many warm thoughts and prayers to everyone. Love, Mominator",
      "MessageIndex": 243,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 18, 2015 04:31PM Mominator wrote: mulligan: I hope your surgery was smooth sailing today and I am looking forward to seeing you on the other side. Sandib65, Citrinetiff, TikkasaMom, and Frill: wishing you all the best tomorrow, smooth surgeries and easy recoveries. new_me/Diane: the wait is almost over. Wishing you a peaceful day tomorrow, and smooth surgery on Friday. love to all my surgery sisters, sending lots of love, prayers, and strength, Mominator",
      "MessageIndex": 255,
      "PostDate": "18/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 18, 2015 06:04PM Mominator wrote: Jblmom: I'm sorry it was a good news, bad news appointment. Hoorah for the negative lymph nodes! I'm so sorry for the positive margins. I would have thought that the margins would have been bigger since the mastectomy would have included the remaining breast tissue. I know you're not looking forward to radiation, but maybe that might not be necessary after the next surgery. I hear you on the pain cycle. This is my second surgery this year, and I don't like the pain cycle either. But your next surgery will be so much less involved than the mastectomy, so I would think that the pain cycle would be shorter. Trying to look on the brighter side for you. Hang in there, sister, you are one tough cookie!! Love, Mominator",
      "MessageIndex": 257,
      "PostDate": "18/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 19, 2015 06:26PM Mominator wrote: Welcome back, TikkasMom! You rock. I hope you continue to amaze everyone, you certainly amaze me.",
      "MessageIndex": 270,
      "PostDate": "19/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 24, 2015 06:54PM - edited Nov 24, 2015 06:54PM by Mominator Catching up from while I was away at doctor appointments. Smurfette26/Donna: I'm so sorry about your chemo Febrile Neutropenia. That sounds scary. I'm glad to see you posting just now and I hope you are feeling much better. I'm sorry about your hair as well. My best friend's daughter is just finishing treatment for Hodgkin's lymphoma (chemo/surgery/radiation). She lost her hair to chemo. Her mom & I were saying when you lose your hair, you know the chemo is working. She said, \"I am not this hair. I am not this skin. I am the beautiful soul that lives within.\" Her hair just started to grow back this month. Sending big, gentle HUGS and keeping you in my prayers. klmorales76: yeah for another drain gone! I hope you are drain-free soon! live4them: so sorry about your drains. I hope your drains clear up, or that on call better clear them for you. TikkasMom: I'm so sorry your drain got clogged. Did you have to go back today to get cleared out? I'm praying that both of you get cleared out soon. keepsake: I hope the side effects subside and the seroma goes away. Frill: I don't think the drain is putting out more because you're doing \"too much.\" I think we all need to find that balance between resting/recovering and moving/getting back into daily activities. We all need to move for our circulation, muscle strength, and mental sanity. My Breast Surgeon said that walking around was even better for my recovery than using the breathing device. new_me/Diane: I haven't seen you for a while. I hope you are resting. Give us an update when you feel up to it. brithael: I hope you are able to stay ahead of the lymphedema. That compression sleeve sounds good. I hope you feel well enough to travel. You're so sweet to me. I'm sorry for all your regrets with your mom. My mom is on her second breast cancer. She had DCIS at age 62, and now Stage III invasive lobular in the other breast at age 79. I was surprised. Then she told me that she is BRCA+. She had forgotten to tell me back when she found out. Probably because I live 300 miles away. Believe me, if I had know she was BRCA+, I would have been much more proactive in her care. Her health team totally let her down. She didn't have any additional surveillance, or chemo prevention, or prophylactic surgery options offered to her. Love to all and my prayers to all the ladies on this journey. Madelyn / Mominator BRCA2+, wife, mom to 3 children of various special needs, musician, volunteer, 54 yrs young",
      "MessageIndex": 324,
      "PostDate": "24/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 1, 2017 03:04PM Mominator wrote: Hi Lokos, I don't have any experience with DIEP flap surgery. However, you may get more responses if you post this in the Breast Reconstruction forum (where you posted your nipple question), rather than here in the surgery forum. Best wishes, Mominator",
      "MessageIndex": 1,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852326",
      "Title": "anyone removing IMPLANTS and having DIEP Flap surgery? Lokos Lokos"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 8, 2016 08:56AM Mominator wrote: (((HUGS))) Rosevalley Praying for a miracle and/or your MO can pull something out of the hat. Holding you close in my thoughts and prayers. Madelyn",
      "MessageIndex": 910,
      "PostDate": "08/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 11, 2016 02:23AM Mominator wrote: Hi Rosevalley, Thinking of you this morning. I was able to get a little progress on the blanket this week.  Sending light, love, and roses to you, Madelyn",
      "MessageIndex": 932,
      "PostDate": "11/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 29, 2016 04:18PM - edited Jun 29, 2016 04:21PM by Mominator Rosevalley, so many good things happening for you: TMs going down, Abraxane infusion going well, visits with DD2, seeing DD3 to camp, nature walks with your dog, being able to eat your favorite foods, and wearing some pretty shirts! I'm so happy for you!!! Not only are there bunnies in the neighborhood, but there is a family of rabbits under our front porch. There is a loose spot in the latticework where they slip underneath, and every winter. we see their footprints leading to that spot. We had a handyman fixing the front door and he offered to fix the latticework. No thanks. I like having bunnies under my porch. May you be happy, comfortable, and peaceful all through summer, with many more walks, visits, and cheese sandwiches. Sending love, light, and many prayers. Madelyn.",
      "MessageIndex": 1086,
      "PostDate": "29/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 19, 2016 11:10AM Mominator wrote: It's Tuesday. Rosevalley's MO has a plan, and we have prayers. Praying that the new treatment gives Rosevalley much need relief from her symptoms and a wonderful quality of life for a long time. Much love and prayers, Madelyn",
      "MessageIndex": 1214,
      "PostDate": "19/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 23, 2016 12:27AM Mominator wrote: Rose, I'm heartbroken by the loss of the Deaf father of two in NC. It's sad that so many police encounters are now \"shoot first, ask questions later.\" I have similar fears for my autistic son. Although he is high-functioning, he does get stuck and will not always follow directions. Fortunately, my son is never alone, there's always a family member or a staff member with him at the group home (just placed). However, to protect him further, we will be registering him with the county's special needs registry. I like the \"sign language only\" sticker on the back windshield and carrying a card explaining things. That would be useful for many special needs people. There are many groups for parents and children with special needs, who will have many more resources for you. Because my son will always need a guardian,I've been looking into these folks: https://plannj.org/wp-content/uploads/2016/04/PLAN... Their mission: \"Who will care for my loved one when I'm gone\" Worrying about my son keeps me up at nights as well. Finding the right resources can help. Wishing you peace as you make your plans for DD. Sending much love and prayers, Madelyn",
      "MessageIndex": 1331,
      "PostDate": "23/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 25, 2016 05:59AM Mominator wrote: I am happy for your Lion King outing, and grateful for your reprieve. I hope you have a lovely day.",
      "MessageIndex": 1339,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 5, 2016 09:33PM Mominator wrote: Rose, thanks for the story of Banner and DD1. He was a special dog and a blessing for DD. I'm happy for all Banner did for DD and your family. Our DS has autism and a moderate hearing loss. He's had a series of out of district special ed schools to help with his behavior. ",
      "MessageIndex": 1738,
      "PostDate": "05/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 12, 2016 02:35PM Mominator wrote: Yeah for no puking! Wishing for many good days to spend with your precious daughters and dear hubby. Sending light and love.",
      "MessageIndex": 1761,
      "PostDate": "12/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 23, 2016 09:48PM Mominator wrote: Does it help to take the anti-nausea medications more often or round the clock as the end of the chemo week approaches? Hoping the carbo kicks in quickly so you can enjoy so many special moments with your family, especially DD3. Sending much love ❤️ your way.",
      "MessageIndex": 1790,
      "PostDate": "23/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 19, 2017 01:39PM Mominator wrote: Rose, holding you in my heart ❤️ and sending peace to you.",
      "MessageIndex": 1942,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 21, 2017 08:45AM Mominator wrote: Thank you Rose's DH, for updating us. Sending Rose some more love and strength for this journey. Wishing peace to your entire family. Madelyn",
      "MessageIndex": 1969,
      "PostDate": "21/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 14, 2016 02:49PM Mominator wrote:  This is my dog S'more, who always makes me smile. He's a friendly little guy and is sending you kisses. I am so happy when you get relief from the N/V, and so sorry whenever it returns. Praying for Torridon, her little boy, her DH, and family. Praying for you and wishing you pain-free days and restful nights. Hoping that you will be able to celebrate your daughter's birthday. Sending peace, love, and light to you.",
      "MessageIndex": 90,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 25, 2016 12:08PM - edited Jan 25, 2016 12:28PM by Mominator   This is from the Redwood Forest, California, which is is known for having the tallest trees on earth. George Lucas used the forest as the backdrop for the planet Endor in Star Wars. I'm sorry you didn't get to visit with DD. Could you Facetime on the phone or Skype with DD?",
      "MessageIndex": 200,
      "PostDate": "25/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 1, 2018 05:26AM Mominator wrote: Everyone I know who has had cataract surgery has done very well. My Dad was so excited afterwards that he doesn't need glasses any more!  Best wishes, Madelyn ",
      "MessageIndex": 3,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864316",
      "Title": "OT: Cataract Surgery blainejennifer ElleOnWheels"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 3, 2016 07:01AM Mominator wrote: Sending many prayers your way, dear Rosevalley. Surrounding you with love and light.",
      "MessageIndex": 875,
      "PostDate": "03/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 6, 2016 06:31PM Mominator wrote: You're not rambling at all. You're telling me some interesting stories and I'm enjoying them. I'm happy to hear of DD3's positive experience in Deaf Church. I hope she continues to feel love there. I wonder so much about the different religions we have on this planet. I like your \"many paths up the same mountain\" philosophy. I wish all religions could join hands and live in peace. I send prayers and loving kindness to you for relief from your symptoms. I wish I could help you directly. I wish that your daughter didn't have to see the draining. I understand you want to protect her from that. I know Lori's children helped their dad take care of mom, and dad shielded mom's dignity through most of it. I also know that they have so many more memories of happy times. There is nothing pretty about breast cancer. I hate all the pink. My BS's office is awash is pink. She and her staff participate in several BC events every year. While I appreciate all the money they must raise, I wish, not just her office but all of cancer land, there was less emphasis on awareness (which has been accomplished) and more work for the prevention and cure of MBC. I had asked about the use of Toradol/Ketoralac to help prevent recurrence, and she said she doesn't use such things until they are tried and tested. Yes, I'm making a blanket out of the roses. Originally I was just trying to see if I could could use up some leftover yarn, with a smaller project, but then I fell in love with the patterns and will expand it to a blanket.",
      "MessageIndex": 903,
      "PostDate": "06/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 5, 2016 02:13PM Mominator wrote: I'm sending best wishes and lots of luck for your infusion of Abraxane which is possibly happening right about now. 😘 Thinking of you as puppy and I are enjoying a nice walk in the fresh air and sunshine. ☀️",
      "MessageIndex": 1114,
      "PostDate": "05/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 14, 2016 10:43AM Mominator wrote: I hope that Taxol gives you great relief. Here's some flowers from our walk yesterday evening.   S'more helped pick out flowers for you.  Sending light and love, Madelyn (and S'more).",
      "MessageIndex": 953,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 16, 2016 11:45PM Mominator wrote: Happy Graduation Day Rosevalley and DD! I'm sending love and light your way. May today be a wonderful day for your family. 😍❤️😘💕 I'm sending some more roses from my yarn garden:  I hope you feel rested, or at least better for graduation.",
      "MessageIndex": 979,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 10, 2017 10:28AM Mominator wrote: Rose, I'm so sorry that the relentless vomiting is back. Please don't beat yourself up by coulda/woulda/shoulda. There have been so many times that you thought you would take your DWD meds, but you had goals and milestones to accomplish first. You got through the summer for DD3, you got to vote, you got through DD2 finals, and the Murphy bed, and you had a wonderful holiday time with the whole family. I'm especially happy you got through the holidays this year, and it seemed so much better than last year. What wonderful memories to leave your family! Have you had a chance to speak with your MO? Maybe he has something that would give you a window for your DWD meds to stay down? Wishing you peace and relief. Sending you light and lovingkindness. Madelyn",
      "MessageIndex": 1870,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 15, 2017 01:02PM - edited Jan 15, 2017 01:35PM by Mominator Rose, so glad that you are comfortable. Wishing you deep peace and continued comfort Sending you light, much love and many blessings to you and your family. Madelyn",
      "MessageIndex": 1916,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 15, 2016 09:51PM Mominator wrote: Oh, Rosevalley, no, no, no!! I'm so sorry the Abraxance is not working. I hope your doctor has another plan for you. Sending so many prayers and strength for you. Madelyn",
      "MessageIndex": 1180,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 22, 2016 04:44AM Mominator wrote:  Rose, I'm laughing over your dog's reaction \"I didn't even touch it.\" Louis, your possum is like the big snake that Harry Potter accidentally released from the zoo: the snake says \"Thankssssssssssss\" as he slithers away. Yes, you were played, and played well. There is a possum who has been visiting our back yard several times in the last few weeks. S'more barks like crazy every time. I was half tempted to let S'more outside to scare it away forever. But would that work? Probably not. I'm much more afraid that S'more might get bit by it. So in he stays, to bark and bark. ",
      "MessageIndex": 1563,
      "PostDate": "22/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 29, 2016 12:39AM Mominator wrote: Rosevalley, yes, plant your bulbs. I love Louis' suggestion of the beautiful flowering or fruit producing tree. Rose, you have had a roller coaster this past year. And yet, you're still here, and you voted! You have exceeded each goal. We don't know what the future holds, but you are here today. I hope your doctor reconsiders your chemo breaks and develops another plan. I'm hoping for another Christmas season for you, which you can enjoy this time, and many more milestones. Much love, Madelyn",
      "MessageIndex": 1590,
      "PostDate": "29/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 1, 2016 05:25AM Mominator wrote: Rose, I'm so sorry for the loss of your beloved Percy Cat. Thank you, Percy Cat, for taking such good care of Rose during these last 16 years. I hope you are making friends now with Ruth's Oreo, and my Boots, and many other furry friends.",
      "MessageIndex": 1721,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 27, 2016 10:20PM Mominator wrote: What a wonderful Christmas, Rosevalley! Time with your family and feeling pretty good. I'm sorry that even the small tastes don't stay down, but I'm glad that you feel better when it's done. Like our dear Stephanie, you keep outliving predicted demises. It seems like a stalemate with cancer, but as long as you keep moving, you are winning. Here's to many more great days with your family. Loving kindness to you. ❤️️",
      "MessageIndex": 1810,
      "PostDate": "27/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 7, 2017 07:37AM Mominator wrote: Rose, thank you for sharing yourself and your family. It's been such a roller coaster ride for you this past year. Hoping that the good memories outshine the rest. Sending you so much love ❤️ and best wishes and prayers for comfort and peace. (((gentle hugs))) Madelyn",
      "MessageIndex": 1850,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 12, 2017 03:24PM Mominator wrote: Rose, thinking of you. Hoping you are getting relief from the N/V. It's a beautiful day here, sunny, clear skies and puffy clouds, 68 degrees. It feels like Spring, full of possibilities. Sending all this positive energy to you, with much light and lovingkindness. Madelyn",
      "MessageIndex": 1876,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 1, 2016 09:49AM Mominator wrote: Happy Anniversary dearest Rosevalley! Wishing you and your DH a very lovely day together! I hope the faslodex continues to work for a very, very long time and you may enjoy many more wonderful days.",
      "MessageIndex": 657,
      "PostDate": "01/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 29, 2016 06:22AM Mominator wrote: Sarahalizabeth (wasn't sure if that's a typo): it is possible that the weird red patchy spot is a reaction to the ice packs and/or maybe the biopsy incision is draining to that area. Call your doctor's office with any concerns, but do try to relax during this waiting time. I know that's hard. Agreeing that with your family history, genetic counseling and probably genetic testing will help you understand your cancer risks, and possibly influence treatment options. Worry does not empty tomorrow of its sorrow; it empties today of its strength. - Corrie ten Boom Best wishes to you, Mominator",
      "MessageIndex": 17,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/847252",
      "Title": "25years old- biopsy in the morning. Sarahalizabeth Sarahalizabeth"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 28, 2016 12:10PM Mominator wrote: Sending prayers, positive thoughts, and all best wishes that the Abraxane works wonders for you and does not cause an allergic reaction. Here's a little friend from my walk. There were at least 4 bunnies in the one mile walk around my neighborhood this evening. This little bunny let me get so close.  Lots of love, Madelyn",
      "MessageIndex": 1067,
      "PostDate": "28/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 5, 2016 08:10AM - edited Jul 5, 2016 09:30AM by Mominator We had a few of your neighbor's noisy relatives here as well. Every year going out of state to buy illegal fireworks and setting them off all through the Independence Day weekend, also on New Year's Eve. One New Year's Eve he set off some fireworks. One hit my bedroom window and landed on the roof of my porch. It smoldered there for a few moments before it rolled off into the snow. I was seriously tempted to call the police. But that would have meant putting on daytime clothes, coats and boots (vs my warm pjs) and going outside and having to deal with the idiots at one in the morning. We were so happy when the noisy neighbors moved away!! I hope you are able to see the results of your flower seeding. Reminds me of a book we had. The character seeded all over the countryside.",
      "MessageIndex": 1107,
      "PostDate": "05/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 14, 2016 11:04AM Mominator wrote: Rosevalley, I'm so sorry this treatment isn't working. I'm so sorry you had a tough night with reflux and heartburn. I hope and pray the next treatment is effective for a long time, and that you're able to enjoy the rest of the summer with DD3. Holding you close in my heart; sending light and love and prayers your way. Madelyn ",
      "MessageIndex": 1159,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 20, 2016 06:33AM Mominator wrote: Gentle hugs (((Rosevalley))) . I'm sorry that the TMs are up and the N/V is back. I hope you get relief soon. Are the weeks on Gemzar better? Keeping you in my thoughts and prayers.",
      "MessageIndex": 1310,
      "PostDate": "20/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 18, 2016 11:49PM Mominator wrote: Rose, so much good advice above, especially JWoo's really resonates with me. I know it's hard to leave your children. I know my children would be devastated if I left without letting them know my plans and giving them a chance to say goodbye. But it's also scary to face the suffering you went through last year. Maybe you could discuss with your MO how to take your DWD meds if the n/v comes back? Perhaps MO may have a few options for you. Rose, thinking of you, and sending loving kindness, and gentle peace to you. Madelyn",
      "MessageIndex": 1660,
      "PostDate": "18/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 3, 2016 10:03PM - edited Dec 3, 2016 10:05PM by Mominator Hoping that the Zofran, carboplatin, and boost work well together to give you a restful, peaceful weekend. What kind of service dog was Banner and how did he help DD1? Does DD have another service dog now? Sending light and love ❤️ for a wonderful weekend. ",
      "MessageIndex": 1728,
      "PostDate": "03/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Dec 15, 2016 05:38AM Mominator wrote:  My great-grandmother was Delia (my mother always pronounces it with the accent on the first syllable: Deal-ee-yah). Apparently Delia hated that name and called her only child Doris. That would have been about 100 years ago, as my mother recently turned 80. My great-aunt, Doris' sister-in-law, was Gladys. I recently met another Gladys at our ENT's office. She goes by Gladdy. On the other side, my grandmother was named Vera, and she loved pansies and geraniums. ",
      "MessageIndex": 1770,
      "PostDate": "15/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 29, 2016 06:29AM Mominator wrote: Welcome RockingT! It sounds like you have been hanging around for a while. I hope you post more often so we can get to know you.",
      "MessageIndex": 18,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/847252",
      "Title": "25years old- biopsy in the morning. Sarahalizabeth Sarahalizabeth"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 1, 2016 11:59AM Mominator wrote: Hello Rosevalley, The swans were back today on Spring Lake, looking so beautiful in the afternoon sun.  Sending love and light and beauty to you on your anniversary. Madelyn",
      "MessageIndex": 658,
      "PostDate": "01/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 8, 2016 10:05PM - edited Apr 9, 2016 07:48AM by Mominator Dear Rosevalley: I'm so excited for your dropping TMs, and goodbye to nasty N/V. I hope the faslodex continues to work wonders for you and may you continue to explore new territory from your body's response to it. May all be happy and free from suffering. Mominator ",
      "MessageIndex": 698,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 24, 2017 12:18PM Mominator wrote:  Dear Kirk, Anna, Audrey and Amy, So very sorry for the loss of dear Cindi. She was a special mom who fought hard to take care of her daughters. I was so happy that she was feeling better for Christmas this year. May those happy memories sustain you during this difficult time. Holding you close in my thoughts and prayers, Madelyn ",
      "MessageIndex": 2002,
      "PostDate": "24/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 29, 2017 11:00AM Mominator wrote: Hi Kandy, thinking of you. Did your insurance approve the Carboplatin, and have you started it yet? Wishing for gentle and effective treatment. Did you get some grandbaby therapy? All my best wishes, Madelyn",
      "MessageIndex": 208,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 10, 2017 10:47PM Mominator wrote: Kandy, thinking of you, keeping you in my thoughts and prayers. Glad you are enjoying some Harper time. Love, Madelyn",
      "MessageIndex": 311,
      "PostDate": "10/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 18, 2017 01:15PM Mominator wrote: Kandy, hoping your team has a new plan for you. I got a beautiful image from a typo: you wrote \"That is why they heavily premeditate\" (instead of medicate) and now I am picturing your team putting you in a quiet room with rugs on the floor, candles and incense burning, quiet music playing, and people chanting. Rpool: you have not failed 4 treatments, rather, 4 treatments have failed you. Wishing you the best on Carbo. Lita: Looks like you saved us some room on your cozy bench by the roaring fire.",
      "MessageIndex": 388,
      "PostDate": "18/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 16, 2018 04:32PM Mominator wrote: Kandy, sending love and prayers. I know you have a lot of spirit and fight in you. You are being worn down by the pain.  Can MO address the pain while you take a breather from current treatments? It seems there may be some options still for you.  Wishing you all the best, including lots of Harper time.  Lots of love, Madelyn ",
      "MessageIndex": 1071,
      "PostDate": "16/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 18, 2018 10:19AM Mominator wrote: TarheelMichelle /Ronda: thanks so much for all you do for our Kandy. Please stay safe. Sending love, peace, and strength to Kandy. Suggested wording for the flowers: \"From all your friends at BCO\"",
      "MessageIndex": 1092,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 18, 2018 02:24PM Mominator wrote: TarheelMichelle /Ronda: thank you for reaching out to Hal and keeping us informed. Kandy was such a dear lady, a fighter. And yet, she felt it was coming 1 year 1 week ago; continuing through her struggles this past month. She tried so hard for herself and her family, taking care of her disabled child. And how she loved her Harper time!  Sending love, peace, and strength to Kandy's husband and family. Many (((HUGS))) to the BCO family she leaves behind.  ",
      "MessageIndex": 1105,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 24, 2018 04:22PM Mominator wrote: Thank you, Ronda, for representing our online community to Kandy's family. I understand how hard it was, and thank you even more.  I don't think you are being disrespectful to her memory by sharing details from the visitation. The visitation is a public event. What people share with you is part of the grieving process, yours and theirs. I am glad to hear our online community gave her strength, since she had given so much strength to all of us. Many folks are opting for closed caskets. We had a closed casket for our beloved Nana's funeral. We did have a private open viewing for just family.   Thank you, Ronda ",
      "MessageIndex": 1165,
      "PostDate": "24/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Sep 26, 2018 04:04AM Mominator wrote: Emmeline, You have been worried for a while and I hope we can reassure you.  I've looked over your other posts.  It looks like your joint pain came first, for a year or more. That could be many things, fatigue, fibromyalgia, etc. The electric shock pain and pulling pain in your right breast for a couple of months: could be trapped nerves, pinched nerves, a pulled muscle.  Lumpy breast and tender before your period may be caused by your period.  A dried up substance in both nipples, like the sleep you find in your eyes: sometimes dirt or dried up sweat gets trapped in the nipples. Here's more from WebMD https://www.webmd.com/women/guide/breast-nipple-discharge#1   I think two GPs, a breast nurse and a clear mammo, if not enough to reassure you, are perhaps a good start. You may have other things going on, as I listed above. Perhaps an appointment with your PCP to discuss your symptoms may be reassuring.  Best wishes. Let us know how you do.  ",
      "MessageIndex": 1,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867417",
      "Title": "Had mammo today but still worried Emmeline Emmeline"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Sep 26, 2018 09:28PM Mominator wrote: Thank you, Erinashley for an excellent description of the cysts. That sounds a lot like what Emmeline is describing in the other posts. I never had cysts so I'm no help there. ",
      "MessageIndex": 4,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867417",
      "Title": "Had mammo today but still worried Emmeline Emmeline"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 6, 2016 11:21AM Mominator wrote: Rosevalley, did DD3 and DH get to church? I'm so sorry that the N/V continues. I offer you some of my roses made of yarn.  Here's a \"floral arrangement\" of the roses completed so far:  Sending love and roses to you. Madelyn",
      "MessageIndex": 898,
      "PostDate": "06/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 25, 2016 12:46AM Mominator wrote: Thinking of you, and hoping today's infusion will give you needed relief and added time to be with your dear daughter. The yarn garden is blooming.  May you flourish and bloom as well this summer. Sending you much love and light and lovingkindness. Madelyn.",
      "MessageIndex": 1037,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 26, 2016 08:33PM Mominator wrote: Oh Rose, I'm so sorry for the loss of your DH's dear sister. My heart is breaking for you and him. Did your DDs spend a lot of time with their Auntie? I'm so sorry for their loss as well. Life is uncertain indeed.",
      "MessageIndex": 1351,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Sep 22, 2016 05:58AM - edited Sep 22, 2016 05:58AM by Mominator Happy Birthday, Rose! I'm so glad for another milestone for you. I hope you continue to do well so you can vote and finish your Christmas shopping. Then you can have lovely Christmas and New Year's celebrations, to make up for last year. After that, maybe some more goals. Many blessings to you, Madelyn",
      "MessageIndex": 1476,
      "PostDate": "22/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Sep 22, 2016 06:03AM Mominator wrote: I finished the rose afghan over the weekend. ",
      "MessageIndex": 1477,
      "PostDate": "22/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 22, 2016 05:36AM Mominator wrote: Just checking, have you ever had a bone density text? Due to several risk factors, I had a bone density test after I finished nursing my second child. My density was very low: I had osteopenia, and was heading towards osteoporosis. We were about to start treatment when I had a surprise pregnancy. After I finished nursing my third child, we tested my density again, and I was just on the edge of osteoporosis. So we knew it was the pregnancies and nursing that depleted my bones. We treated with calcium/vitamin D supplements, weight bearing exercises, and medication. While I was still in treatment, my son accidentally broke my hand. I wonder since you are mom to 6 littles, if your bones were possibly depleted doing the many pregnancies and possible nursing of your six children. It is certainly worth consideration. Wishing you all the best, Madelyn",
      "MessageIndex": 2,
      "PostDate": "22/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849205",
      "Title": "Broken Rib, oncologist wants appointment Momof6littles Momof6littles"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 6, 2016 09:49PM Mominator wrote: Sending some love and (((gentle hugs))) your way. I will hold you up in prayer and song during Mass tomorrow (I sing in the choir). St. Augustine of Hippo is often quoted as having said \"He who sings, prays twice.\"   Wishing you a restful night and a peaceful day. Mominator ",
      "MessageIndex": 294,
      "PostDate": "06/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 27, 2016 09:13PM Mominator wrote: Rose, your Easter dinner sounds just perfect. Everyone's favorite foods. How wonderful you found a church for DD3. I'm glad she's connecting with a community. And so nice that DD2 was able to spend the day with you. And the most wonderful thing of all: your resurrection! Happy Easter to you and your family. 😍",
      "MessageIndex": 640,
      "PostDate": "27/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 11, 2018 09:18PM Mominator wrote:  Hello Kzcat2000 I didn't know your mother, I joined 2015. However, just click on anyone's user name. You will be taken to a page that contains the person's most recent posts. You'll be able to tell by the dates if any of them are still posting here at BCO. For example, everyminute last posted on Stage III Cancer Survivors .... 10+ Years and Out 10 years today! Had some delay…on Jun 5, 2018, while mthomp2020 last posted on Reesie I'm so sorry to hear this... on Aug 14, 2012. If you want to connect with them, go to a conversation that is active. It looks like no one is following this thread right now.  You can also go to the In memoriam thread to see a list of members and the date of their passing. You can do a find from your browser to look up at name. https://community.breastcancer.org/forum/56/topics/694012?page=33#idx_988 I hope you are able to reconnection with some of your Mom's friends. Best wishes, Mominator  ",
      "MessageIndex": 30,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760915",
      "Title": "EAD - Liz everyminute Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 22, 2016 05:09AM Mominator wrote: Hello Momof6littles, sending big, gentle HUGS your way. I've been following your journey through the High Risk forum. I hope this is your surgeon and oncologist both being extra careful and thorough. Holding your hand and keeping you close in my thoughts and prayers. Mominator / Madelyn ",
      "MessageIndex": 1,
      "PostDate": "22/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849205",
      "Title": "Broken Rib, oncologist wants appointment Momof6littles Momof6littles"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 15, 2017 06:55AM Mominator wrote: GrammaSue: mine was an MRI guided biopsy, lying on my stomach with my breasts hanging through openings in the table. It's easier to lie still if you're comfortable. I had them adjust the pads a few times until I felt comfortable enough to stay in that position. It's worth the time you take to get comfortable as you may be there 30-60 minutes on the table. The numbing was just a little pinch and it didn't sting. After that was just weird pressure when they got the sample. Then they put in a marker and took another MRI. Your biopsy will probably be by mammo rather than MRI, since they usually use the same imaging technique as found the mass. However, the rest will probably be similar to what we've all described. Many prayers for benign results. ",
      "MessageIndex": 4,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851866",
      "Title": "BIRADS 5; going for biopsy on Monday GrammaSue ml143333"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Sep 25, 2018 01:26PM Mominator wrote: Buddy_Banjo, Poodles and Georgia gave you lots of good advice.  You may have mastitis, an inflammation or infection of your breasts. The pearls you feel may be the swollen lobes (where milk is produced).  I agree, BCPs may have triggered this. My SIL had a milky discharge from her nipples after starting BCPs.  Best wishes. Let us know. ",
      "MessageIndex": 3,
      "PostDate": "25/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867370",
      "Title": "18 breasts full of lumps Buddy_Banjo Mominator"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 27, 2017 11:12AM Mominator wrote: What a wonderful picture of two very lovely  ladies! I'm so happy that TarheelMichelle and you were able to get together. It's nice to see you both. Kandy, this is the second time I've seen a picture of you without your sunglasses. The other time was a picture of you with Harper. I hope your new treatments will kick that cancer to the curb and give you many, many years with dear Harper. Sending many prayers to all and holding you all in lovingkindness.",
      "MessageIndex": 103,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 6, 2017 09:05PM Mominator wrote: Kandy, I just wanted to drop by and let you know that I'm keeping you close in my thoughts and prayers. Also, I break into a big smile every time I scrolled by the photo of you and Michelle!! Madelyn",
      "MessageIndex": 126,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 18, 2017 11:15AM - edited Apr 18, 2017 09:52PM by Mominator  Kandy, I'm sorry that things are going downhill some more right now, and I'm praying that they will turn around soon. I know it may be scary to think that you won't be around for Krista. But with or without a Stage IV diagnosis, we parents of disabled children need to plan for the days when we won't be around to care for our children. I have a disabled son, and we have gone through a big transition this year as he turned 21. I would be happy to share my experiences with you, such as Legal Guardianship, Social Security (SSI), Special Needs Trust, Department of Developmental Disabilities (DDD), and Group Housing if you would like. Thinking of you, and keeping you, Krista, and your family in my prayers. Love, Madelyn Edited to add: not that I don't think that you've planned for Krista, because I'm sure that you have. Only that may I help with anything that is now weighing on your mind? ",
      "MessageIndex": 258,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 30, 2017 01:30PM Mominator wrote: Kandy, I think Cathy/AnimalCrackers is right: things are going uphill quickly!!Love ❤️ your MO! JoynerL: LOL \"Attila the Mom\" nickname. My kids came up with Mominator because I fixed things. It is the opposite of Dr. Doffenschmerch from Disney's Phineas and Ferb, who kept making evil devices that all ended in --inator.",
      "MessageIndex": 416,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 19, 2017 09:53PM Mominator wrote: Lovely photo of two lovely ladies. I'm so glad you got some pool time together.",
      "MessageIndex": 494,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 4, 2017 08:53AM Mominator wrote: Sending hugs and prayers to (((Kandy))) and (((Lita))) and all the ladies here on bco",
      "MessageIndex": 733,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jan 22, 2018 10:16AM Mominator wrote: TarheelMichelle / Ronda Thank you for going to Kandie's visitation. You will be surrounded by our love and support even as you give our love and support to the family. I will be holding you and Kandie especially close in my thoughts and prayers this evening.  Mominator / Madelyn  ",
      "MessageIndex": 1150,
      "PostDate": "22/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 22, 2017 09:58PM Mominator wrote: Big (((HUGS))) Kandy. I'm sorry for the mixed results, but glad that your MO has a new plan. Here's a third vote for \"gentle and effective\" results. Now, go get yourself some grandbaby therapy. That's the best treatment. Love, Madelyn",
      "MessageIndex": 197,
      "PostDate": "22/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 6, 2017 06:23PM Mominator wrote: Kandy, hoping that the chemo is working: tough on the tumors and gentle on you this week. Wishing you a lovely weekend with the family. love, Madelyn",
      "MessageIndex": 296,
      "PostDate": "06/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 27, 2017 09:13AM Mominator wrote: Kandy, Wishing you a lovely weekend with lots and lots of Harper time. Love, Madelyn",
      "MessageIndex": 344,
      "PostDate": "27/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 6, 2017 04:10PM Mominator wrote: Thinking of you Kandy and hoping the transfusion will give you a boost. Are you getting your Harper time? Love, Madelyn",
      "MessageIndex": 358,
      "PostDate": "06/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 26, 2017 09:19PM Mominator wrote: Wishing you a  very Happy Anniversary and many more to come!! You two look perfect together.",
      "MessageIndex": 499,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Aug 5, 2017 09:57PM Mominator wrote:  Kandy, lifting you up with prayer now and always, including when I play flute at Mass tomorrow. I am sorry for all the downturns. I'm so happy you got a visit from TarheelMichelle. I'm glad you're home. Hugs and prayers ",
      "MessageIndex": 575,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 9, 2017 09:55AM Mominator wrote: Kandy, lifting you up in prayer.  Glad you're a little better. Praying for continued improvement.  Madelyn ",
      "MessageIndex": 763,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 25, 2016 09:15AM - edited May 25, 2016 09:16AM by Mominator In discussing whether to be with our husbands when we pass, here's the Facebook post from my friend's husband: \"Lori passed away...in the early morning hours of Wednesday May 25th. Surrounded by myself and our six children, Lori allowed us time to all say goodbye with words, hugs, prayers and kisses, before being swept up into the loving arms of God.\"",
      "MessageIndex": 101,
      "PostDate": "25/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 15, 2017 08:46PM Mominator wrote: Nan and Freya, also Jennifer and Paula, is it OK if I stay with you while you go through this? I mentioned on the previous page, I've been involved in hospice three times. I've seen loved one change, slow down, and eventually pass away. It's different for everyone, and yet some parts are the same. Hospice was wonderful, and have a lot of resources. I think an open communication with one's doctor also helps. What can I expect in my situation? What are the pros/cons of this treatment? What can we do to alleviate these symptoms? Nana was almost 97 and her kidneys were failing. However her heart was already failing first. The doctors in the hospital were so quick to prescribe some things, without looking at the whole picture. One doctor even insisted that we put Nana on dialysis. Her PCP was so good. He wanted to know, \"what can I do for Nana? What do you want for Nana?\" We said that we wanted her to be comfortable, to enjoy her great-grandchildren while she could, and have a peaceful end. And she did.   If you have a worry or concern, ask your doctor. Wishing you peace and comfort, and all the best, especially in these difficult circumstances, Madelyn ",
      "MessageIndex": 164,
      "PostDate": "15/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 4, 2016 07:10AM Mominator wrote: Thinking of you, Maureen, and hoping each day brings you comfort and peace. Sending prayers and peaceful thoughts your way.",
      "MessageIndex": 175,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/840520",
      "Title": "I'm in shock Maureen813"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 15, 2016 08:18AM Mominator wrote: Happy for you, ddw! I also had the same question: did you just have a MRI, and are having a mammo in November, or are you having Mammograms every 6 months? My concern is that mammos every 6 months is a lot of x-rays. An MRI doesn't have x-rays, plus it is a different \"point of view\" while still being excellent surveillance. Best wishes for clear scans!",
      "MessageIndex": 3,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/845196",
      "Title": "Happy News Ddw79 Ddw79"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 17, 2016 04:16PM - edited May 17, 2016 07:03PM by Mominator Blainejennifer, you want to know, how does it go? For the family and friends that I've been with in hospice, after all possible therapies failed them, it has been a gradual decline of the body, managed pain, and passing in their sleep. For our beloved Nana (hubby's grandmother), she was slowly dying of Congestive Heart Failure, and her kidneys were failing because of it. She started hospice late January and they helped with her medications and supplies. She became more tired each week. She was moderately alert on Easter Sunday. By Tuesday, she wanted to go back to bed early. On Wednesday, she didn't want to get out of bed. She slept most of Thursday, Friday, and Saturday. Saturday early evening her breathing became irregular, and she stopped breathing Saturday around 9:00 pm. For my friend Ann Marie, the pain from mouth/throat cancer was more severe. She was doing well in August, holding court in her home. She started hospice in September. Many medications were tried, but the pain could not be controlled. She decided on palliative sedation. She slept through the last week of her life. (Edited to add: She died October 5.) Palliative sedation is a controversial choice in some circles. I am not recommending it for anyone unless they have severe, uncontrolled pain. For my friend Lori, she is nearing the end of mbc. She has extensive mets to brain and spine. She has lost her sight and her speech. She no longer actively eats or drinks. She had been given food and water by others, but that is declining as well. (Edited to add: last Tuesday I helped her drink two cups of water, but Wednesday she didn't want any water. I don't know if hubby is still able to feed her this week.) She has lost a lot of weight. She doesn't seem to be in pain unless her Husband tries to move her. Today she opened her eyes several times while I was with her. I'm not sure if she understood when I spoke or sang to her. Once her lips seem to move, but no words came. For you, Blainejennifer, hospice will guide you through the process, helping you with pain, and managing your symptoms. It sounds like you want to be more prepared than your parents were. An excellent blog is that of Sherri Fillipo, (thank you Stephanie for introducing her to me) who recently passed http://www.sherrifillipo.com/  A former nurse, Sherri describes \"living and dying with metastatic breast cancer\" with elegance, and she describes the many services of her hospice. I wish you the very best on your journey. I will provide updates on Lori if you wish, or you may look over my threads on my friend: community.breastcancer.org/for...  Mominator ",
      "MessageIndex": 78,
      "PostDate": "17/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 19, 2016 04:54AM Mominator wrote: DivineMrsM, I just realized that I was so focused on the funeral service (which means a lot to me as a musician but of course not to you), I didn't fully appreciate how much you've done. Please forgive me. Wow, cemetery plot, cremation, a will, living will and health care power of attorney, even your obituary, that is a lot of planning! That planning is such a blessing to your family. My parents are both in their 80's, in poor health, and are not planning. They have wills, and are each other's medical and financial POA's. That's all. We the children have tried to get them to add a back up person(s) to the financial and health POA's, and our parents refuse to discuss it. They have not done cemetery plots, casket, certainly not their own obituaries. My father \"doesn't want to talk about that stuff\" and my mother doesn't want to argue with dad, nor make a decision without him. I tried to point out that after one of them becomes incapacitated, the other will be making all the decisions alone, and most likely in a very stressful situation. And if both of them become incapacitated, such as a car accident, we will be making decisions without their guidance. My siblings and I are very frustrated. Thank you for sharing.",
      "MessageIndex": 86,
      "PostDate": "19/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 20, 2016 07:37AM Mominator wrote:  For my friend Ann Marie, her husband was with her, and 3 adult children were staying in the house, plus her siblings and us friends were constantly visiting throughout her last month. Her husband and children, and possibly a sister or two, were with her when she passed.  For my friend Lori, she is getting close to the end. Her husband is keeping the family going right now: taking the 6 kids back and forth to school and events, and he's also working mornings at the business he owns. Another friend and I take turns staying with Lori while husband is working. Husband told me weeks ago to call him first \"if anything happens.\" Husband expects that he will be present when she passes. Rhonda, considering your martial bliss, I expect your husband will want to be with you right up to and including the end, \"in sickness and in health, until death do us part.\" Perhaps now would be a good time to have a discussion of your wishes and fears, and ask him if he would be with you. ",
      "MessageIndex": 91,
      "PostDate": "20/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 28, 2016 10:29PM Mominator wrote: Thank you, you've all been so kind. Mostly, I wanted to contribute to Jennifer's question on how we die, having watched my friend Lori die these last several months. I remember one of Nana's hospice nurses saying that \"we all die the same, and yet it's different, and still it's the same.\" As contrary as that sounds, there are many things that are the same as people die: the body breaks down, organs fail, certain symptoms are the same. There are some variations: not everyone will experience the same symptoms. When the end gets closer, certain other symptoms occur (labored breathing, cooling of the extremities). The hospice books are very helpful in that regards; also, talking with hospice nurses and aides. When Lori's breathing got labored on Tuesday morning, it was a sign that the end was very near. I have a longer post on Lori's funeral, if you are interested. That is more along the lines of how someone will be remembered. https://community.breastcancer.org/forum/144/topics/842954?page=1#post_4724416 Mominator",
      "MessageIndex": 104,
      "PostDate": "28/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Sep 10, 2017 09:32PM Mominator wrote: As Patty, and maybe Kandy know, I'm a flutist. I played 10:30 am and 12 noon ET masses today, sending waves of music, love and peace, and healing for all. At both masses we did \"Prayer of Saint Francis.\" Thinking also of Noni, three months on hospice. ",
      "MessageIndex": 694,
      "PostDate": "10/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Nov 27, 2017 06:09AM Mominator wrote: Thinking of you, Kandy, and holding you close in my prayers.  Hoping you enjoyed your Thanksgiving weekend and had lots of Harper time. Madelyn ",
      "MessageIndex": 897,
      "PostDate": "27/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Feb 10, 2016 02:18PM Mominator wrote: Maureen, God bless your girlfriend! You have so many questions, yes, a second opinion makes sense. My Mom was overwhelmed with questions and Dad was really pushing for more treatments. A second opinion really clarified the options for Mom. I wish I had thought of it for you. Thinking of you and holding you in my prayers. Love, Mominator.",
      "MessageIndex": 129,
      "PostDate": "10/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/840520",
      "Title": "I'm in shock Maureen813"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 5, 2017 08:47PM Mominator wrote:  Kandy, and your dear Krista, and Lita, and Patty: I'm keeping you all in my prayers these days. As we enter into Holy Week, I will offer my music up as extra prayers for you. ",
      "MessageIndex": 235,
      "PostDate": "05/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jul 4, 2017 03:54PM Mominator wrote: Oh Kandy, I'm so sorry for the set-back. Sending you lots of prayers and get better vibes.",
      "MessageIndex": 425,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 11, 2017 05:07PM Mominator wrote: Kandy, adding my voice to the chorus of prayers on your behalf. Hoping you are home and comfortable by now.  Love, Madelyn ",
      "MessageIndex": 788,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Oct 24, 2016 08:32AM Mominator wrote:  Jennifer, maybe another way of looking at your question would be to look at what choices are available to you? Without knowing your exact town, I was able to find HPCANY - Hospice and Palliative Care Association New York (check out www.hpcanys.org and www.hpcanys.org/find-care) which seems to service upstate NY. You can then search for your zip code or county.  Also, I suggest you can ask you MO for recommendations. Ask your MO about your anticipated medical needs and cleanliness needs. Ask about coverage of pain in the home vs a hospice center setting. Your MO should know what's available in your area and what your anticipated needs will be based on your disease progression. After that, I'd suggest touring a few facilities. You may find facilities you definitely do or don't want to go to them. Ask the hospice providers what would be provided in a facility vs in home. In addition to nurses and aides, many hospice programs also have volunteers who provide added coverage. I've been involved in hospice three times: for hubby's grandmother, and for two close friends. Nana was already in an assisted living facility. Hospice came in and added whatever care the assisted living didn't. Both friends chose hospice at home. Ann had two adult daughters who tended to most of the care. Lori had a husband and a few of us close friends who cared for her, plus hospice services were added in the last two months. Wishing you all the best, Madelyn ",
      "MessageIndex": 149,
      "PostDate": "24/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 27, 2018 08:16PM Mominator wrote: Hello Mags, and thank you for your kind words.  You may not have a lot of warning or time to prepare, and you're too sick and weak to do any physical preparation, but maybe there are some things you may want to do. Are all your financial documents and estate planning in order? Have you planned your final arrangements? Are there some sentimental items you wish to give to family or friends? Are there some things you wish you could do if you were feeling stronger? Perhaps you could get some things done with some help. Maybe family or friends could help you? Maybe there are some resources available (volunteers from high school or church or cancer centers)? Here are some thoughts from the person left behind. I really miss my Mom. I wish I had something tangible of hers, such as a piece of jewelry, that I could wear. We, (my siblings and I), were really concerned about Mom and Dad's health issues over the last several years. Our focus was taking care of both of them, as they were in and out of hospitals and rehab facilities. Mom and Dad were both in denial of the seriousness of their health issues. Mom and Dad were both paranoid about  \"stealing our money\" or \"sticking us in a nursing home\" if we could, plus Mom had dementia, which she and Dad hid from us.  I wish my parents were open and honest with us, and allowed us to help them more. My parents were unprepared every step of the way. We had asked my parents several times to get their financial documents, estate planning, and final arrangements in order. They didn't do anything except just basic wills. Their POA's and Medical Proxies were just for each other, without a secondary person. I tried to explain to my mother that the surviving person will be forced to make funeral arrangements for their late spouse, rather than discussing it together. Exactly that happened, as Mom was already on hospice (and her dementia prevented her from making decisions) when Dad and my siblings made the basic funeral arrangements. After Mom died, my siblings wrote the obituary, and I arranged the funeral music and readings. Our overriding question was always, \"What would Mom have wanted?\" Maybe other families are more prepared. I makes me sad that my parents didn't prepare, not let us help them prepare. ",
      "MessageIndex": 187,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 16, 2017 10:51PM Mominator wrote: Thinking of you, Kandy. I hope you are enjoying some baby therapy with Harper. Enjoy your wig. I didn't know it at first, but I knew a lady with Alopecia. She always wore a wig, but it looked natural. She was my favorite cashier at A&P. I didn't know she had Alopecia until I saw her at the Zombie walk without her wig. She made a great Zombie. She's doing great, but she moved away.",
      "MessageIndex": 177,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 3, 2017 09:18PM Mominator wrote: Zills, I was thinking the same thing. Sassy visited our surgical thread with this information. Kandy, Patty, and anyone considering surgery, this is worth a look. TORADOL (ketorolac) linked to Recurrence Prevention Here is a link to the beginning (I hope) of the Toridol/Ketorolac  thread https://community.breastcancer.org/forum/73/topics/833612 the first video alone is amazing: https://www.youtube.com/watch?v=H8zVrYEW8vE Best wishes to you if/when you decide for more surgery. Love, Madelyn",
      "MessageIndex": 291,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 22, 2017 09:37PM Mominator wrote: Hip, hip, hooray! Happy dancing! Continued prayers and peace, love, Madelyn",
      "MessageIndex": 322,
      "PostDate": "22/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Jun 13, 2017 08:54PM Mominator wrote: Oh noooooooooooooooooooo! Hoping your MO can tweak the pre-meds to prevent the reaction. Sending lots of prayers.",
      "MessageIndex": 373,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "May 18, 2016 10:13PM Mominator wrote: DivineMrsM, thank you for your kind words. It's nice to meet you officially. I've seen you on some other threads, but we've not had a chance to talk to each other. I like your most recent photo, really lovely. Although the funeral or memorial service is for the family, you may want to plan it with your family now. Nana did not pre-plan her funeral mass, and we were scrambling to get the details that would honor her choices and favorites. We wracked our brains trying to remember favorite songs and passages from the scriptures. Fortunately, the rest (casket, plot, engraving on the headstone, etc.) were already done. Ann Marie did pre-plan her funeral right down to the songs and scriptures. She was a cantor and choir member. I played flute for her funeral. Barbe, your experiences of less than a week in hospice are similar to many others. Most people wait until the very end before they use hospice. Hospice is available for those whose conditions are expected to be terminal in six months or less. Blainejennifer, I suggest you ask your doctor to let you know when to call hospice. \"Hospice is special because it concentrates on care, not cure. It enables people with a terminal illness to make decisions about how and where they want to spend the rest of their lives. Hospice Care treats the whole patient. The family is viewed as part of the unit of care. It emphasizes pain control and living life fully.\" from https://hospicecarecorp.org/frequently-asked-quest... Still, I hope you have a while before you need hospice. Mominator",
      "MessageIndex": 84,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Apr 7, 2018 09:18PM Mominator wrote: I realize that this thread has been inactive for more than a year. A lot has happened. We've lost so many wonderful people in that time. I lost my Mom.  I wanted to share this video as it does explain well what happens when we die.   Dr. Kathryn Mannix explains why we should all talk about dying. She explains the dying process (the last few days of a person's life). She describes how a patient sleeps more and more, becoming unconscious for longer and longer periods. But when the patient wakes up, they feel as if they've had a really good sleep. So we know that it doesn't feel frightening. She also explains how the breathing slows down, and the sounds a person makes towards the end. Please don't be put off by the beginning line, \"dying probably isn't as bad as you're expecting.\" She talking about the process of dying (unconsciousness, breathing slowing, gradual death), is not as painful as people expect. She's not talking about the shortening of lives and sadness from the terrible toll of cancer.  https://www.facebook.com/bbc/videos/2185162658165588/ ",
      "MessageIndex": 183,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Mominator",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223426/profile",
      "Content": "Mar 18, 2017 09:53PM Mominator wrote: Nan, have you read any of end of life/hospice materials? Lack of appetite is common in terminal illness. People don't intentionally fast, but they do lose their appetites as their bodies slow down. The digestive system no long works properly: food isn't completely digested and/or blockages may occur. It becomes uncomfortable to eat and people stop eating. http://www.arborhospice.org/we-can-help/nutrition This happened with my friend Lori. It was distressing to watch her husband feed her, as she had no appetite and he was forcing the food into her mouth some mornings. (Husband really didn't take the time to read the hospice information. It just sat in a folder on the counter.) Unfortunately, most terminal patients have anorexia, which a loss of appetite and most develop cachexia, which is the loss of weight. Cachexia cannot be reversed nutritionally; even if the number of calories consumed increased, the terminally ill person will continue to lose weight. Her husband seem to feel that if he could keep feeding her, he could keep her with him longer. Nana and Ann also lost their appetites. The difference was that no one was force-feeding them. Anorexia/loss of appetite is the body's way to keep itself comfortable as the digestive systems slow down.",
      "MessageIndex": 174,
      "PostDate": "18/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    }
  ]
}