{
  "AuthorID": "MOMiloveyou…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131943/profile",
  "Posts": [
    {
      "AuthorID": "MOMiloveyou…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131943/profile",
      "Content": "Dec 1, 2011 06:46PM MOMiloveyou wrote: Dear 1Athena1, You should go back and read Sido's post. Sido never says this person is looking for suggestions on how to \"save a life\" or \"cause\" someone not to get advanced cancer.  According to Sido's post, this person asked for suggestions and insight based on her experience on what she did wrong or missed. It sounded like this person was seeking out wisdom that she could use for her benefit in order to not repeat possible mistakes made in her treatment.   Furthermore, you state that I had an \"assumption that your (my) mother's experience can help you (someone) to knowingly prevent it\"...I never even said anything about prevention of cancer.  I was referring to the prevention of making a mistake in cancer treatment which could benefit someone else. If someone asked me about mistakes we made in my mom's cancer treatment...I would be more than happy to share. If it gives someone another additional minute to live, it's worth the advice. I would do anything to have another minute with my mom. I respectfully, absolutely disagree about your comment about hope. I know for a fact that hope, positive thinking and optimism played a large part in my mom's 5 year survival after being diagnosed with stage 4 breast cancer. Here is one of thousands of links discussing the power of hope and positive thinking http://www.mayoclinic.com/health/positive-thinking/SR00009 . I wish everyone here all the best, all the strength and all the courage to fight this horrible disease.",
      "MessageIndex": 28,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778654",
      "Title": "People are un-freaking believe-able... Sido PizzaDad"
    },
    {
      "AuthorID": "MOMiloveyou…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131943/profile",
      "Content": "Dec 1, 2011 01:50PM MOMiloveyou wrote: Hi Sido, Correct me if I am wrong...but wouldn't you want to share your wisdom, your knowledge, and your experience with someone in the hopes that it could benefit them? I'm not sure I understand why you are so upset by this. Your wisdom could save a life. My mom died of breast cancer in Feb. I take everything I have learned from that unfortunate experience (all the things about breast cancer I wish I didn't have to learn) and pass it along in hopes that my experience will benefit someone else. Wouldn't you want someone to do that for you? I hope I didn't offend you...because that is not my intention at all. Someone suggested that the person who contacted you go talk to her oncologist. No one really knows the experience better than the person themselves. I wish you and your family all the best.",
      "MessageIndex": 23,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778654",
      "Title": "People are un-freaking believe-able... Sido PizzaDad"
    }
  ]
}