{
  "AuthorID": "mommichelle…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
  "Posts": [
    {
      "AuthorID": "mommichelle",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "mommichelle wrote: All, Just finished chemo in December, on tamox for almost two months.  Over the past two weeks I have been feeling a bloating in stomach.  Kind of under my ribs.  Almost feels like I am pregnant (I am not).  Just wondering if anyone else has experienced this and if so, what is going on?  Is it a new cancer thing or is it just SE from everything? Any info would be appreciated... TCH x 6 - finished 12/2/10...herceptin till 8/11 and tamoxifen to start in the New year! Dx 6/11/2010, IDC, <1cm, Stage IA, Grade 2, 0/2 nodes, ER-/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/766046",
      "Title": "Bloating? mommichelle mommichelle"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "May 3, 2011 03:56PM mommichelle wrote: I just wanted to say that there is a VERY good chance it is nothing.  That being said, I do recommend following up on it.  I had my annual exam last May and told the Gyno that I felt something, not necessarily painful but \"bruised\" every once in a while in my breast.  He did a thorough exam and said he felt nothing, but would send me for a mammogram anyway.  He did me a huge favor!  I ended up getting an ultrasound the same day and they recommended a biopsy.  Biopsy came back as DCIS - extensive.  I had a mastectomy last June.  Pathology came back with a small area of invasion (4mm).  Finished chemo in December and now am doing herceptin for the remainder of a year.  Like I said, it is most likely pregnancy related...if you feel better having it checked, please do it for your piece of mind.  ",
      "MessageIndex": 20,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768317",
      "Title": "Question about a tender spot in breast, No lumps. kehjj04 22lifeisgood"
    },
    {
      "AuthorID": "mommichelle",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "mommichelle wrote: Good morning!  Long story short....back pain for about a week (after about two weeks of a cold and cough).  Feels like burning, pulling on the muscle on either side of my spine.  Went to the doctor, he said to take pain med high dose.  Pain went away, stopped pain med, came back, started pain med, having pain on and off.  Did an X-ray last night and got a call that there is no significant abnormalities.  Should I be happy?  At first I was so excited and then I started to think then that maybe they should have done a different type of scan.  Can they determine if there would be metastisis in the bones with an X-ray?  Any info appreciated! Michelle TCH x 6 - finished 12/2/10...herceptin till 8/11 and tamoxifen to start in the New year! Dx 6/11/2010, IDC, <1cm, Stage IA, Grade 2, 0/2 nodes, ER-/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779482",
      "Title": "Back Pain mommichelle angelsister"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 12, 2016 04:39AM mommichelle wrote: Hello everyone! I just wanted to pop onto your thread and wish you all luck. I try to do this every August because I remember (although more distantly) all the feeling and worries you have. I started my chemo August 2010. I remember wishing I saw more posts from the people who had been through it awhile ago. I know everyone says that once people are finished with treatment and start getting on with their lives after cancer, this site becomes a memory. Sadly, that is true. There are too many wonderful things in life to do! These boards kept me sane and feeling in touch with people who knew exactly how I felt. Hang in there...it is a long road, but doable. Keep your eyes on the prize and lean on each other when you need support. I know where you all are, and it gets so much better. If you haven't already checked out the Success Stories thread, do so! Whenever I felt down, I would log on and read some posts from that thread. There are pages of them! Thinking of you and wishing you success! Hugs! Michelle",
      "MessageIndex": 213,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jun 28, 2011 12:37PM - edited Jun 28, 2011 12:37PM by mommichelle Madismommy, There is a book that explains cancer like weeds in a graden, the surgery removes it (like we would pull a weed out) and the chemo, tamox, etc. is the weed killer we spread to make sure the weeds stay away.  It is comforting to know that the surgery gets it out though. Michelle",
      "MessageIndex": 5,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770895",
      "Title": "Preparing kids for hair loss & treatment Madismommy719 mks16"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jun 28, 2011 06:51AM mommichelle wrote: Madismommy, My biggest concern was with my children too.  I wanted them to trust me that I was being truthful, not scare them, but prepare them.  My kids were 3 and 5 at the time.  We sat down and told them that mommy had cancer and I was going to need to take a medicine that was so strong, it was going to knock all the hair off my head.  Their eyes got big and I said, \"Can you believe I am going to be bald?\"  They laughed when I did and then I told them that they could draw with washable markers on my head for Halloween.  They were excited!  I am hoping to be a lesson in cancer so that they will not be so afraid of the word (even though it terrifies me).  I dream they will be able to say one day that their mom is a 40 year survivor.  It would certainly change the whole idea that \"Cancer\" has to be a death sentence.  I wanted their lives to not be affected.  I look at pictures from last summer and fall when I was going through everything and they are smiling.  It makes me want to cry.  Some of the darkest days in my life, and I was able to keep them smiling.  I feel it is best to be open and honest.  Kids get scared when they feel like we are hiding things.  Obviously they do not need gory details, but let them know they can trust you.  There are some good children books too that we read to them.  I hope this helped, and I hope your conversation goes well.  Be strong and try to keep it light.  Thinking of you  :)",
      "MessageIndex": 1,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770895",
      "Title": "Preparing kids for hair loss & treatment Madismommy719 mks16"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 19, 2011 09:47PM mommichelle wrote: I completely agree with Illinois.  Do not wait.  Peace of mind that it is nothing will save you a ton of stress, and if, in the off chance it is something, catching it early is the key.  Too many times people know something isn't right and they don't get it checked out soon enough.  Plus, you are blessed to have a lump, some people don't even have symptoms or other signs.  It is probably nothing but in either case, getting it checked early is worth it!",
      "MessageIndex": 2,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773350",
      "Title": "Update: waiting to see a dr waybacktexas kikiwiki"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 10, 2011 07:33PM mommichelle wrote: It is a very hard decision and you might want to get a second opinion.  I was in the same place last summer.  I had a 4mm area that was invasive.  My cancer was HER2+ though.  I knew I wanted the herceptin and that usually goes hand in hand with chemo.  I did the chemo.  I wanted to know I did everything to keep it away.  Your chance to beat it is now.  Do your research, figure out what you can live with.  I know the chemo only increased my odds 1-2%.  I have a 4 and 6 year old and I wanted to be here a LONG time!  Best wishes to you.  I know how difficult the decision making process is! Hugs, Michelle",
      "MessageIndex": 1,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774579",
      "Title": "chemotherapy choice judytheq mdg"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 10, 2011 07:46AM mommichelle wrote: Jackie - You have found a wonderful site full of great information.  This is a very difficult time (at the beginnning), hang in there.  It does get easier.  Once you get through your doctor appointments and start making a plan for treatment, it will be a lot better.  Most of the stress is in the not knowing.  I almost lost my mind waiting for the pathology reports last summer.  NOw, I look back on the time, and although it WAS NOT FUN, surgery and chemo were doable.  The time also went by fast.  I am getting my hair back pretty quickly, did surgery in June last year, finished chemo in December, finished herceptin last month.  Hang in there...we will help you get through it! Hugs, Michelle",
      "MessageIndex": 1,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774530",
      "Title": "Just new-need advice jackiefoley jackiefoley"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 24, 2010 05:17AM mommichelle wrote: All the ladies out there starting chemo this week...give 'em hell!  Good things, one treatment will be finished, and the second, you'll be on the road to feeling better.  Hang in there.  I am thinking of you and praying for you all.  You will be so happy to have the quest  ions of the first one done!",
      "MessageIndex": 849,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 11, 2010 12:56AM mommichelle wrote: I too am 1 day out from second treatment (of 6).  Feeling pretty good.  My husband shaved my head (buzzed it actually) last night.  It is so incredibly sore.  Has been for about 5 days.  Does that eventually subside.  I feel like my head is black and blue all over.  I go in today for a nuelasta shot since my counts dropped during last treatment.  Scared to get it, but am hoping for minimal side effects and good counts trough end of treatments. Hope everyone is doing well.  Been reading alot, not posting too much.  My prayers are with all of you! Peace, Michelle",
      "MessageIndex": 1473,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Oct 3, 2010 10:56PM mommichelle wrote: I haven't been having headaches, butI have been having dry eyes, twitching eyes and sometimes seeing floaters and sparkles.  Anyone else?",
      "MessageIndex": 2157,
      "PostDate": "03/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Oct 10, 2010 09:13AM mommichelle wrote: Wherria - So sorry about the marathon.  This cancer thing does suck.  Good decision to not go though.  Get yourself better. Calamtykel - Good luck tomorrow.  Fear of the unknown stinks and I remember how worried I was my first chemo too...can't imagine having to go through that twice.  Will be sending you positive thoughts and prayers.",
      "MessageIndex": 2318,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Oct 26, 2010 10:59AM mommichelle wrote: Lizzy - Thank you for your post.  Love the water finding it's own level.  I may use that sometime if that is alright.  I am not always in the dumps, believe it or not, I am usually pretty upbeat.  Sunday and Monday post chemo are sometimes hard to see the light.  I do know it is out there and I know it should be coming around again tomorrow.  We are all so lucky to have each other.  I was just moved tonight by the flurry of posts of people feeling fed up and tired.  I was feeling so isolated and sad.  It is so nice to know we have developed a group of individuals who are all going through similiar situations at the same time.  It makes it a lot easier to not feel alone.  God bless you all...",
      "MessageIndex": 2676,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Nov 10, 2010 08:33PM - edited Aug 20, 2013 06:09AM by mommichelle Good evening eveyone!  It sounds like there is some good stuff on the boards, happy things happening, new homes, continuing education, and muddling through each chemo and nearing the end.  I have #5 of TCH tomorrow.  Started steroids today, not thrilled to be going again.  Sometimes it seems like as breats cancer patients we get screwed....weight gain on chemo and hair loss.  With some chemos for other cancers, people do not loose their hair.  Tell me, why, when my eyebrows are just starting to thin (thank goodness they were very full to begin with )are the annoying three random chin hairs I have growing back?  What is up with that?  NOT FAIR! To everyone having treatments best wishes, to those waiting for the side effects to pass, may they do so quickly, and to those enjoying the good weeks - have fun. There are many beautiful bald women on this board and I just got a look at sohardbnme.  Beautiful ladies.  Be proud! Strength and peace be with all of us, my prayers to all of you!  Be strong! Michelle",
      "MessageIndex": 3028,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Mar 27, 2011 08:21AM - edited Mar 27, 2011 08:23AM by mommichelle I wish I knew on the weight front.  I put on about 15 - 20 pounds through chemo and have tried to really cut back the junk I have been eating.  I gave up all junk food for Lent so I am being good so far...having trouble getting the exercise motivation or time.  :(   It is frustrating, I feel hungry all the time and I am not really losing anything!  I am eating, just nothing that doesn't have a nutritional value to it.  I tell myself that exercise reduces chances of reoccurance, but I just can't find the time or energy to do it.  Maybe once thing warm up a bit? On the SNL \"Pat\" thing - I actually told my husband the other day that I feel like I look like Will Ferrel when he dresses up like Janet Reno................",
      "MessageIndex": 5343,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 7, 2012 06:50PM mommichelle wrote: Tex - Those are fabulous pictures!  Your kids are so cute and you all look like such a sweet family!  Thank you for posting! Michelle",
      "MessageIndex": 8457,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Dec 2, 2010 10:03PM mommichelle wrote: Cal and Onemonga - Prayers and positive thoughts going out to both of you. Sweeney - Love your new avitar with your man  :) Sohard - thinking of you and hoping for a quick recovery from surgery. Too much to catech up on.  I have about an hour before mom comes over to take the kids.  Last TCH today.  Happy to be finishing (mom is bringing them in to ring the bell when I am done), nervous about not being on chemo, and absolutely dreading the weekend.  Lord, please let this be my last crappy chemo weekend. Everyone take care and my thought and prayers are going out to you all! Michelle",
      "MessageIndex": 3522,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 14, 2011 10:04PM - edited Jan 14, 2011 10:05PM by mommichelle Good morning all!  Hopefully we all warm up soon and Spring will be on the way.  The world will see us all emerge as beautiful flowers... Cal - Thinking of you and sending lots of hope, hugs, and prayers your way.  I pray for the best news and quick, painless recovery.  Sorry about the little boogers asking you for payments.  Even though we know the financial aspect is part of everything, couldn't they do it at a more appropriate time? Libraylil - So sorry to hear the margins were not clear and you need to go again.  Prayers and tons of happy thoughts going out to you for a quick date, and sucessful surgery. Sptmm62 - Totally agree with wishing both had been taken.  I didn't know there were calcifications in the other breast until after my mastectomy.  Surgeon was not concerned about them and told me that if he performed mastectomies on all women with mammos that looked like that, most of our town would not have breasts.  Still, not reassuring enough.  I think I will be opting for another surgery to remove the other side sometime this year. :( Iowa Sue - Hope your vacation goes well.  I am so jealous!!!!  I would ask to come along in your suitcase, but with the 12 chemo pounds I put on, I am sure I wouldn't fit! Lizzy - So glad you are feeling good enough to be getting cabin fever!  Remember, not too many days ago you couldn't get out of bed.  Glad you can't wait to get out of the house! Ginger and Lady - so sorry you are both having issues getting in to see the doctors!  Ginger, is it really only three minutes?  My extra body surface area, compliments of chemo, would make getting moisturized all over a challenge, even if I started before I got out of the shower!  Gotta loose this extra weight, weather has not been helpful for getting out!  Sweeney - Hope you are having fun while the rest of us are dealing with all the snow and cold!  I am so glad you got away and sad that you will be heading home soon.  Goes fast, doesn't it? Have a great day ladies.  I think about each one of you throughout the day and pray you are all well and safe.  Once it warms up, and we are all heading outside, hopefully much of the disaster of the last 6-8 months will be behind us with happy thoughts ahead. Michelle",
      "MessageIndex": 4420,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 22, 2011 09:24AM mommichelle wrote: Rachel - YEAH!  I am so happy for you and your good news on the scans.  I know you must be relieved.  Celebrate and enjoy...it is so hard and stressful to go through the waiting.  Pamper yourself! Cal - Glad they didn't find anything at the ER.  Maybe it was even stress related form all the worrying?  I had an optical migraine right before Christmas and it scared me a lot.  Every day after, I waiting for another one to happen.  So glad there hasn't been any since (knock on wood).  So it was probably just something random that happened to you too. Texas - I think what everyone has said about 2 weeks being enough for recovery is about right.  I know I was feeling good but I only had one and no muscle removed.  I pinned the drains to the bra the surgeon put on me.  I wore that bra for the first couple days. The drains were a pain with the kids, but luckily you usually do not need them for long. Lil- Hoping and praying for great news that all went well.  Hugs! All - Enjoy the weekend.  It is cold here in PA and only gonna keep getting colder.  Expecting lows below zero at some poing, and that will break a 15 year old record!  Not as bad as some of you, but cold just the same! ",
      "MessageIndex": 4528,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Mar 10, 2011 07:00AM mommichelle wrote: Cal -  So glad to hear you are feeling like some emotional healing is happening.  I have you in my prayers everyday. Hair - Everyone is looking good!  I will try to get my hhubby to help post my pic tonight.  I think I am doing fairly well. Sue - I started taking calcium, krill oil and a multi vitamin.  Not sure why those, just felt tlike I should be doing more.  Would love to get some guidance with the supplement think.  I gave up all junk food for Lent so I should hopefully be eating healthier! Been doing well, but very sad.  Lots of body aches and pains that make me worry something is going on.  Never sure if it is residual chemo stuff, herceptin, tamoxifen, old age, or the extra weight I have put on (or...cancer).  It seems like most days my neck and upper back hurt.  My side has been bothering me too.  Just not sure.  I keep reminding myself that there is a good chance it won't come back...but I feel myself just waiting for it.  I am alone in that fear?  Will we start feeling normal again?  I know there will be a new normal, but will cancer move from the forefront on my mind to somewhere in the back (or even the passenger side)?  Just wondering how many still feel rickety and are still worried.  Hate to bring it up, but I feel alone (not that I want you guys feeling this way). Hugs to all, Michelle ",
      "MessageIndex": 5104,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Mar 10, 2011 10:59PM mommichelle wrote: Thanks for the responses ladies!  Feeling better today and hoping to continue on that path.  Just thought at three months out from chemo, I wouldn't be feeling so rickety, old, and every now and then in pain.  OH well, one day at a time! Good days to all, Michelle",
      "MessageIndex": 5113,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Mar 7, 2011 08:54AM mommichelle wrote: I am not a doctor, but shortly after I was diagnosed I felt a lump in the area around my collar bone.  I also had cold symptoms.  When I asked the docor about it, he kind of made light of it and said that my body was doing what it should be doing to fight off infection.  He said we would keep an eye on it and in 6 weeks if it was still there we would explore further.  He was right, it went away after my cold cleared up.  It could just be your body working to keep you healthy.  :)",
      "MessageIndex": 2,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/765837",
      "Title": "Really scared MissMeg MissMeg"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "May 5, 2011 09:11PM mommichelle wrote: Sue - YEAH FOR B9! Shie2011 - Best wishes for side effectless chemo.  We are here!",
      "MessageIndex": 5810,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 7, 2011 07:17PM mommichelle wrote: Hi all! Haven't been able to read through all the posts.  I have been trying to take a little break from the boards.  I tend to work myself up into having brain mets, liver mets, or bone mets on a daily basis.  I have decided to seek some counseling to help me deal with my fear of reoccurance.  We will see if that works! Lady - so glad you are done!!!!!!!!   Lizzy - It sounds like you are having surgery soon.  Best wishes for a speedy recovery! Sweeney - I sometimes think Tamox is the devil.  I was doing alright for months, but I have to wonder how many side effects are actually linked to it!  Like the longer you are on it, the more time it has to disrupt your body.  Much like the chemo side effects that seemed to be cumulative.  I do get headaches, body stiffness and mood swings/quick temper.  It does seem to be somehow related to times in my cycle.  I am thinking about having my other breast off this fall so I will not need to take it (and for my piece of mind).  I see a surgeon Monday to discuss that and maybe some new boobs! Hope you all have a great day.  Although I think of you all often and pray we stay healthy, I am glad to not be in a place where, like last year, I needed to be here everyday.  You ladies have been an awesome support group! Hugs, Michelle   ",
      "MessageIndex": 6756,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 27, 2012 08:22AM mommichelle wrote: Just checking in.  Lizzy, so sorry for your loss.  I've always thought the worst part of life is dealing with the end of life.  Hopefully you will find peace.  My thoughts and prayers to your family.",
      "MessageIndex": 7550,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 20, 2010 05:09AM mommichelle wrote: 1st chemo was uneventful, went very well so far!  Nervous about waiting to see what happens next.  Hoping that my chemo buddies IOWASUE, KAZAMATZ, and JUSTDUIT also had good experiences.  I thought of you often, as well as many others on the boards!  Here's to few side effects!",
      "MessageIndex": 675,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 21, 2010 02:03AM mommichelle wrote: Omaz, I am doing TCH (Taxotere, Carboplat, and herceptin).  What will you be doing? Michelle",
      "MessageIndex": 724,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 21, 2010 11:00AM mommichelle wrote: Wherria, I too am very sad for your loss.  I know how tough it is too lose a pet and to lose them now is very sad.  They are like family! You are in my thoughts, Michelle",
      "MessageIndex": 753,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 11, 2010 01:44AM mommichelle wrote: I asked about Claritin but my doctor said I should wait and see how this first one goes.  He recommended Tylenol for any pains.  I have extra padding in the tummy too, is that a good spot?  Have you had any reactions to the shot?  Yes, I am doing TCH.  Herceptin for a year and the other two will hopefully finish up early December.  :)",
      "MessageIndex": 1476,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 18, 2011 08:56PM mommichelle wrote: Sue, Congrats!  So happy tp hear you are finished.  Now look forward to your vacation! Hugs, Michelle",
      "MessageIndex": 4478,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 24, 2011 05:24AM mommichelle wrote: Lizzie - Our fearless leader - go get 'em and get this chemo thing bheind you!  Good luck and congrats on getting to the end of chemo!  Hugs to you!",
      "MessageIndex": 4563,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Mar 15, 2011 05:12PM mommichelle wrote: Lady - Prayers with you tomorrow.  Thoughts for great news coming your way. Sue - Fabulous news about the surgery date!!!!!  I am so happy for you. Tamox - Not sure what symptoms are what.  I did go to the oncologist last week because I was getting freaked out by a bloating feeling on my side and under my rib cage.  He told me that it was something that sometimes happened with women who have had mastectomies.  He said something about the lymph fluid building up and causing the pressure....anyone else hear of this?  I was thinking that it was my liver or kidneys or something (actually thought it was my fat roll pushing in on internal parts at one point too), and he made me calm down.  The feeling was gone for about 3 or 4 days but now it is back again.  Very uncomfortable and just want to be positive that nothing else is going wrong! Hope everyone is doing well. Michelle",
      "MessageIndex": 5173,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 29, 2012 07:11PM - edited Aug 29, 2012 07:13PM by mommichelle Good morning, Rachel - Very sorry to hear the news of your friend.  I am sending positive vibes your way for good news on your scans!  Good luck with getting the kids ready for school too.  It is such a busy time of year, fun, but busy. Texas - I have to agree with the other ladies - you are amazing!  How lucky are your niece and nephew to have you?  Hope your transition to school days goes smoothly!  Sweeney - Sending good thoughts your way on the bone scan.  I had one at the beginning of the year for some shoulder/back pain.  It is amazing how much are bodies take going through chemo.  Lizzy - You certainly have had your fair share of troubles.  Hoping for continued recovery and a much smoother road. Sptmm - I also had the DIEP flap done in January.  I had decided after a year and a half, that I couldn't stand the thought of it coming back in the other breast.  I had to have it done.  Lizzy is right when she says how much you don't realize how much being lopsided or dealing with inserts can get to you.  I always thought I was fine being flat on one side after my mastectomy.  It wasn't until this surgery that I realized how happy I was to be able to get dressed without worrying about those inserts being in the right place, to put on a swimsuit and feel normal!  I have a 5 and 7 year old.  The surgery was tough, the weeks following were not easy, but I would never go back and change it.  I did have a lot of help from my family, but it was so worth it.  If there is anything you need, let me know.  I had been in touch via telephone with IowaSue before my surgery.  She had the procedure done too.  I would be happy to talk to you.  It is a hard decision, but you need to do what is best for you. Good day all.  Trying to get back into the school routine with my little guys too.  How they hate to get up early.  I hate waking them so early too.  Wish my work started later!  Off to rouse the monkeys! ",
      "MessageIndex": 8544,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Mar 7, 2011 08:53AM mommichelle wrote: I am not a doctor, but shortly after I was diagnosed I felt a lump in the area around my collar bone.  I also had cold symptoms.  When I asked the docor about it, he kind of made light of it and said that my body was doing what it should be doing to fight off infection.  He said we would keep an eye on it and in 6 weeks if it was still there we would explore further.  He was right, it went away after my cold cleared up.  It could just be your body working to keep you healthy.  :)",
      "MessageIndex": 1,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/765837",
      "Title": "Really scared MissMeg MissMeg"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 21, 2011 02:20PM - edited Aug 21, 2011 02:21PM by mommichelle Laura, Fabulous post!  To everyone reading this as your journey is starting, it is so true.  Every word.  I am 14 months out from diagnosis and every day gets a little better than the last! Thanks for writing this...I think I would have loved to see it when I started! Michelle",
      "MessageIndex": 10,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773420",
      "Title": "29-ish Months Post-Diagnosis: You Will Get Through This! Kaidog MNSusan"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 10, 2010 05:48PM mommichelle wrote: Hi!  I guess I can add my name to the list.  First treatment (TCH) is August 19th.  I will have a port put in on Friday this week.  I am so scared for all of it!  Look forward to having a great group to keep in touch with and supporting. ",
      "MessageIndex": 354,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 10, 2010 05:50PM - edited Aug 10, 2010 05:52PM by mommichelle",
      "MessageIndex": 355,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jun 30, 2011 05:25AM mommichelle wrote: Hello everyone! Hope everyone has been doing well.  I do not get much of a chance to sit for long periods of time on the boards lately, do try to check in to make sure there aren't any messages.  I have read some of the board here but need to catch up on a lot!  Going in today for my 1st mammo post BC and I am terrified.  I don't know what happened, all of a sudden in the shower this morning I just started crying.  I felt like I was dealing with it alright but it just came over me.  I hate BC and I sometimes wish this didn't need to be a worry.  Strike that - I always wish this didn't need to be a worry.  I pray for you all everyday.  You have been such a great support through this whole thing. Hugs to everyone, Michelle",
      "MessageIndex": 6334,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jul 13, 2011 11:24AM mommichelle wrote: Good evening all! Lizzy and Cal - thinking of you both and sending good vibes for great news tomorrow. My mammo went well last week, good pap result but now have a cyst on my ovary.  Need to go back in three weeks.  I know how the \"what ifs\" and \"what is that pain\" thing goes.  Today it is one thing, a week from now it will be something else. Miss getting to be on here as mauch as before.  Prayers to you all. Michelle",
      "MessageIndex": 6452,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 5, 2011 11:26AM mommichelle wrote: Good evening all! Sue - Congrats on the end of herceptin!!!!  It must feel pretty great.  I have my last on Wednesday  :) Carolyn - I am so sorry that you are having to deal with this issue.  I know after my diagnosis the kids had accidents in their beds at night, luckily that didn't last long.  I hope you are able to find a resolution soon. Debbi - It is good that you feel in your gut that everything is alright this time.  I know before my diagnosis my gut said something was wrong.  I think sometimes we do just have that feeling.  I will be praying that your gut feeling is right and that all will be fine.  I also pray for a success, speedy surgery. Regina - I think about you often and keep you in my prayers (along with all the ladies from this thread).  You are such a tough cookie and I hope and pray you are feeling better soon! Rachel - Hoping all went well with your tests.  Good luck back at work  :) Lizzy - You are fabulous, you have really taken this group of women, organized us into a little army of cancer fighters and support givers, and kept it going.  I thank you for starting this thread which has been my life line so many nights!  I love having you all here! To everyone who is exercising - good for you all!  I am a little frustrated, I kicked my workouts up a notch and I ended up getting a bloated feeling in my side under the breast that was removed.  Onc thinks it might be lymph fluid.  It makes me not want to work out.  Haven't done a thing in about 8 days and no discomfort in my side.  I wonder if I just need to work through it and maybe it will eventually get better?  All I know is sometimes, it freaks me out wondering what is going on. Hope you all have a great night.  I think about you and keep you in my prayers. Hugs, Michelle",
      "MessageIndex": 6601,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 2, 2012 10:00AM mommichelle wrote: Happy New Year to all my chemo sisters! I must apologize, reoccurance fears have kept me to myself for a while and I try not to get on the boards because I always seem to have the same pains someone else had right before they were diagnosed with a reoccurance.  Not sure if any of you feel the same or have those issues.  I have been to see a counselor last week for the first time.  Hope she can give me some tools to deal with my fears.  I have DIEP surgery scheduled on the 13th of January so I am gearing up for that!  I think of you all so frequently and keep you all in my prayers.  Let's all hope for a beautiful, worry free, healthy 2012! I'll be popping in again! Hugs, Michelle",
      "MessageIndex": 7454,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Feb 10, 2012 05:21AM mommichelle wrote: Hi all!  I just stopped by to catch up a little on the thread and to report on surgery.  Surgery went well, recovery is going alright, I still have one stinking drain (for four weeks now) that I would love to get rid of.  Fairly happy with my new girls and I can honestly say that I did not realize how much I was missing having that breast until I was looking down in the shower the other morning and it looked like my old breasts.  I cried.  I am happy to be on this side of the surgery and I truely believe in my mind, the other breast was cancerous (not literally).  The pathology report on all the tissue was clean and they even did the scar tissue from the original mastectomy.  Hope everyone is hanging in there and working to find our new normals...whatever that might be. Hugs to all, Michelle",
      "MessageIndex": 7579,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 19, 2010 11:11AM mommichelle wrote: Good luck to JUSTDUIT, KAZMTAZ, and IOWASUE44.  I will be thinking about you all tomorrow!  Best wishes for a good treatment.  Thanks to the ladies on the boards for the support!",
      "MessageIndex": 636,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 21, 2010 12:14AM mommichelle wrote: Justduit, So glad all went well for you yesterday.  Hopefully you continue to feel great!  I too am feeling pretty good.  Felt a little queasy last night but so far today, so good.  Do have a horrendous taste in my mouth already.  Water tastes murkey and everything I eat is off.  Didn't think that would happen so soon.  Oh well, at least I can deal with it.   Are you noticing anything with your taste buds?  I was thinking about you yesterday as I was getting treatment hoping that all of us yesterday made through it without any major events!  IOWASUE sounds like she did well too.  Just need to hear from KAZMTAZ.  Hopefully all is well there!  Keep up the fluids!  As sad as I am to know you three all started yesterday with me, it is comfoting to know we have strength in numbers! Thinking of you all, Michelle",
      "MessageIndex": 719,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 21, 2010 03:42AM mommichelle wrote: Omaz, The nurse with me said that not too many people on this regimine experience mouth sore issues so I did not use any ice...wondering if I should have? Michelle",
      "MessageIndex": 729,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 18, 2010 11:04AM mommichelle wrote: Sweeney, Just want to say that I adore your attitude...you are a bright light on these boards.  Thank you for keeping it real and upbeat!  Enjoy the crop circles! Have a great night, Michelle",
      "MessageIndex": 1737,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 19, 2010 06:53AM mommichelle wrote: Sweeney, Even though I so know it is not funny, isn't it crazy how when it rains it pours?  I am sorry you are having struggles.  I am a little PO'd at you, where the heck is the information on crop circles?  Just joking.  Hang in there!  Good thoughts and strength going your way for your hubby to get home fast and no ER visits!  Hugs! Lisa, Definitely take it easy.  I night or two missed now for a lifetime of nights is worth it!  Rest, hydrate, and be good to yourself.  You deserve it!  Prayers your way for a speedy recovery and an opportunity to show off your talents soon!  Hugs!",
      "MessageIndex": 1754,
      "PostDate": "19/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Oct 26, 2010 09:50AM mommichelle wrote: I need to thank everyone so much for all their honesty.  I had treatment number 4 of TCH on Thursday and have just been feeling horrible.  I know that emotionally the days after chemo are hard  for me, but this time was bad.  The weather was beautiful here (low 70s) and I just wanted to be outside with my kids and husband!  I was such a jerk to him, he bought steaks and hotdogs to grill Sunday night for him and the kids, and because of the bad taste in my mouth and the depression and fatigue, I asked him what made him decide he wanted to have a \" little picnic\" today.  I was mean.  I am tired of feeling tired the week of treatment (I want to stop at 4), I am tired of wanting my old life back and knowing I will never have it, I am tired of hearing people complain about how busy their lives are and about the small problems I used to have and wish I still had, I am tired of wanting my husband but being afraid of the crap flowing through my veins contaminating him,  I am tired of wearing a smile for everyone, so I don't make them feel bad because there is nothing they can say.  I am tired of worrying about it coming back and I am tired of feeling that if I make it another 20 years (to 57) I should be sooooooooooo thankful.  I will be grateful (I am for everyday I am given), but if that is all I get, I feel like I got shorted. I know others feel the same.  Why did this happen to me?  What did I do wrong?  My kids need me to be here...I need to be here for them.  I want to sit on the rocking chairs with my husband at 80 watching our grandkids...I want to be in the bathtub overlooking a sunset talking about erectile dysfunction.  Is that too much to ask?  Sorry about the rant.  I check in everyday, rarely write, I am always thinking about you all, praying for you all, sending happy thoughts, and I never want anyone to see all this junk that is in my mind because I don't want to be a downer or scary.  Thank you all for letting me get all this off my chest.  Peace and strength to us all.",
      "MessageIndex": 2672,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Oct 30, 2010 11:28AM mommichelle wrote: So sorry everyone is feeling bad.  We ARE getting there.  Most of us are over the halfway point and that is great.  We are strong and even though it is tough now, it will be better soon. Love the picture Kate.  You are Gorgeous! Hugs to all and hopes for everyone to get a good night sleep. Don't let the bed bugs bite!",
      "MessageIndex": 2783,
      "PostDate": "30/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 9, 2012 01:32AM mommichelle wrote: Thanks Omaz! I was telling a friend about your beautiful pictures of sunsets the other day.  It looks spectacular.  One of these days I'll get out there to see that part of the country! Have a great day!",
      "MessageIndex": 8591,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 28, 2012 06:56AM - edited Sep 28, 2012 07:00AM by mommichelle Morning ladies! Ginger - thoughts going out to you on your migraines.  I know they are not fun!  Did the doctor have any suggestions? Sweeney - It is good to hear that the doctor is going to check again in a few months.  You would certainly think if they were super worried, they would be investigating further right now.  I am sure, like so many other stories you hear, that it will be nothing.  I want to tell you to try to keep your mind off of it, but I know how difficult that can be.  Prayers and hugs!  Rachel - Glad to hear that the doctor is giving the all clear.  The abdominal pain thing stinks though.  It is always unsettling when you have random pains.  It is amazing though, how many people have pain all the time without having cancer.  Hope you are feeling better.   Felis - Hang in there!  It is a tough road but you can do it.  Hope you are feeling better and your cold is going away.  So many people have all kinds of colds right now in our area.  Debbi - When is your surgery scheduled for?  Do you have a date?  I had plenty of abdominal area for them to use.  My replacements are a little larger than the originals.  Not necessarily what I would have chosen, but they are only slighly larger.  The doctor told me he went a little bigger because you can always go back and decrease the size, harder to increase.  I just do not want any other surgeries! Hope everyone has a great day! Michelle ",
      "MessageIndex": 8663,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 7, 2014 11:10AM mommichelle wrote: Hello all!  I haven't been on the boards that often but wanted to pop in and say hi.  I think of you all everyday and I am so thankful that I was able to count on all of you through the worst of days!   Take care, Michelle",
      "MessageIndex": 9604,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Dec 5, 2010 06:02PM mommichelle wrote: Day 3 past last chemo and struggling to the finish line.  Very tired, very happy to know this will hopefully be it, and also scared about what is next.  Mastectomy was done in June and now that chemo is finished, just have herceptin and tamoxifen to look forward to.  Also regretting decision to only take one side off, thinking about getting the other one done too.  Not sure I want reconstruction.  Just tired of the appointments, medicines, ect.  Kids are running around like crazy and I want to have the energy to catch them!  Maybe later in the week. Best wishes to those who are still going and congrats to those who have finished (even though I know we have mixed feelings - at least we will hopefully start feeling like ourselves). Michelle",
      "MessageIndex": 3587,
      "PostDate": "05/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Dec 9, 2010 07:20AM mommichelle wrote: Cal - Fabulous news!  I have been praying and deep down knowing that all would be good.  Hope the popcorn was yummy! Sweeney - So glad that you booked your trip....enjoy the get away!  Ginger - Hard to decide what to do when there is always so much new technology and new treatments (we are so lucky they keep finding new stuff).  It sure does make it tough, you take a harder road know for something proven, and then find out 3 or 5 years from now that the easier method would have worked just as well.  At least y at this rate, your granddaughter will never have these worries or decisions! libraylil - I know what you mean about the TCH butt kicking.  Today is a week out, starting to feel better and crazy to think I don;t have to start the, \"I have two more good weekends left\" countdown! Have a great day all! Michelle",
      "MessageIndex": 3664,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Nov 25, 2010 07:47AM mommichelle wrote: Happy Thanksgiving to everyone!  I pray for a side effect free or minimal day for everyone.  I give thanks for being alive, I give thanks for my family and friends, I give thanks for the job I have, I give thanks for my home and the food we have to eat, I give thanks to all of you for helping me through my journey.  I am so blessed! I haven't posted in a while but I have been reading (the kids make it hard to concentrate enough to write).  I loved the idea of LISASINGLEM being on a billboard about breast cancer awareness.  What beautiful pictures of such a strong woman!  IOWASUE - Love your new picture too.  Bald is beautiful! So sorry to read about insurance issues...it is a shame to have those worries now.  I hope some how, we can get this country to realize what is important.  When CEOs are bringing home multimillion dollar bonuses, we have a problem.  That is more money than most of us will see in a lifetime.  How many people could be given a job for an entire year on that \"bonus\".  It is not good enough to have companies making billions, they want to make trillions.  Cut the headcount, stress everyone out, and make more profit so we can give the presidents, CEOs millions.  Enough on that! So happy to see people finishing up their chemo treatments.  One week from today for me, with the exception of my herceptin. For those moving on to radiation, surgeries, or more chemo - be strong, you are survivors!  So thankful to LIZZYMACK1 for starting this thread.  It is wonderful to have such a great group of people to talk to, read your experiences, and know I am not alone. HAPPY THANKSGIVING EVERYONE!",
      "MessageIndex": 3354,
      "PostDate": "25/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Nov 28, 2010 12:21PM mommichelle wrote: Calamtykel - Hey!  We live about 25 minutes from Hershey.  We have had season passes for a few years now and it is funny that you say about being there after mammos and waiting for breast surgeon appointment.  I remeber going up there a number of times this summer at various points in the whole process.  Right after finding out that it was cancer (we went up two days before my surgery) and I was holding my little girl watching my husband and son on a ride and I just cried.  We went up a bunch of other times (and I have cried a few of them - when I see \"normal moms\" and wish for those carefree days).  We went to Halloween at Hershey and are maybe heading to Christmas Candylane tomorrow night.  It is nice, but I would not go every year if we didn;t have passes.  The light show in the park is pretty.  Sweet lights was crazy.  It is their drive thru light display.  It took a couple hours to go through about a 2 mile stretch.  The little ones got very rammy!  It is also a two lane road and we were next to a bus which blocked our view of the other side.  You'll have to let us know if you go! Michelle",
      "MessageIndex": 3404,
      "PostDate": "28/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Dec 17, 2010 09:04PM - edited Aug 20, 2013 07:55PM by mommichelle Cal -  I wil lbe thinking about you today and hoping all goes well.  I am so glad that you are getting the port out after sooooooo many issues with it.  It will feel great and maybe by Christmas chemo will definitely be feeling more distant.  Let us know how it goes.  I still have mine for the herceptin treatments through August, but I am a little nervous about the deportation process!  Same thing with the tamoxifen, I should start that beginning of the year. Prayers, Michelle",
      "MessageIndex": 3806,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 4, 2011 05:49AM mommichelle wrote: Cal - I had the same thing after I got my port in.  I was so panicked.  The doctor said that because I had had the surgery and I was starting to get a cold, he would not be concerned at all, that the nodes were doing their job.  It is hard not to worrry though.  Maybe your body is just fighting something off.  Thinking about you and sure all will be fine.  Try not to worry - easier said than done, I know!",
      "MessageIndex": 4173,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 22, 2011 10:20PM mommichelle wrote: sohard - So sorry you had such a rough go over the holiday.  You and Lizzy both  :(.  Glad you are feeling better and very happy to hear yuo say that mentally and spiritually you are feeling great...and that physically, even though you get down sometimes, you come right back up!  I am very happy for you.  How long do you have to have the herceptin?  Are you finishing out a year?",
      "MessageIndex": 4532,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 24, 2011 01:58AM mommichelle wrote: Libraylil - Glad you are home and the surgeon seems to feel like all is good!  Rest and try to enjoy the day! Texas - Will be thinking about you and praying for a successful surgery and quick recovery.  I am sure you will be fine, you seem to be made of some pretty tough stuff!  Hugs to you!",
      "MessageIndex": 4547,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 31, 2011 12:12AM mommichelle wrote: Texas - I am thinking about you and praying for a speedy and successful surgery with an even faste recovery time.  It wasn't as bad as I thought it would be (when I had my mastectomy) and I would have another surgery like that over chemo anyday!  Hugs to you! Lady - I started tamoxifen last Saturday and have noticed a slight discharge and odor.  I was very embarrassed about it. I am so glad you brought it up.  I know you ladies understand the good, the bad, and the ugly (or smelly)! Iowa Sue - Welcome home!  I am so glad you got away, you deserved some relaxation and fun! Lisa - I am so happy for you!  What shows are you in?  You are amazing.  You'll have to let us know about the movie too! Zenith - Again, chemo, the gift that keeps giving!  So sorry to hear about your eyes and now more surgery! Ginger - Isn't it amazing how the little ones can do whatever they want to us!  They are such good therapy and so much fun.  Enjoy! Lizzy - Hope you are starting to feel sooooooooooooooo happy that chemo is behind you! Have a great day all....hubby is at work, ao Sunday school followed by McDonald's playland with the kids and then snow tubing today!",
      "MessageIndex": 4643,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 18, 2011 08:55PM mommichelle wrote: Cal - I know what you mean about that crippling fear.  So happy for you!  Celebrate!!! Rachel - Good luck tomorrow with your bone scan.  Prayers out to you and looking forward to celebrating your good news! Sweeney - Welcome back!",
      "MessageIndex": 4477,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Feb 15, 2011 04:44PM mommichelle wrote: Cal - I am not even sure what to say.  I am sitting here crying for you and your family.  It sometimes makes you wonder how much a person can take.  My prayers are with you.  67 is way too young!",
      "MessageIndex": 4825,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Feb 13, 2011 02:39PM mommichelle wrote: Hello all!  So sorry to be gone so long.  My sweet husband decided to try to get the audio on our laptop working and checking the troubleshooting website.  He \"flashed the bios\" (whatever in the world that means) and killed our computer.  I have been without one for almost two weeks and have been going into severe detox from this board.  He somehow got it hooked up for me to read the boards last weekend through his playstation but I couldn't post.  Glad to be among all of you again. Lady - My thoughts are with you and I am so happy that they found it so early.  The fact the doctor thought they looked normal is good too.  I know how scary it is and I want you to know you are in my prayers. Lizzy - So sorry about your loss.  I hope the family is dealing with everything as well as can be expected.  My heart is sad for you all...especially your sister.  Sue - Please let us know what you find out.  Thoughts and prayers coming your way for something like a pinched nerve! Sorry to hear so many are having problems with LE.  It doesn't seem fair to go through so much only to have more to deal with.  Cal - Glad to hear that you are coming out of Tamox fog and feeling a little better.  Sorry about your oven too...I know what you mean about the money, wasn't expecting to have to buy a new computer. Texas - Been thinking about you and hoping recovery is going well.  I guess if you are running all over town, you must have pulled through with flying colors! Blessings out to everyone.  So nice to be back here.  It is hard.  I really realized how much I rely on you ladies!  Thank you for being there for me!  Have a very happy Valentine's day! ",
      "MessageIndex": 4801,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Feb 23, 2011 08:26AM mommichelle wrote: Good afternoon all! On aches and pains - yeah, feel like I am 85 when I try to stand up.  It seems like once I am moving all is good, but for the first couple minutes it is rough going.  Not sure if it herceptin, old age, tamoxifen, or chemo related.  The joy! Wanted to share this story, kids were pesting this weekend for me to go topless.  My son has been very shy about me being bald, so when he told me I didn't need a scarf, I thought, well maybe I don't.  The neighbor down the street asked how the hair was coming in, showed her, she said that I didn't need the scarf.  My hubby said, I think you can start going without your scarf.  Had my son's birthday party with all family this weekend and they were excited to see me without the scarf.  Co-workers said I look good without the scarf.  Day two and feeling a little more comfortable with it.  I went to pick up my son at school, rang the doorbell, and I heard a kid say, \"someone's dad is here\".  I guess the hair itself might be there, might be growing, and might look alright.....................ON A MAN! Have a great night all!",
      "MessageIndex": 4900,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Mar 24, 2011 07:28AM mommichelle wrote: Lady - I wanted to let you know you are in my thoughts and prayers.  It certainly does suck, especially after going through everything you have already been through.  I will be sending positive thoughts and prayers your way! Texas - CUTE kids!  How can you stand them?  They are adorable! All - great hair pictures.  I would love to know how to post in the thread as well. Michelle",
      "MessageIndex": 5297,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 12, 2016 07:51AM mommichelle wrote: Hey sisters! Long time since checking in. I think of you often and thank God you were all there for me when we were going through everything. Glad to hear that everyone is getting out there and living! My two kids keep me busy and I am enjoying each day. Been a long year (coming up on the anniversary of my father's passing from ALS - such a tough disease), but trying to focus on the beautiful things in life and having fun making memories. <3 ",
      "MessageIndex": 9716,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 28, 2010 05:33AM mommichelle wrote: Gingerbrew, Let me tell you that I went through the same thing.  After my port surgery I had a horrible cold and also a fever.  I felt a lump in my neck and freaked out.  I had an appointment with the my surgeon the next day so I waited to ask him.  My surgeon is a wonderful doctor and he also has a bit of a dry sarcastic sense of humor,  I asked him about the lump.  He said that yes it was a swollen lymph node.  I asked him what we should do and he said probably biopsy it.  My eyes got huge and then he said, I can't joke around with you at all.  He said even if he hadn't known I had a history of cancer, just by the sound of my voice with the cold, he would have asked if I was sick.  He said the nodes were doing their job and 99% of the time, if you are sick and have swollen nodes, they will go away.  He told me to keep an eye on it for the next several weeks and if it didn't go away, we would look at it more throroughly.  Well a few days after I was feeling better, the lump was gone.  I do think it is wise to ask about it, but try not to worry.  It is very likely your body is doing what it is supposed to do to help with your cold.  :) Michelle",
      "MessageIndex": 2009,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Oct 11, 2010 05:30AM mommichelle wrote: lisasinglem - I do know that I have a ton of twitching after my treatments.  The twitching seems to get better the closer I get to my next treatment.  Sorry to hear you have been feeling under the weather too.  It must be hard when you are so passionate about something and then not be able to do it.  Hope you are feeling better.  Have a great day all...to those getting treatments...get 'em done and had few side effects.  Prayers and hugs to all! Michelle",
      "MessageIndex": 2332,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Oct 22, 2010 03:06PM mommichelle wrote: Sue, Hope your treatment goes well and minimal side effects.  Sounds like a great weekend with the house being clean and rain!  This time around I am feeling fatigued already today!  Tonight we are heading to Hersheypark in the Dark with the kids.  I am hoping I can hang in there with them! Thinking of you, Michelle",
      "MessageIndex": 2543,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Oct 28, 2010 05:38AM mommichelle wrote: Hello Ladies! Been scrolling through what everyone said.  I have never gotten the hang of remembering who said what - guess I could chalk it up to chemo brain?  Very rarely have time to be thorough.  Even now, I wanted to type while the kids were occupied before I tried to catch a half hour nap.  Chemo fog is clearing from last Thursday...and like so many others have said, we are heading toward the finish line and we should all be proud.  For those of you getting treatments this week, prayers for minimal side effects and a quick return to a more normal state.  For those who had treatments last week, hope that all side effects are passing and you are feeling better.  For those who are in a golden week...enjoy!  Been having a lot of positive information coming to me through survivior stories and on the boards.  A stage IV woman who was told a couple weeks ago that HER2 positive breast cancers may be one of the first that they can \"cure\" with chemo and keep people (even those with metatasis) cancer free!  Another woman wrote that her onco had been at the same conference and told her the same thing.  BIG THINGS are happen in the breast cancer world and I know we will all benefit from the hard work and research that is being done.  I have heard of so many ladies that had surgeries and chemo 20, 25, 30, 35 years ago who are still doing well.  Can you imagine what they endured?  Do we realize how far we have already come?  We are on the verge ladies of this disease being wiped off the planet, and I feel we will all be here to see that day! Happy thoughts and prayers to all.  My kids are drawing on my head tonight to prepare for Halloweeen.  They have been excited since I first told them I would loose my hair to \"decorate\" me!  I can't wait!  Peace...............",
      "MessageIndex": 2725,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jul 27, 2011 09:03PM mommichelle wrote: All, Just wanted to pop in and wish you all good luck.  I was an August 2010 chemo girl.  The ladies on the thread were the main reason I was able to get through it.  There were 3 other women who started the same day as me.  We still write and it was wonderful knowing that they knew exactly what I was going through.  The chemo (TCH) was easier than I thought.  Very little side effects for me other than some fatigue on the third/fourth day after chemo.  My hair is growing back now too.  It is kindof fun having short hair after years of very long hair.  I can get ready almost as quickly as my husband!  If you have kids, know they are resilient.  Mine were 3 and 5 when I was diagnosed (at the age of 36) and they handled everything very well.  Lean on family and friends, have doctors you trust that you can ask questions, and know that there is a light at the end of the tunnel.  Before I started going through my 6 treatments (the fourth was the hardest for a few of us on the boards - I think because we were tired of it and it wasn't close enough to the last one) it felt like the end would never come.  However, the weeks flew by, there was a new routine, and when my last treatment came, I was so happy.  Hang in there.  If anyone has questions, please feel free to PM me or ask here.  Count on each other, be there for each other, and you will all get through this and this time will soon be a small blip on the radar of your life  :) Hugs, Michelle P.S. - check out the thread called \"sucess stories\" it helped me a lot on some of my down days!",
      "MessageIndex": 29,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Nov 23, 2011 11:12PM mommichelle wrote: No problems here either.  Biggest issue for me was the inconvience of making the time for the infusion.  It was almost nice though...go to go see the chemo nurses and knew that I would not be feeling bad afterwards   Good luck!",
      "MessageIndex": 2,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778566",
      "Title": "Herceptin Alone JSB2011 Judy_63"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 18, 2010 01:25AM mommichelle wrote: I am 36.  Two little ones 5 and 3 and a wondeful husband.  Nervous but anxious about starting chemo on Thursday (TCH).  Hope everyone has been doing well and I will certainly be thinking about my chemo buddies on the 19th!  Here's to getting 1 down!",
      "MessageIndex": 565,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jul 27, 2011 05:48AM mommichelle wrote: jwaldher - Sorry you are here but you found a great support system!  I was 36 at diagnosis.  Stage 1, no lymph node involvement.  4mm IDC with a larger area of DCIS.  I did chemo mainly because I was HER2+.  I wish I had done a double mastectomy. Probably it is the only thing I would change.   I went with a single but I am now looking at having the other one removed.  I was lucky this time, might not be so lucky if it happens again!  Hang in there, treatment is not as bad as you think and soon this will be a small blip on your radar!",
      "MessageIndex": 6,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/772210",
      "Title": "28 yrs old with Breast Cancer Stage I jwaldher mdg"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Mar 26, 2011 10:17PM mommichelle wrote: Lady - I can't tell you how happy I am for you.  I know you still have surgery and possibly another round of chemo, but thank God they caught it so early.  Cured!!!!  That is fabulous. You will continue to be in my prayers for a successful surgery and speedy recovery! Sweeney - Glad to see you back.  Know what you mean about BC break.  Also understand how busy life has been getting once you are finished with treatment. All - About the short hair style.  I felt bad the other day kissing my husband, if anyone saw us they would think he was kissing a man!  I am trying to figure out a way to feminize it.  Thought maybe if I tried a clip, asked my hubby if it looked stupid...his response, \"If you have to ask it probably does\".  Thought maybe a headband, but one of my fashion conscious co-workers slowly shook her head no.  Any thoughts from anyone?  Maybe one of those head bands that tie and then hang over your shoulder with the hair behind it spiked up?  I am so challenged in matters of style...I need help!",
      "MessageIndex": 5327,
      "PostDate": "26/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Nov 12, 2011 10:45PM mommichelle wrote: Hi all!  So I haven't been reading too much lately, but I think off all of you very frequently.  Hard to believe that a year ago, we were all getting through chemo!  I miss having the time to check out the boards, but I don't miss the reason I don't have time.  I will be honest, there are so many pages I just sort of skimmed the last page from our group.  Lady in Bama - OMG!  Be strong...you have been through so much.  I hope however this situation resolves itself, you are happy.  You really deserve a bit of happiness after everything you have been through. Lizzy - It has been a crazy long road to recovery for you as well.  I hope things get back to normal soon for you.  No more complications!!! Things have been good here.  Been so busy with my 4 and 6 year olds.  Soccer season is over but boy scouts and school are still here.  I have also been going to a ton of doctors appointments.  I am thinking about having the other breast removed in January with an immediate DIEP reconstruction.  Been seeing plastic surgeons and breast specialists.  I am nervous about it, but I know I need to take the other breast off for my own piece of mind.  When I had my mammogram in June this year and then when I had my very first breast MRI a few weeks ago to make sure there did not appear to be any surprises, I was a wreck.  Plus, I have been walking around lopsided for almost a year and a half.  I never got a real prosthetic and have only been using the soft form they sent me from the American Cancer Society.  I am nervous but looking forward to it.  I will feel great to put on a bra and not have to continually move my form around.  No more looking down and realizing it is up near my neck! Wanted to stop in and say hi.  Scouting for food this morning with the cub scouts and then painting the garage.  Hope you all have a good weekend.  You will all remain in my thoughts and prayers!  Hope to pop on more often! Take care and big hugs, Michelle",
      "MessageIndex": 7244,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 5, 2012 03:14PM mommichelle wrote: Lizzie, Thinking about you and hoping you do get to the bottom of this.  It is very frustrating to not have answers, to feel as though something isn't right, but no one can tell you what is wrong.  It is a little reassuring that the MRI was clear.  Have they thought to do another sonogram?",
      "MessageIndex": 7470,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Aug 6, 2012 04:57AM mommichelle wrote: I am so sorry to have been away so long!  Mentally needed the break.  I am super excited about the thought of a chat with everyone.  You guys were such a huge part of me recovering and getting through everything.  Lizzy - glad to hear your surgery is over.  Positive vibes for good followup.  Everyone who is waiting for scans...my thoughts and prayers to you all.  Loving the new pics and I will try to get a new one up as well.  We just returned from the Outer Banks last week, so if I can get my hubby to download the pics, I will find one.  My hair is still super curly and looks alot shorter than it is. Michelle",
      "MessageIndex": 8449,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 8, 2012 11:41PM mommichelle wrote: Hi ladies!  Just checking in.  Lizzy - Hang in there!  You have been through so much - you are a tough cookie!  All other issues aside, how are you liking the new girls? Rachel - Great news on your scans.  It is always so stressful going in for testing! Texas - Hope you got that nap - you sure deserve it!  You are a great mom and you have such a big heart.  Your kids (all of them) are so lucky to have you! Ginger - Thank you for the info on Marybe.  It is so sad. She was truely an inspiration.   Sweeney - I too have been checking in to see how you made out.  I feel such a bond to all of you, it is almost like when one of us has scans, I can't breathe.  I feel like we have all come so far together, when one of us has worry, I hope to be there.  Just as I hope I can come here when I have worries (which sometimes is more times than not).  Keeping you in my prayers. Keeping you all in my thoughts.   Hugs, MIchelle",
      "MessageIndex": 8589,
      "PostDate": "08/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 2, 2011 02:17AM mommichelle wrote: Lizzy - glad you are feeling better.  Sorry you needed to be in the hospital. Texas - So sorry about your sister, hope she is doing alright and hope they put him in jail for a long time. Sue - Sorry rads are making you tired.  I thought you were only starting the beginning of this year.  At least you can say some are already done!  Hang in there. All - Best wishes for a very happy and healthy New Year.  It was not hard to kiss 2010 goodbye last night.  I hope we all feel stronger, healthier and happier in 2011.  Thank you all.  I do not often post, but try to read everything everyday.  My family, friends, and co-workers know about all of you.  You are the only ones who truly understand what this roller coaster has been like and for that, I thank each and everyone of you.  I hope this thread stays around for a long time because I would love to keep checking on how everyone is doing.  Thank you for being there for me when I have needed you, making me smile with all your stories, and know that you are all in my prayers every day.  I have been blessed.",
      "MessageIndex": 4098,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 18, 2011 06:00PM mommichelle wrote: CAL - What wonderful news!  I was having a pretty crappy day and came home to see how you made out, felt sad that you probably wouldn't get your results due to the weather and just checked again and saw the news.  Praise God is right!  Thank you....your news has made my day much better too.  I can't tell you how very happy I am for you, for all of us.  Great news!",
      "MessageIndex": 4472,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 31, 2011 09:28PM mommichelle wrote: Texas - Thinking of you and saying an extra prayer this morning.  Hope all goes VERY well!",
      "MessageIndex": 4653,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Jan 30, 2011 08:47AM mommichelle wrote: We recently moved from a house where we were pretty close to the high voltage power lines, it bothered me all the time we were living there...wondered if my cancer had anything to do with that too?  I can't figure a good reason...no family history, non smoker, non drinker, exersised fairly frequently, a few pounds to loose but nothing crazy.  I guess we may never know why.  Your mom should check it out, LOTS of surviving, thriving ladies on the boards!",
      "MessageIndex": 2,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764153",
      "Title": "stage 4 bc w lung met living near high voltage power lines carm_ps23 meima-Bev"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Sep 7, 2011 04:29AM mommichelle wrote: All, Just dropping in from the August 2010 chemo thread.  I am sure most of you have had at least one treatment (some lucky ones probably already have the first two in).  The first is definitely the scariest...not knowing what to expect.  Losing the hair is hard, but once it is gone, you have a new sense of inner strength.  You can do this!  You will get through it and come out stronger!  Hang in there, stay hydrated, and keep your heads up (or down, in the case you just want to keep your head down and push through it).  Although it seems like time is going slow, you will look back on these days and wonder how quickly they actually passed.  Enjoy your \"golden weeks\" if you are lucky enough to feel fairly normal on your off weeks.  I am thinking about you all and praying for minimal side effects and maximum ass kicking! Hugs, Michelle",
      "MessageIndex": 1377,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Feb 21, 2012 07:39AM mommichelle wrote: benture25, I would agree with you that the staging thing is a little odd.  It is not uncommon for the staging to change, but I would think they would want a complete picture.  I went from stage 0 to stage 1 after my mastectomy when they found a small invasive area.  It is a roller coaster ride.  I too am HER2 positive and was 36 when diagnosed.  Although being younger and HER2 can be bad, herceptin has changed a lot for those of us who are HER2 positive.  The doctor may have said that the cancer was slow growing because it was a grade 1.  There are other characteristics that they look at when determining the grade, like how quickly the cells were multipling.  My cancer was a grade 2 and I think it is a little less common to find HER2 positive cancers with lower grades. Hang in there.  Maye someone could go along to her appointments so all the information is gotten.  It can be very overwhelming.  These first weeks of scans and waiting are the hardest.  Do not get locked into any one diagnosis at this point...things unfortunately (or fortunately sometimes) change.  It is hard because you want to understand what you are dealing with and just when you think you have a grasp on it, it changes.  It will get better! Hugs to both of you, Michelle ",
      "MessageIndex": 1,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/782992",
      "Title": "New to this.... benture25 flash"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Feb 25, 2011 01:50PM mommichelle wrote: For what it is worth, I had my SNB injections a couple hours before the surgery.  For me, the pain of the injections was severe.  I had a nurse on either side holding my hand.  I am a big baby, but also pretty pain tolerant - no pain meds after either of my c-sections or mastectomy (except extra strength Tylenol).  It lasts just a short time, but I was glad to know going in that it wasn't fun.   Best of luck to you!",
      "MessageIndex": 3,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765445",
      "Title": "Question about timing of injection for SNB GabbyCal GabbyCal"
    },
    {
      "AuthorID": "mommichelle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106031/profile",
      "Content": "Feb 25, 2011 01:53PM mommichelle wrote: Lago, They wouldn't let me have anything to numb the shots, said it could interfere with the success of the travels of the dye.  So crazy how they do things differently everywhere!",
      "MessageIndex": 4,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765445",
      "Title": "Question about timing of injection for SNB GabbyCal GabbyCal"
    }
  ]
}