{
  "AuthorID": "Mommyandmor…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201018/profile",
  "Posts": [
    {
      "AuthorID": "Mommyandmor…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201018/profile",
      "Content": "May 30, 2014 06:06AM Mommyandmore wrote: I wanted to address some of the great points that you've all brought up (thank you all for your really helpful posts!). My mom and I have a good releationship and talk about everything except for health issues--at least, she has never shared her health problems with us kids. I've learned about various health issues she has had, but any knowledge has always been after the danger is over. She always wants to present it as old news, nothing to worry about now, honey, it's all OK now. Of course, none of us kids like that approach. Especially now, when I feel like I could have benefitted from knowing more. The reason I say that I only have access to a PA is because I go to an OB/GYN practice in NYC and all the doctors are booked up. I can't get an appointment with any of them until late June. It didn't occur to me to seek out a breast surgeon, I figured I should follow up with the same practice that referred me for the breast sono. Seeking advice from a breast surgeon sounds sensible. Does anyone have recommendations in the Brooklyn/NYC area? Preferably someone who takes Empire Plan UnitedHealthcare. Cost isn't the very first consideration when I'm thinking about this, but I certainly don't have a lot of money to spend. I know that lots of women do have fibroadenomas; however, I do not know for sure that what I have are actually fibroadenomas. Sure, the shape suggests that they are. But at this point, there's no way for anyone to know for sure. I guess my relatively uninformed opinion so far is the only way to know is through more testing or through removal and then testing. One more question that wasn't in the original post: What is the difference between my body producing 5 different tumors within my breasts and a growing/spreading kind of disease? I mean, at what point should a scan of my whole body be done to check if there are tumors in other parts of my body? I've had lots of health issues for a very long time. I can't help but feel that my body has been sending signals that something has been wrong for a long time.",
      "MessageIndex": 9,
      "PostDate": "30/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821518",
      "Title": "Possible fibroadinomas--biopsy, wait, or remove? Mommyandmore Kicks"
    },
    {
      "AuthorID": "Mommyandmor…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201018/profile",
      "Content": "May 29, 2014 08:55PM - edited May 29, 2014 08:55PM by Mommyandmore Does anyone know what kind of biopsy to ask for, if I went that route? A core biopsy?",
      "MessageIndex": 4,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821518",
      "Title": "Possible fibroadinomas--biopsy, wait, or remove? Mommyandmore Kicks"
    },
    {
      "AuthorID": "Mommyandmor…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201018/profile",
      "Content": "May 29, 2014 08:51PM Mommyandmore wrote: Thank you for your reply! I guess I am concerned about waiting because I keep hearing that early detection is key. If no biopsy is done, I have no way of knowing what is really in there...",
      "MessageIndex": 3,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821518",
      "Title": "Possible fibroadinomas--biopsy, wait, or remove? Mommyandmore Kicks"
    }
  ]
}