{
  "AuthorID": "MommyLee5",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270744/profile",
  "Posts": [
    {
      "AuthorID": "MommyLee5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270744/profile",
      "Content": "Mar 14, 2018 06:53PM MommyLee5 wrote: Hello Rhonda! Thank you for your kind words! I am so sorry to hear about your situation. I can’t imagine having to go through it once and now possibly again. I will be praying for you next Thursday! I’m hoping there is a reasonable explanation for my pain but all symptoms lead to that it really could be the big “C” word. I messed up myself up by thinking when I went to get things checked out on Tuesday that my dr was going to say it’s juat hormonal. Now I’m trying to prepare myself for the reality truly could be. I will definitely post how it goes tomorrow. Looking forward to connecting with more strong women like yourself as I walk through this journey.",
      "MessageIndex": 2,
      "PostDate": "14/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863217",
      "Title": "Ultrasound and biopsy tomorrow... MommyLee5 Rondeezee"
    },
    {
      "AuthorID": "MommyLee5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270744/profile",
      "Content": "MommyLee5 wrote: Hello everyone.... I have found myself lurking on this board for the past few day and with the looming ultrasound and biopsy tomorrow my nerves are getting the best of me. A little backstory... for the past month or so I have been having pain in my left breast, on top, near the nipple. I blew it off thinking it was just hormonal. I'm 38, african-american, 5 children (youngest is twins who are 11), and 9 years ago I had a hysterectomy that included everything but my left ovary due to endometriosis. Well the pain kept getting worse. I also noticed for the past 6-8 months my left breast kept growing. On Monday (3/12) I finally decided to call the dr. They had me come in the next morning. My dr did a physical exam and felt hardness, a swollen lymph node under my arm, and some blockage(?). The exam was EXTREMELY painful and he stated he was very concerned. I do not have any discharge from nipple although it does have times where it feels like milk wants to come out. I do not have a fever, and otherwise feel healthy. My left breast is almost double the size of my right one and will once again have to go up in my bra size if it keeps growing. The pain feels like bee stings and is consistent day and night. I have noticed left breast getting darker, and I have more freckles showing everyday on my left breast as well. My dr did put me on antibiotics in the event it is just an infection, but he also did admit he thinks it is something more serious. Iv'e done my research and know this could be IBC. Just scared and ready to find out what it is.... Thanks for letting me vent! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863217",
      "Title": "Ultrasound and biopsy tomorrow... MommyLee5 Rondeezee"
    }
  ]
}