{
  "AuthorID": "MommyErin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
  "Posts": [
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: Background: Stage IIIA and am receiving neoadjuvant TCHP. I will be getting rads. 31 and healthy/fit. Because I'm BRCA1+, I am planning to have a double mastectomy. When meeting with the breast surgeon at MD Anderson, she said she wanted to only remove the cancer breast during the first surgery (skin sparing with TE placement) and do the prophylactic mastectomy during the reconstruction surgery 6-months post rads. Her reason was that prophylactic mastectomies carry a 30% risk of complications, and since she wants me to heal quickly to start rads, minimizing potential complications is to my benefit. Has anyone else gone this route? It seems like it will draw out the whole reconstruction process, but maybe not? Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855019",
      "Title": "Waiting until reconstruction surgery to remove other breast? MommyErin Lisey"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I'm currently receiving neoadjuvant chemo and will have a BMX afterwards (cancer is only in one breast, but I'm BRCA1+). It looks like I will need rads as well. My surgeon wants me to wait on reconstruction because of rads, so she has recommended delayed reconstruction. The cosmetic factor does concern me and I was hoping for a skin-sparing BMX, but of course I want to do what's best for treating the disease. I recently read about \"delayed-immediate\" (reconstruction where just the spacer is put in before rads. It sounds like it doesn't have the same rate of complication as reconstruction pre-rads, but has a better cosmetic result than delayed. Would appreciate hearing from those who have gotten this done and those that have gone the delayed reconstruction route. Why did you decide to wait on reconstruction or not? Are you happy with your results Thanks! Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854629",
      "Title": "Radiation-Delayed or \"immediate-delayed\" reconstruction??? MommyErin MommyErin"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "May 1, 2017 12:13PM MommyErin wrote: Lula73- Radiation can cause issues with immediate natural tissue reconstruction (and the delayed-immediate reconstruction method can be done with natural tissue or implants), so from the research I've done, my options are down to delayed-immediate or delayed. Meg2016- Thanks so much! I will definitely head over to the tissue expander thread and PM you if I think of any follow-up questions. Surgery won't be for another 3 or 4 months. Decisions, decisions.",
      "MessageIndex": 3,
      "PostDate": "01/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854629",
      "Title": "Radiation-Delayed or \"immediate-delayed\" reconstruction??? MommyErin MommyErin"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "May 4, 2017 12:29PM MommyErin wrote: NotVeryBrave- thank you for sharing!",
      "MessageIndex": 5,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854629",
      "Title": "Radiation-Delayed or \"immediate-delayed\" reconstruction??? MommyErin MommyErin"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Aug 10, 2017 02:47PM MommyErin wrote: Carol246, thinking about you and praying your surgery and recovery go well",
      "MessageIndex": 82,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 20, 2017 08:14PM MommyErin wrote: MrsWinnie- I know the thought of a year (or years in my case) of infusions every three weeks is super frustrating, but herceptin is really an AMAZING drug! It (and perjeta, which I hope you'll be getting as well for 6 infusions) have done wonders in increasing survival rates for Her2+ BC. Because I'm metastatic, I'm receiving herceptin and perjeta long-term, but my infusions of just those two drugs are a breeze now that I've dropped the taxotere and carboplatin. I drive myself to and from the infusion appointment, go to the gym that same afternoon. If you haven't already, look up some of the statistics on herceptin and perjeta. You have every right to be upset, and believe me, I've had many a meltdown, but thinking about how beneficial herceptin is has definitely helped me come to terms with it",
      "MessageIndex": 425,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 25, 2017 12:22PM MommyErin wrote: DazzlingEagle- That's great that you could drive yourself! I guess I must be more sensitive to Benadryl than some (plus the olanzapine). Rljessu- I guess if the Benadryl doesn't bother you, then you could drive yourself. Maybe get a ride for the first just in case and if you feel ok drive yourself for the rest.",
      "MessageIndex": 445,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 30, 2017 09:55AM - edited Sep 30, 2017 03:36PM by MommyErin MrsWinnie and Beach2beach- I'm receiving ovary suppression shots (zoladex) and femara (letrozole, and plan to have my ovaries out in November or December. I don't think the hot flashes are that bad, but maybe it's just me. I'm BRCA1+, which increases my risk for ovarian cancer, so that's my main reason for pusuing surgery at such a young age (31). My cancer is ER- and only slightly PR+. It's worth discussing the option with your MO. Welcome, Fanny. How are you doing? ",
      "MessageIndex": 460,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jun 28, 2017 01:03PM - edited Jul 10, 2017 11:11AM by MommyErin Just ordered some button up pajama sets for post surgery! My cousin (who had a BMX last year) said easy on/off tops are a must. Nothing like a little retail therapy to help me cope with a yucky situation! ",
      "MessageIndex": 5,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jul 22, 2017 03:29PM MommyErin wrote: Welcome Cyclegal. Glad you've had plenty of time to explore your options. Because of my gene mutation, I was planning to go the prophylactic BMX route next year, but cancer got me this year. Glad you're being proactive. It sucks to be doing this, but we'll get through it! The support on this site is truly wonderful! So, how's everyone doing? I've pretty much recovered from my last chemo, so I'm just trying to enjoy the next 2.5 weeks...lots of snuggles with my kiddos and gym time since I know both won't happen right after surgery. August will be here before we know it",
      "MessageIndex": 27,
      "PostDate": "22/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jun 25, 2017 04:27PM MommyErin wrote: Hi Candyapple17, Sorry you're in this situation, but glad you found your way here! This site is definitely keeping me sane. Chemo hasn't been fun, but it's straight forward and I'm tolerating it well. And it seems like radiation will be the same. Hopefully you won't need either though! I'm finding surgery to be very overwhelming with all the different options and potential complications. It's hard to decide which approach is \"right\" Definitely enjoy the month of July and get your support system in place for surgery and recovery. Praying for you as welll. Xo, Erin",
      "MessageIndex": 2,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jun 27, 2017 02:56PM MommyErin wrote: Marilyn- Glad you found the right atmosphere and staff for your surgery! I'm currently scheduled for surgery two different places while I finalize surgery plans. Such a difficult decision to make (for me anyway). Candyapple17- Are you planning to have reconstruction done at the time of your surgery? That's been my biggest struggle in making surgery plans.",
      "MessageIndex": 4,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jun 29, 2017 09:20AM MommyErin wrote: Candyapple17- That is a long wait! My goodness! I'm a ball of anxiety without the wait, so I can only imagine. I'm in the same boat with reconstruction...not looking forward to the potential complications and longer recovery, but if I wait I'll be facing the same issues anyway when I do have it done. Cancer has already consumed the last 4 months of my life, so I just want it done and over with. I meet with radiation oncology today. Last piece of the puzzle! Hopefully the they'll ok reconstruction plans.",
      "MessageIndex": 9,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jul 10, 2017 10:28AM MommyErin wrote: Beachmama, I'm so sorry you're getting a progressively worse diagnosis! I truly hope surgery will be the end of it for you. We're here to support you! I totally know what you mean by it not feeling real. Even after 5 chemo treatments, I still have moments where I'm in disbelief that this is really my life. Quick update, my surgery date has moved to August 9th and I've decided against reconstruction (for now) so it won't interfere with radiation and I can heal quickly. I have two young kiddos (4 and 2), so a quick recovery will be better for everyone. I'm not sure how I'll feel being flat for a year+ though. I've heard many women say that their reconstructed breasts feel like accessories more than a part of their body, so I know either way it's a big adjustment. Hoping you all are doing well and enjoying your last few weeks pre-surgery! Big hugs! Eri",
      "MessageIndex": 16,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jul 31, 2017 03:01PM - edited Jul 31, 2017 03:18PM by MommyErin Candyapple17, MarilynIllinois, and HannahRuth- Good luck tomorrow ladies! I'll be thinking about you all and wishing you the best! ",
      "MessageIndex": 38,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Aug 9, 2017 04:12AM - edited Aug 9, 2017 04:17AM by MommyErin Candyapple, so sorry you had such a rough time! I hope the rest of your recovery goes more smoothly! Beachmama and Beach2beach, hope your surgeries went well! Ladynicole, I hope you got your drains working and that your recovery is going well! Pinkvictory, good luck tomorrow! Well, surgery for me tomorrow as well. I had the sentinel node injection today. Not bad. I have to be at the surgery center at 5:30am tomorrow...yuck! Hoping I can settle my mind enough to get some sleep tonight. Hope you ladies are all doing well! ",
      "MessageIndex": 72,
      "PostDate": "09/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Aug 30, 2017 06:37PM MommyErin wrote: Hi all. Took a little break from this site while getting kiddos ready for back to school and all that. Glad to see all the updates. I've been thinking about you all daily and praying for successful recoveries and surgeries for all of you! For those going flat, definitely check out knitted knockers. Mine actually arrived last week. Also, consider joining the private \"Flat and Fabulous\" group on Facebook. Regarding lumpectomy (I can't find who asked the question now), I had one in 2009 and didn't notice a difference in my breast size/shape at all. It probably depends on the size of the tumor though. I've been doing well. Drains came out on day 8 post surgery and I've been back to the gym ever since. My pathology report unfortunately didn't come back clean, but only 3mm of cancer remaining and nothing in the lymph nodes, so I'll take it! I'm still a little sore in the arm and underarm area on both sides (more so in the cancer side though), and the underarm where lymph nodes were taken is numb in spots, but my surgeon assures me it's all normal. I'm doing my stretches and my range of motion is almost 100%. I was supposed to be moving to Houston this weekend to start radiation next week, but that's been delayed for obvious reasons. I'm grateful I wasn't there when the storm hit. So sad :'-( Sending positive healing thoughts to you all!",
      "MessageIndex": 273,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 24, 2017 06:58PM MommyErin wrote: Rljessu- Absolutely not! My MO had me taking olanzapine (technically a drug for bipolar or schizophrenia, but works really well for nausea...also causes major drowsiness) and Benadryl as a premed on chemo day. Knocked me out. I slept through most of my treatments. No way could I drive myself home on chemo days. No problems with nausea, so it was well worth it though!I would definitely plan on getting a ride. Now that I'm just getting herceptin and perjeta and no premeds or anti-nausea meds, I drive myself no problem.",
      "MessageIndex": 436,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 465,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Oct 8, 2017 10:07PM MommyErin wrote: cyclegal- Glad you're feeling better! The numbness under my arm definitely weirds me out too! My PT told my not to shave under the arm where lymph nodes were removed. Anyone else? I'm hoping radiation takes care of all the hair there (silver lining ;-P), but we'll see I guess. Hope everyone is doing well! X",
      "MessageIndex": 471,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Oct 22, 2017 03:30PM MommyErin wrote: rljessu- I did 6 cycles of TCH plus perjeta. In addition to the SE medications you listed, I also took metoclopramide. Between the pre meds and 4 infusions, I was typically there about 6 hours (closer to 8 for the first because they gave everything more slowly). Knock an hour off since you're getting one less drug, but still a long day. I would highly recommend getting the port. I didn't have one yet for my first infusion, and the pain from one of the chemos (T or C...can't remember which one now) was awful (like fire ants biting and crawling up my vein)! That vein in my arm is still visibly bruised and the infusion was in March! Consecutive infusions with the port were pain free! Hang in there! You'll get through it! Hope everyone else is doing well! I have 3 radiation treatments to go and then I'm done with major cancer treatments. Just continuing my herceptin and perjeta forever. I feel like my life has revolved around cancer treatment for the last 6 months, so it's going to be weird going back to \"normal\". I'm sure it'll be a huge relief (and great for my kiddos and hubby) but a big shift none the less.",
      "MessageIndex": 491,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 527,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Aug 3, 2017 03:53PM MommyErin wrote: MarilynIllinois,thanks so much for the update! It's so good to hear that you're doing so well! That's so reassuring. I hope you're recovery continues to go smoothly and that you get your tubes out in no time. Big hug",
      "MessageIndex": 49,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Aug 3, 2017 04:13PM MommyErin wrote: SLOlof- Welcome. I hope you get the answers you need tomorrow so you're comfortable with your surgery decision. I've gotten second opinions for every part of my treatment and have found it so helpful! While most of my doctors have been in agreement about my treatment plan, my radiation oncology consults we're night and day, so I'm so relieved that I got that second opinion so I can have treatment where they actually know how to treat my (complicated) case. Carol246- Welcome. I hope you found the link AliceAgnes shared helpful. Im not looking forward to the drains either. I'm hoping to have them out after a week, but we'll see. Well ladies, I've begun surgery prep. Yesterday I had a locator placed in the lymph node that was biopsied for my initial diagnosis so the surgeon knows which node to take during surgery. That was quite the ordeal. I've already had chemo, so my nodes are clear, and the clip my surgeon placed during the biopsy doesn't show up on ultrasound, so placing the locator became a 2 hour plus process with mammograms and a second clip being placed just to find the lymph node. My care team was so sweet and apologetic though. Im definitely looking forward to being on the other side of surgery. All the \"what ifs\" are starting to stress me out. Thinking of and praying for you all!",
      "MessageIndex": 50,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Aug 10, 2017 03:43PM MommyErin wrote: ladynicole, so sorry about the virus, but glad the drains are working! My surgeon doesn't want me lifting my arms above my shoulders until the drains come out, so I'm hoping my ROM will be good. My surgery sites aren't bothering me either...just my underarms and pec muscles occasionally. Hope your virus clears up quickly",
      "MessageIndex": 84,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Aug 13, 2017 06:42PM MommyErin wrote: rljessu- I'm sorry you're in this situation and feeling so afraid of the surgery. As I said in a previous post, I've been pleasantly surprised by how much better it's been than what I expected. I went flat as well. Pain has been minimal. I can empty the drains myself, no problem. The vest is annoying though. I do have help right now because we have two young children at home and my husband couldn't take off work, but if it weren't for the kids, I'd have no problem caring for myself without help. The only issue I've run into is getting something off of a high shelf, so I would make sure before surgery that everything is accessible and not higher than shoulder height really. I hope your surgery goes well! Regarding her2, I had my first infusion of herceptin and perjeta without chemo a week and a half ago. It was a piece of cake! If your MO is recommending the full year of herceptin, I would consider it just to be on the safe side. Sending positive thoughts your way",
      "MessageIndex": 110,
      "PostDate": "13/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 124,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 217,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 13, 2017 06:07PM MommyErin wrote: Lsunshine- So sorry to hear your first night was so rough! MrsWinnie- So, no chemo? That's great news! LisaBS- I'm so sorry about your bad news! I hope your PET scan comes back clear. As I said to MrsWinnie, chemo is very doable and the side effects are well managed. And I love my port! It makes the infusions so much easier. Big hug! KatjaNL- Glad you found us! Sorry you're in this situation though. That's a tough decision. Do you have young children? How is your support system? Ruthfromberkshires- Glad to hear your positive news! Take that time you need to recover! One step at a time. If you are wanting to make some changes going forward, I second reading the book Anticancer by Dr. Servan-Schreiber. It's a good read and presents a lot of research on positive dietary changes to make as well as other things to do. As Alice mentioned though, it can be a bit overwhelming, and the book was written before nitrate free processed meats were readily available, for example, so some of the recommendations aren't really up to date. I was also a little annoyed by how much emphasis the book places on our lifestyle being at fault for cancer. I know it plays a role, but I've always been a healthy eater and very active, so I'm sorry, but my BRCA1 gene mutation is responsible. Period. That said, I think reasonable dietary changes can be beneficial to overall health. I've added green tea and turmeric tea to my regular diet, I try to choose foods high in antioxidants, and I limit sugar as I've read enough about the role of blood sugar spikes and insulin in feeding cancer to see that as an important change to make. Everything in moderation ;-) WellWishes- Great news! Rljessu- So sorry you're looking at chemo and rads! The Her2+ targeted therapies are amazing though! It's my understanding that PETs are really only done if they're pretty sure the cancer has spread to your lymph nodes. In my case, they knew without a doubt my nodes were positive (biopsy) when I was first diagnosed, so I had one done early on. Some major cancer centers don't really use PETs at all though (MD Anderson) and instead do locally focused MRI and CT scans if they're concerned about metastasis. Cyclegal- I've gotten second opinions at MD Anderson on EVERYTHING! There, they automatically request the tissue samples to test themselves. I'm not sure how it works elsewhere though. Beach2beach- I'll help you keep it bumped :-)",
      "MessageIndex": 368,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 13, 2017 06:12PM MommyErin wrote: Well, I've had some cording! Bleh! If any of you feel like a taught rope/cord is running through your underarm, get it checked out. I've had one PT session and the massage snapped the largest cord. It's much better, but still work to be done. Fortunately it's not affecting my range of motion. Radiation was pushed back due to Hurricane Harvey, so I start tomorrow afternoon. I'll keep checking in periodically to see how you all are doing!",
      "MessageIndex": 370,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 372,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 403,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 434,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 25, 2017 10:10AM - edited Sep 25, 2017 10:10AM by MommyErin rljessu- I hope my post didn't seem harsh! When I wrote it, I was hyped up on cold medicine and flashing back to being knocked out in my chemo recliner ;-P So sorry to hear about the shingles! I hope you get some answers today! Xo ",
      "MessageIndex": 440,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Apr 7, 2017 12:13PM MommyErin wrote: Thank you, Laurie! That is so very reassuring! So glad to hear you're still NED after 6 years! I started reading about ablation right after I posted this so I think that's at the top of my list now if chemo doesn't take care of this. Out of curiosity, did you have a mastectomy and are you still getting herceptin every 3 weeks? What about perjeta? (I noticed you're Her2+) Thanks again! Erin",
      "MessageIndex": 2,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/854043",
      "Title": "Oligomets and liver resection: any success stories here? MommyErin Lauriesh"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I've been diagnosed with stage IV metastatic BC de novo with 2 small (2cm) mets to the liver (low tumor burden). Since I'm HER2-positive, my onco is starting with TCHP treatment and has mentioned the possibility of achieving NED status (after only one treatment, the formerly palpable breast lump is gone, so the treatment appears to be working so far). I'm young (31) and in excellent health otherwise (no comorbidity) so I want to throw everything at this disease that I can. So, if chemo doesn't take care of it completely, I'm open to exploring local treatments. Curious if anyone has gone through a potentially curative liver resection and their experience with it. Thanks! Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/854043",
      "Title": "Oligomets and liver resection: any success stories here? MommyErin Lauriesh"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jul 29, 2017 04:55PM MommyErin wrote: Welcome HannahRuth, I'm sorry you're in this situation but glad you found us. Congrats on your son heading off to college! Exciting times! I'll be traveling 4 hours away 2.5 weeks after my BMX for some followup appointments at MD Anderson. You may be limited in how much you can help with the actual move, but I think going is doable. I'm hoping/planning to have the drains out after a week, but I'm also going flat (no reconstruction), so not sure if that makes a difference. I would plan on making the trip knowing you may need to change plans if an issue comes up. Good luck on Tuesday! I'll be keeping you in my thoughts. Xo, Erin",
      "MessageIndex": 33,
      "PostDate": "29/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 186,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 341,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 13, 2017 06:08PM MommyErin wrote: MrsWinnie- Just saw you're update! I hope everything is ok",
      "MessageIndex": 369,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 20, 2017 08:16PM MommyErin wrote: katjaNL- Oh no! I hope you get positive news from your scan",
      "MessageIndex": 426,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 496,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jul 18, 2017 04:13PM MommyErin wrote: Hi ladies, I've really appreciated reading your posts. I was diagnosed stage IV de novo in March with two small mets to the liver. My mets were found via PET scan, but never confirmed with biopsy as they were gone after two rounds of TCHP. I completed my 6th cycle of TCHP last week and my PET a month ago was clear. I have surgery and rads coming up, and will be on Herceptin and Perjeta long-term. Fingers crossed my liver remains clear. I'll definitely be following this thread and wishing you all the best",
      "MessageIndex": 5400,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 24, 2017 03:33AM MommyErin wrote: So sorry you're in this situation! I did 6 rounds of TCHP starting in March and it wasn't fun by any means. My last was mid-July and I've been getting herceptin and perjeta infusions every three weeks since. They're a breeze! I drive myself to and from the appointments and have even gone to the gym the same day afterwards. Granted, I am 31, but really, they're not bad at all once the heavy duty chemo is off the table. Come over to the herceptin/perjeta thread and chat with us. Some have stoped at 4 THP infusions and then continued with the more manageable HP and saw additional shrinkage. The targeted therapies are definitely worth considering. https://community.breastcancer.org/forum/8/topics/... ",
      "MessageIndex": 7,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/858652",
      "Title": "Stage 4 triple neg now her+ new primary embmom MommyErin"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jun 28, 2017 05:44PM - edited Jun 28, 2017 05:44PM by MommyErin MarilynIllinois, my cousin said she had an apron for her drains, so I'll probably go that route as well. Haven't really thought ahead to the not fun stuff yet :-P.",
      "MessageIndex": 7,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jul 7, 2017 09:12PM - edited Jul 8, 2017 10:16AM by MommyErin Lsunshine, sorry you're in this situation but glad you found your way here. Bing BRCA1+, I was being screened every 6 months. Now that I have cancer, I wish I had had the BMX years ago. I'm only 31 though, so had no idea I would get cancer so young. Getting a mastectomy is a very difficult decision, but I agree with your husband; we can live without our boobs. So, it looks like I'll be getting the BMX without reconstruction now. After meeting with a radiation oncologist, it's the best route for me to take. I'm looking forward to an easier recovery, but going a year+ without boobs is going to be an adjustment. How are you all doing? I have my last chemo infusion next week, so I'm reallyglad I'm almost done with that part.",
      "MessageIndex": 13,
      "PostDate": "07/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Jul 31, 2017 02:52PM MommyErin wrote: AliceAgnes- Welcome. It's nice to see a familiar \"face\" from the March chemo group. I hope you recover quickly so you can move on to surgery. Brightness456- Welcome. So sorry you're in this situation, but I'm glad you found your way here. While I'm generally a positive, cup is half full kind of person, I agree that you need to feel and talk about the scary thoughts as well where this nasty disease is concerned. You're in good company here. We'll listen, positive or scary. I'm 4.5 months out from my initial diagnosis, so the shock has worn off, but I still have moments where it all feels very surreal. Hang in there! Sweet_Pea- Sorry you're here, but welcome. I'm definitely starting to feel overwhelmed as well. Surgery isn't until next week, but between various surgery pre-op appointments, MO, and my Herceptin and Perjeta infusion, I think I have 5 appointments this week alone. And I've had a lot of time to mentally prepare. I can only imagine how overwhelming it must be for you on such short notice! We're here for you! ",
      "MessageIndex": 37,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Aug 9, 2017 11:15PM - edited Aug 10, 2017 12:19AM by MommyErin So far so good, ladies! I've been home about 5 hours now and pain has been manageable. Hoping sleeping won't be too uncomfortable tonight. I've manage to avoid over exerting myself (which I was worried about with a 2 and 4.5 year old, but they've been good). I got the nausea patch as well as zofran before surgery this morning, so no nausea so far (knock on wood). I'm honestly just so relieved to have it over with. What I expected was definitely worse than what it's turned out to be so far. Thankfully, my lymph nodes (3) all teste negative for cancer (yay chemo!), so I avoided an ax dissection! Sending positive thoughts and prayers to all of you ladies! Beach2beach- Good name choice ;-) I think Erin must have been a fairly popular name in the 1980s...all the Erin's I know were 80s babies (myself included). I'm sure it was very hard telling her. My kiddos are young enough to not fully get it, but prepping my 4.5 year old for my hair loss and now surgery was definitely hard. Same day sentinel node injection sounds awful! Will you get to go home today? Hope you're doing well! Beachmama- Wow, you're brave! I don't think I'll be ready to look until my followup next week :-S Are you home now? Hope you're feeling well!",
      "MessageIndex": 78,
      "PostDate": "09/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 155,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 248,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 279,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 310,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "Sep 18, 2017 07:36PM MommyErin wrote: Beachmama- I would definitely look into a third opinion! Ask them to request your pathology slides so they can look them over. I had a close margin which has added 2 (possibly 3) days to my total radiation treatment. So far radiation has been a breeze (granted in only 2 days in). Definitely consider all your options and weigh the pros and cons of each. It suck being in limbo (I was there for a while surgery and radiation wise). Get all the info and opinions you can! Mamabear80- So sorry you're joining us! I hope your surgery went well. I have a crazy family history too and am BRCA1+. I was diagnosed this past March at age 31 (youngest in my extended family). Cancer sucks at any age, but being in the under 40 club definitely brings its own unique challenges and stresses. I am taking femara now (tamoxifen for post-menopausal) since my MO is shutting down my ovaries with zoladex and I'll be having a oophorectomy/hysterectomy later this year. Despite it only lowering likelihood of recurrence by a small percentage, being so young, I'm willing to try anything to keep this disease gone! Rokel- Great news! Sweet_Pea- Hang in there! I'm no help in the TE department, but hoping it gets easier for you soon! LisaBS- Glad you're through your second surgery! I totally feel you on the never ending roller coaster. Big hug! I hope you get good news! Rljessu- Add me to the \"never watched GOT club,\" lol. Mrs.Winnie- So sorry to hear that! I'm Her2+ as well and have been through chemo. Feel free to PM me if you want to talk treatment SEs and whatnot. It's not fun, but it's tolerable. I'll be thinking about you. Well, started radiation on Thursday and it's a breeze compared to chemo and surgery. 6 weeks to go though, so we'll see. Big hugs and positive thoughts to all of you",
      "MessageIndex": 409,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "MommyErin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248506/profile",
      "Content": "MommyErin wrote: I wanted to start a thread for those of us going through surgery in August so we can support each other through the whole surgery process. I'm scheduled for surgery August 8th (though that may change). Still in the process of finalizing my surgery and reconstruction plans. I meet with a plastic surgeon today. I'll be getting radiation after surgery, so that complicates things a bit. I'm BRCA1+ and will be having both breasts removed, but I haven't decided if I want to wait and do the prophylactic side when I do reconstruction, or take care of them both in my initial surgery. Dx 3/14/2017, Right, Stage IV, metastasized to liver, ER-/PR+, HER2+ Chemotherapy 3/21/2017 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 8/9/2017 Mastectomy: Left, Right Radiation Therapy 9/28/2017 Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 558,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    }
  ]
}