{
  "AuthorID": "MommaB24",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249410/profile",
  "Posts": [
    {
      "AuthorID": "MommaB24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249410/profile",
      "Content": "Apr 10, 2017 04:51PM MommaB24 wrote: Raven- my TE's haven't been expanded at all yet. This Friday will be my first fill. 6 weeks after my BMX. If I don't get chemo and go straight to rads, the PS won't be able to fill the right TE because of the damage to the tissue. So at this point, I'm praying for chemo (wait, what?) so they can push through my fills prior to rads. The RO says I need to be doing some sort of therapy chemo/rads/hormone blockers to keep any stray cancer cells from growing. I'm still adjusting to the fact that I have cancer😕 This can be so overwhelming at times",
      "MessageIndex": 733,
      "PostDate": "10/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "MommaB24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249410/profile",
      "Content": "Apr 7, 2017 12:46AM MommaB24 wrote: hello to all my sisters on this crazy journey. I'm new to all of this. Diagnosed in January, all tumors were supposed to be under 4 cm. Surprised after March 3 surgery to discover one measured 13 cm😱 Still waiting on oncotype, but I know radiation is in my future. Still trying to wrap my head around the craziness. Lymph nodes were negative as well as bone scan. Waiting to get CT scan next. Nice to know I'm not alone",
      "MessageIndex": 681,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "MommaB24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249410/profile",
      "Content": "Apr 8, 2017 05:21PM MommaB24 wrote: oh ladies ❤️ Sending hugs and prayers for all fighting infections. After my dmx my incisions weren't healing and I had to do debridement. I'm over a month out and haven't had a fill. Get my external stitches out next Friday and my first fill. Saw the RO on Friday. Said he wants to radiate my right chest wall and lymph nodes. Catch 22, I haven't had fills yet😕 So now I'm hoping I need chemo or I won't be able to use these silly TE's. Two steps forward, three steps back. Getting my CT scan on Monday. It's a blessing to share this journey with you all. This sometimes feels like a lonely road",
      "MessageIndex": 712,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "MommaB24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249410/profile",
      "Content": "Apr 10, 2017 04:36PM MommaB24 wrote: big hug Lisbeth❤️ I had to fire my first oncologist because I felt he was preoccupied!! I'm praying for a speedy recovery and that you get to feeling better soon!!",
      "MessageIndex": 732,
      "PostDate": "10/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    }
  ]
}