{
  "AuthorID": "mommarobin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94665/profile",
  "Posts": [
    {
      "AuthorID": "mommarobin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94665/profile",
      "Content": "Dec 20, 2009 01:55AM mommarobin wrote: Thanks for the input.  I've been searching posts here & I really think I should request (demand?) a biopsy.  I'm in MS & they have a program here that for the mammogram & all treatment, if needed (thhat's what they're telling me anyway).  If you're diagnosed, they automatically put you on Medicaid.  I know my breasts & the particular mass in question is not what I usually feel.  I'm used to the fibrocystic lumps that come & go, but I haven't had any of those since I went into menopause.  This one is about the size of a pea & hard.  But it doesn't hurt.  I don't think I have much of a family history(an aunt on my dad's side & a great aunt on my mom's).  The different things I've read are indicating that this \"BiRad 3\" rating is a bit of a gray area & used when it shouldn't be. My prayers are with those everyone here.  I am so glad this forum is here-I don't feel quite so helpless & hopeless now.  It makes it seem not so frightening!                                         ",
      "MessageIndex": 4,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/745587",
      "Title": "Concerned with Report mommarobin mommarobin"
    },
    {
      "AuthorID": "mommarobin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94665/profile",
      "Content": "mommarobin wrote: I had a mammogram & ultrasound on Wednesday for a mass I found in my left breast.  I had found it quite a while ago, but with no insurance, I had put off getting it checked.  The radiology report says \"in the tail region adjacent to the chest wall, there is a small nodule that has a slightly lobular contour, with its margins well circumscribed.  It has a questionable fatty hilus.  Suspect it reflects a small lymph node.\"  The other two masses (I didn't know they were there) appear to be a small cyst & a benign appearing nodule that likely reflects a fibroadenoma or lymph node.  The Bi Rads is Category 3-short interval follow-up (6 mos) suggested.  I'm not sure that I'm comfortable waiting for 6 months.  I've never had anything like this show up on a mammogram before.  Is it customary to let it go for that long?  The place I went to get the mammogram is in a small, backwards town & that somewhat bothers me.  Anyone have any advice?  Am I just being paranoid? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/745587",
      "Title": "Concerned with Report mommarobin mommarobin"
    }
  ]
}