{
  "AuthorID": "Mommygg19",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
  "Posts": [
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Mar 10, 2012 11:10AM Mommygg19 wrote: Bessie and coolbreeze thanks so much for you responses. In my head I know there is more of a chance that this is nothing to be to concerned about but that little bit of fear creeps in. I have a lot of questions for the doctor on Monday and I am hoping to feel better after talking with her. I think first hearing that everything was ok and the getting a call back is sort of what has thrown me for a loop. Prior to my MRI it sounded like she wanted to do needle biopsy but now wants to do an excision so that also makes me a little more nervous (although my sister said the excision hurt less than the needle biopsy). I really really can't say enough about the amazing strong women on this board. I was afraid to post for a while because I feel like all of this is nothing compared to what so many of you have been through... Thanks again for the advice and support!! :)",
      "MessageIndex": 3,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783918",
      "Title": "What was your BIRAD score prio to diagnosis? Mommygg19 hawaiik"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Apr 1, 2012 05:17PM Mommygg19 wrote: Lumpectomy of breast and 1 lymph node removed last week. Now just waiting for pathology. Thanks for your posts and support!! Jen:)",
      "MessageIndex": 6,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783918",
      "Title": "What was your BIRAD score prio to diagnosis? Mommygg19 hawaiik"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Mommygg19 wrote: Hi! I have been lurking here for awhile. My sister was diagnosed with breast cancer, very early DCIS hormone receptor+, and had a BRCA negative gene test late last year. I have had a lump/ thickening for about two years which they have just been watching due to my age (32) and previous lack of family hx. Last month they did a full work up MRI, US, mammo. I apparently have very dense breast tissue and the first reports came back all clear on all of the tests. A few days later I received a call saying I could come in for follow/biopsy anytime or have another MRI done in 6 months. Apparently they did see something in the area I have been feeling although it appears benign on the MRI with a BIRAD score of 4. My doctor is awesome and I have an appt scheduled to discuss biopsy on Monday. I have been fine with all of this but the reality that If the biopsy is abnormal -my life could totally change has been freaking me out. My sister's doctor did not expect to find cancer on her biopsy either so my question for all of you wise and brave women is what was your BIRAD rating/doctors impression prior to your diagnosis? How often are those scores wrong or can I stop worrying?? Thank you so much in advance! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783918",
      "Title": "What was your BIRAD score prio to diagnosis? Mommygg19 hawaiik"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "May 2, 2012 04:31PM Mommygg19 wrote: Hi my results were benign! I am high risk due to family hx. I am hoping that next years scan looks less scary! Thanks for all the support!!",
      "MessageIndex": 9,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783918",
      "Title": "What was your BIRAD score prio to diagnosis? Mommygg19 hawaiik"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Mommygg19 wrote: Hello again everyone!    My appt with the brest specialist is in the AM. We will be discussing the results of my MRI that they saw something on in the area I feel a lump. We also we be discussing the plan for biopsy. As all of you have been at this point in the past I wondered what questions would be the most important to ask? I just want to leave there feeling like I know everything I need to prior to surgery and that I am as informed as possible. Thank you all so much! :) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783997",
      "Title": "What questions should I be asking tomorrow? Mommygg19 Jessika"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Mar 12, 2012 06:17PM Mommygg19 wrote: Well I am scheduled for a biopsy to remove 2 masses and a lymph node. I think I will feel a lot better once they are out!! Thanks for the support!!",
      "MessageIndex": 1,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783997",
      "Title": "What questions should I be asking tomorrow? Mommygg19 Jessika"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Mar 14, 2012 10:14PM Mommygg19 wrote: Thank you. I have two masses that are both palpable so they are doing an excisional biopsy with twilight sedation. I feel very confident in my doctor and I had hoped my tests would come back benign looking enough to avoid this but I am also grateful that if something is going on we hopefully are catching it as early as possible. Good luck to you Jessika ... I hope you get the guidance you need to make the right decision and that results are benign. :)",
      "MessageIndex": 3,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783997",
      "Title": "What questions should I be asking tomorrow? Mommygg19 Jessika"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Mommygg19 wrote: Hi! I am not new to the boards but found them to be an awesome support a few years ago. I was here before in March 2012 when I had a biopsy of two areas that were benign. I am high risk due to my sister being diagnosed at age 42. She currently is on Tamoxifen.  I have a 3 children and am still nursing my youngest. I found a decent sized lump 2 cycles ago. I ha a mammo w extra views and an US. They can see a multicystic area on the US and a nodule on one view of mammo but not the other although limited due to density of my breasts and lactation status. Radiologist recommends MRI due to high risk etc but scored it BiRads 2. (Yes I am reassured by this! My last MRI was Birads 3 and led to biopsy also for palpable lump) I saw my previous breast surgeon who was reassuring but cautious. She does not want to miss anything and recommended I stop nursing and then follow up a month after lactation ceased if lump still there at which point she would do an MRI. Just looking for advice from any other women in the same situation or who were diagnosed while pregnant/nursing. My husband doesn't like the wait and see approach and my daughter does not want to stop nursing so it has been difficult trying to wean her and I fear it may take a few months to actually stop lactating.  I would truly appreciate any advice from others! Thanks!  Jen  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823430",
      "Title": "Breastfeeding and persistent lump :( Mommygg19 Mommygg19"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Aug 7, 2014 11:49PM Mommygg19 wrote: Anyone out there diagnosed while nursing? Or Mods do you have any advice on what the best course of action is for nursing/pregnant mom with suspicious lumps or where to find more information? Thanks so much! It definitely makes me nervous to wait even though I know chances are that it will be benign.  Jen",
      "MessageIndex": 1,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823430",
      "Title": "Breastfeeding and persistent lump :( Mommygg19 Mommygg19"
    },
    {
      "AuthorID": "Mommygg19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145819/profile",
      "Content": "Aug 10, 2014 02:17PM Mommygg19 wrote: Thank you mods! Both my husband and I also felt we \"shouldn't wait\". My daughter is really having a hard time weaning an it breaks my heart to stop if we don't really need to. It would also mean waiting a few months to even get the MRI even if I stopped nursing completely today. I will discuss this with my doctor this week. I am reassured that she didn't rush to biopsy but I also wonder if that is not the direction that they should head in if they really can't tell from imaging at this point due to my breast density/lactation. Thanks so much for the link to the article!  Srh242 ... I am sorry that they didn't do anything sooner. I also appreciate the advice coming from someone who has also gone through this.  Jennifer ",
      "MessageIndex": 4,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823430",
      "Title": "Breastfeeding and persistent lump :( Mommygg19 Mommygg19"
    }
  ]
}