{
  "AuthorID": "mommakat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
  "Posts": [
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Sep 16, 2017 07:59PM mommakat wrote: I'm so sorry! Sounds like it's small and caught early. Sending you positive thoughts",
      "MessageIndex": 7,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858570",
      "Title": "Spiculated mass on mammogram and us Quinian Quinian"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Apr 10, 2018 12:44PM mommakat wrote: I don’t have a magic answer for you, but I’m right there with you! Boards 4 areas in both for me, and I have to wait a whole week for biopsies. This happened to me last year too. The waiting is horrible. A million times a day I go from totally fine, go about my business like nothing is wrong, and then I find my self obsessively thinking or google. Try staying busy, exercising, wine? Lol. I haven’t found a perfect solution, but you’re not alone! Hang in there. Worrying wont change a thing",
      "MessageIndex": 1,
      "PostDate": "10/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863865",
      "Title": "biopsy scheduled MaryB66 Kimi89"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 17, 2017 06:50AM mommakat wrote: Hi Justbeat, That's reassuring to know...I wish they could tell us everything at once. Hoping you get your results soon, and that they're B9. I guess the moral of the story is expect alot of uncertainties and follow up testing. Sending you positive thoughts and energy xo ",
      "MessageIndex": 2,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856932",
      "Title": "Discordant Results from CNB mommakat MTwoman"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "mommakat wrote: Hi Ladies, Anyone ever had the radiologist tell you they believe the biopsy results are discordant with what they saw? From what I read it seems like they think it's a false negative? I have a follow up with a BS scheduled already because of finding PASH, but that's not until 8/10. It's been a week since they called and said the CNB results were B9. And she just called today. Happy they want to look into it, but now I have a month to wait and wonder. Anyone else have this experience? Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856932",
      "Title": "Discordant Results from CNB mommakat MTwoman"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Apr 19, 2018 06:10AM mommakat wrote: congrats on the b9 results",
      "MessageIndex": 9,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863695",
      "Title": "Waiting on Biopsy Result AlyssaRN4 mommakat"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 18, 2017 08:29AM mommakat wrote: Sorry you're going through this Jennmommi! I'm in the waiting phase with you, and it is SO hard. And having a support system is so important. Lean on this group for sure, and I'm happy to listen anytime. Feel free to private message me. I'm in the middle of the process. I didn't find anything, but went in for my FIRST mammo at 40, like I was supposed to. I actually went the week my mother in law passed away, which was crazy but I didn't want to change the appt. So they called me back the day my daughter was graduating to tell me they needed to screen my right breast again because it was dense. I was pretty cool then. Had the 2nd mammo and had to wait about half an hour, when they told me they wanted to do an US. They did that right away, and decided they wanted to do a core needle biopsy of the area. That appointment I couldn't get for 2 weeks. Had that done, waited 4 days and got b9 results (yay), but then the next day my gyn sent me a note that she saw PASH in my results and thought I should see a surgeon for a 2nd opinion and maybe have that removed. I was still OK, and the surgeon couldn't see me for a over a month (so 8/10). I was still cool. Then last week the radiologist called and said she didn't like the pathology results, felt they were discordant with what she saw, and I should see a surgeon and she was going to recommend having the area removed. So from my first mammo to the surgeon appt is like 2 months! And I'm reading like crazy, and have convinced myself I do have cancer and they missed it on the biopsy. Waiting is awful. My hubby is good, but only for coming to appts. I don't think anyone realizes that we really need support all the time, because it's ALWAYS on my mind. Sometimes in the back of my mind, sometimes it's all I think about. I also have anxiety attacks usually, and it's MUCH worse right now. My mom also just moved in with me too, which is NOT helping at all. And everyone in my life is just going about their normal day, completely not acknowledging that this is looming. I'm so sorry you have to wait, but like NotVeryBrave mentioned, even if it's malignant, nothing is going to change much in a few weeks. But it doesn't help your mental state at all. I would talk to your doctor. Maybe if she can explain to the center that you have severe anxiety and need to be seen sooner. You don't want this to cause long term damage at work or home. I was a basket case yesterday at work and literally was biting people's heads off. It was awful. Today, I'm much calmer (of course I took Xanax with breakfast, so that helps lol). Just know you're not alone. There's a whole bunch of us here, stuck waiting with you. Sending you hugs and positive thoughts!  ",
      "MessageIndex": 3,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857080",
      "Title": "Scared and alone Jennmommi nikmar"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 19, 2017 06:58PM mommakat wrote: I haven't had a cyst experience but am in here waiting for discordant results to be sorted out. Waiting is hard. I'm glad you got checked and it seems to be moving quickly. One way or another, it's good to get answers. Best of luck! Sending you calming positive thoughts. Keep us posted",
      "MessageIndex": 3,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857128",
      "Title": "Is this really happening? MountainLife MTwoman"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 31, 2017 04:06PM mommakat wrote: Waiting is the worst! I'm sorry you're in pain and worrying. I have been waiting a long time for my next appointment / next step, so feel you're frustration. The woman here have great advice for how to pass the time, and when they work, they're great! But sometimes, the waiting can be so mentally draining. Hang in there. Try not to over analyze or google too much. There isn't much you can do to change the next 6-7 days now. Breathe. Try to relax. Easier said than done. Good luck and hang in there! ",
      "MessageIndex": 2,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857469",
      "Title": "WORRIED!!!!! Pls read and reply to this post. Thank you. ainazulaikha proudtospin"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 14, 2017 11:38AM mommakat wrote: Sorry you're in the waiting game! I guess I'm with you on being happy your dr was so blunt. I had a core needle biopsy on 7/3. It was an uncomfortable procedure, but they do numb the area so technically I didn't feel it. The extended squeezing time in the mammo machine was bad though. My breasts were really tender based on my cycle though, so that probably didn't help. Sports bra, tylenol and ice packs helped. I was pretty sore for a few days. And even now, I'm achy in my breast. Not sure if it's still bruised, or what, but it's just achy. I waited 4 days for results, which they said were B9. Then the next day my GYN said she wanted me to see a BS anyway, because my biopsy showed PASH. I've learned this is non cancerous but can grow so they might want to take it out. Then just this morning, my radiologist called and said that the doc there felt my results were discordant, and I should see a BS to have the area removed. I've been looking that up and I think it basically means she thinks it's a false negative result. Anyway, my point in sharing is that I'm learning this journey of tests and results isn't always a straight line, and the waiting is hard. And the not knowing is making me crazy too. It's been a roller coaster of clear, not clear. My surgeon appt isn't until 8/10, so I have a month to ponder and stew before I learn anything knew. Good luck and this community has been super helpful for information and just having a group of women who have been through it and are going through the waiting too.",
      "MessageIndex": 1,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856926",
      "Title": "DONT know what to think liddybug mommakat"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Apr 19, 2018 09:00AM mommakat wrote: hi Taddyallen, just wanted to let you know that I had this happen last year. Freaked me out! I ended up with a surgical biopsy, and those results were b9. Best of luck",
      "MessageIndex": 15,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863913",
      "Title": "Everything is happening so fast Taddyallen mommakat"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 26, 2017 08:56AM mommakat wrote: Hi BadGirl, I am with you! I'm 40, just had my first mammo last month and have been going through the ups and downs of the follow ups since. I too am usually tough, handle everyone else's everything and this has thrown me more than I thought it would. I definitely think the not knowing and the long waits are the worst. Naively, I assumed this would be a straightfoward experience...get a mammo, all good. Or get a mammo, need a f/up, get a biopsy, and a yes or no. For me, it's been a convoluted up and down. But it takes SO LONG! Checking in here helps so much, to know we're not crazy, not alone and not overreacting. The women who have experience are super helpful answering and giving good advice, and I find comfort with the others here in limbo. Hang in there!!!!  ",
      "MessageIndex": 6,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857330",
      "Title": "I am stronger than this...I thought! badgirlontheright Jadiebaby"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 8, 2017 03:07PM mommakat wrote: hi,  I was just diagnosed with pash too. Calling for an appointment with a breast surgeon on Monday. The area in question on my breast was 5cm. I'm hoping that having it removed doesn't leave me lopsided. Did they talk about checking your other breast for pash cells by any chance?  Glad your troubles are done! Everything I read says there is hardly any chance that pash recurs sonhopefully you're out of the woods",
      "MessageIndex": 79,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797815",
      "Title": "PASH - Pseudoangiomatous stromal hyperplasia gillianinnh djmammo"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 24, 2017 09:16AM mommakat wrote: Hi Christine, I'm surprised they didn't want to at least do a biopsy too. As NotVery said even if they are 100% b9, as they very likely are, they're not supposed to be happening or causing you pain. Good for you for being an advocate for yourself and getting the 2nd doctor involved. Go for the mammo and see what they say. Hopefully being at a breast center, they'll give you some more attention. Dismissing you and your symptoms because you're too young to have cancer isn't fair. There are plenty of other breast conditions that can cause pain and symptoms, and though not life threatening, deserve to be looked into. Hang in there and keep us posted!",
      "MessageIndex": 2,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857289",
      "Title": "Odd symptoms, mammogram this Friday Christinepor1 MTwoman"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 23, 2017 05:11AM mommakat wrote: jj I'm so sorry you have to go through all of this. It's not easy to be taking care of everyone. I can only speak to the biopsy recovery from personal experience and I was ok. Sore for sure, but a couple of ice packs and Tylenol and I was all right. I minimized moving around too much but I probably could have. As for anything else you have ahead of you, could you see if your hospital or county offers some services? My mother in law had ovarian cancer and there was a social worker that assessed her needs. Not just her medical needs but overall support. It sounds like you could really use some in home help for a few weeks spending on your treatments and surgeries. It may be jumping the gun now, since it sounds like you're not officially diagnosed but maybe start looking into now. For peace of mind anyway. I know waiting causing all kinds of anxiety for me and I don't have nearly all of the complicating life issues to think about too.  Best of luck to you and I will keep you in my prayers xo",
      "MessageIndex": 5,
      "PostDate": "23/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857262",
      "Title": "Planning for recovery with disabled Husband - help please jjAriz jjAriz"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 15, 2017 04:32PM mommakat wrote: thanks so much",
      "MessageIndex": 5,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856931",
      "Title": "Discordant Results mommakat mommakat"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 14, 2017 07:56PM mommakat wrote: I do. Retyping it so bear with me If there are typos.   Unilateral right full field digital mammo performed with spot compression in orthogonal projections. At the 10:00 axis 9cm from nipple is a 5cm region of architectural distortion with associates nodularity. No other abnormalities.  Limited gray scale images of the right 10:00 axis 6 to 9cm from the nipple demonstrate multiple small cysts with associated duct ecstasia A solid appearing mass is not associated with this region Breast arterial calcofocations are non detectable  Impression Suspicious right breast 10:00 axis distortion best seen by 3D imaging. Stereotactic biopsy with 3D guidance is recommended.  The examination should not preclude the clinical evaluation of a palpable abnormality.BIRADS 4 suspicious findings Biopsy should be performed inabsmece of clinical contraindications  Thanks for your input! I'll paste the biopsy results too.  ",
      "MessageIndex": 2,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856931",
      "Title": "Discordant Results mommakat mommakat"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Apr 20, 2018 07:09AM mommakat wrote: been there! And there again lol. Last time was agony. It was 3 month between my first mammo and the final surgical biopsy results. Total agony waiting. I wish I had a magic answer, the list above is awesome. I do take Xanax from time to time, and usually need more often during these waits. And I allow myself some time each day to obsess. Like 30 mins. It’s notnperfect, but it works. Kind of.  This time now I’m waiting day 2 for the biopsy results. It’s definitely easier the 2nd time around. But still nagging at the back of my mind and jumpy every time the phone rings.  Hang in there and keep us posted!!",
      "MessageIndex": 7,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864076",
      "Title": "Waiting on Biopsy Results JoyMrt5 Blondlady"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "mommakat wrote: Hi Everyone, All started with my very first mammo, they saw a dense area on the right breast. Had the 2nd mammo, and an ultrasound, then a guided CNB. Called last week and said everything was B9. Then my GYN called and said the report showed PASH so she would like me to get a 2nd opinion with a BS to maybe have it removed. (I learned it's non cancerous but can grow). But now, the radiologist called again and said that the doc there says my biopsy report is discordant with her findings and she wants me to see the BS to have it removed. So same thing, except from reading, discordant seems to mean she thinks it's a false negative? I can't believe how not black and white all of this can be. The waiting and ups and downs is crazy. I am happy that they want to keep looking though, as I want the answers. Anyone else ever had discordant findings? My appt wit the BS isn't until 8/10 so I have a lot time to wait...and wonder. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856931",
      "Title": "Discordant Results mommakat mommakat"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 14, 2017 07:59PM mommakat wrote: here's the biopsy report:  Mammory ducts ecstasia, adenosis with columnar cell change, columnar cell hyperplasia and microcalcifocations, focal usual ductal hyperplasia focal pseudoangiomatous stromal hyperplasia",
      "MessageIndex": 3,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856931",
      "Title": "Discordant Results mommakat mommakat"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 18, 2017 04:12PM mommakat wrote: Hi Dreamspirit, I had t wait 4 days for my biopsy results, but I think every place is different. Waiting was worse than the procedure itself! Good luck! Sending you positive vibes!",
      "MessageIndex": 6,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857022",
      "Title": "Nervous Dreamspirit Abfmom77"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 23, 2017 05:52AM mommakat wrote: hi Abfmom! we have such similar things going on. I have no known history but I'm adopted so I just don't know. Just went for my first screening. @40 and all the same follow ups. My biopsy results did come back b9 but the radiologist believes they're discordant with her findings, so I need to follow up with a surgeon. That's on 8/10. I go through the same mental game of being fine and then not being fine. All I can say is hang in there and good luck",
      "MessageIndex": 11,
      "PostDate": "23/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857022",
      "Title": "Nervous Dreamspirit Abfmom77"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Apr 18, 2018 03:13PM mommakat wrote: good luck! Had mine yesterday. Easy least! You got this",
      "MessageIndex": 4,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864054",
      "Title": "Biopsy Today JoyMrt5 Kimi89"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Sep 12, 2017 01:25AM mommakat wrote: oh lala! that sounds awful! I hope you can get some rest today. I was pretty sore for a few days after my biopsy, and it wasn't nearly as eventful as yours! get some rest!",
      "MessageIndex": 9,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Sep 26, 2017 02:08AM mommakat wrote: Glad you're making some progress lala! Even if it's slow, and more waiting. I had my excisional biopsy last week. Get my results on Thursday. So I'm still waiting....do you think you'll actually get an MRI at the appointment? Too bad you can't get one done closer to home and sooner, and then have them read the results at the appointment. I haven't had one, so I don't know how long the results take. Good luck and I hope the waiting goes quickly. Glad your biopsy site is feeling better!",
      "MessageIndex": 15,
      "PostDate": "26/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858204",
      "Title": "Trying to stay calm lala1608 lala1608"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Sep 19, 2017 10:50AM mommakat wrote: Waiting absolutely stinks, and I think every woman here would agree. Good luck and keep us posted!",
      "MessageIndex": 1,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858768",
      "Title": "Waiting stinks semeagher semeagher"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Jul 25, 2017 04:11PM mommakat wrote: Hi Mg. I have BIRADS 4 too....of course I'm not quite as young as you....lol....but my biopsy came back, even with the BIRADS 4. Like some crazy high percentage of them to...someone here has the right #....I think 80% or something...come back b9. Get the biopsy as soon as you can and set your mind at ease :-)",
      "MessageIndex": 1,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857323",
      "Title": "Large Fibroadenoma... BIRADS 4 mglouise1 MTwoman"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Aug 2, 2017 05:47PM mommakat wrote: I know Lissa. I really thought it would be a more clear result, one way or another. Did you get an appointment with the tumor center yet? I've been waiting for my follow up with the surgeon forever it seems. I see her on 8/10 and I had my biopsy on 7/3. It's nuts. I've learned so much since then, and I completely understand how it isn't so black and white, and I'm actually hoping they'll want to do an excisional biopsy at this point. I don't love the idea of something \"hiding in the bushes\", and if I have to wait for a 6mo follow up, I can't imagine how crazy I'd be. I'm just trying to mentally be ready for whatever they say the next step is. We can only control so much I guess. Hope you get a follow up and more answers soon! ",
      "MessageIndex": 43,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857458",
      "Title": "Waiting on Biopsy results Nerve racking Lissaidell Lissaidell"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Aug 2, 2017 01:50AM mommakat wrote: hi lissa, similar situation that you're in. My biopsy came back non-cancerous...but....they want me to see a surge line use there's so much going on in my breast that they fear something is \"hiding in the bushes\". It's a strange pace to be in. Hang in thwre",
      "MessageIndex": 39,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857458",
      "Title": "Waiting on Biopsy results Nerve racking Lissaidell Lissaidell"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "Apr 20, 2018 12:22PM mommakat wrote: sending you positive thoughts! Waiting is so tough and somehow we’re wired to think the worst. It must be a defense mechanism. Whatever it is, you will get through it. Keep us posted! Xxx",
      "MessageIndex": 2,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864104",
      "Title": "Waiting and thinking....not a good combo Hybrids Hybrids"
    },
    {
      "AuthorID": "mommakat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255386/profile",
      "Content": "mommakat wrote: Hi Ladies, Just got back from my biopsies. These were my first U/S guided ones. Last year I had stereotactic with mammo and surgical. The left was pretty easy and kind of cool watching on the monitor. But the right. Holy hell! I didn’t realize how deep the spot was. It was 13 cm from my nipple against the chest wall. The radiologist was having a hard time getting the spot because the tools weren’t really long enough. Oh my god! Anyone else ever get that? Owee. At least it’s done! Tylenol and ice pack packs are my besties right now. Fingers crossed for fast results. hAte wiaitng Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864037",
      "Title": "U/S guides biopsy close to chest wall mommakat Oceanbum"
    }
  ]
}