{
  "AuthorID": "mommyjamieof2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170420/profile",
  "Posts": [
    {
      "AuthorID": "mommyjamieof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170420/profile",
      "Content": "mommyjamieof2 wrote: I was diagnosed July 2012 and unfortunately at stage 4 w/mets to my lungs and possibly bones. I am 30 years old.. I was put into a clinical study with navelbine, perjecta, and herceptin to try and shrink the tumor after 5 months the tumor grew the last scan showed 2.7 cm from 1.7 cm on the prior one. Well after the tumor was surgically removed it was actually 6 cm! They wanted me to go on more chemo but my surgeon felt it needed to be removed now and I didn't want to proceed with anymore chemo. I have done pretty well through the course of treatment mood wise. I had moments here and there but nothing to severe. During surgery I lost too much skin and the wound was to tight so they were unable to place the tissue expander on the right side so when I woke up I was shocked at what I saw needless to say. I had great support from my husband never really felt to bad about it and still don't but I seem to be in this depression that I can't shake the last week. I don't understand why I am depressed because I don't feel like I am dwelling on it or care too much about it I know eventually it will be fixed but it is I guess affecting me on a level I am unaware of. I am currently on herceptin every three weeks and tamoxafin. I was given Celexa a little while before I had surgery but when I researched it it said had interaction with the tamoxafin so I decided I didn't want to risk it. I asked my dr if there was anything that didn't he said the lowest one would be effexor but that insurance may not pay for that one.. And he didn't say that it didn't have an interaction but that it was the lowest. My problem is I am 30 years old with two young kids I don't want anything getting in the way of the tamoxafin working the way it should. But I feel like I can't shake this gloomy mood. Did anyone else have depression problems after surgery? Does it get better or did it take medication before you felt yourself again? I think it's more the cancer it's self than the surgery that is getting me down. I feel like a ticking time bomb I have scans again in March to see if there are any changes to the spots of concern or anything new. I have a spot on my liver 1 in the bone under my eye and one on my tibia. And I had some on my lungs they did a biopsy on and found 1 cancer cell out of the 4 samples taken. they are not sure if the others are cancer or not. In the beginning the dr said if they change or go away with chemo they were cancer if not then they were not. But my problem with that is the actual tumor grew on chemo so how do I know they are or not for sure??? They won't biopsy the bone said it's nearly impossible in those spots. I guess I need some guidence on how to not stress about what could be. I try so hard to appreciate every moment I have with my kids and my husband but it's hard when you have all this weighing you down. Tia for your help. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800394",
      "Title": "Post mastectomy and depression mommyjamieof2 PeggySull"
    },
    {
      "AuthorID": "mommyjamieof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170420/profile",
      "Content": "mommyjamieof2 wrote: I would love to make some new friends that are going through similar challenges. Look me up :) Jamie Ellsworth Abshire I am 30 turning 31 the 28th of feb. I was diagnosed July 2012 stage IV HER2 estrogen and progesterone positive. I was put in a clinical study with navelbine, herceptin, and pertazamub. After 5 months on the study the tumor grew so I was kicked off the study and chose to have the mastecomy then the tumor measured 2.7 cm on the ct and after removed was 6cm. This was almost 4 weeks ago and I am waiting to go to plastic surgery hopefuly soon. Right now I am on herceptin and tamoxafin hoping it keeps the disease under control. I had a lung biopsy and they found 1 cell from the 4 tissue samples they took. I have two spots on my bones one on my face and one on my tibia not sure if they are cancer or not and a 6mm spot on my liver again not sure if it is cancer or not. None of the spots changed or left during chemo. I just read about the TDM1 hoping that if I have anything on the scans scheduled for March I can do that drug. I have met way to many younger women with this horrible disease since I was diagnosed... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800886",
      "Title": "Facebook! mommyjamieof2 mommyjamieof2"
    },
    {
      "AuthorID": "mommyjamieof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170420/profile",
      "Content": "mommyjamieof2 wrote: Sometimes I feel so alone in this fight. I get why people have a hard time listening to me talk about whats going on but sometimes it's frustrating and lonely. Even my husband is deaf to my cries.. Everyone tells me you don't have to be strong all the time, let us in, or let us share what your going through but when it comes to the time I feel like I want to talk about it or cry about it everyone turns a shoulder and changes the subject because they are too scared to talk about it. So I tend to keep everything to myself and deal with or hide I guess, my fears and anxiety but somedays it's really hard to do and it would be nice to have someone to listen so I guess that's why I have turned here. I appreciate having the support of total strangers. Even my local friends that I have made that have breast cancer don't really care to talk about it and sorry to say but have the perfect attitude about it which I also understand you have to stay positive to fight this but how can a person stay positive 24/7?? How can a person going through this especially this stage and not have days of fear, anger, and sadness? Maybe they do, I am sure they probably do just like me but they hide it better I guess. I am just so damn angry at life right now I want things to just go back to normal and that's never going to happen I have to develop a new normal because this is always going to be part of my life now I will never be able to stop medication I will be in for infusions every 3 weeks forever. And always have the fear of it growing somewhere else. I wish I could have been diagnosed earlier and been able to \"get rid of it\" instead of this constant doom hanging over my head. I am admittitly jealous of my friends that are stage 1 or 2 and get their ports taken out and get to move on with life. Maybe I expect to much from other people but sometimes it is just so frustrating and today was a bad day..I expect my husband to be nicer, better, more understanding now and he just is not, doesn't understand I guess. I thought he did, he was so good after the surgery very supportive and caring, did everything for me. Now he is back to his honery old self... And my mom everytime I say a word about my treatment she quits responding when I am talking to her on facebook and it just drives me nuts...I love them both but I just wish they understood. But I guess that is why we have forums on the internet so we can find other people who do understand what we are going through. Can you tell today was one of those days I feel guilty for not enjoying the day and living it to the fullest?? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800938",
      "Title": "Here for you but don't talk about cancer or anything related mommyjamieof2 Moiralf"
    },
    {
      "AuthorID": "mommyjamieof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170420/profile",
      "Content": "mommyjamieof2 wrote: Sometimes I feel so alone in this fight. I get why people have a hard time listening to me talk about whats going on but sometimes it's frustrating and lonely. Even my husband is deaf to my cries.. Everyone tells me you don't have to be strong all the time, let us in, or let us share what your going through but when it comes to the time I feel like I want to talk about it or cry about it everyone turns a shoulder and changes the subject because they are too scared to talk about it. So I tend to keep everything to myself and deal with or hide I guess, my fears and anxiety but somedays it's really hard to do and it would be nice to have someone to listen so I guess that's why I have turned here. I appreciate having the support of total strangers. Even my local friends that I have made that have breast cancer don't really care to talk about it and sorry to say but have the perfect attitude about it which I also understand you have to stay positive to fight this but how can a person stay positive 24/7?? How can a person going through this especially this stage and not have days of fear, anger, and sadness? Maybe they do, I am sure they probably do just like me but they hide it better I guess. I am just so damn angry at life right now I want things to just go back to normal and that's never going to happen I have to develop a new normal because this is always going to be part of my life now I will never be able to stop medication I will be in for infusions every 3 weeks forever. And always have the fear of it growing somewhere else. I wish I could have been diagnosed earlier and been able to \"get rid of it\" instead of this constant doom hanging over my head. I am admittitly jealous of my friends that are stage 1 or 2 and get their ports taken out and get to move on with life. Maybe I expect to much from other people but sometimes it is just so frustrating and today was a bad day..I expect my husband to be nicer, better, more understanding now and he just is not, doesn't understand I guess. I thought he did, he was so good after the surgery very supportive and caring, did everything for me. Now he is back to his honery old self... And my mom everytime I say a word about my treatment she quits responding when I am talking to her on facebook and it just drives me nuts...I love them both but I just wish they understood. But I guess that is why we have forums on the internet so we can find other people who do understand what we are going through. Can you tell today was one of those days I feel guilty for not enjoying the day and living it to the fullest?? Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "23/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800938",
      "Title": "Here for you but don't talk about cancer or anything related mommyjamieof2 Moiralf"
    }
  ]
}