{
  "AuthorID": "MommyQ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
  "Posts": [
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Dec 2, 2015 08:07PM MommyQ wrote: I just had fat grafting (from thigh to breast) done Dec. 1 (yesterday), and was told by my PS to wear the compression girdle for 4 weeks, 24/7 except for showering, and then an additional 2 weeks at night only after the initial 4 week period has passed.",
      "MessageIndex": 1,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837185",
      "Title": "Fat grafting question rleepac rleepac"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 19, 2014 11:46AM MommyQ wrote: HomeMom: The simulation is the first step for rads, where they take a CT scan to figure out where they will need to radiate. They will lay out wires to map out the radiation zone. No actual radiation treatment takes place during the simulation appointment.",
      "MessageIndex": 36,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 7, 2014 08:38PM MommyQ wrote: Fionascottie: I am getting my left breast (what's left of it after the mastectomy) and armpit radiated, and will be lying facing up. My RO said that a part of my lung will be clipped by the radiation, but the only side effect that might occur is short term asthma, which can be treated. He also said that although they direct the beams to minimize contact with the heart, the heart would get some of the radiation, and although there is the potential for some damage, it's nothing that would \"make me die any younger.\"  So, I'm hopeful that it all goes well. I had my simulation last Wednesday (9/3) so I should be starting treatment sometime this week. If you're super concerned about heart and lung damage, you might look into proton therapy, which is a newer type of radiation treatment. They can control the beams better in proton therapy to stop the radiation beam before it reaches the heart & lungs. The problem is that it's available only in a few hospitals and is not covered by all insurance plans. I wanted to do proton therapy but my insurance doesn't cover it.",
      "MessageIndex": 166,
      "PostDate": "07/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 20, 2014 01:12PM MommyQ wrote: First week of rads complete and so far so good. Only negative thing I found out this week was that with my esophagus situated to the left of my spine, my esophagus is getting radiated and will get irritated. So the RO said to expect some mucus build up and a cough/sore throat. In preparation for this, he sent in a Rx for Mary's Magic Mouthwash for me, but the formulation he prescribed was not covered by my insurance, and would cost me ~$60 every 2 weeks out of pocket, so I asked him to see if he could find a different formulation that IS covered by my insurance. I'll find out Monday what they can do. mortmain - Sorry for the slow response. I've been away from this board since Wednesday. My RO also said Tom's of Maine deodorant would be ok for the NON-RADIATED side only and to use nothing or just cornstarch on the radiated side. But I really haven't need deodorant at all recently. Ever since I started Chemo back in April, my sweat doesn't smell at all. I guess the chemo killed all the bacteria? I'm monitoring myself to see if that changes, since chemo is over with, and have a Tom's stick ready in the cabinet to use if needed. :)   As far as the rad-blasts, I recounted yesterday and got 11. On Thursday, I counted 12. Either I can't count or they've been changing it daily! They come from all different directions. Yesterday, I paid attention to where the blasts were originating and found that 3 come from my right side above the table, 5 from my left side above the table, and 3 from my left side below the table. They are blasted sequentially as the gantry rotates around me from one position to the next. The RO said that by doing this, they can avoid my heart and lungs for the most part, although the heart still gets some low dose radiation, and the top part of my left lung is getting hit too. It's the best they can do with IMRT (Intensity Modulated Radiation Therapy). jhodro - You're not alone in having problems with memory. I just recently noticed that I am struggling more with remembering things, like names or even just words. I guess chemo brain is what it is! This morning, I saw one of my friends who had his daughter with him and I just could not remember her name! Good luck with your job hunting. What's \"hydrogel?\" Is that Rx or OTC? Puffin2014 - Congrats on finishing chemo! Woo hoo! Happy day! :) Bow1965 - Welcome! I have the same fear as you that they'll radiate the wrong place! I guess we just have to trust they they know what they're doing, since they've been doing it for long time. We're on the same schedule almost. I just started rads Monday and will be done the Wednesday before Halloween. Jaimieh - I get x-rays daily on the table right before each rad treatment. I told my rad techs that was a lot of x-rays, and they said that combined in total, the 33 x-rays will give me less radiation than one regular chest xray. PontiacPeggy - Glad to hear you will get a little break soon to help you rest and recover.",
      "MessageIndex": 285,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 22, 2014 09:34PM MommyQ wrote: mortmain - I hope in a generation or 2, they'll have this figured out where all a patient has to do is swallow a pill and it'll kill all the cancer cells but not any healthy cells. That would be awesome.",
      "MessageIndex": 297,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 25, 2014 01:34PM MommyQ wrote: Thanks, Hopeful82014 and PontiacPeggy! Peggy, looks like you’re halfway done. Woo hoo! For deodorant, you could try dusting with cornstarch, since you’re allergic to the aloe in Tom’s. That’s what my RO recommended, but I haven’t tried it. Like jhodro, I’ve been going without deodorant. I think the chemo killed all the bad bacteria so I don’t smell bad anymore (for now). JUnfortunately, at 6 weeks PFC, the underarm hair is starting to come back (boo!), although it’s only a few stragglers at this point. I just noticed earlier this week and had to shave those stragglers off. Jenwith4kids: Congrats on being over halfway! Jules_NY: The machine comes on 11 times for me. We must be using the same machine. It starts with a “V” but I can’t remember the name. Jhodro: Congrats on finishing the full girl rads. You’re almost all done! Yay!",
      "MessageIndex": 317,
      "PostDate": "25/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 28, 2014 11:37PM MommyQ wrote: PontiacPeggy - That would be nice if I could pick what hair came back for sure! Oh well. At least it was nice not having to shave all summer long. :) Lolis - Like Peggy, rads have not gotten rid of the armpit hair for me. I just started shaving again a week ago @ 6 weeks PFC, when I noticed a few hairs had grown back. Jaimieh - Yep, we're on the same schedule. We'll both be done with rads and get our super Hulk powers by Halloween. :) HomeMom - Bummer about having to deflate your TE.  Will it be deflated completely or just a little bit? You asked if anyone else had had a mastectomy with reconstruction. I had a BMX with TEs and the skin looks ok so far. I've only had 10 sessions of radiation though. lilyrose53 - The machines that administer the rads have to be kept cool, which is why that room is always so cold! My techs always offer a warm blanket to lay over my legs, and I usually have jeans on, so the combo is quite warm. Maybe your techs have blankets too, but just forgot to ask if you wanted one? Or if they don't have them, you could probably bring your own blanket to lay over your legs. charusa - That's funny you asked people to sniff you! Congrats on finishing! I'm glad to hear you made it through with only minor skin issues. Gilesmt - Sorry to hear chemo gave you blood clots in your lungs & that chemo was so hard on you with all the side effects. Hopefully, radiation will be much kinder to you. I didn't even know blood clots was a possible side effect and I was on the same Taxotere Cytoxan cocktail you were on! I hope they can dissover the clots for you quickly. As far as fatigue, my doctors tell me that radiation does not make you fatigued like chemo does. I'm surprised you didn't lose all the hair on your head, like I did. I also lost all my armpit hair and all the hair on my legs, although my arm hair stayed put completely. Well, rest up and I hope you feel better soon. genny5775 - Wow, 60 minutes is a long time to lay still! Maybe you can find a way to distract yourself during that time to make it feel shorter. I know if I think about different things during treatment, like what I'm going to make for dinner and things I have to do later that day, it goes by faster. Good luck. MomMom - Congrats on finishing! Now you can get back to a normal life. Woo hoo! I'm so looking forward to that. Jagerin - Sorry to hear about the horrible skin reaction post rads. Glad to hear your dermatologist helped you out. Thanks for telling us about the Rx (Atrapro gel, Neosalus cream) that helped, in case any of us also will need it. Well, it's late, so I'll sign off here. Wishing everyone well with their treatments this week!",
      "MessageIndex": 354,
      "PostDate": "28/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 29, 2014 10:39PM MommyQ wrote: HomeMom - That's a big reduction! Hopefully they won't have to deflate you but if so, at least its only temporary for 6 weeks. Susu - I've not heard of the green tea spray treatment. It sounds like a lot of work! Can you save some time by brewing a big pot of green tea to use for a whole week instead of brewing for each day? Genny - Glad to hear today's treatment went faster!",
      "MessageIndex": 359,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Oct 2, 2014 06:53PM MommyQ wrote: Cceandme: I've been using an aloe body butter and I've been rubbing it into the skin 1-2 times a day. I've just had #14 today and my skin is starting to show a little pink and has felt sensitive (like it feels with a mild sunburn) since treatment #11. I haven't started using the Aquaphor yet, but have some handy.",
      "MessageIndex": 371,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 14, 2014 05:38PM - edited Aug 15, 2014 06:03PM by MommyQ MakeLemonade: My BC was left breast too, which is why I am worried about heart damage. I sure hope my anatomy allows them to shoot the beams away from my heart. I had looked into proton therapy, which has beams that can be controlled to stop before hitting the heart, but my insurance wouldn't cover it. :( I'm glad to hear the part of our lung which will get hit doesn't do anything, LOL, so we don't have to worry about it! I'm glad to hear that a PT can break up cording.  Thanks for the run down on the setup appointment. I didn't realize there'd be a CT scan. Enjoy your two weeks away from the hospital!",
      "MessageIndex": 15,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 3, 2014 11:33PM MommyQ wrote: I had my simulation today. Went very quickly and painlessly. I laid on the platform and they inflated something under me to hold me in place. Went through the CT scanner and they marked me in 2 places left and right, and 3 places down the middle. Done in 30 minutes. They'll call when the planning is done to schedule my radiation appointments, within a week. Looking forward to getting rads done so I can move on to the next phase...reconstruction exchange surgery 6 months later! Can't wait to get these uncomfortable TEs out and replaced with something softer. Hindsfeet: So sorry you are suffering so much. I hope it gets better for you soon. Hang in there and stay positive. Best wishes to all. Have a good evening.",
      "MessageIndex": 151,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 16, 2014 11:31PM MommyQ wrote: mortmain: I'm like you. I tried counting the seconds for each radiation beam today! :) I found that the beams were being shot for between about 10 and 25 seconds each, in 10 different locations, as the gantry rotated around me in an arc for about 200 degrees of rotation. You asked what type of rads I am getting. It is the Intensity-modulated radiation therapy (IMRT) variety. I don't know about the different types. What type are you getting? ",
      "MessageIndex": 241,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 20, 2014 09:36AM MommyQ wrote: MomMom: I did a quick Google search and found that front close cotton bras are pretty rare! I did find a couple: Walmart (online and in stores-check online for store availability), $8, Sports Bra: http://www.walmart.com/ip/Fruit-of-the-Loom-Comfor... OneHanesPlace, $22, Leisure Bra: http://www.onehanesplace.com/outlet/bras/bra-feat... You'd think there'd be more options considering how many women get breast cancer!",
      "MessageIndex": 42,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 17, 2014 08:50PM MommyQ wrote: I don't remember if they said anything, but I remember reading somewhere that radiating the armpit could increase the possibility of lymphedema. :(",
      "MessageIndex": 249,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 24, 2014 08:53PM MommyQ wrote: Rad#8/33 today. I'm 25% done! My husband bought me a bouquet of flowers to celebrate. :) I still feel pretty good and skin looks normal, although it feels just a tiny bit more sensitive on the rad side. I'm continuing to moisturize daily with my Body Shop aloe body butter immediately after showering using Dove bar soap. My chest muscles feel super tight across my TEs. Anyone else experiencing this? I asked my RO about it today, and he said that rads shouldn't cause that at this point, although after rads are done, some scarring could occur and cause some of the muscles to feel tight. Jules_NY - I too am having IMRT with a bolus (which is really just a wet towel they place on top of my chest). They explained that the bolus would help them be able to radiate closer to my skin. mmtagirl - That's a tough decision on whether or not to have radiation. I didn't have a choice. My MO basically said I needed it based on my diagnosis. I think back in the April Chemo board, someone posted an article about how radiation was being recommended more now for folks with lymph node involvement...but I'm not positive. I just did a quick search to try and find it, but couldn't. Instead I found this post, which DOES say that rads benefited folks with 1-3 lymph nodes involved: https://community.breastcancer.org/forum/69/topic/...",
      "MessageIndex": 309,
      "PostDate": "24/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Oct 4, 2014 02:57AM MommyQ wrote: Susug - I just finished #15/33 and the fatigue hasn't really hit yet. My skin started feeling more sensitive around #11 and started looking a little bit pinkish a fewdays later. But everyone is different.",
      "MessageIndex": 396,
      "PostDate": "04/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 14, 2014 10:42AM MommyQ wrote: Hello everyone!  Hello again to my April Chemo board friends, MakeLemonade & writinghelps!I just finished chemo yesterday (Aug 13) and am meeting my RO tomorrow morning for a consultation. I am scared about rads because mostly I worry about potential heart and lung damage. I'm hoping that doesn't happen. Skin burns and fatigue should go away with time, so I'm not as worried about those. I'm also worried about cording, since I have that right now and I hear rads make it worse. Plus, I don't know if I can lift my arm high enough for the rads treatments! Will be seeing a PT for help soon. Waiting for a call back. Cceandme: I also have TEs and am hoping after rads, my PS can make me look good. :)  My PS waits 6 months after rads are done to make sure all the tissue/skin has achieved \"steady-state\" on healing. That way, she will only need to do the exchange and tissue shaping surgery once. ",
      "MessageIndex": 10,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 16, 2014 11:15AM MommyQ wrote: I met my RO yesterday. He was very nice and explained how everything was going to work and answered our questions. I will have 33 treatments total.  I will go back week after next for the CT scan/simulation, where they'll use the wires to map out radiation areas. Then, on the dry run, they'll use permanent markers to mark reference points. He said they don't do tattoos anymore unless patients specifically request it. I'll go for the markers. Less painful and not permanent. Like MakeLemonade's ROs said, they will clip a part of the lung, but it shouldn't cause any problems. He said that now that they can map out our anatomy with the CT scans, they are better at directing radiation away from the heart and lungs.  There is a very small chance of radiation causing asthma, but I think he said it was really rare, and if it happens, he can treat me with meds and it'd be temporary. And he also said that there is slight potential the heart could be affected but it's not anything that would make me die at a younger age. I guess I just have to go through with it and hope for minimal problems. On the 25th, I go to my PT to get help on getting rid of this cording so I can be more comfortable during the radiation treatments.",
      "MessageIndex": 20,
      "PostDate": "16/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 19, 2014 12:03AM MommyQ wrote: Hindsfeet: Good luck starting rads Wednesday. You mentioned no Vitamin E, D, or antioxidants. Did the RO say why? And does that apply only to what we injest or does it also apply to what we apply topically? Hi Lilyrose from April Chemo! I think after chemo, rads should be fairly \"easy,\" based on what others have posted in the Summer Rads board. Let's hope so! Puffin2014: I think the \"standard\" wait time is 2-4 weeks between chemo and rads. My RO wanted to wait 3 weeks between final chemo and the simulation, so I'll probably be closer to 4 weeks between chemo and actual start of rads. Good luck to everyone starting rads and have a good evening!",
      "MessageIndex": 34,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 30, 2014 06:20PM MommyQ wrote: Blownaway: Welcome! Here's a link to an explanation about cording, also known as AWS or axillary web syndrome: http://www.breastcancer.org/treatment/side_effects/aws",
      "MessageIndex": 111,
      "PostDate": "30/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 15, 2014 10:15PM - edited Sep 16, 2014 08:00PM by MommyQ I just had my first rad today and it went well. My techs are nice. There is no handlebar for me to grab. My arms are each supported by 2 C-shaped rests that are each about 6\" wide, one supporting the upper and one supporting the lower arm.  My hands are dangling with no support, which I found uncomfortable at the simulation, so at the dry run Friday and at today;s treatment, I intertwined my fingers so they could support each other, and that was comfortable. 1 down, 32 to go! :) And then I start Tamoxifen.",
      "MessageIndex": 222,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 16, 2014 08:18PM MommyQ wrote: Had my 2nd rad treatment today and was immediately feeling tired as soon as I reached my car in the hospital parking lot! I got home and laid down on the couch with my dog for about 45 minutes before I felt ready to get up. Felt a little nauseated. Might be because I ate a chocolate chip cookie on the drive from work to the hospital! No snack tomorrow! ncollett: That's excellent news on clean margins. Yay! Regarding SEs, you might not even get any, like Peggy said. But you could consider working part time and having your treatments in the afternoon (towards the end of the work day), so afterwards, you can go home and nap if you need to. That's what I'm doing. Most of my treatments are at 3pm. clarrn: I am working part time (25hrs/wk) while doing radiation. Not sure if it's a good idea or not yet...too early to tell. I took short term disability time off during my 5 months of surgery rehab and chemo, so I was ready to go back. I just hope the fatigue doesn't make even part time difficult. genny5775: Sorry to hear of the insurance woes. Insurance can be a royal pain sometimes. Wish it were simpler.  Peggy: Hang in there. I hope your hubby gets better soon.",
      "MessageIndex": 237,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 17, 2014 04:03PM MommyQ wrote: HomeMom: you're right. We DO have a similar diagnosis & surgery! They're radiating my armpit and left breast/chest.",
      "MessageIndex": 246,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Oct 17, 2014 02:04AM - edited Oct 17, 2014 02:05AM by MommyQ Hi there. I don't post much but have been reading the posts here almost daily. I had #24 of 28 full breast rads today, and will have 5 boosts after the full breast rads are done. My skin has turned a dark reddish brown with dark spots in the pores in the radiated area, and just started peeling about 2 days ago. I've been using Body Shop aloe body butter on my skin daily after my shower since day 1, and started putting on Aquaphor in the evenings around treatment #15. I also started applying aloe \"juice\" from my plants just this week. The doc said keep up the routine because my skin looks good. I just started feeling the fatigue after treatment #20. It's not too bad, although I needed a 2 hour nap last Saturday! Bride & Blownaway: Regarding the sore throat, my RO had warned me early on that I might get one because my esophagus runs down my neck area closer to the left than in the center, and I'm getting rads on the left side. He prescribed me Mary's Magic mouthwash for it. You might want to ask your RO for a Rx for this if the sore throat continues and is bothersome. Best wishes to all having treatments!",
      "MessageIndex": 582,
      "PostDate": "17/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 20, 2014 09:41AM MommyQ wrote: Regarding tattoos vs. markers, it might be worth asking your RO if he/she could use markers instead of a tattoo. My RO said that most women don't want a permanent reminder after rads (like ncollett said!) so he uses a marker instead of a tattoo. He said the markers work well. I just have to be careful to wash carefully in that area so I don't wash the marker off. At treatment each day, they touch up the markers to keep them fresh and visible.",
      "MessageIndex": 43,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 15, 2014 10:45PM MommyQ wrote: There's no clock that I can see during treatment so I'm not positive, but I think the actual time elapsed while radiation is being administered occurs over maybe 10 minutes. The radiation is not continuous during that 10 minutes because the gantry shoots the rads from maybe 10 different locations, so a good part of that 10 minutes is spent repositioning it. ",
      "MessageIndex": 224,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Oct 4, 2014 10:32PM MommyQ wrote: Bippy625: Rads are not as bad as chemo. Chemo knocks you down much more. I had tissue expanders (TEs) put in place during my BMX, and will have them exchanged for silicone implants about 6 months after rads are done. My PS says that rads will shrink your skin and tissues, so she wants to wait 6 months after rads are done to do the exchange because by then, the skin and tissues should have healed to a steady state condition. She expanded the TE on my radiation/cancer side a bit bigger than my other side, to account for the expected rads induced shrinking.",
      "MessageIndex": 406,
      "PostDate": "04/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Oct 28, 2014 09:21PM MommyQ wrote: I don't post much but I've learned a lot reading everyone else's posts, so thanks for all the help getting through rads! Only one more boost left! I am so glad radiation is almost done. My poor skin hurts from the burns and I am looking forward to it healing back to normal. Those of you who didn't burn are SO LUCKY! It was during the fifth week that the skin burned and started peeling. After treatment #25 was when I noticed the areas that had peeled off had started to hurt. Fortunately, #28 was the last full breast radiation and I switched to local boosts, so much of my skin could start to heal. Now after boost #4, the areas that were burned and hurt are starting to feel better and turn back to \"normal\" skin color instead of bright red. Such a relief. I'm also looking forward to not having to slather Aquaphor on myself anymore! :)",
      "MessageIndex": 729,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 5, 2014 03:12PM MommyQ wrote: Hi everyone! Newbie here. I've been reading all your posts which have been helpful. I was wondering about some things that I haven't seen anybody post about (or at least I couldn't find in my chemo fog mind), so I thought I'd ask. I had my first TC infusion on Wednesday 4/30/14 and have been just worn out since. I don't know how those of you who've returned to work are doing it. My SEs: 1. I've been running a fever of 99.x-100.0 the whole time 2. My vision was a bit foggy on day 2 (Th), 3 (Fr) and part of 4 (Sat). 3. My tissue expanders have not been comfortable at all since the infusion (I had a 100cc fill on the day before the infusion). Feels like they're poking me constantly. I also had some fluid buildup day of the infusion above my right TE & below my port, which I noticed when I got home. I had it checked out the next day and my surgeon said the port was ok. I'm still bruised yellow under the port area (port installed 4/23). 4. Achy neck and back muscles (probably due to #3). Anybody else have these issues? Or is it that everyone does and I'm just a big baby? :) Thanks!",
      "MessageIndex": 624,
      "PostDate": "05/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 25, 2014 08:53PM MommyQ wrote: Hiya. Been offline for a couple days, so trying to catch up. I am in my tired days where I just want to sleep (3 and 4 days after infusion day are nap days for me). Heart rate is up to 100 again and temp hovering around 99-100F. Body aches. Trying to take it easy and drink lots of Gatorade and stuff. LatisseCannon: Welcome. You'll find great support from a great group of ladies here. Golfinggirl: Hugs Mikishelly: Awesome you're almost done with chemo! Woo hoo! I'm jealous. I hear the permanent implants are WAY more comfortable than the TEs.  linda505: Hang in there. The dementors will go away soon! merg: Looking good! My scalp hurt a lot yesterday, too (3 days after infusion) when I lay down. Today, it's better. I don't put anything on it. If I'm not laying down, it's ok. SharonDe: I think a lot of us still have the little straggler hairs that hung on. Weird, huh? I call it my zombie hairstyle. :D I figure it'll all come out soon (maybe 14 days after the 2nd treatment?), so I'm just leaving them alone for now. LongIsland & Footballnut: I agree that days 3 and 4 are the worst. Day 5 will be better. Hang in there. clarrn: Hope you and your little one feels better soon. I think ice cream is a fabulous idea. :) boobieprized: Glad you had a good LGFB event! I enjoyed mine too. 2 of the ladies in my group brought guests and nobody said anything about it. Looks like your girls are having fun buzzing your head! Gotta have some fun in all this. :)",
      "MessageIndex": 1132,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 27, 2014 11:39PM MommyQ wrote: Blueberry4:  My guess is that our hearts are pumping faster since we have fewer red blood cells than normal, so it's struggling to get oxygen everywhere. I'm a bit concerned about the long term effect to our hearts, but I guess there's nothing we can do about it if we want to kill those cancer cells.  And we do! :) mmtagirl: Hey, we did the ice cream run last night too! My husband and 10 year old picked it up and brought it back. It was good. We had turtle sundaes. Ice cream seems to be one of few things that still taste right to me with my chemo tongue, so I'm going to keep indulging in it!  Timbuk2: I don't like people seeing me bald either. I guess it just feels weird. At home, I don't cover up, but as soon as I need to leave the house, I cover up with something. Even to check the mail, I put on a hat! I guess I don't want the looks and don't want to have to explain to everyone what's going on. I like my wigs though. They look very realistic, so I wear those when I am going to be out in public for any length of time. I was fearful originally of them falling off, but have gotten more confident since I've been wearing them a couple weeks now, that they aren't going to fall off. I'm not normally a hat wearer either, so wigs are an adjustment. Best wishes and good vibes out your way for your CT scan. Swissmiss: Good luck with the new MO. I'm glad you're ditching the old one, who wasn't providing very good care. :) Brigadoonbenson: My port was installed under local anesthesia with sedation. I was freaked out about it before the surgery, too!  It took 45 minutes total. I remember nothing from the time the sedative went into my IV drip to the time I was in recovery. Immediately after the port install, I went to see my PS to get my mastectomy drains removed and my first TE fill.  I felt pretty normal...no nausea or sluggishness.  I had bruising in the area right under the port, which remained yellowish for about 4 weeks. The first few days after surgery, I had muscle pain in my neck due to the way they positioned me to get the catheter inserted into my vein. I took ibuprofen for it. Now and then, I get the neck pain again, but it's not as bad as the day after surgery. I don't feel the port now.  I'm glad to have it so they don't have to find a vein for each infusion. The needle stick into the port isn't as painful as the IV needle stick.  Plus, I was told the TC drugs really damage the veins in the arm and hand, so they didn't want to do that. Best wishes on your port surgery. Don't worry. It'll be fine. It's pretty minor as surgeries go. Well, it's my bedtime. Have a good night! I hope tomorrow's a better day for everyone!",
      "MessageIndex": 1190,
      "PostDate": "27/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 11, 2014 02:16PM MommyQ wrote: Hey Footballnut! We're chair buddies today! :) Sorry for the long post but I've been offline for a couple of days and trying to catch up. Here goes: Sitting in the chair right now for TC#3 of 6, sucking on ice and eating a Lorna Doone. MO said my white tongue sounds like it wasn't thrush, but instead just the chemo killing off the cells in my mouth, so she said to try to ice my mouth during the T&C drips, to reduce the amount of chemo that attacks my mouth cells. Hopefully it works. EverForward: I too look on the bright side with the good things you listed. Well, except for the no-period because I'm still getting mine (boo!). Jaimieh: Nice wig...looks like real hair! They've gotten so much better with the wigs these days, which is so nice. Timbuktu: If your wig feels too loose, try a smaller size. Wigs seem to come in 3 sizes: petite, average, and large. Mine all seem to stay pretty well, even when I drive with my convertible top down. :) Good job remembering a phone number on chemo. I couldn't even remember phone numbers even before chemo! MakeLemonade: Congrats on finishing A/C! Gotta celebrate each milestone. I too am exhausted right after my infusion, usually the first 11 days after chemo, but then I have 10 good days afterwards until my next infusiion. We gotta enjoy the good days and look forward to them on the bad days. SwissMiss: I only get blood work the day of my infusions (once every 3 weeks). But I think that's because I get the Neulasta shots. Once a week is a lot of vein sticks. Yuck. Sorry you have to go through that. DeeC: Wig looks great and just like real hair! Hang in there...only 3 more to go! You can do it! I'm looking forward to hearing how radiation goes for you since I will be doing the rads in September when I'm done with my chemo. And enjoy the good days! LongIsland: So sorry for your loss. I hope the drive goes well. Just plan a lot of rest stops and I think you'll be fine. Cold, clarrn, Blueberry, and jhodro: I like my Toyota RAV4. It's a good size for me (family of 4). Good space but not too big as to be hard to park. I have friends and family who like the Honda CRV, the Toyota Highlander, Honda Pilot, Lexus RX350, and Acura MDX. The Subara Forrester (more of a tall wagon) is also a favorite of friends. I'm a car girl so ask me anything about cars. :) I love to talk cars. Mompv: Good luck with your first infusion. You can take Ibuprofen for the soreness..they let me take them for my port installation soreness, which helped. Start the Claritin right after your infusion and take for several days afterwards (I only take for about 3 days but I think others on this board take it for a week). mmtagirl: Congrats on finishing A/C! Whoo hoo! :) You're brave to have that many people over! I'd be afraid to do that even if I WASN'T on chemo! MikiShelly: Thanks for the postchemo report. Sorry to hear about the neuropathy. I hope it goes away for you soon. As far as hair regrowth, I'd gladly take that over chemo anyday! :) DId you know the Komen Race is this Saturday? I can't go because I will be exhausted and be spending my day in bed, so I signed up for \"Sleep in for the Cure,\" which I wasn't even aware of until this year. It lets me support the cause but not have to physically go downtown. I plan to go next year to walk for sure though!  Footballnut: Great pics! Linda505: Good luck with your CT scan. Hope it turns out well. Cold: I miss good food too! Only ice cream and cheese taste good for a week and a half after infusions. Things we'll appreciate more after chemo is done... :) Wishing everyone a good day, whether you're in the chair, out and about, or enjoying some sleep.",
      "MessageIndex": 1517,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 17, 2014 01:30PM MommyQ wrote: Congrats, Linda, on the wonderful news! Time to celebrate! Footballnut: I did the gene testing too, and fortunately am negative for any markers for cancer (good news for my 2 daughters). If I had been BRCA positive, they would have recommended removing my ovaries and possibly a prophylactic mastectomy on the non-cancer breast to reduce reoccurrence. I went ahead and had a BMX anyway. Looks like we'll be chair buddies July 2! Sorry to hear a bunch of y'all have the digestive issues. I've been hit by the big D on prior infusions around day 8 so I'm expecting it tomorrow. :S My biggest issue today is my TEs are super uncomfortable and I am out of breath as of day 5. I can't sit comfortably and after a short walk across the room, I have to rest! My heart rate is about 105 resting. Anyone else?",
      "MessageIndex": 1631,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 17, 2014 10:28PM MommyQ wrote: brigadoon: My heart rate has always been high too, but normally around the low 80s. Hey, thanks for that link to the Amazon reviews for the gummy bears. My daughter & I both had a good laugh reading them. :)  Lilyrose: I guess a rapid heart rate is just another SE for us. It's just scary to me. I can't wait until chemo is over so I can do normal activities again!",
      "MessageIndex": 1648,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 26, 2014 09:55PM MommyQ wrote: Timbuktu - I'm totally with ya. My MO told me 4 T&C was the standard recommended # of treatments for my case but she'd like me to do 6 if my body will tolerate it, because I'm high risk. My initial thought was to only do 4 to just be done quickly, but I know I should do 6 to be more likely to get it all taken care of.  But Linda put it in better terms. I'll be 2/3 done Wednesday! :)",
      "MessageIndex": 1838,
      "PostDate": "26/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 2, 2014 11:03AM MommyQ wrote: Linda - Sorry to hear you're not feeling well today. Hang in there. Timbuktu- My MO is the opposite. She's recommending 6 but says I can stop at 4.",
      "MessageIndex": 1897,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 4, 2014 06:44PM MommyQ wrote: Footballnut: I'm with Sharon. I'd be worn out just walking downstairs to my treadmill. :) Lazy day here. Napped for an hour with my dog on the couch. Sat outside on the back deck and enjoyed the beautiful weather with the hubby. Noticed I have 3 dark \"tree rings\" on my fingers from my 3 chemo infusions and took a pic. :) Getting ready to eat grilled dry rubbed pork steaks prepared by the hubby. Hope they taste ok. :) ",
      "MessageIndex": 1949,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 5, 2014 05:58PM MommyQ wrote: EverForward: I guess your cording must be back due to chemo. My PT told me cording during chemo is caused by the lymphatic system trying to get rid of all the dead cells from the chemo. I'm glad to hear that it went away for you right after your lumpectomy. That means it should go away after chemo is done!  Also, thanks for explaining why Tamoxifen is now 10 years instead of 5. I was wondering about that!",
      "MessageIndex": 2410,
      "PostDate": "05/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 17, 2014 02:29PM MommyQ wrote: Yay, Linda! Great news! Timbuktu: Thanks. Yep, skip #6! Yikes!",
      "MessageIndex": 2526,
      "PostDate": "17/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 18, 2014 12:41PM - edited Aug 18, 2014 12:44PM by MommyQ Timbuktu: I haven't told my MO about what happened Saturday. Should I? Thanks for looking online for possible causes, but actually, the \"C\" in my \"TC\" treatment is Cytoxan, not Carboplatan. Sorry for the misunderstanding. I took a Claritin Thursday and Friday around 3pm to aid in minimizing muscle pain from my Thursday Neulasta shot. I think my problem was dehydration. Jen: Glad to hear you're feeling better post chemo. I was only in the hospital one night after my BMX. The hardest part for me was not being able to lift myself up from bed and lay myself down without help for the first 2 weeks afterwards. It was just painful. Also, the drains were uncomfortable. The surgery scars themselves surprisingly didn't bother me too much. Washing my hair was a pain too.  I had hair half way down my back. Trying to keep my chest area dry while washing that much hair was crazy. Plus, I couldn't raise my arms up that high so my husband or my daughter had to do it! So, take a really good shower/bath before you go in for surgery! :) ",
      "MessageIndex": 2535,
      "PostDate": "18/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 19, 2014 10:02AM MommyQ wrote: Ddkath70: I am the WORST when it comes to staying hydrated. I almost never feel thirsty, so I have to just make myself drink. Yay, you're getting rid of your port! I haven't scheduled mine yet. My simulation is 9/3. I don't know if I should remove the port before rads or after. Are you just doing an in-office port removal or going into the hospital for surgery? Jen: If you are prone to nausea, let your BS know and he/she will set you up with anti-nausea meds during surgery and afterwards, to make sure you are ok. I did that and I don't remember really suffering from nausea. Best of luck tomorrow! EverForward: My SEs seem to be about the same for each chemo cycle. But maybe it's totally unrelated to chemo and you're just allergic to something in California that's making your nose and eyes water.  Hopefully it gets better. Enjoy your recoop time at the cabin! That sounds nice.",
      "MessageIndex": 2545,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 2, 2014 06:10PM MommyQ wrote: Congrats, Mscaruso! Like Timbuktu said, every day gets better! I'll be 3 weeks PFC tomorrow and I feel pretty good. I don't need to nap anymore, although I still need to stop to rest several times when I walk the dog around the neighborhood. But it feels good knowing chemo is over!",
      "MessageIndex": 2644,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Nov 3, 2014 06:56AM MommyQ wrote: mmtagirl: thanks for the tips regarding SEs and what helps to relieve them. I hope the SEs lessen for you over time. Timbuktu: thanks for the tip about the heating pad for pain.",
      "MessageIndex": 2877,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 29, 2014 06:15PM MommyQ wrote: Timbuktu: THAT'S AWESOME!!!!!!!!!!!!!!!!!!",
      "MessageIndex": 1245,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 31, 2014 06:13PM MommyQ wrote: ColdInCanada: LOVE the pink wig! Such a great idea to have some fun! Jaimieh: Sorry to hear you don't feel well. On the bright side, you have an appt for Monday to ask the doc for some help. Hang in there. Maybe try some cool towels to soothe the skin??? Starting my good week here. Pulse has finally dropped from the high nineties/low 100s to a normal 75 bpm. Went to the dog park to let my dog get some exercise, since I can finally catch my breath just walking! :) Ice cream is still just about the only thing that tastes right so I just enjoyed a bit of Ben & Jerry's Cherry Garcia. Mmm.",
      "MessageIndex": 1282,
      "PostDate": "31/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 7, 2014 01:54PM MommyQ wrote: SharonDe: GREAT collage. Nice wig too! :) Golfingirl: That's great news from your ultrasound that the chemo is working! Woo hoo! mikishelly: Congrats on finishing treatments! That's awesome. Looking forward to your posts of life after chemo. Taxol Ladies: I'm happy for you all that the Taxol treatments have fewer SEs. That's excellent. Ladies with Nausea: I read that sniffing a little isopropyl alcohol helps relieve nausea for post-op patients. I also read that it helps some chemo patients as well: Here's a link to one of the articles about post-op nausea relief: http://www.ncbi.nlm.nih.gov/pubmed/15632723 And here's a link to a page where at the bottom where people wrote comments, some chemo patients said it helped and some said it didn't, so it's probably worth a shot, since everyone has some around the house, right?: http://www.earthclinic.com/CURES/nausea.html Enjoying the good days until I go back in the chair on Wednesday for TC #3, which will be my chemo halfway point. Have a good Saturday y'all!",
      "MessageIndex": 1401,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 26, 2014 11:07AM - edited Jun 26, 2014 11:10AM by MommyQ Hello Ladies, I'm trying to catch up. It's my good week, so I'm trying to do all the stuff I can't do on my bad week. Regarding pity looks, honestly, I don't really pay attention to whether people are looking at me or not. I guess ignorance is bliss??? :)  But that's horrible the stories here about being ignored or left out. Maybe people are scared and don't know what to say to us? Everforward-Nice picnic! Footballnut-Congrats on being BRCA negative! That's excellent news. I'll be in the chemo chair July 2 with you, also getting Taxotere, but I will also have Cytoxan. Side effects of Taxotere include the potential issues with nails and the tongue. Try to keep ice chips in your mouth during the infusion to minimize that. Some folks ice their hands and feet too, but I haven't and so far, I only have the dark rings from the Taxotere. Sorry to hear that your husband can't go with you anymore. That's awful of your husband's employer to deny his support of you. So wrong. Cold-I have the tight, sore leg muscles too! I thought it was only me. I can't reach my toes as easily anymore. SharonDe-congrats on your last infusion! Yay! Sunshine-sorry to hear about your mouth sores and swelling. I hope the doc can help you feel better. SwissMiss-That is pretty awful about the mom who routed her kids around the bushes. Rude. Some people are just ignorant. I have a new topic - PROTON THERAPY vs conventional photon Radiation Therapy. Anybody know much about it, or been through it, or is considering doing proton therapy? It sounds safer than the conventional radiation therapy, so I'm trying to learn more about it. I'm supposed to have radiation therapy after chemo is done.",
      "MessageIndex": 1826,
      "PostDate": "26/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 2, 2014 10:01AM MommyQ wrote: Hi y'all! I'm getting my Taxotere as I type and chomping on my ice chip to keep the white tongue/mouth away. This is 4 of 6, so I will be 2/3 done today!!! After chemo, I'm getting an ultrasound to look at a hard lump under my armpit. Hopefully, it's just scar tissue from removal of my lymph nodes and not anything worse! Good luck to everyone on their treatments and managing those SEs. ",
      "MessageIndex": 1893,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 2, 2014 09:10PM MommyQ wrote: Felt a little woozy walking out of the infusion center today, but got some lunch with the hubby at Sonic, sitting out in the beautiful sunny 75 degree day, and felt better. Went for my ultrasound for the lump under my armpit after lunch, and found out that it was just fluid...a seroma. Whew. It's small, so we're just going to leave it alone. It's right up next to my TE, so it'd be risky to try to take a needle to drain it. Went out for dinner with the hubby and kids at a great Vietnamese place and the Pho tasted great. That means my taste buds haven't gone all funky this time yet. My head is sweating and I'm alternating between being hot and cold. Hot flashes, I guess! LongIsland: Thanks for posting that article. I think it's great how celebrities are sharing their stories. It raises awareness for people to be more proactive in managing their health. I made the mistake of thinking I was too young to have cancer and ignored a small lump a year ago, which got bigger this year and well...here I am. Linda: Thanks for the compliment on my photo! I didn't know Joan Lunden has BC. Seems more and more celebrities are going public with their diagnoses. I guess it's become more publicly acceptable. Timbuktu: Good luck figuring out what to do. It's good you have the best docs helping you. Mompv: Drinking is important and I also find that it's hard to drink as much as the docs want you to! Have you tried Gatorade? That seems easiest for me to drink. Or lemonade or tea. I get so tired of plain water. Swissmiss: Sorry to hear of your air conditioning and cough woes. Glad your Taxol went well. Footballnut: Hope your nail thing is no big deal. After your post, I looked at my nails and I also have a vertical line on both thumbs and one index finger, although mine are fairly new since this last infusion, so they're probably chemo induced. I'm interested to hear what you find out. Lena-Lou: Welcome to the board! jbokland: Congrats on your wedding! Y'all look beautiful and happy! Well, it's late and I should get to sleep. Have a good night everyone!",
      "MessageIndex": 1912,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 15, 2014 02:40PM MommyQ wrote: Hello ladies! It's been a while since I've posted, but I've been reading all your posts daily. I think it's pretty cool that a bunch of you are done or almost done with chemo, and that time has flown since April when we all started. Before you know it, it'll be April 2015 and we'll all be looking back on this as just a small blip in our lives as we carry on and return to life as it was (or as close as possible) pre-chemo. It's a beautiful 75 degree day here in St. Louis, so I'm going to go take a short drive to the pet store with the convertible top down, to get some pinkie mice for my daughter's snake soon. I know they say we're supposed to avoid sun exposure, but I think we need some in order for our bodies to make Vitamin D, which is good for us. I drove about half hour in the sun last week and I think I tanned a little bit, but no burn. I want to thank those of you who recommended the Buff head coverings. It was a LONG time ago, so I don't remember who mentioned them...sorry!  I now have 2 and find myself wearing those a lot because they are easy to put on and take off, and easy to wash. Plus they're cooler for summer. Everforward: My good days aren't as good as they used to be either. Starting with treatment #4, I've felt like I get tired in general a lot easier & have been tired more days during this cycle.  And like you, my muscles are tired all the time. Just walking up the stairs makes my muscles feel like I've biked 30 miles. I can't wait to regain my energy when the chemo is done! Hang in there. Only 2 more to go! Holly: I'm the same way! Before chemo, I'd never be found sitting still. Now, I'm almost always on the couch! But I tell myself it's only temporary. And am enjoying reading, shopping on the Internet, and watching movies while I'm stuck on the couch. :) Lena-lou: 102? Hope your fever has continued to drop. If not, I hope you've called your doc. Next week, I get my TC #5 of 6. #5 & #6 are optional for me, but I think I'm going to do them anyway. The more the better, right? Have a good day!",
      "MessageIndex": 2127,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 19, 2014 10:22AM MommyQ wrote: Timbuktu - My MO said that the recognized standard treatment for my diagnosis is 4 rounds of Taxotere and Cytoxan. There is no scientific proof that any more cycles will improve my outcome, although she said new research is being done to see if 6 is better than 4, so I guess some think there's a possibility it's better.  Due to my cancer being advanced (3 cm tumor and 3/16 lymph node involvement), she'd like me to do the extra 2 cycles, as long as my body tolerates it. She figures that in case 6 is better than 4, she'd like me to get the 6. So, while I'd love to stop now with 4 done, I guess I should go ahead and do the 6. linda505 - LOVE that card, LOL.",
      "MessageIndex": 2182,
      "PostDate": "19/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 21, 2014 06:03PM MommyQ wrote: Footballnut: That's so awesome that Scott pulled you up on stage and let you go backstage. That's a special night you won't forget. :)  Re: Tamoxifen, I'm going to be on it for 10 years and am nervous about it, too. Not so much the common side effects but the rare super scary ones (like blot clots and cancer of the uterine lining). Hopefully, they truly are rare. brigadoonbenson: I'm happy to hear you had very few SEs from the Tamoxifen. Maybe there's hope for us all! linda505: \"ducking\" steroids...LOL. I get to start those tomorrow, woo hoo! :P  I hope your liver enzymes are ok tomorrow. But if they aren't, remember...you are in charge of your treatment. Your MO is there to provide advice/recommendations, but in the end, if you don't want to go on with any more treatments, it's really your choice. Re: SEs, I too can't seem to kick the fatigue for round #4. I go in for #5 Wed and I don't feel fully recovered yet. I'm SOOO looking forward to being done with chemo! mikishelley: Thanks for the report \"from the other side.\" It's good to have an idea of what's to come, good or bad. Sorry to hear of the problems you've had with IVs in your veins. So, if you had your port still, would they have been able to use it during your exchange surgery? I'm just curious, since only certain nurses are allowed to access them. I just don't know how available these special nurses are for non-chemo related events. MomMom: I can't wait to get my port out either. I asked my MO about \"maintenance\" for a port left in after chemo. She said although the official guideline is flushing it once a month, it really only needs to be flushed about once every 3 months. She had one patient who went several years before getting it flushed and it was fine...although my MO wouldn't recommend that! :) For those who have finished chemo, CONGRATS!!! For the rest of us, hang in there! We will get through this, one day at a time!",
      "MessageIndex": 2223,
      "PostDate": "21/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 21, 2014 06:45PM - edited Jul 21, 2014 06:46PM by MommyQ mikishelley: That's good to hear. I'll have to think about keeping mine a bit longer then. Thanks for the advice. I don't have my exchange surgery until Spring 2015, due to radiation following chemo, and a 6 month wait period between finishing rads and the exchange surgery, to allow all the skin/tissue to settle-out/heal to a steady state. So, I'd have to keep mine in for at least 8 months after my final chemo.",
      "MessageIndex": 2226,
      "PostDate": "21/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 24, 2014 03:48PM MommyQ wrote: It's 80 degrees and sunny today. WHAT? But it's July!!! Yes, it's unseasonably pleasant for us today. Normally, it would be 95-100 now. Just enjoyed a beautiful top down ride to the hospital for my Neulasta shot. Now I'm just dreading the muscle aches that are sure to come! I'm starting to feel a little tired, so I'm trying to catch up on this board before I go into chemo-induced hibernation for the next 3 days! Lakegirl1: I too need lots of rest stops when walking, starting about 5 days after infusions, and they last about a week to a week and a half. I think it's anemia. I also had one day when I felt lightheaded. I was outside in the heat and humidity and drinking a hot Starbucks mocha. I went inside the air-conditioned Starbucks, took my pulse (120 bpm!), stopped drinking my mocha, and downed 16 ounces of water. I felt a bit better about 1/2 hour later. I've been minimizing caffeine since then and making sure keep hydrated & cool. Seems to help. Longislandl8y: Congrats on finishing chemo! Yay! You're so lucky you got to keep a lot of your hair! I'm completely bald from TC. Best of luck with rads. I will be joining you in that about a month later.  Swissmiss: Not the A/C again! Hope they fix that for your quickly. Glad you were able to move up your sim.  Let us know how that goes. BlessedMe: Welcome! Glad to hear this board has been helpful for you. It's so great that we can share our stories and help each out! HollyHope: That's reassuring to hear you're getting your hair and energy back, and Tamoxifen is going well! Woo hoo! Things will get better! MomMom: Congrats on finishing chemo! Woo hoo! That was so nice of your grandchild to make you that poster! clarrn & Everforward: Sounds like a lot of us are having the issue with the high pulse rates. I have it every cycle, from day 5-10. My MO said not to worry about it unless there's bloating in the legs/arms, chest pain, difficulty breathing, or lightheadedness. On the flip side, I noticed a super LOW pulse rate on the night of infusion #4 of 49 bpm! Freaked me out. I've never seen my pulse rate drop below 70. Ever. In my entire life. Last night, after infusion #5, I measured 55 bpm. Still low but not as frightening. It's working it's way back up today, around 80 already. Do you (or anyone else here) get the super low pulse rate on the night of chemo? Mscaruso: With a year of treatments remaining, I recommend you get the port, also. I didn't like it for the first 3 days because I had some muscle aches from the way the doc positioned my head during the surgery, but now, I'm glad to have it for my infusions. Much less painful that finding a vein in the arm! MakeLemonade: Congrats on coming up to the final Taxol! Sorry to hear about the cellulitis. Hope the meds start working soon or they get you something better. ColdInCanada: Congrats on kicking 6 rounds!  applepop: Early congrats on finishing! Last round of dark days to be followed by much better days!",
      "MessageIndex": 2298,
      "PostDate": "24/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 27, 2014 11:22PM MommyQ wrote: Ditto on hot flashes,  I guess. I wake several times during the night hot and sweaty.  Had my infusion Wednesday. Out of breath and 110 bpm this weekend with little exertion. I don't like not being able to do things. Sounds like it's happening to a lot of us, so I guess it's normal and we just need to be patient with it. I watched all 6 Star Wars movies with my daughter so I would sit still and rest these past 3 days.  Hope everyone is doing ok. One day at a time, we will get through this!",
      "MessageIndex": 2336,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 21, 2014 09:38PM MommyQ wrote: ColdinCanada: That's one busy PS you have! Must be a good one. I can understand you wanting to achieve some balance. Haha! :) Interesting you mentioned Vitamin D helps reduce muscle aches. My muscles felt constantly sore, as if I had just run a marathon, starting around the middle of my chemo treatment (#3, I think, like you). It had subsided towards the end. This was about the same time the weather got nice and I started driving around in my convertible with the top open, for 15-30 minutes at a time, every couple of days. I wonder if that good ole Vitamin D-generating sunshine did the trick? Hey, I ALMOST sat on the floor at Target but I really didn't want to, so I suffered in my squatting position until I couldn't take it anymore and had to get up and go! Glad to hear I'm not the only one who made a butt groove on my couch! :D",
      "MessageIndex": 2572,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 21, 2014 11:42PM MommyQ wrote: Jaimieh: My taste buds are off majorly today, too, so I feel your pain. Hubby and I went to Hardee's for dinner tonight, and the burger and fries tasted so bad that I only ate about 1/3 of each. The only positive to my taste buds being wonky for the last week is that I've lost 5 pounds! Unfortunately when the new taste buds grow back, I'll put that weight right back on by eating too much!",
      "MessageIndex": 2574,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 24, 2014 09:18PM MommyQ wrote: Hello folks. It's been a while since I've posted since I've gone back to work now, although I've still been reading the posts and trying to keep up. I've also been spending more time over on the Fall Rads Board since I'm doing rads now. At 6 weeks PFC, I have soft fuzzy hair about 1/4\" long, which is so thin that I still look bald from 2 feet away. It's black on top and white on the sides. I'm gonna be a skunk! Or a reversed skunk, I guess. :) My eyelashes continue to fall out and they're almost completely gone on the bottom and about half there on the top. Eyebrows are falling out AND growing in at the same time. Weird. I've mastered penciling in fake brows now, just in time for having to start plucking wayward brow hair that are growing in in the wrong places. And I shaved my legs about a week ago. It was the first time since about 3 weeks into chemo. It was soft, fuzzy, light colored hair, which is weird because it's normally black.  Does anyone still have their port in place, like me? I'm waiting until after rads are done to get it taken out. I figure I'd try to do only one thing at a time medically! I think my MO said that I'd have to get it flushed every 3 months if I kept it in.  By the time rads are done, I'll be just 2 weeks short of 3 months. :) mmtagirl - That's a perfect description of the TEs! You said that it felt like wearing an iron bra, and I thought, \"YES! Exactly!\" I've had mine in since April and will have them for about 6 months after completion of radiation in October before my PS will do the exchange surgery. So in total, I'll have them in about a year! EverForward - I too found the TEs got more comfortable after a fill or 2. I think when they were empty, they sat flat and had ridges that poked me in the ribs. Once they filled up a bit, the ridges went away. It's so nice that everyone is starting to feel better and recovering well from chemo. We had a rough summer, didn't we, but we made it to the other side just fine. ",
      "MessageIndex": 2789,
      "PostDate": "24/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 20, 2014 09:10AM MommyQ wrote: linda505 & jaimieh: Sounds like the LGFB program has a standardized program and bag and just the goodies in the bag vary depending on what donations they receive.  That's cool.  Some of the other posters here said they didn't have a good experience, so maybe the program is just now getting more organized??? I dunno.   linda505: That's too funny that the LGFB teacher tried to rub off your real brows! All the ladies at my class still had their brows too, so we all just used the brow pencil to fill and shape.  I still have all of my eyebrows, although when I was plucking the straggler hairs last week, I noticed they pulled out with little force and didn't hurt at all! So, while it was nice to pluck with no pain, it was an indicator that the rest are probably going to fall out soon. :( Lakegirl1: My MO told me that my acne is due to the Dexamethasone, so if you're taking that, it might be the cause. I broke out all over my upper chest and my upper back a few days after taking it. It's about cleared up today, just in time for my next dose of Dexamethasone! Sheesh. Ddkath70: Yes, I had the bone and CT scans. The injection is for the bone scan and has to be injected 2.5 hours prior to the scan. For the CT scan, they'll have you drink the special smoothie 2 hours, 1 hour, and right at time of the CT scan, plus they'll inject you with the tracer (?) at the time of the scan.",
      "MessageIndex": 964,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 13, 2014 02:27PM MommyQ wrote: Hello! It's been a few days since I've been on the website, so I'm not sure what everyone's up to or if this question I want to ask has already been addressed. I'll catch up soon. But for now, I have a quick question about getting fitted for a wig at a local wig place. My hair started falling out yesterday (12 days after TC infusion), so I want to go get fitted for a wig soon.  My question is this:  Are we supposed to give a tip (gratuity) to the person who helps us select and fit the wig?  And if so, what % range is the norm? Thanks in advance y'all!",
      "MessageIndex": 790,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 13, 2014 06:48PM MommyQ wrote: OK, I just caught up. Sorry for the slow responses. Hope all the Moms had a good Mother's Day! linda505: Thanks for the tip on drinking stuff other than water. I switched to apple juice, lemonade, and Vitamin water, and the variety and taste make is much easier to stay hydrated! ColdInCanada: Thanks for clarifying what you mean by exercise. I feel much better now. Oh, and the snails said \"Hi!.\" :D Oh, and I spoke too soon regarding the eye twitching. My left eye started twitching a bit about 3 days ago. Now my right eye just started today. DOH! LovebeingNana: Thanks for the tip on changing nausea meds to prevent headaches. I'll have to mention that to my MO next week at my next infusion. And hang in there. Chemo is tough but we're tougher and we'll get through it! One day at a time. Jaimieh: Hi! You said you lost my eyebrows on TC last time about 6 weeks after all your chemo was over. How many infusions of TC did you have? I'm just trying to prepare for when mine will fall out. I'm to have 4 to 6 infusions, depending on how my body handles them. Golfingirl: I too experienced dizziness everyday until about 8 days after my infusion. About 6 days after the infusion, I noticed that my heartbeat was rapid. I took my pulse and found that I had a resting heart rate between 100 - 120 bpm. I talked to my MO and she wasn't sure what the cause was, but we both agreed that maybe it was anemia causing it.  11 days after the infusion, it dropped just below 100 and it's been hovering there for the past 3 days. She told me to monitor it and go to the ER if it went above 120 AND I had any chest pain or shortness of breath. Timbuktu: Day 14 is the last day of nadir for the C part of your TC (Nadir is days 5-7 for T, days 10-14 for C), so that may be why you're tired. I think rest is probably better than pushing it if you feel tired. It's like your body is saying, \"Hey, take a rest and heal!\" mikishelly: Glad to hear you made it through your WBC scare! Whew! Ddkath70 & babygoose: Welcome. You've found a great group of ladies here that are all very supportive and helpful. Together, we will get through this.  Ddkath70: As far as level of sharing, it's a personal preference. I chose to share with family, closer friends, and co-workers, but not with my Facebook group. It's just what you're comfortable with. But all the people I've shared with have been greatly supportive, so it might help to share with some people. I understand why you don't want to share with your FB network...makes sense. Sorry to hear you just got laid-off. Hang in there. You'll get through this. BTW, I have the port, and had the CT and bone scan recently, so let me know if you have any questions about those. Also, I'm on TC. My MO said the A part of the A-CT is rougher on the heart so she didn't recommend it for me, since I'm young and my heart will have to keep me going for a long time. That's great your MIL will be flying in to help. My MIL also came in for 2 wks and it was great. She cooked and cleaned and got the kids to school, so my husband could continue to work. Regarding products, I had to buy unscented body butter (Body Shop Aloe) and soap (Dove) because any scents made me nauseated. Biotene mouthwash is nice because it's minty/refreshing for when your tongue feels and tastes weird. Baking soda/salt/water mix (1/2 tsp baking soda, 1/2 tsp salt, 4 oz water) seemed to keep the mouth sores from occurring. Flushable moist wipes help with any irritated skin after bowel movements. Footballnut & jhodro: Thanks for letting me know about the tipping not being required. I am just the worst at knowing when I'm supposed to tip or not! I think I'm going to go tomorrow to get fitted.  Have a good evening ladies! ",
      "MessageIndex": 802,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 23, 2014 11:35AM MommyQ wrote: Good morning and happy Friday, ladies! Starting Day 3 and feeling pretty good although starting to feel a little tired. Vision is a little blurred like last time, but without the white-ish filter like last time. Food starting to taste a bit wonky. clarrn: You rock the bald! I love the placement of the background spikes, even if it was accidental. :)  And that coworker of yours? How inappropriate. Sheesh. I guess people just don't know what to say to us, eh? Timbuk2: Rest and you'll feel better. When I couldn't sleep, I'd just lay down. It helps. And drink fluids. Flush this crap out! merg: Call the doc. It'll ease your mind. mmtagirl & EverForward: I had a neighbor compliment my wig (\"nice haircut!\") on a walk the other day and I simply said \"Thank you.\" :) I didn't want to explain the whole cancer/chemo/wig story. I figured it's ok to keep it simple & just accept a compliment. She might be confused next time I walk by with a different wig though! :D SharonDe: I too have some hair left and thought it was ALL supposed to fall out after the 1st treatment! What's up with that? My MO said it was all going to fall out on day 14. Oh well. Maybe day 14 after this 2nd treatment the rest will go... Have a great day!",
      "MessageIndex": 1074,
      "PostDate": "23/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 1, 2014 06:55PM MommyQ wrote: Ddkath70: You're welcome! I hope the Rx clears it up for you. :)",
      "MessageIndex": 1301,
      "PostDate": "01/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 12, 2014 05:22PM MommyQ wrote: clarrn: Glad your Taxol went well. Sorry your PiCC line didn't last and they're having problems accessing your veins. I'm sending good vibes your way that the next 10 go better. linda505: Thanks for the tip on Valium. I've don't know much about and have never been on Valium so I don't really have an opinion. :) My doc gave me a muscle relaxer (Flexeril) after my BMX, but I'm trying not to take so many meds, so I guess I'll just suffer for a few days. I hope you get clean CT scan results and more energy back on Friday. Nita: Sorry to hear about the burning throat. Would something cool and smooth like a milkshake work? I hope it gets better soon. Footballnut: You have a home nurse bring by your Neulasta shot? Wow, that's nice. :) I have to drive to the hospital to get mine. In fact, just got home about an hour ago. Well, I think the fatigue is starting in now, so I should go rest. Wishing everyone well with their treatments and recovery.",
      "MessageIndex": 1545,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 20, 2014 03:09PM - edited Jul 20, 2014 10:02PM by MommyQ Timbuktu: Better safe than sorry, for sure! I found the website that my MO used when determining my treatment so you could look at it too. I don't see any treatment plan which only consists of a total of 3 treatments. I can't remember which chemo drugs your MO has you on, but if you go to the following website, you can look at the recommended treatment regimens listed:    http://www.nccn.org/professionals/physician_gls/f_...    Click on \"Breast Cancer.\" On the following page click \"NCCN Guidelines for Patients (Stage I and II Breast Cancer)\" and go to page 44 and 45.  Those 2 pages list all the recommended treatment options for HER2- tumors. There are a bunch of them! Maybe you can show this to your MO.",
      "MessageIndex": 2199,
      "PostDate": "20/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 22, 2014 01:06PM MommyQ wrote: Timbuktu: You're right. If the consumers stop buying the \"bad\" stuff, the stores will change what they offer. But it's going to take a lot of educating to get the consumers to understand what's bad. I personally never looked at ingredients a couple of years ago...blissfully unaware of all the bad stuff.   And I also agree that you can't just take the fact that the label says \"Natural\" and buy it. We need to actually read the ingredients to see what's in the product, and understand what are good and bad ingredients. I'm learning a lot this year about what these are so I can hopefully make smarter decisions going forward. Ddkath70: I suppose it could be a combo of the chemo AND the fibromyalgia. Have you tried acupuncture? My sister-in-law has fibromyalgia and says it helps her a lot. 109 degrees is way too hot to go out! I know people say it's a \"dry heat\" but 109 is still HOT. :) You're lucky you're almost done with chemo. Yay! I have #5 tomorrow but I am doing a total of 6 so I finish mid August. I also can't wait until the treatments are complete! SharonDe: I can't stand up for very long either. I guess it's all related to this muscle weakness we're experiencing. It's good to hear you're working your way up to some exercises. I plan to do that too after I'm done in August. Well, on this day before the chair, I felt well enough to meet my coworkers for a fun lunch to catch up. Since my treatments are 3 weeks apart, I've been scheduling lunches every 3 weeks, right before each chemo. It's been a good way to keep in touch with everyone at work, since I'm on short term disability during chemo. Everyone is so supportive, it's nice to see them.",
      "MessageIndex": 2245,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 22, 2014 05:16PM MommyQ wrote: linda505: I agree with Sharon. Plus the Herceptin and Anastrozole will also protect you. I'm jealous you get to do your exchange surgery soon! I can't wait to get these TEs out!!!  clarrn: Sorry to hear you're in the hospital. Hope they get you all well again soon.",
      "MessageIndex": 2252,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 19, 2014 06:14PM MommyQ wrote: Best wishes to everyone having treatment tomorrow. My #2 is Wednesday. :S This past week was nice and SE-free, with the exception of losing most of my hair between Day 13 and today (Day 20). I still have a tiny bit of hair left, but not much. Last Thursday, I went to a local wig shop and got a new wig. Fortunately, my insurance should be covering the cost of the wig 100% since I've already reached my max out-of-pocket on medical payments! linda505: I also had a fill this morning and went to LGFB this afternoon. I only went with 60cc though because the 100cc last time was too uncomfortable.  The LGFB went well. There were 5 of us and we each got a gift bag of good makeup! A professional cosmetologist went over how to apply each makeup item in the bag as we each applied the makeup to ourselves, and then went over scarf tying and other options to wigs. Very organized and well executed. I attached a photo of the gift bag and the stuff in it. There was makeup from Lancome, Estee Lauder, Elizabeth Arden, Mary Kay, OPI, Smashbox, Kiehl, Cover Girl, Biore, Olay, it Cosmetics, and NYC. It looked like they ordered the gift bags from the ACS, who collected and assembled the makeup, which were donations from the big cosmetic companies. ",
      "MessageIndex": 946,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 20, 2014 10:52AM MommyQ wrote: rosemamma88: Welcome. Sorry to hear that the cancer is back after a BMX. I too thought that after a BMX, the chances of reoccurrence would be really low or nil. But chemo & rads should get rid of the rest. Regarding the port, my MO told me that my chemo drugs (TC) are rough on veins and didn't want to have to do an IV for me 6 times for the infusions, due to the damage chemo would inflict. That's why she had me get the port.  I don't know which chemo drugs they are recommending for you, but like Linda505 said, you'll get the Herceptin since you're HER2 +, and you'll probably be glad to have the port instead of having a new IV done each time for a year.  It looks a bit weird but it's pretty easy to cover up and is only temporary. clarrn: I bet you're glad you're on the last AC infusion! Yay! That's great that your mom can take care of you, too. Hey, I'll be in the chair tomorrow too, and also really don't want to go! Only TC#2 for me, but like you said, I can cross another one off my \"to-do\" list. :) Good luck to everyone!",
      "MessageIndex": 971,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 13, 2014 12:25PM MommyQ wrote: Timbuk2 & clarrn: Sorry to hear about all the recent troubles and stresses. Sending positive vibes your way.  Everforward: I LOL-ed reading your post about wanting to punch Miss Perfect in the face!!! Well, it's a happy day for me today. I am sitting in my chair, getting my 6th and last chemo treatment! Yay! My MO gave me a leia to wear and I get to ring the bell when I'm done. One more journey to the dark place and back, and then...radiation! OK, I'm not looking forward to rads, but at least I've reached a milestone in this journey. Here's a pic from my chair.  Best wishes to everyone for good minimal SE days. ",
      "MessageIndex": 2490,
      "PostDate": "13/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 22, 2014 10:51AM MommyQ wrote: Love seeing all the photos of y'all! You all look great! It's appearing that the pirate knot is very popular this year! It's my favorite scarf knot too! Here's a pic my hubby took of me in the chair for TC#2 on Wednesday with my pirate look (sans patch). :) I still have about 5% of my hair, which was buzzed with a #4 razor and just looks weird. I might ask hubby to shave it down shorter.  mikishelly: Sorry you feel bad today. Hang in there and get some rest...it'll help!  I think that pirate ship party would be a great idea for a get-together for us! It'd be great to meet each other and party once we are all done with chemo and can all drink again. :) BTW, I see a lot of posts on nausea, so yesterday, I asked my nurse what anti-nausea meds they were giving me. I get an IV injection of Kytril followed by a 20 minute drip of Emend right before my T&C. It seems to work for me.  No nausea yet...fingers crossed. LongIsland: On infusion days, I get blood drawn and then in a half hour, I see a nurse who goes over my blood work results and SEs to see if anything needs to be tweaked, and then go to the infusion room next door. I don't see the MO before each infusion or even in between infusions. Wishing everyone minimal SEs and a good day! Don't over-do it ladies. If you're tired, take a nap. You're allowed to! :)",
      "MessageIndex": 1035,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 14, 2014 10:35PM MommyQ wrote: Hmmm, it sounds like a lot of us are in the same boat. Totally shocked to get BC with little or no history. I sure hope docs can figure out the cause(s) soon. I would like it if my 2 daughters didn't get BC, too. In the meantime, I'm trying to buy more organic foods, and get rid of products with synthethic fragrances, parabens, sulfates, and phthalates; BPA containers and flame-retardant clothing; oxybenzone in sunscreens, etc. MakeLemonade: My MO sent an order over to the PT office yesterday and I was supposed to get a call today from them to set up an appointment, but I never heard from them. I'll have to call tomorrow if they don't call me first. I want to get rid of this cording now!!! Thanks for the info on LE massage up through first week of rads. Good to know. Wow, yeah, tell your period to stop already...YIKES! I had 2 periods during early chemo and then they stopped. So now chemo is done, I wonder if it'll come back. Probably. Yuck. Ddkath70: Yay, another rad buddy. :) I've been lucky in St. Louis this summer to have very mild temps. Usually, it's crazy hot & humid here in the summers (90s-100s), but it's been 70s-low 90s so far, so I've been walking my dog when I feel up to it (when I'm not out of breath taking only 3 steps). SwissMiss: I think it's gonna take several months before we can ditch our headcovers, unfortunately. :( I hear it takes a while for the hair to come back. Glad you're feeling better each day, though! MomMom: That's great that rads are going well for you and port removal was a piece of cake! I haven't decided whether to get mine out before rads or wait until after they're done. Timbuktu & Mscaruso: I'm always amazed when I find out about others who've beat BC. There are SO many of us out there. You can't tell by looking at them because they've resumed a normal life, and we will too. One day at a time. We'll get there. :)",
      "MessageIndex": 2504,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 18, 2014 10:13AM MommyQ wrote: Brigadoon and Linda: Yes, Saturday was very scary. I think I'm better now, thanks. I'm a bit nervous to be home by myself today though.  I just need to be careful, make sure I eat and drink, and take it easy.  I'm also keeping the cell phone with me at all times. Linda: I'm jealous that you get your exchange surgery soon. That's great! I can't wait to get these cannonballs out, and I'm sure you probably feel the same way. :)",
      "MessageIndex": 2532,
      "PostDate": "18/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 29, 2014 04:03PM - edited May 29, 2014 04:07PM by MommyQ Mompv: I know these decisions are hard to make...there's no right or wrong choice...just trust your gut after you have all the facts you can find. I was in a similar situation to you. My MO told me that my 2 choices of treatment were TC (Taxotere and Cytoxan) every 3 wks for 4-6 treatments or dose-dense AC (Adriamycin and Cytoxan) every 2 wks for 4 treatments followed by 4 treatments of Taxol every 2 wks.  I was also given the option of participating in the NSABP B-47 Herceptin study for HER2- patients.  My MO recommended the TC because like linda505 said, the Adriamycin is hard on your heart. My MO said if I were older, she might recommend the dose-dense AC+Taxol, but since I'm only 43, and will need my heart to be in good shape for many many more years to come, she recommended the TC. I also confirmed this recommendation via a 2nd opinion from another doctor, who told me that these 2 treatments are very similar in results with AC+Taxol being maybe 2-3% more effective (essentially the 3% improvement your MO quoted also) but with more heart risks.  Now that I've had 2 TC infusions, with my resting heart rate at 95-120 bpm for the full week after infusion, I'm personally glad I didn't choose the AC+Taxol to tax my heart even more. That's just my experience. Everyone is different. As far as the Herceptin study, I chose not to participate, due to my own selfishness in wanting to be just done with chemo after the 6 TC infusions. Participating in the study would have required me to come in every 3 weeks for the Herceptin until a whole year after my first infusion, AND I would have to come back regularly for years afterwards to submit blood samples for the study. It was hard enough dealing with having to do chemo for 4 months, after having a BMX, and knowing I had radiation, an implant exchange surgery, and 10 years of hormone therapy to follow. Just too much for me.",
      "MessageIndex": 1242,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 29, 2014 10:16PM MommyQ wrote: mmtagirl: I haven't noticed any change in my skin despite also reading that it would be dry. I guess we should consider ourselves lucky with that! :) As far as my period, one started on the day of my first infusion (yuck!). It's been just over 4 weeks since infusion #1 and my period hasn't started yet. Since I'm usually on a 25 day cycle, I'm 4 days late and wondering if it's going to just stop or if it's going to go into some weird cycle. I'm kinda hoping it just stops. I wouldn't miss it. :)",
      "MessageIndex": 1255,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 1, 2014 03:47PM MommyQ wrote: Ddkath70: The white stuff on your tongue could be thrush. Call your MO and describe it. If it is thrush, they can prescribe either Fluconazole, a single dose pill, or a prescription mouthwash that can get rid of it.",
      "MessageIndex": 1299,
      "PostDate": "01/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 29, 2014 08:51PM MommyQ wrote: Happy coffee day! It's nice being able to drink it once more. It tasted so bad during chemo! My hair is about half of what Cold has. But it's nice that it's coming back finally.",
      "MessageIndex": 2799,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Oct 2, 2014 04:42PM MommyQ wrote: Eyebrows? What are those? :) At 7 weeks PFC, mine are still mostly penciled in, although I do see some short stubbles coming in slowly. Eyelashes haven't started coming back yet, though!",
      "MessageIndex": 2814,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 6, 2014 01:59PM MommyQ wrote: Thanks for all the responses! It's so nice having a place like this for us to talk and share our experiences and share helpful advice! brigadoonbenson: Thanks for the welcome! You're so lucky to have little SEs! Good luck to you on Wednesday! linda505: Sounds like we both (and several others on this board) have similar discomfort with our TEs & slightly cloudy vision. I guess those SEs must be normal. On Sunday, I called my MO because I read 100.6 degrees when I woke from a nap. Turns out I was just overheated from blankets because it dropped to 99.8 by the time my MO called me back a few minutes later.  She asked if I had any signs of infection (redness/heat/swelling around TEs, pain urinating) and I told her no.  She told me that it was unusual to have a fever from infection until midcycle because that's when the blood counts are down, but to just keep monitoring my temperature and to NOT take any Advil or Tylenol, which would mask any fever I might have. Oh, and I DID have the Neulasta shot on Thursday, May 1, the day after my chemo. clarrn: I think you're right that chemo makes everything exacerbated! And yes, I did take the Dexamethasone on chemo day and the 2 days flanking it. Blueberry4: I've also been dizzy and feeling generally off balance since the infusion. I hope the dizziness and TE pains lessen before the next fill and chemo!  I hope your hair appointment went well. Spunky825: Welcome! I am also on TC (started 4/30), so we can share and compare war stories. :) ColdInCanada: I find that I also raise my temp if I do too much, but I've been laying around a lot! I increased my fluid intake yesterday to about 2.5 quarts of water and felt better. Maybe I was dehydrated too because I wasn't drinking enough. Hope that snow goes away soon for you!  chknfeet: Glad you didn't end up having to stay at the hospital and they got your temps back to normal. I tried drinking a lot of water yesterday and DID feel better, so hydration must be the trick! My TEs also poke my ribs and my armpits! I can't get comfortable for long in any position so sleeping has been in spurts of about 3 hours at a time. So, are the TEs feeling better since you skipped a fill? My PS wants to do a lot of fills early on because she said that it's easier to stretch everything within the first 6 weeks after the insertion. However, since I can't swap the TEs out for my gummy bear implants until after chemo and radiation are both done plus a 6 months wait (so we're looking at April 2015), I probably could slow it down a bit on fills. :)",
      "MessageIndex": 649,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 7, 2014 08:41PM MommyQ wrote: OK, I'm tired of drinking water. I drank too much last night and it actually made me throw up. Fortunately, I only threw up water and some peanuts I had just eaten. :) I just noticed that my heart rate is running around 120 beats/minute. Anyone else have a fast heartbeat from chemo? I put a call into my MO to ask but haven't heard back yet. How are y'all exercising so much? I can barely manage just the half mile walk to take my daughter to school! Brigadoonbenson: I don't take anything for pain since my MO said no Tylenol or Advil. My pain's not too bad. Just the muscle pains from the TEs. I just try to lie down & rest a bit when they bother me a lot. LoveBeingNana: I too have had a lingering headache ever since my infusion. I'm on day 8 today and it's not too bad today, but it keeps coming back every morning! If you figure out a way to get rid of them, please let me know. And good luck to you tomorrow for your next infusion. Spunky825: I think I need to dial down my fills like you. My first fill was 60cc and I didn't even feel it at all. The 100cc 2nd fill followed immediately by chemo did me in.  I also understand your tiredness making it hard to exercise.  Chknfeet: I'm curious to hear what your PS says about filling early. Maybe it's just something my PS believes in...who knows. I'd like to slow mine down since I have months to fill them! ColdInCanada: Thanks for the tip on Claritin for headaches. I'll give that a try. Sorry, I don't have the eye twitching so I don't know how to help. Mikishelly: Sorry to hear about the bone pain. But no WBC? That's scary! Hey, I see you're also in St. Louis and also on the TC chemo, like me. I'm doing my chemo at St. Luke's. How about you? jhodro: I too have shoulder range of motion problems on the side where they took the lymph nodes. I scheduled an appointment with a PT hoping to see her soon but her first appointment was 3 weeks out! I guess there's a shortage of PTs. Have a good evening, everyone!",
      "MessageIndex": 694,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 4, 2014 12:17PM MommyQ wrote: Golfingirl & Mompv: Great pics! Footballnut: Yay, you pooped! I did too! Hey, we gotta celebrate all the good things. :)  Sounds like your nail thing will be ok and probably is the same thing your mom had. ColdinCanada: I'm finding I'm getting more fatigued with each treatment too, starting with #3. I guess the docs did warn us! :) That's weird with the black tongue! At least your kids are getting a kick out of it. SharonDe & Lena-Lou: My tastebuds started getting wonky yesterday (day after infusion), so I hear ya. Looking forward to getting them back in about a week or so! Sharon, that's a cute pic of your pup! Lena-Lou: enjoy the beach. Even if you sleep a bunch, I think getting some fresh sea air is probably good for you. I love the beach.  Linda & Footballnut: That's so cool that the Bucs/Rock sent y'all those gifts. Yes, there are good people in the world. Mompv: Oh, after reading several posts from others about freezing juice, I remembered this. I use a Zoku to make slushies out of juice. You freeze the Zoku overnight and then pour in juice (or whatever fluid you want), and stir it for about 15 minutes on and off to make the slushie. Great for summer. $20 at William Sonoma or other places (http://www.zokuhome.com/pages/slush-shake-maker) Wendy: Welcome to the board!",
      "MessageIndex": 1942,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 7, 2014 07:57PM MommyQ wrote: Hello everyone! Having a low-key couch potato day here on Day 6 post TC#4. So out of breath, so I can't do much else, but happy the muscle aches from the Neulasta have gone away, and I'm not constantly napping like I did all 3 days of the July 4th weekend. Chest muscles are crazy tight over my TEs still. I guess that's the price I have to pay for wanting to have boobs again. :) Everforward: Good for you in spoiling yourself with a spa day. You deserve it! Footballnut: Glad you were able to find some relief with the percocet. Hope you continue to feel better as you get this chemo out of your system. SwissMiss: My port isn't painful, but the muscle under it and my shoulders ache for several days after each infusion. Timbuktu & Cold: I love the comments about brushing teeth & showering and not needing a nap being big accomplishments for us these days. So true! Today's the first day since Friday that I haven't napped (I had my chemo on Wednesday), so I was so happy! I actually read some and watched a movie (\"Kinky Boots\" - it was ok...something different). Timbuktu: My pulse is high for about 5 days (runs over 100 at REST) starting on the 4th  day after each infusion. I just try not to do too much to keep it down. If I just do something mild, it's over 120 bpm easily. I find myself constantly out of breath. It's the anemia. jbokland: Thanks for posting pics of your port removal surgery. It's good to know it's not a big deal. Whew. SharonDe: Glad to hear you have water again. Yay! Sandra: Hang in there. We all hate that we have this disease, but at least there is a treatment. We will get through this and get our lives back! LongIsland: My insurance covered part of my genetic testing with Myriad Labs, which ran about $4,000 USD total. I ended up paying about $350.  LongIsland and MakeLemonade: Are y'all doing conventional rads? Have you looked into Proton therapy? It sounds safer for the heart and lungs, so I'm going to ask my MO about it. Just trying to find out if anybody else is considering it. It's not available everywhere yet, but more facilities are currently being built.",
      "MessageIndex": 2011,
      "PostDate": "07/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 20, 2014 07:13PM MommyQ wrote: SharonDe: Happy Birthday! I hope dinner goes well for you. mikishelly: I didn't think employers could just end your insurance. Isn't that illegal? Discrimination? Anyone here know? Sorry I don't. As far as the port, you can leave it in as long as you want, but you have to get it flushed out every 4 weeks if you're not actually using it. I think some folks keep it in for future blood draws. I haven't decided what I'm going to do since I won't be done until August. clarrn: Sorry to hear about the Lymphedema. I'm sure your specialist will be able to help you with steps to prevent it in the future. I read that one of the things you can do is to sleep with that arm elevated above your heart to help with the fluid drainage. Good luck.",
      "MessageIndex": 989,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 22, 2014 12:19PM MommyQ wrote: Thanks, Sharon, LongIsland, and ColdInCanada! I definitely DID feel Hollywood chic with my scarf and sunglasses being chauffeured to the hospital by my hubby for infusion day! :D Since I lounge around in \"slacker\" clothes at home, I thought I might dress up a bit to go out, even if it was just to go sit in a chair for hours in the hospital, LOL. Sorry, Cold, I gots to keep my tote bag. It's the perfect size for schlacking all my stuff to my treatments. :)",
      "MessageIndex": 1039,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "May 22, 2014 11:05PM MommyQ wrote: Thanks mikishelly! The scarf was a present from my MIL.  I hope you had a nice nap today!  Swissmiss: Your wait time seems a bit long in my opinion as well. I don't think you should have to wait more than 30 minutes each in the waiting room and the exam room. Your doc could be overbooked. So, I learned on Wednesday talking to my nurse that when my tongue turned white after my first infusion, it was some sort of yeast infection fungus and I should have called them for drugs to fix it. So, today, when I noticed my tongue starting to turn white again, I called. They phoned in a prescription for Fluconazole, a one dose pill. FYI, in case it happens to you. I just thought it was a regular SE that they didn't tell me about. Well, I just enjoyed some chocolate ice cream and am ready to call it a night. Have a good evening, ladies!",
      "MessageIndex": 1057,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 22, 2014 09:22AM - edited Jul 22, 2014 12:47PM by MommyQ Footballnut: I only found out about all those chemicals being bad for us recently so I DO now pay attention to the products I buy & try to avoid them, mostly in products that cover a bigger percentage of my skin surface area. So, I look at body lotions & sunscreens mainly. As far as cosmetics, I figure they are applied to a much smaller skin surface area, so I'm not as concerned there. (Note: I only eyeliner and eyebrow pencil, so that's why I'm not as concerned regarding makeup). Many companies do offer good products without those pesky bad chemicals. I just bought a Burt's Bees lemon oil to use after showering because it's 100% natural and smells good without artificial perfumes. Everything Burt's Bees is 99% or 100% natural.  I also like their lip shimmer, which smells like peppermint and adds a bit of natural looking color, again with no synthetic perfumes.  I also use a Body Shop Aloe body butter, which doesn't have any of the bad ingredients and is fragrance free. I also started looking at sunscreens and trying to switch to physical blockers, meaning ones that use titanium oxide and/or zinc oxide, which don't get absorbed into the skin, instead of the bad bad oxybenzone, which is readily absorbed and is a hormone disruptor (BAD!). But I do allow myself to spritz on perfume here and there as a treat because I LOVE scents and can't give them up 100%. Moderation is key to everything, IMHO. jhodro: Congrats on your last chemo! Whoo hoo! Ddkath70: You're not alone. A bunch of folks on this board, myself included, are always out of breath even just walking a few steps. The fatigue IS cumulative, like they warned us. It just sux. I can't wait to get my energy back. I also started getting muscle aches after my TC#4. My leg and arm muscles all feel like I've done a crazy workout after doing such minor things. Do you have that issue too? I wonder, since you're also on TC.",
      "MessageIndex": 2242,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 22, 2014 05:08PM - edited Jul 22, 2014 05:11PM by MommyQ Timbuktu: Haha, yep, to the electric chair we go tomorrow! :)  You're right-on about the mini-vacay lunches. Good distractions and reminders of our normal lives that we'll get back to soon! To prepare for the chair, I thought I'd go to Target & pick up some yogurt to eat this week (to hopefully help with chemo-induced-bad-tummy-week). So before going, I was thinking that while I'm there, I might as well pick up school supplies for my 8th grader. So, I go & arrive home from Target with the school supplies, but no yogurt. Chemo-brain attacks again.....argh!!!  Sigh. I even had a list. Oh well. I'll go out later after dinner & get my yogurt at the grocery store. I like their selection of flavors better anyway. :) Footballnut: I hope you have better luck with Taxol than Taxo-terrible. I'll be in the chair tomorrow 9:30am for Taxo-terrible.  Interesting what you said about different interpretations. My husband and I do the same thing too. We hear things totally differently and sometimes one of us hears something the other doesn't hear at all!  I think different people just have different expectations and that causes us to hear different things. That's why it was great to have a companion during all the initial diagnosis and planning of treatment appointments with all the doctors!  Re: bad ingredients, I see you like shea butter, too.  The Aloe body butter I use has shea butter as the #2 ingredient (after water) and seems to be free of the bad ingredients (as far as I know...please correct me if I'm wrong). If you're interested (and no I don't work for them and am not pushing their product!), here are links to both the Canadian and the US product pages for this item, which list the ingredients in one of the tabs on the page:  http://www.thebodyshop.ca/en/body-moisturisers/body-butter/regular-body-butter/aloe-body-butter.aspx http://www.thebodyshop-usa.com/shop-by-line/aloe-skin-care/aloe-body-butter.aspx",
      "MessageIndex": 2251,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 5, 2014 12:31PM MommyQ wrote: Hi Ladies, Wow, this forum really DID go quiet over the weekend! I hope that means people were out doing things and living life. I was! I was doing low key stuff, but still...stuff! I was having problems being out of breath early last week, but it progressively got better by this past weekend, so I was able to get off the couch a bit more, and actually take the dog on short walks.  Gotta celebrate all the little things. SharonDe: You know what I mean. Like being able to walk up the stairs! :) We went to see Guardians of the Galaxy this weekend, and we all really enjoyed it. If you like any of the Marvel movies (Avengers, Thor, Iron Man), you'll like this one, too. I also watched the first three Bourne movies (borrowed them from the library) with my 13 year old daughter, and enjoyed those, too.  Trying to get #4 from Redbox but it hasn't been available the times I've checked. Went to my PT yesterday and she \"graduated\" me! Woo hoo! Done with PT visits. I still need to continue with my stretches and exercises to keep my body in good shape for my exchange surgery next Spring.  During this visit, my PT realized I had AWS (axillary web syndrome), or \"cording.\" That's why my arm hurts when I reach up high or forward. She said the chemo & rads make it worse, so it won't get better until after rads are done. Then yesterday, I booked a Mediterranean cruise for the hubby and I for next summer to celebrate our 20th anniversary (and finishing my treatments & surgery). Looking forward to that!  Neither of us have been to Europe before. I hope everyone is doing well. EverForward: Early congrats on finishing TCH Wednesday! Don't be scared...you can do it! You've been doing great all summer...it's just one more.  I hope your muscle fatigue has gotten better (same to you ColdInCanada). MakeLemonade: I hope you got good news yesterday from your BS and got all the RO & insurance stuff figured out. Insurance can be great and it can be a royal pain, as I think we've all experienced at one time or another. I remember disputing bill after bill after birthing my babies during my maternity leave! linda505: I had the same problem with my insurance (docs using labs unapproved by insurance, back when I was having babies). It's really not fair for us to be responsible for things out of our control. There's gotta be a better way. I hope they figure it out soon. clarrn: Congrats on your anniversary!  Timbuktu: It's understandable how you (or any of us) might feel depressed as a cancer patient. We have a lot to worry about, and chemo knocks us on our butts.  But, you can do it! Take it one day at a time & after chemo is done, I think it'll get much better.   Ddkath70: Glad you found a wig you like. I found it's nice to have a good wig, so I can at least look normal when I go out in public and not draw any looks. Have a good day everyone!",
      "MessageIndex": 2400,
      "PostDate": "05/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 14, 2014 10:27AM MommyQ wrote: MakeLemonade:  Thanks!!! Looks like we'll be doing rads together.  That's great you like your RO and can make it to Cali! Please let me know how simulation/set up go.  I meet my RO for my initial consultation tomorrow morning. I think we should join both the Summer and Fall Rads groups. Summer Rads folks can warn us about what to expect.  Fall Rads folks will be on our schedule, so we can discuss our day to day stuff as we go through it together.  Hope your hemoglobin levels are getting better. As far as your comment about being betrayed by your body, I don't know if that's how I feel. I think I'm more confused why I got breast cancer. I am not predispositioned by my genes to get it and only have one case of breast cancer in the family, which was one cousin. I just don't understand how I got it. Maybe it's my love of everything fragranced (perfume, soaps, lotions, etc), with all the parabens and styrenes that did it. ",
      "MessageIndex": 2493,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 11, 2014 10:38PM MommyQ wrote: clarrn: Woo hoo, another chair buddy for today! :) I hope yours went well. Mine went well, although my TEs got uncomfortable during the Taxotere infusion. Don't know why. Well played chemo card with the cop, BTW! ;) Footballnut: Congrats on finishing your round 3 of FEC! Hope you feel better soon. Macintx: I too am glad I'm not the only one with this weird white-tongue-not-thrush thing going on! My T&C is 1.5 hours long, so I was able to manage keeping ice in my mouth. However, all that melted ice meant a bathroom pit stop between the T & C. :) I'll let you know if this keeps the white tongue away in a couple of days. You're lucky you didn't experience any taste changes. ",
      "MessageIndex": 1526,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 22, 2014 09:25PM MommyQ wrote: Jaimieh: Sorry my 5 pounds found their way over to you. Maybe I can take them back from ya next week. :) Hang in there. Only one more bad Friday to go and you'll be DONE!!! I'm recovering from my last chemo that was 9 days ago. Just starting to feel less fatigued today, and I can see my tongue starting to turn from white to pink again, which means taste buds are starting to come back! Next week should be fairly quiet and then I go back to work the week after that, just after Labor Day. By then, I'll have been away from work for FIVE MONTHS! Yikes. Gonna be rough, going back!",
      "MessageIndex": 2577,
      "PostDate": "22/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jun 18, 2014 03:36PM MommyQ wrote: Footballnut: I'm bald and have the sweaty scalp! I didn't start feeling this until infusion #3. It's on and off. I just assumed it was because the weather just got hotter.",
      "MessageIndex": 1667,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Jul 23, 2014 09:15AM MommyQ wrote: In da chair for TC#5! Just got my Kytril & now getting 20 mins of Emend. Taxotere & Cytoxan to follow. Talked to my MO right before the chair and she said she doesn't see cases with lung or heart damage anymore due to radiation because rads have gotten much better these days. Whew. Good to hear. I noticed that I had some prominent looking veins in my legs so MO wants me to get a doppler run on them to make sure I don't have some blood clotting going on in the area. CLOTTING? Scary to me. She didn't sound worried about it though. Sharon: Disney is a great motivator. I was tempted to use the scooter at Target recently but huffed it around the store instead. Great cartoon!",
      "MessageIndex": 2254,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 17, 2014 12:49PM MommyQ wrote: Timbuktu: Wow, glad you got that misunderstanding cleared up & there is no malignancy, but sorry you had to worry all week! linda505: I'm sending positive vibes that your bone scan is clear. SharonDe: Thanks! I'm happy to have finished all 6 chemos. Now I just have to get better from this round to close this chapter. SwissMiss: I think Tamoxifen can start either same time as or after rads are finished. I have a 3 week PFC followup scheduled with my MO for first week of September just to see how I'm doing. It's worth a call to see if you're supposed to have a follow up visit and also to go ahead and schedule your post-rads visit to get on hormone therapy. Your MO could have forgotten to schedule you when you were there for your last chemo.  Good luck with your port removal (let us know how it goes) and your mammogram tomorrow! ************ So, we had a bit of a fright yesterday. I had my 6th TC chemo on Wednesday. Yesterday, at lunchtime, I made a sandwich and got a drink. I felt lightheaded, was breathing in short shallow breaths, and was sweating profusely as I sat down to the kitchen table. Feeling weak, I put my head down on the table. My husband said I passed out for about 15 seconds. Freaked him out completely since he was holding me and said my eyes were open but I was unresponsive. He yelled to wake me and I finally did. He moved me to the couch where we took my pulse, and it was like 42! Scary!!! I guzzled some Gatorage and laid down on the couch to rest, where my pulse went back up to the 60s. I think I was dehydrated because I didn't drink anything all morning (I know, stupid me!).",
      "MessageIndex": 2522,
      "PostDate": "17/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 20, 2014 08:31AM MommyQ wrote: Swissmiss: Glad to hear your \"deportation\" went well. :) I hate shots but I guess getting a couple of shots in an office is better than doing the full hospital surgery (no eating, IV, early start, etc).  I was wondering how they close up the hole in your vein after they pull out the tube, but I guess it closes on its own because they don't do anything but just pull it out! I watched a video on YouTube last night and was amazed how simple the port removal procedure is. ColdinCanada: Thanks! I'm hopeful for no more scares as I recover from this last chemo infusion! Sorry to hear about your surgeon forgetting to file papers to refer you to the PS. That IS annoying. You'd think they'd do that sort of stuff practically on autopilot. Is the one year wait due to healthcare rules? Or is there a way to shorten that wait time? Ddkath70: Yeah, that makes sense to keep the port in for the IV they'll run during the CT scan.  My RO said that he wouldn't be using contrast dye for my CT. I wonder why your RO is using it and mine isn't.  I think I'll just keep mine in just in case he changes his mind...at least until after rads are well underway. I'm impressed you've been working through chemo. I couldn't do it so I've been on short term disability. I got back on Sept 3 on a reduced 25 hour/week work schedule. I hope I can manage! Congrats on being completely done with chemo! That balloon wall was a cool idea. I bet it feels great to have all the balloons popped! Timbuktu: I agree it's so hard not being able to do things that we used to do without even a thought, but hang in there. Energy will come back! I went to Target yesterday to buy my daughter face cleanser. I was so tired just standing in the aisle, trying to read the labels, I had to squat on the ground, and I even struggled with that! I couldn't wait to get home so I could sit on the couch again! It's funny. Before BC, I almost NEVER sat down on the couch. I'm the type to always be doing something. Now I'm there everyday in the same spot. There's a dent the shape and size of my butt in that spot!  As far as being worried about recurrance, I think IF it does come back, we will be able to catch it very early and treat it, simply because we are so much more aware of watching for anything weird AND we're going to be at doctors' offices a lot from now on for follow ups, so they'll be another check point for early detection. Jamieh: You grew another hand! I thought that wasn't supposed to happen until radiation, LOL!  Good photos. :)  I like your cap, too. Hey, I'd ask your RO if he can do markers instead of a tattoo, if you don't like the idea of a tattoo. My RO actually prefers markers. Well, time to get off my butt and go take a shower before I take my daughter to get her braces off. Have a good day everyone!",
      "MessageIndex": 2560,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 25, 2014 10:57PM MommyQ wrote: Jen: Glad to hear your BMX went well and nodes are clear! That's great! linda505: love the cartoon! Jaimieh: Woo hoo! Last chemo is almost here! Sandra: 2 more to go! Yay! Re: the implants, my PS said the natural gummies have a 15 year life span where the rounds only have a 10 year, so I'm going for the gummies. I figure, the less surgeries the better. Everforward: I think it's going to take a while for our muscles to get strong again. I mean, we HAVE had to let them go for the last 4 months while we rested from chemo. All in time...But, at least the taste buds are back! Timbuktu: Eyes going blooey sounds scary. Glad you're ok now. Like you, I think I've learned to be more thoughtful of others after going through this. Before, I had no idea what to even say to someone who was diagnosed with cancer. jhodro: You're braver than me. I still cover up with wigs and hats whenever I go outside, even to check the mail! *********** Well, I'm 12 days PFC and the energy and the taste buds are returning, thankfully! I went to the PT today to have her start helping me with the cording. She did some massage and showed me how to do it on my own. I will see her again next week on Friday. Next week I also have my rads simulation Wednesday and my 3 week PFC checkup with my MO Thursday. Oh, and I go back to work next Wednesday. So, next week is going to be a busy week, but going back to work will help life feel more normal, I suppose!  Have a good evening!",
      "MessageIndex": 2592,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 28, 2014 11:14AM MommyQ wrote: Congrats to those who just finished with chemo! I'm now 2 weeks PFC and actually feel pretty good, although my head still gets sweaty several times a day (localized hot flashes???). I'm nowhere near my condition pre-chemo of course, but I don't expect that for many months yet. Two positives: my taste buds have returned (as have pounds I lost when everything tasted bad) and I have enough energy to walk the dog (albeit at a slower than normal pace, with stops to rest) for 1/2 mile. Yay! I return to work next Wednesday part time (25 hours/week), to allow me time for rads, travel for rads, and some down time for fatigue. We'll see how it goes. So, apparently, hair loss on the face continues PFC, as several of your posts indicate. I'm experiencing the same thing. 2 weeks ago, I had about 50% of my brows left. Today, I would say I have 30% left. As I apply brow pencil, I see brow hair falling out! My eyelashes have managed to mostly stay put. I think I have maybe 80% of my eyelashes and most of what fell out was on my lower lid. I gave up using mascara a few weeks after I started chemo because I was worried that the application and removal of mascara would make the lashes fall out.  Meanwhile, I have 1/8\" white fuzz on my head. It's ALL WHITE! I don't know what I'm going to do if the color doesn't return. I'm not ready for all white hair!  I was 30% grey before chemo and had my hair colored every 3 months. But I was recently reading about how bad hair dyes are so I don't know if I want to color it anymore. I suppose I could continue wearing wigs...bleck!",
      "MessageIndex": 2621,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 29, 2014 07:45AM MommyQ wrote: ColdinCanada: Well, that's good to hear that the hair with color can come in later. A skunk-do would be interesting. :) Timbuktu & Cold: I also have some longer hairs mixed in with the 1/4 inch white stubble. I'm not going to shave it. I'm going to leave it alone until it's all long enough to cut into some sort of hairstyle. Clarrn: Sorry to hear you got an infection. Good you got on antibiotics early. MakeLemonade: I agree with you. Losing facial hair made me feel more like a chemo patient than losing hair on top of my head! And yay for taste buds coming back! It makes eating much more fun. Have a great Labor Day weekend!",
      "MessageIndex": 2634,
      "PostDate": "29/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Aug 30, 2014 12:11AM MommyQ wrote: Exactly! There's so little hair, I'd feel bad shaving any of it! So I'll just cover up my stubbles and give my hair a chance to grow. ",
      "MessageIndex": 2637,
      "PostDate": "30/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Sep 3, 2014 11:08PM MommyQ wrote: Congrats to Footballnut and clarrn! Woo hoo!  Wow, Football, you're making me tired just reading about all the stuff you've been doing. Rock on! Linda: Yay, fuzz! :)",
      "MessageIndex": 2651,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Oct 3, 2014 08:21PM MommyQ wrote: Jaimieh - I am also contemplating coming out on FB, especially since it's BC awareness month (what better timing, right?). VeraAnn - I have tissue expanders (TEs) in place and will have them exchanged for silicone implants about 6 months after rads are done. Would that be an option for you? I'm attaching a photo of the back of my head, which shows the salt and pepper that's coming in. I'm excited to finally have a little hair, even if it's not much! :)  ",
      "MessageIndex": 2822,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Oct 3, 2014 08:27PM MommyQ wrote: clarrn - I found the survey you spoke of and took it. Here is a direct link to the survey, for those interested: https://www.surveymonkey.com/s/35JGYCP",
      "MessageIndex": 2823,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "MommyQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198998/profile",
      "Content": "Nov 2, 2014 09:21AM MommyQ wrote: mmtagirl - You're so right. I feel so much better now than I did during chemo (final tx 8/13). I just realized last night that I can easily touch my toes again! During chemo, I couldn't because my leg muscles felt so tight! I can also do stairs again without feeling like I just ran miles. Woo hoo! :)  What sort of SEs are you getting from the Tamoxifen? I just took my first pill 2 minutes ago. I finished rads last Wednesday. The 6 weeks will go by fast, plus the SEs aren't as bad as chemo SEs. I only had the burned skin, which is turning back to normal already, and a little fatigue (nothing compared to chemo fatigue).",
      "MessageIndex": 2874,
      "PostDate": "02/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    }
  ]
}