{
  "AuthorID": "momofcuig",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103787/profile",
  "Posts": [
    {
      "AuthorID": "momofcuig",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103787/profile",
      "Content": "momofcuig wrote: Hi Ladies, I am hoping someone on these boards can help me with a new symptom/side effect I've been experiencing. I had a right mastectomy with reconstruction in May 2010. The latissimus Dorsi Flap reconstruction was succesful in the sense that my new breast looks ok but my back (where the muscle was removed) has been nothing but trouble. I had at least 4 wound infections and 3 corrective surgeries over the past 12 months. It is finally healing. As part of my treatment I had 4 rounds of chemo.... cyclophpsphamide and taxotere. I also had approx 6 weeks of rads. My rads finished in December 2010. So now..... the new problem started about 7-8 weeks ago. I am waking up about 4-5 times per night with right hand numbness and pins and needles. The numbness includes my thumb and 3 fingers. My pinky is not always affected. It seems to be getting worse and more frequent over the past few weeks. I also notice when I was peeling vegetables today, I got a pain in my wrist that felt like a nerve jumping. Yesterday was my one year follow up appointment with my breast surgeon. I explained my new symptoms to him. He is sending me for an mri. He suggested it could be carpal tunnel, neuropathy from the taxotere or maybe a new cancer! If anybody has any thoughts or suggestions for me please let me know. I am going crazy with worry Dx 4/20/2010, IDC, 2cm, Stage II, Grade 3, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767466",
      "Title": "Hand numbness one year after mastectomy momofcuig Shrek4"
    },
    {
      "AuthorID": "momofcuig",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103787/profile",
      "Content": "Oct 19, 2010 10:54AM momofcuig wrote: Hello Gals..... Hope I can join this thread.  Starting rads on October 26th  Started Tamox a few days ago And started Antibiotics last night for my THIRD wound infection in my back from my donor site reconstruction in May. I am sooooooooooooooooooooo DONE with this cancer thing",
      "MessageIndex": 259,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    }
  ]
}