{
  "AuthorID": "Momof4blessings",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187819/profile",
  "Posts": [
    {
      "AuthorID": "Momof4blessings",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187819/profile",
      "Content": "Momof4blessings wrote: Hi- i am 26 years old- mother of 4 young children. I noticed a lump a couple months ago and decided to get it checked out. The dr said its probably fibroadenomas and I needed an ultrasound and come back in 4 weeks to check and see if its grown. I had the ultrasound and they said it looked like fibroadenomas. Then my dr called later and said that I need to set up a biopsy because the ultrasound had abnormalities- but that was all they knew. Has anyone experienced anything like this? I don't know what to think- it sounds like ultrasounds are pretty good at detecting fibroadenomas so I am afraid that it is cancer but can't get in for my biopsy till next week! Any info is helpful! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810865",
      "Title": "Abnormal ultrasound Momof4blessings faerie1111"
    },
    {
      "AuthorID": "Momof4blessings",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187819/profile",
      "Content": "Momof4blessings wrote: So I posted earlier this week about my \"abnormal ultrasound\" and I was misinformed and was told that I would have a biopsy on Tuesday well after waiting 20 minutes on hold I was told it was just a consultation- the radiologist and my obgyn thinks its fibrodanamos- and I was told to come back in in 4 weeks the. After the ultrasound they said I needed a biopsy. I was given no number but one of the nurses said \"please don't worry it's fibrodanamos and those are benign\" I wanted to say \"you don't know that for sure!\" But I was just curious how soon after consultations the biopsy would be? And so I'm waiting a week for my \"consultation\" and then they called yesterday (on a Saturday) left a message saying that they needed to change my appointment to Wednesday!!! I am just feeling so alone and scared. I know God is in control- and I am praying that he will use me to bring Him glory no matter what the outcome...but I feel like everyone already thinks I'm dying and talks about me like I'm not there- and everyone is like \"tell then you can't go Wednesday and you have to go Tuesday\" and that's not how drs do things--- Ugghh I just hate waiting! I am definitely praying for everyone who deals with waiting and/or dealing with breast cancer Dailey! I am ashamed I haven't before this! Any feedback would be great! Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811039",
      "Title": "So frustrated! Momof4blessings Momof4blessings"
    },
    {
      "AuthorID": "Momof4blessings",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187819/profile",
      "Content": "Momof4blessings wrote: my biopsy for my probably fibroadenoma is on Friday - I'm feeling so anxious! I just wish I knew why the breast specialist would say \" it's definitely not cancer\" and then 4 months later decide I need a biopsy. And to top it all off I'm having terrible morning sickness- that'll be fun during the biopsy! Everyone I talk to says \" oh yore fine\" and acts like I'm so silly to be worried at all and even though they are probably right, it doesn't help me.. Just feeling anxious tonight :( Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816611",
      "Title": "Feeling anxious Momof4blessings Momof4blessings"
    }
  ]
}