{
  "AuthorID": "momof3kidz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70614/profile",
  "Posts": [
    {
      "AuthorID": "momof3kidz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70614/profile",
      "Content": "Aug 9, 2008 11:20AM momof3kidz wrote: Just wondering when you will get the results of your biopsy? I also just had a mammogram on Wednesday and found out Thursday that I have two areas of clustered and segmented calcifications, BIRAD of 4.  I go in for biopsy next week. Hope everything turns out benign for you",
      "MessageIndex": 3,
      "PostDate": "09/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719247",
      "Title": "cluster of calcification stressed Donna1843"
    },
    {
      "AuthorID": "momof3kidz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70614/profile",
      "Content": "Aug 18, 2008 01:55PM momof3kidz wrote: traveler56:  hi there--I think we had our biopsy on the same day.....same results from mamm also--microcalcifications, BIRAD 4.  Well, I got my results back on Friday evening, and I have DCIS.  I go back to talk to the doc on Wednesday.  I really hope that yours come back benign.  I'll be thinking about you! As for the sterotactic biopsy--it was pretty bad wasn't it!!??  I was numb until the end...it took alot longer than they thought it would, so I guess my numbing stuff was wearing off.  And I was quite shocked to see a big ole hole in my boob!  Its still bleeding on and off..... ",
      "MessageIndex": 15,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/719528",
      "Title": "What a day.... Genia Shirlann"
    },
    {
      "AuthorID": "momof3kidz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70614/profile",
      "Content": "momof3kidz wrote: First off, what kind of doc diagnosed you with BC?  What kind of doc performed the biopsy?  what kind of doc did your lumpectomy or masectomy? I have my biopsy on Thursday.  Doc is pretty sure its DCIS, but obviously only a biopsy can determilne that.  two areas of microcalcifications, family history of BC (mom and aunt). My ob/gyn ordered the mammogram and u/s. Once those results were in, he said i needed biopsy.  He said I could go to breast surgeon.  but I opted to go to my mom and aunt's oncologist.  Am I doing the right thing--seeing an oncologist?  If the biopsy shows DCIS--do I stick with the oncologist to do the surgery--and if I need reconstruction--I see a plastic surgeon?  Or do I let a breast surgeon do ALL the work?   Dx 8/15/2008, DCIS, Stage 0, Grade 1, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719449",
      "Title": "So confused about so many things momof3kidz Beesie"
    },
    {
      "AuthorID": "momof3kidz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70614/profile",
      "Content": "Nov 12, 2008 03:49PM momof3kidz wrote: I just had my bilateral mast (left was prophylactic) on october 30 and I had the SNB just on the right side.  We never discussed whether to do the left side.  The path report came back clear on the left breast tissue, so I feel comfortable not having done the SNB.",
      "MessageIndex": 6,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724151",
      "Title": "Having Bilat Mast--SNB Just on DCIS Side or Both Sides? ASL momof3kidz"
    },
    {
      "AuthorID": "momof3kidz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70614/profile",
      "Content": "Dec 4, 2008 09:56AM momof3kidz wrote: I am 4 1/2 weeks out from my surgery and I started picking up and carrying my 2 yr old last week.  My doc said I should listen to my body..... I picked him up a couple of times maybe 2 to 3 weeks after and I definitely was sore after and I regretted it....so Iaid off for another week.  Now I feel fine when I hold him.  BUT....I do not do it on a regular basis, not back to normal.  What I mean, is I dont walk around with him on my hip.  I might pick him up, talk to him, give kisses, etc...or put him in his seat, etc.  But that's it.",
      "MessageIndex": 4,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725339",
      "Title": "Experiences after BM with small children susan13 iwannabefree"
    },
    {
      "AuthorID": "momof3kidz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70614/profile",
      "Content": "Nov 2, 2008 10:43PM momof3kidz wrote: Hi ladies.  I had my bilateral and SNB on 10-30.  Surgery took right at 6 hours and I stayed in the hospital for 2 nites.  The SNB was initially negative.  The whole path report should be in next week I assume. I guess really overall--its not as painful as I expected.  More arm movement that I expected also.  I borrowed a recliner from a family member and I have been resting and sleeping in it.  The drains are the biggest friggin pain...they itch and hurt.  And this ONQ pain ball thing (anyone else have one?) is heavy, like a bowling ball.  But thank goodness--I get to pull it out tomorrow.  The 4 drains could have to stay in 2 to 3 weeks is what my doc told me, I really hope its no where near that long.  There is no pretty way to hide them.  I have been wearing tanks and zip up hoodies, but it looks ridiculous! Hope everyone else is doing well.....let's all keep each other updated. ",
      "MessageIndex": 26,
      "PostDate": "02/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723462",
      "Title": "Surgery's over, Now what? Firni lktracey"
    }
  ]
}