{
  "AuthorID": "momof3boys",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
  "Posts": [
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 19, 2011 03:50AM momof3boys wrote: Hi Jenn The problem is the studies say that (in my case) with an Oncotype score of 16, chemo and radiation aren't recommended...my doctors are saying; \"I'd still do it\" (my oncologist, who is a woman) and the radiological oncologist (who is male, same age as me and my husband). They've both said my case doesn't fall into one of the \"buckets\" with the Oncotype test, and the result (16) is a grey area... I'm thrilled with the score, but the tumor was large...so, it's kind of a contradiction.",
      "MessageIndex": 13,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 1, 2012 07:09AM momof3boys wrote: PCBarbie: your \"friend\" is unbelievably inconsiderate! When I was first diagnosed and decided to have a BMX, a good friend of mine (no breast cancer, perfectly healthy) told me I was making a mistake, that \"aggressive and more isn't always better\". Really? I'm the only person living in my head. I tried to explain how I came to that decision, and most of my decision came from knowing myself really well (I'm 43, not 23!) and what level of stress I could take with future testing on the \"healthy\" breast...She did apologize several days later. It amazes me what some people say.",
      "MessageIndex": 130,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 3, 2012 01:59PM momof3boys wrote: Hi lapace- I agree that the waiting is the worst part. Good luck tomorrow. I will say a prayer for you that everything goes smoothly with no SE!",
      "MessageIndex": 171,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 5, 2012 03:40AM momof3boys wrote: Hi Char--- I had terrible lower back pain from the Neulasta shot (you may not). A tip was to take Claritin the day before and for a few days after the Neulasta shot, to prevent that pain. My MO confirmed this yesterday on the phone w me ( why she didn't mention it before, I don't know) take the 24 hr kind",
      "MessageIndex": 224,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 10, 2012 01:57PM momof3boys wrote: Hi Kite Just got back from my RO appt. This is my 2nd opinion and is the head of the group. Totally different experience than the first guy who couldn't sit still for 5 min... This Dr. Had me first write down his cell phone number, and welcomed me to call him at any time with any questions or concerns. He then explained that he spoke to my BS. PS, and MO before meeting with me and went over my entire med file. He does think that there is a benefit to me by doing rads, because it was a large tumor in a smaller type body shape... But would not recommend radiating the lymph nodes under my arm or over my collarbone. He said the SNB was absolutely clear and there's no benefit to doing that much radiation, for me...and because of my age (43 considered young) he would recommend it. He was very compassionate and caring, asked how my boys were handling things. Said that it may be helpful to set up my appts for after school so the boys could come with me and they would let them operate the equipment and push the button, to take any fear or anxiety away... I still have until a month after chemo ends to decide, but he said it would potentially reduce my \"local\" recurrence rate from 15% down to 5%.... so lots to think about. But, I feel very comfortable with him....",
      "MessageIndex": 357,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 12, 2012 06:31PM momof3boys wrote: BelaT: my MO told me before my first TC treatment that I would either have diarrhea or constipation, either one, but she couldn't predict either way, each woman is different. I had diarrhea. She said to take Immodium for it. And to stay hydrated. I drink a lot of water, can't stand Gatorade.",
      "MessageIndex": 408,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 14, 2012 02:28PM momof3boys wrote: Kite- are you checking your temperature? I hope you're feeling better. Don't hesitate to call your MO!",
      "MessageIndex": 433,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 18, 2012 12:42PM momof3boys wrote: BMX with immediate TE on 11/11/11. Doing 4 x's TC, started 12/29 Probably rads to incision scar (no nodal involvement) 5 years Tamoxifen after all this... Oncotype Score 16",
      "MessageIndex": 569,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 20, 2012 10:59AM momof3boys wrote: Hi Char I'm sorry about the WBC... It's so cold here in Northeast PA and we're supposed to get snow tonight and tomorrow. Maybe your husband can order in from the restaurant you were going to and you can get cozy and watch a movie? I know it's frustrating... I have 3 boys 16,9,7.... It's so hard staying away from kids parties, basketball games, the carpool. I feel like a hermit. But, I'd rather I have to do this in January and Feb than in the summer... This too shall pass... Hang in there!",
      "MessageIndex": 631,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 22, 2012 07:56AM momof3boys wrote: Sorry.... It was much heavier and crampier than usual. My MO asked about it, and she made it sound like it was par for the course? I too find myself more emotional at times, we all have a lot going on and just thinking about this everyday is enough to make the strongest person crumble.",
      "MessageIndex": 679,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 25, 2012 08:59PM momof3boys wrote: Hi Nancy- I had my 2nd TC last Thursday (today is day 6)... I had a fast pulse on Sunday and Monday. But, read on someone's post that they had the same thing and their MO said the low white blood count was to blame. I didn't experience it yesterday or today. Good luck to everyone getting infusions this week. I've been pretty fortunate this time, just general achiness and tiredness. Emotionally, I feel more drained and have to continually remind myself that it is the chemo making me feel like crap, not cancer. I felt perfectly fine before starting chemo!",
      "MessageIndex": 764,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 7, 2012 11:33AM momof3boys wrote: There is a specialist in New Orleans (NOLA) that specializes in NET neuroendocrine tumors. His name is Dr Eugene Woltering. His email is: ewolt@lsuhsc.edu If you email him, I promise he will email you back. He's very kind and generous with his time. His mother was a NET patient",
      "MessageIndex": 2,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771079",
      "Title": "Neuroendocrine features kris529 momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 7, 2012 11:34AM momof3boys wrote: I'm sorry, it is: ewolte@lsuhsc.edu",
      "MessageIndex": 3,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771079",
      "Title": "Neuroendocrine features kris529 momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 22, 2011 01:00PM momof3boys wrote: Have to admit, today has been my hardest day so far... Went Wig shopping with my sister and friend and I just lost it when the \"wig lady\" put that first wig on me. It was so hard. It all became real. I'm so angry and sad right now. I'm so pissed off that I went for annual mammograms since 32 and in all likelihood had that damn ILC through my last one or two mammograms, I could scream! Why do Drs not have patients with dense breast get MRI's instead of mammograms?!?!?! Even if my insurance wouldn't cover it (who knows) I would have gladly paid for it myself if it was suggested!!!! So angry right now. I want to go on CNN and tell every woman that if their doctors mentions to them that they have dense breast, demand an MRI! Mammograms are not enough...",
      "MessageIndex": 34,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 29, 2011 01:39PM momof3boys wrote: Just returned home from my first of 4 TC treatments. Everything went well, got a stuffy nose and they diluted the \"C\"....other than that it went very smoothly. Have meds in case of SE.... They started me off with benadryl, a steroid and a \"generous dose\" (as per nurse) of Ativan. So, I was comfortable., Hope everyone has a good day!",
      "MessageIndex": 94,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 5, 2012 03:41AM momof3boys wrote: I think I experienced nightsweats last night...anyone else? From the chemo? (I'm 43, pre menopausal)",
      "MessageIndex": 225,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 29, 2011 02:03PM momof3boys wrote: Thank you, Nancy! It worked! I have to go back in tomorrow for a neulasta shot, and they'll schedule my next treatment. Should be three weeks from today if all goes well. They said to stay away from kids birthday parties (they know I have small boys), crowds, stores, church, definitely stay in on new years eve, etc.... That's fine, I'm happy to be home.",
      "MessageIndex": 96,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 14, 2012 02:25PM momof3boys wrote: PCBarbie Funny you mentioned Psoriasis...my husbands grandmother suffered from it terribly! When she was in her late 70's a new doctor had her go to a tanning bed every week and that helped, ALSO, he prescribed some type of chemotherapy! I remember thinking at the time (I was in my mid twenties) what? She doesn't have cancer, how can that be? But, it helped her immensely. I have no idea what it was (the chemo). Layla2525: once you get further along.... After the BMX and they check your nodes and do Oncotype testing, a medical oncologist will counsel you with options and recommendations. I actually met with my oncologist before surgery so she and the surgeon coordinated things (like pathology testing, Oncotype testing).",
      "MessageIndex": 432,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 9, 2012 08:31AM momof3boys wrote: Kite- or anyone else that wants to offer--- let me know how your RO appt goes tomorrow. I'm meeting with a RO for. 2nd opinion. The first guy I was referred to made me a nervous wreck! And I'm a pretty laid back type of person with a very stressful job, I don't rattle easy. He was up and out of his seat like 5 times, jumping around the room, left 3 times being interrupted by his nurses, etc. Reminded me of trying to get my 9 yr old to sit down and finish his homework... Anyway, I had BMX immediate TE reconstruction, no nodal involvement, no vascular invasion, and an Oncotype score of 16. I am doing the 4x TC (I feel like crap, but better than last week). When I asked my BS about radiation, he looked at me with a confused look and said \"no, there's nothing to radiate, we got great clean margins....\" My MO said \"I don't think so, but you have the right to a consultation by a RO... That's there this began with first RO. His thinking, because of the size of the tumor 5 cm and my aggressive approach (chose BMX and chemo, even with a low Oncotype score, he would like to see me \"clear the bases\" and finish up with radiation (of course Tamoxifin after tx) I don't want to miss anything, and realize that surgeons want to do surgery, MO want to do chemo and RO want to radiate. I have an appt tomorrow with an older RO. He's actually the founder, head of the group. So I'm hoping he can explain it better, and sit still....",
      "MessageIndex": 323,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 22, 2012 07:53AM momof3boys wrote: Hi Everyone- Today is day 4 out from my 2nd TC infusion. I kinda feel like I was placed in the back of a tractor trailer and a giant picked it up and shook it. I just feel sore and achey everywhere. I have no nausea, thankfully, but no appetite either. My weigh in the other day showed that I lost 2 lbs between the first and 2nd treatment, not too bad. My goal was not to gain any, especially towards the end, when I felt completely normal and healthy and forgot about the first week after treatment. I have a friend that went through this and she warned me about the tendency to gain weight between treatments, so I'm trying to remember that.. I think fir her, after her chemo was done, she was more depressed about the weight gain than anything. MissYo- I got my period right on time, just a few days after my first chemo treatment. It was much heavier and crampi",
      "MessageIndex": 677,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 17, 2012 08:31PM momof3boys wrote: My hair story.... It's day 19 for me from my first TC treatment. About a week or so ago, I swear I felt that chemo go right to my scalp. Next couple of days a tingly sensation and a sort of slight scalp ache. Then nothing for days, yesterday, day 18, it started to fall out. At least it's falling \"evenly\", not in clumps. It was shoulder length until I had it cut short (pixie) 3 weeks ago. I thought it would be less traumatic for me and my boys, especially the little ones (7&9). I felt really bad tonight because my 9 year old walked in on me in the bathroom and I was crying....now I feel so guilty that he saw me. He gave me a bug hug and told me that he loved me and that hair is just dead cells, anyway! He's such a sweet little boy. That's the worst, that my kids have to deal with this....",
      "MessageIndex": 539,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 17, 2012 08:41PM momof3boys wrote: Thank you, Rachel. I hate washing my hair too... It's just inevitable. At least my \"other\" hair has had to decency to also depart!",
      "MessageIndex": 541,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 29, 2012 06:51PM momof3boys wrote: Ecpelkey-I'm sorry you're having so many issues, maybe the Neulasta will help with those. If you're going to ask your MO about it, do it quickly. I didn't know anything about it, not even that my MO was going to prescribe it for me. About two days before my first infusion, I got home and opened a letter from my insurance company. It was a weird letter, kind of like a \"congratulations letter\" (didn't actually use the word congratulations) but said something o the effect that they're pleased to inform me that my Neulasta Shots were approved ad part of a complimentary chemotherapy treatment. I was perplexed, since at that time I didn't even know what it was. My MO explained that it's very expensive ($3500 per shot) and not every insurance company will approve. So, just in case it needs to be submitted, ask now.",
      "MessageIndex": 839,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 28, 2011 06:15AM momof3boys wrote: Hi PC Barbie- my chemo starts tomorrow, too. 12/29... I'm doing TC x4... I'm also one of the \"grey area women\" that didn't fit into one of the three buckets after my Oncotype score came in at 16. But, like you, my tumor was larger and I'm \"younger\" (43). After getting more opinions, especially from my MO (really like her) I decided to go ahead with the chemo. I'm getting anxious by the minute. I did take a tour of their \"chemo\" facility last week. It's on the other side of the oncologist offices, and looks like the Ritz Carlton... I'm not sure what to bring with me, I've seen lots of suggestions, but the nurse there said they'd have everything on hand that I may need. She actually suggested that I might want to bring a lunch..(I thought she was joking at first) then she said, \"you'll be here for about 4-5 hours, you'll probably get hungry\" I hope I do feel well enough to eat... I'm in good shape. Not overweight, exercise everyday. I'm nervous about gaining weight and have held steady through the holiday treats. My MO Stressed that it is important not to gain weight during chemo (or afterwards) so, I'm going to make that a priority.",
      "MessageIndex": 82,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 1, 2012 05:58AM momof3boys wrote: Oh Lynne That is awful! Do you think it was the Ativan? Just a little too much? I hope you're not too bruised today...good sign you're up for a walk. :-)",
      "MessageIndex": 127,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 3, 2012 11:22AM momof3boys wrote: Hi Everyone Day six after my first of 4 TC treatments, and I'm feeling fine. Had breakfast, got the kids ready / to school, went to the PS to get \"filled\", went to my office for a bit to catch up, then met my husband for lunch. Feeling pretty good, but cold! It's 17 here and windy! My chemo \"class\" was short on details too (like toothbrushes, nail polish, mouth sores, etc). I heard 99% of it here on these boards. My theory is that they don't want to tell you too much, because it can be scary and make you more anxious than you need to be. My MO gave me her cell # and told me to call her at any time with questions or concerns, she didn't know which SE I may or may not have, but would address them as they came up. Thankfully, besides being achey (from the Neulasta), I've haven't suffered any other side effects yet, so, I don't want to obsess about them either. For me, the worst part of starting chemo was thinking about starting chemo and the anxiety of having horrible SE. Luckily, I've been feeling pretty good, and I'm sure will be less anxious when my second treatment comes up. Now I don't have that \"fear of the unknown\"",
      "MessageIndex": 169,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 11, 2012 07:30PM momof3boys wrote: Oh Cat I'm so sorry! Saying prayers for you now. That just stinks!",
      "MessageIndex": 381,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 20, 2012 07:03AM momof3boys wrote: I guess I'm confused about Rads... I had BMX with TE reconstruction. My surgeon said \"no radiation, there's nothing to radiate! I got great margins and there's no nodal involvement!\" he was adamant. My MO, when I asked her said, \"I don't think so, but, I'm not a radiological oncologist, and you have the right to an opinion from one.... So, she referred me (twice as it turns out, couldn't stand the 1st guy). Long story short, even with great margins (they both agreed to that), and no nodal involvement. They explained that my Low Oncotype score (16) is for Distant recurrence, not local recurrence, and since I'm \"so young\" (43, hahaha, don't feel so young) and tumor was larger than 2 inches, the protocol is to at least do rads to the incisional scar, bring down my 10 year local recurrence rate of 15% to under 5%.... My MO said that she totally agrees after hearing it explained that way and is glad she referred me to the head of this well respected group. Interestingly, one of her colleagues, a male MO, went thru BC a couple of years ago and also agreed to the incisional scar radiation. My cancer was on the right side, so I'm less worried about heart issues. I do have a lot of time to decide... Wouldn't start until a month after Chemo....",
      "MessageIndex": 627,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 23, 2012 06:12AM momof3boys wrote: Hi Nancy I have 3 boys and a busy household, and have also found myself saying the wrong \"word\" at times, which makes my boys giggle and obviously makes me nervous. Ive also done things like: light a candle and put the match box away in the fridge... I think it's a combination of being so preoccupied mentally and chemo and all of the other medications that we're not used to taking. Please take something for the constipation! My MO suggested Senocot and Colase (although I did not have this SE, just the opposite, actually). And I'm sure you're drinking lots of water. Don't let it get to the point of needing a suppository. I went through that after child birth and I think I'd rather go through labor than that again.",
      "MessageIndex": 707,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 18, 2011 08:08PM momof3boys wrote: Hi everyone! I'll be starting 4 rounds of TC the week between Christmas and New Years... I had BMX with immediate reconstruction on 11/11/11. Healing really well and feel about 85% back to normal (physically, anyway). My Oncotype score is 16, 10 w 5 years of Tamaxofin... So there was some back and forth on whether or not to do the chemo, but, I've decided to go ahead with it. Also, had a meeting about radiation on Friday that left me very confused. I had a good size tumor (ILC) but everyone agrees that the surgeon got exceptionally good margins. Surgeon and oncologist said they didn't think I'd need radiation, and really were on the fence with the chemo, but \"you have a right to get an opinion from a radiological oncologist\"... He recommends rads, too! Ugh.... Because of my age 43... And it was a large tumor. He said because of the clear nodes, and really good margins and pretty low Oncotype score, I don't fit into any \"bucket\", but if I were his wife, he would recommend rads. He is going to discuss with his tumor board (8 of them) and we will meet again on Jan 11th... He said they wouldn't even start rads until after chemo, so relax and absorb the info. He also said: \"given your profile (test results, etc) I'm not wrong if I decided not to do rads, or even chemo for that matter, but, we have no way of knowing if you're right, either\".... So confusing.,",
      "MessageIndex": 9,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 20, 2011 07:19PM momof3boys wrote: Happy Hannukah, Peggy!",
      "MessageIndex": 19,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 20, 2011 07:22PM momof3boys wrote: Got the date of my first chemo treatment (TC x 4) today. It is 12/29.... Still waiting for a consensus on radiation to follow... Going to look at wigs on Thursday :-(",
      "MessageIndex": 20,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 28, 2011 12:10PM momof3boys wrote: PC Barbie That is very interesting about the Oncotype score. I have not heard that! I think that would make a good thread for this forum, as I have read many instances of women with higher scores than mine turning down chemo because their score falls into the low risk category.",
      "MessageIndex": 85,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 1, 2012 07:28AM momof3boys wrote: Okay... Here's my rundown of day 4, post first treatment of TC (Thursday the 29th): Still no nausea, have not had to take the Zofran. Not much of an appetite though. Yesterday, had moderate pain/ achiness in my legs mostly that Tylenol was able to control. Ate 3 small meals yesterday, am able to sleep, waking up at 5 am for more Tylenol. Today I feel like I have a bit more energy. Poached eggs and toast w peanut butter for breakfast. Hope everyone else is good!",
      "MessageIndex": 132,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 4, 2012 02:30PM momof3boys wrote: Don't make the mistake I did, take Claritin the day before your Neulasta shot. I didn't know about this and suffered severe lower back pain yesterday, day 6 from first TC treatment. Thank God I had some percocet on hand. Other than that, I haven't been nauseous or too badly fatigued.. I think the anxiety of starting was the worst part. Good luck! Hoping for no SE for you..",
      "MessageIndex": 203,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 6, 2012 04:16AM momof3boys wrote: Hi Jenn28 My MO prescribed Ativan for me. It's a lose dose and I don't even take as much as she prescribed \"Take every six hours, as needed for anxiety\". I take one in the morning, and sometimes, like yesterday, I was anxious and depressed, I took one before bed and slept from 10pm till 6:15 this morning. Most days I just take the one. I'm not one to take medicine either (before this happened, I don't think you could find any Tylenol in my house that wasn't expired!) but, I definitely need something to take the edge off, so it's either the Ativan or vodka! Lol",
      "MessageIndex": 246,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 8, 2012 08:52AM momof3boys wrote: Hi Char My MO told me that it is advantageous to exercise and Not gain weight during chemo...better outcome. I'm trying as much as my energy allows. I've been getting out for 15, 30, minutes walks, since the weather has been so weirdly warm here for January in PA. I have a treadmill, but hate it., Strangely, my weight has remained the same since day before surgery, so that's good.",
      "MessageIndex": 301,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 8, 2012 03:39PM momof3boys wrote: I think I feel the chemo getting to my scalp- does that sound weird? Day 10 post 1st TC. Haven't lost any hair yet. But have this \"tight\" and \"tinglly\" feeling on my scalp. Also, I'm still achey. Anyone else?",
      "MessageIndex": 306,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 8, 2012 04:37PM momof3boys wrote: I am day 10....still feeling achey. Mostly in my arms, shoulders, a little leg pain. My worst day was day 5, but, I'm surprised to feel achey at this point? I'm a little tired, but I wouldn't say fatigued.",
      "MessageIndex": 312,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 8, 2012 05:52PM momof3boys wrote: Hi Krystal- it means that I'm having 4 \"rounds\" of chemo, three weeks apart of the chemo combination of taxotere and cytoxan",
      "MessageIndex": 315,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 13, 2012 06:40AM momof3boys wrote: Joyce - I had horrible bone pain too. I fortunately had percocet left over from my BMX and that helped. But, I did find Aleve worked better than Tylenol. Also, the girls on here told me that for my next treatment, take the 24 hour Claritin a day before the Neulasta shot and for 4-5 days afterwards. For some reason, that works. I hope you're feeling better today I'm also \"Joyce\"! XO",
      "MessageIndex": 415,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 21, 2012 08:56AM momof3boys wrote: Hi Char- my lower back pain didn't hit me until day 5 after the Neulasta shot last time. This time, I'm trying the Claritin trick. Today is day 3 after my 2nd TC treatment. No nausea, but woke up able to feel every square inch of skin on my body-- kind of like \"sore to the touch\" it's odd. I think a massage right now would be painful. Put my wig on for the first time today...so sad. Feel bad that I kind of snapped at my baby Cooper (7). He asked me 3 times to take it off and show him my head. I did it cheerfully the first time, so he could see it's just me, then tearfully the 2nd time, then the third time, I snapped, \"no, I'm not a circus act!\" oh boy. I hate cancer.",
      "MessageIndex": 649,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 17, 2012 10:07AM momof3boys wrote: Rachel-- that's an interesting dilemma to cover or not cover your wig.... I can see that as a Seinfeld episode! I did get a few very nice and reasonably priced hats and sleeping caps from a website called headcovers.com",
      "MessageIndex": 1286,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 23, 2012 03:24PM momof3boys wrote: Nancy- we had a similar issue a few years ago with my husband. It turned out that if he received his chemo (a once a month shot @ $6000) at the hospital, as opposed to the oncologists \"office\", it was fully covered. I'm confident your MO's office will have the answer.",
      "MessageIndex": 1403,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 2, 2012 01:18PM momof3boys wrote: I'm not in the same situation as you and I'm sure others with more experience will post, but, I am getting chemo and getting my white blood count checked before each tx. I asked my MO if she checked my blood for anything else (I had no nodal involvement and no vascular invasion). She said yes and rattled off a bunch of things they are keeping track of... Two stand out: calcium, for bone mets, and liver enzymes (thankfully mine are normal) but at least I know she's checking.",
      "MessageIndex": 3,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782055",
      "Title": "Bad oncologist? Asking for advice.... Susan-33 Naniam"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 10, 2012 06:56AM momof3boys wrote: What type of cancer does she have? I think they do chemo for IBC before surgery?",
      "MessageIndex": 3,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782440",
      "Title": "Cancer like dandelion seeds? Sissydi Moderators"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Aug 17, 2012 12:59PM momof3boys wrote: I had nausea...RO said lots of women get it. He advised me to snack on crackers and peanut butter. It helped.",
      "MessageIndex": 3,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/792145",
      "Title": "radiation and nausea gracie1125 jennsmc"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 30, 2012 11:30PM momof3boys wrote: Just saw this... I am on day 24 of 28 for radiation tx...I am getting the worst pressure headaches late afternoon, early evening. I was wondering if it's from radiation, also. I am not prone to headaches, and I know it's not my bloodpressure (low normal). Is it radiation? Exhaustion?",
      "MessageIndex": 2,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/786388",
      "Title": "Radiation and headaches capers10 stephN"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 23, 2012 04:33AM momof3boys wrote: I met with my MO before surgery. She went over my MRI and biopsy results and consulted with my surgeon, instructing him where she wanted my tumor sent after surgery for testing and ordered the Oncotype testing. You need approval from your insurance co for that, so I'm glad she got that ball rolling even before my surgery. When I met with her after surgery, about 2-3 weeks after surgery, she had all test results in, and had a recommended plan. (Oncotype testing takes up to 3 weeks). Not sure how large your tumor is, some MO's recommend chemo before surgery, so depending on your personal situation, that's another necessary reason to meet with an MO before surgery.",
      "MessageIndex": 3,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786306",
      "Title": "MO Selection dventi voraciousreader"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 27, 2013 01:27PM momof3boys wrote: Sorry, just realized I posted on stage iv",
      "MessageIndex": 6,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802403",
      "Title": "Dairy Foods & Metastic BC Marybetz amontro"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 27, 2013 01:26PM momof3boys wrote: Idk....my mom was a dietician, and my dad had high blood pressure since he was in his 20's. I grew up with skim milk, low fat cheese, ice milk (remember that?), no soda, no salt, no canned soups, veggies, no salt, never tasted fried food until I was a teenager.... Kept those same dietary habits..... Still got BC",
      "MessageIndex": 5,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802403",
      "Title": "Dairy Foods & Metastic BC Marybetz amontro"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 29, 2011 02:19PM momof3boys wrote: I've heard of women choosing to sleep in recliners, too",
      "MessageIndex": 3,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780193",
      "Title": "Sleeping after Surgery mary625 Outfield"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 29, 2011 02:17PM momof3boys wrote: For home, I basically slept almost sitting up with lots of pillows for about two weeks. My husband helped me up in the morning. After that I was able to sleep on my side (not the SNB side) with a small pillow between my knees and by clutching a soft pillow to my chest for support. I had BMX with TE reconstruction, 11/11/11 I still can't sleep on my belly, and miss it so much!",
      "MessageIndex": 1,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780193",
      "Title": "Sleeping after Surgery mary625 Outfield"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 27, 2012 06:08PM momof3boys wrote: Bump",
      "MessageIndex": 1,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/784789",
      "Title": "Please Help, I'm Worried iamastar iamastar"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 29, 2011 09:42PM momof3boys wrote: Hi Pizza Dad What a truly heartfelt post. You're obviously a very caring and loving person. I agree with you 100% about the breast saving reports. I truly am happy with all of my doctors, but found it odd that they had the \"same party line\": \"It has to be your decision, you need to discuss it with your husband and decide\" The ONE Doctor that gave me a definitive opinion? My Aunt! She's my ob/gyn. She was blunt...\"get the BMX with reconstruction, and don't look back\" I was taken aback at first, but she has an interest in me personally, too. And I've truested her all of these years...delivered my 3 boys.",
      "MessageIndex": 25,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780146",
      "Title": "How do you decide? keepnfaith bdavis"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 29, 2011 09:57PM momof3boys wrote: Mine all said basically the same thing \"your options are a lumpectomy, UMX or a BMX, it's a personal decision you need to make\" \"you're not wrong with whatever you decide...\" I pretty much had already made up my mind. When my BS asked what my decision was, and I told him, there was a very visible sigh of relief on his part. He said that he thought that I made the best choice, that whatever my right breast was exposed to, my left one was too. I just wonder why they all said that same thing,\" it has to be your choice....\"",
      "MessageIndex": 27,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780146",
      "Title": "How do you decide? keepnfaith bdavis"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 13, 2012 01:06PM momof3boys wrote: Hi Dave I'm not sure of your wife's type of cancer, size of tumor, stage, grade, surgery, age, etc. My Oncotype score came in at 16. My MO was 50/50 on the chemo because it meant a 10% chance of recurrence, which is 'great'.... But, we finally decided to go ahead with 4 rounds of TC because of my \"young age\" (43), the fact that the tumor was larger than 2 cm, and the fact that even with negatives nodes, there's a possibility that there are undetectable cancer cells out there... The Oncotype score is for 'distant recurrence' and it just one \"tool\" that the MO should consider when it comes to chemo. I have 3 young boys, and psychologically, for me, I needed to know I was doing everything I could to raise my 90% chance of no recurrence, ever for an estimated (from MO) 1-4% benefit. It is a personal decision, I have seen many women on these boards with higher scores than mine not do chemo.",
      "MessageIndex": 11,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 26, 2012 01:50PM momof3boys wrote: Hi Bonnie- I hope this helps...my Oncotype score was 16. My MO was on the fence with recommending chemo for me because I didn't fit into any \"box\". My tumor was on on the larger side (typical for ILC, it forms more of a \"line\" than a \"lump), but I had no nodal involvement and no vascular invasion. Healed from BMX very well and quickly. We decided to go ahead with 4 tx of TC, because of my \"young age\" (43) and because my MO said the Oncotype score is just one of the tools that should be considered. It was a tough decision, but I'm glad I made it. It definitely helped that my MO is female, young (about 37-38 ish) and is considered brilliant. She went into BC oncology because her Mom had breast cancer 16 years ago. I also have 3 young children (7,9,16) and I'm determined to do everything aggressively to be here to see them grow up. If I was 65-75 with my \"scorecard' I probably would not hesitate, and would turn down the chemo with an Oncotype score of 16 with no nodal involvement and no vascular invasion.",
      "MessageIndex": 40,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 17, 2012 06:55AM momof3boys wrote: I feel really bad for you and your anxiety. Are you taking anything for it? Is it your anxiety or is it your MO's bedside manner that have put you in this state? My MO bends over backwards to be reassuring and calming. She's a Mom with three kids under 6, and her mother is a 16 year BC survivor, so she really 'gets it' and is very compassionate, yet professional. I never leave her office feeling anxious. My first RO, on the othe hand, was just the opposite. First time I left his office, I took 2 Ativan. When I told my MO this, she referred me to a different MO with a different personality, more like hers, very professional, matter of fact, prepared, and kind. Maybe you need a change in MO's?",
      "MessageIndex": 1,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/784275",
      "Title": "contrast with CAT? Annabella58 momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 19, 2012 04:13PM momof3boys wrote: Omg! Do you think he just does it on purpose? Like a power thing? Only an idiot could do something like that!",
      "MessageIndex": 7,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/784275",
      "Title": "contrast with CAT? Annabella58 momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 17, 2012 01:22PM momof3boys wrote: My boys are 7, 10, and 16. They're great boys... Even though the last few months since my diagnosis has been hectic, they somehow make things bearable and truly make me laugh every day. I don't think I could have made it thru so far without them to keep my mind sane! I know how you feel about \"flying\", our oldest races a car (a real race car on an asphalt track). He's been racing since he was 13 and it makes me a nervous wreck! Don't you hate insurance companies? Our family doctor (we loved him) retired a few years ago at 58. When we asked him why so early he replied, \"I can't take the insurance companies anymore. They dictate how I can take care of my own patients, and the stres of that is killing me\" It's beautiful here in PA today! 77 degrees! I hope you're enjoying the weather.",
      "MessageIndex": 5,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/784275",
      "Title": "contrast with CAT? Annabella58 momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 28, 2011 06:06PM momof3boys wrote: You need to make your own decision. This is how I decided after being diagnosed, I had a BMX with TE reconstruction. 1. I had no known risk factors for BC. I had my first period at 13, have had three babies, first at 27, breastfed each of them, not over weight, exercise regularly, never smoked, very light social drinker. So, I figured (my BS made almost the same comment to me after I told him my BMX decision) that whatever my right breast was exposed to, so was my left one. 2. Psychologically, once I learned of the cancer, I wanted them off of me. I had 3 kids, breastfed them, I am done with these breasts who have turned on me, after getting regular mammograms-ugh 3. Didn't want to wait \"for the other shoe to drop\" with mammograms, us, MRI on \"good\" breast. I'm a nervous type when it comes to waiting on medical results. I know myself very well, and didn't want to put myself through that. 4. My type of cancer has a 20-30% chance of at some point appearing in the opposite breast. 5. After consulting with a PS and going over everything, he said he'd do whatever I wanted, but wanted to disclose that matching a brand new breast to a 43 year old breast is cosmetically very difficult and wanted to make sure I was aware of that. I'm at peace with my decision, wanted to go through mastectomy ONCE!",
      "MessageIndex": 8,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780146",
      "Title": "How do you decide? keepnfaith bdavis"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 2, 2012 05:31PM momof3boys wrote: Lol just read all of your posts... You are all very bad girls! Hehehe",
      "MessageIndex": 33,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786827",
      "Title": "Just Need to Wank sbelizabeth autism_mom"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 20, 2012 10:50AM momof3boys wrote: I think your husband tell her no, it's just too much for right now. If she puts up a fuss, he should tell her,\" I'm really sorry, but, it's not about you, right now, it's about my wife, and this isn't the best time for her\".",
      "MessageIndex": 2,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781346",
      "Title": "Venting: She understands it won't be a fun visit... MiniMacsMom myrtle1"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 20, 2012 03:13PM momof3boys wrote: Two thoughts: get a good book to read and periodically tell them you need to take a nap or rest, and this is what you can do while I rest. Idea #2: you check into a posh hotel with room service for the weekend and have hubby entertain all the company and call you when they're gone!",
      "MessageIndex": 13,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781346",
      "Title": "Venting: She understands it won't be a fun visit... MiniMacsMom myrtle1"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 12, 2013 09:18AM momof3boys wrote: Hi Amanda- Since you are 35 and have a family history of breast cancer, and have cystic breasts, If I were you, I'd ask my Gyn for a script for a breast MRI. I had mammograms since my mid 30's because of an aunt with BC. My mammograms missed my BC for an guesstimate of 2-4 years (my MO's guess). She said that young women with dense breasts should be getting MRI's, not mammograms. My BC did not present with any symptoms, not even a lump. In fact, when I got the call back for a diagnostic mammogram and ultrasound, I was so rattled and shocked, I had to call back and ask them which breast were they concerned with. I'm glad you're being proactive and checking it out. Good luck. You'll find lots of support here.",
      "MessageIndex": 2,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798748",
      "Title": "I'm not sure what's wrong, exactly... uberles momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jun 23, 2013 08:14PM momof3boys wrote: Hi Soriya- I believe your total score may be 9, so your grade would be 3. There are only grade 1, grade 2, or grade 3.",
      "MessageIndex": 18,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806066",
      "Title": "43, Mother of 2 Young Boys and Scared! Tr8cyg DC197"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 2, 2013 08:21PM momof3boys wrote: I had no nodes, no LVI, clear margins, no chest wall invasion, and no skin invasion. I had a BMX with rads (3 opinions) because of my age (43) and the size of my tumor (just over 4 cm) The RO's felt that rads would reduce my local (nothing to do with Oncotype) recurrence rate from 15% to 5%. The most likely area for recurrence for me was the surgical scar, and that's what they radiated.",
      "MessageIndex": 28,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/799727",
      "Title": "19% more likely to survive WITHOUT a mastectomy Lily55 momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Aug 15, 2012 03:30PM momof3boys wrote: I did not have a lump either. The radiologist saw an \"odd pulling of breast tissue\" and recommended a biopsy. No Dr ever felt a lump....not all BC presents as a lump. Get an MRI, and a biopsy.",
      "MessageIndex": 15,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792002",
      "Title": "mammograms and ultrasounds not showing lump but it's there. ThaQueen RobinJoy"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 17, 2012 07:25AM momof3boys wrote: That \"caffeinated style\" was the reason I had to switch RO's.... On my first appt with him, he was up and down out of his seat at least three times, pacing the room, looking for paper to draw something for me, getting aggravated because the nurse interrupted him a few times and he left the room twice. I told my MO it was like trying to get my 9 year old to sit down and do his homework. Add: he obviously didn't look at my file before he sat down, never spoke to my surgeon or MO. Said \"I will be doing that\" what? I waited 3 weeks for an appt.... Then, after this whole mess that left me in tears, I got a stiffed report from him in the mail, on a Friday at 6 pm, right before New Years, that stated that a SNB was not done at the time of surgery, but there was evidence of a positive node! Thank God my MO gave me her cell phone number! I did have a SNB with clean nodes!!!! I was definitely having a paranoia moment. I think if I had to wait to speak to her after New Years I would have jumped off a bridge at that point. She was really angry with his antics, and mistakes. The good thing about your Dr is that he's very proactive. I see a lot of women on here that complain that their MO's are too lax with follow up and it makes them nervous, they are also refused scans, etc. Maybe have a heart to heart with him.... I know when I get a call from my MO I panic... But, I always ask the person: \"ok, exactly what will we be doing at this appt?\" then I'm prepared..",
      "MessageIndex": 3,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/784275",
      "Title": "contrast with CAT? Annabella58 momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Sep 4, 2012 01:45PM momof3boys wrote: If you finished chemo, why are you shaving it?",
      "MessageIndex": 1,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792967",
      "Title": "Hair Craziness? ohiobecky ohiobecky"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Oct 26, 2008 02:04PM momof3boys wrote: My Aunt, a Certified Nurse Midwife told me that it is very important when doing a breast self exam to check not only your breasts, but your entire armpit and the underside of the top of your arms. She said it is a \"misnomer\" that breast cancer is found only in the actual \"breast\".",
      "MessageIndex": 6,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/723006",
      "Title": "Swollen armpit and chest pain kimk1968 Moderators"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 2, 2012 05:24PM momof3boys wrote: I think you should've told that dentist when he asked about your prognosis, \"well, it's obviously pretty good because otherwise I wouldn't be spending my last days bothering to get my teeth cleaned!\"",
      "MessageIndex": 32,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786827",
      "Title": "Just Need to Wank sbelizabeth autism_mom"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 23, 2011 03:05PM momof3boys wrote: It looks great! And I think you look good a blonde!",
      "MessageIndex": 13109,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Oct 26, 2012 12:42PM momof3boys wrote: I think it's good to get out! I got out as much as I could. If it was a bad day, just went out for a bowl of soup or coffee with my husband (on his lunch hour) or a friend, sister, my Mom. If it was a good day, I went to work. I had a policy that if anyone at work was sick but had to come in (I own a real estate co) they were to text me and I would work from home. I was really careful, wore gloves if going to the store (it was from Dec to March) washed my hands, drank tons of water w lemon, and got plenty of rest. I also made it a point to get a manicure and pedicure (with my MO's blessing) the week before my next chemo. The salon knew I was going thru chemo. Everything was very clean, and I told them no cutting. Those afternoons of pampering were good for my spirits. Good luck :-))",
      "MessageIndex": 1,
      "PostDate": "26/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795511",
      "Title": "going out in public between chemo rounds anamerty ruthbru"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Sep 27, 2012 05:43AM momof3boys wrote: I got a pixie cut right before starting chemo (4 TC). That was it. I did not shave it or go any shorter after that. It started falling out on day 20, just before the 2nd tx. I did not lose 100%. my hair stylist said not to shave it, as you might not lose it ALL, and would have a \"little head start\". Which was kinda true in my case.",
      "MessageIndex": 2,
      "PostDate": "27/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794089",
      "Title": "Hair Loss- when did you just cut it all off? alcb70 SelenaWolf"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Oct 27, 2012 07:39AM momof3boys wrote: Hi Susan I think it's great that your doctor ordered the Oncotype test. That's an indication that your doctor is interested in gathering as much information as he/she can before making a treatment recommendation to you. They will also take into consideration your ER PR and her status, lymph node involvement, LVI, (lymphnovascular invasion, if any) your age, any existing health concerns, etc before devising your treatment plan. I did do chemo, even with a low Oncotype score because things like my age (43) otherwise good health, and size of tumor, trumped the low Oncotype score in the end. I got thru it with very little side effects. Stay strong and occupied until you know what your plan will be. Joyce",
      "MessageIndex": 3,
      "PostDate": "27/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795532",
      "Title": "Chemo??.... awaiting the oncotype DX test- any advice?? susancats frankp"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 8, 2012 09:17PM momof3boys wrote: I think the stress of waiting is awful. Have you asked your dr for a prescription of Ativan? It definitely helps with the anxiety. It's not heavy duty, just takes the edge off...",
      "MessageIndex": 1,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783853",
      "Title": "Waiting for surgical biopsy sndlu49 debbie6122"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 22, 2013 01:24AM momof3boys wrote: There are a few threads here for women that have not had reconstruction. I'm sure some of them have done radiation. I hope they come along and post for you. You can also do a search in the search box. Have you met with a radiation oncologist? They can explain how they intend to deliver the radiation to your chest. They don't just have to have the radiation come \"down\" into your chest, the whole machine can move at different angles around you, while you do not move.",
      "MessageIndex": 4,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/799212",
      "Title": "No breasts now Katski liefie"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 22, 2013 01:27AM momof3boys wrote: I did not use aloe, either. I used what they provided, which was Aquaphor. Also, they will do a stimulation (like practice) with you before the actual radiation treatment. This was reassuring. Everyone at my center was extremely caring and patient. Maybe go, meet with the RO and take a tour?",
      "MessageIndex": 5,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/799212",
      "Title": "No breasts now Katski liefie"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 21, 2013 11:57PM momof3boys wrote: Hi! I'm sorry you're here and so worried. I had concerns about radiation and being a blonde with blue eyes. I swear I can get sunburn walking from my car into the grocery store in January in freezing weather- if the sun is out. I used the ointment my RO supplied and did not have any issues with burning and blistering. I did have pinkness and that has now faded away. Hang in there.",
      "MessageIndex": 1,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/799212",
      "Title": "No breasts now Katski liefie"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 14, 2013 09:00AM momof3boys wrote: You look great, Charles!",
      "MessageIndex": 3,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/800458",
      "Title": "Women aren't the only ones at risk Charles_Pelkey april485"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 3, 2012 11:16AM momof3boys wrote: I think you need a primary care doctor and push for a mammogram.",
      "MessageIndex": 1,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783566",
      "Title": "Lump + lymphnode seeking advice Hwally melloydy"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 6, 2012 10:18PM momof3boys wrote: I have a friend whose 90 year old mother has dementia. About six months ago, they discovered that she in a likelihood has lung cancer. But, every time Carole took her Mom to the Dr. And the Dr explained what was going on, Carole's Mom \"relived\" the cancer diagnosis all over again and was devastated all over again at each Dr appt. The Dr recommended radiation, but Carole and her two brothers got together and decided that their Moms quality of life right now is good. They could face the prospects of putting her thru radiation and having her relearn every treatment that she has cancer... Idk... It's such a sad, difficult thing",
      "MessageIndex": 2,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782276",
      "Title": "Is 81 too old for aggressive treatment? biddy sincitydealer"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Sep 25, 2013 11:51AM momof3boys wrote: I refused the tattoos too. It was not an issue at all with my tx.",
      "MessageIndex": 11,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/806982",
      "Title": "Getting rid of radiation tattoos? DLL66 macb04"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 9, 2012 03:10AM momof3boys wrote: Are you questioning whether Taxotere caused the fatty liver? Do you have any symptoms? A friend of mine has a fatty liver, and has elevated liver enzymes, but she does not have any form of cancer. She has Celiac (sp?) disease.",
      "MessageIndex": 2,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785465",
      "Title": "Fatty liver after chemo many orlandpark65"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 12, 2012 07:10PM momof3boys wrote: Hi Renae SIL is : sister in law Lol sorry! I know all the abbreviations are confusing! You're right about imaging and ILC (invasive lobular cancer), I never missed a mammogram since I was 32 (maternal aunt had BC) and the fact that my MO said the tumor was probably there (just not able to be picked up on imaging) thru a few mammograms, sealed the deal on a BMX. I would have to get MRI's and ultrasounds every six months and emotionally that was just too much for me. I know myself very well, and didn't want to wait for the other shoe to drop. Now, if it was a different type of cancer, and less likely to recur in the opposite breast, I'd have to think about that. The other thing that made me decide on BMX: I have dense breasts, so even more difficult to detect changes. I just mentally came to an end after getting various opinions and thought \"enough is enough, my breasts fed 3 babies, they did what they were meant to do, now I feel like they're turning on me\" and that was that... I couldn't wait for the BMX surgery to be over. But, women feel very different about this issue, and everyone's feelings are valid.",
      "MessageIndex": 70,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 8, 2012 12:40AM momof3boys wrote: Renae the T is for Taxotere. You can browse thru some of the December and January chemo threads and get a sense of SE (side effects). We're all different and it's hard to compare because you don't actually know anyone's medical history other than is what is in their BC stat line under their signature, so it's difficult. Some of us come to BC with other issues like diabetes, previous cancers, advanced age, etc. As for me, I don't have any other health issues, I eat well, exercise, normal weight, blood pressure, etc... BC was a complete shock. But, I'm tolerating TC pretty well. I haven't had any nausea, so haven't had to take the added meds they give you for that SE. I have had fatigue which hits on day 3-4 after treatment, but, I've still been able to function and take care of my kids (7,9,16). My biggest SE has been bone pain from the Neulasta shot, but found a tip on here to take Claritin and that actually works... I've lost my hair, but have had to nail or mouth sore issues. I own my own company, so I've been very fortunate in that regard. I've become like Howie Mandel with a fear of germs, so I've been lucky to just come and go at the office as I see fit. I don't want to pick anything up that would land me in the hospital or delay treatment. I feel about 80% of myself for the week before the next treatment, and make it a point to get in 30 minutes of exercise, usually on the treadmill everyday, which is less than what I was doing before my BMX surgery (at least an hour a day)",
      "MessageIndex": 22,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 8, 2012 12:42AM momof3boys wrote: *no nail or mouth sore issues, damn iPad",
      "MessageIndex": 23,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Sep 16, 2012 11:13PM momof3boys wrote: 7of9- where is the lump in your neck located? I underwent BMX with TE reconstruction, chemo, and radiation this year. About 3 weeks into radiation a large lump popped up on my neck (left side, under my ear about an inch). Well, my Drs absolutely freaked. Because it was on the opposite side from my BC and I had no positive nodes, no LVI, they were pretty confident that it didn't have anything to do with BC. However, lymphoma was a concern. I underwent two ultrasounds, and 3 CT scans in the past few months to monitor it. Everything looked good, glad I got those scans because I probably wouldn't otherwise being stage II. All radiologist reports indicated that it was a left cleft brachial cyst, which is a congenital birth defect. When were forming in utero, we have \"gills\" on both sides of our neck that should seal and close up. Mine did not. After keeping an eye on it for several months (sometimes they go down on their own) my RO and MO decided to send me to an ENT surgeon. I'm thankful they did. He being more of an expert could see that it was wrapped around my jugular and needed to be removed ASAP. I had that surgery on Friday. The mass on imaging was about 3 cm. When he removed it, it was larger than a golf ball, and fluid filled. It was benign. Very scary. Maybe you could ask for a referral to an ENT surgeon? Btw, the consensus from all Drs was that the stress of surgery, chemo and radiation caused it to react at this time.",
      "MessageIndex": 774,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 26, 2012 08:05PM momof3boys wrote: Bump",
      "MessageIndex": 1,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788106",
      "Title": "Please help me to understand my report thetwinkle1234 Cindyl"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 3, 2012 08:28PM momof3boys wrote: Love love love to hear good news!",
      "MessageIndex": 14,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780408",
      "Title": "Some good news! barsco1963 holding92"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 7, 2012 08:49PM momof3boys wrote: I just finished 4 tx of TC on Friday...before chemo my WBC count was 10,000. My bloodwork during chemo w Neulasta, counts were all slightly over 6,000 to 6500.",
      "MessageIndex": 1,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783790",
      "Title": "Blood counts after Neulasta AEM47 AEM47"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 19, 2011 03:01PM momof3boys wrote: Sorry for the typos, getting sleepy",
      "MessageIndex": 3,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779728",
      "Title": "3.5 cm tumor VeronicaX SheChirple"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 19, 2011 03:00PM momof3boys wrote: Yes, me. My cancer was ILC and the tumor was larger than 4 cm.... had a double mastectomy with immediate reconstruction on 11/11/11 (ILC hadva tendency to show up atvsome point in the opposite breast and I did not want to deal with \"waiting for the other shoe to drop\". Also, consulted 3 doctors and came to the conclusion that plastic surgery would have a better result with BMX (hard to match a new breast with a 43 year old breast). Anyway, my Sentinel Node Biopsy (done during surgery) was clear/ negative.",
      "MessageIndex": 1,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779728",
      "Title": "3.5 cm tumor VeronicaX SheChirple"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 4, 2012 06:08PM momof3boys wrote: I would definitely see an MO. Did you have an Oncotype test done on your tumor? Usually an oncologist orders that immediately after surgery. My BS told me \"no chemo, no rads, we got clean margins and no nodal involvement\" for various reasons, I ended up doing both chemo and radiation. Just finished radiation today. I think all three doctors, plus PS, if needed, are equally important and all have their own defined roles.",
      "MessageIndex": 1,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786884",
      "Title": "Anyone not seeing a MO but using BS and RO as main Drs? sweetpea23 sweetpea23"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 4, 2012 10:33PM momof3boys wrote: I guess they're (MO's) all different. I'm also Stage II and will see my MO every 3 months. I haven't seen my BS since surgery. Coraleliz- can I ask why you didn't have chemo? I hope you don't mind my asking. I saw in your tagline that you had 2 positive nodes. I'm just curious.",
      "MessageIndex": 6,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786884",
      "Title": "Anyone not seeing a MO but using BS and RO as main Drs? sweetpea23 sweetpea23"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 10, 2012 02:41PM momof3boys wrote: Kit- I had a BMX with SNB on 11/11/11... I swear the pain from the SNB was worse than the incisions / pain from the BMX. My surgeon told me it is because they are cutting thru muscle to get to the SNB... Idk... I used ice packs under my arm for 3 weeks straight, and took percocet",
      "MessageIndex": 2,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/783938",
      "Title": "Sentinel Node Biopsy kltb04 Gina9195"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Aug 18, 2012 10:36AM momof3boys wrote: I don't think you should be worried, but I think you have a good doctor there! My oncologist told me that young women (I was 43) with dense breasts should be getting MRI's, not mammograms and she said that my BC was most likely present thru 2-3 annual mammograms. Not all BC forms a lump that can be seen or felt...mine formed more of a \"line\" that an astute (finally) radiologist saw as an \"odd pulling of breast tissue that I'm concerned about\" I had no pain, lumps, symptoms and had never felt better. So, I think your doctor is spot on, and you should get the MRI, which chances are, will be \"all clear\", but will give you a baseline as you get older. Once I had the MRI, after biopsy, the BC was very clearly seen. World of difference for women with dense breasts.",
      "MessageIndex": 1,
      "PostDate": "18/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792186",
      "Title": "Dense breasts - should I be worried? tlm1 farmerlucy"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 20, 2011 10:17PM momof3boys wrote: Hi Josie How did you do? How do you feel? My first TC (x4) is coming up on 12/29... Getting nervous. I have shoulder length straight hair... Did you cut yours? I called my hair stylist to get my head shaved (she kind of freaked) she said no! We'll just cut it shorter and see what happens, sometimes it just thins...She also kindly offered to come to my house to shave it, if need be.",
      "MessageIndex": 260,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 31, 2011 02:25AM momof3boys wrote: Hi Wave Whisperer, I finally fell asleep around 1 am...woke about around 4am and fell back to sleep until 8 am. So, I guess that wasn't too bad. I took one Zofran before going to bed (along with one Valium, prescribed by PS to relax chest muscles). Had a bowl of cheerios this morning, even though I have no appetite, and I'm going to take my 7 yr old and our golden retriever (Cooper & Charley, Charley is the dog) on a nice long walk shortly. I'm going to force myself to do it, it's freezing out, but I need to get out and exercise...then plan on coming back in and sitting by the fire. My boys are still off of school until Tuesday.",
      "MessageIndex": 401,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 31, 2011 09:39AM momof3boys wrote: Hi Everyone Here I am....day 3 out from first TC treatment. Took one Valium and Tylenol before going to bed around 10pm... Woke up at 5 with moderate pain in my elbows and hips (Neulasta shot yesterday?) Took 2 more Tylenol and fell back to sleep till 8:30am. No nausea, but no appetite either. I ate three normal meals yesterday and felt fine. Hope today is the same. Just feel slightly achey at this point. Haven't had to take the Zofran yet. Hope everyone has a great day. My husband and boys took all of our Christmas decorations (inside) down while I was at my chemo session the other day (big sister took me and stayed w me). That was a huge gift. I normally take them down on new years day while everyone watches football. It takes me a good six to seven hours to get them taken down and packed up properly, so this was a huge relief off of my mind!",
      "MessageIndex": 428,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 3, 2012 05:48PM momof3boys wrote: Spoke too soon! I'm experiencing really bad lower back pain? I'm day 6 post chemo, doing fairly well until now (Tylenol for achiness, no nausea) could this be from the Neulasta shot? Had that on Friday...",
      "MessageIndex": 472,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 4, 2012 06:17PM momof3boys wrote: Are you giving yourself the Neulasta shot?",
      "MessageIndex": 487,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 11, 2012 12:54AM momof3boys wrote: GracieG- I found that Aleve worked much better than Tylenol for the pain and achiness from the Neulasta shot. Hope you're feeling better today. That was my worst SE so far!",
      "MessageIndex": 564,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 12, 2012 01:09PM momof3boys wrote: Hi LeesaAnn- glad to hear you are doing well. Why are you not getting the Neulasta shot? I swear that shot produced the worst SE for me... Bone pain and achiness.",
      "MessageIndex": 591,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 17, 2012 04:16PM momof3boys wrote: Wave I have to tell you, your post about chemo really resonates with me. My sister had a brain tumor (6 years out now, she's doing fantastic). Although she did have brain surgery (I think much more scary than my BMX) she did one year of chemo. It was a combination of pills, 5 days on and 23 days off. She did take Zofran for nausea, but worked through it, did radiation at the same time as chemo, and had no hair loss! It was a serious cancer, too. Anaplastic astrocytoma, Grade III, Stage III. With all of the fund raising and hype over BC, don't you think there would be better treatments, more advances by now? I just read that the Komen foundation spends 40% of every dollar raised on \"awareness\" campaigns and another 20-25% on corporate fees and other programs not directly related to BC. How much of our donation $$$ is actually going to research? Anyone know?",
      "MessageIndex": 648,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 19, 2012 06:27PM momof3boys wrote: *her",
      "MessageIndex": 696,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 28, 2012 11:16PM momof3boys wrote: Maybe a silly question..when some of you say that you're taking steroids (at home), are you referring to the anti nausea meds? One of my girlfriends that went through BC about 3 years ago (she's doing great!), told me before I started that the steroids caused her weight gain and to be prepared for it. I have not had nausea (thankfully), so have not taken the two meds they sent me home with for it. I haven't gained any weight either, Ive lost about 3 lbs. I attributed this to either not needing those meds or having diarrhea and not constipation? She did TAC, six times.",
      "MessageIndex": 807,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 29, 2012 01:56AM momof3boys wrote: I do get the Neulasta shot one day after treatment. But, haven't taken any steroids at home, other than the ones put in my iv. I didn't have a reaction to the Taxotere the first time, so the second time, they didn't even put the Benadryl in the iv. I did get the Zofran and Compazine, but didn't take them.",
      "MessageIndex": 813,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 5, 2012 04:12AM momof3boys wrote: Oh dear god! Throw her out! Seriously, I think it warrants a call to your MO for advice, but I don't think she should stay with you if she has strep",
      "MessageIndex": 924,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 5, 2012 04:47AM momof3boys wrote: Oh...I feel bad she has a 5 hour drive with strep, but worse for you. I have become a germaphobe! Even have a friend calling me Howie Mandel.. I hope you get all the icky germs out, if any are there. And air the place out!",
      "MessageIndex": 929,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 9, 2012 11:28PM momof3boys wrote: Josie... I'm with you! I want proof too! Lol I'll be \"in the chair\" today.... My husband hates that term. He says it reminds him of someone in the electric chair or being cross examined. I told him, \"close\"..... I had a really heavy period after TC #1 on 12/29.... Nothing since. I'm 43 and premenopausal.",
      "MessageIndex": 1012,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 10, 2012 09:02PM momof3boys wrote: Thanks Anniebell... I have mo medical background and always assume the worst! My MO is very patient and kind. As you are! Thank you for the reassurance! Have a good rest tonight! Joyce",
      "MessageIndex": 1042,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 27, 2012 09:24AM momof3boys wrote: Ugh. I can feel the apprehension and anxiety building. My 4 th and hopefully Last TC tx is Friday, March 2nd. I'm glad that it is coming to an end, but, it's kinda like signing up every three weeks for the worst flu you've ever had in your life, that you just got over! I think my friends and family (all well meaning) are just dense. If I hear one more time \"Aren't you excited?!?\" I think I'm going to throw something at someone. I know you all know what I mean.... Also, having the craziest dreams (in between hot flashes)! Dreamt that my oncologist (whom I really like and has been wonderful) is now Casey Anthony and she told me that she changed her mind and that I'm now going to have 6 tx instead of 4. I'm literally having a hard time picturing my MO's face! Every time I try, I see Casey Anthony...omg! I think I'm losing it.... Also, I definitely think my contact lense prescription, eye sight has changed. Anyone else? I don't have dry or watery eyes, but my vision is definitely worse than when this began with first tx on 12/29...",
      "MessageIndex": 1293,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 3, 2012 09:43PM momof3boys wrote: Bailey...did you have a lumpectomy? Is that why he wants to do the whole breast area? Mine just wants to do the incisional scar (BMX).",
      "MessageIndex": 1360,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 7, 2012 06:33AM momof3boys wrote: Wave, yesterday as I was getting my rad tx.. I was looking up at the machine as it was crossing my body and thought \"if that thing ever fell, it would kill me\" I'm so glad you're okay! About ten years ago, I was in the car wash and the two whirly things that lift up over your car to clean it came crashing down on my car! I thought that was it... A lot of damage to my car, but I was okay.. Scary stuff!",
      "MessageIndex": 1682,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Oct 31, 2012 12:10AM momof3boys wrote: Hi Jen- it sounds like you're in good hands with your Drs. It's a shock, isn't it? Just take it day by day and you will get through it. Be prepared for a roller coaster full of twists and turns, and just handle them one by one. I've seen lots of women on her do chemo first (I did surgery first). I think the advantage of chemo first is that they can image how your tumors (which, by the way, are very small) are reacting to the chemo. I chose BMX too, and don't regret it for a second. You'll get lots of love and support here! XO",
      "MessageIndex": 1,
      "PostDate": "31/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795697",
      "Title": "Confirmed dx - IDC stage 2 jenjenl Shari0707"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 8, 2012 06:00AM momof3boys wrote: Good luck tomorrow! Let us know. I'll be thinking about you",
      "MessageIndex": 25,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 9, 2012 05:33AM momof3boys wrote: Renae- all of your reasons make sense to me. They were my reasons to a T why I also chose to do chemo. I did not get a port. With only 4 infusions of TC, my MO didn't think it was necessary, and I haven't had any issues with the infusions. Hope you get a good nights sleep tonight! Joyce",
      "MessageIndex": 30,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 12, 2012 04:59AM momof3boys wrote: Hi Renae! Regarding your SIL; it looks like she had ILC which is very hard to detect with a mammogram, US, or even MRI. It tends to form a \"line\" of cancer cells, rather than a \"lump\" and it very difficult to detect. It was the same for me. My MO said that my ILC tumor was probably present thru my last 2-3 mammograms. It was only detected because a more astute radiologist noticed a \"pulling\" of breast tissue on my last mammogram that he thought looked suspicious. It was never felt by me, my Gyn, the BS the PS or the MO. All examined me before surgery. Scary! With ILC there is a much higher chance, about 30%, that at some time it will appear in your opposite breast. So, because of that and a few other reasons, I decided on BMX. Coincidentally, while I was in surgery, MY SIL's surgeon called her with the results of her biopsy!!! She had a walnut size area of DCIS with a very small amount of IDC in the center. She chose a lumpectomy and started radiation last week. Some in our family are questioning her lumpectomy too. But....most people don't realize that there are different types of BC and they have different characteristics. How's the weather where you are??? If it's nice, go outside for a walk! I'd much rather that than my treadmill. But, use the treadmill for yucky days like snow, cold, or rain. Joyce",
      "MessageIndex": 58,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 12, 2012 07:11PM momof3boys wrote: Oh and I agree, SpecialK is very smart and wise. I always pay special attention to her posts!",
      "MessageIndex": 72,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 5, 2012 06:23AM momof3boys wrote: @coraleliz thank you for responding. It is a hard decision, I know. Wow 4! That's really low! All my best- Joyce",
      "MessageIndex": 8,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786884",
      "Title": "Anyone not seeing a MO but using BS and RO as main Drs? sweetpea23 sweetpea23"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Sep 17, 2012 03:43PM momof3boys wrote: Thanks Rachel- yes, glad that is over and that medical mystery solved :-) I feel fine....just a little sore from the incision.",
      "MessageIndex": 785,
      "PostDate": "17/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 29, 2011 06:28PM momof3boys wrote: Hi bdavis Survived my first TC treatment today, virtually no SE. yay! I did meet with my MO and she verified what you said about them lowering the Oncotype scores down. Verified that under 11 will be considered (low risk). Glad I chose to do it anyway when mine came in at 16. Now it's a no brainer. Thank you. Hope they get that info out ASAP, as I see many women on these boards turning down chemo because their score is slightly higher or lower than 20.....",
      "MessageIndex": 1664,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 8, 2012 04:51PM momof3boys wrote: Bump",
      "MessageIndex": 8,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/782240",
      "Title": "Any help for us English Ladies on OncotypeDX test DizzyD DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 15, 2012 04:32PM momof3boys wrote: Have you been on Tamoxifin ?",
      "MessageIndex": 5,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782721",
      "Title": "So confused and heartbroken, stage lV? M-Aug M-Aug"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 4, 2012 01:03PM momof3boys wrote: Glad everything is going so well! If you need radiation, yes, it can be done with TE's in place.",
      "MessageIndex": 25,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 15, 2012 01:48PM momof3boys wrote: Hi Sonant, yes, the muscle spasms are normal. In fact, my PS doesn't like them occurring. He has me taking one Valium at bedtime, (was taking more right after surgery) to cut down on the spasms. The spasms will slow the healing. They are your muscles squeezing your wound....",
      "MessageIndex": 35,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781123",
      "Title": "Need to your advice, love and support. Sonant Sonant"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 13, 2012 10:08PM momof3boys wrote: I finished TC x4 on March 2nd. I'm a lot younger then your Mom (43), but, your Mom isn't old, either. You say she's petite? Sounds like she's in otherwise good health? The chemo wasn't a walk in the park, but, it wasn't horrible either. My Oncotype was 16, and I'd definitely do it again. With your Mom's stats, she could live another 30+ years! I'd definitely do it. My MO said one of the biggest misconceptions women have about chemo is that they're going to lose a lot of weight. Most don't. They actually don't feel as bad as they anticipate, and overeat a but, and actually gain. I was at my ideal weight at the start of chemo, and had to be careful about this. So, don't let your mom being petite worry you too much. Will you or someone else be able to help her with things like laundry, groceries, dinner etc, because she will feel fatigue.",
      "MessageIndex": 1,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787424",
      "Title": "Need help from anyone done with TC x 4 ailihe Melrosemelrose"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 6, 2012 04:01PM momof3boys wrote: My score was 16.... I'm doing TC x 4. Your oncologist will take everything into account (your tumor particulars, age, overall health, etc) then make a recommendation. I'm 43, otherwise healthy and in good shape, exercise, etc. I'm considered \"young\" for BC, but my tumor was considered large, and my MO's group uses a score of 11 for \"younger' patients....",
      "MessageIndex": 6,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/782240",
      "Title": "Any help for us English Ladies on OncotypeDX test DizzyD DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Oct 29, 2012 10:36PM momof3boys wrote: Also, your Oncotype score assumes you will be taking Tamoxifin.",
      "MessageIndex": 45,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787896",
      "Title": "Anyone out there decline taking Tamoxifen? tmetz1616 shelly56"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 15, 2012 09:59PM momof3boys wrote: You look stunning! Thank you for this. Heading into my 2nd TC treatment this week",
      "MessageIndex": 66,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 26, 2011 02:08PM momof3boys wrote: Question: I'm confused about what I'm reading about fingernails. I have mine (currently) \"shelacqued\". Is that a problem?? My oncologist never said anything about them...",
      "MessageIndex": 316,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 30, 2011 02:17PM momof3boys wrote: Thanks for the encouragement everyone! Now, if I could just go to sleep....",
      "MessageIndex": 394,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 5, 2012 12:24PM momof3boys wrote: Thank you for all of the positive thoughts, everyone! I definitely think there is a \"process\" to go through mentally when you get this diagnosis, and at the beginning everything happens so quickly, you get busy with the day to day appts, tests, surgery, recovery,,etc. Now, this chemo thing with 3 weeks in between is harder (for me) to deal with. I'm sure I'll look back on it and be surprised how quickly this went by too. I do like to think how far I've come and how many good decisions I feel I've already made, just every once in a while I have a \"panic\" moment that takes my breath away. I guess I have to concentrate on \"not going there\".",
      "MessageIndex": 504,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 6, 2012 08:58PM momof3boys wrote: *sick kids...now my eyesight's going!",
      "MessageIndex": 523,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 31, 2012 01:02AM momof3boys wrote: Good luck and blessings to all of you getting your treatments today and this week! XO Joyce",
      "MessageIndex": 838,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 1, 2012 07:53AM momof3boys wrote: Here I am! Present! Finally feeling human. Last week was horrible. TC #3 coming up on Feb 9th. I think the 4th and final should be March 1st. I'm happy for all of you that had or have their last infusions this week. And I hope your SE are tolerable and go by quickly! XO Joyce",
      "MessageIndex": 857,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 10, 2012 12:21PM momof3boys wrote: Oh dear god heather! All you need now is a dentist appt to round out your week! Hope all goes well tomorrow with the pap smear. TGIF....",
      "MessageIndex": 1022,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 16, 2012 12:57AM momof3boys wrote: Lisa---yes to the burning in the muscles... Weird",
      "MessageIndex": 1104,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 22, 2012 05:31AM momof3boys wrote: Hi all Just wanted to let you all know that my bone scan was clear! Yay! Now I feel I can \"move on\" and get #4 TC done and over with on March 1st. I'm sure my MO is happy too. She knew I had no peace of mind before this scan....",
      "MessageIndex": 1200,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 21, 2012 09:45PM momof3boys wrote: Thanks Everyone re: the clear bone scan... You're all wonderful! XO Wave & Josie, I'm so happy for you and proud of you both! And thanks Wave for the good info. Rachel, I'm reading your posts and all I can think is 'don't be surprised when you're exhausted tomorrow! Your day was such an ordeal. I hope you get the thrush under control and have an easier time tomorrow. I don't know what kind of thermometer you use. I use the 'ear one' that I have for my kids. The pediatrician told me to add one degree to it.",
      "MessageIndex": 1219,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 1, 2012 09:10PM momof3boys wrote: For my biopsy, it was 48 hrs. For my BMX it was immediate, since they have a pathologist right there, final pathology was 4 days...",
      "MessageIndex": 7,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/783472",
      "Title": "Anxiety sky high... how long for excisional biopsy results? shabby6485 FilterLady"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 07:05AM momof3boys wrote: About rads: my RO said 4 weeks after chemo too. This was before my chemo started... I asked him if I could just do it at the same time to get it over with since the buildings were adjacent. He just said, \"um, No\" oh how naive it was back then. I've gotten 4 opinions on rads. First guy suggested radiating in 3 places (incisional scar, nodes up under collar bone, and nodes in axilla, forget the technical names) three other RO Drs say \"no, just the incisional scar, your nodes were clear, local recurrance more often happens under the incisional scar\" what did you guys hear? I'm nervous about radiation because I have TE's in place, but my PS doesn't seem concerned, but he did remark that he's surprised they recommended radiation for me.",
      "MessageIndex": 1331,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 01:00PM momof3boys wrote: Rachel, I wasn't even planning on going to an RO after my BS said 'no radiation'. When I verified with my MO, she said, \"I don't think you need radiation, but I'm not a RO, you have the right to get an opinion from one\"... well, I ended up speaking to 3! Plus my PS who knows a lot about radiation. All agreed it was a good idea to do the incisional scar.... To my dismay. But, I too have heard/seen post on here from women that feel a lump on that or under that scar, and it turns my stomach... I hate this.",
      "MessageIndex": 1341,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 7, 2012 03:17PM momof3boys wrote: Hi Everyone- just checking in on everyone to see how you're doing. I'm day 5 out from my last tx and have to tell you- weird SE that I didn't get before- everything tastes metallic, very bad! Ugh... Can't wait for this to wear off... Also, not getting that Neulasta shot was a gift! Now I know that 80% of the crap I experienced was from that shot! I do know how important it us and what it does, but, for me, the SE from that shot were worse than the chemo. Met with the RO today, he said we'd start 4 weeks after last chemo so somewhere around April 2nd.. But I told him I felt ok and want to get this over with. So, I'm getting bloodwork on march 19th and he said if it's good (WBC) I can start the next day. Not that I'm looking forward to it, but, anxious to put radiation behind me. Well, it's sunny and 60 degrees here in Northeast PA today, so after lunch my husband and I went on a long walk. It felt great to be out in the sun!!!! Joyce",
      "MessageIndex": 1405,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 26, 2012 09:02AM momof3boys wrote: Rachel- I just want to give you a hug. I feel so bad for what you're going thru. It's more than just the physicality of everything! We've all been dealt a horrible and traumatic psychological and emotional blow, too. I tried to explain this to my husband. I just feel different, I feel \"apart\" from everyone else. There are moments when I hear my mo's voice in my head \"the cancer is gone, we're just doing this tx because you're so young, and we want to be aggressive, you're considered low risk\"... But then, something sets me off (I really should not read all the other threads on here) and I almost have a panic attack. I feel bad for myself and my kids that they are saddled at such a young age with a mom that has BC...how this is shaping their psyche. And then I feel self centered when I remember my MO describing a patient of hers that is 27 and is in the hospital with leukemia (from chemo to treat breast cancer) and hear my MO's voice..\"she never even had he chance to have a baby\"... It's such a nightmare, anyway you look at it. I'm sorry you and your BF \"went there\". My sister, who really should know better, asked me last night if my husband and I \"were done\" having kids...I just looked at her blankly and said \"I don't really think it's my choice, anymore\" and she just looked down and said \"oh\" I wasn't sure... Not that I want anymore kids, but, for gods sake, Id like the decision to be MINE. No, just taken away... I think I'm rambling, but, I know you all understand.",
      "MessageIndex": 1567,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 27, 2012 05:51AM momof3boys wrote: Hi All- and welcome Josie Well, I just got back from my first radiation tx, only I didn't get any radiation. Apparently, this was just to take more pictures to make sure what the technicians developed in \"my\" program are what my RO wants. So, he'll review tonight and my first session is set for 9:30 am tomorrow. Got the rundown on deodorant and cream. They gave me a spray pump deodorant to use on my radiation side. One of my technicians just went thru BC radiation, so she promised to walk me thru and answer / address any concerns as they come up. Oh, I have to wear a t shirt over my bathing suit this summer, and cannot be exposed to sun.... Delightful I was also taken \"upstairs\" to meet Abby Peck, former Olympian. She is employed by my center and will develop an individualized exercise regime for me. I will meet with her at 8:30 everyday, (as long as I feel up to it), then will get my tx at 9:30. No cost to me. There's also a dietician that I can meet with, too. Not sure if I need to, I'll think about that. Hope everyone is having a good day. Can't wait to hear about the exchange surgery......",
      "MessageIndex": 1579,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 29, 2012 05:36PM momof3boys wrote: LeesaAnn and all- I can't remember if I told you about my aunt. She was a beautiful woman. She passed away last August, after being breast cancer free for 18 years. She had a UMX, chemo, radiation and was in the group of the first BC patients to get tamoxifen. She did very well for many years (diagnosed mid 40's), and was monitored closely at first, then annually. I don't know the exact details of what went down, but, according to my Mom, her sister: After she and my uncle retired and moved from CT to DE, she got a new dr who told her after ten years, BC free, the standard was to just do a mammogram annually on her remaining breast. She was in good health other than borderline diabetes. Well, once the recurrence was discovered (fatigue, pain in liver) she went to Johns Hopkins and was told that she should have had more followup than just a mammogram annually.... What that was, I don't know, but by the time the recurrence was discovered, it was in her liver, bones, and brain. I don't know what the answer is, but, I think I want to be monitored closely.",
      "MessageIndex": 1627,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 7, 2012 09:00PM momof3boys wrote: Lol Heather-- about a month later, when my car was repaired, I went back. The car wash guy recognized me (he should, they had to stop the car wash, back all the other cars out behind me, get me and my car out, lift the apparatus off my car, get my car towed, call my husband, etc) and he said \"it's nice to see you back!\" I said, \"yeah, my psychiatrist told me that I had to come back here and face my fear or else I will be mentally scarred for life\" (I was joking). He smiled and walked away. When I got to the end, where they hand towel dry your car, he knocked on my window. He gave me 50 free car wash coupons! Haha I think he thought I was going to sue them! (I would never) hahaha didn't pay for a car wash for years. Gave my husband half. Insurance took care of my car.,",
      "MessageIndex": 1686,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 8, 2012 10:59PM momof3boys wrote: Happy Easter and Passover! I hope everyone gets a mental and physical break today and that the sun is shining in your corner of the world! Hugs to all :-))",
      "MessageIndex": 1693,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 19, 2012 12:12AM momof3boys wrote: Ecpelkey- hi! I will finish rads on may 1 (god willing). My RO and MO have me taking nothing but vitamin d during rads... They were both adamant about it. Met with my mo on Thursday, and she said I'd start Tamoxifin 4 weeks after rads... I'm scheduled to meet with her again on June 7th, and she said we'd be \"going over Tamoxifin\" and she'd give me the prescription then.",
      "MessageIndex": 1741,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Aug 16, 2012 10:28PM momof3boys wrote: Bump",
      "MessageIndex": 1,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792122",
      "Title": "Not sure if it's IBC,but what else could it be? kishana flash"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 14, 2012 10:33AM momof3boys wrote: I think your dr is being proactive and you're fortunate that she is suggesting a baseline MRI. Most younger women have dense breasts and mammograms are useless. Get the MRI (no big deal) and then you can relax.",
      "MessageIndex": 1,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782649",
      "Title": "lumpy breasts girlguru Hood1980"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 13, 2011 08:29PM momof3boys wrote: Hi Everyone Just jumping in here, feeling like I know nothing....everything happened so quickly! Diagnosed mid-October, did lots of research and got lots of opinions. Decided on a bilateral mastectomy with immediate reconstruction. I have ILC, SNB was negative and Oncotype is 16 (just got that back). Before surgery the doctors (3) consensus was to do chemo, now, they're \"split\" because of the 16 score (10 w 5 years of Tamoxifin). My oncologist, whom I love (she's young, really smart, specializes in BC because her mom had it 16 years ago, still doing fine),said that she'd do the chemo... So, I'm going to do it., Starting the week between Christmas and New Years (woo hoo). She said: TC 4x... What am I in for? I'm 43, otherwise healthy, used to exercising, not overweight, she said it's very important NOT to gain weight during chemo. I'm 5'7 and weigh 153, didn't lose one pound during surgery and 4 days in hospital... How could that be? Breasts had to weigh something?!?! So unfair., So, I'm nervous, because she emphasized this... And exercise, and said that she was sure I'd be fine and it's only 12 weeks, Any tips? Please?",
      "MessageIndex": 413,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 14, 2011 09:17AM momof3boys wrote: When this began for me, I had alot of anxiety. My Dr. prescribed Ativan. It definitely helped with the anxiety, and I was still able to function (work, taking care of 3 boys, etc). It just took the edge off and allowed me to think calmly and to not panic.",
      "MessageIndex": 423,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 9, 2012 09:37PM momof3boys wrote: Sno- I hope your fever goes down. I'm sure the kids take your mind off of everything, but you must worry about the germs? It must be hard being a teacher and going thru chemo in the winter!",
      "MessageIndex": 777,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 26, 2012 03:02PM momof3boys wrote: Chemo with children is hard (mine are 7,9 and 16), getting them ready and to school, homework, basketball, feeding them, they still need to eat, even if you don't..., but, for me, it's also made it easier. They're great for taking your mind off of everything BC and for just cuddling up and relaxing. I'm more sad on Monday morning when they go to school. That's new for me, previously, I was like \"thank god they have school tomorrow\", now I miss them more during the day, especially with having worked much more from home now than going into my office, where I swear someone has the swine flu every time I go in. Hope everyone in the chair today feels great tonight and gets a good night sleep. Thinking about you all. Joyce",
      "MessageIndex": 953,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 12:43PM momof3boys wrote: Crossed the chemo finish line today! Yay! All bloodwork, including that damn alkaline phosphotase were all in normal ranges, too. Phew! I was sweating that one, only because I'm obsessive and nervous. Hope everyone is having a great day. I feel really good, but going to take a nap before the boys get home from school. XO Joyce",
      "MessageIndex": 1263,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 03:29PM momof3boys wrote: You know, I do love my sister and each of us have been thru some difficult times. She lost a baby (her 4th child) carried him full term knowing he had a not survivable birth defect (had 1/2 a heart). He was born on December 14, 2003 and was expected to live just hours, and he was beautiful! He surprised everyone and actually went home with them... Only to die on Christmas morning in my sisters arms as her other kids were opening their gifts.... She didn't say anything until the gifts were opened then carried him into their bedroom and collapsed... I was pregnant with my youngest at the same time. It was really hard, and I know it still is. Both boys, just months apart. So, I will forgive her and will be there when / if she needs me. She's just different, you know? Even when we all have Sunday dinner at our Mom's house, we all bring something (vegetables, rolls, dessert).... She never brings anything. And after dinner, while my other sister, SIL and Mom clear and clean up? She just goes and sits down???? I don't get it!! Oh well...",
      "MessageIndex": 1274,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 20, 2011 10:17PM momof3boys wrote: Hi Josie How did you do? How do you feel? My first TC (x4) is coming up on 12/29... Getting nervous. I have shoulder length straight hair... Did you cut yours? I called my hair stylist to get my head shaved (she kind of freaked) she said no! We'll just cut it shorter and see what happens, sometimes it just thins...She also kindly offered to come to my house to shave it, if need be.",
      "MessageIndex": 261,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 26, 2011 02:05PM momof3boys wrote: Hi Kimdy My first treatment is this Thursday the 29th. Today was like an emotional roller coaster. I have three boys 16,9,7 and a great family that is very supportive. But, it was hard not to think of what is coming up this week... I ordered my wig last Thursday. Honestly, that was my worst day in this whole venture that I didn't sign up for, so far. Good luck with your 2nd treatment. I'll be thinking of you and knowing that you survived the first one, so I can do it too!",
      "MessageIndex": 315,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 4, 2012 09:33AM momof3boys wrote: I'm surprised your surgeon was annoyed with your question. When I had my SNB (am of BMX surgery) I didn't know enough to even ask about LE. I had one node taken out (negative), but woke up with a pink bracelet on my SNB side arm with some sort of warning for nurses...and when I got to my room, my nurse put a neon paper taped to my wall behind me with the same notice/warning.. So I guess it does make a difference w just one out, too. Now, every nurse seems to lok at my file before attempting anything (bloodwork, blood pressure) and goes for the correct arm.",
      "MessageIndex": 485,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 8, 2012 08:57PM momof3boys wrote: HeatherW good luck tomorrow. Sending positive thoughts and prayers your way!",
      "MessageIndex": 545,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 9, 2012 07:31PM momof3boys wrote: LeesaAnn- I think you have your third treatment tomorrow? How are you holding up? I hope it's a good day for you..",
      "MessageIndex": 552,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 13, 2012 10:19PM momof3boys wrote: Welcome Lulabell! Yes, I can relate... But my boys went back to school last week, although they now have Monday off for MLK day. It's really cold and snowy here today. I plan to stay in for the weekend and stay away from sick people. Just finished watching 'Contagion'... Now I'm grossed out, but it was a good movie. LeesaAnn, I've had a stuffy nose since getting my first TC treatment on 12/29, well it's either stuffy or runny, no in between. I haven't complained about it because I guess I just got used to it. I haven't had a bloody nose, like some have had, but (I know this is gross, but some may need to know) sometimes the tissue is a little bloody when I blow my nose. I'm not a nosebleed type of person, so it has to be the chemo. I hope everyone has a good, restful night!",
      "MessageIndex": 609,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 16, 2012 10:30AM momof3boys wrote: Well, I'm feeling pretty good. No nausea, aches or pains. Oh yeah, 2nd TC coming up on Thursday. That's why I feel \"normal\"....all built up just to knock me down again! Ugh. I'm going to try the Claritin tip this time. I am fearful of that back pain I experienced last time. It was \"\" this close \"\" to being described as \"back labor\"!",
      "MessageIndex": 627,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 19, 2012 06:00AM momof3boys wrote: I do admit that I get aggravated and mystified by some of the questions I get. For instance yesterday, a waitress whose son was on my sons baseball team waited on us at lunch. She said how sorry she was, she just heard, blah blah blah...then started to question me: You're so young! (we're probably around the same age, she may be 2-3 years older) Did you have any idea? No.... Did you find it in a mammogram? Sort of, not exactly... Do you go for a mammogram every year? Yes, since I was 32. Really? I've haven't started yet.... Oh brother! She's gotta be in her mid 40's, smokes like a chimney, is a good 30-40 lbs overweight, doesn't get mammograms, and I have cancer? That's what's so frustrating to me. I feel like I did everything right.... Ugh there's my rant!",
      "MessageIndex": 661,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 19, 2012 06:26PM momof3boys wrote: Hi Gracie I'm doing 4 x TC and my Oncotype score was 16. My MO was on the fence with me doing chemo at all, but because of my \"young age\" and the fact that the tumor was larger than 2cm, she said she would do it if it were here... On these boards, I've heard 4xTC referred to as \"chemo lite\". Idk....",
      "MessageIndex": 695,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 19, 2012 06:28PM momof3boys wrote: Oh I love Panera! Love their new Sonoma chicken stew with a small biscuit on top. Tastes like a chicken pot pie!",
      "MessageIndex": 697,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 7, 2012 08:03AM momof3boys wrote: Hi LeesaAnn... I'm 2 of 4 TC down. Third coming up on Thursday. I've had to shave my legs and under my arms this whole time, but only about once or twice a week. What's up w that? I still have my eyebrows and eyelashes, but heard they hang on till the last treatment? I'm glad your 4th is easier than your 3rd! Joyce",
      "MessageIndex": 964,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 7, 2012 12:51PM momof3boys wrote: Wildrumara- how are you doing with getting ready for your upcoming surgery at the end of the month? For me, (BMX on 11/11/11), I think the surgery was easier to handle psychologically and physically than this chemo. Maybe because this chemo tx is so long and drawn out then repeated over and over! I was very anxious to get my surgery \"done and over with\" and while it wasn't easy, I did have a lot of help when I got home and the pain medication took care of any issues I had. I was in the hospital for 4 nights.. Did they give you any idea how long you'd be there? From reading these boards, I'm shocked (and impressed) that some of us were only in the hospital for 1 or 2 nights. I was in surgery for 8 hours, and my PS told me beforehand that he doesn't like to rush his patients and he recommends at least 3-4 nights, some stay for 5-6...",
      "MessageIndex": 971,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 10, 2012 09:04AM momof3boys wrote: Well, I'm back! Everything went well. Got there at 11:30 for bloodwork then met with MO to go over bloodwork (later nurse gave me a copy of bloodwork, they check at least 50-75 different things) I guess the big ones they check are white cell blood count, liver enzymes and calcium (could be indicator of bone met)... Then we went to infusion area. My sister went with me and again arranged 3 surprise guest appearances that stay for 15-20 minutes each hour. Today was my Mom, who also made us dinner for tonight, then my friend and neighbor, Marcee, who brought me a chai, then a friend from work, Michael who brought me a gourmet sandwich and soup... So, even though I get no rest, it makes it more fun and bearable and definitely makes the time go by so fast... Plus it's fun to guess who's coming!",
      "MessageIndex": 1020,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 10, 2012 01:40PM momof3boys wrote: Help! A little freaked out... Yesterday when I went for my infusion, I had my bloodwork done and went to meet (as usual) with my MO before my treatment. She examined me and checked my bloodwork on her computer. She said everything she had (checks like 50-70 things!) was good and she was just missing a couple of results, but to go over and get started. I did and they did start the infusion, I asked the nurse if they got the final results and she said yes, they'd get me a copy. Never asked for a copy before. Read it this morning and every test was in the normal range except for the alkaline phosphatase. It was 155. Normal ranges are 34-104. Before I started chemo it was 63, after first tx it was 145, now 155. This is all on the paper in columns. I called my MO and she said she wasn't concerned...feels that is was normal before chemo and is most likely caused by the chemo or the Neulasta. But, she offered to send me for a bone scan while trying to assure me that she's just doing this to ease my mind. Anyone else look at all their bloodwork? Out of normal ranges?",
      "MessageIndex": 1035,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 16, 2012 12:44AM momof3boys wrote: Hi Everyone...hope everyone had a nice Valentine's Day and your SE were manageable. I'm day 6 out from TC #3 and as usual, my worst SE is this flu like achiness that travels all over my body. My shoulders, hips, legs, forearms, neck.... The Aleve is helping. Lisa... I can totally relate to you showing up for the appt a month earlier... If you're like me, you have lots of little dr appt cards in your wallet, where there were probably non (except for my 6 month dental cleaning) before... It's overwhelming! Too bad they couldn't squeeze you in. Perhaps if you told them that we were all waiting to hear how the appt went? Lol oh well Rachel and everyone else getting tx tomorrow, rest up today and drink lots of water. My thoughts will be with you. Joyce",
      "MessageIndex": 1102,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 12:52PM momof3boys wrote: Hi Annie and Wave- I did get from the BS \"no, no radiation, we got really good margins\". But, the RO's think that because the tumor was 4cm, I should do the incisional scar, as that's the most likely place for a recurrence. It would lower my local recurrence rate from 15% to 5% over 10 years. No, no nodal involvement, no vascular invasion.",
      "MessageIndex": 1339,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 3, 2012 05:30AM momof3boys wrote: Thanks Wave!! XO Just got back from final tx! Yay! I was really nervous because it took 30 minutes to get the liver and kidney function bloodwork back. When she gave me a copy, I searched first for that alkaline phosphotase results. Dropped in half, back down in normal range. MO said she's not worried at all during chemo what these tests say, they're normally all over the board. But, she knows I obsess over everything.... She's calling over to RO to let him know that today was my last chemo, and they'll set me up for rads in about 4 weeks. She said I'd have to meet with the RO again beforehand. And also that she agrees with doing the incisional scar only. First guy wanted to do that, plus two areas of lymph nodes.... Geesh my lymph nodes were all clear. She did give me a very thorough exam. And told me after rads, I would be starting Tamoxifin. She said that there are different brands of Tamoxifin, so if I have SE, we'll just switch till we get it right. I swear she checked/ felt every lymph node in my body! I'll be getting blood work every three months for two year, then every 6 months for 3 years. She said scans (in lower stages) are not ordered unless it's necessary, or new symptoms. But, she said a lot of women worry and let it take over their heads, and if I'm worried about something, just call her and she'll order a scan. She reminded me that I was \"very low risk\" for recurrence and have treated very aggressively, so she hopes I can go thru rads and then relax!",
      "MessageIndex": 1351,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 7, 2012 05:53PM momof3boys wrote: Well funny story...I took my two youngest boys for haircuts after school today. We always go to \"The Barber Shop\". It's a guys place to get a haircut, but they do have two women who work there and I've seen them both occasionally when I bring the boys. Well, I walk in today and one if them exclaims in front of everyone \"omg! Your hair looks great!\" Cooper (my 7 yr old) climbs up into her chair. She starts asking mt 20 questions!!! Where did you get it done? Is it low lights plus highlights? Why did I get it cut? Do you like it shorter? How long does it take the hairdresser to do it? She went ON and ON!!!! If we werent in an open room 25x25 with about 8-10 men and boys present, I would've stopped her and told her it was a wig! But, I sat there sweating bullets and answering her... Meanwhile Cooper is looking at me with his eyes as big as saucers and a little grin on his face! I swear to god, I thought he was going to \"out\" me! This is the same kid that said to the waitress at Olive Garden on Sunday, when she asked me if I wanted a sample of wine...\"she can't, she's on chemo\" !!! Ugh....",
      "MessageIndex": 1407,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 14, 2012 02:17PM momof3boys wrote: Hi Jen! Welcome aboard! Are you finished with treatment now? Some of us are just starting or about to start radiation...",
      "MessageIndex": 1473,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 27, 2012 11:02AM momof3boys wrote: *bring him home",
      "MessageIndex": 1583,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 30, 2012 03:58PM momof3boys wrote: I think the psychological affects of this BC disease is traumatizing. I know for me, every ache and pain is analyzed in my head, over and over. It's paralyzingly painful. Remember when I went thru that period where my alkaline phosphatase level was raised and my MO told me 3 times it was because of chemo? Finally, she said \"I'm confident it's raised because of the chemo, but, I'm going to order a bone scan because I can see that you're not able to move forward without it\". I was terrified of that bone scan, but she was right... At my last appt with her, she told me that her Mom (BC survivor 16 years) was in that day for bloodwork and called my MO after meeting with her own oncologist. She said that her Mom asked her \"tell me the truth, is my bloodwork really ok?\" \"Look up to see if he (mo) wrote any notes that he didn't tell me about\" She really gets the anxiety that we feel, yet is calming at the same time. I've thought of talking to someone about this anxiety, but really, unless they have BC, they can't really know what I'm going through... I wish there was some kind of scanner in my shower that would beep if I had anything to worry about, then I'd get it out of my head for the day!",
      "MessageIndex": 1636,
      "PostDate": "30/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 13, 2012 07:27AM momof3boys wrote: I had Thursday, and it worked well. I felt ok on Friday, lousy on Sat and Sun, but by Monday felt okay enough to take my kids to school, and work for a few hours either at home or the office (provided when I called the office, no one there was sick)",
      "MessageIndex": 1712,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 7, 2012 09:54PM momof3boys wrote: All I can say about her is this....do you know what they call the person who finished dead last in medical school?...... Doctor. You get some bad ones every once in a while. I'm glad you got your referral.",
      "MessageIndex": 7,
      "PostDate": "07/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787124",
      "Title": "Doctors not taking you seriously... tealorca11 CuterWCurves"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 1, 2012 04:15PM momof3boys wrote: I just think that no one, unless they have cancer can possibly understand the fear. I know I didn't until I was diagnosed. In my case, my sister has a stage III brain tumor that they were only able to remove 50% of and treated her after surgery with chemo and radiation (she's 4 years out from that and doing well). She has to travel to Boston from PA every 3 months for. Brain MRI and testing. The stress of that is unbelievably high for her and my entire family, so, my BC, while very serious, is not the worst medical situation that my family has to deal with, which, for me, is a good thing. I would rather hear, \"you'll be fine, you're okay, the cancer is gone\" anyway of the week... My sister, obviously, \"gets it\" and knows exactly what my fears are and is a wonderful person to be able to talk frankly to.",
      "MessageIndex": 19,
      "PostDate": "01/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786741",
      "Title": "Annoyed, need to let it go... Laurie09 karen1956"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 14, 2013 01:04PM momof3boys wrote: Sue bak- are you on Tamoxifin? I ask because I've lost 7-8 lbs since I've been taking it (since June) without trying / needing to lose weight. I just don't have as much of an appetite with the Tamoxifin...my MO said she has a pretty good percentage of her patients that lose weight on it. I hope your scans are all good. Let us know.",
      "MessageIndex": 1,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800445",
      "Title": "Almost back to normal-Wait, not so fast suebak suebak"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jun 13, 2012 11:53AM momof3boys wrote: I did a BMX with TE's (will have final exchange in nov) I'm 99.9% sure I will not do nipples... Went out to dinner with a bunch of BC women last week that are in my exercise group. One of them just had her nipples tattooed. She made an interesting comment that I've replayed in my head. She said she decided to do the tattoos because having \"nipples\" was like having \"lures\". She said the eye is naturally drawn to the nipple... And it made her happy to look at herself again. I've been thinking of it ever since. I think she's right. I'm glad she figured this out and it pleased with her tattoos.",
      "MessageIndex": 7,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788983",
      "Title": "To Nipple or Not to Nipple. MT1 glennie19"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Sep 23, 2012 08:42PM momof3boys wrote: Hi Dawn, I'm sorry you're here, but, you will find comfort, support and great advice here too. I was diagnosed last year. My 3 boys were 7,9,and 16. They've been great and are doing well. I thought Dr Susan Love's book : Dr Susan Loves Breast Book, was excellent. It was very easy to read and explained everything. I've referred to it many times over the past year. We're here for you.",
      "MessageIndex": 8,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793935",
      "Title": "Scared to death and back to reality Dawn1008 Dawn1008"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 2, 2012 07:32PM momof3boys wrote: Rachelvk, don't feel guilty. I don't think many people would give two strangers a ride. I certainly wouldn't. Maybe offer That I call someone for them, but not a ride. Hope everyone's SE are getting better. So far, my most prominent one has been an achiness in my legs and hips. I guess it's from the Neulasta shot. My first treatment was 12/29 (last Thursday)",
      "MessageIndex": 711,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 12, 2012 11:48AM momof3boys wrote: Hello everyone- Whatashocker... I got my period right on time last week, about 6 days after my 1st TC treatment. It was heavier and cram pier than usual. Now everyone, don't yell at me but I did go out this am and get a pedicure and a shellacked manicure. I was careful to quietly tell them I was undergoing chemo and they assured me they knew the routein... Very careful, no cutting, etc. I figured the shellacked manicure can do nothing but help, since it is basically 7 layers of polish upon my own nails, makes them very hard. We'll see. My onco nurse said if I felt up to it, go ahead... I do feel so much better. Just looking at them was getting me down. My next TC is scheduled for 1/19---next Thursday at noon.",
      "MessageIndex": 796,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 19, 2012 05:31PM momof3boys wrote: Everything went well for my 2nd of 4 TC...thanks, Ladies! No issues, feeling pretty good, just tired! I hope everyone has a restful night!",
      "MessageIndex": 872,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 28, 2012 04:07PM momof3boys wrote: I hope you're feeling better, Rachel",
      "MessageIndex": 980,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 03:14PM momof3boys wrote:",
      "MessageIndex": 1272,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 09:01PM momof3boys wrote: Christine I love my boys more than anything else in the world. If I learned they had a serious illness and did not tell me, I would be devastated. I would want to be there for them to support them or hold them or help out in anyway I could. In the beginning, I dreaded telling my Mom. She has been thru so much....lost a son a 6 years old in a busing accident, went through my older sisters brain tumor surgery, chemo, radiation, etc. Then in 2008, we lost my Dad very suddenly. I swear he died of a broken heart over my sister. But, my Mom loves us all so much, and we know that we are what she lives for. She was energized and took charge of my entire household for th three weeks that she stated with us after my surgery. Even now, during chemo, she's making meals, taking the boys to movies and lunches, stopping by to dust, fold laundry. She loves me. She needs to be here with me. Even if it's a cup of coffee and discussing nothing....she needs to see me and be with me.",
      "MessageIndex": 1278,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 27, 2012 11:12PM momof3boys wrote: Hi Grace- I did TC x 4. My Oncotype score was 16. My MO told me that I wouldn't be wrong to refuse chemo, but she couldn't say I was right either. It's such a hard decision. I'm 43, and hav three young boys (16,10,7). No lymph node, no LVI, either. But, my tumor was larger than 2 cm, and my MO's group thinks that's a factor in the decision process. They also use 11 as a cutoff for 'young' otherwise healthy women. Did you do a lumpectomy? Are they planning radiation? I chose a BMX and again, because of the size of the tumor, having radiation to the incisional scar, only.",
      "MessageIndex": 1,
      "PostDate": "27/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786563",
      "Title": "In your 40's with low Oncotype score, what was your decision? gracebead p22nut5"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 30, 2012 01:13AM momof3boys wrote: @voraciousreader: I'm not sure what my MO based that on. She just stated that as a matter of practice for her group, they use \"11\" as a cutoff point for young, otherwise healthy BC patients. I took that to mean anything under 11, would not recommend chemo. Above 11, would look at the Oncotype score plus other mitigating factors in recommending whether to do or not do chemo. My score was 16. She didn't push me either way until I made the decision to do chemo, then she did tell me that if it were her, she would do the same thing. I had a low score, no nodal involvement, no LVI, but a larger tumor. I'm 43, and premenupausal, very good shape, fit, active, etc...young children.",
      "MessageIndex": 17,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786563",
      "Title": "In your 40's with low Oncotype score, what was your decision? gracebead p22nut5"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jun 13, 2012 11:54AM momof3boys wrote: To be clear: she didn't have surgical nipples, just the tattoos. That's what I'll more than likely do too....",
      "MessageIndex": 8,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788983",
      "Title": "To Nipple or Not to Nipple. MT1 glennie19"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 30, 2011 08:26AM momof3boys wrote: I'm back!!!!! Did my first of 4 TC treatments. Got a little stuffy nose on the \"C\" and they watered it down and it went away. Other than that, I feel fine. They gave me benadryl, a steroid and a \"generous dose\" of Ativan to start with, so I was very comfortable and relaxed. Home now relaxing with my boys! Hope everyone had a good day!",
      "MessageIndex": 385,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 5, 2012 07:36AM momof3boys wrote: Anybody experience nightsweats? I think I did last night...I'm 43, premenopausal... From the chemo?",
      "MessageIndex": 495,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 5, 2012 08:28PM momof3boys wrote: Thank you Wave and Deb for the encouragement. It's so scary and overwhelming. I feel like I'm living in an alternate universe, or in a nightmare I can't seem to wake up from. I definitely need to snap out of it.",
      "MessageIndex": 512,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 6, 2012 08:57PM momof3boys wrote: Well, I had a busy day. My son's (he's 9) school called this morning and told me that he fainted in church! Ugh.... Had to go get him and bring him to the pediatrician (he's fine, I think it was just hot) got him checked out and spent the day reading and cuddling with him. The ped's office was great. When I called I told them about the chemo and right away they told me not to go in the main office, they were packed with suck kids. I knocked on the back door, they took us right in to the doctor. There really are some wonderful people out there. Hope everyone has a great night. For Deb 267: the bone pain from my Neulasta shot didn't hit me until day 5. I was totally unprepared for it and luckily had some percocet left over from BMX",
      "MessageIndex": 522,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 28, 2012 02:41PM momof3boys wrote: Hi Everyone, right now I feel like crap. I was up all night last night with diahrea, and basically laid in bed all day today so achey with pain. It's day 7 out from my 2nd TC treatment, last time, this hit me like on day 3 or 4. I am absolutely miserable. I'm tired of getting the \"you're halfway done! Aren't you so happy!\". I tried to explain, that in my mind, halfway I'd the day before the 3rd treatment. The treatment itself is painless, it's the 2 to 3 weeks afterward that is the worst part. Ugh.... Hope everyone gets a good night sleep. Joyce",
      "MessageIndex": 802,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 3, 2012 01:35PM momof3boys wrote: Heatherweather- congratulations! Glad this part is behind you, and hoping you breeze through the next week or so with no SE! Rachel- I'm a type A personality and reading all that you do makes ME tired! I should've known when you went out for burritos after your first tx that you were relentless. I hope you can get sone rest this weekend. Everyone else that had tx this week, I'm thinking of you constantly. I'm feeling much better this week (TC #3 coming up on 2/9) but still feel achey from time to time during the day and.... I'm obsessed with other people's germs! I was at my office working all day on Tuesday and then last night a coworker called me that I spent a lot of time near and warmed me that she had come down with a horrible stomach flu during the night with everything that comes with that. I literally had an instant headache and stayed in all day today, just left the house to pick up the boys after school. Oh, and my friend whose daughter has strep throat dropped off a lasagna for us. I cooked the heck out of it!",
      "MessageIndex": 902,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 10, 2012 05:16PM momof3boys wrote: Thanks everyone- I wish that nurse didn't give me that report because I know my MO wouldn't even of mentioned it! Did I mention that I'm a bad test taker? I always assume the worst!",
      "MessageIndex": 1039,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 10, 2012 05:18PM momof3boys wrote: Btw...there are 39 things in your blood that they check. Who knew?",
      "MessageIndex": 1040,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 12, 2012 05:41AM momof3boys wrote: Hi Ckk and Karen I guess I feel a little better about the bloodwork, still wish that nurse never gave it to me.... I'm not a very patient person and hate waiting for test results... Don't even know when the bone scan will even be scheduled, so, I'm trying not to think about it, but it's not working real well! Rachel- unremarkable is a beautiful word in the BC world! Lol",
      "MessageIndex": 1057,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 22, 2012 06:56AM momof3boys wrote: Thank you! Feeling much more positive now!",
      "MessageIndex": 1204,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 19, 2012 07:38PM momof3boys wrote: Btw... Just to update: I haven't lost any lashes or eye brows yet....",
      "MessageIndex": 1517,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 21, 2012 10:30AM momof3boys wrote: Hi everyone, Michelle- I have no idea why you're having that swelling, but, I can tell you that my MO checked my ankles for swelling before every chemo tx and before first tx told me to call her if my ankles swelled up? So, there must be a reason? I did not have any swelling, so, I don't know what that's all about. I'm about 18 days post last chemo and feeling a little bit better everyday. Aches and pains are lessening, and I'm feeling well enough to exercise every day. Hoping my WBC is going up. Have to get that rechecked on Thursday. Still having hot flashes (mostly at night, just 1 or 2 during the day). I hope everyone has a good day. Rachel- good luck with your pledges!",
      "MessageIndex": 1536,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 27, 2012 11:00AM momof3boys wrote: Baileybump- I was pretty emotional and cranky on my way there. Right before I left my office to go for rads (had a bad, stressful morning at work) my 7 yr olds school called. He had a belly ache and was crying. So.... Had to call my husband and have him pick Cooper up and brung him home. Did all this in my car. Then, my husband said \"are you upset?\" and I said \"yes!\" he said, \"why? This is the easy part\" and I said, \"oh.... Ok, then You do it!\" To which he replied, \"honey, if I could stand in for you, I would do it in a heartbeat\" so.... Then that made me teary. Then I get to the place and get in, get changed, the technician tells me she has to check my stickers (I refused tattoos, I think they're pissed about that). So, she says \"the tattoos are really small....have you seen them?\" I said, \"no, show me\" she says \"well...I don't have them!\" (like I'm silly) and I reply \"precisely, and I don't want them\" geesh, I'm thinking, calm Down, I have to come here for 5 weeks. Almost cried on the table... But didn't. I completely understand your tears. I know I'll cry in the shower tonight.",
      "MessageIndex": 1582,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 28, 2012 05:51PM momof3boys wrote: Oh I have resisted reading that book (I'm a big reader)... Just tell us the good stuff!",
      "MessageIndex": 1613,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 29, 2012 03:40PM momof3boys wrote: LeesaAnn... I agree, that doesn't sound right. Kind of makes you feel adrift, I'm sure. When I met with my MO at my last TC treatment, she knew I was going to start rads shortly, but, scheduled me for bloodwork six weeks out from final chemo. She told me that barring any issues I may have, I would see her every three months for two years. She would do a physical exam each time (I had BMX) and bloodwork each time, after that, I would see her twice a year, indefinitely, I hope that's a very long time! She's been really good with email.. She has an iPhone and responds very quickly \"unless I'm putting the kids to bed\" She has 3 kids under 5. Can you email your MO with your questions? They all seem really valid!",
      "MessageIndex": 1624,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 3, 2012 05:05PM momof3boys wrote: Hi everyone. Hope you're all doing well. I had my 6 of 25 rads tx today. So far, so good. No redness yet, but definitely experiencing fatigue. Saw the RO today. I will see him each Tuesday. He said the best thing for fatigue is just to forge my way thru it?!? Also found out that I'll be having bloodwork done each week. He said radiation causes anemia, so they keep a close watch on your blood levels. My 7 yr old explanation for my headache over the weekend? \"Mommy, maybe it's your hair trying to push out\" lol I was picturing the playdoh barber shop where the hair grows when you push down on the playdoh. Oh, if it were only that simple! Anyone else see the news about breast cancer being over diagnosed? Made me so mad! From so many posts that I read on BCO I've come to the conclusion that doctors need continuing education with breast cancer... There are so many posts from women on this board that make me say \"What was that Dr thinking?\" it's crazy. I'm very thankful for the treatment that I've received since I've been diagnosed, but in the back of my head, I worry about screening and health care in this country for women. Right when I was diagnosed, the news was about recommending women not be screened until they're 50...I'm 43. And every three years is good enough with pap smears... My PS made a statement to me when I was trying to decide about chemo (Oncotype 16). He said,\"if you lived in the UK or Canada and had negative nodes, you'd be done right now. You wouldn't even be given a choice. But, the US had a 29% higher survival rate for BC.\" I do worry about women coming behind us and the Oncotype test. I can definitely seeing insurance companies refusing to cover women like me with low risk scores. My Drs have been pretty vocal that coverage will change, not fir the better, if health care is mandated. I'm sure youve all read posts from women in UK and elsewhere that wait WEEKS for mammograms, biopsies, test results, it's scary. Just my thoughts...",
      "MessageIndex": 1663,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Aug 16, 2012 07:56AM momof3boys wrote: My surgeon called me at home the evening I was released from the hospital...so it was day 5.",
      "MessageIndex": 1,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/792062",
      "Title": "How long did it take to get final pathology results after bmx Pointvalue dogsandjogs"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 8, 2012 07:43PM momof3boys wrote: Galsal- I had BMX on 11/11/11. I met with my oncologist before surgery. That way, she reviewed biopsy reports and MRI before surgery and concurred with PS about my choice of surgery. Most importantly, she instructed BS what to do with and where she wanted my tumor sent for pathology and Oncotype testing.",
      "MessageIndex": 5,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781877",
      "Title": "Standard length of time? Galsal Galsal"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 7, 2012 06:30PM momof3boys wrote: I know most BS don't want to push you either way... Lumpectomy, UMX or BMX. Mine didn't either. But when I told him I decided on a BMX, I could see relief in his face and he said \"I think that's a wise decision, we have no idea what caused your breast cancer, but whatever your right breast was exposed to, your left one was too\". And I'm only 43 and knew mentally that I needed to reduce the odds of a recurrence to as low a point as I could, or I knew I would be mentally stuck with dread over recurrence. I don't regret it one minute.",
      "MessageIndex": 6,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785441",
      "Title": "the healthy breast-question nibbana momof3boys"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 13, 2012 05:38PM momof3boys wrote: Of course this happened to me, too. Got my period the day before my BMX in Nov. I was distraught! At the hospital, they gave me disposable underwear and a pad to wear into surgery... The next day my period was very heavy. I remember apologizing to the nurses. They were so sweet! Told me it was not a bug deal to them and wouldn't I rather have it that week when they were there to take care of me than get it the next week when I was home on my own? I loved those nurses....",
      "MessageIndex": 9,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784096",
      "Title": "Embarassing question.... Emaline jocelynlally"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 30, 2011 06:54PM momof3boys wrote: Hi Lucy, Welcome to the club no one wants to join...but you will find very caring and informed women and a few men here. They'll attempt to help you and steer you in the right direction. Your story made me laugh out loud! And, I'm proud of you for not giving the report back! I think the nurse should have called the dr and explained that you got the results, then the doctor (holiday or not) or another dr in the practice should have called you ASAP. How unprofessional! Love your attitude! You'll get through it, whatever it is, or isn't",
      "MessageIndex": 1,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780243",
      "Title": "Why, hello there... Lucys_hair_brained_schemes Lucys_hair_brained_schemes"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 9, 2012 12:11PM momof3boys wrote: Hi Renae- I had my third treatment today. My last is March 1st... Went off without a hitch today. I haven't had any neuropathy issues, but some of us have. I think they can lower the Taxotere if you do, but, look back at the Dec and Jan 2012 chemo threads. There's a lady on there that plays a violin professionally, so this is a very important issue for her. Her name is Rachel. I loved the book \"The Help\"! I remember getting to page 60-70 and having to go back to the beginning to verify that it took place in the 1960's! I live in the Nirtheast and found this book unbelievable! Also loved the movie, but there was so much in the book! Take care! And keep in touch! Joyce",
      "MessageIndex": 34,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 28, 2011 07:44AM momof3boys wrote: I'm up tomorrow for my first (of 4) TC treatments.... Any last tips/ advice? Just woke up and the anxiety is building.....",
      "MessageIndex": 363,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 31, 2011 02:30AM momof3boys wrote: Leesann I'm waiting for the moderators to comment on my question. I did verify what I heard from one of our posters on this board from her oncologist, with my oncologist yesterday before my first treatment. My score was 16... She said the scores will be revised shortly, and 11 and under is the new \"lowest risk\" cut off. Glad I decided on chemo. I hope all of the women get that info quickly. I do see a few with scores hovering above and below 20 deciding against chemo based on that test...",
      "MessageIndex": 402,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 30, 2011 01:02PM momof3boys wrote: Josie4 - I read about it here from a woman that posted. So, I asked my MO about it yesterday before my chemo treatment and she verified that they are redoing their scoring. She said with the new scoring, 11 will be the cutoff for lowest risk....",
      "MessageIndex": 408,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 31, 2011 05:05PM momof3boys wrote: April- according to my sisters: 3 boys = 1 girl!!! Lol They do keep me busy, but make me laugh every day. Baileybump I love your chemo beads! What a great idea! Wishing everyone a peaceful New Year's eve and day, and a happy and healthy 2012!",
      "MessageIndex": 435,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 5, 2012 09:13AM momof3boys wrote: LeesaAnn thanks for the reply. I feel like I'm losing my mind! Every twinge and pain I feel, I automatically think it's cancer spread. I almost lost it a couple of nights ago reading someone's post \"we all know that you can have mets with clear lymph nodes\" what? I dont know that! My MO keeps telling me that I had clear nodes, no vascular evolvement, etc... The cancer is gone (BMX clear margins, no nodes, blah blah blah, then I see that and I want to jump off a bridge! I hate this! Sorry for venting...",
      "MessageIndex": 498,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 6, 2012 06:09AM momof3boys wrote: AimeeMac: we need more posts like yours! Thank you! XO Rachelvk: you are my hero! I can't believe you had a burrito! I hope you feel good today and the Neulasta shot goes well. Do you know if they will forego the Neulasta shot if your WBC is high enough? Or is it pretty much standard of care, deemed necessary?",
      "MessageIndex": 515,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 7, 2012 10:29AM momof3boys wrote: Hi Deb267, I had my BMX w TE on 11/11/11 and have been healing and filling quite nicely. My scars are practically non existent. However, since I started chemo last week (could be a coincidence) I do feel \"pinching\" or \"grabbing\" sensation on me right side (bad side, and SNB side) when I told my PS this, (Tuesday) he said that he believes it's the nerves responding...and offered to prescribe a nerve blocker med. I declined it because I really don't want more meds! And if it's \"normal\" and can be controlled by Tylenol I'd rather do that. He did say that if it worsened, to let him know because that can delay healing and that if I did opt for the nerve blocker, it is a minimum of a 3 month med protocol.",
      "MessageIndex": 534,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 7, 2012 08:04AM momof3boys wrote: Heather! Yay for you! Enjoy your snooze! XO",
      "MessageIndex": 965,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 7, 2012 01:38PM momof3boys wrote: Hi Karen I think I was there for 4 nights because my PS made it clear that he calls the shots for his patients, not the hospital. He mentioned this several times, so I think he's happier when his patients stay longer! He also forbids the hospital nurses from touching his patients. They can take your temp and administer meds, but he sends his own nurses in twice a day to check incisions, bandages, drains, etc... He an admitted control freak, but I have to say, he's my favorite doctor on my team and he does really excellent work. As far as Tamoxifin v AI... I really don't know. My MO just said because I'm premenopausal and ER and PR positive, I'd be doing Tamoxifin for 5 years... It was also stated on my Oncotype test results, specifically Tamoxifin. I'm sure someone on here will know why. Welcome to the group! Joyce",
      "MessageIndex": 973,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 21, 2012 12:29PM momof3boys wrote: Rachel, I hope you get lots of rest tonight and that your fever goes down. Thinking of you...",
      "MessageIndex": 1188,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 22, 2012 09:19AM momof3boys wrote: Wave- that advice (about adding 1 degree to the temp when using ear thermometer) is because he feels that true temp can only be taken correctly in kids if you do it rectally. So, if I'm not using his \"medical grade\" thermometer, just one bought from cvs, he said to add one degree because they tend to be off that much. So, that's what I've always done. I think he's right, because whenever I take my temp after chemo, it's always like 97.4 to 97.8 so it makes sence.",
      "MessageIndex": 1224,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 24, 2012 01:40AM momof3boys wrote: Rachel- we all know that I was obsessed with bone pain, so much so that my MO sent me for a bone scan this week (it was clear, and she kindly told me that she knew it would be, but she realized that I needed it done in order to move forward, I really like her, she \"gets it\". Her Mom had BC 16 years ago). Anyway, throughout my tx, she has stressed that both the chemo and especially the Neulasta are causing the bone and joint pain. She specifically mentioned that any previous injuries would hurt more with the Neulasta and would be magnified...",
      "MessageIndex": 1242,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 29, 2012 01:39AM momof3boys wrote: Hello Ladies! Yes, I have my 4th and hopefully Last TC infusion this Friday! Erica, I'm glad you let your MO know that you're not happy with his communication. I bet that felt good, and also, I'm sure put him on notice that he'd better call you back next time. Not too much to ask for from a breast cancer patient, I'm sure. As for those getting #3 this week, that was actually my best one. I think I recovered much earlier, and have felt \"normal\" most of the last 10-11 days and have 2 more days to go before Freaky Friday. Maybe my body thinks this is the \"new normal\" and has gotten used to being under attack every 3 weeks? Idk.... My 7 year old son (Cooper) is home with a \"croupy sounding\" cough... So far I've been lucky and haven't picked that up. Hope everyone has a peaceful, uneventful day! Joyce",
      "MessageIndex": 1307,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 7, 2012 12:05AM momof3boys wrote: Hello Everyone- just checking in to see how everyone is doing. I went to the MO yesterday for my dreaded Neulasta shot (last TC tx was Friday), ran into my MO on my way to get the shot, talked to her for a few minutes in the hallway and she told me I could SKIP this last Neulasta shot if I promised to be very careful and stayed away from work and crowds this week! Yay! I normally would get my tx on a Thursday, then Neulasta on Friday. This time I went the entire weekend without the Neulasta and I didn't feel nearly as bad! So, I will be vigilant, but honestly feel that the Neulasta (for me) is worse than the chemo... Rachel- I've been reading about your eyelashes, just waiting for mine to fall out...I guess it happens after tx x 4...",
      "MessageIndex": 1388,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 7, 2012 03:24PM momof3boys wrote: Annie- how is your Mom? Rachel- hope you get some rest before your tx on Thursday, I'll even hope for a snow day for you if you promise to stay home for it!",
      "MessageIndex": 1406,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 7, 2012 07:41PM momof3boys wrote: Madison- it's too funny, isn't it? I was sweating, I thought for sure this was going to turn out bad for me... And she's a hair dresser! Well, in a barber shop anyway. She didn't get too close... I was imagining paying her and her trying to touch my hair! Oy! As soon as one of the other barbers went to the register, I ran over and prepaid for the boys.",
      "MessageIndex": 1409,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 13, 2012 11:42AM momof3boys wrote: Hello everyone- I read everyone's posts and it seems like we're all doing pretty good, for the most part, thank goodness. I am exhausted. Had too much to do this weekend, and was feeling so good and almost normal that I think I overdid it. Plus add daylight savings time and I'm ready to just collapse. Anyone else that has finished chemo finding themselves craving things and overeating? I swear I'm eating even when I know I'm not hungry. Also, having been craving peanut butter?!? I don't usually eat peanut butter, but have had it 3-4 times this week and last week....",
      "MessageIndex": 1449,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 13, 2012 04:32PM momof3boys wrote: I'm in tears...my son, AJ (my quiet, sweet one) came home from school today, walked in the door and burst into tears. He hust turned 10 last week and his best friend has been diagnosed with cancer, for the second time. Their teacher told the class today, as his friend was at the hospital undergoing more tests. This little boy had cancer when he was a toddler and this is a recurrance. My heart is broken. Although, of course, I'm hoping for the best, I just feel so numb and sad right now. I can't imaging what his Mom is going thru (I will call her in a little while) and my heart aches for my little boy and everything that he has gone thru with me these past few months, and his sadness over his best friend. So much to handle for one 65 lb little boy.... I hate cancer.",
      "MessageIndex": 1458,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 14, 2012 11:51AM momof3boys wrote: Speaking of wigs...when I went to buy mine, I tried on a reddish shoulder length wig that looked fantastic! Everyone wanted me to get it (I loved it) the only reason I didn't was because of my boys. They're so young, I just didn't want to walk into their school and have their friends not know who I was and them have to explain, so I chose a wig that is remarkably like my own. I did say that when my hair grows back, I may try that new color though... I've always had blonde hair and just get it highlighted. Btw.... Important.... Now that we're bald, take a good look at your scalp. I have a bright red mole on the back of my head! It's not large, but probably something that I should have one if my Gazzilion Drs take a look at... Thank you for the encouraging words about my little boy and his friend. My heart is really heavy. This little boy only has one lung. His other lung was destroyed with chemo a few years ago and had to be removed....",
      "MessageIndex": 1471,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 18, 2012 11:45AM momof3boys wrote: Hi everyone! I hope you're all getting a chance to enjoy the beautiful (unseasonable) weather we're having (at least on the East Coast). I went for a ling walk yesterday and felt great. Dropped my two little ones off at a birthday party and then met my 16 year old son for lunch. We had lunch OUTSIDE on a patio at a nice seafood restaurant. This is unheard of for NE PA in March...it was 77 degrees and sunny. Btw...I met him for lunch because he \"can't do dinner, Mom, I have a date\" oy! I don't like this... Today, I went for a short (20 min) bike ride with my little guys (speed demons, not into sight seeing, or leisure). Got off the bike and I swear I couldn't feel my legs! Can't feel my boobs, can't feel my legs... Oh well Tomorrow I go for blood work to determine if I can start rads earlier than 4 weeks post chemo, then I go to rads office to \"get mapped\" for radiation. I reminded the scheduler \"no tattoos\" she said \"yes, we know, it's underlined and circled in your file\" I'm sure they think Im a pain in the neck.., I don't care. I've been through enough and it's not over yet. I can commensurate with those of you finding the wig uncomfortable. I'm going to have to find/buy more lightweight caps hats, especially with the weather warning up. As far as fatigue: it really seems to hit me around 6 pm, when I find myself really tired and cranky. And... Anyone else experiencing this? When my drains were put in under my BMX on both sides, it's sore. I don't know if it's because of this surgical bra that my PS insists I wear until my exchange, or if I'm feeling it more because nerves are regenerating? Anyone?",
      "MessageIndex": 1500,
      "PostDate": "18/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 19, 2012 07:10PM momof3boys wrote: Well, I failed the WBC test for rads today. My WBC was 2.9 (I feel fine). They called me about an hour after I left. I did do the simulation and got my body indentation etc. They also do a CT scan of your chest. I have to go back on Thursday to see if my WBC is on the rise. I am 17 days post last chemo tx. Shoud've taken that last damn Neulasta shot I guess! Arghhhh I wondered about a support group, but, I didn't look into it. I was honestly hesitant because I thought it might be depressing for me if there were women worse off than me. I tend to empathize well, and don't want to put myself in a position where I have another person or persons that I'm worried about. I hope that doesn't sound selfish, but I'm trying to protect myself. There's not two hours that go by that I'm not checking in to see how everyone's doing here, even if I don't post.",
      "MessageIndex": 1516,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 28, 2012 10:18AM momof3boys wrote: I was able to start rads today. I got there at 9:25, scanned my card, got changed and the technician was waiting for me. I was back in my car at 9:34! Hope it runs that smoothly all the time. Tomorrow, I'll be there at 8:30 to meet with the exercise lady (I'll have to figure out what to call her) that should be fun and interesting. Then, I'll have my tx at 9:30. My center has a huge, commercial quality cappuccino machine. Everyday they ask me if I want one, or a latte and so far I've always said no thank you. Today, the woman at the front said, \"oh, come on. We all had to come in on a Saturday for two hours to learn how to use it...let us put our skills to use!\" so, maybe tomorrow I'll try it. They've been very nice and thoughtful.",
      "MessageIndex": 1602,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 29, 2012 08:11AM momof3boys wrote: Lol Wave... I laughed out loud at your statement that it's safer to wear the wig! I'm not brave enough to go topless yet, but I'm not wearing my wig to radiation tx in the am... I'm in and out of there in less than 15 min and I'm just wearing a little cap. Same thing at home or out in my neighborhood exercising... Just a cap. Rachel!!!!!!!! RACHEL!!!!! So glad that tomorrow is your last tx! I hope it goes smoothly and your SE are minimal. I'll be thinking about you tomorrow. Joyce",
      "MessageIndex": 1611,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 3, 2012 08:51PM momof3boys wrote: Hi Myleftboob..I was referring to news in the US today about BC being over diagnosed, and talk in the media in the US about women not needing mammograms until they're 50, and pap smears only every 3 years, again in the US. As far as waiting long periods of time for biopsies, results, I was basing that on posts on BCO from women in the UK and Canada. I'm glad that has not been your experience. I'm concerned with women's health issues, no matter what country they live in. Especially here at home, there is concern of proposed health care changes and it's a devisive issue in the US. IMHO I would prefer our government not to get into the health care business. Some are for, some against. Good to live in a democracy though!",
      "MessageIndex": 1668,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 3, 2012 09:35PM momof3boys wrote: I agree, and sometimes I think I'm getting paranoid when I start thinking \"why is the government (US) all of a sudden back peddling on screening tests?\" it seems every couple of months there is a revision \"down\" for medical screening recommendations, mostly for women. There was a discussion here a few days ago with our follow up testing after our treatment is over. It feels like our Drs all went to the same school of \"no follow up scans are needed or advised unless you present symptoms\" it's like they all learned the exact same phrasing, even... I agree that if it was a men's health issue, BC research would see a lot more money and focus.",
      "MessageIndex": 1670,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 7, 2012 11:06PM momof3boys wrote: Hi Renae..I'm sure your MO is going to take everything into consideration before making a recommendation for or against chemo, then it will be up to you to decide what you feel comfortable with. For me, before my BMX, I met with my MO and she said based upon the size of the tumor, and my age 43 (considered young for BC) she was 90% sure I'd be doing chemo. Then my Oncotype score came in at 16, so she was \"on the fence\". She told me that \"you wouldn't be wrong to turn down chemo, but I can't tell you that you'd be right either\" because I didn't fit into any \"box\" that made it clear cut. I didn't have any node involvement, and no vascular invasion. It was a tough decision, but we did decide to go ahead with chemo. I'm doing 4 TC (3rd is this Thursday). She did tell me that her group (10 MO's) uses 11 as the cutoff for young, otherwise healthy patients. And also, with that low of a score she would not prescribe any chemo that may cause heart damage later on. I've heard other women refer to TC as \"chemo lite\" and while I would never agree to that, it hasn't been too terribly bad and I mentally feel more confident knowing that I did what I could to prevent a recurrance. I know some will not agree with me, but, I just think that the Oncotype score is just one tool to be used to determine recurrance and if one should or shouldn't do chemo. You need to be confident and believe in your own decisions. Good luck tomorrow!",
      "MessageIndex": 14,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "May 12, 2012 08:06PM momof3boys wrote: It could be that since you do not have cancer, your insurance is denying your request for mastectomy? I think I'd ask the Dr about that... Have you had genetic testing done?",
      "MessageIndex": 2,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787366",
      "Title": "High risk but doctors won't perform a BMX j2kbbax girlguru"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 6, 2012 10:19PM momof3boys wrote: * couldn't face",
      "MessageIndex": 3,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782276",
      "Title": "Is 81 too old for aggressive treatment? biddy sincitydealer"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 22, 2012 05:20AM momof3boys wrote: Hi Jaebon I did 4 tx of TC. I started to lose my hair just before my 2nd treatment. I had shoulder length hair before chemo, prior to my first infusion, I had it cut into a short pixie style, so it would be less traumatic when I lost it. I had my last tx on march 2nd, and my hair is starting to grow back....it is in that fuzzy stage...oh well, it will grow back. I had minimal side effects, worst one really was hair loss. I had flu like aches and pains and low appetite for the week after chemo, and a bit of fatigue, but took care of my three kids and worked thru it. I did have bone pain from the Neulasta shot, but learned Claritin helped with that. It was really helpful to join a chemo thread for women going through it at the same time. We shared info on side effects, questions, etc. It was really helpful !",
      "MessageIndex": 1,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/786245",
      "Title": "taxotere/cytoxan ? Jaebon Lumpynme"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Aug 29, 2012 10:13PM momof3boys wrote: I did a BMX with reconstruction, chemo and radiation. Got 4 opinions on the radiation. My RO explained that the risk of local recurrence is very different than distant recurrence (I had a low Oncotype score) and the most likely place for recurrence is just underneath the incisional scar. So, since my ILC tumor was just over 4cm, they recommended it, and I did it. I did research he risks and long term risks and SE. But, something one of the RO's said to m when I brought up potential future cancers \"But, you have a known cancer now, let's make sure we eradicate that\" That made sense to me.... I know it's a tough decision, good luck.",
      "MessageIndex": 5,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/792733",
      "Title": "do I need radiation mhtan coraleliz"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 21, 2012 07:22PM momof3boys wrote: I think for your peace of mind...consult with a breast surgeon, and ask for a breast MRI. When I was diagnosed, my oncologist was very frustrated. She said that mammograms and ultrasounds are useless on young women and all women with dense breasts. If you and your midwife can both feel something, then you need to know what it is. I'm not sure at 18 weeks pregnant you can lay on your belly for the MRI ?",
      "MessageIndex": 3,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/784452",
      "Title": "Ultrasound tomorrow - lots of questions jlh9s hale0811"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 1, 2012 09:08PM momof3boys wrote: Sending prayers your way. XO",
      "MessageIndex": 2,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780329",
      "Title": "Hold Me Up Sistahs pupfoster1 thefuzzylemon"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 14, 2011 09:03AM momof3boys wrote: I'm feeling about 90% after double mastectomy and reconstruction. I wake up achey in the morning, and feel better the more I move around. I've been going to the PS two times a week to get the expanders filled. That is not painful, by the way, I do not feel that needle going in and close my eyes for it...a few hours later, I feel slight pressure (kinda like when your milk comes in after having a baby, but not nearly as uncomfortable). I still get tired every few hours, but, I'm functioning and doing most everything I did before: taking care of the boys, laundry, decorating for Christmas, shopping, working from home mostly (I own a business, and have wonderful associates \"covering\" my role there). I'm nervous about starting chemo, of course, not looking forward to the tiredness, aches and pains I keep hearing about, and the nausea. The hair loss I can deal with. I actually am in a stage where I \"like\" my hair right now, unfortunately, but, at 43.....I'm no longer concerned with what others think or if they stare. So, I'm \"ok\" with that (hopefully).",
      "MessageIndex": 420,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 3, 2012 06:11PM momof3boys wrote: Anyone experience bad lower back pain??? I'm 6 days out from 1st TC treatment and was doing very well until about an hour ago (no nausea, just achiness that Tylenol took care of) now I have very bad lower back pain? I did have a Neulasta shot on Friday, day after chemo Help?",
      "MessageIndex": 718,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 5, 2012 08:23PM momof3boys wrote: Hi Baileybump I definitely had the wake up sweaty part. A couple of days ago I experienced terrible lower back pain that seemed to travel up my back the next day... It's okay now. Just taking Tylenol for the achiness, but I resorted to percocet that first day of pain.",
      "MessageIndex": 746,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 12, 2012 09:42PM momof3boys wrote: Hi tiedyemom I just had one of 4 TC treatments so far. Second is scheduled for 1/19. I had a BMX with immediate TE on 11/11/11 and have o say that was difficult, but my most emotionally difficult day was when I went to pick out a wig, so I understand where you're coming from. I cut my hair short pixie like before my first treatment, so now I'm in the 'waiting mode' for it to fall. My husband and boys and family and friends have all been amazingly supportive.",
      "MessageIndex": 802,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 18, 2012 08:17AM momof3boys wrote: Thanks Kelloggs! I know I felt that Neulasta rising up in my pelvic bone, all the way up my spine. It was the weirdest thing.",
      "MessageIndex": 854,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 18, 2012 08:29AM momof3boys wrote: Thank you, you too! I'll be thinking about you tomorrow. Good luck!",
      "MessageIndex": 856,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 20, 2012 08:30AM momof3boys wrote: Baileybump- yes! Yesterday before my 2nd TC treatment, by BP was low. Nurse took it 3 times (100/60, 100/70, 110/60) I told her it is historically low (before BC) she said it was 140/70 on 11/11/11. I reminder her that on 11/11/11 they took it right before my BMX! Geesh.... That's obvious, isn't it. I'm feeling okay today. Get that damn Neulasta shot at 3:30... MO said that if all goes well for my 3rd infusion, she will cut the Neulasta in half for the last TC treatment. And yesterday, they did not give me Benadryl before my treatment, since I didn't have any reaction at the first one. And that was fine. No adverse reactions yesterday. And....my sister set up a kind of \"celebrity visitor\" schedule yesterday for my 3 hour stint! She came with me, but had different \"surprise guests\" appear for 15-20 minutes visits every hour. It was fun, as I was feeling fine, and made it go by much faster and with a lot of laughs! No cancer talk or questions!",
      "MessageIndex": 886,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 31, 2012 03:30PM momof3boys wrote: I did not shave my head either. My hair stylist told me not to. It was shoulder length, (my avatar) and we cut it into a pixie cut. Now, it has definitely thinned out way too much not to wear a wig or a hat. But, she said with 4 treatments, not to shave it and we'll see it at least some of it sticks around giving me a head start when treatments stop. I do find it odd that the hair under my arms and my legs is continuing to grow. Shaved both areas today. Hope it's not TMI, but still have hair \"you know where\" too.... Felt so normal today, I stopped after work (half day) and got my nails done. I finally feel human again after last week. TC #3 is Feb 9th.",
      "MessageIndex": 1014,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 1, 2012 05:13PM momof3boys wrote: Laura, don't be too hard on yourself. One of my friends is actually calling me Howie Mandel... I'm practically isolating myself over the fear of picking something up. We are undergoing chemo in the midst of winter, which, (I'm in PA, I see you're in NJ) has been wacky, weather wise. Today is was 58 degrees, yesterday it was 32 degrees. Half of my FB friends (not undergoing chemo!) are sick or their kids are sick.... A friend that text me last night that she prepared lasagna for me for tomorrow just posted on FB that she just came back from the pediatrician with her daughter and she was diagnosed with strep! I'm thinking of telling her to keep the lasagna! Lol",
      "MessageIndex": 1026,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 5, 2012 09:40PM momof3boys wrote: Joining some of you in the chair on thursday... My 3rd of 4. Going to miss my days of \"feeling almost normal\" Good luck for everyone going in tomorrow. I'll be thinking about you.",
      "MessageIndex": 1058,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 9, 2012 06:49PM momof3boys wrote: Kelly- wonderful news!",
      "MessageIndex": 1112,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 18, 2012 07:55AM momof3boys wrote: Hi Gator I'm so sorry to hear of your horrible SE. I've been blessed with not having nausea, but, the bone and joint pain for me has been relentless, only easing up about 4-5 days before my next tx. I hope they can find something that will give you relief. I think the added pain is exhausting, and depressing and just makes everything worse!",
      "MessageIndex": 1170,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 03:09PM momof3boys wrote: Oh I can relate! I have two sisters... Both older than me and an older brother. I'm the \"baby\".... My other sister, lives near both of us, did come to my surgery in November and I saw her at Christmas. She told me that she talked to her principal (she teaches fifth grade) and has over 30 sick days to use with her principals blessing to help me. I have 3 boys...and work! Well, since Christmas, I've gotten 3 text messages from her, that's it! Not even a phone call! No help, no meals, nothing (I have a ton of friends, co workers, neighbors, and of course my other sister and brother constantly bringing meals, treats, flowers, groceries,etc, and helping getting the boys to and from school, practices, playmates, etc. My sister? A text!",
      "MessageIndex": 1270,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 8, 2012 07:54AM momof3boys wrote: Markat-great news about the liver enzymes, what a relief! Rachel- good luck today, hope your day is uneventful and that you get some great sleep tonight! Thinking about everyone! We've come a long way!",
      "MessageIndex": 1312,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 21, 2012 09:18AM momof3boys wrote: I also chose BMX and don't regret it one bit. Was given the choice of lumpectomy, UMX or BMX. All Drs (except my Aunt, she's my ob Gyn) said it was my decision, they wouldn't steer me one way or the other. My Aunt emphatically said \"do the BMX and get it over with\". When I told my BS what I decided, we could see he was \"physically relieved, gave a big sigh\" and said he thinks I made the right choice. Also, I couldn't believe how supportive the nurses were in the hospital. They also said it was the best thing to do, they see so many women coming back. I was also surprised how many nurses had breast cancer...three of the nurses taking care of me were BC survivors, the youngest 33.",
      "MessageIndex": 1367,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 21, 2012 09:50AM momof3boys wrote: Dougieswife: yes! Even the nurse that checked me in for my BMX had BC. So that makes 4... That I had contact with at the hospital... Geesh that seems like a lot.",
      "MessageIndex": 1371,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 13, 2013 09:52PM momof3boys wrote: ((((((((hugs)))))))) we're all waiting with you. I think everyone just hates to see the agony of any one of us waiting for results. My thoughts are with you, and I hope you get a good nights sleep. XO",
      "MessageIndex": 15,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800383",
      "Title": "It's been a week, no results, I can't take this much longer!!! OldOakTree Moderators"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 20, 2012 03:29PM momof3boys wrote: Hi Ronnie, the odds are in your favor that this is benign, so try to relax until you have a definitive answer- I know- impossible... That being said, if I knew then what I know now....I had regular mammograms since the age of 32 (maternal aunt with BC). Heard the comment plenty of times \"oh, you have dense breasts\". After being diagnosed with BC last fall at age 43, my oncologist told me that young women (they consider 43 to be young!) with dense breasts should be getting MRI's, not mammograms. I did have a baseline MRI at 40. I didn't know that my insurance co refused to pay for yearly MRI's and had mammograms after that. My MO said my tumor had to have been there thru the last 2-3 mammograms... So, demand that your dr write you a script for a breast MRI. And, pass the word to any woman that mentions that she has dense breasts.",
      "MessageIndex": 5,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786178",
      "Title": "Biopsy Today and Scared Ronnie22 Ronnie22"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 20, 2012 05:41PM momof3boys wrote: Ronnie- it's really hard, I know. Try to stay off of google until you know anything definite, even then, google is full of incorrect and outdated information. Can you call your Dr and maybe get a prescription for Ativan? It will just take the edge off. I keep having to remind myself not to worry about what may be...if it never comes true, I've wasted that time, if it does come true, I've lived thru it twice (Michael J Fox) has a great quote about this!",
      "MessageIndex": 8,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786178",
      "Title": "Biopsy Today and Scared Ronnie22 Ronnie22"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Nov 2, 2008 03:37PM momof3boys wrote: I know what you mean about the pain of a mammogram. However, you having five children, it is nothing compared to the pain of childbirth! The spot-compression mammogram is a little more painful, but certainly \"do-able\". Just an FYI...if after the ultrasound they recommend an MRI, I can promise you that it is completely pain free, nothing to it...",
      "MessageIndex": 12,
      "PostDate": "02/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/723590",
      "Title": "I'm not actually worried, but I need some opinions KiminNewOrleansLA pk0199"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 30, 2011 09:37PM momof3boys wrote: Mine are 16, 9 and 7... Love them! They make me laugh every day! Happy New Year to you, too. I'm also a Taurus.... Never been called patient, though!",
      "MessageIndex": 9,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780188",
      "Title": "What are your symptoms? lele109 Lyn1n"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 12, 2012 04:01PM momof3boys wrote: Hi Flislander- I had a BMX and immediate TE reconstruction 11/11/11.. I haven't had any issues and the fills are painless. I have a decision to make regarding rads, but my PS assures me that there is a very small percentage of women that have issues (I'll probably hear from all of them) and that anything that occurs, he can fix. I'm not naive, but try to look at the benefit of radiation and recurrence, and hope for the best cosmetically. I was not a candidate for other reconstruction (not enough to pinch an inch!, and was not interested in using my back muscles and creating another issue to contend with.... It is a very personal decision, I know. People have very definite opinions about reconstruction.",
      "MessageIndex": 799,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 20, 2012 08:32AM momof3boys wrote: Had to sign a HIPPA form before each guest appearance though! Although the nurse was very nice about it.",
      "MessageIndex": 887,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 26, 2012 04:11PM momof3boys wrote: Vaniex- yes, I definitely have more blurry vision. Not enough to complain to my MO about, I even forgot to mention it to her. But remember reading on BCO about vision problems with chemo. Ive read of some women with a lot of \"dry eye\" problems and some with \"watery eyes\".",
      "MessageIndex": 955,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jul 10, 2013 09:21PM momof3boys wrote: I think you should insist on a breast MRI. When I was diagnosed, my mo said that young women with dense breasts should be getting MRI's, not mammograms. She estimated that I had ILC thru at least 2-3 years of mammograms. I was very clear on the MRI.",
      "MessageIndex": 13,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806628",
      "Title": "Starting to feel anxious Shezza33 chrissyb"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 18, 2012 08:01AM momof3boys wrote: Tomorrow is TC #2 of 4 for me. Hair is shedding quickly, just this week. I'm definitely taking the Claritin this time. That Neulasta shot was a nightmare! I hope everyone has an easy go of it this week. Thinking about all of us!",
      "MessageIndex": 852,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 26, 2012 08:15AM momof3boys wrote: I'm not having any nail issues (knock on wood). I'm not icing or anything, but have (asked my MO and she said go ahead, if you feel like it) had two mani pedi's so far during my treatment. I was sure to explain to the manicurist about the chemo, and they knew the whole \"no cutting, everything very sterile\" routine. Also, had them do a \"newer\" technique on my fingernails called shellaque...it's basically 7 coats of polish, over my own nails, leaving them \"hard as nails\".,",
      "MessageIndex": 945,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 29, 2012 05:54AM momof3boys wrote: Hi gator - did you take the Claritin? Also, I found that Aleve worked better than Tylenol (for me). But my MO said to call her this time if it was unbearable and she would prescribe something stronger. Last time I was fortunate to have leftover Percocet from my BMX... The pain is awful. I'm so sorry you're in agony.",
      "MessageIndex": 989,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 8, 2012 10:11PM momof3boys wrote: Going to the chair tomorrow! I'll be thinking of all of you!",
      "MessageIndex": 1093,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Mar 2, 2012 02:46PM momof3boys wrote: Hi what...thank you, I am relieved! There was no bell, but lots of good wishes and hugs. And my sister (as she's done along along, came with me and scheduled \"special guest appearances\" of family and friends for 15 minute visits. And flowers were delivered from my aunt and uncle! So it was nice, just glad it's over! I already had my BMX surgery in November. So, next up is rads in 4 weeks then sometime this year, exchange surgery to permanent implants. Just glad the chemo is done! BMX was easier!",
      "MessageIndex": 1267,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 14, 2011 08:50AM momof3boys wrote: Actually, in the months before being diagnosed, I lost 30 lbs on the Dukan Diet, and it was a struggle. I definitely do not want to regain any weight, as I feel so much bettet and have so much more energy at 153 as opposed to the heavier weight. So, I'm concerned with that and that the oncologist stressed that women that don't gain weight, have better outcomes.... She did say (and she's very naturally thin) that chemo does have a tendency to make you gain a little bit of weight, but alot of women, over eat in the weeks between treatment, anticipating that they are going to be sick and lose weight in the week after treatment, and they (her patients) don't end up being as physically sick as they feared. So, she said to be aware of that. I've prepared my kids about my hair loss..... (three boys: 7,9 &16). I've reassured them that the cancer is not going to cause me to lose my hair, but the medicine that will help make the cancer not come back will make me lose my hair, that was reassuring to them). I also made them all laugh when I suggested that they shave their heads in support of me....hahaha! They all said, that's ok, but, we're not doing that! (They all have buzz cuts anyway)",
      "MessageIndex": 418,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 14, 2011 09:27PM momof3boys wrote: Hi Rachel PT wasn't suggested to me after the double mastectomy and immediate reconstruction. Interestingly, my PS put me through a bunch of range of motion and strength tests before the surgery, and I'm physically fit. I'm concerned about weight gain because: psychologically I know it will be hard for me to take one more thing! I just recently lost 30 lbs and am very happy right now with my weight. My oncologist said some weight gain is normal, but to watch. She said a lot of women overeat between chemo in anticipation of being sick...and a good number aren't that sick after all. Also, she said that in her experience, women with a healthy weight do better during and after treatment. There's actually a gym attached to the facility that I will receive my chemo and my insurance covers the membership (it's owned by the Drs in her practice). She also recommended swimming and again said she'd write a prescription for it so I could use an indoor pool near my home that is located in a rehab hospital.",
      "MessageIndex": 446,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 11, 2012 09:02AM momof3boys wrote: That's a tough one! How many men has the Ontotype test been done on? Does it matter whether you're male or female? If you took that test out of the equation, according to my MO, you'd do chemo because the tumor was larger than 2cm. My score was 16, no nodal involvement, no vascular invasion, larger tumor, but low Oncotype score. After going back and forth, I decided to go ahead with chemo. I'm 43, no other health issues, tolerating TC (just did 3 of 4 on Thursday) well. If I were over 65 with a 16 Oncotype score, I think I would have have done the chemo. But at 43 with three boys to raise and a tumor over 2 cm, my gut was telling me to do it. Your score of 5 is so low.... My MO's group uses 11 as a cutoff for chemo, but I'm thinking it's mostly women. Although, one of the MO's himself (Dr Heim, Scranton PA) had breast cancer. Maybe look him up? I think the size of your tumor is the difficult part in the decision?",
      "MessageIndex": 10,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/782503",
      "Title": "Deciding whether to do chemo firstcall Bluebird-DE"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Oct 6, 2008 09:10AM momof3boys wrote: I know your surgery is coming up in a few days. I just wanted to let you know I'm thinking of you and hoping for the best. My Aunt had breast cancer about eighteen years ago. She was in the first trial group for the drug Tamoxifin. She had a masectomy, radiation, and chemo. Today, she is a healthy 59 year old grandmother of five, retired and living near the beach with my Uncle. Eighteen-twenty years ago, breast cancer was such a scary and devastating diagnosis. I know it's no picnic today, but does seem like it is more of a 'chronic illness\", not a terminal illness now. XOXO from me in PA, USA.",
      "MessageIndex": 8716,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Feb 11, 2012 09:04AM momof3boys wrote: * sorry, if I were older (like mid sixties) would NOT have done chemo",
      "MessageIndex": 11,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/782503",
      "Title": "Deciding whether to do chemo firstcall Bluebird-DE"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Jan 23, 2012 09:39AM momof3boys wrote: My PS had his nurse take a bunch of photos of my breasts before my BMX. I was a 36c before surgery. And now I am in the process of having my TE filled. That being said, I recently told him that I'd like to end up a bit smaller than I was before. I'm 43 and in my personal opinion, as we age, I think larger breasts are \"aging\". I actually think my profile looks better now than it did with the 36c's. I look thinner and \"higher\" and perkier even with just the TE's.... Anyone else feel the same?",
      "MessageIndex": 5,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781465",
      "Title": "Double Mastectomy, will I get 38D's back? Honeypotpie vicky3blum"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Apr 8, 2012 03:03AM momof3boys wrote: I am so sorry. Words are not adequate, you are in my thoughts and prayers.",
      "MessageIndex": 23,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785463",
      "Title": "My Sister Passed Away Tonight Curlylocks kaycancer"
    },
    {
      "AuthorID": "momof3boys",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73092/profile",
      "Content": "Dec 30, 2011 07:14PM momof3boys wrote: Hi Lyn Sorry for your stress! Unbelievable callous on their part! Where is \"NS\"?",
      "MessageIndex": 7,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780188",
      "Title": "What are your symptoms? lele109 Lyn1n"
    }
  ]
}