{
  "AuthorID": "MomOfTwins9…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
  "Posts": [
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Feb 22, 2016 04:25PM MomOfTwins98 wrote: I feel just like ChiSandy. My lumpectomy breast is now larger than the other breast. I've been going to a lymphedema therapist for a couple weeks and still have so much swelling - She gave me a breast compression pad to wear under my sports bra and told me today to wear it under a tank to sleep - not sure it will stay in place but I'll try. What is a sleep bra? where do you get them? My MO and primary care both saw how swollen I was and both did not seem worried about it - I, however, went to the lymphedema clinic on my own and she has been working with me. I actually feel more swollen but perhaps it is part of the process? Dont know but have two appts per week for the next several weeks so, hopefully, it will help and work. My therapist is lovely and told me she'll get the swelling down so I'm hoping she's right. I also had awful cording after my surgery and re-excision which was 100% better and I thought gone with but now, the pain seems to be in that same spot - Had worked with a PT for that who left the area.  ",
      "MessageIndex": 10,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/841273",
      "Title": "How long does post radiation swelling/lumpiness last? Ltam16 ChiSandy"
    },
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Jan 16, 2016 04:09PM MomOfTwins98 wrote: I hope you have a great trip - My skin did not get too bad until a day or two after I finished - the skin under my breast is completely gone so very raw and so so sore. I do the Domeboro soaks and just starting to get a bit better. Mine is in a bad spot, just where your underwire would be so hard to heal there anyway. A distraction and trip away sounds lovely - enjoy. My RO nurse did tell me to protect the skin for a good year after treatment so keep that in mind",
      "MessageIndex": 21,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836994",
      "Title": "Any Women Who Had No Problems During Radiation? ChiSandy Grammy4"
    },
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Dec 26, 2015 11:49AM MomOfTwins98 wrote: Hi - I am still having IMRT radiation - whole breast for 28 treatments. I was to have boosts but, it was explained that, as my tumor bed is so large, deep, and close to my chest wall, the boosts were not a good idea. So far, so good. I do use the prescription Momatasone after every treatment. I bring it with me and use in the dressing room right after treatment and then use Toms deodorant. A bit red and tender but not bad at all. I have worked every day and do feel tired but I have some other medical issues so that may not be helping. I also was started on Tamoxifin 7 days after radiation began so lots to handle at once. I live close to the oncology office so not a hassle to get there. I bring my children to school at 7am, appointment at 7:20ish, an then to work. While I am having IMRT whole breast only, I do feel tender where my sentinal node biopsy scar is but think that will improve. Hope this helps everyone out there. The Momatasone is awesome and I am sure it is helping tremendously if you need a different cream.",
      "MessageIndex": 15,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836994",
      "Title": "Any Women Who Had No Problems During Radiation? ChiSandy Grammy4"
    },
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Feb 12, 2016 02:39PM MomOfTwins98 wrote: Hi I recently finished IMRT whole breast radiation. My RO gave me a prescription for Mometasone Cream before I started and they told me to use right after each treatment. I brought it with me and, in the dressing room, applied sparingly over entire breast and chest area. It was GREAT! I had 28 treatments and was not really affected until the last week. Then, honestly, it got pretty bad but only where my tumor bed is...the rest of my breast, while quite red and burned, was not painful - I was told that the Mometasone, if used daily, makes a big difference. It is by script though - very inexpensive. Once my treatments ended, I continued to use it until empty and now use Aquafore, just to keep it moist. I also still only use Dove as a body wash, which was recommended during treatment and only Tom's deodorant/anti-perspirant. The tumor bed was raw so had to do Domeboro soaks for several weeks but, now, almost 5 weeks out, healing nicely. I wish you well",
      "MessageIndex": 15,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/840478",
      "Title": "After only ONE treatment! etnasgrl MomOfTwins98"
    },
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Feb 10, 2016 12:50PM MomOfTwins98 wrote: I so agree with Kiks1 - write everything down and don't be afraid to tell them if you need clarification. I even asked them to spell some of the words being used as it was the first time I'd heard them and I wanted to be able to go home and do research. I clearly remember my surgeon telling me he'd be doing a lumpectomy and when his nurse came in to have me sign the papers, it said \"Partial mastectomy\" - I said \"no\" - She explained that, in their terms, it was the same thing. I had no idea at all. I must have re-asked that question ten times before my surgery and then again the day of my surgery to be absolutely sure that we were all talking the same language. You MUST advocate for yourself and not be worried about asking too many questions. To help ease your mind about cost, I do know that, at our cancer center, they do have many grants that can help people in need. There should be a social worker and a care navigation nurse who can help you with all that. My husband works out of state and our insurance gets complicated as we live in MA but he works in NY. Just know that there is help out there and the American Cancer Society also helps fund things, if it should come to that for you. I really do think that, once you have more facts and know what you are dealing with, the journey will be a bit easier for you. It is the unknown that is so hard and scary. I think you'll also find that, as you proceed, you start to meet others who have also traveled this road...many of whom you may have known for a while and had no idea. That's what happened for me. I'm only 6 months out so still dealing with some scary feelings but it does get better and, as long as you have care and someone watching you, you'll do just fine. I'm glad they caught your BC early which makes it that much more cureable...and it is cureable. Take Care!",
      "MessageIndex": 27,
      "PostDate": "10/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841145",
      "Title": "I am so scared please lift my spirits rosierosie Danni1016"
    },
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Feb 12, 2016 07:36PM MomOfTwins98 wrote: Hi Robinda According to Breast cancer.org information, it states \"Lumpectomy followed by radiation is likely to be equally as effective as mastectomy for people with only one site of cancer in the breast and a tumor under 4 centimeters. Clear margins are also a requirement (no cancer cells in the tissue surrounding the tumor).\" Here is the entire link http://www.breastcancer.org/treatment/surgery/mast... This is the same information I was given by my surgeon when I was first diagnosed. Chance of recurrence is based on so many factors and, in the end, there are no guarantees, but the MO and surgeon should be able to give you all that information so you can make the best educated decision. As so many here have said, please take a notebook, write down all of your questions and then write down all of the answers. It helps so much when you can go back and go through all of the information and digest what has been given to you. If you have a care navigation nurse available to you, talk to him/her. They really are a wealth of information and act as an advocate for you as you try to sift through it all Rosie...maybe ask WHY he feels so strongly that you have it. Again, my situation was very different but, if he is suggesting you have the SNB, he/she must have a reason and you have the right to ask and understand the reasoning",
      "MessageIndex": 53,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841145",
      "Title": "I am so scared please lift my spirits rosierosie Danni1016"
    },
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Feb 13, 2016 06:56AM MomOfTwins98 wrote: Good Morning, ChiSandy is right - you have every right to a second opinion When I decided to get one, my cancer center was very supportive and helped me get all of my records and a contact at Dana Farber. They actually encouraged me and helped facilitate it. Perhaps you'll feel better hearing from another - hope it helps. In my case, they concurred and that made my decisions that much easier",
      "MessageIndex": 58,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841145",
      "Title": "I am so scared please lift my spirits rosierosie Danni1016"
    },
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Feb 10, 2016 08:34AM MomOfTwins98 wrote: Good Morning - I agree with the other ladies..the waiting is the hardest part. when I was first diagnosed, I called the Care Navigation team every day asking questions and waiting for results She would tell me, it is so normal to feel this way and the hardest part is \"now hurry up and wait\" - I also brought a notebook and wrote everything down and then looked up terms and procedures that I did not fully understand. Once you have information, and feel some type of control, it is better. I was diagnosed in September, 2015 so it is all still newish to me. I have a bag that carries all of my information and I still carry it everywhere and to every Drs appointment. The anxiety can be overwhelming at times but, take a deep breath, and have faith that you have good physicians. I even went for second opinion to Dana Farber to be sure that what I was being told was correct. I have 17 year old twins (boy and girl) and was diagnosed the day before their senior year began. All I kept thinking was that I was ruining their senior year. You know what, they've been AMAZING and my biggest support. My son even gave a speech saying that I was his hero because, through all the ups and owns, I've stayed strong. The truth is, Ive stayed strong because of my children. Its okay to cry and okay to be scared as this is the unknown but you'll be okay once yo know what you are dealing with. I wish you well and stay on these forums..the information is amazing and the women so supportive.",
      "MessageIndex": 22,
      "PostDate": "10/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841145",
      "Title": "I am so scared please lift my spirits rosierosie Danni1016"
    },
    {
      "AuthorID": "MomOfTwins9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223136/profile",
      "Content": "Feb 12, 2016 08:29AM MomOfTwins98 wrote: Hi RosieRosie Your diagnosis is the earliest possible stage - When my BC was diagnosed, it was from a biospy as the Mammo missed it and ultrasound was not sure but my OB felt the lump so I kept going. When it was first found, they did stage it and said it was Stage 1. At the time, I didnt understand what was happening and thought that was it...found out that the stage is set at that time but can change. I met with the suregon the same week and he told me the same thing. In my case, they found an additional tumor (both IDC) during a breast MRI, before surgery, which was actually being done to check the other breast (which, thank goodness, was fine) and then in surgery, found two DCIS. (all 4 in same breast). However, they were close together and all were taken during lumpectomy and SNB. My surgeon told me they always do a SNB just to be sure it has not spread to nodes but, with only DCIS, I do not know. My stage stayed the same as Stage 1, Grade 1 from before and after surgery and I even needed a second surgery as re-excision as my margins were not clean after the first one - after second, got it all!. (I went to Dana Farner for a 2nd opinion and she also confirmed that) - Because my Oncotype was 18, I also asked at DF about treatment and she told me \"no chemo\" - It is so much information to digest and understand as well as terms that I had never even heard of - Education is the best weapon and, believe me, I asked TONS of questions. I also had two needle localizations (one for each tumor) - sounds like you have a great team and with DCIS, it is very treatable...they say cureable. So glad it was found so early. I did require IMRT whole breast radiation and, while it wore me out, I continued to work full time and take care of my family through the entire thing so it is doable - take one step at a time and I know you will be just fine!",
      "MessageIndex": 46,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841145",
      "Title": "I am so scared please lift my spirits rosierosie Danni1016"
    }
  ]
}