{
  "AuthorID": "Mompv",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
  "Posts": [
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Apr 2, 2014 11:41AM - edited Apr 2, 2014 11:42AM by Mompv I was diagnosed on March 31 officially with IDC stage 2 grade 3. My dr. has decided to do chemo first to shrink the tumor. I do have an MRI scheduled on the 10th and an appt with her on the 14th. If the MRI comes back that it has not spread then we will go forward with just chemo for 6 months then a lumpectomy after that. If it has spread I am not sure what will happen.  Still in shock and am feeling depressed. I just keep thinking \"I can't do this!\" It is exhausting, all these emotions. I guess I need to just accept it and move forward. Good luck to all of you!!!",
      "MessageIndex": 15,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819722",
      "Title": "Diagnosed on Friday Louanne Curlylocks"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Oct 22, 2014 05:48AM Mompv wrote: I just started radiation on Monday. I have been lurking here for a while! Thank you all for the advice and sharing your experiences . I bought aloe Vera and aquaphor. I started applying day one. First right after treatment and before bed. Well must run and shower need to leave in an hour. I have a 40 min drive then to work! Have a good day everyone ",
      "MessageIndex": 643,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Mompv wrote: Found a lump on March 8th. Called GYN for annual and let them know about lump. They scheduled an ultrasound at the office on March 13th. After they took a look at it, she told me it was solid and had blood flow to it. They sent me for another sonogram and a mammogram. Mammo on the 14th and Sono on the 19th, which took 2 hours to do. I still have not heard a thing from my doctor!!! Anyway, I took the \"bull by the horns\" and called Roswell Cancer Institute. I called them at 11:30am on the 21st  and by 12:30pm that same day they called me back to tell me they ordered all my results from the hospital and will have the images Monday or Tuesday...depends on FedEx and how quick they got them out. Anyway, I am still waiting and worried. So, not only am I angry at my doctor for not calling me yet, I am petrified of the call.  What does blood flow to a lump mean along with it being solid?  Should I be freaking out???? I read things on here about all these different types of cancer and symtoms. I do not understand all the terms being used or the abbreviations. Maybe it is because my mind is mud at this point.  I guess I just needed to vent a bit. Thanks for reading! Surgery 5/11/2014 Lumpectomy: Left Chemotherapy 6/8/2014 AC + T (Taxol) Radiation Therapy 10/19/2014 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819466",
      "Title": "Scared out of my mind!!!! Mompv Mompv"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Mar 27, 2014 03:22PM Mompv wrote: radiologist said it is most likely cancer. I have an appt on Monday with the doctor. Feeling numb. ",
      "MessageIndex": 9,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819466",
      "Title": "Scared out of my mind!!!! Mompv Mompv"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Oct 13, 2014 12:54AM Mompv wrote: Hi all! I just thought I would check in here and offer some advice. Background first....I was diagnosed in march 2014 with stage 2 grade 3 Triple negative. Elected to have lumpectomy first followed by 4 AC treatments every 2 weeks then 4 treatments of Taxol every 2 weeks. I finished chemo on sept 18th and start radiation October 20th.  My advice is this....do not try and be superwoman! You will be tired. You will need help. Do not try to grin and bear it and act like everything is OK. You are fighting for your life!! Rest as much as possible. Everyone experiences SE differently. Hair loss happens and yes it sucks but in the scheme of things it is a small thing to bear. When my hair started coming out in clumps I had my DH shave my head.  I wore hats and scarves as wigs were hot. On the plus side I did not have to shave my legs or armpits....still don't but hair on my head is growing! Oh I lost pubic hair as well.  If you are taking neulasta shots try taking Claritan 2 days before and about 4 to 5 days after. Its not the claritan D. Always check with your oncologist before taking anything. I had people tell me before I started Taxol to take L-Glutamine for neuropathy. My oncologist said no. He sited research where some tumors could grow while taking. Some say OK so always ask!!!!! I guess my bottom line is this.....rest rest rest!!!! Drink lots of fluids. If water tastes bad try other things. I liked lemonade and chocolate milk. Some find Gatorade good. Eat what tastes good now is not the time to diet! You need energy your body is fighting.  If you are on the AC treatment, while they are doing the injection sip water it helps with the taste. Again do not try and grin and bear it and be superwoman.....rest. Do what you can of course but don't push beyond. I hope this helps. Good luck to all of you!!!!",
      "MessageIndex": 199,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Mar 25, 2014 11:40AM Mompv wrote: Well, Roswell received the images and the team of doctors is reviewing them today! I hope to hear today or tomorrow.  I just want this moved along so I know what I am facing.",
      "MessageIndex": 5,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819466",
      "Title": "Scared out of my mind!!!! Mompv Mompv"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Mar 28, 2014 05:32PM Mompv wrote: Got the call today. Ductal invasive carcinoma. Treatment will be discussed Monday. Feeling scared! ",
      "MessageIndex": 12,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819466",
      "Title": "Scared out of my mind!!!! Mompv Mompv"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Mar 24, 2014 08:00PM Mompv wrote: thank you! I always am on the Google! Can be good can be bad! I am hoping to hear tomorrow. ",
      "MessageIndex": 2,
      "PostDate": "24/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819466",
      "Title": "Scared out of my mind!!!! Mompv Mompv"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Mar 25, 2014 03:40PM Mompv wrote: I have a biopsy scheduled for Thursday. They said results could take 1-2 days. I am nervous, but at least things are moving along!",
      "MessageIndex": 6,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819466",
      "Title": "Scared out of my mind!!!! Mompv Mompv"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Mar 24, 2014 02:19PM Mompv wrote: Hugs to you and your hubby! Lots of prayers too!",
      "MessageIndex": 54,
      "PostDate": "24/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819132",
      "Title": "Freaked out and have no idea where to start Ddkath70 Holeinone"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Apr 20, 2014 06:54AM Mompv wrote: Janet:  My doctor too is doing chemo first. I see her tomorrow with MRI and final pathology results. After that I see the MO and get everything going! I too am nervous about the SE but have read a lot of good advice here. Good luck with your first day! Cold:  You do rock the bald look! Thank you for sharing all your ups and downs. Your sense of humor makes this easier.  I am going next Saturday for my pixie cut. Probably very soon but I want to get used to hardly any hair before it falls out😁 Thank you to the rest of you for your stories! It really does help. ",
      "MessageIndex": 257,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "May 25, 2014 08:57AM Mompv wrote: SN clear!!! Clean margins!! The rest of the report I haven't really looked at too close. They are hard to understand! I will have to remember the coconut oil and lint roller!!! Lol",
      "MessageIndex": 1114,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "May 28, 2014 11:07AM Mompv wrote: I am still lurking here as I don't start until June, my MO appt is tomorrow.  You all have been an encourgement to me. Your positive attitude despite your SE's and peoples comments are helping me not dread it as much. I still dread it but not as much. I just had someone this morning show me an article from John Hopkins on how sugar feeds cancer, it was actually an email and is debunked on snopes. I had another person show me an article on how cannibus oil is a cure for cancer. I know people mean well but...enough already! So, thank you to all of you for sharing the good, the bad and the ugly of this.",
      "MessageIndex": 1207,
      "PostDate": "28/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jun 19, 2014 07:19AM Mompv wrote: fluids? Water tastes yucky and too much makes my stomach feel bloated and almost nauseous . Ice chips? Juices? Fruit bars? All good alternatives? Thrush didn't help. Last Thursday was my first AC. Anyone else notice hair tingling almost right away? Ok one more. I have the option of giving myself the neulasta shot at home. I would save the 39 min ride and parking plus the one copay. It would only cost me 30.00 to do it myself as opposed to 65.00 plus time !  You all have been so awesome!!!! Thank you ",
      "MessageIndex": 1688,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Aug 28, 2014 10:38AM Mompv wrote: Congrats to all of you who are finished! I have been reading your posts just not participating . I have 2 taxol to go so I will be done 9/18 as long as the neuropathy doesn't get worse. Anyway the reason I am writing is to tell you all what the NP said to me when I was telling her how bad I felt. She said they worry more about people sailing thru treatment. In their minds they wonder if the chemo is doing its job. When you feel horrible the chemo seems more like it's doing it's job of killing cells. Just a thought!",
      "MessageIndex": 2619,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "May 25, 2014 07:52AM Mompv wrote: I just want to say thank you to all you wonderful ladies for being so open about what you are experiencing. I had joined this thread in April when I thought chemo was first. I ended up triple neg and elected      to have the lumpectomy and SNB first to get it out if me!!! I have my MO appt on Thursday, so I will be starting in June. I will keep checking in here to get a heads up on what's coming! ",
      "MessageIndex": 1111,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "May 29, 2014 08:12PM Mompv wrote: that's so awesome Timbuktu!!!!!",
      "MessageIndex": 1250,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jun 10, 2014 08:12PM Mompv wrote: Longisland I am so sorry for your loss.  I start chemo on Thursday and have a couple of questions. When do I take the Claritin? The morning of the neulasta shot? How about the ativan? Can I take it before I go Thursday?  I got my Port yesterday and boy is it sore. They won't let me use the EMLA cream this week... I totally want to whine about that!!!! Have a good evening ladies! And Footballnut I am glad you had a good weekend with DH. I always liked Niagara on the Lake. Lewiston on this side of the border is nice as well, though not as many shops! Next time you come across come to Lockport and see the Erie Canal.",
      "MessageIndex": 1494,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 4, 2014 10:23AM Mompv wrote:  this is on the back of my office door at work!!!!",
      "MessageIndex": 1938,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 10, 2014 04:41AM - edited Jul 10, 2014 04:42AM by Mompv To all struggling with finances... I found online the company who makes neulasta and they offer a co pay assistance.. Also contact Susan G Komen foundation they have resources for co pay help.  I am off to round 3 of AC. Sigh! Weary already of all this! Anyway, I hope you all have light SE days. ",
      "MessageIndex": 2060,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Apr 27, 2014 04:35PM - edited Apr 27, 2014 04:36PM by Mompv  Ok . Here's my pixie! I did  mine early as I have surgery May 12th and chemo 2 weeks after.  They were going to do chemo first but turns out I was triple neg, and I chose to get it out  now. Anyway I figure this way it will be easier for after surgery and it will give me a chance to get used to it short before it's gone.  You are all  such strong women!  Thank you for sharing your experiences the good and bad. I feel a bit more prepared. I do have one question , what kind of bra did you all wear after a lumpectomy?",
      "MessageIndex": 422,
      "PostDate": "27/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Apr 17, 2014 07:59AM Mompv wrote: I am not sure when I am starting chemo. My doctor has decided to to chemo first for 6 months then lumpectomy. I see her on Monday then will schedule the oncologist. All I know so far is that it is IDC stage 2 grade 3 and that it has not spread to my lymph nodes. I will find out Monday all the other details. I am nervous about starting chemo, but feel better after reading these posts. I have scheduled a teeth cleaning for Tuesday after reading it is a good idea. I have also begun drinking more water to get used to drinking so much. Time to train the bladder!!! I have also decided to cut my hair once chemo is scheduled or maybe I will do it sooner as it will be easier to take care of. My DH is shaving his head down to a buzz cut.  You all seem so brave and are inspiring me to get a grip and confront this head on!!! Thank you!!!",
      "MessageIndex": 194,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Apr 21, 2014 07:37PM Mompv wrote: Thank you Linda. I have just made the mistake if looking up the prognosis for triple neg. Good thing my DH is going out  of town the rest of this week. I can just have a  good cry about all this and not cause him more stress than he is feeling right now. He has admitted he is so afraid of losing me. I am afraid at this point!! Thank you for the hugs!",
      "MessageIndex": 290,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "May 29, 2014 02:45PM Mompv wrote: The study for the Herceptin is to see if it effective against Triple Neg. Right now it is used for HER+. I did read the adriamycin is hard on your heart, my MO said the risk is 1% I would have problems. I hate this.....",
      "MessageIndex": 1237,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jun 13, 2014 05:59PM Mompv wrote: Went to work today only made 1/2 day. I had to work so slow so I posted properly!!! I am a bookkeeper, and the office manager! I am trying to drink 64 oz of fluid, wondering if a banana smoothie counts since I am sick of waster and the sparkling. Oh well.  Did eat a hamburger patty for dinner and and added Greek yogurt to my instant breakfast smoothie and a banana. Should be good protein.  I plan on taking claritan tonight since I have my first neulasta shot tomorrow morning.  I hope everyone is resting and doing what they are supposed to.  My youngest dd, who is 21 just did a complete Lysol spray of the house...,she is so paranoid I am going to get an infection. Well it shows she cares!!!! Good night all. ",
      "MessageIndex": 1566,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jun 21, 2014 06:33AM Mompv wrote: http://m.youtube.com/watch?v=L5bLvVjJ4MA Cold and other who are leaning on God! This is one of my songs! ",
      "MessageIndex": 1729,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 2, 2014 02:06PM Mompv wrote: Anyone else just nauseated by the thought of drinking liquids? Except milk I seem to be able to drink it. I am trying just eating ice chips. I am just tired and fuzzy which I hate! Ok enough whining! Hope everyone else is doing better. This is day 7 after round 2 AC.",
      "MessageIndex": 1905,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 4, 2014 08:47AM Mompv wrote: Thank you all for the fluid tips! Anyone else have bizarre dreams? I wake up and just think...what the......?  I am going to try and go to the grocery store with DH. I am still too spacey to drive. I feel like I am high or something and I hate that. But light at the end of the tunnel. I should feel really good oh about Wednesday, just in time for round 3 of 4 AC. Then I start 4 rounds every other week of Taxol. My MO says this is the best for my TN status.  Hair started falling out 10 days after round 1. Shaved it but now have stubble!  Nice to not shave armpits or legs though.  Hope everyone has a light SE day!",
      "MessageIndex": 1932,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 4, 2014 10:19AM Mompv wrote:  So here I am with my youngest DD! Thought if you all were brave I could be too!!!",
      "MessageIndex": 1937,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 6, 2014 11:51AM Mompv wrote: Footballnut you need to call your dr!! They always say to call because they have meds for everything!!!",
      "MessageIndex": 1977,
      "PostDate": "06/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 11, 2014 12:33PM Mompv wrote: Glad to see Footballnut is on the mend. I guess this is a lesson to all of us to not ignore anything. I was told to call over ANYTHING even if we think we can handle it. They take care of a lot of people and have see and heard everything. Although I was disappointed after my MO visit yesterday (after an 1 1/2 wait) that he had no answers for my overly spacey and tiredness I experienced last time.  I went ahead and  am working only 1/2 day today, came in at noon working til 4:30, so amazingly enough I slept til 7am, I am usually up at 5am. I feel better today than I did this time after the last infusion. I am monitoring the nausea. I took the steriods but not the prochor...something. I did take an ativan last night and they gave me one in the infusion room. I have been watching my fluid intake as well, I wonder if last time I didn't drink enough or sleep enough.  Anyway, funny story... Yesterday morning, I was just puttering around the house bald...and the bell rang, it was UPS. Poor guy did a double take. I bet I woke him up!!! Oh well this is life.  Tomorrow is Neulasta early..first in first out is the name of the game there. It is a very very busy place. I go the Roswell Cancer Institute here  in Buffalo, NY. They are the best in the area which why we wait. I have my last AC on July 24th then onto Taxol for 4 rounds every 2 weeks was the initial plan, we shall see.  Estimated finish date is Sept 18th.  I am gonna take cake and ballons to the infusion room.  The nurses are fantastic. It seems you all go weekly for 12 weeks. Then onto radiation everyday for 5 weeks...yikes!!!! May you all have lighter SE's hang in there....this boat will pull into the wellness harbor soon. Then let the party of our lives begin. It does shift your priorities in life. I am pondering them now... First on my list is to do more fun things with my wonderful  husband.  He even takes the time when we are in the infusion room to go visit people who are there alone! !!! He has been wonderful through all of this: laundry, I wash he take to laundry mat to dry, yep our dryer broke can't afford to replace yet with those pesky medical bills looming over our head. He cooks every meal...but he is the better cook, my thing is baking. 2nd would be my girls, when they have time in their busy lives. Work on my children's books I have going. Doesn't show here but I love writing stories for children, I have many in progress. I want to work on them now while I have a lot of sit time, but my brain does not cooperate...it seems to be bouncing down the freeway somewhere wanting a vacation...maybe on a beach...salt air, wave crashing...ahhhhhh the relaxation dream...... Ok gone on to long..back to work!!!!!",
      "MessageIndex": 2099,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "May 29, 2014 01:55PM Mompv wrote: So, I met with the MO today and I have 2 choices of treatment. I am like wait...I have choices??? #1 Taxotere and Cytoxan every 3 weeks for 4 treatments (been told this reduces reaccurence for my triple neg from 30% to 20%) #2 Taxol, Cytoxan, Adriamycin every 2 weeks for 8 treatments (reduces reaccurence to 17%) I can also participate in a clinical study for Herceptin. Leaning to #2 just for the odds factor. My odds for even getting this were slim as no incidence in the family history. My next appt is June 5th to let him know my decision with a start date Mid-June.  I am really stressing at this point...good thing I have work or trying to anyway. Any thoughts?????",
      "MessageIndex": 1234,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jun 3, 2014 05:34PM Mompv wrote: Footballnut enjoy Niagara Falls! I live 30 min from there.  I keep following everyone here's progress. You are all being a help as I will be scheduling my treatments soon. My MO appt is Thursday. This is the day I tell him which treatment option I chose.  Keep on staying positive I keep telling myself!!!!",
      "MessageIndex": 1332,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Sep 24, 2014 08:06PM Mompv wrote: She looks great! I wish I was as brave!",
      "MessageIndex": 2788,
      "PostDate": "24/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Apr 21, 2014 07:10PM - edited Apr 21, 2014 07:11PM by Mompv Hi all. Been lurking here. I thought I would be starting chemo this month but looks like end of May. I just got my pathology back and it's triple neg. I have elected surgery first, I was given the option. Still going for my short haircut Saturday. I think it will be easier to deal with after surgery, besides it will get me used to hardly any hair.  It's funny how life just changes in an instant.  Thank you all for sharing your experiences.  I am feeling a bit blue tonight so I am going to just read and veg out!",
      "MessageIndex": 288,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jun 20, 2014 05:36AM Mompv wrote: Thank you Coldincanada you really said it all quite well. I am gratful it's me and not my beautiful girls! Yes we are being refined by Fire! He will NEVER leave us!!!!  Good tip on the fruit chips. I made some pomegranate juice ones to take to work today! On another plus side the thrush is almost gone!  I still havent decided on the shot at home... Would be nice to be home if I am feeling poorly but if I am feeling poorly can I do it myself! Sheesh!!!! Good day everyone!",
      "MessageIndex": 1701,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 6, 2014 10:07AM Mompv wrote: I can't take credit for the photos. My oldest daughters best friend is a photographer. She is on Facebook as Unseen photography. ",
      "MessageIndex": 1973,
      "PostDate": "06/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 11, 2014 01:16PM - edited Jul 11, 2014 01:16PM by Mompv",
      "MessageIndex": 2100,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Sep 17, 2014 08:45AM Mompv wrote: I am glad you all posted about depression. I am having my last DD taxol tomorrow. I feel like I want to cry. I think its because the SE are cumulative and I am dreading the next couple of weeks. I am still in some pain and have numb fingers and feet. Feels like I am walking on balls and my legs feel like dead weights. I already whined on another board and feel guilt about doing it again. I am just exhausted. I tried to work normally and took only treatment day and some 1/2 days off. Looking back that was a mistake, I should have taken more time to rest. So, I am leaving work early today, and am taking at least Monday and Tuesday off next week. Friday I will work for couple hours and thats it!!!! It took me all this time to realize I really needed to take care of myself and not worry so much about work. So, if anyone is lurking out there who is starting chemo soon. TAKE TIME TO REST!!!! Oh and don't be afraid to take any pain meds they give you!",
      "MessageIndex": 2743,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jun 24, 2014 05:40AM Mompv wrote: cold good for you for homeschooling! I did it for 7 years. My DD' s went on to high school and college. My oldest even spent a semester in Spain studying Spanish . My youngest is a senior  in college this year and getting married next summer. They tell me some of their favorite memories are mummifying the chicken and the numerous field trips we were able to take. So many advantages!!!! I have my 2nd AC this Thursday! Head has been tingling but still there! Less stubble on legs though.  Good day to all of you this week! Hang in there all! We can do this!!!! One day at a time!",
      "MessageIndex": 1789,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 6, 2014 07:03AM Mompv wrote: SharonDe  yikes! When it rains it pours!!! I hope the plumber comes today!  Linda505. I love Mexican food too! Take what enjoyment you can and eat the dessert once in a while!!! Your numbers will regulate. Drink lots if water and exercise that brings my DH's numbers down when he over does it!  I made strawberry lemonade! All I can say is yum!  My \"babies\" are 23 and 21. They are both home now. My youngest home from college and my oldest s still looking for a decent apartment. So I have them home for now!!!! Here is a pic of them and also an engagement pic of my youngest!!!  ",
      "MessageIndex": 1971,
      "PostDate": "06/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Mompv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198028/profile",
      "Content": "Jul 11, 2014 06:20AM Mompv wrote: Footballnut I am so glad you are feeling better!  I still have my eyebrows but grow stubble on my head which is now falling out . Legs and armpits still smooth yay!!! I had round 3 of AC yesterday! I asked my MO about my spacey and tiredness I get for 6 days! All I want to do is lay down which is not good at work . I am going in late today so I can nap before a bit. I don't have to worry about bed head though!!!! Just fix my make up and do.... Funny story yesterday. I dad forgotten for the moment I wasn't wearing a host or scarf and answered the door to the UPS guy! Poor thing did a double take! He must have gotten quite the shock!!! I suppose that woke him up!!!! And gave him a story to tell!!! Lol I just don't hope I don't do that at work if the guys need help at work in the parts and accessories store!!! I take if off sometimes in my office to scratch  my stubble! For the icky mouth nurses have told me a few hints: Use arm and hammer with baking soda sensitive brand. Biotine rinses a few times a day. Oh brush your tongue! Use plastic utensils to eat and add a bit if lemon to water ( I heard that here too). Well here is to less SE for everyone I will raise my glass of pomogrante juice to all!!!!!",
      "MessageIndex": 2095,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    }
  ]
}