{
  "AuthorID": "momtoangels…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55683/profile",
  "Posts": [
    {
      "AuthorID": "momtoangels…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55683/profile",
      "Content": "Nov 13, 2007 04:48AM momtoangels wrote: wow, this is soooo interesting a thread.  i am a firm believer in the holistic model of life.  that we are mind, body and spirit and one affects the other.  almost 8 years ago, my darling daughter was hit and killed by a drunk driver.  my husband and i always believe that in that moment our *dna* spirit, heart was deeply impacted and a part of us died that night with her.  2 years later my husband had to testify at an appeals hearing for the man that murdered her.  he (dh) had to stand right next to the killer.  6 weeks later he was in the hospital with acute leukemia fighting for his life (although a part of him wanted to die to be with our daughter, he did survive).  the dr. said acute leukemia comes on suddenly (like within 4-6 weeks before).  he was so close to dying.  he had only 1/4 of his blood left in him when i took him to the emergency room.  i KNOW it is because of the death of our daughter and in the horrible way she was taken from us. we both experienced EXTREME fatigue for those first years and still do not have much energy compared to before we lost her.  however this past year, i actually started to feel better than i had in years.  when my daughter was killed i went into menopause overnight and did not have much support from extended family etc and just could not take care of myself well.  and my husband and i?  well jello cannot hold up jello.  we were both too broken too SICK AND TIRED, to be able to do much at all.  our daughters helped as much as they could, bless their hearts, and we were able to survive and go on for them.  but those first years took its toll. a week before my mammogram, i remember telling my daughters and husband that i actually feel better than i have in years (since the loss of my darling girl).  the next week i went in for a routine mammogram and the rest as they say is history.  i was blown away to say the least.  i always KNEW i would die from a heart attack (broken heart) but NEVER expected breast cancer.  although isn't it interesting that the cancer is located right over my heart.  and isn't it interesting that the onset of breast cancer begins 8 years or more before diagnosis as it is almost 8 years since she was taken from our arms.  there is still a part of me that wants very much to live and stay here with my girls and another part of me that wants to go home to my daughter on the other side and REST.  i still am so tired, mostly because there is no way to just lay down and rest.  the bills must be paid, can't be without ins., so must work full time, and life goes on.  does not matter what circumstances we live with.  the world goes on and sometimes i so very very much just want to get off and rest.  i wish us all peace and comfort this day.  i KNOW our angels are ALWAYS ALL WAYS with us.  and love ALWAYS prevails.  much caring, diana",
      "MessageIndex": 17,
      "PostDate": "13/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694705",
      "Title": "Premonition???? JoyRebecca CapeTownJanine"
    },
    {
      "AuthorID": "momtoangels…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55683/profile",
      "Content": "Nov 13, 2007 04:49AM momtoangels wrote: oh i forgot to add, that over the summer my breast/chest often felt very cold.  and i am a hot blooded person.  very interesting.  and before my husband got leukemia he had problems with itching for years.  it disappeared after leukemia.  ??????????",
      "MessageIndex": 18,
      "PostDate": "13/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694705",
      "Title": "Premonition???? JoyRebecca CapeTownJanine"
    },
    {
      "AuthorID": "momtoangels…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55683/profile",
      "Content": "Oct 26, 2007 05:25PM momtoangels wrote: first of all, thank you all soooooooooo much for your kindness and caring and helpful responses.  it is so good to know i am not alone and/or crazy with all of this.  i did see a oncology radiologist this morning who went over the path report with me.  and the bottom line is that i need either further treatment (ie radiation, etc) or more surgery as the margins are too small to do nothing. i told him that the surgeon told me that my odds of reocurrence for cancer, without radiation etc,  were only 1-2%.  i could tell he was stunned by that.  and he said, that is not true.  he said if you do not have further treatment your odds of reoccurence are at least 30-40%.  i am really angry that the surgeon told me 1-2%.  i also asked him if i had time to make a decision and he said yes, you have a week or two.  i was shocked by that too.  i said but it is dcis and i have already had a lumpectomy that *supposedly* has gotten all the cancer.  and he said with lumptectomy you either need radiation, etc or a clear margin of at least 10mm.  and because i have grade 3, comedo necrosis, it is not safe to wait any longer than absolutely necessary as it could become invasive at any time.  soooooooooooooo............i meet with the oncologist november 7th (still 2 weeks out) and then i guess i will be making a decision asap.  today, i feel more at peace and am so thankful for the internet!!!!  can you imagine having to go through this without any info or feedback??!!  me neither.  thank you all and wishing you hope and peace and angels by your side.  diana",
      "MessageIndex": 6,
      "PostDate": "26/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/694294",
      "Title": "HELP!.......pathology results from lumpectomy momtoangels hopefor30"
    },
    {
      "AuthorID": "momtoangels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55683/profile",
      "Content": "momtoangels wrote: after waiting over a week (and being told it would be no more than 48 hours) i finally got a pathology *report*(if one can call it that!) from my surgeon this morning.  it was about a 30 second conversation in which he said \"your lymph nodes are clear and 3 of the margins are close (at around .1cm/1mm)\".   when i asked him what that meant, he said well, it depends on who you talk too.  and i said i am talking to you.  and he said well its not up to me where you go from here.  it is up to you and your oncologist!  I AM SO MADDDD.  my original decision was to have a mastectomy, as i explained several times to him, that i DO NOT want radiation, hormone therapy, etc etc.  i want to have ONLY surgery if at all possible and be done with this nonsense.  he told me he thought mastectomy was way too radical and that i should have no problem having a lumpectomy for dcis and nothing more.  he also told me that having any addition treatment such as radiation and/or hormone therapy would only decrease my risks of reocurrence by 1-2%, so in his opinion, although it was up to me, he thought a lumpectomy would be more than sufficient so today, he says, it depends on what your oncologist says!!  i have been on the phone much of the day with the hospital, the patient advocate, the American Cancer Society experts, etc etc trying to figure out what to do next. i do not see the oncologist until november 7th.  in the meantime........I WANT TO KNOW WHAT MY PATHOLOGY REPORT IS SAYING!!!  I am going to print just a bit of the report and see if ANYONE here can help me understand ANY of this.  tumor type:  residual extensive and multifocal DCIS, cribiform and comedo carcinoma types. tumor nuclear grade: 3 surgical resection margins:  all ink stained surgical resection margins are microscopically negative for involvement by dcis.  however, tumor foci are very close .1cm from inferior. .1cm from the medial and .1cm from the posterior surgical resection margins. other findings:  the breast shows recent biopsy site changes, including foci of fat necrosis, granulation tissue formation, and variable chronic inflammation. all breast tissues are negative for invasive malignancy.    note from surgeon: margins are close on 3 sides at 1mm.  i conveyed to her that excision margin opinions differ across the country.  thank you for letting me vent and helping me with this in any way you can.  diana Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/694294",
      "Title": "HELP!.......pathology results from lumpectomy momtoangels hopefor30"
    },
    {
      "AuthorID": "momtoangels…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55683/profile",
      "Content": "Oct 23, 2007 05:17PM momtoangels wrote:",
      "MessageIndex": 2,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/694294",
      "Title": "HELP!.......pathology results from lumpectomy momtoangels hopefor30"
    },
    {
      "AuthorID": "momtoangels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55683/profile",
      "Content": "momtoangels wrote: just wanted to post for all new to this *diagnosis*.  and want to let you know this board was a true gift of support and information for me from aug. 07 (dx) to dec. 07 (tx - mastectomy) i was lucky in that i had dcis.  100% curable.  however there are still many decisions to make and much information to be gone through.  without this board, i am sure i would not have been well informed AT ALL! to make a long story short.  i was dx in aug.  had a lumpectomy (and moron of a surgeon) and snb in oct. and single mastectomy in dec.  and i feel GREAT!  (or as great as one can feel in january in the midwest where it is grey gloomy and cold) most with my diagnosis would have probably opted for a couple of lumpectomies and radiation/drugs.  i chose not too and am mostly (i do have moments of *what if*) very at peace with my decision.  the dcis was small, and contained, but multifocal and grade 3, comedonecrosis.  so difficult to get clean margins. and i wanted it over and done with asap so i could go on with my life.  my family and i have been through too much over these past years to have this drag on any longer than absolutely necessary! i guess mostly i want to say, that from the first moment, i opted for mastectomy, was talked into lumpectomy by my 1st surgeon, and ended up with mastectomy, which is right FOR ME.  (but may not be right for you) what amazes me the most is how much easier mastectomy has been to heal from (even with 2 weeks of drains!) than a lumpectomy and how little it affects me to have lost a breast.   i have gone through so much worse,(the loss of my child) so maybe that is why.  and i still have one if i need it and i am sooooo thankful i do not have to do radiation and drug therapy for the next 5 years.  it is over, done, i am cancer free and i am moving forward with my life and very very thankful to put this behind me. (and there are no guarantees for tomorrow so i am worry free too)  again, my deepest gratitude to those of you who gave so much of your love and support during these past months.  may you be blessed many times over.  and may comfort and peace and LOVE surround all here who are just beginning this journey.  remember your angels (on earth and in heaven) are always with you and do not be afraid to ask for help.  hugs, diana Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698323",
      "Title": "1 month after surgery/mastectomy momtoangels Shirlann"
    },
    {
      "AuthorID": "momtoangels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55683/profile",
      "Content": "momtoangels wrote: is point one (.1) cm of margin enough??  just heard back from the nurse this afternoon.  dr. will call on tues.  she said, the 3 lymph nodes (including sentinel) were benign, but the margins were .1 cm and she did not know if that would be enough, so i have to wait to hear back from the dr.  also, my breast is very swollen (like twice the size of the other breast) but really no pain.  is this pretty normal too?  thank you.  diana (dx 8/22/07 with dcis, grades 2-3, comedonecrosis.  lumpectomy and snb done this past monday, oct. 15th) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/694091",
      "Title": ".1 cm clear margin?? momtoangels roseg"
    }
  ]
}