{
  "AuthorID": "momtobkands…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
  "Posts": [
    {
      "AuthorID": "momtobkands…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
      "Content": "Feb 4, 2009 09:57PM momtobkandsd wrote: I started today, the first of 30 planned treatments. Other than being uncomfortable, I felt very vulnerable. The person in charge of giving me the treatment sits at a computer in a cubby in the hall, with a big monitor facing the hall, open for all to see. Mind you, this is a very new, modern facility. On the screen--4 camera views: one from the lobby, one of the entire radiation room, one of the person on the bed, and one a CLOSE UP of the area receiving the treatment. I was so dismayed when I noticed it Monday during my simulation. I was hopeful that the images weren't big enough to see as you walked down the hall. I was wrong. As I walked down the hall when done, I passed another cubby area with its monitor full of images, including a close up of the woman who was at that time receiving treatment. I told the nurse walking me out that I didn't like that, everyone being able to see. She told me, \"Don't worry, Hon, no one came down the hall while you were in there.\" And she turned and went down another hall. I started crying and sat in my car for several minutes crying at the indignity of it.  This center also treats men for prostate cancer. They don't want me seeing that any more than they want to see me lying on the table all exposed. I know not a single one of them would allow that to continue in such a total disregard for privacy if it were them in that situation.   Sometimes I just feel like all the health care professionals act like we should be so damn grateful for the treatments we are receiving that we should not question anything or expect improvements. ",
      "MessageIndex": 45,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "momtobkands…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
      "Content": "Feb 4, 2009 10:12PM momtobkandsd wrote: I had a mastectomy in June 08 but because of the 2 nodes, one of which had become a tumor itself, I was told I needed the radiation. I just finished six months of chemo and had a month off because the rad onc didn't want to start until I had had my port removed, which was on my right side, the same as the mastectomy.  Didn't get tats when went in last week for mold-making and CAT scan for rads planning because that was the first I had heard of needing them. So, they sent me home with a million giant pieces of tape. I was itching like crazy. That decided it...I couldn't stand that for six weeks. So, Monday when I went in for the simulation I said I would get the tats. Of course, when they explained it to me the week before she said five little ones in the middle of my chest and pointed out where. But, once the lady did it Monday, I now have one in the upper center of my left breast, one along my collar bone, a couple along each side and a couple in the middle of my scarred breast in addition to the other five. I love how they give you the full picture.  Sorry I'm adding so much tonight. It is my first time period posting on here, and I fill like it has opened some type of flood gate.    ",
      "MessageIndex": 46,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "momtobkands…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
      "Content": "Feb 4, 2009 10:21PM momtobkandsd wrote: One question, anyone pre-menopausal and having to take Tamaxifen now? My onc told me to start when I finished rads, which didn't make much sense. I would think I should have started taking it right after chemo. Anyone else on hormone therapy already?",
      "MessageIndex": 47,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "momtobkands…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
      "Content": "Feb 25, 2009 08:39PM momtobkandsd wrote: Thanks for the info.",
      "MessageIndex": 417,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "momtobkands…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
      "Content": "Feb 25, 2009 08:46PM momtobkandsd wrote: I had a mastectomy and am getting rads to the chest wall. They are not using a bolus, though, which I had never heard of until I got on here and now I am worried I am not getting the newest, safest rads available.",
      "MessageIndex": 418,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "momtobkands…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
      "Content": "Feb 25, 2009 09:53PM - edited Feb 25, 2009 09:55PM by momtobkandsd I'm jealous of some of you with only 3 teeny tiny tats. The more I read, the more I think my radiation center is a crock, with the giant computer screens showing you close up getting radiated. Also, we have no where to change. You are escorted into the rad room and have to take off your shirt and bra with cameras on you and the tech prepping the bed. You just put your stuff on a chair right inside the door and then walk to the table all vulnerable. I had a mastectomy and this has been very hard on me.  Also, I was told I was only going to get 4 tiny tats, so I said okay. I now have 6 in the center of my chest, one on my collarbone, one on the center of my left breast, and one under my arm on the right (mastectomy) side. They are mole size and dark. The one on my collarbone even has a streak of black running up from it. It made me mad that the tech did not clearly explain what I would end up with. They act like it is no big deal. I am already so disfigured that the obvious black spots just add to the trauma for me. I can't help but wonder where the ones in the center of my chest will end up once reconstruction is done.  Also, on changing, once done, I feel like I have to dress as fast as possible or the next woman is going to walk in on me. She almost has twice because they go get her as soon as the machine stops on me. AND, no one even mentioned a bolus and I just read that in trials women with mastectomies who did not have a bolus used got lung damage 100 percent of the time. When a bolus was used only a fourth of the women got lung damage. I am now mad that my radiation onc. didn't even mention this. ",
      "MessageIndex": 424,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "momtobkands…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
      "Content": "Nov 13, 2009 06:22PM momtobkandsd wrote: Thanks for the responses. I had a mastectomy followed by rads. I had 3 tumors: 1 was in in the upper outer quadrant, but 1 was very near my chest wall in the center and the other was a lymph node that had become an actual tumor. All were small, but from what I understand the 1 near the wall had no extra millimeters to be considered clean. I try not to think about it because there is nothing I can do about it now, but I was still confused by it.",
      "MessageIndex": 88,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743370",
      "Title": "Random Comment Pure momtobkandsd"
    },
    {
      "AuthorID": "momtobkands…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78948/profile",
      "Content": "Nov 11, 2009 10:21PM momtobkandsd wrote: I had a mastectomy, but no bolus. When I learned what one was and asked my rad onc about it, she just dismissed me. Didn't really give me a good answer. Didn't make me too happy, but I only had about 5 treatments out of 27 left at that point. So, I dropped it. The more I read, the more I worry I didn't get very good treatment.",
      "MessageIndex": 78,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743370",
      "Title": "Random Comment Pure momtobkandsd"
    }
  ]
}