{
  "AuthorID": "momx5plus1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135256/profile",
  "Posts": [
    {
      "AuthorID": "momx5plus1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135256/profile",
      "Content": "Oct 21, 2011 05:59PM momx5plus1 wrote: Sassa, thanks for the advice and will do.",
      "MessageIndex": 2,
      "PostDate": "21/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/776728",
      "Title": "Post BMX, ? reconstruction without many options!! momx5plus1 momx5plus1"
    },
    {
      "AuthorID": "momx5plus1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135256/profile",
      "Content": "momx5plus1 wrote: I have been through some ups and downs in a matter of a few weeks and need some advice.  I was scheduled to have a BMX with immediate DEIP on 9/26/11.  Got a call from my plastice surgeon the thursday before my surgery to inform me that my perferator vessels were not adequate to do the DEIP so I had to choose another route for reconstruction or just to the BMX and we could discuss options at a later date.  We discussed Tram flap which he was concerned about core strenght so didn't think it was a good option, TE's which he thought was a good alternative to give us time to discuss what I might want to do post BMX, and GAP flap at a later date.  I chose to have the TE's at such late notice so I wouldn't be flat chested when I left the hospital. So I had surgery on 9/26/11 and everything went well.  Now here's where I need feedback.  I went for my first fill on yesterday 10/18/11.  My PS was just in Korea with other surgeons talking about all the flap procedures and dropped this bomb on me.  The general consensus was that there has been a lot of issues with the GAP flap so he does not recommend this procedure for me anymore.  I do NOT want implants because I want to look natural and have a real problem with a foriegn object in there for the rest of my life.  He stated that we will discuss any other options and that he may even consider TRAM flap for me since my options are limited and he knows I don't want implants.  By the way, I had 400cc's placed at surgery so I am close to where I want to be so I need to be thinking about what my next step will be.  Any feedback would be much appreciated.  Sorry so long!!! Dx 3/7/2011, IDC, Left, 1cm, Stage IIA, Grade 3, ER-/PR-, HER2- (FISH) Chemotherapy 3/24/2011 AC + T (Taxol) Surgery 9/26/2011 Lymph node removal: Left; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 1/25/2012 Reconstruction (left): DIEP flap, Free TRAM flap; Reconstruction (right): DIEP flap, Free TRAM flap Surgery 8/17/2012 Reconstruction (left): Nipple reconstruction; Reconstruction (right): Nipple reconstruction Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/776728",
      "Title": "Post BMX, ? reconstruction without many options!! momx5plus1 momx5plus1"
    }
  ]
}