{
  "AuthorID": "Momy4ever",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
  "Posts": [
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Jan 15, 2017 10:10AM Momy4ever wrote: not yet done the genetic tests, we already applied but still waiting for the insurance approval. I already choose to have a BMX so I was not in a hurry but now afterfinding that I'm Triple negative I will push for it.",
      "MessageIndex": 257,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Jan 15, 2017 09:48AM Momy4ever wrote: Thanks Mom for your reply, unfortunately I'm not living in USA, I'm a resident of Dubai and I'm treated there. I will discuss it with my MO if we can re review my pathology in another place. I will see him on Wednesday to discuss with him about the xeloda or may be more IV chemo round. I will keep you updated I pray for all of us. ",
      "MessageIndex": 255,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Jan 30, 2017 06:38AM Momy4ever wrote: abjclan, wish you all the best in your surgery ... and a speedy recovery SSinUK, thanks for your sweet words. I already spoke with my MO for additional treatment and he will start me on Xeloda as soon as my wounds heel. I had another surgery last week because of an open wound and a necrosis area in my left mastectomy, the PS removed the necrotic part and restitched the skin. They want my wounds to heel before starting me on xeloda and radiation. Also the PS wants to finish the filling of the expander before the start of radiation. Is that the usual procedure, finish the filling before the radiation? I was supposed to start radiation mid February but now i have to heel first and finish the filling I don't think it will be possible. We'll see.",
      "MessageIndex": 275,
      "PostDate": "30/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Jul 26, 2017 02:50AM Momy4ever wrote: Hi Mom of twins, I just finished yesterday my 6th and last Xeloda cycle. Will have pet scan in 2 weeks... so scared but hopefull.",
      "MessageIndex": 342,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Jan 15, 2017 07:48AM Momy4ever wrote: hi ladies, my situation is much more worse than I thought it would be. I have multifocal cancer, the bigger tumor was 6cm, er/pr +, I had 6 rounds of neoadjuvent chemo ACT My follow up with my onc was very promising as we noticed that the tumor shrunk and the underarm node reduced in size. I had my Bmx surgery a week ago. My path report revealed that I still have 11 positive nodes, the tumors did shrunk and had a lot of necrosis, the biggest tumor went from 6 cm to 2 cm. My big shock was that it turned out to be triple negative. i was devastated by the TN news as I was hoping that the hormone therapy will help with the residual cancer but now what chance do I have? I will meet with my onc next week to discuss if I can have more chemo before the radiation. Any advice would be very much appreciated.",
      "MessageIndex": 251,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Jan 15, 2017 08:48AM - edited Jan 15, 2017 08:58AM by Momy4ever Hi Stephilosphy my ER +25 PR +2. I know that itwas low but it made me feel more safe having hormone Therapy",
      "MessageIndex": 253,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Dec 27, 2016 03:51AM Momy4ever wrote: PugsMama & Leftcoastie, I have the same struggle for keeping the nipple, my BS will remove the nipple from the cancer side. And she recommends removing the right one too because I have big saggy boobs. On the other hand my PS suggested to keep the right one ... I can't reach a decision, I think if I will have a prophylactic MX of the right one so it's better not to keep the nipple specially that necrosis could also happens due to the size and the sagging of the breast ... what do you think",
      "MessageIndex": 35,
      "PostDate": "27/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Dec 27, 2016 10:36AM - edited Dec 27, 2016 10:38AM by Momy4ever thanks PugsMama for the advice, I will meet with both my BS and PS on Thursday to discuss this nipple issue again. I think that if one nipple will go then it's better for the other one to go. I'm too looking for a full c cup too :) ",
      "MessageIndex": 39,
      "PostDate": "27/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Dec 29, 2016 11:40PM Momy4ever wrote: For the pet scan I think it depends on your stage, for me I had a pet scan once I was diagnosed because i had positive node. So they ordered a pet scan to check for distance mets. It was done after the biopsy result and before I started the neoadjuvent chemo. I think for early stages they don't do pet scan before the surgery. Me too I will miss my breasts. As much as I want them gone and get rid of cancer \"hopefully\" I keep looking at them and checking them. Poor DH he was so much in love with them :( For the nipple sparing, I won't keep them ... the cancer site one will go so her sister will go with her. I don't want to keep it and be sorry later . I have big saggy boobs so no need to risk necrosis. Has anyone of you decided on the size of her tissue expander to achieve the C size later, mine will be 550 cc, I know that it dépends on each one height, weight, chest measurements. Just curious to know",
      "MessageIndex": 64,
      "PostDate": "29/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Jan 4, 2017 01:22AM Momy4ever wrote: thinking and praying for you ladies ... good luck & I wish you an easy day and good recovery. I'm very anxious too, I try to keep calm and busy with my 3 kids ( 6, 4 and 2 years old). I'm looking forward to the surgery thinking it's another step into this hard journey but the anxiety is kicking so hard.  ",
      "MessageIndex": 194,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Jan 7, 2017 01:01AM Momy4ever wrote: I had my surgery on Thursday, I'm still in the hospital . I still have pain when I move otherwise I feel ok . Yesterday the PS came to check on me, I had a look and it wasn't bad at all, I too have a very small teenager boob :) I can't wait to return home, I miss my kids a lot. Good luck ladies, you will feel relieved when you're done with your surgery.",
      "MessageIndex": 289,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Momy4ever",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237445/profile",
      "Content": "Dec 24, 2016 09:49AM - edited Dec 24, 2016 09:51AM by Momy4ever I will have my BMX with reconstruction on the 5th of January. Finished chemo on the 3rd of December so the surgery will be 5 weeks after my last chemo. It seems long time for me as I really want my boobs gone ... it is scary but I'm really looking forward to the surgery. Good luck to you all & happy holidays ",
      "MessageIndex": 20,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}