{
  "AuthorID": "Monica1971",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134119/profile",
  "Posts": [
    {
      "AuthorID": "Monica1971",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134119/profile",
      "Content": "Aug 12, 2011 09:18PM Monica1971 wrote: Hi ladies.  Can I join your group? I just had surgery on Wednesday (August 10). I was diagnosed 2 weeks ago with IDC.  I found a lump back in February and my doctor said it was probably nothing (had a clear mammogram in December)  He finally sent me for a mammogram in July which was also clear, had an ultrasound right away, then biopsy, which confirmed the cancer. I've been told it was a 2.2cm Grade 2 tumor.  Had lumpectomy and SNB which was positive, and should have full results on Monday. I'm terrified but trying to stay positive.  I've read your stories, and am so sorry for all you are going through.  My family and friends have been amazing, but I find it helpful talking to others who are going through similar experiences.  Thanks so much and hope you are all doing ok.",
      "MessageIndex": 146,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Monica1971",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134119/profile",
      "Content": "Monica1971 wrote: I had a bone scan this morning and saw the images - of course I'm not a doctor and shouldn't even attempt to read the results but the full body scan looked somewhat normal, but they did a seperate scan of just the ribs - and the right and left side looked different.  Any chance radiation could cause the affected side to look darker in spots than the other?  I just had a PET scan last week that was normal but have CT and Bone Scans as part of the Denosumaub Trial I'm on.  Does anyone know?  Thanks!! Dx 7/27/2011, IDC, 2cm, Stage IIB, Grade 2, 1/20 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/792161",
      "Title": "Waiting for Bone Scan Results - in a panic!! Monica1971 thefuzzylemon"
    },
    {
      "AuthorID": "Monica1971",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134119/profile",
      "Content": "Aug 17, 2012 07:59PM Monica1971 wrote: Okay thanks so much!  I'll try to relax and enjoy the weekend! :)",
      "MessageIndex": 2,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/792161",
      "Title": "Waiting for Bone Scan Results - in a panic!! Monica1971 thefuzzylemon"
    }
  ]
}