{
  "AuthorID": "montana7p",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79879/profile",
  "Posts": [
    {
      "AuthorID": "montana7p",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79879/profile",
      "Content": "Aug 2, 2010 08:30PM - edited Aug 2, 2010 08:31PM by montana7p Hi Amy - I don't have any good insight -- but thought I'd let you know you're not alone.  I had a BMX, expanders/implants, axillary dissection on the R, radiation on the R.  About 7 months after finishing chemo, 6 months after surgery and 4 months after radiation, I started getting numbness in my index finger and thumb on my right hand.  It has progressively gotten worse to where the tips of my middle ring and pinky are also numb.  I'm having trouble doing certain things with my RH (picking up small things, typing, putting on a necklace, opening jars, etc.).  I mention it to oncology type doctors and I get mostly nothing more than a hmmmm (they're so concerned about your boobs looking good - which mine do I have to say, but I actually USE my right hand on a daily basis).  I did get a prescription for physical therapy and two therapists and one of my oncologists has diagnosed it as carpel tunnel.  Did I mention I've worked less than I ever have in the past year and a half and actually had three months off from working in the past 5 months.  Why on earth would it be carpal tunnel? I'm inclined to think it's something related to surgery or radiation -- scar tissue impinging on something, radiation damage, shoulder shifting from tightness from surgery and impinging on a nerve.  I'm making all of this up, but carpal tunnel just doesn't make sense to me.  I'd be interested in knowing if you get anywhere.  The numbness in my fingers is really annoying.",
      "MessageIndex": 4,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/755840",
      "Title": "forearm and hand numbness 9 mos out! amym159 amym159"
    },
    {
      "AuthorID": "montana7p",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79879/profile",
      "Content": "Jul 13, 2009 11:24PM montana7p wrote: My last of 6 TAC chemo was May 5. My eyebrows are growing in nicely and I have baby eyelashes again. Hair on top is definitely regrowing (but not enough that I'd take off my scarf yet -- that seems a ways off), but there are these crazy white hairs all over the place and it's such a dark looking color. ",
      "MessageIndex": 2798,
      "PostDate": "13/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "montana7p",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79879/profile",
      "Content": "Jul 13, 2009 09:50PM montana7p wrote: OK. So I should probably go back and read the rest of this thread, but don't have the energy right now. But, what's the deal with the crazy white hairs? I just turned forty and had dark blonde/light brown hair with golden highlights and now it looks like fuzzy salt and pepper? Is this really my new hair destiny?",
      "MessageIndex": 2796,
      "PostDate": "13/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "montana7p",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79879/profile",
      "Content": "May 19, 2010 03:41PM montana7p wrote: Clariceak — I have no close relatives (a maternal great aunt who had BC post-menopausally is closest) and I was tested and don't carry the BRAC genes.  I had babies in my mid-thirties (33 and 36) which seem to be the biggest risk factors. It really hit me out of nowhere. Fast growing tumor and I didn't even consider BC at first because I'm young with no history and it wasn't a lump at first. ",
      "MessageIndex": 12,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752785",
      "Title": "Hello, Goodby, Ovaries montana7p Pure"
    },
    {
      "AuthorID": "montana7p",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79879/profile",
      "Content": "montana7p wrote: I have been lurking on this website for the past year and a half.  I am a year out from chemo and am now dealing with both fear of recurrence as well as the decision about ovarian suppression. I know there is a hormonal therapy thread, but I thought I'd post this here since it seems that the recommendation for supression is based on the aggressive nature and staging of my diagnosis. I am 40 years old and had been in chemopause for the past year, but my FSH levels have been declining for the past 3-6 months and at the end of April I had my first period. My skin looks good and I've been feeling like maybe I could shed the disgusting fat around my belly.  I actually desired to have sex for the first time in over a year which was fabulous. BUT...I had the dreaded ovary discussion with my oncologist today about suppression which he recommends. I am so sad about it.  I know I should do everything possible to prevent recurrance. Is this a clear-cut choice for me? Any words of wisdom from those having been in the same boat are appreciated. Dx 1/5/2009, IDC, 4cm, Stage IIIB, Grade 3, 3/5 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752785",
      "Title": "Hello, Goodby, Ovaries montana7p Pure"
    },
    {
      "AuthorID": "montana7p",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79879/profile",
      "Content": "May 18, 2010 10:14PM montana7p wrote: Actually, I think my intra-mammary and node in my pec wall make me IIIc?  I had neoadjuvant chemo which shrivelled my nodes and they never got an acccurate count. But I'd love to be IIIa.",
      "MessageIndex": 4,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/752785",
      "Title": "Hello, Goodby, Ovaries montana7p Pure"
    },
    {
      "AuthorID": "montana7p",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79879/profile",
      "Content": "Sep 13, 2009 06:54PM montana7p wrote: Hi Bluebird71 - I finished 32 rads on Aug. 27.  My skin was super red, itchy, blistering under my arm, peeling -- exactly as you describe. My radiation oncologist perscribed the domeboro soak 3-4 x per day and then either using aquaphor or 100% hydrous lanolin (very gooey and sticky) as the only other topical treatments 2-3x/day. In retrospect, I think what makes it heal is a little bit of time. I'd say I was pretty uncomfortable for about two weeks. Now, on Sept. 13, I am happy to report that the only way I'd know is from the suntan outline. My radiation oncologist offered vidocin for sleeping and if it was really bothering me during the day. I took it on and off for about a week. So, hang in there while you're all red. Mine really started to turn the corner about a week after the rads were finished and healed pretty quickly after that. You can do it!",
      "MessageIndex": 17,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736027",
      "Title": "Severe radiation burns to the breast RCindy"
    }
  ]
}