{
  "AuthorID": "montazhnik",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
  "Posts": [
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Feb 20, 2008 12:48PM montazhnik wrote: Hi everyone, I thought I'd share some things that are really helping me: 1. Fudgsicles! soft, cold, and bland but tasty, but not too rich or acidic.  and you get some calories too. 2. I've also had problems drinking water (doesn't taste good and makes me nauseous going down) so I've been making big pitchers of herbal tea--specifically, a combination of hibiscus, rose hip and ginger.  I let it cool to room temperature and drink it like water or juice. Just don't let the bright red color freak you out . 3. I would also like to throw in here that I have, yes, been smoking a little bit of marijuana (obtained from a friend in Oregon who is stage IV ovarian and has a medical marijuana card) and it REALLY does help.  If anyone has any questions about this I'll be glad to share. my next treatment is Feb. 26.",
      "MessageIndex": 211,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Mar 4, 2008 12:55AM montazhnik wrote: Nolana-- about massage--I had a lumpectomy w/ axillary node dissection, and was \"lucky\" to be one of the more or less 6% of patients to develop what is called \"axillary webbing syndrome\" as a result of the surgery (there are some postings in other threads on this--it's where you develop tight cords down your arm and can't straighten it--very painful, but it eventually resolves with time).  That's why I decided to go for massage--my arm was so painful that I was favoring it and causing a lot of neck, shoulder, and back pain because of the stress.  My advice: --Find someone if you can who is also a licensed physical therapist.  They need to know something about rehabilitative care, and how the muscles and nerves etc. are affected by this kind of surgery.  Also it helps because PTs know how to do things to manipulate muscles etc. without doing a lot of deep tissue work.  Deep tissue work sometimes causes soreness afterwards, and that is NOT what you need right now, what with recovering from surgery plus all the chemo side effects. --My massage therapist has mostly been working on my neck and shoulders, plus doing some lympatic work (all prophylactic--so far so good with no lymphedema!), and other trouble spots as they come up.  For some reason my ribs were all out of whack after the surgery, and he eased them back into place. --even if you can't find someone that can do all of this specialized stuff, my advice is to again make sure not to do any intense deep tissue work, and focus more on an overall gentle healing massage.  Also if the therapist isn't familiar with lympatic work, to leave the arm more or less alone, or at least be very gentle with it, that is if you have had axillary node dissection.  Again, I can't stress how helpful this has been to me. Unrelated--man, I sure wish I would get lucky and the hair on my legs would fall out too!  Oh well. Laura ",
      "MessageIndex": 302,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Feb 19, 2008 10:35PM montazhnik wrote: Hi wetcoast! I'm doing dose dense a/c, which means 4 treatments, once every two weeks. With a shot of Neulasta one day after each treatment. I\"m also on Lupron, which is supposedly protecting my ovaries by putting me artificially into menopause during the chemo.  But we'll see if it helps--I'll be 39 next week (the day after my next treatment) so who knows if my periods will come back or not. I guess I should ask my oncologist if the Neulasta is causing the neck soreness. And you know, I've been reading so many postings on this site, and so many women are having such a hard time with the chemo, and I'm realizing that what I'm experiencing seems to be within the range of responses that so many of us are having, and that I need not be so scared, and just to go with it.  And to keep it in perspective... After my first treatment, I asked for an anti-nausea drug that would  be in addition to what I was given throught the IV during treatment, and was given the three-pill thing (Emend).  Other than that, I've been getting by with no other sleep aids or pain relievers except for some Advil when the neck thing was bothering me.  So I guess that's pretty good!  Although I have to say I was glad to see that some people take Hydrocodone or others, I didn't know if that was ok, and I have some left after my surgery (lumpectomy and axillary node dissection).  Good to know I can fall back on it if I need to.",
      "MessageIndex": 203,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Feb 20, 2008 01:07PM montazhnik wrote: hi nobleanna, I forgot to mention also that my onc. said that headaches can be caused by the anti nausea drug that is given through the IV during treatment (unfortunately I forget what the one they gave me is called).  She suggested Benadryl (?) to help with the headaches.  But taking a pain reliever preemptively sounds like a good idea. I know you are frustrated about a possible delay but believe me, it's really important to go into this without any pain or infections anywhere.  Try to focus on that, also on how much more comfortable you'll be (i know it's all relative) going into it as healthy as you can be.   I also am spending lots of time in the recliner.  My mother bought it for herself when she broke her upper arm last year and couldn't sleep lying down.  Much of her life revolved around that recliner for many months, as it was a very bad break.  In a very humorous and ceremonial moment, she ceded the holy chair to me.  Laura ",
      "MessageIndex": 212,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Mar 2, 2008 08:05PM montazhnik wrote: Hello ladies, I'm finally back after having my third A/C treatment last Tuesday.  Been sticking close to home, reading, watching lots of movies, etc.  Only one more to go!   Here are some of my observations from this round, in the hopes that they may be of use to someone-- 1.  I had mentioned earlier that my Onc recommended Benadryl for headaches related to Cytoxan.  I now can confirmthat it really helps.  During treatment, I had a new nurse who failed to give me my dose of benadryl (claimed that she didn't give it because it was only on order on as \"as needed\" basis).  I only knew to ask for it when the cytoxin started dripping in and an excrutiating headache came on.  I got kind of testy with her and told her \"how can I keep all these drugs straight, plus I'm feeling poorly and nervous anyway, it's your responsibility to tell me what my options are, and how can I know to ask if you don't tell me etc.\"  She gave it to me right away and the headache subsided.  Moral: DON\"T WAIT for help, know what you are entitled to and ask BEFORE the pain comes on. 2. I really believe that the hair loss thing is the hardest part.  Treatment #3 has been somewhat easier than #2 simply because I've already gotten the head shaving trauma out of the way.   3. Massage is really helping me.  I've been going on day 2 after treatment, which is the day I feel the worst.  If you can make yourself go (get someone to drive you), once you are on the table and being pampered in that way, makes you temporarily at least escape the yucky space of chemo side effects. And I feel very strongly about the power of human touch. Still in bed right now, but made it out this morning, for coffee with my brothers.  A small victory for me.  I'm also lucky to be on leave from work right now.  My deepest admiration for all of you who have the wherewithal and strength to be going to work through all of this!   Laura ",
      "MessageIndex": 289,
      "PostDate": "02/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Feb 19, 2008 04:52PM montazhnik wrote: Hi, I'd like to join you as I'm halfway through dd a/c with Neulasta shot one day after each treatment--started on 1/29, and have two more to go.  The second treatment was harder than the first so I realized I can't do this alone. I guess I just need a reality check so I'm going to describe some symptoms to see if it's all within the range of \"normal.\" --really sore neck muscles, front and back.  Comes on two days after treatment.  1st treatment it lasted one day, 2nd treatment lasted two days.  What is this?  REALLY sore.  --hair started falling out 15 days after first treatment, and what was unexpected was the intense scalp sensitivity and pain.  I finally freaked out completely and shaved my head, felt I just had to get the hair off or I would go crazy.   -- after first treatment felt really awful but bounced back more or less after four days.  Now it is the 7th day after the 2nd treatment and I am still weak, lightheaded, and in bed.  Is it cumulative?  Is it harder to bounce back after each progressive treatment?  If I\"m still feeling so weak how am I going to be able to handle another one? I really don't know if I can do this.   ",
      "MessageIndex": 198,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Mar 11, 2008 12:37AM montazhnik wrote: I'm in bed, all ready for tomorrow, my fourth (and last!!!) A/C treatment.  I'm nervous and a little nauseous already... Is there anyone else out there who is also doing only A/C?  I'm trying to figure out or recall why I have the good luck not to be doing taxol or herceptin next...will ask the doctor tomorrow Laura ",
      "MessageIndex": 390,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Feb 23, 2008 12:45AM montazhnik wrote: Hello everyone, I'm in such a terrible mood, yelled at a waitress yesterday (have never done this in my life!), yelled at my mother, yelled at my brother, now am holed up in my bedroom with the laptop.  I am really anxious about my next treatment (TUesday),am so scared that my body isn't strong enough to take another round and that I'll end up in the hospital...and the Neulasta kicked in today, and my bones feel like they are being stretched... What is this treatment doing to my moods, and where is my faith?  Where is my strength?<>  Thanks for listening, just need to vent a little... Laura ",
      "MessageIndex": 240,
      "PostDate": "23/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "montazhnik",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63320/profile",
      "Content": "Mar 9, 2008 01:32PM montazhnik wrote: Hi everyone, I'll introduce myself too. I just turned 39 last week, I'm divorced with a 9 yr old daughter.  We live in St. Petersburg, Russia, where I work for a U.S. liberal arts college that has a joint degree program with one of the Russian universities there.  When I was diagnosed, decided to come back to the U.S. for treatment (didn't want to risk it there), and am temporarily living with my mother in Seattle for the duration.  Luckily my employer (located in New York)is being FANTASTIC, has kept me on the payroll although reducing my hours, so I can keep my benefits.  I'm doing what I can on email, etc. but no one is really checking up on me in that respect, they're just waiting for me to get better so we can get back to work in Russia when all this is over.  That's my goal. Made the decision for my daughter to spend the rest of the school year with her father, who lives three hours away.  Hard for me emotionally, although easier physically, of course.  She's been coming up on weekends.  Hard for her too, having to change schools mid-year and dealing with the effects of this, but what can you do... Anyway I'm so lucky that I have a big extended family here who is taking care of me, and a patient and supportive employer...I just want to get back to my life.   It's really great to read about all of you.  I'm glad to have found this group! Laura ",
      "MessageIndex": 374,
      "PostDate": "09/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    }
  ]
}