{
  "AuthorID": "moodyk13",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
  "Posts": [
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Nov 13, 2008 08:46PM moodyk13 wrote: I had bi-lat mastectomy w/expanders in feb.  I was there from wed. to sat.  my ps tried to tell me i was going home next day and i said \"the h*^l you say!\" he let me stay till saturday. But i was ready to go back to work in 2 weeks.  I would have, but I had to start chemo so figured it wasnt worth it. Best advice i can give you is GET UP AND WALK ASAP after surgery.  it will HURT like heck, but you will heal much faster.  I was back in my room day of surgery by 6pm and by 7am next morning i was walking the halls. every two hours i would go walk.  so while i stayed till saturday, i was pretty mobile by time i got home. also w/regards to the healing aspect, i was to have drains for 2 weeks, i got them out 2 days after i got home!  dr. said never had someone heal so fast. Good luck, and let us know what happens!",
      "MessageIndex": 15,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Oct 30, 2008 03:18PM moodyk13 wrote: Hi easyquits, It has been my experience that bad news comes fast.  I live in the Atlanta suburbs and it seems to be, in this area anyway, that a call in the first 24 hours is bad news, and good news is slow to come. My mom worked for a breast cancer specialist for many years and said that when a surgeon is almost certain it is cancer, he will get the lab to return the results right away.  I had a lumpectomy rather than a biopsy and the surgeon told my mom he would call the next day by 4pm.  Her heart sank because she knew then that he was pretty certain that it was cancer.  It was. But as the others have said, everywhere is different and the wait is horrible whether it is hours or days.  I pray you get an \"all clear\" report!  I wouldn't wish breast cancer on my worst enemy!",
      "MessageIndex": 4,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723625",
      "Title": "Just wondering if my wait will really be that long lexio lvtwoqlt"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Oct 30, 2008 07:13PM moodyk13 wrote: DCIS is Ductal Carcinoma In Situ.  It is cancer that is all bottled up nice and tight and not going anywhere......at least for a while. Some call it \"pre cancer\".  Typically it only requires either monitoring or removal.  I had 2 clusters of micro-calcifications- one was Invasive Ductal Carcinoma, the other DCIS.  I had Bi-lateral mastectomy, 4 rounds of chemo and am doing one year of Herceptin.  I have had a liver scan and a bone scan and a colonoscopy all which were fine back in Feb.  Now I am having another bone scan next Thursday.  One thing I have learned with cancer, if you sneeze more than twice, you get scanned! I have horrible thoracic spine and cervical pain, so doc wants a follow-up scan to compare make sure nothing creeping up- I think it is the Herceptin.",
      "MessageIndex": 5,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723660",
      "Title": "Please help, just joined LB2008 Dukemom2"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Oct 30, 2008 06:31PM moodyk13 wrote: Hi LB2008, Sorry you are here but I guess we all are sorry to be here.  Last January I got a call 3 days after my yearly mammo saying that I had \"calcifications\".  I too was told 80% were not cancerous so I didnt worry one bit.  In fact I only told my mom and hubby. Two days later I was in the surgeons office and 3 days later was told I had cancer.  The reason I am telling you this, is I found that when the radiologist is fairly certain it is cancer, they move VERY FAST.  They send you straight to the surgeon, not to a follow-up mammo.  Since you are having to wait, I would say that is a GOOD sign! Radiologists look at so many of these things, they are pretty darn good and recognizing cancerous ones.  That is not to say you have nothing to worry about, I just want you to take a deep breath and hold on to the 80% are benign. If it is DCIS then all you would have to do is have it cut out and possibly mammo's every 6 months.  All doctors are different and all treatments are different, I can only share with you my story and try to offer you a little peace. Good luck to you and keep us posted!",
      "MessageIndex": 2,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723660",
      "Title": "Please help, just joined LB2008 Dukemom2"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 13, 2008 10:13PM - edited Dec 13, 2008 10:15PM by moodyk13 I always tell people \"I never felt like I had cancer except during chemo!\"  And like you, I never felt \"sick\" except during chemo.  Other than that, I carry on life as normal.  I told my onc the other day \"When I first came to see you, I had long blonde hair, weighed 115 lbs and was a full C cup!  NOW I have 2\" short dark brown hair, weigh 125 and have no boobs!\" But actually I now have a nice set of DD's cause I had my reconstruction revision done Wednesday!    And I lost some weight due to being knocked out for 2 days and not eating! But still have 2\" short dark brown hair! ",
      "MessageIndex": 41,
      "PostDate": "13/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725761",
      "Title": "Do you consider yourself sick? shockedat39 kmccraw423"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 25, 2008 09:46PM moodyk13 wrote: car how did your second recon go?  I too had to have mine redone because of capsular contracture on cancer side.  I had my first exchange sept 25th and revision for both sides on 12/10.  So far I am very very pleased.  My left side is MUCH better, it is still just a teeny, tiny bit higher, but I am the only one who notices it and only when I am naked.  In clothing all looks good. But I am afraid it can encapsulate later, so that is why I was wondering how your 2nd time was.  Thanks! Carolynn  I wouldnt let them rush you into any surgery until you have had a chance to get 2nd opinion (if you want- I didnt need one but others do) and have time to decide what you want to do regarding reconstruction.  It is better the less number of times you are put to sleep.  And like you said, it's been there 5 months, what is another week to 10 days giving you some time.  Good luck!!",
      "MessageIndex": 10,
      "PostDate": "25/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726252",
      "Title": "Just Diagnosed with Cancer Carolyn2008 Carolyn2008"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Feb 19, 2009 09:49PM moodyk13 wrote: LuAnn, that is just the best news I have heard today!  Woo Hoo for you and your family.  Thanks for posting this update!! ",
      "MessageIndex": 29,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729384",
      "Title": "Got Excellent News Today!!!! LuAnnH Calico"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 2, 2009 10:54AM moodyk13 wrote: Carolyn, more than likely your hives are caused by your nerves.  I use to \"break out\" in hives when ever I was real nervous.  In fact, I had to by a wedding dress that had a neck to it, because I knew I would have hives and didnt want them in my pictures. The worst part was, my parents always knew when I was lying because I ALWAYS got hives while I was doing it!!  LOL Fortunately, I stopped doing this after my first child was born, up unitl I found out I had cancer.  I have had them once during this ordeal but that was all. Hopefully yours are nerves too.",
      "MessageIndex": 22,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726252",
      "Title": "Just Diagnosed with Cancer Carolyn2008 Carolyn2008"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 1, 2009 05:21PM moodyk13 wrote: Carolyn2008 I am glad you are able to \"slow down\" and get more opinions.  You will feel much better when you know you have a surgery team you can count on.  When do you see the new docs? Yes, we have all been there or are there now.  it is helpful to be able to communicate with those who \"get it\".",
      "MessageIndex": 15,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726252",
      "Title": "Just Diagnosed with Cancer Carolyn2008 Carolyn2008"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Nov 5, 2008 01:15PM - edited Nov 5, 2008 01:16PM by moodyk13 i didnt ask for it, my onco had it at my initial consultation.  he presented me with a \"chart\" of my prognositic percentages and he had written on it \"oncotype dx\".  i asked my surgeon and he said the oncotype dx was their standard testing procedure.  i had nevcer heard of adjuvant until this site. but like i said, mine showed percentage not \"score\" since my percentage was 75% at that point but could be 92% with chemo/herceptin- that is what a chose. I was just curious if anyone knew how the \"score\" was calculated.  doenst really matter as far as decisions go cuz i did chemo mar - apr and am on herceptin til next april.  i was just curious ",
      "MessageIndex": 6,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "moodyk13 wrote: I keep reading about peoples oncotypeDX score.  My onco didnt give me a score, he gave me a percentage.  After surgery and no other treatment I had  75% survival/25% recurrence.  And after my treatment options I could lower to 92% survival/8% recurrence. How do I know what my oncotypeDX score is?  Thanks! I don't care if my cup is half empty or half full; I am just thankful I have a cup! Dx 2/1/2008, IDC, 1cm, Stage IB, Grade 2, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 23, 2008 04:00PM moodyk13 wrote: Harveysjule, it is a bad dream and I wish I could wake you up from it, but I am still waiting for someone to wake me up!!!! You will be terrified and that is okay.  It is normal to be afraid, so be afraid.  BUT don't let fear interefere with your life and your decision making.  Listen very close to ALL your options that your onc will give you.  Don't make any choices tomorrow about what you want to do, give it some time.  I thought I knew exactly what I was gonna chosse when I was in his office my first time, and I ended up changing my mind.  I found out I had a score of 36.  I did chemo, I did 9/18 Herceptin and I chose not to do the hormone therapy.  BUT I can change my mind about Herceptin and hormone therapy at any time.  I finished my last chemo 4/28/08.  I am still scared about the choices I am making.  I beleive that most of us will live with some sort of \"fear\"-----even if it is tucked away back in the very back of our brains------for the rest of our lives. But just know, no matter how scared you are, you will make it through.  It will suck and you will go through emotions you never thought you would EVER have, but you will get through it.  I still get angry when I look in the mirror and see a total stranger, but I get through it.  I dont let it control who I am, I dont even let it become a part of who I am.   I am working for the day that I look how I used to (my avatar) and I am thankful for everyday that I am in remission.  And I am thankful that we have these drugs available to fight this disease with.  Even if they don't work, they are the only choice we have, so you suffer through it.  Just remember, no matter how hard it is on you, it is 3 times harder on your caregivers!!!  They are completely helpless and it really weighs on their minds!!!!",
      "MessageIndex": 37,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 27, 2008 10:23PM moodyk13 wrote: artsee, thx, I posted your %.  I have heard some women say their docs told them chemo did cut recur in half, my doc said it would reduce it be 10%.  I guess it all depends on tumor characteristics. Thx apfuentes, the \"20%\" is what I needed!  You are a georgeous young lady!  Keep us posted on how you are doing on chemo.  I see you have just started it. mattscot, thanks for sharing your info with us.  All these things certainly help for us to see all these different \"stats\", but what amazes me is just how different we all are.  It amazes me science has come as far as it has with all the treatments!  I def would have expected your score to be higher b/c of HER2+.  I am glad you are doing chemo, although I certainly wish you didnt have to! Manydy1313, welcome to the thread.  Chemo sucks, but at least we have it!!!  How many treatments do you have to do? Renrel, welcome to you also, although I wish none of us had ever met!  But, at least we have each other to lean on and no one has to go through this alone!  I am thinking your onco score is prob higher with a 25 - 30 % recur rate w/o tx.  Mine was 36 with a 25% recur with surgery only.  I know trying to make all these decisions is so hard, but my onco gave me the best advice I have ever gotten.  He told me \"no matter what you decide to do, it is the RIGHT decision!\"  Him saying this to me seemed to take the pressure off.  I did 4 DD A/C chemo and am half-way finished with Herceptin.  Side effects from chemo are the pits, but they will give you really good drugs to ease them.  And you will get through it.  For me, the mental \"after effects\" have been WAY worse than any of the \"physical effects\" during treatment. Hey Jacq, thanks for filling is more info for us, I got you added!!!  Nice to meet you, sorry your here too!  Funny, even as I am typing this post, I STILL can't believe I am here!!!! Seabee, gonna re-try the link in just a minute.  Thanks!!! Snowbird, welcome to you also, and also sorry you are here too!  Your onco score does stink as far as being in the \"gray\" rather than more definate.  I will be praying for you on Monday!  If you can, take people with you.  That first treatment is a little, no, a LOT terrifying, but having people to talk to will help keep your mind off it. Harveysjule, I havent started the new thread yet, but I am going to as soon as I finish this post.  I am going to copy & past the stats we have collected so far and call it the \"Onco type roll call\".  Guess I will put under \"chemo before, during, after\" category. if you can't find it, just click on my ID here and you will see my posts, and there you will find it.  If you have probs you can PM me too.  Too all of you getting ready to start chemo, if you haven't I would recommend getting a port!  I didnt get mine until my 4th A/C tx (only because I still had 18 Herceps coming up), because chemo will EAT YOUR VEINS up!!!  I have hard brown veins all in my right arm and everytime I have to be put to sleep (all the reconstructions) they cant use your port, they need GOOD veins in your arm.  Now it is hard to get an IV started in my arm! ",
      "MessageIndex": 68,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 28, 2008 10:49PM moodyk13 wrote: Here were the 2: 1st w/o tamoxifen: Age:  42 Tumor Diameter (cm):  1.3 # of Positive Nodes: 0   ER Status:   Positive  PR Status:  Positive HER2 Status:   Positive Histological Type:  Ductal Grade:  2 - Moderately diff. Hormonal therapy:  None Chemo-therapy:  CMF-like Anthracyclines 1st gen. regimens:   CA*4   Reduction in death: 0.3      Cancer Death Rate 15-year Kaplan-Meier Cancer Death Rate: 14.7%   Impact on Life Expectancy • The adjuvant therapy selected may be expected to extend that expectancy by 2.2 years, or 798 days. 2nd is w/o tamoxifen: Age: 42 Tumor Diameter (cm):  1.3 # of Positive Nodes: 0 ER Status:  Positive  PR Status:   Positive  HER2 Status:   Positive Histological Type:   Ductal Grade:   2 - Moderately diff. Hormonal therapy:   Tamoxifen Chemo-therapy:   CMF-like Anthracyclines 1st gen. regimens:   CA*4  Reduction in death: 0.524     Cancer Death Rate 15-year Kaplan-Meier Cancer Death Rate: 14.7%   Impact on Life Expectancy • The adjuvant therapy selected may be expected to extend that expectancy by 3.8 years, or 1399 days. So hormonal therapy expected to add 1.6 years to my life-  So I'd have to take hormonal therapy for 5 years just to \"add\" 1.6 years to my life expectancy.......",
      "MessageIndex": 76,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 29, 2008 02:29PM moodyk13 wrote: Seabee for me, it has nothing to do with the \"action\" of taking a pill.  I have a pill I have to take everyday and will have to take for the rest of my life.  It is the side effects from Tamoxifen that keep me from taking it. To \"put\" myself into menopause unnaturally involves a lot more than hot flashes.  Weight gain, depression, loss of libido, fatigue, and increase risk of endometrial cancer are the main reasons I have chosen not to take Tamoxifen.  I have a \"pre-disposition\" already for each of these.  I have Hypometabolism due to an CNS disorder (this is why I take a pill every day) so I would balloon out weight wise no doubt, for 9 years I was treated for clinical depression where I had to take anti-depressants every day---thank God, this imbalance corrected itself about 7 years ago and I was able to go off all meds, & my grandmother had endometrial cancer so my risk for this is already elevated.  My onco agreed that for me, my risks far out weighed any potential benefit. In addition, my quality of life for the next 5 years is more important to me than adding 1.6 - 2.7 years to my life expectancy.  I'll happily sacrifice 1.6 - 2.7 years of life to avoid 5 years of misery. And I believe I am mean enough to easily live to be 100.  I have told my hubby, I'm gonna out live him just to piss him off! ",
      "MessageIndex": 78,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 30, 2008 07:45AM moodyk13 wrote: otter, you are correct in your definitions.  Everyone is exactly as you have said. Snow, the easiest are the first 2 days because they give you steroids w/ treatment which make SE's not as bad and med's more effective.  it is days 3-7 that were the worst for me.  By the 3rd tx is was days 3-10.  But the last 3 to 4 days before the next treatment, I would feel GREAT!",
      "MessageIndex": 85,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 2, 2009 11:25PM moodyk13 wrote: Harveysjule, i knew you could do it!!!  You should sleep alot and not bee too bad today or tomorrow as I am sure they gave you steriods too.  it is day 3-7 that sorts sucks.  and just wait till everything you loved to eat tastes horrible! ",
      "MessageIndex": 98,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 3, 2009 09:28PM moodyk13 wrote:",
      "MessageIndex": 100,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 5, 2009 10:49PM moodyk13 wrote:",
      "MessageIndex": 108,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 7, 2009 11:25AM moodyk13 wrote:",
      "MessageIndex": 111,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 7, 2009 11:27AM moodyk13 wrote: otter,  sooooo glad ur back!!!!  I hope you had a great vacation, but seeeeeee  we NEEEDED your brains on this stuff!!!  Wooo Hooo your back!!  My screen is fine though, it doesnt drag off the side.  Maybe you need to clear your cache",
      "MessageIndex": 112,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "moodyk13 wrote: I keep reading about peoples oncotypeDX score.  My onco didnt give me a score, he gave me a percentage.  After surgery and no other treatment I had  75% survival/25% recurrence.  And after my treatment options I could lower to 92% survival/8% recurrence. How do I know what my oncotypeDX score is?  Thanks! I don't care if my cup is half empty or half full; I am just thankful I have a cup! Dx 2/1/2008, IDC, 1cm, Stage IB, Grade 2, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Oct 31, 2008 03:08PM moodyk13 wrote: He gave me a sheet, but it shows recurrence rates with various therapies but it doesnt have a \"score\" on it just survival/recurrence %",
      "MessageIndex": 2,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 26, 2008 06:04PM - edited Dec 28, 2008 03:50AM by moodyk13 Okay, here are the \"NEW\", updated Oncotype DX Scores update;  (thanks to all for contributing, as I believe it helps \"newbies\", so if you are reading and have not contributed your score/percentage of recurrence, please post so I can add to our list) So here is data so far: 5% =  9 score (IllinoisNancy) 8% = 13 score (renrel) 10% = 16 score (Seabee, mattscot, & mandy1313) 11% = 18 score (jacq) 12% = 19 score (kamico3 & lisasayers) 13% = 20 score (hopefullady) 13% = 21 score (paras) 17% = 26 score (otter, auriga, & Snowbird) 18% = 27 score (kirsten33 & 2tzus) 20% =  30 score (apfuentes) 25% = 33 score (busqueen) 27%  = 35 score (artse) 25% = 36 score (moodyk13) 29% = 42 score (Harveysjule) 30% = 44 score (TPPJ) ??? = 47 score (talbrig13 recur percent%?) 34% = 51 score (LindaBusEd) Harveysjule  I was a little surprise at how high yours is with you being Her2/neu neg.  I was Her2/neu ++ , ER 90%, PR 40% 1.3cm grade 2 stage 1.  We are so close but with a Her2/neu neg I would expect yours to not be so high? LindaBusEd I live in Flowery Branch, just south of Gainesville.  My hubby likes to hunt in Lincolnton.",
      "MessageIndex": 48,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 26, 2008 10:38PM - edited Dec 26, 2008 10:40PM by moodyk13 Hi auriga, thanks for joining in!  I got you added with Otter.  I am starting a new thread called \"oncotype dx roll call\" and post in the top these scores and add as people post.  Edited to add:   BUT, I need to see if I can fill in the ??? I have for some %'s on some of the scores.  So if there is a ??? in front of your score and you know what your recur % was, could you please either post here or PM me so I can fill it in.  I beleive this would be extremely helpful, especially to \"newbies\"",
      "MessageIndex": 52,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 28, 2008 09:31PM moodyk13 wrote: OOOh Otter, I really liked the third link you posted as my \"mortality\" rate stays the exact same whether I do hormonal therapy or not!  And I like anything that agrees with me  LOL  Thanks for all your great links and posts as they have been most helpful to me!",
      "MessageIndex": 74,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 26, 2008 08:04PM moodyk13 wrote:",
      "MessageIndex": 50,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 26, 2008 10:50PM moodyk13 wrote: auriga, there is no \"good time\" to start chemo.  Try to think of it like this \"the quicker I start the quicker I will be done!\"  That is how I \"took it on\" and in fact, told my onco I wanted to start asap as I could out of surgery.  He said I had to wait 4 weeks from bi-lat, so we started exactly 4 weeks out.  I got it behind me and so glad!!!!  Even though I still have Herceptin, it is NOTHING compared to A/C!!!! Of course I am one of those that wants to get things \"over with\" !  I always voluntereed to go \"first\" when at dentist or doctor!",
      "MessageIndex": 53,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "moodyk13 wrote: I keep reading about peoples oncotypeDX score.  My onco didnt give me a score, he gave me a percentage.  After surgery and no other treatment I had  75% survival/25% recurrence.  And after my treatment options I could lower to 92% survival/8% recurrence. How do I know what my oncotypeDX score is?  Thanks! I don't care if my cup is half empty or half full; I am just thankful I have a cup! Dx 2/1/2008, IDC, 1cm, Stage IB, Grade 2, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 4, 2009 08:18PM moodyk13 wrote: mbradford12000, WOW that is a huge difference!  I am speechless.  I have read about the tamox/chemo thing you quoted and my doc told me about it too so he was very supportive of my choosing not to take it. So if my recur  was 25%, that would mean 25 out of 100 recur w/my kind of bc.  If chemo is suppose to drop it by 16%, I need to take 16% of 25? 16% of 25 is 4 so 21 got a recurrence.  and herceptin gives me additional 8% after chemo so 8% of 21 is 1.7 (round up to 2) and 2-21=19 so 19 out of 100 w/my type had a recurrence giving me a 81% cure rate?  Wow that IS way diff than the 92% cure rate I thought I would have after tx!!!  I gotta talk to my onc about this!",
      "MessageIndex": 102,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 21, 2008 09:26PM moodyk13 wrote:",
      "MessageIndex": 29,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Nov 11, 2008 03:38PM moodyk13 wrote: I wanted to minimize my risk of recurrence as much as possible.  I didnt want to have to walk around worrying if I had something forming again in affected side or other side, and I want to be symmetrical.  I have a friend that had one mastectomy  and she is still trying to \"even out\".",
      "MessageIndex": 33,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724088",
      "Title": "For those who \"could\" have Lumpectomy.... why choose Mast? Estepp sbmolee"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Oct 31, 2008 08:00PM moodyk13 wrote: mkm66, I dont know where you are but I can tell you that in my area (Atlanta and Northeast Ga) if they told you 1 - 2 weeks that is a GOOD sign.  Here, if they are pretty sure it's cancer,(and they are pretty accurate) they let you in w/in 24 hours.  I am praying that this is the case for you.  Unfortunately for me, I didnt get to wait, I got the call the next day. Keep us posted!",
      "MessageIndex": 5,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/723706",
      "Title": "Does It Get Easier or Worse? mkm66 NatsFan"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 23, 2008 01:31AM moodyk13 wrote: Yeah kimbly, I did the chemo too.  I did 9 of the 18 herceptin treatments, but I am taking a break right now.  I cant decide whether to finish the other 9 or be done. As far as hormone therapy goes, my onc told me it only made a 4% difference so I decided 4% wasnt worth all the side effects. I dont know, i still have some time to choose I guess, so i am still trying to decide and doing lots of praying about it.",
      "MessageIndex": 33,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "moodyk13 wrote: I keep reading about peoples oncotypeDX score.  My onco didnt give me a score, he gave me a percentage.  After surgery and no other treatment I had  75% survival/25% recurrence.  And after my treatment options I could lower to 92% survival/8% recurrence. How do I know what my oncotypeDX score is?  Thanks! I don't care if my cup is half empty or half full; I am just thankful I have a cup! Dx 2/1/2008, IDC, 1cm, Stage IB, Grade 2, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 29, 2008 09:48PM moodyk13 wrote: Seabee, I made it through A/C and I am making it through Herceptin, and according to my stats, this will put me at 92% probability of no recurrence. I figure those odds are better than they were for me before diagnosis!  I know that natural menopause is way easier on your body than chemical induced.  I had menopause symptoms from the chemo and it was awful!  but my body came back out of it by August.  Thank God! artse, I have talked to several women (now I know % is LOW) that had recurrence while on tamoxifen and some right after finishing tamox.  That would REALLY suck!  That is almost like choking to death on a vitamin! Which site did you go to?  Otter posted 3.  I assume it was because your tumor grade was a 3.  Those are more agressive. ",
      "MessageIndex": 82,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 2, 2009 08:44AM moodyk13 wrote: Harveysjule, I am sending lots of prayers your way right now!!! Heavnly Father, please wrap Your arms around \"Harveysjule\" and comfort her and protect her.  Lord God, You know her personally and I pray that she will feel Your presence today in that very scary treatment room.  Sweet Jesus, I lift her up to You right now, and I ask that You use these doctors and the medicines to rid her of this horrible disease.  You are the Great Physician Lord God, and through You, all things are possible.  Lord God, I know You are in control, and God, I give You all the praise and all the glory!  Lord, I also lift up Harveyjules children to You.  Precious Jesus, I just ask that You give them a comfort that passes all understanding.  Please calm their fears and assure them that their mommy will  be just fine.  Help them understand that as her looks begin the change that it is the medicine saving her life, not the cancer ending her life.  Lord God, I lift up her husband to You, and ask that You give him strength.  Carry him through the fear and the stress and may he be her rock and his children's fortress.  I love You, I thank You for loving me, and I thank You for bringing Harveysjule into my life.  All these things I pray in Your Precious Holy Name.  AMEN!!",
      "MessageIndex": 91,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 5, 2009 11:05AM moodyk13 wrote: Wow, thanks for all your research!  I will print these and take them with me!  I hope you dont mine, but I copied and pasted your above post (your first one) to my \"oncotype roll call\" thread (of course it includes your name) so that others can see this too.  I am going to post these three follow posts of your too as I feel they are just as important! I am so glad you found this thread and shared this info with us.  I am anxious to see what my onc says!!  I see him next tuesday (week from tomorrow).",
      "MessageIndex": 106,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Nov 8, 2008 02:56PM moodyk13 wrote: bump",
      "MessageIndex": 7,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 20, 2008 07:47PM moodyk13 wrote: Okay, illinoisnancy had a 5% chance of recurrence giving her a score of 9 otter had 17% chance of recurrence giving her a score of 26 kirsten33 had 18% chance of recurrence giving her a score of 27 kamico3 had a 12% chance of recurrence giving her a score of 19 So, I am trying to see a pattern.  Are there any math geniuses out there that can see how these are figure based on this pattern? Since I had a 25% chance of recurrence I would guess my oncotype score would be around 33ish?  And doc said chemo would reduce my risk down to 15% chance of recurrence and Herceptin would further reduce it down to 8% chance of recurrence.",
      "MessageIndex": 15,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 20, 2008 08:01PM moodyk13 wrote: kamico3 tamoxifen only reduced my chances of recurrence by 4% so I opted out of it.  5 years on a drug with yuck side effects including menopause (I am not even peri-menopausal) wasn't worth 4% to me. But I did do chemo A/C x 4 and I did 9 of 18 Herceptin tx's.  As of now, I have decided to stop all treatments.  I read that studies that have been done in New Zealand (and are continuing) show that 9 treatments were as effective as were 18 and less toxic to the heart and lungs.  So, for now, I am pretty certain I am stopping.  I took my last one the end of October and my doc is giving me until mid Jan  to see if I feel any different. I had wierd side-effects that have disappeard since I stopped herceptin, even though my doc said they couldnt be from herceptin cuz they said there were no side effects.  - They are soooo wrong!",
      "MessageIndex": 17,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 21, 2008 07:11PM - edited Dec 21, 2008 07:28PM by moodyk13 Okay, if people reading will continue to post their Oncotype scores ALONG with what their chance of recurrence was to get that score, I may be able to figure out how they score them!  LOL   (I know I could just ASK, but that is too easy, this now has me so intrigued, I WANT to figure it out myself--LOL) So here is data so far: 5% =  9 score 12% = 19 score (2 people had this ....thanks Lisasayers! ) 13% = 20 score 17% = 26 score 18% = 27 score 25% = ?? (what I am trying to figure out-not that it matters I am just curious now) 30% = 44 score Ya'll keep posting them and heck I'll be able to figure it out before I go back in January then I can see if I got it right! like I said before, I already did the A/C, and 9/18 Herceptin.   I am trying to decide whether to 1) do nothing else; 2) tamoxifen (prob not); or 3) Ovaries removed and start A.I's.......... P.S. lisasayers you are one of the rare women who ARE beautiful with no hair!!  I was NOT one of those women.....  I wouldnt let anyone take pictures of me! I am jealous (but only in a good way)",
      "MessageIndex": 24,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 21, 2008 09:26PM moodyk13 wrote: Thanks otter!  That was most helpful.  Like I said before, it really doesnt matter, I just got determined and now you have given me what I have been looking for.  Now I can move on and obsess about something else of little consequence. ",
      "MessageIndex": 28,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Dec 28, 2008 07:35PM moodyk13 wrote: artsee, your right about my score, I actually got it from the website otter sent me to.  I plugged in my recurrence percent and it \"popped\" out a score of 36.  I have no idea.  Here is the deal- I think I have \"busted\" my oncologist.  When I went for my initial appointment he handed me a piece of paper with recurrence %'s based on:  1-surgery only, 2-surgery + hormonal therapy, 3- surgery + chemo, 4- surgery + combined therapy, and 5- all of the above plus Herceptin.  Now the kicker is, he WROTE on my paper \"Oncotype DX\", and beings I didnt know about any of this stuff, that is what I assumed this piece of paper was! Now I have since become more \"educated\" in all of this and guess what???? I found the \"Adjuvant Online\" website and you know what?  That piece of paper he gave me with \"Oncotype DX\" written on it is an EXACT replica of the Adjuvant Online results based on my type of cancer.  So until I go back in January, I was doing my own \"interpretation\" of what my onco score would be with a 25% recurrence. So, based on their website, when I plug in the 25%, it says my score would be 36- Now I have since learned that they actually do a 20+ gene test on your tumor to give a score, so when I tell him I want it done, it could very well change to better ......or worse......but probably better.  And your welcome, I have enjoyed doing the \"data gathering\" as I find this kind of stuff so interesting! ",
      "MessageIndex": 72,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Jan 7, 2009 12:19PM moodyk13 wrote: What resolution do you both use?  If you use 800 x 600 that is why.  Mine is 1280 x 800 and I have no problems",
      "MessageIndex": 115,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    },
    {
      "AuthorID": "moodyk13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74007/profile",
      "Content": "Nov 8, 2008 05:40PM moodyk13 wrote: Thx Gitane.  The copy my dr gave me only shows percentages.  I go back on the 18th so I will ask him for my score. ",
      "MessageIndex": 9,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723695",
      "Title": "OncotypeDX score, please help! moodyk13 otter"
    }
  ]
}