{
  "AuthorID": "moonglow196…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252458/profile",
  "Posts": [{
    "AuthorID": "moonglow196…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252458/profile",
    "Content": "May 18, 2017 01:19PM moonglow1960 wrote: I'm now 74...but was 68 when first diagnosed with ER+ Prog+ HER 2+ Pet Scan showed only one breast involved but biopsy of one lymph node showed cancer cells so when I had surgery, after chemo 13 more were removed and none contained cancer cells........Had 18 months of chemo before surgery. I opted to have a double mastectomy and have reconstruction. Early 2012, I began Adriamycin/Cytoxin followed by + Herceptin/Taxol and then was given Arimidex and told to take it for 5 years...I lasted only 10 months on an estrogen drug, due to horrific muscle and joint pain. And just didn't take anything to replace it... There were days when I could barely walk when I took that drug and many days I cut the pill in half it was so horrific.... I'm totally holistic and have been watching my diet and eating right for the past 40 years. The reality is that diet and a healthy lifestyle does not prevent cancer relapse.... End of 2016, after being in remission for 5 years, I find myself dizzy, wind up in the ER, have a CAT scan of my head (contrast dye) and voila....I have a 2.8 cm brain tumor...Onco told me this is thefirst place a tumor forms when HER 2....I'm told by the neurosurgeon that I need brain surgery to remove and biopsy to insure it's related to my original breast cancer... Our local hospital has options...I found out that gamma knife was an option and chose that instead. It's been 4 1/2 months since my blast to the head of intense radiation and as of this moment, tumor shrunk by half as of March. I was told it should continue to shrink and shrinking proved that the treatment was efficacious...... As of early Feb. I was then back in the same cancer center, once again going for chemo. Twelve treatments...Taxol every week...Every third week, HERCEPTIN, Xgeva shot once a month (bone) and oh, a PET scan in Jan. showed metastasis had gone to liver, bone, lung and randomly scattered throughout my body. Honestly I thought I was going to die...Suddenly I'm stage IV and facing a new battle, only this time it's worse and dealing with treatment was much worse. So, I was sent for another PET scan after I completed my 12 weeks of Taxol, (which ended recently) this time I got swollen feet, a nasty rash and PERJETA which I was severely allergic to, could not be part of my protocol with HERCEPTIN. I feel chemo this time made me ultra sensitive to drugs in general...My last PET scan about a month ago showed \"nothing of concern or suspicion\"...I guess this means all evidence of prior active tumors had been eradicated by chemo. I was then given two injections (500 mg) of Faslodex...This was 3 weeks ago...I first didn't notice anything severe...Within two days I had the world's worst rash on my face...It was red, itchy, angry looking pus filled pimply looking things and nothing topically relieved this rash, until I began using a tea tree topical cream. But Faslodex has a half life of 40 days so this awful drug reaction is still ongoing... Oncologist told me I have to take some type of estrogen lowering drug with HERCEPTIN or else I could face another huge metastasis...Given I had a terrible reaction 5 years ago to Arimidex, I was told to try Femara as an aromatase inhibitor...I filled the prescription yesterday.......afraid to take one pill yet knowing I'm still dealing with the side effects of Faslodex which is still in my system... So, I don't know what caused my 5 years worth of being in remission to suddenly go haywire. When I was done with chemo last time, I should have had 5 years of an estrogen lowering drug and I didn't. But at the same time, I wasn't being treated with anything...Now I'm on HERCEPTIN every 3 weeks for life....AND supposedly the same rule applies to FEMARA... Would I take a chance (even though I'm so anti-drug it's a wonder I'm caught up in conventional medicine in the first place)....so would I take a chance and NOT take this aromatase inhibitor? Probably I'm going to have to stick it out this time....I'm 74 1/2 and I don't want to die...I also don't want to be ever taking another chemo protocol....I can't imagine how much estrogen my body could have right now, given my age....but I wouldn't want to find out the hard way...",
    "MessageIndex": 10,
    "PostDate": "18/05/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/854179",
    "Title": "Looking for alternative treatments for estrogen blocker. Sungirl64 moonglow1960"
  }]
}