{
  "AuthorID": "Moondust",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
  "Posts": [
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 19, 2016 07:51AM Moondust wrote: I think the machines go down a lot. At the end of my treatment, I congratulated the RO that his machine never went down. He told me that it went down right after my treatment at 11 am one day and was down for the rest of the day.",
      "MessageIndex": 128,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 30, 2016 09:39AM Moondust wrote: Ingerp, I hope you don't need any more radiation than they already told you. However, be mentally prepared to have it change, because after surgery they may find other stuff that changes your Dx. All of you ladies are holding up so well! This WILL come to and end and you WILL heal, no matter how bad the skin gets! I am almost 4 weeks out and I'm still peeling and brown, but the redness is gone and what little pain there was is gone too.",
      "MessageIndex": 205,
      "PostDate": "30/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 13, 2016 10:06PM Moondust wrote: I finished on April 4, but decided to share my recent experiences here so I can help with some of the questions. Babbs, my breast felt warm after the rads session for the first couple of weeks. Then I didn't feel it. I told myself it was like getting microwaved. Sorry about your high Oncotype, but that means chemo will really be effecitve on anything floating around in your bod. I'm not sure if your team will recommend it for DCIS, but you should definitely ask. I'm doing chemo after rads, and hope you'll consider it too if it is recommended by your MO. I was also on HRT but only for about 18 months before my Dx. I went off immediately and also started having some hot flashes, but they are not that troublesome. I just dress in layers and adjust as needed. LovingGrouches, I think what you had is the sim. The next thing you'll have is a real treatment, at least I think so. My first treatment took a little longer because they were doing some fine tuning, etc, and taking extra xray images beforehand. Warning - the marker they used got all over my bra afterwards, so wear old clothes to the first real treatment!",
      "MessageIndex": 76,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 22, 2016 05:56AM Moondust wrote: Arista, I know the Miaderm is more expensive than some, but I used it all through 30 rads and I think it is good stuff. For the entire course of treatment I used two tubes. Among other ingredients, it contains Aloe and Calendula. It is non-greasy and always feels nice going on. My skin has never liked vaseline based products such as Aquaphor, which is why I didn't try that one. Hang in there everyone!",
      "MessageIndex": 143,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 3, 2016 03:02PM Moondust wrote: Hi everyone. I had my lumpectomy almost 3 weeks ago. Only one node removed -- I asked my surgeon why only one and she said \"that's all you gave me\". Not sure what that means, maybe that only one node showed up strongly on the nuclear scan, and she didn't feel any suspicious ones. I get the feeling she did a super good job on my surgery. But she seems ultra conservative about resuming activities. She said not to do any range of motion exercises for three weeks, and begin the \"spider crawl\" at week 4. And not drive at all for 2 weeks even though I have no drains. Other literature I have read says to resume semi-normal activity after just a few days and start ROM exercises as soon as drains are removed or one week if no drains. So far I haven't needed anything for pain. I feel very fortunate (so far). The worst part of the experience was the wire insert and then the nuclear injections for the node scan. Ouch!! Since I had a marker implanted during the biopsy, why did they even need to put in a wire? I don't understand that part and didn't think to ask. I admit to being very phobic about lymphedema even with just the one node taken. There is only one local specialist and her calendar is full for over 3 months. I was told that if I don't have it, don't even bother to try to get an appt with her. So I marked dots on both arms at 1.5 inch intervals and have been doing regular measurements. There is no sign of any swelling yet, and at least I've got a good set of baseline measurements. I am the most freaked out about how long after surgery lymphedema can appear, and no one seems to know why it acts that way. So now I'm waiting for the OncoType score. If it is low enough, I'll have radiation and then AI pills. Otherwise, chemo first.",
      "MessageIndex": 673,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 16, 2016 02:53PM Moondust wrote: Grandma3X, I am very impressed that you have been to Antarctica! That is awesome! Katja23, glad you had your rash checked before it got worse. edwsmom, all I can say is Saturday can't come soon enough! Some people just don't understand how much extra hassle they cause by \"helping\". Keep saying No and good luck with the work issues. DecisionFreak, good choice to pay the neighbor for some help. I'm sorry all these other things are going on in your life right now. Balthus, it is a little scary how much information is not revealed when we consent for these treatments. I'm grateful for the advanced state of medicine that allows us to be helped so much, but I do wish they would not treat patients like children. Stellamaris, I hope you are continuing to recover well.",
      "MessageIndex": 826,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 24, 2016 02:35PM Moondust wrote: Sorry about your high onco score, Logang. But at least you know you'll have done everything you need to do to prevent recurrence. Have a great time in Gaitlinburg!! I started rads yesterday. So far it is not bad.",
      "MessageIndex": 855,
      "PostDate": "24/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 24, 2016 03:55PM Moondust wrote: Grandma3x, I am using Miaderm, which contains calendula. This was the only salve recommended by the rads dept and they said they've had great results. I asked about the Mepitel film I read about, but they don't use it. My RO did take the time to look up the study about it, though, and said he'd be more convinced if the study was not funded by the company who makes the product. You may want to take a compression sleeve with you to Vail even if you've had no LE symptoms. The high altitude will challenge your lymph system because the air pressure is much reduced. I am concerned about this because I hike at high altitudes. So far I have hiked up to almost 6000 feet and everything was good. But there is also a difference between hiking and sitting around - the act of hiking will promote good lymph flow while sitting around won't. I want to go up to 7500 feet in a couple of weeks to snowshoe. If all is still good, I'll keep going higher.",
      "MessageIndex": 857,
      "PostDate": "24/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 10, 2016 08:10AM - edited Mar 10, 2016 08:12AM by Moondust Grandma3X, I have heard recommendations to draw blood from the leg for people with lymph nodes taken from both sides. I guess the blood draw places don't like to do it, but they can. Personally I would probably chance an arm now that I've done the high elevation thing. I think infection might be the biggest worry, since that activates the lymph system like crazy. I'm gradually working back up to my regular weight training and so far, so good. Yesterday I did 6 real pushups! (Used to do 25-30). BlueHeron, so great to hear you are doing well! It's good to hear that the prosthesis is working for you and that you forget it's there. If I ever need a total boob removal I'll probably go the same route as you.",
      "MessageIndex": 887,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 11, 2016 05:29PM Moondust wrote: Hi DecisionFreak. I'm so sorry to hear about your mother's decline. I have a lot of friends caring for their elderly parents, or trying to, and it is very rough going even in the best of circumstances. I hope she will be eligible for some home health care to take some of the burden off you. It's good news about your surgery continuing to heal, and about your cyst getting smaller. All you can do is what you're already doing - just take one day at a time and try not to let worry take over. Rest as much as you need to - the house will last a little longer and when you are in a better place physically you'll deal with it. Fatigue and worry is what makes our lives miserable. Take it easy on yourself! Bjsmiller, hope you are doing okay with the arimidex!",
      "MessageIndex": 900,
      "PostDate": "11/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 5, 2016 12:49PM Moondust wrote: Great news, Stellamaris! Grandma3X, do you listen you anything while you walk? I subscribed to Audible and listen to great books that I'd never have time to read otherwise.",
      "MessageIndex": 724,
      "PostDate": "05/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 7, 2016 12:42PM Moondust wrote: DecisionFreak, too bizarre about the crazy man on the bus! I'm sure everyone was glad you talked to the driver. If you have Notepad, you can type your post into it, then copy and paste into here. That way you'll still have your post if it doesn't show up. I've had to do that on several sites. Grandma3X, I love hearing about your steps!! I firmly believe that consistent moderate exercise is one of the absolute best things we can do for ourselves. It reduces overall inflammation, has many other positive health effects, and helps with weight control. And because walking is weight-bearing, it helps keep bone density. Logang, hope your drains will come out on Tuesday and you can re-join the walking club! Stellamaris, I'm glad they gave you a new option. I'll be hoping the best for you. Merymete, good to hear the great news! Yesterday I did my first longer hike since surgery. It felt good to walk up a few hills! My right arm feels a tiny bit sore and tired, but not bad. I'll take it easy today and tomorrow except for my daily steps. ",
      "MessageIndex": 737,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 10, 2016 11:32PM Moondust wrote: I'm rooting for you and your surgeon, Stellamaris!",
      "MessageIndex": 768,
      "PostDate": "10/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 21, 2016 03:02PM Moondust wrote: Bjsmiller, I'm glad to hear that you are recovering well! You have a terrific attitude and it is contagious :) Grandma3X, so great to hear you were jogging!! My knees are too far gone for jogging or any type of high impact, my right knee especially. They carry me up and down mountains, though, as long as I keep it to a walk. I'm also glad to hear you have lost the taste for alcohol. I think it's more of a habit than a taste. My DH got sober in AA and we maintain an alcohol-free house. Besides, not drinking alcohol subtracts many empty calories from one's diet! However, I'll never give up bread :) I only eat it in moderation, though. DF, I'm happy to hear your Mom is doing better! I hope the discharge is nothing serious. None of us need any more problems or stress!! Do you think your mother will want chemo? I'm sure the MO is thinking about extension of life vs quality of life. But I hope there is a treatment answer. I had my setup for rads last Wednesday, and I will have my first session this Tuesday. Has anyone heard of or used Mepitel film for radiation? My nurse friend in Canada, who is a wound specialist and who also got a Dx of BC last year, sent me a recent study showing that putting this film over the radiated area for the duration of treatment reduces the side effects extremely well! I'll be calling my radiation dept tomorrow to ask them about it. I've been hiking a couple of times, and last week hiked up to just under 6000 feet. I took my tape measure to look for any LE symptoms, but my arm was fine. Next I want to try snowshoeing at around 7000 feet.",
      "MessageIndex": 847,
      "PostDate": "21/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 19, 2016 10:35AM Moondust wrote: You are most welcome, Jacklin I have listened to some of them more than once - so informative.",
      "MessageIndex": 917,
      "PostDate": "19/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "May 20, 2016 06:00PM Moondust wrote: Kessa, I would ask for a biopsy. I wouldn't be able to stand not knowing. Good luck!",
      "MessageIndex": 940,
      "PostDate": "20/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Jul 10, 2016 03:47PM Moondust wrote: Grandma3x, glad to hear your surgery went well. But I wonder what could cause your left calf to swell! Were there any other symptoms in your calf right after surgery, such as pain or bruising? I would be suspicious of some malfunction with the BP cuff, especially if it was one for arms. Things like that are so hard to figure out. It's great that you are staying on the road to a healthy body and good lifestyle! Good luck with everything!!",
      "MessageIndex": 945,
      "PostDate": "10/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 2, 2016 04:00PM Moondust wrote: Please add me to this great group. My surgery was 1/15/2016. Lumpectomy w/ Sentinel Node Biopsy. I had a consult with the RO today but still waiting for OncoType results.",
      "MessageIndex": 655,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 4, 2016 11:43PM Moondust wrote: DecisionFreak, all my best wishes for your mother. It's tough to not be there. BlueHeron, sometimes it helps to flip a coin. Not that you have to do what the coin says, but sometimes it will reveal your feeling about each potential choice. Like, if the coin says don't do rads, you might feel unsettled and you will realize you actually want to do the rads. Or vice versa. Grandma3x, keep getting those steps. They are so good for us. Maybe you should go to the mall more often! Mominator, glad to see you walk so much. My friends said I should take a few weeks off work after surgery, but I said I would be far more sedentary at my desk than at home. The only place I ever sit down is at the computer.",
      "MessageIndex": 720,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 13, 2016 11:20AM Moondust wrote: DecisionFreak, I will definitely be going on AI as soon as I'm done with my radiation. The AI is factored into my 7% distant recurrence risk, so I know I can't skip it! I read what you wrote earlier about why your team decided no AI for you. I'm the same age as you, and I will be worrying about side effects slowing me down too. But I'm pretty determined to continue with my walking, hiking and working out even if it hurts a little bit more. Time will tell. I think it is very believable that no cancer cells were found from the second surgery. I have a feeling you'll be fine! I'm very sorry your mother is not improving. We'll be here and thinking healing thoughts. Where is the exercise forum link? Mominator, I'm glad you are feeling better. S'more is very cute!! Thanks for keeping on top of the tech issues. Chambo, my lumpectomy site has also filled in and looks like a balloon 1 month after surgery. I'm going to ask Tuesday if it needs to be drained. I hope it does not look like that forever. Chemo will be a challenge, but you'll get through it. Virginia, thanks for the suggestion about Mammaprint, but I'm more of a numbers and percentages type of person. Even though Mammaprint only gives a Low or High rating, it is still a sliding scale, with some women at the high end of Low and some women at the low end of High. They just don't give you that information. I looked at the Mammaprint site and they don't even factor Tamoxifen or AI therapy into the rating, which certainly affects the long term outcome for ER+ cancers. I'm comfortable with my decision to not have chemo. Grandma3X, what do you do as a marine biologist/biochemist? I'm very interested in all that stuff! I second BlueHeron's suggestion that you speak up about the intern. The PT needs to know that she needs supervision and more training, and you should not be subjected to pain due to an inexperienced intern!! When I had PT for my knee, my PT always checked with me about how the intern was doing, whenever I had one assigned. Welcome Nolagirl and hang in there. This stuff is not easy, but it's so great to be able to talk to others in the same boat.",
      "MessageIndex": 792,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 3, 2016 11:09PM - edited Feb 3, 2016 11:26PM by Moondust Thank you all for the welcome!. I will never be able to keep up with making comments to everyone, so please excuse my spotty posts in advance. Kessa, I have a lump on the bottom of my ribcage kind of like you describe. It has been there for at least several years. Last November I decided to have it looked at, because it gets sore sometimes. Right after my primary care dr scheduled me with a surgeon to \"pop it off\", I got my breast cancer Dx. I saw the surgeon anyway. He thinks it's a lipoma. So did one other doctor. However my primary care guy and my MO both said it did not feel like a lipoma, but couldn't say what else it could be. None of the four doctors thought it was worrisome (it is well defined and mobile). Now I'll have to wait until I'm through with my cancer treatments to find out what it is. But I want it gone. Virginia, thanks for the post-op exercise feedback. I didn't follow the driving ban order very well. And after the first week I would sometimes forget to only raise my arm 90 degrees. I asked her about walking and she was in favor of it. I specifically asked \"a lot of walking?\" and she said it was okay, so I'm back up to my 15,000 steps a day. I'm not glad to have cancer, but since I do, I'm glad to be here. Alice",
      "MessageIndex": 685,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 8, 2016 12:31PM Moondust wrote: I think we need enough off-topic material so that we can get to know each other better. Otherwise it is too clinical, and I get enough of that from all the doctors I've been seeing. Grandma3x, very funny about driving the dog :) But I totally understand his reaction. You are getting closer to the golden 10,000 steps! I hope your weather improves soon so you can enjoy getting outside. How are you feeling? Katja, my physical therapist friend told me that shoulder pain can occur because we are not using it enough and it \"de-stabilizes\". Mine aches sometimes in a way that isn't related to the surgical sites. I think gradually increasing your shoulder exercises as more time passes will help. But we do need to wait until the surgery is healed before we start doing too much. If you had the same surgery as me, the surgeon cuts the fascia between the parts of the pec muscle to access the lymph nodes, and that incision has to heal before it is safe to start lifting anything very heavy with that arm. My PT friend said it should be well-healed in 6 weeks. But please follow your doctor's orders as far as how much you are allowed to do. DecisionFreak, I think it would be a great idea to get a home health care nurse temporarily. So I guess the first doctor who looked at your mother was right about pneumonia. I have a call in to my surgeon's office about what I think is a seroma in the area of the lumpectomy. It does not hurt but seems larger instead of smaller. I'm 3 weeks post-surgery. Probably nothing to worry about, but I want to let them know I've got it.",
      "MessageIndex": 753,
      "PostDate": "08/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 8, 2016 08:04PM Moondust wrote: Katja, you seem to be recovering very well! I have good range of motion too and didn't need pain meds. The first week I felt some pulling if I accidentally raised my arm too high, but at three weeks I can raise my arm all the way overhead. We are lucky to feel good, but we have to make sure we don't start doing too much too soon. Believe me, I am itching to get back to my workouts and weight lifting, but my PT friend convinced me to take it very slowly, both to let everything heal and to avoid lymphedema. Before surgery I could deadlift 100 pounds, overhead press a 30 pound dumbell and do 30 pushups. For the next three weeks I'll be limiting myself to going through some of the motions with no weights, along with a 1 minute straight-arm plank and some leg and ab exercises. Until I understood about exactly what was cut during surgery, I was tempted to pick up the weights again, but now I won't. My friend said if nerves were cut, we might feel no pain but still be doing damage by lifting too heavy.",
      "MessageIndex": 759,
      "PostDate": "08/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 10, 2016 03:37PM - edited Feb 10, 2016 03:38PM by Moondust Virginia, Hooray for no chemo!!!! DecisionFreak, so sorry to hear about all your Mom is going through. I hope she will improve. But glad to hear your bones are good! SVGSurvive, I know you probably are having a slightly more difficult recovery than the lumpectomy ladies, but hang in there!! Are you feeling okay?",
      "MessageIndex": 763,
      "PostDate": "10/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 11, 2016 11:56PM Moondust wrote: Merymete, that is a SCARY story!!! I am so glad you were able to get to a hospital in time. There is always a risk to surgery, but you don't expect something like that to happen after 3 weeks! I hope all goes well from here on out. Stellamaris, I'm happy to hear you did fine with the surgery. You are an old hand at it now. Sorry you have to wait so long to get the results of the margins, but I guess they are being extra thorough with the tissue they took out. Grandma3X, glad to hear you won't be having chemo. I just got my Oncotype score today, and it was a little higher than I had hoped - a 26. I know a lot of people have chosen chemo with that score, and I was ready to say I'd have it, but my MO ran some other calculations on the OncoType website. There are tools available only to doctors that are fairly new and being finalized in clinical trials. She explained that the OncoType people realize what a hard decision it leaves patients with to have a score in the \"gray zone\" so they are developing new tools using statistics based on the thousands of women who have had the test. The new calculation took into account the score of 26, my age, size and grade of tumor, and AI hormone treatment instead of Tamoxifen. My risk of recurrence was calculated at 7% instead of the 17% based on just the score. I can live with the 7% and have decided not to do the chemo. My DH totally agrees and said he would make the same choice. Of course I'll brood about it all weekend and can still change my mind.",
      "MessageIndex": 780,
      "PostDate": "11/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 28, 2016 09:26PM Moondust wrote: DecisionFreak, I wish you were having an easier time of it. Did your gyn order the ultrasound? I hope you can get a plan of action soon. I'd be feeling nervous too. Hopefully if there is even a suspicion of anything malignant they will remove your uterus and ovaries asap. I barely know about breast cancer yet, so I have no idea what the usual sequence of events is for other symptoms. You'll be in my thoughts!",
      "MessageIndex": 878,
      "PostDate": "28/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 9, 2016 09:32PM Moondust wrote: Grandma3X, glad your surgery went so well today! I take it you didn't have any arm swelling in Vail? I went up to 8500 feet last weekend and had no problems. So nice to hear pretty bird song, Mominator! I did a short hike today in the Kern River Canyon amid cascades of orange poppies and blue lupines! DecisionFreak, I hope you are hanging in there!!",
      "MessageIndex": 884,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 10, 2016 08:07PM Moondust wrote: Grandma3X, what great news!! I'm so happy to hear it!",
      "MessageIndex": 896,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 17, 2016 01:03PM Moondust wrote: Grandma3X, I would vote for not taking the node! It's more chance of LE and more putting up with discomfort when healing. My SLN scar was the most uncomfortable place after my lumpectomy. My shoulder still grumbles when I lift my arm completely over my head. If they don't find cancer then you won't be missing the node I know it's a tough decision, but that's what I would do. Not good about the nutritionist, but unfortunately I think she is typical. We are having a lively vitamin/mineral discussion on the Winter Rads forum because doctors give all kinds of conflicting advice. I'm still confused about whether I should be taking Vit D during rads. My doctor did not mention to not take it, yet it is an anti-oxidant and is especially good at helping DNA repair. Happy St Patty's to you too!",
      "MessageIndex": 906,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 18, 2016 09:28AM Moondust wrote: I thiink that would be a good compromise, Grandma3X. If your BS could mark the sentinel node so that it could be removed later, it would solve the problem. I don't understand very much about mastectomy. Once the breast tissue is gone, would the nodes drain the chest wall area in the same manner, so that the sentinel node would still be the sentinel node? There are some breast surgeon podcasts I found that I will listen to - maybe they discuss this issue in one of them. The podcasts can be found here. Anyone interested, look for the Breast Cancer Update series, and Breast Cancer Update for Surgeons on that page. He interviews different oncologists and surgeons, and they discuss various topics and cases.",
      "MessageIndex": 912,
      "PostDate": "18/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 23, 2016 08:33AM - edited Mar 23, 2016 08:44AM by Moondust The tumor board that discussed my case were the ones that felt the Onco scale would be changing soon. But the change is not official and nothing has been said by Genomic Health. My tumor board felt that, based on recent studies, the low category would end at 10, the intermediate would be 11-25, and high would be 26 and over. I wish I could edit my original post to make it clear that the future scale change is based only on opinions I have heard, not any official statement, but there is no longer an edit link! When oncologists use the Onco score to make a decision in recommending chemo, they don't necessarily all use the same cutoff points. Their decision may depend on other factors, including how well they think the patient will cope with chemo. The benefits have to outweigh the risks. There are some great podcasts here if you want to listen to oncologists discuss different studies and patient cases. Many times they will talk about how they arrived at a certain decision about a treatment plan.I have listened to some of the Breast Cancer Update podcasts and also the Breast Cancer Update for Surgeons. Chloekitty, it certainly is a tough decision about chemo/no chemo. I think the PR- gives us a higher risk and perhaps the AI therapy does not work as well. But don't let them rush you into a decision. Take time to consider everything. If you decide to have chemo, leave yourself enough time to plan out things. You are very similar to me, except I have 80% ER and 40% PR.",
      "MessageIndex": 22,
      "PostDate": "23/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842209",
      "Title": "Oncotype DX results are in... Nachout818 Lisey"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 14, 2016 03:41PM - edited Mar 14, 2016 03:46PM by Moondust Nachout, I am in the same boat with a 1.4 cm Grade 1 tumor and Oncotype 26. Are both of your scores from biopsies? Mine is from the removed tumor. Will they do another Onco test on your tumor, once it has been removed? Did they remove sentinel lymph nodes yet, or will that also happen on March 22? Lymph node status is a factor in deciding on chemo too. You need to also know your ER percentage and PR percentage from your pathology report, and your Ki67 if available. If you don't have a copy, you might want to pick up a copy from the place that did the pathology report. All of these things affect your Oncotype score. My ER is 80% and PR is 40%. That means 80% of my tumor cells have the ER receptor and 40% have the PR receptor. ER% can greatly affect how well the hormonal therapy will prevent a recurrence. PR% is also being found to be a factor. The Oncotype test also does a genetic measurement of the Ki67 factor, which controls how fast some of the cells are dividing. A month ago I felt the same as you -- please, anything but chemo! So initially I chose no chemo, because of the Grade 1 rating on my tumor and nothing found in the lymph node. But I changed my mind after mulling it over for a couple of weeks and doing more research. Now the plan is to finish up my radiation, then I will have chemo starting sometime in April. Here is my reasoning: even though the path report shows Grade 1, there is some reason my Onco score came back as high as it did. If Grade 1, ER+ was all the info needed to determine risk of recurrence, there would be no need for Oncotype. But there is more to it than that. Not every single cell in my tumor is necessarily Grade 1, and there is a good chance that up to 12% of my cells are ER- AND PR-. If my ER was 90% or 100% and my PR was above 75%, then I would trust how well the hormonal therapy will work to prevent a recurrence. But I feel there is a chance some of my cancer cells will not be controlled by anti-estrogen therapy, and I want to try to knock those out with chemo. Even though I am 61, I am very robust and will probably do okay with chemo and will be able to return to the activities I love. If I have to deal later on with a metastasis to bone, brain, lung, or wherever, my life will never be the same and my activity level and quality of life will permanently drop. Just looking at some of the posts from Stage IV patients gives you some idea of what those brave women go through. Even though there are no guarantees, I have decided chemo is a risk worth taking. Nachout, another thing to consider is that they are currently revising the Oncotype scale. Now, low risk will stop at 10. Intermediate will be 11-25, and High will be anything over 25. The new scale (even though not official yet) will put both of us in the High category. You have a few weeks to think this over. Your tumor pathology will be available a few days after your surgery, and if you send for another Onco score that will take another 2 weeks. But be prepared to receive the same score again. I definitely needed a few weeks to make the decision. Sometimes the right decision is not the easy one. But it is really up to you and your MO to make the call. Good luck, whatever you decide. And this whole nightmare does get a little easier once you decide on your treatment plan.",
      "MessageIndex": 3,
      "PostDate": "14/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842209",
      "Title": "Oncotype DX results are in... Nachout818 Lisey"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Jul 20, 2016 03:56PM Moondust wrote: Sensitivehrt, the onco report shows a scale for the ER, PR, and HER2. If you get a copy of all the pages, you can see on the scale where you fall. It is just that under a certain number, they consider you negative. But you will be able to see if you are just under the line or way at the bottom. However, their scores are not percentages so don't try to correlate that. With a low ER score, you really need to think about chemo, because the hormonal pills are less effective for low ER or low PR. I had high Ki67, too, although that is on the pathology report, not the onco report. My MO would not even consider Ki67, but it has been used as an indicator for years. I was in a similar boat with a 26 score, and I decided to do the chemo, but I didn't decide until after the first few radation treatments, so I am having the chemo now, after my rads were done. Long story, but the second opinion (which my MO insisted I get) agreed with me that I would benefit. All who have to make a decision, please ask what they would recommend as your chemo treatment. I am getting TC x 4 and it has not been too bad so far. Today I had my third infusion and I'll have the fourth in another three weeks. Yes, the hair went, but #nohairdontcare. I have been walking every day and hiking on the weekends, although slower uphills and not quite as far as normal. If they want to add the A (adriamycin) to your treatment, it might be a little tougher, but a healthy diet and exercise will bring your blood counts up by the next treatment, and focusing on what you can do rather than what you can't do will help you get through, for all who decide to do chemo. I have to say, the time is flying by. Just for the record, if my score had been a 20 or 22 I would probably have decided against chemo. But 26 is in the \"new high\" range, although that is totally unofficial according to Genomic Health. With a 30 there would have been no question in my mind to do it.",
      "MessageIndex": 39,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842209",
      "Title": "Oncotype DX results are in... Nachout818 Lisey"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 11, 2016 03:02PM Moondust wrote: Duzy, congrats on getting done with whole breast rads!! Woohoo!! I am halfway done with them. One more day, then we all get a two day break! I'm ready.",
      "MessageIndex": 2041,
      "PostDate": "11/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 16, 2016 07:49PM Moondust wrote: Yay, Brimton!!! I'm so happy for you! Did you do anything to celebrate? Twinkltoz, hooray for being more comfortable! JOWE, I get a pain when I lean over and my breast dangles. My RO said it is probably the scar. Mary, good advice about pushing back when doing chemo, so the side effects get taken care of. I'll remember that! I bet you can't wait til tomorrow! Sunnyone, I'm doing rads before chemo because I originally decided against chemo, then changed my mind during the first week of radiation. I felt like a had to make a snap decision when presented with my Onco score of 26, and although my MO was noncommittal she seemed to be guiding me towards a no chemo decision because of my Grade 1 tumor with no affected nodes. So I said okay, no chemo. I wish she had said, please go home and think about this a week, then tell me your decision. Because it's a really hard decision to make when you didn't expect your score to be that high. The first week of rads I went hiking by myself and could not stop thinking about all the reasons my tumor got a 26. Fairly low PR% and high Ki67. All of a sudden I realized I needed to do chemo! It felt like a weight was lifted from me, and I told my RO at our next meeting a few days later. He said no big deal, the order of chemo then rads is mostly convention. Except that he is recommending against Adriamycin because it can cause \"radiation recall\" where your skin becomes red again in the radiated areas. ",
      "MessageIndex": 2138,
      "PostDate": "16/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 19, 2016 02:50PM Moondust wrote: My place does not have a bell. I doubt if they have a gong either At least they changed the room light to green for St. Patrick's Day. I had one \"old\" tech today and one new one. The new one kept apologizing whenever she had to touch me or move me. I finally told her there was no need to apologize because I'm used to the routine. Diane, I know it must have been awesome to sleep in! Hugs to you too! I have six more whole-breast and then 5 boosts. I can almost see the light at the end of the tunnel! ",
      "MessageIndex": 2191,
      "PostDate": "19/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 22, 2016 11:28PM Moondust wrote: Kkubsky, I think you might have to put the 16 treatments and 2 boosts in your signature instead of the treatment area. You create a signature by clicking Settings on the Discussion Board menu (left side of the page). I am a 36 D or DD and got some soft bras at Walmart for less than $20.",
      "MessageIndex": 2238,
      "PostDate": "22/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 25, 2016 07:19AM Moondust wrote: Sunnyone, hope you enjoyed the champagne! I'm \"toasting\" your first week completed with my tea! Barbe, good going on your outstanding sales performance! I'm glad you still have the go-getter attitude! I am really sorry you have a met. Sometimes I think to myself there are two kinds of BC patients, the ones that know they are Stage IV, and the ones wondering every day if they are Stage IV but just don't know it yet. Let's have good days as long as we can, each and every one of us! I hope they will adjust your field to miss your liver. Congrats to seekingserenity Maggiemae & biscuits! So great to hear you are done! MissV, health insurance is just another way to say STRESS. Good luck figuring it all out. Mary, it's good to hear you are healing well. How long has it been since your last chemo? I wonder how long the weak legs will last. I too am having shoulder issues, I think because of the daily positioning. Before rads I had full range of motion back and no pain in the shoulder. Now I have a terrible impingement in my shoulder and it hurts to lift things above shoulder height. Since I want to build back up to my normal workout, this is not good! I thought maybe they'd change my arm position for boosts, but they told me today it will be the same position :(",
      "MessageIndex": 2266,
      "PostDate": "25/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 29, 2016 04:47PM - edited Mar 29, 2016 04:54PM by Moondust Mairew, good for finishing WBR tomorrow! I had my first boost today. It is electron beam rather than photon beam. They told me the electron beam does not penetrate as far, so no need to hold my breath for these. It is aimed completely differently, and only has one position instead of the two for my WBR. It will vary for each person depending on where your tumor was. They took off all my stickers and drew an area on my breast which represents the boost field. It is roughly an oblong around the site of the tumor. Then they made a template so if the marker fades too much they can easily re-draw it. The whole procedure did not take any longer than a WBR treatment, and they say it will be quicker tomorrow. They said the skin can have a reaction similar to the photon radiation, but since it's only 5 days, I should not notice much. Katja, I did not have any bad reaction to my 30 WBR trreatments, just a little darkening with some pink under the arm and under the breast the last couple of days. But no itching or burning. This is only a guess, but could having chemo prior to rads make some women have a worse reaction? Is there a special way to do a breast self-exam after you have had radiation? I am changing the way I do mine, because my ob-gyn never detected my lump when she did a traditional breast exam, and it was there for at least 2 years! I am using the \"grab and squeeze\" method (my own name) where I grab one breast at a time and squeeze it around like putty. I think I'll definitely have a better chance to feel any lumps or thick areas this way, whereas the way I was taught - lie down and rub in small circles on the skin - did not work for my dense and fairly large breasts.",
      "MessageIndex": 2328,
      "PostDate": "29/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 30, 2016 06:13PM Moondust wrote: Musogirl, thanks for mentioning shoulder exercises. I am fortunate that I have a retired PT I can consult with. He gave exercises to do, and they seem to be helping a bit. When I'm done with rads I'm sure the exercises will help even more. My PT said the rads arm position is impinging my anterior deltoid and may also be causing the bursa to flare. I am doing gentle bent-over pendulum swings with that arm, holding a 5 pound weight. He said that motion will open up the joint and relieve the pinching.",
      "MessageIndex": 2353,
      "PostDate": "30/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 7, 2016 01:43AM Moondust wrote: Thanks, Diane! Congrats, mairew, for being done!! Hooray!! My skin was like yours, and I didn't have fatigue either - just my normal tiredness at night. kkubsky, I'm counting the days along with you! It won't be long now. Barbe, good luck with your scan. I'm sending waves of health your way to help it be a clean one! Glad the new medicine is helping.",
      "MessageIndex": 2433,
      "PostDate": "07/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 13, 2016 07:28AM Moondust wrote: Congrats, Karen! It is so great that you are done! You received the same things I did. Now on to a few weeks of skin healing for you. Barbe, I did not take a shower very often either and I think it helped. Randi, good luck. You'll start seeing the light at the end of the tunnel before you know it. Edwsmom, that bra looks very comfortable. I am still wearing a bra 24x7 so the bad girl doesn't flop at night. I am one week out. My underarm is looking good. I have one area, I guess you'd call it the outer portion of the inframammary fold, that had black skin. Part of the black peeled off to reveal red skin. But it is not painful unless I mess with it, so I don't. I'm still using the Miaderm and hoping I can get by without purchasing another tube.",
      "MessageIndex": 2479,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 17, 2016 09:01AM - edited Apr 17, 2016 09:02AM by Moondust Your increased exercise is great to hear, Twinkl! Kkubsky, I think you just have to wait it out. The skin is healing now and will be a lot better a week from now. Just manage any annoying symptoms you are having, such as itching or burning, by using whatever helps, and wait for the healing to happen. Sunnyone, my breast swelled the most about a week after I was done. Now it might be calming down a bit.",
      "MessageIndex": 2524,
      "PostDate": "17/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 22, 2016 12:11AM Moondust wrote: Well, hi everyone! Some of you I know and some I don't. I'll be starting rads on Feb 23 with 30 treatments (25 whole breast plus 5 boosts). What can anyone tell me about Mepitel film? A Canadian friend told me to ask the rads dept about it because it works so well in preventing skin issues. ",
      "MessageIndex": 1539,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 23, 2016 12:44AM - edited Feb 23, 2016 12:45AM by Moondust Thanks for the welcome, Mdoc. I called my RO about the Mepitel and of course they do not use it.They gave me Miaderm which I'll put on in the morning before my first treatment. It has calendula in it. After reading everyone's posts I am curious how much more joint stiffness I'll feel over the course of treatment. If I don't keep moving, my knees get stiff anyway. But I am going to try not to worry and to take each day as it comes. Andra, I will be following your progress with rads and how it affects your exercise. I too am very active. My knees don't allow running, but I do a lot of hiking and backpacking in the Southern Sierras. Fifteen miles is kind of an average day of hiking for me, or at least it was before all this cancer stuff started interfering. I'll be trying like heck to keep hiking so I don't get too out of shape. At age 61 it's harder to regain one's fitness. I love New Mexico! Last March I was in Las Cruces for the Bataan Death March at White Sands missile range. Cheers to all!",
      "MessageIndex": 1563,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 23, 2016 12:02PM - edited Feb 23, 2016 12:02PM by Moondust Thanks, HH. I checked with them yesterday and they said do not apply within 2 hours of my appt, which is at 1:30 today. I'll take my shower and apply my salve way before the deadline. I'll find out the daily procedure today, since it will be my first real go with the read rads. Hooray for everyone's progression! I love when there is an end in sight. After today, my end will be in sight too. At least my end for now, because none of us knows the future.",
      "MessageIndex": 1578,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 1, 2016 04:01PM - edited Mar 1, 2016 04:02PM by Moondust Peabrain, I love the photo! What fun it will be. Sailorgirl, hooray for last day coming up! JerseyGirl, same for you. hooray! For whoever was asking about total cGy of treatment, mine is 6000 including boosts. I would rather have a radiation treatment than a root canal. Today I talked to the RO about doing chemo after rads. I had originally decided to skip it, but have since been mulling it over, reading more things, listening to expert podcasts, etc, and I think I should have it (based on several factors including onco score of 26). He said I was not crazy for wanting to do it. I told him I've been taking the path of least resistance for too long, and sometimes the correct decision is not the easy one. So that will be coming up for me.",
      "MessageIndex": 1750,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 9, 2016 04:32PM Moondust wrote: Hey, sign me up for some jam, Peabrain! I'm just over the hill from you near Bakersfield :) Kimmer, nice show of courage with the great photo! You're a warrior. You look terrific because you look healthy! Hooray for new hair!",
      "MessageIndex": 1974,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 15, 2016 11:48PM Moondust wrote: Sometimes it drives me nuts how different and conflicting advice is given by different doctors! My RO said no big doses of antioxidants from supplements, because antioxidants help repair damaged DNA. The radiation works by damaging DNA to kill any cancer cells, and we don't want to help those buggers repair themselves with megadoses of antioxidants. But normal food sources of antioxidants such as vegetables are okay. That's just MY doctor talking, and I certainly can't vouch that he is right and others are wrong. This web page seems to say that Vit D is especially good at helping to repair DNA. I think I'll stop taking it for the rest of radiation. My bones won't start to crumble in a few weeks. But I hope I c;an take it during chemo, since I'll be shielding all my skin from the sun this year. Brimton, congrats on arriving at the last day! I can hardly wait to be there.",
      "MessageIndex": 2124,
      "PostDate": "15/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 16, 2016 02:13AM Moondust wrote: Love it, Sunnyone! What a perfect way to help get through the treatments! Nice happy color, too.",
      "MessageIndex": 2126,
      "PostDate": "16/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 20, 2016 01:30PM Moondust wrote: I will add that I believe my high protein diet and use of Miaderm has helped tremendously through these radiation treatments. I have very minimal side effects so far, with 6 whole-breast treatments and 5 boosts left to do. Fatigue has not been an issue. I do want to mention that it is a myth that high protein will damage kidneys in healthy people. It only applies to people who do not have healthy kidneys to begin with. Even a very high protein diet has not been shown to damage healthy kidneys. It does make them work harder, however. About 25% of my daily calories come from protein, which translates to anywhere from 110-135 grams of protein for me. Not only is it vital for healing, but it also helps us maintain muscle or lose it much more slowly (the anabolic effect Kate spoke of). Most women tend to eat too little protein. My protein comes from greek yogurt, chicken, eggs, fish, a little beef, lentils & beans, etc. If I add protein powder to my smoothies, it is egg protein.",
      "MessageIndex": 2205,
      "PostDate": "20/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 27, 2016 04:04AM - edited Mar 27, 2016 04:07AM by Moondust I have just one more whole breast and then 5 boosts to go. My nipple and dark spots under my breast gradually got darker, but it was a few weeks before I could tell any difference in color between treated and untreated breast skin. My underarm is slightly pink. I have no sores. I haven't had any discomfort to speak of, maybe mild itching a couple of times but I itched in other places too, so who knows. I do not feel fatigued. After rads yesterday, I hiked 12 miles up steep hills and felt normal. Not sure if my boosts are more gY per treatment, but I will ask on Monday. Total gYs are around 6000. My main complaint about all of this is that my shoulder muscles and tendons seem to be inflamed from the arm position. I still have all my range of motion, however it has become painful to extend my arm in front of me with any weight in my hand, and also overhead. But If I gently support my elbow with my other hand, I can move the arm without pain. I hope this will resolve once rads are over!",
      "MessageIndex": 2284,
      "PostDate": "27/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 27, 2016 02:50PM - edited Mar 27, 2016 02:57PM by Moondust Birdysmom, so did you have both chemo and radiation before surgery? How long after the radiation did the surgeon operate? Mary, thanks for the information about your bursitis. I bet that's what I have. It feels somewhat better today, probably because of the break from rads. I will consider a cortisone shot if it doesn't get better soon after I'm done. I won't know my chemo regimen until I see my MO after rads are done. My husband is going to Korea for 10 days on April 15, so I imagine they won't want to start me until he returns, because he's the only one who can drive me, etc. I am thinking the MO will say four rounds of TC, since that is what many ER+ women seem to get. You sure went through a tough chemo regimen! I'm already in menopause, and I have CRS, which is another version of chemo brain :) I hope it doesn't get much worse or I'll be wandering around without a clue!",
      "MessageIndex": 2290,
      "PostDate": "27/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 30, 2016 03:40PM - edited Mar 30, 2016 03:42PM by Moondust Duzy, for itching, I think it was said earlier that calamine lotion helps a lot. I see that Amazon has something called caladryl lotion. Must be a combo of calamine and benadryl. Windward, I have numerous skin spots spots under my breast that got a lot darker, and one new mole on my side. My RO said I should have a yearly head-to-toe check by a dermatologist, not because of rads, but just because. Barbe, sorry about the bladder infection! It may be that they can't miss your lung totally no matter what, but they are probably just hitting a very small area of it. Chances are you will have no side effects from it. My RO did the gated breathing for me because I told him I backpack at high altitude and climb mountains, so I need every bit of lung capacity I have. The marker they used is once again coming off on my bra. Good thing I have several old bras I can wear this week. My shoulder is still achy and painful if I'm not careful, but only three more treatments left!",
      "MessageIndex": 2348,
      "PostDate": "30/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 1, 2016 01:47PM - edited Apr 1, 2016 01:50PM by Moondust I see there is a Spring 2016 Rads forum created now. Some people may want to move over there. I wore a bra the whole time. It was a soft style with no wires or hard cups. I found some comfie ones at Walmart for not much money. If you are being advised not to wear one, you might ask if you can wear one as long as your skin tolerates it.",
      "MessageIndex": 2381,
      "PostDate": "01/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 22, 2016 07:08AM - edited Apr 22, 2016 07:09AM by Moondust Sunnyone, WooHoo!!! Congrats on being done!! Have an extra glass of the bubbly! Peabrain, I had terrible shoulder symptoms with rads, and I bet the wrist tendinitis is from rads too. My RO said my symptoms were not from the rads, but my PT said it could be possible to explain our symptoms if certain nerves are being affected by the radiation. Some of the nerves run the length of the arm and could cause many symptoms. I was feeling pain clear down to the elbow. My issues have almost completely resolved 2.5 weeks after boosts and 3.5 weeks after whole-breast. I hope yours gets better soon! Barbe, next Tuesday is so close! I'll be counting down with you! Adarkadaptedi, it is terrible that you lost your job. I appreciate that Native Americans suffered abuse years ago,but to exempt them from basic human rights type laws seems a little bass-ackwards. We almost looked at having a pre-fab home done by a business on a reservation, then discovered we would have no recourse if they took our money and gave us nothing.",
      "MessageIndex": 2558,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 23, 2016 02:33AM Moondust wrote: WooHoo, Sunnyone! Isn't it such a great relief to make that daily time your own again? I got a certificate and my lovely marker. Now I'm in limbo because my MO is sending me for a second opinion about chemo. She does not want to do it, but I still do. I will be going to UC San Francisco for the opinion. In the meantime I am going to enjoy the treatment-free days.",
      "MessageIndex": 2567,
      "PostDate": "23/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 23, 2016 03:07AM Moondust wrote: Barbe, I will be starting my AI today. I will take AI instead of Tamoxifen because I am past menopause. AI is actually more effective than tamoxifen. According to the Onco test, my risk of recurrence is 17% with tamoxifen and 14% with AI. I am very surprised that you were not put on tamoxifen with your first Dx! Maybe because they would have had to do ovarian suppression for you back then?? The reason I want chemo is because I do not believe my tumor biology will completely respond to the AI, which blocks the production of estrogen. I have 80% ER+ and 40% PR+. And a high Ki67% too. Compared to women who have 95% ER+ and PR+, it is much more likely that some of my tumor cells will not be controlled by the AI.",
      "MessageIndex": 2569,
      "PostDate": "23/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "May 1, 2016 02:12AM Moondust wrote: StefLove, I am almost 4 weeks out. My boob does not hurt, but then again, I don't poke at it very much. I do have lumps, but I know that they are either scar tissue or small encapsulated seromas which will eventually resolve. I'm giving it at least til my next BS appointment in August to just let it mellow.",
      "MessageIndex": 2595,
      "PostDate": "01/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "May 1, 2016 11:55PM Moondust wrote: Barbe, personally I would let it dry up. Hopefully you can get some medical advice tomorrow! Good luck!",
      "MessageIndex": 2606,
      "PostDate": "01/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "May 13, 2016 12:25PM Moondust wrote: Twinkl, what a great picture of you! Glad your vacation was good. My shoulder has returned to normal and I'm doing pushups again! I am still very tan on the radiated side. I have my follow up with the RO today. Barbe, how is your skin doing? Helen, the skin on my radiated breast is very tan and feels a little tougher. Let's see how it is a year from now. Glad you are recovering and feeling better! I have new lumps inside the breast but I think it is scar tissue. ",
      "MessageIndex": 2616,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 27, 2016 04:43PM Moondust wrote: Twnkltoz. I am using Miaderm. I like how it goes on but I do not like the smell once it's been on a while. It smells to me like I need a shower. Did you get it with the lidocaine or without? I'm still in my first week, so no lidocaine needed yet.",
      "MessageIndex": 1707,
      "PostDate": "27/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 28, 2016 05:38PM Moondust wrote: TwinklToz, I'm so sorry to hear that you've been feeling sad. This cancer stuff is awful. I try not to think about it at night, because that's when I'm tired and most vulnerable to negative thoughts. Pain and discomfort never helps, either. Do something nice for yourself! I hope you are feeling more positive now. Every day without the disease is a day to celebrate. Once you are healed up from all this, you'll be able to enjoy your days more. SeekingSerenity, welcome. I did not have Mx or chemo either. At least not yet. I like your idea of bringing your smoothie with you. What do you put it in so it doesn't leak? If I bring one, I'll have to keep it in a cooler because I have a 1 hour drive to rads. I eat high protein also. I wonder if it helps with skin. You have a super busy schedule! I get 15,000 steps a day but not all at once. Quiddler, hooray for finishing rads! And hooray for sleep. Musogirl, welcome. I hope it gets easier to tolerate all the nakedness and feeling of exposure as you continue. I'm not bothered by it, probably because I'm older and don't really give a crap what anyone thinks of me. It is uncomfortable to have my arm up because I have an arthritic elbow, but it's not terrible.",
      "MessageIndex": 1714,
      "PostDate": "28/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 2, 2016 03:32PM Moondust wrote: Peabrain, you are in my thoughts today. Hope everything goes great. Brimton, tell your RO you are stressed out. Ask how they can be sure there is no damage to the lung. I would be adamant if it were me, because I'm sooo concerned with not damaging anything besides the targeted tissue. I'm very surprised that you are visible to people in the hallway during treatment. Don't they have to close the thick door for radiation safety? My techs cover me with a thin blanket. I asked if the blanket affected anything because some women don't have any covering. He said it did not. I also asked about the Miaderm because of what Ag23 said about not using lotions at all. My tech said the reason they want it on at least 2 hours prior is so it is all absorbed. Otherwise it might cause a rash, but it would not affect the radiation dose in any way. Interesting (and scary) how different places tell us different things.",
      "MessageIndex": 1803,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 7, 2016 05:54PM Moondust wrote: Hooray for being done, Tessio. Bell or no bell! I hope your skin feels better very soon. Birdysmom, that's too funny about the glow in the dark boob! I might have to try that line some time. I do look at the machine sometimes but mostly concentrate on relaxing my shoulder so it doesn't hurt. Oh well, it was nice to have the weekend off. Back to the zaps tomorrow.",
      "MessageIndex": 1913,
      "PostDate": "07/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 8, 2016 08:37AM Moondust wrote: Congrats, Twinkltoz! What cute stuff your fiance got for you! (I'll have to show your post to my DH as a hint.) Kimmer33 and MissV, so glad you are done! I am 1/3 done. My RO presented my case at the weekly \"breast board\" meeting, (because last week I told him I had changed my mind about having chemo and want to have it). It gave me a good feeling that he thought my case had enough unique characteristics to have everyone look at it. None of them thought chemo was inappropriate. They decided I should not get adriamycin as part of my regimen because of the possibility of \"radiation recall\", where your radiated skin reverts back to looking and feeling like you were still being radiated.",
      "MessageIndex": 1924,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 18, 2016 06:21AM Moondust wrote: Congrats Duzy, Mary and DiDel!! You made it! Great photo, Duzy! Birdysmom, I love your kitchenaid cartoon! Biscuits, good luck with boosts. I'm sending healing (not peeling) light to everyone with skin issues. Don't forget to eat lots of protein - meat, greek yogurt, eggs, beans, etc.",
      "MessageIndex": 2162,
      "PostDate": "18/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 27, 2016 04:33AM Moondust wrote: Barbe, bursitis is a thought! Thanks. I will ask my physical therapist friend about that. I'm also going to get his recommendations for any exercises I can do, or whether heat might help. So far I haven't taken any meds for it, and maybe I should try an anti-inflammatory like ibuprofen (I call it Vitamin I). I have a whole bottle of the good 800 mg pills, but I take it only if pain might impact my sleep. Sometimes my knee gets bad from hiking up and down hills, and that's why I have the Rx. I haven't taken any in months. A couple of weeks ago I asked whether my back was in the field, and the tech told me to put Miaderm along my scapula as well, so I guess it is. So far no symptoms, and with only one more whole breast to go, I hope I'm not jinxing myself to think I won't get any there. I hope you are lucky too!",
      "MessageIndex": 2286,
      "PostDate": "27/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 6, 2016 08:17AM Moondust wrote: Thank you everyone for the congrats. I am still trying to relax and get used to not having to be at rads every day. KateB, glad to hear you are doing pushups again. I'm at the same stage as you for pushups. I used to be able to 20+ pushups and now it's hard to do 10. My shoulder got really tweaked by positioning it for rads. Now that I'm done, it is starting to feel better and I hope I can do more exercises with it soon. It sure feels good to be almost normal again. Windward, I've got the same black spots as you. Barbe, that's a grueling schedule for you! I'm glad your DH can drive some of the time, but it would sure be better to be able to sleep in your bed. I'll be doing a daily countdown for you! My office is just minutes from the cancer center, so the only long drive for me was from home to the center, then back home after work. But I've been doing the commute for 27+ years so I'm used to it. I listen to lots of podcasts and books during the drive. I'm doing a daily countdown for all those still in treatment! Now that I'm done, I want you all to get to the end too!!!",
      "MessageIndex": 2428,
      "PostDate": "06/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 10, 2016 11:42AM Moondust wrote: Katja and Kkubsky, hooray for almost being there!!! I finished boosts last Monday and the under-boob crease has continued to get redder this week. Under my arm has settled down and started a little peeling. But the under-boob area is still sensitive. As long as I don't rub it or pull on it, it's not bothersome.",
      "MessageIndex": 2460,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 11, 2016 02:24AM Moondust wrote: Thanks, Octogirl! Maybe your tan will fade by next year. like a suntan. I hope you have a fabulous trip!!!",
      "MessageIndex": 2462,
      "PostDate": "11/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 14, 2016 05:05AM - edited Apr 14, 2016 05:19AM by Moondust edwsmom, I baked cookies and brought them my last day of rads. I had previously ordered a breast cancer ribbon cookie cutter and made simple vanilla sugar cookies sprinkled with pink sugar. They loved 'em! Store bought would work too. Andra, I noticed a lot more achiness during rads. Worst was my right shoulder because of the arm position, but I also noticed it in my knees. I'm not taking AIs yet. My shoulder and general aches started getting better as soon as I finished rads. I'm one week out and feel almost normal. My shoulder is still not 100% but maybe 60% better. Kkubsky, BIG congrats!!! Hooray! Did you get a certificate? Katja, congrats to you too!!! WooHoo! Barbe, it's great to be in single digits!! The end of the tunnel is really bright now! I track everything I eat and have not gained or lost weight. But I did eat a little more during rads without gaining. I think Andra is right - we need a few more calories for healing. And maybe the radiation is zapping some calories along with whatever else it gets ;) (Just kidding).",
      "MessageIndex": 2492,
      "PostDate": "14/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 14, 2016 07:29AM Moondust wrote: Twinkltoz, I forgot to say congrats on the 7.5 pounds gone! Keep plugging away at it! That's how I lost mine - very slowly and a lot of maintenance months but never regaining more than 1 or 2 pounds before I started losing more. It's not easy!! Our bodies do not generally want to lose weight and our traitor brain starts tricking us into eating more if we try to go too fast.",
      "MessageIndex": 2495,
      "PostDate": "14/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 18, 2016 03:31AM Moondust wrote: DisneyGirl, I had both - tiny dot tattoos and marks covered by stickers. I lost two of the stickers over the course of treatment. I did not shower every day, and that probably helped keep them on. When one came loose, I would try to re-position it in the same spot and tape it on with medical tape. When I got to rads, I would tell the techs one was loose and they would re-do it.",
      "MessageIndex": 2528,
      "PostDate": "18/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 27, 2016 06:24AM Moondust wrote: Findaway, my surgical site got red during boosts and the week after boosts. Until then it was not red. The skin reaction can be one or two weeks delayed from the actual radiation on the area, I have heard. Lymphedema can occur any time after surgery, so it is very hard to say that yours was due to radiation. Unless they are deliberately radiating your nodes, you should not have any extra risk of lymphedema from whole-breast radiation treatment. My RO said that lymphedema can be a delayed reaction because after surgery it takes a few months for scar tissue in the lymph system to harden up and become a problem. I had some redness and tanning under my arm, but my RO showed me exactly where my lymph nodes were, and the field missed them by at least an inch. Don't be afraid to ask your RO for clarification.",
      "MessageIndex": 2579,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 25, 2016 09:02AM Moondust wrote: It is so interesting hearing everyone's different experiences. I guess that joint issues are either leftover from chemo (which I didn't have) or from the hormonal treatment (which I will have but not yet). I'll report on the state of my naturally creaky joints as I progress with rads. I get xrays every day too, but no blood work. I love my RO! He spent extra time talking with me today to explain exactly where I was getting radiated. They can produce any convoluted field shape, not just a circle or rectangle. This means they can selectively radiate only the breast tissue. They've probably never had a patient who asks as many questions as I do! Yesterday was my first treatment. They drew on me with a red marker. Later, after I applied Miaderm, the marker bled onto my bra. Wish they would have warned me - bras are not cheap!! Today they said that was a one-time only thing and any other marks will be small and covered by a sticker. Diane, good for you for speaking up about the linen vendor in the rads area. That's just not right! Martini, I too won't be starting hormone treatment until after rads. My MO said they want to keep the SE's separate. Hang in there, everyone. The end is in sight!",
      "MessageIndex": 1626,
      "PostDate": "25/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 27, 2016 02:17PM Moondust wrote: Barbe, congrats on being done!!! I'm so happy to hear that you are through!",
      "MessageIndex": 2584,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "May 2, 2016 02:23AM Moondust wrote: Sunnyone, I am happy to share anything I know! The second opinion paperwork, which has been transmitted to UCSF on the 20th, got \"lost in the mail\", which I didn't discover until I finally reached a live person at UCSF on Thursday the 28th. Leaving messages didn't work. My MO's office faxed everything to them again Friday morning. I think everything is back on track now. I had a voicemail from UCSF to call them on Monday. I hope they will see me soon, but I don't know until I call tomorrow. I am very curious about what UCSF will say about my case, and I will let you know! I started the AI just in case the second opinion agrees with my MO about not having chemo. I specifically asked her if I could start and then stop if I was going to have chemo, and she said yes. She said it would take about 2 weeks for the effects to wear off so that the benefit of chemo was not impacted by the AI. I am feeling pretty good so far, but I've only been on the AI for a week.",
      "MessageIndex": 2602,
      "PostDate": "02/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 3, 2016 01:53AM Moondust wrote: I show up 2 minutes before my appt and they take me right in. I've never had time to talk to anyone.",
      "MessageIndex": 1828,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 9, 2016 08:28AM Moondust wrote: Birdysmom, I love your photo! Windward, the initial setup was the worst session for me because of the length. I think the rest should be a lot easier for you. Marijen, I hear you on getting tanned from the inside out. That's exactly what I feel like for a few hours after each treatment - sunburn on the inside! KarenR, after the first treatment you shouldn't have too much more marking. My treatments are very fast now. El_Tigre, congrats on getting through it all. Thanks for the hugs! Twinkltoz, I'm jealous that you don't have to be anywhere! An endless weekend from now on! I have a nice tech. He feels like a friend. I guess I'm lucky about that. I confirmed today that there is no bell :( But I'll bring goodies!",
      "MessageIndex": 1956,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 13, 2016 03:52AM Moondust wrote: AG3, congrats on being done!! Hooray!! That makes sense about not suppressing the cancer cells. I'm sure that applies to chemo also, which I'll be having after rads. Well, I'm already old with stiff knees, and going off my HRT when I was diagnosed is giving me the same symptoms as most of you starting tamoxifen. I've been off HRT a little over 3 months. Maybe I should take it again to wake up the cancer so it can get killed! (Only kidding). Windward, I'd highly recommend Miaderm. It is not greasy, absorbs very quickly, and seems to be doing a fabulous job keeping my skin healthy despite the daily bombardment. I'm done with 14 zaps. Jan, that's nice to have music during your treatments. I'll have to ask if my place has that. They do have different color lights around the perimeter of the room. Duzy, looks yucky and painful! Hope it gets noticeably better each day!",
      "MessageIndex": 2072,
      "PostDate": "13/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 15, 2016 05:32PM Moondust wrote: JerseyGirl, congrats on recovering quickly! I'm liking the Miaderm too. Barbe, my MO said to take Vit D also, but based on what Katja said, I think I'll discontinue it until I ask. Sunnyone, make sure you ask your RO about the specific multi vitamin. Mine did not want me to take one during treatment. No extra supplements of anti-oxidants, which a multi vitamin is almost sure to contain. Katja, I am going to ask my RO about Vit D, because I'm still taking that. Thanks for the heads up!",
      "MessageIndex": 2117,
      "PostDate": "15/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 22, 2016 01:49AM Moondust wrote: Sunnyone, I think the lotion you should use depends on your individual skin. My skin does not seem to do well with any kind of vaseline-based product, which Aquaphor is. But a lot of people swear by it. I'm using just the Miaderm. My RO told me today that it is almost impossible to predict how someone's skin will react to rads. Many light-skinned people or redheads, who would burn in the sun, do just fine with the rads, and he's also had a few dark-skinned patients with severe reactions. Musogirl, I'm glad you will get a break. I hope it helps with the fatigue, and hope the B vitamins also help. Barbe, you will get through this! I only have one zapper machine, but it moves around from my left side to my right and zaps me from two different angles. Kkubsky, the first real session seemed to be the longest. I get extra xrays once a week, too, and that takes a few extra minutes. Today I asked my RO about Vitamin D. He considers it a weak antioxidant and said it is fine to take. He also recommended taking it with calcium. Five WB (whole breast) to go and five boosts.",
      "MessageIndex": 2229,
      "PostDate": "22/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 22, 2016 04:04PM Moondust wrote: Great news on the colonoscopy, kbutler! katja, I'm impressed with your daily walk. I walk a lot too. I think it has helped get through these rads. Tessio, great to hear about healing skin! I'm doing the countdown now. Today was 10, tomorrow will be 9.",
      "MessageIndex": 2234,
      "PostDate": "22/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 29, 2016 10:10AM Moondust wrote: Barbe, I think I had 5000 gY to my whole-breast, and will have 1000 to the tumor bed. I found out the boosts (staring tomorrow, yay!) will be electron beam. Lou53, the gift shop in my cancer center carries the Miaderm. But I think it is the same price online. I used two tubes. I haven't decided what to say about cancer. Right now I say I'm being treated for cancer so that it won't return. After I'm done with rads and chemo, maybe I'll say I had cancer and hope not to have it again. Or we could use the medical terminology - NED - no evidence of disease.  ",
      "MessageIndex": 2309,
      "PostDate": "29/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 30, 2016 12:50AM Moondust wrote: Looking good, Brimton!!",
      "MessageIndex": 2316,
      "PostDate": "30/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 31, 2016 02:03PM Moondust wrote: Windward, I thought the same thing about wishing I had made sure my arm would be comfortable before they did the initial setup.If they could just change the angle a little it would be a lot better for me. Kkubsky, hooray for making it to the halfway point!! I wear a supportive bra that keeps the girls from touching the skin underneath. I wear one to bed also.Just keep applying the cream as directed. It may look worse than it feels. Twinkltoz, sorry your shoulders are tweaked. But you're done at least.",
      "MessageIndex": 2358,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 4, 2016 02:50PM Moondust wrote: Tomorrow will be my last day! I'm excited! I usually go at 11 but tomorrow they moved me to 2:30. I wish it was the earlier time, but whatever, I'll take it! My skin under my arm and breast finally got red, but it doesn't hurt if I don't mess with it. Mary, good luck going back to work! Take it slow. Luzeelu, congrats on being done!",
      "MessageIndex": 2406,
      "PostDate": "04/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 5, 2016 01:31PM Moondust wrote: I finished today. Got a certificate plus they gave me the personalized marker which was used to draw on me. I got a big hug from my techs. Last night I made breast cancer ribbon cookies (with a cookie cutter I bought on Amazon) and took each of my dr's offices a plate of them. They were a big hit. Musosgirl, I'm sorry to hear how your scar is reacting to the rads. Not much fun :( I hope the break makes a difference. I would not want to miss any treatments, but I'm not in your shoes with the pain and SE's, so I can't say how I would feel in your place. Twinkltoz, congrats on the weight loss! Stay on track - it's like rads, just take one day at a time but stay consistent. Barbe, Andra, Sunnyone, and everyone else in active treatment, hang in there!!! The end is in sight!",
      "MessageIndex": 2414,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 15, 2016 03:13AM Moondust wrote: Barbe, you are right about under the bra line. That is my worst area, the only place that is still red. But it is starting to peel and it is not painful. My (large) breast definitely looks \"cooked\" and tan. It seems to be a bit swollen but is supposed to shrink as time goes on. I get a few pins and needles in it now and then.",
      "MessageIndex": 2506,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 15, 2016 10:25AM Moondust wrote: Congrats to Andra and Musosgirl!! You made it!! Can't help with your question, Sunnyone. I only used Miaderm.",
      "MessageIndex": 2515,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 25, 2016 12:56PM Moondust wrote: My skin is getting better and I have finally quit using the Miaderm. Sunnyone, I have started taking a generic for Arimidex. Tonight will be my third pill. Twinkl, sorry to hear how achy you are :( Just keep doing as much as you can - exercise is supposed to help. My shoulder is finally feeling 80% better but not quite normal.",
      "MessageIndex": 2577,
      "PostDate": "25/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "May 1, 2016 02:47AM Moondust wrote: Barbe, my surgical site got much redder the week after boosts. But the pus you have is disturbing. I would definitely give the office a call about it! Silvadeen seems to be what a lot of women have used for weeping areas. Good luck and keep us posted!!",
      "MessageIndex": 2597,
      "PostDate": "01/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Sep 24, 2016 09:14AM Moondust wrote: I had chemo after rads and finished up on August 10. Aside from no hair, my main complaint is swelling in my radiated breast. It is much bigger than my other one. I thought it would be over that by now. I just saw a lymphedema specialist who thinks it will resolve over time with compression. She gave me several compression pads to wear and showed me manual fluid drainage.",
      "MessageIndex": 2640,
      "PostDate": "24/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Nov 24, 2016 03:45AM Moondust wrote: Mary, I'm so sorry to hear about the two grandmas. :( I still miss my mom and mother-in-law after many years. Congrats on losing the 23 pounds and completing the 5K's! That is really great! I'm dismayed that you are still having so many side effects from chemo. Are you taking any supplements to help with the neuropathy? I still have some fatigue from my chemo, but I only ended in August. My radiated breast is still huge compared to the normal one. I question whether it will ever shrink like \"they\" claim. Happy Thanksgiving to everyone!",
      "MessageIndex": 2649,
      "PostDate": "24/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "May 13, 2016 07:59PM Moondust wrote: Sunnyone, I get my second opinion next Tuesday the 17th at UCSF. I'll post an update once it's done and I have the recommendation. My MO will not give me chemo unless the second opinion agrees with me that I would benefit.",
      "MessageIndex": 2619,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "May 19, 2016 01:50AM Moondust wrote: Sunnyone and whoever else was curious: I had my second opinion at UCSF yesterday with Dr. Mark Moasser. He was very nice and straightforward, which I always appreciate. Yes, chemo will benefit me. If he was in my shoes he would do chemo. It will reduce my recurrence risk by 7 to 10 percent. As far as my pathology, he thought the high Ki67 was more concerning than my 40% PR+. My local MO would not even factor in the Ki67, because \"we don't look at that any more\". But basically, this doctor's viewpoint is that the Onco score is what you go by, and anyone above 25 should consider chemo except if there are health reasons to not have it. He talked about the TailorX study and pointed out that for purposes of that study, anyone over 25 was considered high risk and automatically got chemo instead of being randomized. I felt very good about the visit. Tomorrow I'll see my local MO to formulate a plan. She said she would give me chemo if the second opinion agreed with me, and I hope she has not changed her mind. Dr. Moasser recommended the common regimen of cyclophosphamide and taxotere, 4 infusions 3 weeks apart.",
      "MessageIndex": 2623,
      "PostDate": "19/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Jul 7, 2016 03:30PM Moondust wrote: Hi Mary! Thanks for checking in and glad to hear your surgeries are over. I hope your infection and swelling clear up soon. It is hard to stop worrying about any swelling we have. I'm done with the second of four chemo infusions. So far things are going pretty well. I am very lucky that my part time job ended just a few days before my hair fell out :) Now I am fully retired.",
      "MessageIndex": 2630,
      "PostDate": "07/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Feb 26, 2016 02:30PM Moondust wrote: Shopgal, congrats on getting through rads. I know we all go through wondering if our treatment was enough, and we all have to wait and see. It looks like you did everything you could, so try to put it out of your mind and enjoy the time until the next mammo or scan or whatever. Feeling good counts for a lot! Even with my garden variety cancer I wonder if I need to do more. Peabrain, not everyone does the breath holding. I think if you are having rads on your right side or in the prone position you wouldn't necessarily have to. It is a technique used to protect the heart mostly, although I'm doing it to protect my lung on the right. HH and Kate, my RO is tall and thin also! And young. I'm glad we get a break on the weekend. Even though this is my first week I'm looking forward to it. ",
      "MessageIndex": 1668,
      "PostDate": "26/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 2, 2016 08:30AM - edited Mar 2, 2016 08:30AM by Moondust Brithael, watch out for that red marker. It bled all over my bra! I will have to look up Radiaplex. Andra, your pattern is exquisite!!! I love it! I like the Miaderm (even getting used to the smell now), but I don't think I'll try aquaphor because my skin has never liked the vaseline-based lotions. See if your RO will give you a technical explanation of why their treatment is the correct one for you. Remind them you are an athlete! Mine would not normally have done the gated breathing for my right side treatment, but when I told him I spend a lot of time over 10,000 feet he agreed to do it. Brmiton, I got the same line from my techs when I asked some questions. But my RO came in when I was done and answered them for me. Kate, so sorry you are sick :( I hope the upcoming nice weather will help you kick it! Good luck this week, everyone. I'm thinking serene thoughts for everyone!",
      "MessageIndex": 1771,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 2, 2016 07:49PM Moondust wrote: 7of9, I am also doing chemo after rads. What is the reason you are doing it in that order? My reason is because I changed my mind about chemo after doing more research. Glad to hear you are doing okay with rads on day 15! I had day 6 today. Mdoc, after you mentioned Joey Feek, I looked it up, because I didn't know about her cancer. I don't follow the news much. Such a beautiful person, inside and out, and what a lovely couple. I was fortunate to see them live a few years ago when they were touring with Zac Brown. I got teary-eyed too, especially watching some of the videos in Rory's blog.",
      "MessageIndex": 1816,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 12, 2016 12:07PM Moondust wrote: Happy Friday, everyone! One more down. Congrats to everyone who has recently finished! I would definitely be questioning any difference in the alignment of the zapper. So far mine has been in the same two positions each time. I personally would not accept an answer like \"don't worry about it\" and I'd ask to talk to the RO before my next treatment. JMO.",
      "MessageIndex": 2066,
      "PostDate": "12/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Mar 15, 2016 08:25AM Moondust wrote: Jodes, hope your first treatment went well. Does Herceptin have fatigue as a side effect? I'm doing okay so far with just rads. I'm not noticeably more tired. Twinkltoz, so glad to hear your skin is improving! Dancing - that sounds so fun. Brithael, good luck tomorrow. My place uses Miaderm. I wonder how it compares to radiaplex. Half done now, Two more weeks whole breast, then boosts.",
      "MessageIndex": 2097,
      "PostDate": "15/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 15, 2016 01:28AM Moondust wrote: edwsmom, I agree with Andra. Tell them no. I think your skin (and everything) heals just enough over the two day break to help you get through the next week. In fact, I'd tell them I need two days off, not one. My guess is that they are doing it for scheduling, not because it's better for you.",
      "MessageIndex": 2504,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 15, 2016 04:23AM Moondust wrote: My short haircut was scheduled for yesterday, but didn't happen because the stylist was sick. I'm rescheduled for Monday after my MO appointment. It's my first cut in over 20 years. I'm nervous, but if I hate it I don't have to wait for it to grow out, just to fall out :)",
      "MessageIndex": 2510,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Moondust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227786/profile",
      "Content": "Apr 23, 2016 04:59AM Moondust wrote: Barbe, you really received substandard care for your first Dx!! That upsets me! And for your CT scan, wouldn't a radiologist read it and give the report to the onc? One or the other doc missed it, that's for sure! Hopefully now that you are on the AI, your bone met will be stable. I do not trust my MO's opinion that chemo will not benefit me. She seems to be behind the times, especially for one so young. There are no health reasons I shouldn't have chemo, and it WILL reduce my recurrence risk. We have to be our own advocates these days.",
      "MessageIndex": 2571,
      "PostDate": "23/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}