{
  "AuthorID": "moonchild64…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73394/profile",
  "Posts": [
    {
      "AuthorID": "moonchild64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73394/profile",
      "Content": "moonchild64 wrote: I will be finishing up the last four of my 36 radiation treatments next week and I thought I'd share a technique that the radiologists at the hospital used for most of my 28 whole breast radiation treatments. I have been able to avoid chafing/burning in the area underneath my breast - in the fold - and have worn a bra throughout the treatment. I am a 36D and wanted to avoid going braless if at all possible - I need the support! The technicians took a long piece of medical tape and lifted my breast up so the fold underneath was exposed, then taped it diagnonally across to the arm brace.    I do not know the particulars of why this worked, but it does.  Not sure if this is standard practice or not, but thought I'd share and possibly help others avoid some of the radiation SEs. Dx 5/13/2008, IDC, 1cm, Stage IB, Grade 3, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725866",
      "Title": "Taping to Avoid Burning/Chafing Underneath Breast moonchild64 nancy258"
    },
    {
      "AuthorID": "moonchild64…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73394/profile",
      "Content": "Dec 23, 2008 05:48AM moonchild64 wrote: The technicians began lifting my breast with the tape about a week into rads.  It felt a little odd and a bit awkward, but I didn't make a fuss as they are the experts :)   When I was getting absolutely no burning or peeling underneath my breast, that was testament enough for me.  I now have proof that the technique works because when I had  my 8 boost treatments, my breast was not lifted and that is when I started getting burning underneath.  Wish they had just continued 'the lift' throughout. The nipple area was extra sensitive from the tape going over it and as the treatments continued, it did hurt to pull the tape off ~ I did not notice any 'protection' from the tape as far as tanning/burning... FYI -  Aloe Vera worked great for me. As far as other SEs, I did experience some fatigue the last few weeks, but tried to take a brisk walk at least 10-15 minutes after treatment as I was told that this would help with energy.  I am a single mom and being a couch potato is just not an option",
      "MessageIndex": 3,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725866",
      "Title": "Taping to Avoid Burning/Chafing Underneath Breast moonchild64 nancy258"
    },
    {
      "AuthorID": "moonchild64…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73394/profile",
      "Content": "Nov 8, 2008 05:24AM moonchild64 wrote: This is an interesting topic and one I have contemplated since my dx in May.  I have been a single mom for 13 years (my daughter is now 15) and my ex/her dad died in an automobile accident in 2001.  I am not sure if there was more stress with him in our lives or if being a 24/7 single parent is more stressful. No doubt either scenario does not equal bliss.... but is there such a thing anyhow... and how much stress is too much for our bodies to handle? Although I do not have a boyfriend/partner in my life, my support system of family and friends is wonderful.  And since my diagnosis I am breathing more deeply (I think I had forgotten how to exhale!) and learning how to say no.  I pray that this was a one-time event in my life and with my daughter learning to drive and becoming more independent will mean that I can focus a little more time on taking care of myself... Blessings to all...",
      "MessageIndex": 29,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723726",
      "Title": "Does desperation play a role in developing breast cancer? HeatherBLocklear dlb823"
    },
    {
      "AuthorID": "moonchild64…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73394/profile",
      "Content": "May 16, 2010 07:09AM moonchild64 wrote: Hi Linda - thank you for your response to my post.  I also had Taxotere and UGH is right....  I never thought I'd be this far out of treatment and still have SEs....  I see my onc this week for my 3 month follow-up so hopefully she can provide suggestions for relief.  I have read about the L-glutamine ... it's a worth a shot..  Thanks again, Linda... also wishing you well and well-ness  :) Michelle",
      "MessageIndex": 3,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/752576",
      "Title": "Peripheral Neuropathy - 18 months post treatment? moonchild64 dtad"
    },
    {
      "AuthorID": "moonchild64…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73394/profile",
      "Content": "May 19, 2010 08:16AM moonchild64 wrote: Ladies - thank you so much for your replies to my post.  I always know I can come back here and share what's going on.. not feel alone...  we are here for one another and that is reassuring and comforting. ((( Hugs ))) to all...",
      "MessageIndex": 11,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/752576",
      "Title": "Peripheral Neuropathy - 18 months post treatment? moonchild64 dtad"
    },
    {
      "AuthorID": "moonchild64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73394/profile",
      "Content": "moonchild64 wrote: I am continuing to experience 'after' effects of chemo/tx (last TCH 10/08/Radiation 12/08/Herceptin 6/09) and am seeking guidance from others who may have experienced this as well. I have debilitating foot pain, especially in the morning.  I also find that I am dropping things more, feel off balance at times and even more of a clutz than I was pre- treatment   Has anyone experienced delayed neuropathy after treatment? I was recently laid off from my job and really started noticing more pain after that - wondering if stress is a contributing factor and caused the flare up? Any guidance would be welcomed and appreciated! Michelle Dx 5/13/2008, IDC, 1cm, Stage IB, Grade 3, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/752576",
      "Title": "Peripheral Neuropathy - 18 months post treatment? moonchild64 dtad"
    }
  ]
}