{
  "AuthorID": "morelandks",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
  "Posts": [
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 15, 2016 02:03PM morelandks wrote: Hang in there Kimmer33. I've reall struggled with fear too, especially at the beginning of each new phase of treatment. But it's always gotten better after that - even when I had problems in treatment, somehow it was easier to be dealing with a known thing than being afraid of all of the what ifs. We are all with you in this! Please let us know how tomorrow goes. (PS - tomorrow is #19 of 33 for me, so I am smack in the middle of it all!",
      "MessageIndex": 1335,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 16, 2016 04:30PM morelandks wrote: adarkadapetedi - I've lived in Chicago since 1995 bit don't remember ever being at Neo - thanks for reaching out",
      "MessageIndex": 1386,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 17, 2016 11:20AM morelandks wrote: Hi Brightsocks - I do not feel ill on the table or after (today is #21 of 33, so I assume it would have shown up by now if it was gong to be an issue). I do feel dizzy regardless of where I am when I take Ativan. I am fiend about hydration - I drink 2-4 liters of water a day, on top of whatever else I'm drinking, and for me, I know it makes a big difference in how I feel (so far my skin has held up really well too). Obviously, I can only speak to my own situation - everyone's experience and needs are unique, so talk to your docs and persevere in doing whatever you gotta do to feel better. (PS - what color are those socks?? :-)",
      "MessageIndex": 1422,
      "PostDate": "17/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 5, 2016 07:55AM morelandks wrote: *** DING DING DING DING DING **** Last zap was at 2:12pm today!!! I took thank you cupcakes for the entire radiation therapist team (literally - spelled out on top of 24 cupcakes - TH-A-N-K-Y-O-U-!-[heart]-[heart]-[heart]-[heart] - x2). My facility doesn't have any actual bells or finishing ceremonies, but I shared lots of hugs and thank yous. I wish I could give a thank you cupcake to each of you for sharing your stories and holding my hand through mine. I really, really needed the support this board provided through rads. Mdoc - thank you for administering this board - we are a lot to keep track of!! I hope you feel better, and look forward to finding you on an AI board. Tessio - I hear your bells ringing too!!! Warrior on with Love!! Kim PS re some prior thread details: - Re my horrible RO: the thing that was so difficult is that I didn't speak up when my bad interactions (yeap - not an isolated incident) happened with her (yeap - bad RO is even a \"she\"). I just didn't have it in me and felt intimidated, which is not how I am used to being in the world (yeap - more identity crises!). I did however respond honestly when I was asked to give feedback this week - the administrator was as horrified as you all are. And she said the same thing: she reminded me that I am the captain of this cancer treatment ship and have every right to switch physicians or otherwise get help. So ladies - REMEMBER - you are the captains of your ships!! Or rather, the Executive Chefs in your KitchenAid kitchens!! - Re the brain: I have no idea if my current lack of analytical ability (compared to pre BC) will continue or not. I think my problems are left over from chemo, compounded by the Fatigue Truck. My concern with HT is that I thought decreasing estrogen levels also are associated with memory loss and other cognitive difficulties, but maybe that's not quite right. Suz-Q and Fearless195 - thanks for indicating no major side effects from your AI experience - truly heartening!! I, too, will start with an AI - not sure which one - (I can't do Tamoxifen due to blood clot risks) once my ovaries are under control, so at least there is some hope of it not getting worse. Peabrain - I too have a complex job with significant responsibilities - I literally have no idea how I'm going to be able to handle things once I'm back full time, but maybe it will all just be different - more letting go, less worrying. That is my hope, and most days I can fight to hold on to that hope. But when days like yesterday come around, it is so truly helpful to share my fears with you all and know that they are heard and cared for. Peabrain - recover well!! ",
      "MessageIndex": 1865,
      "PostDate": "05/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 12, 2016 12:26AM morelandks wrote: congratulations 2mnykds - sending big virtual hugs back to you",
      "MessageIndex": 1230,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 12, 2016 07:59AM morelandks wrote: yes indeed giant kitchen aid! I like watching the collection of thin blades moving around behind the glass plate as the beam is adjusted during the zapping. It's almost like a dance",
      "MessageIndex": 1239,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 12, 2016 12:02PM morelandks wrote: Sailorgirl1 - thank you so much for reporting back about your Drs visit. I have sometimes felt shut down by my RO - almost like she didn't want to hear about anything other than skin symptoms. After hearing from you I am going back to speaking up! I truly believe that my doctors have my best interests at heart and want to be helpful, so why on earth is it so hard to \"get there\"? I think navigating the info and confusion is a huge chunk of what makes the whole BC process so painful and scary",
      "MessageIndex": 1253,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 13, 2016 11:27PM morelandks wrote: yeah the costs - the one that really got me was how much a single neulasta shot cast - something like $15k after the Aetna negotiated discont (!",
      "MessageIndex": 1310,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 18, 2016 07:35PM morelandks wrote: Oh Ladies - I am so sad! I managed to leave my wedding ring at the hospital yesterday - lost somewhere in the Ativan haze of my last \"long day\" on the table. We've been married 25 years. I've lost my wedding ring to cancer, for crying out loud! Waaaahhhhhh",
      "MessageIndex": 1465,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 6, 2016 05:02AM - edited Feb 6, 2016 05:11AM by morelandks Hi there - oh wow - how fabulous to know we're not alone in this! Please add me to this group. I started rads on Jan 18 and have 33 treatments planned (eek!) - good to see there are a few of you on this list in the same boat. Had trouble with the positioning (I have back issues that make laying on that hard table a real struggle), but we seem to have sorted that out (I take Ativan for the port film days). I also am struggling a bit with nerve pain in my arm (left over from my surgery), which the arm holders exacerbate - have been prescribed gabapentin to help with this if I want, but so far I am just toughing it out as I'm trying to keep the meds to a minimum. No significant skin effects as of yet, but I'm at tx 13, which is still reasonably early in the process. MY TIP: Make sure you take whatever time you need in your mapping session to get into as comfortable a position as possible for you, before they do the CT scan (i.e., wedges under knees, towels under head, different angles / heights for the arm holders, etc.). I didn't really understand until afterwards that I would not be able to alter / adjust ANYTHING about the position during the treatments, even by a smidge, and now I'm stuck.",
      "MessageIndex": 1102,
      "PostDate": "06/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 20, 2016 02:09AM morelandks wrote: Thanks so much to all for the virtual hugs re losing my ring . Since you asked, no, I am not required to remove hand jewelry for tx (just any necklaces) - I'm just really, really foggy with the fatigue and then it was an Ativan day to boot, so I left it in the washroom or changing area. In some ways it is an inconsequential loss, but it hits all my emotional buttons of loss and of feeling so much less myself due to SEs and blah blah blah. So, thank you for letting me whinge at all of you and for responding so kindly. MAIRWE - re tatoos, I agree is totally your choice. I really did not want them either, but got them because my docs insisted. They said it helps ensure the precision of the zapping (ok, they didn't use the word \"zapping\") - they really care about getting down to the millimeters and covering exactly and only the targeted areas, and, well, I obviously care about that too. The tats are extremely small and not that noticeable - look kinda like freckles. So, I decided to go ahead with it, and maybe I'll have the top one removed if it bugs me after everything is healed up. Today is 23 out of 33 for me (and the last 8 are boosts, so I only have a couple more of the big area comprehensive zaps - \"big area\" includes my whole right side chest and clavicular node area). I am experiencing extreme fatigue (slept 12 hours last night and I still feel like road kill this morning), but minimal skin impacts - some scattered splotchy redness, some itching around my collar bone and center breast bone ( i.e. those areas that have had'some sun exposure over the course of my life) and some soreness around and under the nipple. Overall I am amazed at the relative mildness of my skin reactions, especially given how fair skinned I am (seriously - fish belly white - I have a hard time finding makeup pale enough and I'm all about SPF 50 but still get sunburns, etc.). So, for those of you starting out with rads, take heart! There is a wide range of SE experience possible, and maybe it will be awful, but maybe it won't! Have a restfull weekend everybody and virtual hugs back! Kim",
      "MessageIndex": 1489,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 4, 2016 02:20AM - edited Mar 4, 2016 04:53AM by morelandks Thanks so much to everyone for singing the blues on this board (especially you, Twinkltoz). I have been so down the last couple of weeks - it's comforting to have all the encouragement of thesisterhood! I concur, rads is much harder emotionally than chemo. For me I think it's partly because I'm just so dag gum exhausted - worn out coming into rads, and then radiation fatigue on top of that. Also, with chemo, I could feel the progression of each cycle - at the end of each one I got to feel better, which gave me a sense of getting through it. With rads, I just keep feeling worse worse worse - and then with the everyday-ness, it wears me down. Tessio - I'd love to join you on the beach at Club Cabbage - thanks for the giggle! Twinkltoz - re boosts, my skin outside the boost area started improving right away, but the fatigue still dogs me. My RO says it take a couple of months to start feeling better",
      "MessageIndex": 1832,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 4, 2016 02:45AM morelandks wrote: Jersey girl - CONGRATULATIONS!!! I love the \"woohoo\" of your post and wish I could have seen you dancing around that med center (I truly hope it was in a goofy gown. . .)",
      "MessageIndex": 1834,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 4, 2016 02:50AM morelandks wrote: Peabrain - I am considering ovary removal, so yes, am interested to know how it goes for my own reasons, but also interested just to know how you are doing! (as I'm sure the whole board is!)",
      "MessageIndex": 1835,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 4, 2016 02:59AM - edited Mar 4, 2016 03:15AM by morelandks Ag23 - My RO was very restrictive with creams, but not to zero. They gave me a light, fragrance free moisturizing cream, said to use absolutely nothing else, and to apply it 3 times daily, but not within 2 hours of treatment as they wanted the skin completely clean / naked for the zapping (okay, they didn't say \"zapping\"). I pressed re why, and all my RO would say is that it is \"their preference.\" My skin has held up extremely well - only medium redness and no blistering after 31 of 33 treatments (25 of which were full breast plus clavicular node zaps, so big area treated). PS to the board - my RO is just awful - actually has yelled at me for asking questions (!). It is so nice to hear that there are wonderful, communicative RO's out there that you love - gives me hope for the profession! (PPS to the board - I'm obviously catching up after a few days off - sorry for all the separate posts but it's the only way I can manage to keep track of all y'all!",
      "MessageIndex": 1836,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 4, 2016 07:19AM morelandks wrote: Twinkltoz and Creativevintage - thank you for the words of encouragement - I really needed them today! I, too, have have been overwhelmed by how much love and care appeared for me with my diagnosis - and I don't mean the frilly silly platitude kind, but the soul-affirming, in the grit, I-really-know-you kind. What I've been so down about is the thought that living like this - feeling like this, complete with full on brain damage (!) - is going to be the state of affairs for the rest of my life. My road is a bit different, as I have to move on to hormone suppressants and ovarian shutdown after rads are done (anyone else in this boat??? would love to know which hormone therapy board(s) you are participating in)) - these also bring fatigue and cognitive difficulties, so today, I just couldn't cope with the thought that it will never end. So, to hear that things do improve and that at least someone is able to get back to the pre-BC \"her\" is so encouraging. What did I do to make myself feel better? Got off discipline and went and ordered myself a fancy birthday cake (indulging in a sample or two!) - my 50th is coming up in April, and in a fit of silliness I decided to throw myself a party. Thank goodness my MO is ok with delaying the start of HT until afterwards",
      "MessageIndex": 1840,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 4, 2016 09:52AM morelandks wrote: oh I wish I had thought of the hair funeral! Hah! what a great idea.",
      "MessageIndex": 1842,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 11, 2016 11:50AM morelandks wrote: Wow this is an active board! I hadn't checked for a couple of days, and it took me an hour to get caught up. I know we are each alone in that room with the machine every day, but knowing there are so many of us going through it at the same time is so comforting - makes me feel like I'm part of a team! Thanks for being so communicative. Today was tx 16 out of 33 (which includes 8 boosts), so, along with JerseyGirl22 I am celebrating half way - hooray! Twnkltoz and Tessio - I think you are also on a similar schedule? So far, my skin SE's are very mild (just beginning to pink up, a smidgen of itchiness near my collarbone, and some soreness down my side). I have however had occasional shooting pains through my breast since week 2 - these occurred near my scars, so I wonder if its the rads causing things to pull apart or if the beams affect scar tissue differently. In any case, these pains are annoying, but not debilitating, so I count them as mild also. Re: Treatment Time: On a normal treatment day I am on the table for about 10 minutes, 6 of which are the actual zapping. However, every 5th day they also take x-rays (to see if the beam angles need to be adjusted to allow for any tissue changes that occurred during the last week) - on these days I am on the table for about a half hour. Which brings me to the Drugs topic. . . Re: Ativan: I have back problems and continuing nerve pain in my arm from my surgery, both of which make hanging out in that ridiculous position on the table a bit of a challenge (they have me face up, arms overhead in arm rests, lying on a very hard muscle-spasm-inducing surface). On my first X-ray day I ended up sobbing in the arms of my tech - a very nice guy in his 50's who has been doing the job for 20 years - and there he was whispering sweet nothings to me in is strong Chicago south side accent (he even called me \"doll\" - who does that anymore?). Not my most dignified moment, to say the least! Anyway, my RO prescribed Ativan as a relaxant - she told me that it would help relax my mind and my muscles and that they use it for a wide variety of patients who have trouble being on the table for whatever reason. I take it only on X-ray days, as it also makes me slightly nauseous and dizzy (which is kinda fun on the table - makes the table feel like a boat swishing back and forth on the waves!). I agree with all of you saying \"just do what you gotta do to get through this!\" Re: The Fatigue Truck: It's definitely hit me too - and I agree that it is strange. After months and months of only sleeping a couple hours at a time (surgery, chemo, blah blah blah - I know you gals can all relate!), I am now sleeping most of the night, and sleeping hard. But when I wake up, I am still exhausted and spend most of the day just drooping through. I do have bursts of energy, but I am learning that they are not signals that the fatigue truck has driven on. I am trying to continue to exercise on occasion (I am a total sloth, so getting 30 minutes of simple walking on my elliptical machine is a major feat!), and when I do, it does make a difference - I have more stamina and the drooping isn't so pronounced. Also, I am trying to pace myself - not take on too much for any one day. I definitely do not have this one figured out. Re: Palate / Diet: I too have noticed a strange, metallic taste in my mouth the last couple of days. I don't see how it can be directly related to the rads, as none of the beams are going anywhere near my teeth, but I also can't think what else could be causing it at this point. Anybody else had the same thing and/or have any insights? For diet, my docs have said \"normal healthy diet\" and \"avoid anti-oxidant supplements\" (but they are ok with antioxidant foods - not sure why, but all they care about is not taking the pills). My WBC has been in the low end of normal, even during chemo (when it dipped a bit below normal but not much), so maybe sushi etc is not as much a concern in my case. I pray for peace and joy for each of you - I am finally at the point in this process where I believe I will, in fact, get through it, even if the parade of horribles has yet to cease. I know you can get through it too. Kim (morelandks)",
      "MessageIndex": 1217,
      "PostDate": "11/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 11, 2016 11:57AM morelandks wrote: Hang in there Duzy! My understanding of the creams is that they help with hydration, which helps the skin stay intact and get through the bad sunburn in better shape. So keep lubing up!",
      "MessageIndex": 1218,
      "PostDate": "11/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 12, 2016 11:54PM morelandks wrote: Congrats Linda - and thanks for posting the pic! It's great to see your smiling face",
      "MessageIndex": 1262,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 13, 2016 12:10AM morelandks wrote: TallnTerrific - I too wonder when I will feel ok, sometimes I'm haunted by this question. But what I really wonder is what is my \"new normal.\" I suspect that I will not return to the pre-BC me (which in some ways is a good thing) and I have some anxiety around which physical symptoms will get better and which I'm stuck with. When I get worked up, I, too, pray, and I try to bring my focus back to how He is caring for me today. All I know for sure is that a year from now we will feel a whole lot better than we do now, it's just a question of how much. PS - how tall are you? I'm 6'1\"",
      "MessageIndex": 1263,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 13, 2016 03:26AM morelandks wrote: hooray for half way tinkltoz! Hang in there - I'm sorry you had a rough night",
      "MessageIndex": 1270,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 16, 2016 02:34PM morelandks wrote:  Beanie-induced hat head has been showing up for me too Peabrain! Here I am, 8 weeks out from my last Taxol dose, and occasionally going capless despite my resemblance to something that should appear in a Star Trek episode . . .",
      "MessageIndex": 1380,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 16, 2016 09:59PM morelandks wrote: Hi Marjen - I take Ativan prior to treatment on my longer-on-the-table days. For me, its purpose is as a muscle relaxant. SE's for me on a 0.5mg dose (I am crazy sensitive to meds) = dizzy woozy, and for a little while a bit of room spinning thrown in. Effects wear off after a few hours although I'm groggy for a while. I hope it helps with your nausea - my RO says they use it frequently for lots of different patient situations and have good results. I was very reticent about it too (and also thought they gave it to me because they thought my muscle issues were all in my head - turns out they did not think this), but it has worked well for me.",
      "MessageIndex": 1405,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 16, 2016 10:04PM morelandks wrote: mdoc524 - I'm not able to\"get\" my hair to do anything - it has a mind of its own!! happily for now, it is inclined to (a) grow and (b) grow relatively straight which leads to (c) staying down. I do wake up with some crazy bed head though :-)",
      "MessageIndex": 1406,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 17, 2016 11:03AM morelandks wrote: Kate you are rockin the buzz cut do! I love the specs too. congrats on getting to double digits on your rads tx road",
      "MessageIndex": 1421,
      "PostDate": "17/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 20, 2016 03:15PM morelandks wrote: Congratulations Tallnterrific!! Unfortunately I have to pass through the Tamoxifen lounge before heading over to AI, so I may miss you on the next board, but will keep you in my prayers. Woohoo",
      "MessageIndex": 1510,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 21, 2016 01:05AM morelandks wrote: Hugs hugs hugs Twinkltoz! 3 more would feel like 100 for me too - there's just something seriously frown inducing about having the goal line moved. We understand",
      "MessageIndex": 1514,
      "PostDate": "21/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 4, 2016 02:39AM morelandks wrote: Kate - I told my techs about the KitchenAid analogy and they burst out laughing - never thought of it before. And then they said it will REALLY look like a mixer when I get to boosts, as they put this extender / cone thing on the \"head\" of the machine. I fondly great my KitchenAid every time I walk in the room. And I am into the boosts now, and can report that my techs were right! Tessio - I finish this week too - 32 down,only one more to go!!",
      "MessageIndex": 1833,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 12, 2016 08:33AM morelandks wrote: Hi Marjen - I feel better (so far) on rads than during chemo, for sure, but I can also feel the cumulative rads starting to drag me down, so overall, I'd say no, not feeling better on rads. Also - back to the bad taste in mouth thing - I mentioned to my RT that I have a metallic taste in my mouth, and she said she has heard that before, so apparently we're not imagining things",
      "MessageIndex": 1243,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 20, 2016 09:24AM morelandks wrote: I found my ring!!! ",
      "MessageIndex": 1502,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Feb 20, 2016 09:27PM morelandks wrote:",
      "MessageIndex": 1526,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "morelandks",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228322/profile",
      "Content": "Mar 5, 2016 03:14PM morelandks wrote: MissV - giant sloppy teddy bear hugs to you!!!! I too have not felt the elation I expected when I finished up today, and yes, it's because after meeting with my MO on Monday (who is such a wonderful, wonderful woman and doctor!), I realized how far I have to go. I am concerned about the next phase and all the potential SEs, but as I'm reading the boards for HT, it seems there are many who have very mild SEs and tolerate it all very well. So take heart! What I'm reminding myself is that I have just as much reason (if not more) to be hopeful about what's next as I do to be fearful, so I might as well choose hope. (And no worries about a Debbie Downer post - that's what we're here for - and that's where I was yesterday). Marjen - my goodness, I truly hope and pray that you feel better soon. I can't imagine having to cope with rads and all the other stuff at the same time. Lots of liquids and sleep sleep sleep! Hang in there (love the emoticons!).",
      "MessageIndex": 1876,
      "PostDate": "05/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}