{
  "AuthorID": "motheroftwins",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
  "Posts": [
    {
      "AuthorID": "motheroftwins",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
      "Content": "motheroftwins wrote: Hello everyone, I am a neebie. I have been watching this now for a month, Well since June 15 actually. First off, about myself.  I am 37 and my mother died of breast ca at 56 dx at 50 stage 4, and all four of her sisters have breast ca too, I am the only girl in my family. No first cousins with breast ca yet, One first cousin did die last year at 38 with colon ca. I had my first mammo done in 2007 all good- and done at a breast center. Well I went for a mammogram June 8 and was called back. June 15  they did add views and then an ultrasound. I got copies today of my results. There are clusted pleomorphic microcalcs in left breast lateral and superior to the nipple at the junction of the anterior and middle one third. These extend over an area almost 2cm in greatest dimeonsion. there is a small cluster of pleomorpic microcalcs about 2cm anterior to the aformentioned microcalcs, just superior and lateral to nipple. these are not definelty seen on 2007 study. These are concerining for malignacy and biospy is rec,  I in the had felt a very small lump the radiologist felt and did the utlrasound on.. Palpable lump at 11 oclock position. approx 7 cm from nipple thre is an ill defined area of posterior shadowing anterior to the posterior shadowing, there is a hetergeneous area. At the time of scanning this area was less mass like and thought to be diffuctule area to definetly define for ultrasound guilded percutaneous biospy. This palpable abnormality was more medial than the microcalcs seen on mammo. Impression. 2 adjacent clusters of pleomorphic microcalcs in the upper outer aspect of left breast biospy recommended. There is an 8mm ill defined area with associated posterior acoustic shadowing at 11 oclock in the area of paplable abnormality. This concerning for maligancy and biopsy recommended. Both Birads 4 Well, I had move up to a small city in upper mi, so they had given this. and wanted me to do the biospy. Today I decieded to go back to the breast center I went to 2007 with all my films and records to meet with the breast surgeon on Monday at 1. I was scheduled to the the sterotactic biospy at the small hosptial on thursday -waiting almost a month,. but I cancelled today.. and decieded to go to the breast center,.. second look and probably better dx and big peace of mind for me.. with whatever the outcome is.. For all the experienced.. what do you think...The dr and radiologist told me they put me at 50/50% not the 20% I told them I was seeing on the internet.. I know.. I wont know til the biospy's but I am doing my best not to worry.. but how can I not ... right?? Please give my your experiences.... Thank you.. And hopefully the breast center can do the biospy soon.  Holly... mother of 6 year old twins. Dx 7/13/2011, IDC, 6cm+, Stage IIIA, Grade 3, 4/26 nodes, ER+/PR+, HER2- Surgery 8/7/2011 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 8/7/2011 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy 9/22/2011 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Surgery 1/24/2012 Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Radiation Therapy 2/27/2012 Hormonal Therapy 4/22/2012 Surgery 6/11/2017 Reconstruction (left): Latissimus dorsi flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771344",
      "Title": "clustered pleomorphic microcalcs motheroftwins SarahsMom"
    },
    {
      "AuthorID": "motheroftwins",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
      "Content": "motheroftwins wrote: Got phone call back, with results to stero biospy on monday, the dr said its ca... I meet with him tomorrow with details and how to go forward... I am still in shock.. wow Dx 7/13/2011, IDC, 6cm+, Stage IIIA, Grade 3, 4/26 nodes, ER+/PR+, HER2- Surgery 8/7/2011 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 8/7/2011 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy 9/22/2011 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Surgery 1/24/2012 Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Radiation Therapy 2/27/2012 Hormonal Therapy 4/22/2012 Surgery 6/11/2017 Reconstruction (left): Latissimus dorsi flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    }
  ]
}