{
  "AuthorID": "mothertime",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140511/profile",
  "Posts": [
    {
      "AuthorID": "mothertime",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140511/profile",
      "Content": "Nov 17, 2015 12:46PM mothertime wrote: i just cannot figure out why she wouldn't go ahead and do the mammo anyhow since it will be done anyhow? And I was already there? She said they will ultrasound the nodes in my armpit but said nothing about ultra sounding the breast. Going to call them tomorrow.    ",
      "MessageIndex": 2,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836810",
      "Title": "Ultrasound before mammo? mothertime mothertime"
    },
    {
      "AuthorID": "mothertime",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140511/profile",
      "Content": "mothertime wrote: I went for my mammo today and they didn't do it because of the swollen nodes in my armpit. They said that because I have lumps I need an ultrasound first. Is this common? Was upset because it was two hours one way for me to get there. Now I have to wait for them to call me with appointments for both Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836810",
      "Title": "Ultrasound before mammo? mothertime mothertime"
    },
    {
      "AuthorID": "mothertime",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140511/profile",
      "Content": "mothertime wrote: Hi everyone and gentle hugs. I have been \"lurking\" around and doing alot of reading to see if anyone has experienced what I am right now. I have had lumpectomys on my right breast 3 times..I have never had problems with my left breast until 4 months ago. I found a small lump in my breast. It felt nothing like the ones I had removed from my right breast. It was different, roundish and would move one way but not the other. I had the mammo and the ultrasound but they both showed nothing. Keep in mind, I am not real pleased with my clinics and hospitals but I am not financially set to move elsewhere so I take what I can get. So, my regular doctor examined the lump again and insisted that I go to the surgeon. He felt it and said it was a mass and gave me the option to wait 6 months and keep an eye on it or have it removed. He said if it were cancer, 6 months wouldnt make a difference...Really??? So, he took it out on the 8th of this month. I have never seen so much bruising...Now, I have a huge rock hard flat something in there (below the incision) .I have a flaky area that itches like mad and I have very dark blood coming from the nipple..It is more dark brownish...It doesnt come out on its own, my nipple started itching so bad that when i squeeze it to get relief then the blood comes out. I see the surgeon on this Wed. and should get the pathology report....is this normal and is there questions that I should ask him? Thanks so much for any input! Lori Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779717",
      "Title": "Post Biopsy Rock hard lump and brown blood mothertime Tenmom"
    },
    {
      "AuthorID": "mothertime",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140511/profile",
      "Content": "Dec 18, 2011 09:51PM mothertime wrote: Hmmm it could be...my incision is completely healed and have had no drainage from it. This hard thingy is not under the scar but down lower on the breast, down from the incision scar...ugh, cant wait til Wed...thanks Emaline!",
      "MessageIndex": 2,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779717",
      "Title": "Post Biopsy Rock hard lump and brown blood mothertime Tenmom"
    },
    {
      "AuthorID": "mothertime",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140511/profile",
      "Content": "Oct 22, 2015 05:57PM mothertime wrote: I had gone to 7 doctors for a lump in my breast. One did a mammogram and it was normal. All doctors said \"it's your age and women go thru this\" . I called a cancer center, that doc felt the golf ball size lump that the other doctors called normal. He did surgery and removed a precancerous mass. He said that if I wouldn't have listened to my body, it would have turned to cancer. Persistence pays off. Push on and make someone listen. Hug",
      "MessageIndex": 22,
      "PostDate": "22/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835680",
      "Title": "mammogram clear but still worried as indent on breast Busymum2015 evey40"
    },
    {
      "AuthorID": "mothertime",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140511/profile",
      "Content": "Nov 17, 2015 02:06PM mothertime wrote: so proud of you! Can't wait to hear the results! If you need down time, send those babies to me in the states! I love babies, just became a grandma for the first time! She keeps me moving on to get answers with my Breast issues!",
      "MessageIndex": 48,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835680",
      "Title": "mammogram clear but still worried as indent on breast Busymum2015 evey40"
    }
  ]
}