{
  "AuthorID": "motheroftwi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
  "Posts": [
    {
      "AuthorID": "motheroftwi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
      "Content": "Aug 18, 2011 04:46PM motheroftwins wrote: Wow, I am so inspired too, I am newly dx'd as well and have a lot of days feeling my life is going to end and WOW.. you have put a smile on my face.. As I wiped away the tears at the same time if that makes any sense..",
      "MessageIndex": 47,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772819",
      "Title": "I am what a Cancer Survivor looks like! KerryMac Heidihill"
    },
    {
      "AuthorID": "motheroftwi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
      "Content": "Jul 13, 2011 01:33AM motheroftwins wrote: On Monday went to breast center.. I am feeling better... They did a ultrasound on lump, radiologist and dr both agree that its jump my dense breast tissue. the area they could not actually see a lump they could see shadowing but it shadowed all over the breast as well. So they said it no mass. I then went sent down for a stero biospy on the micro calcs. The procedure was not bad at all... More scary then anything... The told me they will call me tomorrow for the results.. I am patiently waiting..I am not as scared.. Since the orginal hospital told me 50/50 odds of cancer but the ca center said more like 15-20 percent .. That is a big relief.... Praying for b9 tomorrow..",
      "MessageIndex": 3,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771344",
      "Title": "clustered pleomorphic microcalcs motheroftwins SarahsMom"
    },
    {
      "AuthorID": "motheroftwi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
      "Content": "Jul 14, 2011 02:01AM motheroftwins wrote: OMG what a day,,5:00pm call from Breast Surgeron-cancer center to let me know biospy came back CANCER,,, I deep down had a gut but I kept thinking 15-20% I will be alright.... I go tomorrow with my husband to go thru results and his plan,, and find out what kind of ca I have... I will keep in touch tomorrow night...",
      "MessageIndex": 6,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771344",
      "Title": "clustered pleomorphic microcalcs motheroftwins SarahsMom"
    },
    {
      "AuthorID": "motheroftwi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
      "Content": "Jul 13, 2011 06:41PM motheroftwins wrote: Thank you so much for everyone kind words and help.... My husband is going with me but now I am thinking maybe I should be another person with. My sister in law offered to come with.. maybe I will ., Cuz I think my husband and I are both in shock..",
      "MessageIndex": 6,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    },
    {
      "AuthorID": "motheroftwi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132040/profile",
      "Content": "Jul 14, 2011 07:50PM motheroftwins wrote: I am exhausted, Last night I did not sleep which I am sure everyone can relate. I just got home, but I wanted to post my breast surgeon visit. He diagnosed me with IDC Stage 2 Estrogen+Progesterone+ they say invasive poorly differentiated duct caricoma at least 2.4 cm, I am trying to pull some quick info from my pathology report.. Positive for Angiolymphatic invasion, Intraductal carcinoma, cribriform, micropapillary, and clinging types, high nuclear grade with comedonecrosis. I am now schedule for a MRI for monday and then will meet the genetic counsler. Then on wednesday will meet for results and meet with all the drs for a (round table) go thru my results and see what they recommend.. The breast surgeron said he thinks I will definetly need chemo, radation, hormone therapy..  Thank you for everyone advice, I took my husband and sister in a law.. My sister in law tape recorded  everything.. and they dr actually gave me notes and my copies of everything without having to ask.. which really helped me.. I am so overwelmed and I am wiped out for the night... I will talk more later. And I will try to go to IDC forum..  thanks again",
      "MessageIndex": 24,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    }
  ]
}