{
  "AuthorID": "motherofpat…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
  "Posts": [
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Jan 16, 2011 04:12AM motherofpatient wrote: As I understand it from the docs, there may be single cancer cell in the lymph or blood systems that can't be detected by current methods - although there is that new test being tried at MD Anderson and 2 or 3 other places. I want my daughter to go after her cancer aggressively and take every step to prevent reccurance. She has no choice about chemo due to one node positive. My fear is that too many woemn are being under treated only to come back to 2 to 5 yrs with another tumor.",
      "MessageIndex": 6,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/763394",
      "Title": "Oncotype DX test score at 18 - chemo or not? julie775 Bamagirl2016"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Jan 31, 2011 02:45AM - edited Jan 31, 2011 02:47AM by motherofpatient OMG, OMG I went to the Am Cancer site on tea tree oil - SOOOOOO glad Lago posted about this. It is a dangerous drug and should not be used by cancer patients. I found sites selling products with it in and with no cautions about the estrogen production. WOW - so many things to learn. I will NOT be giving it to my daughter when it arrives. So very glad I found out about it before hand. THANKS. Even things suggested on this site must be investigated since every woman's cancer is different - especially the differences among the ER and PR rate of expression. As for ice mitts and socks - How cold do they need to be?",
      "MessageIndex": 21,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755373",
      "Title": "Fingernails (Taxotere) carolsue63 hrf"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Dec 30, 2010 11:42AM motherofpatient wrote: Any one dealt with cellulitis in the affected breast?",
      "MessageIndex": 3,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761169",
      "Title": "ER+,PR+, HER@+++Prememo Gals motherofpatient bcfighter"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Feb 17, 2011 04:04AM - edited Feb 17, 2011 04:06AM by motherofpatient My daughter had a negative biopsy on a second spot that, when the surgeon removed it anyway - it was cancer, too. In your case if both areas were removed and tested, you would have a better picture of what is going on. If they are telling you that you need tamox, then you must have a hormone positive cancer. I don't think tamox is a routine preventive drug. Can you get another doctor to take your case? Sounds like you need to go outside the system you are in. Can you get copies of the test results and all your medical history? It is always a good idea to get your own copies.",
      "MessageIndex": 4,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/765007",
      "Title": "Having ALOT of diagnoses problems PLEASE help girlsmom3 dsengplute"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Jan 10, 2011 10:22AM motherofpatient wrote: What stage is it if you have 2 tumors, one HER+ and one HER negative?",
      "MessageIndex": 5,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763184",
      "Title": "Stage 1 or 2? JulieH coonie"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Feb 15, 2011 02:30AM - edited Feb 15, 2011 02:31AM by motherofpatient After googling this term, I see that it is a new type of follow up after a suspicious mamogram. My guess is it's more expensive since it is newer. Some sites quote a price of $600.00. My last mammo was $350, but it is less than an MRI.",
      "MessageIndex": 1,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764915",
      "Title": "Gammagram vs Mammogram / MRI 37antiques KellyMaryland"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Jan 19, 2011 05:54AM motherofpatient wrote: For all of you with wig issues - the  Am Cancer Society TLC store has Cool Comfort Wig/Cap liners that protect the scalpe and wick away moisture. I got a set of two for my daughtr if she needs them. It might help with the itchy wig liners. Wish I had known about this when my mother went through chemo. www.tlcdirect.org - great items to make life a little easier for all of you.",
      "MessageIndex": 373,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Apr 13, 2011 05:35AM - edited Apr 13, 2011 05:37AM by motherofpatient talked to my daughter's onc yesterday about this - if I may ask, how old are all of you? She is 43. Doc seems a bit old school on this issue but since he even admits that AI's are better than Tamox, I don't get his hesitation. I had no issues with menopause since I had a hysterestomy at age 29 and never knew when my periods stopped - no hot flashes, maybe because I was on Prozac. What has your experience been? Seems it is safer to get them out and stop the estrogen.",
      "MessageIndex": 11,
      "PostDate": "13/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/767285",
      "Title": "Done with rads....on to oophr jennyboog jennyboog"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Feb 28, 2011 01:57AM motherofpatient wrote: Get a new scan. These \"clinics\" are famous for producing crappy scans - my experience a few years ago. My doc said it was so poor quality she could tell anything. Call your state insurance commissioner and file a formal complaint and let Cigna know it. I have their lousy insurance (no choice) too.",
      "MessageIndex": 3,
      "PostDate": "28/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/765524",
      "Title": "Getting radiology films cherimc cherimc"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Mar 6, 2011 10:27AM - edited Mar 6, 2011 10:29AM by motherofpatient Check out the taxotere threads here - one is about taxotere only. My daughter is on her 4th TCH and has not had too many side effects, but she is tired, had dry mouth, constipation, and upset stomach. Look under Forum: Chemo",
      "MessageIndex": 1,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/765820",
      "Title": "Taxotere advice please..... abcd abcd"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Dec 26, 2010 08:53AM motherofpatient wrote: me too so excuse the typing. My daughter's husband is such an ass  - coouldn't stay at the hospital through her lympectomy and positive lymph node surgery, was still in bed when her faather and I picked her up for the port surgery and drain removal ( in three wks) and today he spouted off about how quickly she recovers from it all while she is suffering from a sinus infection with chemo 2 wks away. He discounts all her suffering and I am LIVID. What to say, when to say it - why is she sabotaging (sp) her recovery)? I just don't understand.",
      "MessageIndex": 7,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762490",
      "Title": "posting while drinking pattih shan1171"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Feb 13, 2011 10:24AM motherofpatient wrote: Horse-n-around - if you can't get your doc on Sun try asking your pharm about what is safe to take. They ahve a list of your meds on file and can be helpful - at least teh Wallgreen's my daughter uses is.",
      "MessageIndex": 131,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Mar 11, 2011 05:37AM motherofpatient wrote: Take a voice recorder. No one can write down that much info especially with all the medical terms. Later you canl isten and write down what you want, bu tyou have it all there.",
      "MessageIndex": 8,
      "PostDate": "11/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/766019",
      "Title": "1st appt w/oncologist, what to ask and expect? punkyandjohnnasmom vivirasselena"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Mar 3, 2011 02:33PM - edited Mar 3, 2011 02:34PM by motherofpatient Thanks for posting this - it needs linked to the triple positive thread -anyone know how to do that? Also we need a dietary thread about ER+ and all the estrogen andphytoestrogens in food and even gel cap meds.",
      "MessageIndex": 10,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765600",
      "Title": "What are the reasons for taking out ovaries? geogal nikola"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Feb 17, 2011 11:52AM motherofpatient wrote: From what I am reading on medical web sites, inflamatory BC does have symptoms. If you are getting the run around, switch doctors.",
      "MessageIndex": 2,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765032",
      "Title": "cant sleep danie22 SarahsMom"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Dec 26, 2010 08:42AM motherofpatient wrote: I am here for you. I know the pain, lost my mom to cancer and now my daughter has it. your anger is accepted here. you have the right to rant. You are supported. Saying good bye is not a one time event. It takes years.",
      "MessageIndex": 26,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762190",
      "Title": "I know I said goodbye but VERY angry and upset.. BrokenHeart motherofpatient"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Mar 30, 2011 05:54AM motherofpatient wrote: Use Penguin or buy your own elasto gels- use Penguin procedures for hair care but change caps  every 15 min before chemo and every 20 from there on. They don't stay cold as long as Penguins and AVOID Advance Cold Cap Services. The two people running it were involved in a charity scam in MS during Katrina called Camp Coastal Outpost and the Attorney General and Secretary of State, along with the IRS, are after them. Donations were used for bar bilss and vacations. Their new web site has a button for \"how can I help\" to get donations. They are not registeed as and charity and have never been one.",
      "MessageIndex": 5,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/757052",
      "Title": "Cold Caps nin motherofpatient"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Dec 8, 2010 09:14AM motherofpatient wrote: I have a question for any of you who had a drain after a lumectomy and node removal - how long did you have the drain? My daughter is on her thrid week. Twice she had fluid removed from the cavity where the tumors were, but this fluid is apparently different.",
      "MessageIndex": 5078,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Mar 3, 2011 10:52AM - edited Mar 3, 2011 10:53AM by motherofpatient Where is the 5 years and out thread and how do I bump it up?",
      "MessageIndex": 26,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765601",
      "Title": "Remind me of the hopeful stories elmcity69 thefuzzylemon"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Mar 25, 2011 06:22PM motherofpatient wrote: So young and so beautiful. My sympathy to you, your children, and all you family members.",
      "MessageIndex": 233,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Dec 2, 2010 01:59PM motherofpatient wrote: Be careful when you read information  - first thing is to find out what the person's diagnosis is. Stage IIa and mean two different situaitons, one with node involvement and one with a larger tumor, so the actual recommendation from the onco may be different for each individual. Also, so  many people don't post their age or menopausal status - very important. Also the PR and ER percentages because ER+ adn/or PR+ means different things based on how high the percentage is. So what works for one doesn't for others. Also, if you have mixed DCIS and invasive then the treatment might be different. By all means do your research but be careful to compare apples to apples. The surgeon that is caring for my daughter is highly respected by everyone we have come into contact with, and the oncologist she will see has a doctorate in pharmacology and an MD from a respected institution. She does reseach on premenopausal women with breast cancer, so we feel she is on top of it, BUT we still read everything we can and bring written questions to every meeting. Before we see the onco on the 13th I am getting a recording devise, in my day we called then tape recorders, I don't know what to call it now, but I'm getting one. I'm sure the clerk at Brookstone will know what I mean. Good wishes and gentle thoughts to all of you.",
      "MessageIndex": 4,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761422",
      "Title": "A little confused . . . Sonnet Sonnet"
    },
    {
      "AuthorID": "motherofpat…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113748/profile",
      "Content": "Mar 1, 2011 05:06AM - edited Mar 1, 2011 05:07AM by motherofpatient Yes, our soil, our environment, the poison in our food all contributes to cancer, but to say the Chinese women don't get cancer as often is suspect. The fact is that most women in China do not have access to medical care and the government puts out whatever stats they feel make them look good as they did during the AIDS epidemic. When the government controls all the information released it is difficult to accept any information they produce.",
      "MessageIndex": 95,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764313",
      "Title": "Why don't Chinese women get breast cancer? MCTHO"
    }
  ]
}