{
  "AuthorID": "Mother4Life",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
  "Posts": [
    {
      "AuthorID": "Mother4Life…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Oct 15, 2012 09:35AM Mother4Life wrote: thank you  for all the information. I have been stressing out thinking the pain was going to be unbearable.. knowing that  I have handle a C section.. I can deal with this has put my mind at rest. I know It will hurt and I will be sore... but hearing from others that is not as bad as what I was thinking helps. Now got to work on hubby. He is a workaholic... and I am trying to get him to take some time off work ( he has 4 weeks holidsys still available). Another question  how long did it take everyone to heal. Will find out on Wed  if we will be doing plan A... removal of just tumor or plan b with removal of whole breast... will all depend on what my test result show, what we will be doing. Anys just trying to figure out how I should handle hubbys holidays... should I get him to take all his holiday when I have surgery so he can look after our kids age 5,6,9 and 13...or should I break it up and save some for when I start chemo to see how my body handles it. Thus the reason for question.. just trying to figure out what to expect so I can get as much as I can in order before the operation. Anyways thanks a lot of the information above.. sharing your stories has let me know.. it may be hard... but I can handle it. ",
      "MessageIndex": 16,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794924",
      "Title": "scared how much it is going to hurt Mother4Life curveball"
    },
    {
      "AuthorID": "Mother4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Mother4Life wrote: This Wed I meet with my surgeon to find out if cancer has spend outside breast or not thus will find out and confirm if it is stage 2 or 3. Also will find out with result if we will be going with plan A of removing just tumor and surrounding tissue or plan b the whole breast if the invasive cancer has spread. Anyways... my question is how painful is it after surgery. I have 4 young kids and 2 large dogs that could jump up on me if they want to play.  Is the pain like if you has a C -section during child birth or is it worse. Just trying to get my head in the right mind set of what I will be having to deal with. When I last meet with surgeon.. she told me my surgery would be booked for approx a week after results come in and we chat. Thus I am looking at surgery to be the last week of Oct or first week of Nov. Can you that have gone though sugery give me an idea of what to expect. My doctor has told me all the medical stuff.. just wondering about the other stuff...pain, feelings I deal with etc... Karen Dx 10/3/2012, IDC, Right, 3cm, Stage IIB, Grade 2, 1/4 nodes, ER+/PR+ Surgery 10/21/2012 Lumpectomy: Right; Lymph node removal: Right, Sentinel Hormonal Therapy 12/22/2012 Radiation Therapy 1/1/2013 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794924",
      "Title": "scared how much it is going to hurt Mother4Life curveball"
    },
    {
      "AuthorID": "Mother4Life…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Oct 14, 2012 04:23PM Mother4Life wrote:",
      "MessageIndex": 3,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794924",
      "Title": "scared how much it is going to hurt Mother4Life curveball"
    },
    {
      "AuthorID": "Mother4Life…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Nov 14, 2012 12:31AM - edited Nov 14, 2012 12:51AM by Mother4Life I just wanted to say hello... I had my surgery on Oct 22. Dealing with nasty infection that developed over this past weekend my breast.  It sound like you ladies are so much ahead of me in treatment...I had surgery on 22... Go later today for my post op appointment.. Will find out pathology results and what the next step is and when. They told me I will need chemo and radition.. But I have no idea when it will happen. In no hurry right now though.. I need to deal with nasty bad infection that hit me last weekend.",
      "MessageIndex": 608,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Mother4Life…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Nov 14, 2012 11:27AM Mother4Life wrote: well back from hospital ... they told me infection is cellultis and I am on the right medication already ( that I got on Monday) and it is just going to take time to clear up. As far are the path report goes I am more confussed then then I left to meet with surgerion. I was told that the tumor itself was fine.. but the lymph nodes under my arm were not. During the sential node boispy they took 4 nodes. 3 were fine but one showed a very small amount of cancer in it. So now I have to wait as my doctor will be meeting with the other breast cancer surgeons to do their weekly meeting of hard cases to chat about what the next step for me will be. She is not sure if they will be sending my for more surgery ( not a big fan of going through surgery again with 4 young kids under foot 24/7) or if they will just do extra raditation on my armpit area as well as breast. I will be doing some reseach on this... but right now I am am liking the 2nd opinion better as I have to have raditation anyways, so having a 2nd area done at same time not a big deal where surgery will have to out of order and unable to use my arm again. I still have major swelling from them removing just 4.. I hate to see what my arm will be like if they do more. Question... has any one else had to deal with an issue like this. The doctor said it is a grey area... so thus the meeting for her to get another opinion on what we should do.  I do have a high rate of cancer in my family... and I am so confused and so are the doctors of what to do with me now. ",
      "MessageIndex": 617,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Mother4Life…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Nov 14, 2012 03:17PM Mother4Life wrote: My tearm has already told me I will be going for chemo and radiation... Just trying to figure out if they are giving lypmph node radiation will breast has radiation too.. Or a 2nd surgery",
      "MessageIndex": 621,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Mother4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Mother4Life wrote: I am so new and overwhemed by being thown into the world of breast cancer. It seems like my brain has been on auto piliot since I found out. Anyway on Wed I have a folow up visit with my surgeon to get all my test results from MRI, bone scan, etc... also we will be talking about the next step. I was told at first visit depending on test results I may lose part or all of breast and either way she is sending mefor chemo and radiation.... so not sure yet of what they suggest to be done as far as how much they will take. Anyways, my question to you ladies that have gone though this already ..what are good questions to ask surgeon at this time besides the basics of grade, stage, etc... Because I know my mind had not been thinking straight.. I am making a list up of what to ask. Asking you ladies what to ask.. maybe you come up with things I did not think of to ask. Thanks in advance for your help. Karen Dx 10/3/2012, IDC, Right, 3cm, Stage IIB, Grade 2, 1/4 nodes, ER+/PR+ Surgery 10/21/2012 Lumpectomy: Right; Lymph node removal: Right, Sentinel Hormonal Therapy 12/22/2012 Radiation Therapy 1/1/2013 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795013",
      "Title": "What to ask ? Mother4Life Lou10"
    },
    {
      "AuthorID": "Mother4Life…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Oct 16, 2012 12:53AM Mother4Life wrote:",
      "MessageIndex": 7,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795013",
      "Title": "What to ask ? Mother4Life Lou10"
    },
    {
      "AuthorID": "Mother4Life…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Oct 15, 2012 11:05PM Mother4Life wrote:",
      "MessageIndex": 5,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795013",
      "Title": "What to ask ? Mother4Life Lou10"
    },
    {
      "AuthorID": "Mother4Life…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161908/profile",
      "Content": "Oct 15, 2012 10:11PM Mother4Life wrote:",
      "MessageIndex": 2,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795013",
      "Title": "What to ask ? Mother4Life Lou10"
    }
  ]
}