{
  "AuthorID": "mountainstream",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80875/profile",
  "Posts": [{
    "AuthorID": "mountainstream",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80875/profile",
    "Content": "mountainstream wrote: Hello, I am new to this forum and would appreciate your opinion on my very recent experience.  I am almost 36 years old. Over the last year I have been very aware of sensations of mild pain like bruising in my underside of my left breast.  For some time it would be too uncomfortable for me to lie on my stomach when going to sleep though this seems to have stopped now. Just over a month ago I found an enlarged lymph node above my collarbone on the left side at the base of my neck - this made me finally go to my GP.  I was referred to the breast clinic, where my tests were carried out all in the same visit - the consultant examined me - and I explained the symptoms. I had a mammogram and then went for my ultrasound of the lymph node. The person who performed the ultrasound asked why I was referred to the breast clinic when the lump was in my neck - I explained the burning sensation in my breast. The nurse attending the ultrasound prepared me for an ultrasound of my breast but the person doing the ultrasound did not examine my breast. I didn't feel like I could question this. I then waited for the consultant he said it was all good news, the mammogram came back normal and that the lymph node was superficial and reactive.  At the time I was happy to accept this, but as soon as I left the hospital I felt angry that I had not had a breast ultrasound - after all I was lying on the bench in a gown prepared for it!  I have read that mammograms and ultrasounds usually are standard procedure particularly for younger women.  Do you think it is unusual that I did not have the ultrasound too? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "14/03/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730718",
    "Title": "Mammogram but no ultrasound? mountainstream mountainstream"
  }]
}