{
  "AuthorID": "mountainmom…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101455/profile",
  "Posts": [
    {
      "AuthorID": "mountainmom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101455/profile",
      "Content": "May 3, 2010 05:56PM mountainmom1 wrote: Tammy, A few weeks ago I had the Birad 5 result. This lead to a digital mammography and sonography. It seems there was something there that they wanted to biopsy by needle. I elected for the lumpectomy and the result was atypical lobular hyperplasia (which I just posted to find out more about). Try not to worry and good luck. My lumpectomy followed my diagnosis by about 2 weeks so they were pretty quick.",
      "MessageIndex": 10,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752097",
      "Title": "Just how worried should I be with Bi-rads-5 Tg5471530 Beesie"
    },
    {
      "AuthorID": "mountainmom…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114586/profile",
      "Content": "Apr 8, 2011 11:41PM mountainmomof3 wrote: Yvonne, Your post made me cry.  I'm sorry you're going through this.  When I found out I had breast cancer I was very disappointed that some of my close friends began to back off.  But then there were those I barely knew who bent over backwards to help me and wanted to talk about it with me.  I think the ones that back  away are just afraid and they don't know what to say or do-- it has nothing to do with you.  Is there someone you can count on so you don't feel so alone?  Sometimes it's hard but you just have to reach out to someone and tell them point blank that you need a friend right now.  You are NOT alone.",
      "MessageIndex": 2,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767278",
      "Title": "In need of a friend mossybaby chainsawz"
    }
  ]
}