{
  "AuthorID": "Mps1217",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268290/profile",
  "Posts": [
    {
      "AuthorID": "Mps1217",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268290/profile",
      "Content": "Mps1217 wrote: Hello! I was DX with ILC in December and had my lumpectomy surgery with SNB on January 24, 2018. During the surgery, the surgeon also found LCIS and removed it. A week later, I received a fantastic report of “clear margins and no lymph node involvement.” Also, I only needed radiation, no chemo. I was told my risk of lymphedema was low because I only had two SN dissected. Fast forward, less than two month, I was about to start radiation when I woke up with pink skin and peau d’orange on the breast I had surgery on. I couldn’t get radiation until my breast surgeon checked it out. She did an ultrasound and felt it was “benign infectious inflammatory process/ possible lymphedema in breast area.” There was skin thickening but no abnormal mass or fluid collection. I never received a biopsy to check for possible IBC. I was placed on antibiotics and shortly began radiation. That was now 3 weeks ago and the symptoms still persist; however, my skin is now red (likely from radiation). The radiation oncologists believes it must be lymphedema of the chest, so I will be seeing a LE specialist soon. I still have two more weeks of radiation, but I plan to make an appointment with my breast surgeon again to recheck the peau d’orange. I am also going to ask for a punch biopsy to check for IBC— though I’m nervous radiation could impact the results. My question is if anyone has had lymphedema of the chest/ breast? If so, how did it present? Did you have pink/ red skin and peau d’orange? I currently have red skin, peau d’orange, and swelling. I also have some skin flaking but I believe that is from radiation. I do not feel like my skin is hot, tender, or hard, though the ultrasound did show thickening inside the breast. I also do not have any pain. My current symptoms are very similar to some symptoms of IBC, so I’m making myself sick with worry. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/863804",
      "Title": "Peau d’orange— lymphedema in breast/ chest? Mps1217 Mps1217"
    },
    {
      "AuthorID": "Mps1217",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268290/profile",
      "Content": "Apr 7, 2018 08:02PM Mps1217 wrote: Wow! Thank you all for your kind words and advice. I greatly appreciate it! I’ll share this information with my daughter that lives 6 hours away. She has been like a mother hen to me ever since I was diagnosed, and I know the information you gave me will help ease both our minds!  Thanks so much!  I’ll keep everyone updated whenever I finish radiation and have my punch biopsy",
      "MessageIndex": 4,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/863804",
      "Title": "Peau d’orange— lymphedema in breast/ chest? Mps1217 Mps1217"
    }
  ]
}