{
  "AuthorID": "mricha02",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76183/profile",
  "Posts": [{
    "AuthorID": "mricha02",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76183/profile",
    "Content": "Dec 29, 2008 10:41PM mricha02 wrote: How's it going September/October chemo ladies?  I had my second Taxol today.  Only 2 to go (3 weeks apart).  I did A/C starting 9/11/08.  I had modified radical mastectomy on 8/22 following an 8/5/08 diagnosis.  I had an 8cm DCIS, a 3cm and a 1 cm IDC and it was multicentric or focal or something.  Hormone positive and HER neg.  The taxol kicked my ((&&& with pain on the 3rd through 6th day.  I have a 5, 8 and 12 year old.  I work fulltime as a school administrator.  I think I started the menopause change at age 46. Menstrual problems big time started - lots of long-term bleeding and FINALLY after 2 years of going to nurse practcioner and gynecologist started a pill to STOP the bleeding as I was anemic (duh).  Only to find out a few weks later about the cancer.  My side effects: Surgery went okay.  Modified radical mastectomy.  My first time being totally under with amnesia and coming out of that was weird.  Was back at work in 4 weeks.  Am a school administrator and it is BUSY BUSY BUSY and physical and mental and multi-tasking out the ying-yang. prescribed Ativan for anxiety/sleep.  Was good for sleep because of this unbelievable hyper thing.  Oncologist non-plussed by that 'side effect' A/C - very very hyper.  By the end of the day I appeared to be in the stratosphere. Very inefficient and all kinds of chemo brain.  Overwhelmed by demands of life and I got/get a glazed look in my eye when advised by people to \"take care of yourself\".  They just don't understand.  In recent weeks have taken to locking myself in the bedroom so as not to be interrupted.  Of course I am anyway with door-knocking.  Prescribed Prosac about almost a month ago - low dose.  Don't know if it's helping. Taxol - prescribed Vicodin for pain.   Will be taking a medical leave from work.  I cannot function right now overall.  Definitely need TIME to undergo treatment without so many demands on me.  Hubby being very helpful.  Yet, truth be told, he is about 5 miles per hour compared to my 100 miles per hour.  Now my 100 miles per hour is about 30 miles per hour. Kids are okay.  I am a nag and I've stopped.  SICK of telling kids what to do and mad that they don't AUTOMATICALLY do it.  They seem better off with my laid back husband.  I'm trying to pretend I'm the nice aunt or something instead of the mother WORRIED to death about evey single soul and every single second of every single day that they grow up with character and responsibility and skills. Insttead of trying to manage and control life, I'm trying to just observe and detach.  That's my deal.  I feel like I forget how to live. Taxol - very extreme bone pain and otherwise pain.  Fell down one night trying to get Tylenol in the kitchen.  The thudbrought husband and son running.",
    "MessageIndex": 726,
    "PostDate": "29/12/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
    "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
  }]
}