{
  "AuthorID": "mrs_X_Sunne…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
  "Posts": [
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jan 30, 2009 02:42AM mrs_X_Sunneedazee wrote: Sunshine, I know how hard it is to have to loose your hair!  When my cancer was growing again and my doctor wanted to switch me from just Herceptin & Zometa to Taxol, I was almost more devastated that I would be loosing my hair again than the growing cancer.  To add insult to injury, the Taxol didn't even work!!  I then tried Gemzar, and then Xeloda currently, and if I would have gone straight to Gemzar, I wouldn't have lost my hair.   Now the Xeloda doesn't seem to be shrinking any tumors, and I have a nice 1/2\" of hair which covers my scalp that has taken 3 months to grow.  So, my onc is thinking of Taxotere, and I probably won't go for it, because I don't want to loose my hair again! I guess the point of all my rambling is that I SO know how you feel, and it SUCKS!!!!  p.s.Janice you look FABULOUS in your wig.  I notice in all of my wig on pictures that my hair has that shiny barbie doll synthetic look.  Oh well. ",
      "MessageIndex": 17,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728101",
      "Title": "Goodbye to hair... again SunshineSmiles heatherpalmerton"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 2, 2008 11:21AM mrs_X_Sunneedazee wrote: Just a quick update, I had my tumor markers ran again this last week, and they came back one doubled and the other tripled.  So, I am officially scheduled to start Taxol again on August 19th.  You would think it would be easier to do this the second time around, but it is actually more difficult.  I dread loosing my hair again---  is that terrible that that is the thing that is most bothering me right now.  I also had terrible stomach problems on the taxol, herceptin combo.  I spent the next 2 days on the toilet after each treatment.  Not to mention I hate the stupid steroids that make me look like a bloated moon faced old man.  At least I get a lot done the night after chemo when I am wired and can't sleep all night!!!!!   It just doesn't seem fair sometimes that I have to do chemo and potty training a 2 year old at the same time.  yikes!!!  We will just have to fight over the toilet!!!  Thanks again for all of your support and help.  I don't know how I would deal with this all without you. ",
      "MessageIndex": 27,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708891",
      "Title": "Progression for me :o( What to do, what to do???? mrs_X_Sunneedazee Barb-FightingBC"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 12, 2008 12:54PM mrs_X_Sunneedazee wrote: Thank you ladies for all of your advice and support.  My thoughts have been so muddled, and my fear has been deep.  All of your kind words and ideas are wonderful, and I appreciate each and every one of you taking the time to help. I did the weekly Taxol, but the combo with herceptin and zometa just made a mess of my stomach.  I had horrible diarrhea for about 3 days after treatment each week.  I am a piano teacher, so the neuropathy I had in my fingers made it difficult to play and teach piano lessons.   I will have to check out that alternative to taxol- abraxane.  I too hate the dexemethazone.  It makes me so jittery and agitated, and can't sleep and I swell up, so I look like a bald fat man.  I posted some before and after pictures on my blog. I have been on Aromasin, but my doctor doesn't think that changing hormonals will make that much of a difference quickly enough.  I asked about radiation, but I have way too many bone mets for that to be effective.  They want to save that for if I am in imminent danger of a bone breaking.  He is quite adamant about not changing treatment drugs from Taxol because we quit that while it was still working, so he strongly believes that I still have some mileage left out of that, and he doesn't want to burn through treatments too quickly.  I have a lot of years to live!!!!!!  I will have my tumor markers ran again in 2 weeks.  If they do another large jump doubling again, then we won't delay the start of Taxol.  However if they only rise a small to moderate amount, we will delay another 3 weeks until August 19th.  We have a family trip planned August 6-12 so I would really want to wait until after that.  My kids go back to school on August 25th.  3 will go all day, and then I will have my kindergartner go half day, and have my 2 year old home with me all day.  I will be able to rest and handle the side effects a lot better once the kids are back in school.  We will just have to cram a whole lot of fun into the next month!!!  We already went to Yellowstone national Park for a week, and that was so beautiful and relaxing.  We plan to go swimming lots, and to the Zoo and the park, and school clothes shopping, and all that other fun stuff.   ",
      "MessageIndex": 24,
      "PostDate": "12/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708891",
      "Title": "Progression for me :o( What to do, what to do???? mrs_X_Sunneedazee Barb-FightingBC"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 10, 2008 11:57AM mrs_X_Sunneedazee wrote: I was shown another obit that has a picture and a little bit more info on kim.  This is the site, but I don't know how to make it a link. Paid Obituary www.winchesterstar.com/showsec... ",
      "MessageIndex": 4,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708676",
      "Title": "Kimmie39 Kim Franklin's Obituary mrs_X_Sunneedazee nash"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jun 18, 2008 12:20PM mrs_X_Sunneedazee wrote: I just wanted to add my regrets.. I pray that you and your family can find strength at this heartbreaking time",
      "MessageIndex": 20,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707520",
      "Title": "MY MOM IS NOW AN ANGEL...AND I ALREADY MISS HER! LANEF SandyAust"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 12, 2007 04:13PM mrs_X_Sunneedazee wrote: What awesome pictures.  When is the baby due? Your son looks so handsome in is camos, so precious little baby.  I'm so glad you have such happy things going on in your life.  I think that is what keeps us going!",
      "MessageIndex": 2,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693721",
      "Title": "Pictures of New Baby LuAnnH Rocktobermom"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 5, 2008 10:53PM mrs_X_Sunneedazee wrote: I did chemo taxol and herceptin and zometa for 5 months, and then had surgery and rads.  I continued with the Herceptin and Zometa throughout rads.  About 8 months after I stopped the Taxol, I had skin mets growing along my scar line.  They looked like angry red rashy welts.  Anyhow, I started the Taxol again, and it took care of the mets, but my mets in my bones and a brain met continued to grow, so I stopped the taxol.  But the point is, at least the sore itchy skin mets went away!  I am hoping that I can find something to work on my bone mets now!  I tried Gemzar-that made me horribly ill, and now I am on Xeloda.  I wonder why your onc didn't have you continue the herceptin during rads?  I hope that your skin mets disappear as quickly as mine did once you begin chemo.  Keep us posted!!!",
      "MessageIndex": 1,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725527",
      "Title": "Help! Calling all skin mets sufferers! Bmarie Bmarie"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 29, 2008 03:19AM mrs_X_Sunneedazee wrote: I am sorry!  I totally get the sick and tired of being sick and tired!!!  I have been on Zometa for 13 months now, and it gets better with time.  The first couple of tx were pretty awful, but they are tons better now.  I still have TONS of bone pain with it, especially in my leg muscles and joints.  I try to drink lots, but I don;t know if that helps.  ",
      "MessageIndex": 17,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709692",
      "Title": "Now mets to the bone..criminy! tooyoungtohavebc mimi1030"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 12, 2007 01:19PM mrs_X_Sunneedazee wrote: Ooooh they are SO adorable!  I would love to hold one of the little darlings. ",
      "MessageIndex": 3,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693698",
      "Title": "New puppy pictures ForTheMoment Kasey"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Mar 26, 2009 02:46PM mrs_X_Sunneedazee wrote: thisgirl; Wow, your mother really is being put through the wringer!  I hope her treatments will work, and she will get some relief from the pain.  Cancer treatments are so cruel and hard to get through.  I say all the time that I am glad it is me going through it, and not a loved one.  It would be so hard to watch someone I love suffer.  I am sure your mother is grateful for your love and support.  I will pray for you and your mother.  God bless you!",
      "MessageIndex": 12,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731216",
      "Title": "Mets to Lung, Liver, Bones, and Brain thisgirl80 Analemma"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Mar 23, 2009 09:59AM mrs_X_Sunneedazee wrote: Kathy- I am sorry you have been dx with brain mets. Stupid cancer, huh!  I was diagnosed with brain mets 7 months ago.  I did gamma knife radiation, and my tumor has been steadily shrinking.  Radiation usually kicks brain tumors butts, even if it is a horrible process to go through.  I didn't do wbr, and am always afraid that I will have to do that if more tumors grow.  I have read a lot on www.brainmetsbc.org Some great info found on this site!  Good luck to you...  ",
      "MessageIndex": 37,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731126",
      "Title": "Brain Mets for me kgrimm SunshineSmiles"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 24, 2007 08:35AM mrs_X_Sunneedazee wrote: Well, it looks like it is a definite GO for surgery tomorrow.  I am all preregistered, I have my lovely hospital braclet on, and had all of my lab work done....  I am doing the modified rad mast on one breast, and then a supracervical laprascopic hysterectomy tomorrow.  The gyn after checking my ovaries and uterus decided that it would be best if it ALL came out.  I get to do a lovely bowel prep today because of the hyster, so today will be wonderful.  Not only the anxiety of surgery, I get to purge my system at the same time.  I'll just grin and bear it.......   cbl-I am glad for just the one surgery down time and recovery.  I hope I am not too miserable, and can't wait to have it done and over with....... ",
      "MessageIndex": 4,
      "PostDate": "24/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694262",
      "Title": "Ooph and Mast at the same time??? mrs_X_Sunneedazee geebung"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 2, 2007 10:20PM mrs_X_Sunneedazee wrote: Sue, Thanks for searching me out. I just finished catching up on your thread. You have been on quite the roller coaster ride. After a rough couple days at home (I couldn't even feed myself my arm hurt so had and was so swollen) I think I have finally turned the corner and am starting to feel better. I was pretty drugged up for a while. I got my drains out today, what a relief that was. I have fluid in my lungs and have been coughing quite a bit, which is really painful on the incisions from the hysterectomy. And go figure, I did 5 months of chemo, and never once threw up, but I was SO nauseated and threw up from the pain meds. Yuck! Well, the worst is over, and now I am on the road to recovery. Thanks for checking on me! Hugs to all!",
      "MessageIndex": 15,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694262",
      "Title": "Ooph and Mast at the same time??? mrs_X_Sunneedazee geebung"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 27, 2007 09:30PM mrs_X_Sunneedazee wrote: Hi everyone!  I am home from the hospital.  I had a supracervical hysterectomy (they took ovaries, tubes and uterus) and a mastectomy.  I am swollen like a big round beach ball, and pretty sore.  But, I am SO GLAD it is over with and I don't have to worry anymore.  The surgeons said that the surgeries went well.  I am black and blue bruised, feel like I've been hit by a truck, and look like it too.  My dear husband and mother have been taking wonderful care of me, and my 5 kids are staying at various aunts and cousins and grandmas house.  I miss them, but I am glad that they won't see me looking like this.  Thank you everyone for all your prayers and well wishes.  I know that I was looked over by guardian angels!   ",
      "MessageIndex": 11,
      "PostDate": "27/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694262",
      "Title": "Ooph and Mast at the same time??? mrs_X_Sunneedazee geebung"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 24, 2007 09:37AM mrs_X_Sunneedazee wrote: Thank you tender, you are SO sweet!  My husband is taking a week off from work to help me, and my kids are staying at their grandmas house, so I should be okay.  I will definitely tell him about keeping on top of the pain meds schedule.  I remember when I had my port surgery, I fell asleep the second night without taking a pain pill, and when I woke up in the middle of the night I couldn't even sit up because it hurt so bad.  I got so dizzy and nauseous from the pain...  I will keep ahead of the pain this time! ",
      "MessageIndex": 8,
      "PostDate": "24/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694262",
      "Title": "Ooph and Mast at the same time??? mrs_X_Sunneedazee geebung"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 24, 2007 09:14AM mrs_X_Sunneedazee wrote: mthomp2020, I had one of those when I had foot surgery.  It was AWESOME.  I will have to ask my breast surgeon today if I will have one with this surgery. For the hysterectomy, they do have to do three small incisions in my abdomen, but I figure with the incision all the way across my chest for the mastectomy, what is 3 more....  It is better than the alternative incision.  ",
      "MessageIndex": 6,
      "PostDate": "24/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694262",
      "Title": "Ooph and Mast at the same time??? mrs_X_Sunneedazee geebung"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 23, 2007 06:01AM mrs_X_Sunneedazee wrote: Oh my, what sweet pictures!  Bimmer, I can totally see what a tender guy you are from your pic!!  It brought tears to my eyes....  I am so glad to put a face to your posts.   I pray for you and all who suffer from this dreadful disease...  Bless you and your dear wife!",
      "MessageIndex": 17,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694231",
      "Title": "Bimmer & Diane Pix nowheregirl MargaretB"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jun 19, 2008 07:49PM mrs_X_Sunneedazee wrote: I am so happy for Angela!!! Thanks again to LuAnn and all the other people who made this possible. It brightens my heart and fill me with joy to see how people can come together and help when it is needed.",
      "MessageIndex": 11,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707624",
      "Title": "Angela's Going To Disney!!!! LuAnnH Irina"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 2, 2008 01:23AM mrs_X_Sunneedazee wrote: the truth? With my cancer there was no actual lump, per say.  When I had my mamorgram, I had calcifications all over.  it looked like sugar sprinkled throughout my breast.   My diagnosis (dx) was inflammatory breast cancer.  Of course I had several signs and symptoms of this kind of cancer; red inflamed, thickened skin, discoloration, breast swelling, stabbing pain, orange peel skin, etc etc, I know the waiting is the hardest, when you just want to KNOW so you can go on with your life one way or another.  Just because my outcome was cancer, doesn't mean that your outcome is going to be cancer. When will you get the results for your biopsy?  Try to stay busy and do things to get your mind off of it.  I know, I know, easier said than done, but it does help. Good luck, and please keep us posted!!!! ",
      "MessageIndex": 1,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718920",
      "Title": "If your journey started w/ microcalcifications... newmomto1 newmomto1"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 21, 2007 09:36PM mrs_X_Sunneedazee wrote: whoa scary, but I'm glad your scan was clear. ",
      "MessageIndex": 3,
      "PostDate": "21/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695805",
      "Title": "Holy crap -- vertigo.... kimmytoo kimf"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 4, 2007 04:48AM mrs_X_Sunneedazee wrote: I am a righty.  I think it is intresting because I have had so many problems on that side breastfeeding and cysts.  I think it was broken for a long time before I was dx.  My grandma was a lefty, though.",
      "MessageIndex": 21,
      "PostDate": "04/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/696282",
      "Title": "Are most BC's in the right or left? gscott geebung"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 1, 2008 10:38PM mrs_X_Sunneedazee wrote: Michelle,thank you for taking the time to update us.  I will pray for your mom as well.  ",
      "MessageIndex": 6,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/718905",
      "Title": "Update on my mom ejohn LuAnnH"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 20, 2008 10:20AM mrs_X_Sunneedazee wrote: Jen- It is good to be aware of your breasts even when you are young.  I was diagnosed at 28 years old.  I am sorry that you and your mom are having to deal with this, but please know that the treatments are MUCH better than they were years ago.  So, even though you had a grandmother and an aunt that passed, treatments have come a long way.  Chances are that your mom will be just fine, and so will you!  Post away if you need help, support or have questions!",
      "MessageIndex": 1,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/700695",
      "Title": "Worried jennycat leaf"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 3, 2008 07:51PM mrs_X_Sunneedazee wrote: I am so sorry you got bad news.  It is so hard sometimes, isn't it.  I sincerely hope that you have good success with the new treatments.",
      "MessageIndex": 4,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720586",
      "Title": "Here we go again sunny365 sunny365"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 9, 2009 08:47AM mrs_X_Sunneedazee wrote: I just wanted to welcome you to the boards.  The support here is wonderful, whether you are young or old  There are a lot of us young stage 4's here.  I am 30, dx when I was 28.  Cancer is an emotional rollercoaster.  I have so much fear of leaving my 5 children motherless, I too struggle with not being able to be the mother I was before cancer.  That being said, I still am here, and able to hug and kiss my babies, listen to all they have to say, and share my love with them.  I wish I could do more like I used to, and some days this bothers me more than others.  Some days I am at peace with our situation.   Welcome to the boards, you will find so much love and support from the gals on this site.  ",
      "MessageIndex": 2,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728758",
      "Title": "new to board not mets pattih pattih"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 12, 2007 07:37PM mrs_X_Sunneedazee wrote: Kay, I was diagnosed in May 07 with stage 4 metastatic breast cancer with mets to the bones and lung.  I'll ditto what CTG said about the pain going away once successful treatment begins.  I remember when I went for my first tests and scans at the hospital, and my husband had to push me in a wheelchair to all of the different appointments because I couldn't walk.  I have been feeling great the last month, off my pain meds and have little to no pain.  I am on Taxol, Herceptin, and Zometa (which is a drug used to heal cancer eaten drugs that helps strengthen them).  It is a whirlwind, but once you have all the tests done, and a plan mapped out, life does slow down a bit.  Best of luck to you and your mom! ",
      "MessageIndex": 6,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693679",
      "Title": "Help!New diagnosis for my mom and we don't know where to begin! kay mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Mar 20, 2008 12:38AM mrs_X_Sunneedazee wrote: My deepest heartfelt sympathies...... Joanne was such a strength and an inspiration to us all. She gave so much support and love, and she will be missed. It is a tender mercy that her suffering is over, and I pray that her family and friends will find peace and comfort at this profoundly sad time......",
      "MessageIndex": 22,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702566",
      "Title": "Fare Thee Well Love.... joannes_brother lewisfamily503"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 29, 2008 05:10AM mrs_X_Sunneedazee wrote: Beverly, I am so sorry you got bad news, but I am glad that you were able to vent.  Some of the same things you said are the same things that drive me crazy.  I have had some recent progression, and will have to go back on Taxol and lose my hair again, so my brother already shaved his head again, and my husband says he will shave his as well.  I told them if they really wanted to be supportive, they would shave off their eyebrows and pluck all their eyelashes as well.  Yeah right, like that will happen.   I too hate the comment, you beat it before, you can beat it again.   Good luck to you, and feel free to vent whenever needed.  The ladies here are great, and I don't know what I would do without all of them! ",
      "MessageIndex": 12,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709693",
      "Title": "losing my head while all those around me... bevnurse Catherine45"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 29, 2008 10:22PM mrs_X_Sunneedazee wrote: Hi there! I recently did gamma knife for a single brain met.  It sounds like with 3 (I think you said) brain lesions you would be a candidate for gamma knife instead of whole brain radiation.  Gamma knife is a single high dose radaition treatment, and I am glad that I was able to do it, even though it was indeed a traumatic, painful experience.  The actual radiation was fine, it was getting the head frame placed that was painful, and the 4 spots where they screwed it into my head are still a little tender a month later.   I know what you mean about how disappointing it is to loose your hair again.  I too had a cute curly short hair do, and it was a lot more difficult to loose my hair the second time.  I did go buy 3 new cute wigs, that I actually like more than my out of control curls.  they are a lot easier to tame, however they are a little more uncomfortable than having my own hair.   I wish you all the best in your treatment decisions.  It is difficult to learn of brain mets, but it seems like we get used to the bad news, and just keep on keeping on.  It does help to have responsibilites and things to do.  What is the point of being here if we don't still enjoy things, or live life, right!  Best wishes, Amber ",
      "MessageIndex": 19,
      "PostDate": "29/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 26, 2008 12:01AM mrs_X_Sunneedazee wrote: No fair you are having to go through this stress!!!!  Big prayers and well wishes that everything goes okay for you and your daughter.  19 is WAY WAY too young to have to deal with this.",
      "MessageIndex": 5,
      "PostDate": "26/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720058",
      "Title": "\"STRESSED\" 3 MO scans for me and mammo for 19 yr old daughter. heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Mar 26, 2009 02:37PM mrs_X_Sunneedazee wrote: I am so happy for your good news. As far as your question about your bone mets pains, I've never heard that explanation before.  I do know that my bone mets hurt, even the spots that weren't currently very active on my last PT-CT scan.  I think our onc's don't have any idea when we ask questions so they just b.s.  I know mine does anyway!  He says my pain is from damage to the bones.  ",
      "MessageIndex": 14,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731388",
      "Title": "No brain mets or cord compression!! waterlily riverinerabbit"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 24, 2007 09:07PM mrs_X_Sunneedazee wrote: Yikes!  I wish I hadn't of read this. I really hope I don't have too much pain from surgery.  I talked to someone yesterday who had a mastectomy, and she said it really wasn't too bad.  Hope you are feeling better!",
      "MessageIndex": 23,
      "PostDate": "24/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/680051",
      "Title": "Post surgery NERVE PAIN seacat mjm1"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 14, 2007 10:16PM mrs_X_Sunneedazee wrote: Bimmer, I am crying for you.  I am so sorry.  I pray that Diane will be able to receive treatment on friday....  I pray for strength for you and her....  I am so glad that you share with us...  The knowledge and experience you give is priceless, and puts a real face on the terror and anguish and suffering this horrible monster causes.  God bless you and your sweet wife.   I pray you sleep well this night....",
      "MessageIndex": 2,
      "PostDate": "14/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695457",
      "Title": "Very advanced B.C. III: Battling the beast Bimmer JoyRebecca"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 10, 2007 02:59AM mrs_X_Sunneedazee wrote: Michelle, It is so wonderful that you take the time to help your mom, and the love and concern you have for her is amazing.  When my bone mets were at their worst right before I was diagnosed, I could hardly walk I was in so much pain.  When we would go to the hospital for tests, I had to be in a wheelchair (I was only 28 at the time).  Anyhow, I have been doing treatment for almost  months, herceptin, taxol and zometa for the bones, and I feel a thousand times better.  The zometa has done wonders for strengthening and healing my bones, and I would bet that once they get those bone mets under control, your mom will get some pain relief.  I will pray for you and your mother and family.",
      "MessageIndex": 3,
      "PostDate": "10/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693471",
      "Title": "My mom ejohn mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 9, 2007 12:27AM - edited Oct 9, 2007 12:27AM by mrs_X_Sunneedazee Jacque, it was nice to hear from you.  I pray for you and all of my cancer sisters everynight.  Hope that treatment kicks cancers butt, and you get feeling better fast!",
      "MessageIndex": 44,
      "PostDate": "09/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692955",
      "Title": "Ill jacqniel ozzie2"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 18, 2008 11:47PM mrs_X_Sunneedazee wrote: oohhh!  I love all the cute pictures!  My mom just got a brand new golden retriever puppy on Friday.  She is so so cute!  My husband hates dogs, so we will never have one, but at least I get to visit my moms. Thanks for sharing!  I love fun threads like these. ",
      "MessageIndex": 29,
      "PostDate": "18/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700523",
      "Title": "Your Furry Buddy JoyRebecca heatherpalmerton"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 1, 2007 04:38PM - edited Oct 1, 2007 04:38PM by mrs_X_Sunneedazee Jacque, I am sorry you aren't feeling well. Hope the chemo works well and soon so you can be back.  You always have such good advice and are so kind to everyone.  You will be missed!",
      "MessageIndex": 23,
      "PostDate": "01/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692955",
      "Title": "Ill jacqniel ozzie2"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 19, 2007 12:00PM mrs_X_Sunneedazee wrote: Hi Mary Jo, Hope you are doing okay after your first treatment.  Yes I am doing 16 of the taxol, but I didn't have the AC.  I will have another PET-Ct scan once I finish with the 16 doses, and may even have to do more, because my cancer was so far progressed.  I don't eat that much due to lack of appetite, and I am too fatigued to \"exercise.\"  I do have 5 kids that keep me hopping, though! ",
      "MessageIndex": 9,
      "PostDate": "19/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692112",
      "Title": "16 weekly Taxols-anyone else? bluewillow mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Mar 23, 2009 04:35AM mrs_X_Sunneedazee wrote: I just wanted to add my well wishes and sympathies.  Your post struck such a chord with me, as I have felt so similar so many times.  I too have young children, and it is heartbreaking to battle this disease with so much at stake.  I only had a solitary lesion, and the radiation did a great job.  That was 7 months ago, and it is still shrinking. WHen I was dx with brain mets I thought I was a gonner, and didn't understand that you could survive something like that.  You can get through this, you will.  It is a difficult path you journey, but not one you journey alone.  Let us know how you are hanging in there!!! ",
      "MessageIndex": 27,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730968",
      "Title": "It hasn't even been a year :( HELP! ekenny315 Makratz"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 17, 2007 01:07PM mrs_X_Sunneedazee wrote: I too am doing weekly Taxol and Herceptin.  My onc said it lessens the side effects to do the smaller doses.  I go once a week for 3 wks and then get 1 wk off.  Tomorrow will be  dose 13.  I have some muscle and bone pain in my legs for a couple of days after treatment, kind of feels like the flu.  I have hot flashes and burning in my hands. Hardly any nauseau, just getting more and more fatigued as time has gone on.  As long as I get a nap every afternoon I feel lots better.  I haven't gained any weight from the steroids.  Good luck with your treatment.  It truly isn't as bad as I thought it was going to be. ",
      "MessageIndex": 7,
      "PostDate": "17/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692112",
      "Title": "16 weekly Taxols-anyone else? bluewillow mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 6, 2007 07:10PM mrs_X_Sunneedazee wrote: I had a mastectomy on 10-25 and I have a lot of pain in my ribs.  My mast. scar line is numb, but above and below it I still have a lot of swelling and pain.  The other day, I overdid, and it felt like I had a broken rib stabbing into my lung.  So, your pain could be related to surgery.  If you are concerned, I would call your dr. ",
      "MessageIndex": 5,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696497",
      "Title": "rib pain floridadwg mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "May 14, 2007 05:06AM mrs_X_Sunneedazee wrote: I had an ultrasound tech and then the radiologist tell me that my breast tissue was \"normal breast tissue\" when it was really Inflammatory breast cancer. They didn't see it until I had a Mammogram. I would insist on identifying the lump. By the way, I am only 28.",
      "MessageIndex": 4,
      "PostDate": "14/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/606059",
      "Title": "\"nothing\" in ultrasound, but still feel lump Mongoose jz20022001"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 20, 2007 02:36PM mrs_X_Sunneedazee wrote: FABULOUS news!!  So happy for you!!!",
      "MessageIndex": 2,
      "PostDate": "20/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697213",
      "Title": "Scan results with a good news shend debstitchestoo"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 21, 2007 12:50PM mrs_X_Sunneedazee wrote: great news!  I am so happy for you!!!!!",
      "MessageIndex": 15,
      "PostDate": "21/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695684",
      "Title": "Dancing with NED!!! tropicmom ozzie2"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 27, 2007 07:08PM mrs_X_Sunneedazee wrote: Thanks for sharing your experience.  I go in for my simulation and tattoos tomorrow.  Good luck with your treatment!",
      "MessageIndex": 1,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/696085",
      "Title": "Had my simulation and tatoo's it was okay snowyday mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 20, 2007 11:46AM - edited Dec 20, 2007 11:46AM by mrs_X_Sunneedazee I know this is a scary time.  My first posts sounded so much like that.  I thought I would be dead in 6 months. I was diagnosed with mets to lung and bones May 07.  I am her2+ also. I have had MIRACULOUS response to treatment (herceptin and Taxol).  I feel great, and never would have thought I would still be here 7 months later, feeling better than I did before I was diagnosed.  There is hope, don't forget that!!!!!  Good luck to you and your sister.",
      "MessageIndex": 5,
      "PostDate": "20/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697203",
      "Title": "Stage IV with mets sdurantmd katie11"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 6, 2008 02:55AM mrs_X_Sunneedazee wrote: just a guess, but maybe because the results were good, there is no reason for chemo at this time.  So, just treating the side effects of cancer, which is pallative i.e. pain meds etc, until the cancer grows again and chemo is indicated?  I am triple + so I will have continued herceptin or tykerb to keep my cancer at bay, as well as hormonal drugs.  My doctor has told me that there is no possible cure or remission for me.  Stable is the best I can hope for.   Maybe ask over on triple negative board?  I am sure they run into this thing more.   ",
      "MessageIndex": 4,
      "PostDate": "06/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720671",
      "Title": "urgent advice in need ganga mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 5, 2008 11:44PM mrs_X_Sunneedazee wrote: Cheryl- How did you know exactly how things are in my house!  My husband even says the same thing about hiding food!!!!  I am sorry that you have to deal with this, because I KNOW how frustrating it is.  Just know that your kids are normal, and they act out and take advantage of mom being sick. Sad but true.  I know I feel better knowing that I am not the only one with kids that act like that.  IF you find some magic answer on how to fix the problem short of locking them in the basement (just kidding) let me know!!!!",
      "MessageIndex": 4,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725493",
      "Title": "What happened to my well behaved kids? mason204 pinoideae"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 30, 2008 08:34PM mrs_X_Sunneedazee wrote: I have the same problem with pins and needles, and circulation issues in my right arm. I too have cancer actively growing in my lymph nodes in the same areas.  My doctor told me that it is because of the mets in the nodes, and there is nothing specific they can do to help it. I am already on blood thinners due to blood clots, and the only thing that I have found to help is a warm rice bag (or heating pad) on my shoulder.  It seems to help with the circulation issues.  I hope you can get some relief.  I always wake up with pain during the night, and my arm hurts very badly in the morning until I can get it moving.  I am sorry you are suffering the same thing, but it helps me to know that I am not the only one.  Good luck!",
      "MessageIndex": 3,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726501",
      "Title": "Arm falls asleep/painful Stefanie Stefanie"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 11, 2009 12:37AM mrs_X_Sunneedazee wrote: Cheryl, I totally understand the feelings that you expressed.  It is so frustrating to try to figure out which steps to make, which treatments to take, and when is enough, enough.  I think that when you are ready to quit being abused by treatments that are only hurting you and not the cancer, you will be ready.  You will know what to do.  Have faith, and keep fighting while you can.  My oldest child is 14, my youngest 3, and it is so hard to think that I won't be here for them every step of their lives.   I just have to remember that although I CHOSE to stop fighting my cancer, I DID NOT CHOSE to have cancer. Therefore, I DID NOT chose to die.  Choosing to have treatments does not mean choosing to live.   I am sorry that you are feeling the frustration as you feel like you are a burden to your family, I feel like that every single day.  I just hope that you can find some peace, and that you will have strength to do what is best for you.  I will pray for you. love, Amber ",
      "MessageIndex": 13,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738716",
      "Title": "My cancer-induced vent mason204 leggo"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 5, 2008 12:11PM mrs_X_Sunneedazee wrote: Her name is Kim Franklin.  I am SO SAD!!!  Kimmie and I were going through IBC at the same time, and it always breaks my heart when one of my sisters pass away.    I pray that God will comfort her family.   So sad.......  no words can express the regret. ",
      "MessageIndex": 5,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708542",
      "Title": "Kimmie 39 ozzie2 mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 12, 2007 10:56PM mrs_X_Sunneedazee wrote: Hi crazymomof4....  I am a crazymomof5.  Anyway, I have IBC, and first biopsy (a frozen section) came back negative, however the punch biopsy and the lymph node biopsy I had done at the same time came back positive.  From what I have read, IBC is hard to diagnose by biopsy because there is no defined tumor a lot of the time to biopsy.  I had a lot of pain from bone mets in my hip as well, but it is hard to say if your  grandmother-in-law's pain is from old age, arthritis, or something else.  I was brushed off for more than a year before my IBC was finally diagnosed.  My right breast had a large mass the size of a baseball full of cancer before a DR I went to finally took me seriously enough. Because I was a breastfeeding mother, my ob-gyn kept on telling me it was mastitis, engorgement, clogged milk ducts etc.   I thank God every day that I found this site and was able to read about this terribe disease, otherwise I probably wouldn't be alive right now to type this.   I hope that it does turn out to be nothing, but you do need to be agressive and find out what exactly is causing her problem.   ",
      "MessageIndex": 1,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/693525",
      "Title": "inflammed breast- biopsies negative- Missed diagnosis? crazymomof4 crazymomof4"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 18, 2008 08:36PM mrs_X_Sunneedazee wrote: I wasn't put all the way under, but I was totally out of it and don't remember a thing.  They gave me some kind of medicine via IV. I wasn't aware that there are different kinds of ports. I have a 3 inch incision, and mine was quite sore for a  week. It hurt to put my arm up to brush my teeth or wash my hair.  Then it took forever to heal, because they started chemo 4 days after I had it put in.  Then my 1 year old head butted me and split the incision open, then it got infected.  It took about 3 months before it wasn't an ugly oozing wound.    It bugged me at first having this hard thing right under the skin, but I am used to it now.  If my now 2 year old bumps it it still hurts.  People ask me all the time when I am going to get my port removed.  Sadly, I have to tell them....  never....   I wonder if they ever wear out?",
      "MessageIndex": 7,
      "PostDate": "18/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700591",
      "Title": "port Tracy1964 LoriFL"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 23, 2007 06:10PM mrs_X_Sunneedazee wrote: I am currently receiving rads to my intermamary nodes.  They are doing whole breast radiation, plus a couple of other areas because of where the cancer was (in the bones of my ribs and sternum).  I think the hope is to kill as many cells as they can in a treatment area to prevent a local reccurrence.  I don't have any experience with xeloda.  I do know that I have had 11 treatments, and that area along my sternum is oh so tender and swollen.  Hope it is doing it's job and zapping those cancer cells. ",
      "MessageIndex": 2,
      "PostDate": "23/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697307",
      "Title": "Inter mammary node lali AliceJean"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 14, 2007 05:08PM mrs_X_Sunneedazee wrote: Ter, hope everything went well today and you get good news!!!!",
      "MessageIndex": 7,
      "PostDate": "14/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696859",
      "Title": "See onc tomorrow Thursday Ter manos"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Apr 17, 2009 01:37AM mrs_X_Sunneedazee wrote: Great news!  It is always refreshing to hear about success stories.  May you continue to have chemo work for you!",
      "MessageIndex": 4,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732573",
      "Title": "Results are stable! sydpen2 lovinmomma"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 17, 2008 05:35PM mrs_X_Sunneedazee wrote: hmmmm, I hadn't hear of shoulder pain being a side effect of liver mets.  My right shoulder hurts really bad, but I do have bone mets in there, plus some arthritis from the hormonal drugs.  I am developing pretty severe degenerative disease in my knees and shoulders from my Aromasin AI hormonal pill they have me on.  At least when I do the Taxol, they will take me off of aromasin and try something else.",
      "MessageIndex": 6,
      "PostDate": "17/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709146",
      "Title": "shoulder pain Tracy1964 mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 6, 2008 05:58PM mrs_X_Sunneedazee wrote: kimmy, I just wanted to add my what the Heck is he thinking comment to the rest them.  It never ceases to amaze me how some people who have a loved one with cancer make the cancer all about them instead of the person actually suffering from the disease.  Hello, how happy are we being sick, and bald, and going through surgeries and suffering?  Luckily, my husband is a wonderful caretaker, and if the roles were reversed, I don't think that I could be as wonderful as he has been.   I am glad that your husband is trying to backpedal, but his attitude etc is the last thing you need to deal with along with everything else.  hang in there!!!",
      "MessageIndex": 30,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725464",
      "Title": "gripe - hubby not happy... kimmytoo pee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 11, 2009 01:59PM mrs_X_Sunneedazee wrote: Heidi, I am sorry you are going through such a difficult time, with bad news, and a undesirable treatment that goes with it.  This whole cancer journey is very rough some times.  I will pray that you have strength to endure the treatments, and pray that they are effective in killing those mets. Love, Amber ",
      "MessageIndex": 43,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Mar 23, 2009 03:02PM mrs_X_Sunneedazee wrote: I have bone mets on my spine, and I do get the pinched nerve tingling pins and needles feelings quite often.  That along with A LOT of pain.  I can point to right where the mets are because they hurt in very exact spots.  The symptoms you are experiencing could be from a lot of things, so I echo all of the others when I say check with your doctor, and ask for scans to rule out bone mets. No need to live in fear!",
      "MessageIndex": 25,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731066",
      "Title": "Bone Mets Symptoms jdash mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 7, 2008 04:30AM mrs_X_Sunneedazee wrote: Deb- I am so glad that things went well.  May you speedily recover, so we can see your smiling face over here making us laugh!!!  lots of hugs!",
      "MessageIndex": 233,
      "PostDate": "07/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 19, 2007 06:54PM mrs_X_Sunneedazee wrote: I still have joint and muscle aches in my legs, knees and hips, and I am one month out from chemo. Of course I have cancer in my hip and femur, and I am sure that contributes to it, but I am only 29 and it is no fun to ache like a 90 year old.  At least it doesn't hurt as bad as it did before the chemo.  I am on blood thinners so I can't take ibuprofen, wish I could.  Just wanted to let you know that you weren't the only one.   ",
      "MessageIndex": 10,
      "PostDate": "19/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/693806",
      "Title": "Joint pain after chemo Jesse Jesse"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 2, 2008 04:44AM mrs_X_Sunneedazee wrote: SO happy that you got some good news!!!!  Enjoy your trip!",
      "MessageIndex": 3,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/718921",
      "Title": "stable -- YEAH! kimmytoo Poppy"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 9, 2009 12:02PM mrs_X_Sunneedazee wrote: I think sometimes we do get all caught up in the negative.  It is nice to hear about some good things happening in all of our lives! Life has had some good moments these last couple of weeks. 1.  My \"baby\" turns 3 this week! 2.  My liver is still clear of cancer. 3.  My hair is growing back, I have 1/2\" of thick hair covering my head. 4.  Yesterday was warm and sunny. 5.  I got a new wheelchair so I can go out more!  We went to the mall for the first time since September 6.I get to go to St. Martin with my husband for a week of warm, sunny, relaxing, vacation! 7.  I am taking a self-prescribed month off from chemo!!  (I have done 6 months of chemo, and I deserve a break.  I need to get my strength up for my vacation!)",
      "MessageIndex": 9,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728749",
      "Title": "Everyday I try to... luvtotravel EWB"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 14, 2007 05:02PM mrs_X_Sunneedazee wrote: Joanne, thanks for sharing your news.  I am sorry it isn't all the way good news, but am glad that there are no new spots.  I hope you have a speed recovery from this chemo and can enjoy Christmas. ",
      "MessageIndex": 3,
      "PostDate": "14/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696929",
      "Title": "Scan Results: \"Stable - more or less\" joanne1428 lisacatq"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 1, 2007 06:55AM mrs_X_Sunneedazee wrote: Another angel in heaven, my heart is breaking.  I am so sorry for your loss......  Thank you for sharing with us.  May you and your family find strength and peace. ",
      "MessageIndex": 18,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696254",
      "Title": "Jeannie44 Jeannie44 73gr"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 2, 2008 01:33AM mrs_X_Sunneedazee wrote: Oh this is just breaking my heart.  I will pray for Dawn.  She was one of the first gals I met on chat when I was new and scared to death, and she was so kind and reassuring.  God is a God of miracles, and if it be His will, Dawn will be able to receive treatment, and beat this cancer back.  ",
      "MessageIndex": 37,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/718844",
      "Title": "Definely Crunch Time for Zarowny!!! hollyann BethNY"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 25, 2007 12:00AM mrs_X_Sunneedazee wrote: Pnut, Welcome back and hope you are still recovering well.  I am dreading surgery, but can't wait until it is done and recovered.  (I am doing chemo now and just finished 4 months.  1-2 more months to go before I have mastectomy.)  Hugs!",
      "MessageIndex": 3,
      "PostDate": "25/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/692302",
      "Title": "i am back!! pnut2 sue_blue"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 3, 2008 01:17PM mrs_X_Sunneedazee wrote:  How cute you all are!  Thanks for sharing pictures.  I love Halloween, but was too sick to enjoy it very much this year.  Last year I had a mastectomy and hysterectomy 6 days before Halloween, and this year I was sick from chemo.  Here we are on Halloween.  I was so sick that day, so my husband was in charge of trick or treating.  The kids had fun.  My 13 year old didn't dress up, but the other kids were a Jedi, Eeyore, A princess, and \"Super Mom\".  ",
      "MessageIndex": 25,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723722",
      "Title": "Halloween pictures Fitztwins tooyoungtohavebc"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 17, 2008 04:50AM mrs_X_Sunneedazee wrote: Happy Birthday!  May you celebrate many more!!!!",
      "MessageIndex": 9,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724583",
      "Title": "Riverinerabbit is 50 Nov 18!!!! saint faithandfifty"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 17, 2008 04:49AM mrs_X_Sunneedazee wrote: I have cancer in my breast skin, (Inflammatory breast cancer) so I have a lot of itching and burning.  I hope yours is just some skin irritation, but it is good that you are seeing your doctor.  Good luck!",
      "MessageIndex": 3,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724594",
      "Title": "Is tingling, itching around scar a sign of recurrence? Linora Linora"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jan 30, 2009 05:45AM mrs_X_Sunneedazee wrote: I am just so upset and saddened when I read about Deb passing away.  She always was such a laugh, and I loved her avatar.  Deb and I were both having similar double vision, nausea, blurred vision etc. at the same time.  I was diagnosed with a single brain met a day or so before her dx of spinal fluid mets.  I feel so guilty when I am still here and another dear sister has passed away.  It is so hard to make sense of this disease, and why things happen the way that they do. I will pray for peace and comfort for John and his family.  I know Deb is free from pain and suffering, and is probably having a riot up in heaven.   ",
      "MessageIndex": 311,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 25, 2008 04:15PM mrs_X_Sunneedazee wrote: well, speaking of topless, I have a question for you all.... If you had a double mastectomy, does that mean you can go out topless like a man or would that be indecent exposure.  I know it would be if you exposed breasts, but if you don't have them, could you go topless.  LOL Hmmmmm..  Things to think about. I know in my case if I show how bad I look after surgery, that would definately be INDECENT!!!  (To put it mildly!)",
      "MessageIndex": 22,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709551",
      "Title": "What is exotic for BALD? LuAnnH LuAnnH"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 10, 2007 11:50AM mrs_X_Sunneedazee wrote: When my doctor was talking about possibly radiating my hip and pelvis, he said it would only be for a couple of weeks.  The chemo I did took care of the pain in my hip though, so no rads needed at this time.  Good luck!!!!",
      "MessageIndex": 1,
      "PostDate": "10/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696666",
      "Title": "Radiation for how long? Catgo debstitchestoo"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 3, 2007 01:15PM mrs_X_Sunneedazee wrote: THANK YOU so much for all of your well wishes and support.  I honestly would not be able to deal with this as well as I have without the support of this site.  I have tears in my eyes and am simply overwhelmed by the sisterhood and blessings I have received during this journey.  Thank you from the bottom of my heart!",
      "MessageIndex": 25,
      "PostDate": "03/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696265",
      "Title": "Good news amongst the bad..... mrs_X_Sunneedazee mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 29, 2008 03:45AM mrs_X_Sunneedazee wrote: How frustrating that must be!  I think the longer I go to my oncs office, the more the staff just take you for granted and don't give the care that should be expected.  One of the infusion room nurses at my oncs used to sit and visit with me while I was receiving treatment, and we laughed and enjoyed each others company.  Now she barely talks to me.  Weird.  I wonder if maybe she doesn't like to get too attached to patients.  I also am on first name basis with all of the staff, and know my way around getting test results etc.  I have to be really proactive of my care, or the staff forgets what pre meds I am supposed to have, or how fast or slow to run my IV.  I just want them to take care of me.  Isn't that what I am paying them for???? I too would love to stick them with the needle for once...... ",
      "MessageIndex": 1,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709837",
      "Title": "Hate My Onc's Staff TrixieTumor swimangel72"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 23, 2007 02:32AM mrs_X_Sunneedazee wrote: CTG_ Hope you are feeling well.  We are all thinking of you and praying for you.  Praying that the chemo will work and you will be back here with us soon!",
      "MessageIndex": 32,
      "PostDate": "23/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695839",
      "Title": "CTG how are you? LuAnnH delorisann"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 22, 2007 11:37AM mrs_X_Sunneedazee wrote: Oh my gosh, what a HORRIBLE term.  Yuck.  As if anyone would ask to go through this, and then have to be considered a b***h because they aren't considering other's feelings.  I know in my experience, I have apologized to my husband and parents and children, and siblings and friends so many times about inconveniencing them, and causing them worry and pain.  They tell me repeatedly that I don't have anything to apologize for and to quit saying sorry.   As if we don't have to worry enough about battling this illness, now we have to worry about being conceived as cancer b***ches.  Sheesh.   ",
      "MessageIndex": 12,
      "PostDate": "22/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694201",
      "Title": "Desperate Housewives, \"cancer bitch?\" Catgo emmagoldman"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 12, 2008 03:32AM mrs_X_Sunneedazee wrote: Deb, hang in there girl!!!!  I know some small part of the misery you are going through, and it is SO HARD!!!!  My tumor was pushing on my optic nerve, so one eye of mine was blurry and reading or watching TV or anything was making me dizzy and nauseated.  I know you are so much more worse, and I can't even imagine.  I hope you get some relief soon!!!!!!!!  We all love you!!!",
      "MessageIndex": 10,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721061",
      "Title": "Feel stuck in place....venting AlaskaDeb RIV54"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 18, 2007 10:24PM mrs_X_Sunneedazee wrote: Bimmer, I pray that you will have peace and comfort.  Your love is a shining example to all of us.",
      "MessageIndex": 90,
      "PostDate": "18/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697113",
      "Title": "Very advanced B.C.: Diane's final gift. Bimmer ilenee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 25, 2008 07:40AM mrs_X_Sunneedazee wrote: oh Stephanie, this just breaks my heart.  I do so admire your faith.  I am glad that you have that to help guide you in your choices, and you have it to strengthen you at this difficult time.  Much good has come of your sickness, and part of that is the good that you have been able to do on this site, sharing your faith, and testimony, and helping to lift others burdens with your wonderful attitude.  I hope you will have peace in whatever option to pursue, and I will pray that you will receive inspiration and guidance.  Much love, Amber",
      "MessageIndex": 17,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709616",
      "Title": "Protruding Chest Nodule: Please pray TripleNeg Felicia"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 19, 2008 12:44AM mrs_X_Sunneedazee wrote: Lori- You made me laugh!  I will definately use that when people ask me about being \"done\" with chemo.  I wish my port was in a lower place so it isn't so visible .  It is pretty high, (just below my collar bone) and the scar is pretty ugly.  That coupled with the prominent veins sticking up also.  Very weird looking.  I guess it isn't as bad as the other side, with no breast, or cleavage, huh!  Maybe I should just wear turtle necks!  haha! Tracy- I didn't mean to sound so negative and make a port sound scary- It really isn't.  I just had to complain about my experience. ",
      "MessageIndex": 10,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700591",
      "Title": "port Tracy1964 LoriFL"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jan 13, 2009 01:46AM mrs_X_Sunneedazee wrote: I logged in tonight and was so very touched by every single word you lovely friends have written for me.  I am so glad that I am not the only one who struggles with these issues and feelings.  Thanks for helping me gain a better prespective of myself and my role as a mother.  I have been placing too much value on what I do or don't do than what I am and can be for my children.  I love their hugs and kisses, and if that is the only thing I can give them, it is enough.  I have spent the day in bed crying and feeling quite sorry for myself, but tonight after reading all of your messages of support, I feel so much better.  I am so grateful for all of you who have taken time to help me in my hour of need.  God bless you all!!!!!   I will have a lengthy discussion with my Onc. about what I can do to get a better handle on the emotional issues, because there is more to health than just physical health.  I am going to try to dig deeper, and pray harder for the strength I need to continue to fight.  I am not ready to die, I am just having a hard time adjusting to my life as it is now.   Thank you all for your kindness and support.  I am so grateful for you all sharing your experiences and personal stories.  It helps to know that I am not a horrible person for having these feelings.  I will be brave and start another week of Xeloda (I have already done 3 weeks of it 1 wk on and 1 wk off) and try to have faith that it will help.  No pain, no gain right?   Thanks again, Love, Amber",
      "MessageIndex": 32,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727168",
      "Title": "I am ready to quit.... mrs_X_Sunneedazee lovinmomma"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 13, 2007 03:25AM mrs_X_Sunneedazee wrote: I have bone mets.  They are in my hip, spine, pelvis, femur, and ribs.  The pain started in my low back and gradually spread as the cancer did.  From January until May it got worse and worse.  For about 4 months I had so much pain, I couldn't walk, climb stairs, lift my 1 yr old.  I had an MRI in March, it showed nothing but a couple slightly bulging discs.    I don't know if they would have seen the cancer, had they been looking for it, but I was only 28.  The dr who ordered the MRI ordered it to look for bulging discs.  I did physical therapy, epidural injection, therapeutic ultrsound, decompression, but the pain got worse and worse.   I was laying on an ice pad every night along with taking Narcotic pain medicine just to go to sleep.  MISERABLE! My bone mets were dx by a bone scan and confirmed with xray (the day after I was finally dx with breast cancer after  more than a year of being brushed off by dr after dr).  I hope that in your case the pain is not mets, but I wouldn't be put off until they can pin point what is causing your pain.  Good luck!",
      "MessageIndex": 2,
      "PostDate": "13/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693724",
      "Title": "Bone mets nursecal awjkej"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 18, 2007 04:10PM mrs_X_Sunneedazee wrote: Hey Jackie, I am such a follower!!!  Hi gals, I have had 8 radiation treatments, and will be receiving radiation throughout January as well, so I would like to visit you all on this thread too. I am starting to feel a little fatigued, but I'm always tired at the end of the day anyway.  I am a stay at home mom of 5 kids, but my second occupation is a cancer patient.  I spend about 14 hours a week driving to and from the hospital, and at various dr. appointments. I wish you all the best and look forward to getting to know all of my rad sisters. ",
      "MessageIndex": 8,
      "PostDate": "18/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 31, 2009 11:27PM mrs_X_Sunneedazee wrote: Bettelou, I am so sorry that you have mets.  I will pray for you, that chemo will help beat that cancer, and that you and your new husband can enjoy many more years together.  I love how you have the mantra Don't postpone joy.  Just remember that. p.s. Thanks for all of your words of support on my blog site.  I appreciate your support and feel such a kinship with you.   ",
      "MessageIndex": 9,
      "PostDate": "31/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738075",
      "Title": "Where do I go from here? bettelou68 bettelou68"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 29, 2008 05:46AM mrs_X_Sunneedazee wrote: I had IBC with a really large tumor, so I did neoadj chemo to shrink it down before surgery.  It was kind of nice to see the chemo working as my tumor visibly shrunk.  Good luck!!!!!",
      "MessageIndex": 2,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709810",
      "Title": "Anyone done neoadjavant chemo? mommy3abm Joyceska"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 10, 2008 02:33AM mrs_X_Sunneedazee wrote: Here is a copy of Kim's obituary.  I knew her pretty well from these boards, and from IBC supprort mailing list.  She fought so hard, and she was so  determined, yet she always took the time to help others in their fight.  My heart is truly breaking because of this.....  Paid Obituary",
      "MessageIndex": 30,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708542",
      "Title": "Kimmie 39 ozzie2 mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 30, 2008 01:28AM mrs_X_Sunneedazee wrote: I will have to check it out, as it looks like I am having progression again on herceptin/taxol.  Haven't tried tykerb yet, kind of scared of that one.  It is on the \"to-do\" list.",
      "MessageIndex": 4,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721963",
      "Title": "super herceptin YHong mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 3, 2008 12:09AM mrs_X_Sunneedazee wrote: Jon, thank you for sharing such a beautiful post with us.  I miss seeing Kari's beautiful avatar around here.  She sounds like she was a wonderful wife and mother.  I went and listened to both of those songs on you tube, and they were beautiful.  My husband and I are feeling a little sentimental tonight, so they both touched us.  Just continue to have faith like the song says.  Believe that Kari is still with you, not in body for now, but in spirit.  ",
      "MessageIndex": 169,
      "PostDate": "03/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 9, 2009 09:41AM mrs_X_Sunneedazee wrote: Thank you all for checking up on me again.  I have had a hard time visiting this site lately because of all the dear friends who have passed away.  It makes me so nervous and scared that one day this will be me.  As I read about the passing of all our dear bc sisters lately I am filled with deep melancholy and sadness.  As for an update on me.  My last Pet-Ct from Jan 22nd  showed  that all of my tumors are more metabolically active with higher SUV numbers than before.  There also is suspicious areas of densities in my right lung that are showing uptake. They are not sure if it is cancer, and the area where they are is too risky to biopsy.  My tumor markers have also continued to rise.  It seems like the chemo isn't doing much. I have decided to take a month off from chemo, get feeling better again, and try to get my strength up again.  My husband is taking me to St. Martin, and island in the Caribbean in 2 weeks.  We will spend a week together at a beach front condo.  I can't wait to spend some alone time with my love, and can't wait for the warm sunny beaches, and floating in warm water.  That is the best pain relief!!!  ",
      "MessageIndex": 68,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727168",
      "Title": "I am ready to quit.... mrs_X_Sunneedazee lovinmomma"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 27, 2007 08:47PM mrs_X_Sunneedazee wrote: Every time I hear of another beautiful woman dying from this terrible disease, it breaks my heart.  I am so sorry for the families loss, and pray that they will find peace and comfort at this difficult time in their life. I remember reading her posts, and I was so encouraged and amazed at her will to fight and share and help others.   She will be missed! ",
      "MessageIndex": 25,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695981",
      "Title": "Another Angel.....Stage4.....Kathy.. Traci-----TripNeg Calico"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Mar 23, 2009 12:39AM mrs_X_Sunneedazee wrote: I am so sorry you and your family are going through this hard time.  I believe that support needs to be given to family members of those who are suffering through stage 4 disease if they need it.  I hope they can give your grandma some relief, and can come up with a plan to help her.  I will pray for you, your grandmother, and your family.  Please keep us posted!",
      "MessageIndex": 2,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731142",
      "Title": "Grandma Update kisersassy Analemma"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 23, 2008 08:28AM mrs_X_Sunneedazee wrote: Robin, I admire your attitude and your spirit.  I too HATE cancer, and echo many of your sentiments.  Good luck with your new treatment!",
      "MessageIndex": 4,
      "PostDate": "23/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719873",
      "Title": "Back from Boston with a surprising treatment recommendation RobinWendy roseg"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 22, 2007 09:40PM mrs_X_Sunneedazee wrote: oh my gosh, that sounds so scary.  I am so sorry!!!!  Thanks for updating us.  I hope you can get through this without anymore scares like this!!!!!  I will remember you in my prayers.",
      "MessageIndex": 52,
      "PostDate": "22/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696563",
      "Title": "OMG Brain Mets for me BJW Maya1"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 6, 2008 08:41AM mrs_X_Sunneedazee wrote: I am so sorry that you got this diagnosis.  Seems those low verts. cause a lot of nerve problems.  I have cancer in several verts. including l4 and l5.  The bone drug Zometa has helped, and chemo has slowed the growth.  Chemo has kept my bone mets growing slower, but they are still spreading.  I am thinking about doing rads on the ones in my hip because of all the pain, and I know that they sometimes to rads or surgery on spinal mets if they are putting you in danger of breaking or spinal chord compression.  Some of my vertabrea mets i don't even feel.   I hope that you can get some good treatments going so you can get feeling better!",
      "MessageIndex": 8,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725471",
      "Title": "What I didn't want to hear GEECH WingsofHope"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 12, 2007 05:22AM mrs_X_Sunneedazee wrote: I am 28 years old and 4 months into chemo. I only had a few gray hairs when I started chemo. My hair (which I shaved) is starting to grow back really fine and WHITE (I had thick dark borwn hair before) Is there any hope that when I finish chemo that it will grow back the normal color, or am I doomed to\"dye\"? (No pun intended)",
      "MessageIndex": 10,
      "PostDate": "12/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/691947",
      "Title": "If Your Hair Grows in Gray or White figsgirls Diana63"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 17, 2008 10:48AM mrs_X_Sunneedazee wrote: I have cancer growing under my armpit and believe you me, the pain is intense and constant!!!  It is very tender to the touch, and I can't even stand to wear a bra most days. I hope yours isn't a recurrance, and just a fluky phantom pain.  Watch your symptoms, and if they are more constant or you continue to worry, be sure to visit your Doctor!!!",
      "MessageIndex": 3,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724593",
      "Title": "Hpw do you know when pain = recurrence jazzydog2 ozzie2"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 30, 2008 07:33AM mrs_X_Sunneedazee wrote: I am so sorry for your loss.....  I pray that your find peace and comfort, and I hope that the donations that are made in her name will make it so a cure can be found, so we don't have to continue loosing our lives and the lives of loved ones to this terrible disease. love, amber",
      "MessageIndex": 27,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721900",
      "Title": "My Val feeval ozzie2"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Dec 5, 2008 07:48PM mrs_X_Sunneedazee wrote: You are a brave and strong woman.  I will add my prayers to the many others that your treatments will bring relief, and that you will have continued time with your friends and family. ",
      "MessageIndex": 45,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725446",
      "Title": "Now under Hospice/Palliative care Kasey RobinWendy"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 19, 2007 06:50PM mrs_X_Sunneedazee wrote: I too was shocked when I received my first bill for my chemo.  (Herceptin Taxol and Zometa, plus all of the premeds)  I was sure it was a mistake.  there was no way one treatment cost $4000, I thought for sure they were charging me for everything up front or something.... Well, turns out, it really was that expensive.  I will be on Herceptin the rest of my life.  Each week with my visit to the onc. and treatment is $1200, and I have to pay 30% of it.  Luckily our insurance covers at 100% after you pay $5,000 out of pocket.  It starts over every year.  I am grateful to have the coverage, but it sure stinks to have to pay that much money..... ",
      "MessageIndex": 7,
      "PostDate": "19/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/695635",
      "Title": "Price $$$ of Chemo CherylHanson mrs7148"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 5, 2008 12:16PM mrs_X_Sunneedazee wrote: NOOOOOOOOOOOOOOOOO!!!!!! I am so sad.  I have been away on vacation for a week, and I come back and find two of our sisters have passed.  How does this happen?????  Why can't there be a cure????   Kari was always so thoughtful, and so hopeful and such a strong, caring woman on this site.  My heart aches for her family and friends.  I pray that we can all find peace at this heartbreaking time......... ",
      "MessageIndex": 129,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 6, 2008 04:50AM mrs_X_Sunneedazee wrote: Thanks for sharing those pictures!!! We miss erin so much.  Little kayleigh is so beautiful.  You look like you are doing a great job.  ",
      "MessageIndex": 3,
      "PostDate": "06/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720190",
      "Title": "This weeks puppy pics.. ForTheMoment jeanne46"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 20, 2008 02:28AM mrs_X_Sunneedazee wrote: I am not a camper, and love that I have the excuse of cancer to get out of having to go camping.  We only have a tent and air matresses.  I do like being out in nature, and hiking, and seeing the beauty.  I just don't like not having the showers, and beds etc. ",
      "MessageIndex": 37,
      "PostDate": "20/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709124",
      "Title": "Camping, anyone? SunshineSmiles Fitztwins"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 18, 2008 02:26AM mrs_X_Sunneedazee wrote: That is AWFUL!!!  I really do have cancer, and feel guilty becuase of all the service and things people do for us, I can't imagine accepting help like that if I didn't really have cancer.  So pathetic......",
      "MessageIndex": 4,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721335",
      "Title": "Scammer uses cancer for cash tropicmom pinoideae"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 29, 2008 06:12AM mrs_X_Sunneedazee wrote: Dana, when I had my hysterectomy and ooph. they did it all laproscopically.  You would have to find a GYN who has been trained on that surgery.  It was much better just having 3 small incisions, rather than a long one.  Of course, I had this done at the same time as my mastectomy, so I was pretty miserable for a while.  Not that any of this is fun, huh!",
      "MessageIndex": 9,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709713",
      "Title": "Tamoxifen for Liver Mets LilWarrior LilWarrior"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 14, 2008 01:46AM mrs_X_Sunneedazee wrote: msnelson, so what is the next step?  Will you have a biopsy?  Honestly, the worry and the waiting is the hardest part.  Once you know what the diagnosis is, you can deal with it and treat it and move on.  I am sure it is especially worrisome to you with your family history, but odds are that it isn't cancer.  Be proactive, and find out for sure what the spots are.  Please keep us posted, and take care of yourself! ",
      "MessageIndex": 9,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707217",
      "Title": "32 and majorly worried msnelson2006 mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Mar 19, 2008 10:09AM mrs_X_Sunneedazee wrote: I have been on Zometa every 4 weeks for 10 months. I now only have it every 6 weeks. I alternate: Every 3 weeks Herceptin, then the next three weeks Herceptin & Zometa. The times when I have both Herceptin and Zometa, I feel achy and flu like for a day or two after treatment. My onc says I will be on it along with the herceptin for as long as it continues to work.",
      "MessageIndex": 6,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702433",
      "Title": "How long on Zometa riverinerabbit TingleToes"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 3, 2007 11:40AM - edited Oct 3, 2007 11:40AM by mrs_X_Sunneedazee I am so sorry to hear of your treatment not working.  That is so frustrating.  I have been on Taxol for 4 1/2 months and it has worked marvelously!  Hope it does the trick for you also!  Best of luck to you!",
      "MessageIndex": 14,
      "PostDate": "03/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693097",
      "Title": "Xeloda Failed and start Taxol weekly next week shend mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 14, 2007 02:12AM mrs_X_Sunneedazee wrote: Luann, Just want you to know that our family prays for our soldiers every night, and will be praying for his and all of the others safety.  We are so greatful for those who sacrifice and serve. ",
      "MessageIndex": 34,
      "PostDate": "14/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695214",
      "Title": "O/T My son is leaving for Iraq LuAnnH mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 7, 2008 03:08PM mrs_X_Sunneedazee wrote: I know EXACTLY how that feels.  I just dread having to go to the infusion room every 3 weeks, and sit in that chair.  I long for the days pre-cancer, without the reminders all the time that I have an incurable disease.  I go in for Herceptin and Zometa tomorrow, and I get cranky and down the day before.   Good luck to you Fitztwins.  What book are you reading?  I read the twilight vampire series and really liked that series.  I also read the Morganville vampire series.  I am a \"sucker\" (pun intended) for vampire books!!!!! ",
      "MessageIndex": 5,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708667",
      "Title": "depression before treatments jerseymaria Fitztwins"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jun 9, 2008 12:08AM mrs_X_Sunneedazee wrote: Angela, I would love to help!!! Please send me your paypal address and I will send some money if that would be easiest. I can also send a check to LuAnn.",
      "MessageIndex": 30,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706936",
      "Title": "helping a sister in need LuAnnH whoopsiedoodles"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jun 15, 2008 06:22PM mrs_X_Sunneedazee wrote: Yipppeee!!!! I am so excited that Angela will be able to take her trip. LuAnn, we all know you are one of the most caring, genuine, and thoughtful women on this site. You are always there for EVERYONE. You are a true gem on this site, and we are all lucky to have you!!!! (((((hugs))))))))",
      "MessageIndex": 133,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706936",
      "Title": "helping a sister in need LuAnnH whoopsiedoodles"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 3, 2008 12:48PM mrs_X_Sunneedazee wrote: Thank you for all of your prayers, love and support.  I have been having a difficult time with my cancer and chemo, but our community pulled together and did a wonderful fundraiser for our family.  We are going to be able to go on a much needed trip to DisneyLand in early December.  We feel so blessed!!!! I have tried a couple of chemos, and they don't seem to be working, so we have decided to take a break from chemo for a couple of months so I can enjoy the holidays.  The chemo is making me sicker than the cancer, so I am going to only do Herceptin and Zometa and maybe a hormonal, and may think about trying another chemo after Christmas.  We are at peace with this decision, and I look forward to feeling better.  I have a lot of catching up to do, because I have been too ill to be on the computer.  I have missed you all!!! love, Amber",
      "MessageIndex": 16,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723418",
      "Title": "Mrs_X_Sunneedazee LuAnnH Fitztwins"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Sep 26, 2007 10:16PM - edited Sep 26, 2007 10:16PM by mrs_X_Sunneedazee I am sorry to hear of your diagnosis, but know that this place is a wonderful place for info and support.  I was diagnosed 4 months ago, and I had mets at diagnosis to by bones and lung.  I have had great response to the chemo, and actually have better days than before I was diagnosed.  (I was in so much pain from the bone mets.)  I appreciate life so much more now, and don't fret the little things.  My husband actually commented that I am happier now because I look for the good in life, even though I have stage 4 cancer.  I do have hard days when I cry a lot, but all in all I have found peace in my trial.  Good luck to you!",
      "MessageIndex": 17,
      "PostDate": "26/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692741",
      "Title": "Metastatic at presentation Kelolo Annie4"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 11, 2008 08:14AM mrs_X_Sunneedazee wrote: Heather, Welcome to the board.  I am so sorry that you are dealing with this, but please know that it is totally doable.  I remember when I was first diagnosed with cancer and mets, I was sure I would be dying soon.  Now it has been 9 months and I am doing better than ever!  I wish you all the best! ",
      "MessageIndex": 15,
      "PostDate": "11/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700076",
      "Title": "Heather needs support LuAnnH heatherpalmerton"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 21, 2007 10:53PM mrs_X_Sunneedazee wrote: I am so sorry for your loss.  My prayers are with you and your family. ",
      "MessageIndex": 10,
      "PostDate": "21/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695828",
      "Title": "My Mom is a Angel Momrita lastminuteD"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Aug 26, 2008 02:55AM mrs_X_Sunneedazee wrote: I am so sorry that you are going through all of this.  I can't even begin to imagine the anguish and worry you must be feeling.  I have no words to help, but just wanted you to know that you are not alone, and I will be thinking of you.",
      "MessageIndex": 13,
      "PostDate": "26/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720031",
      "Title": "My sister allmans LuAnnH"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 15, 2007 03:37AM mrs_X_Sunneedazee wrote: Sue, I just love reading your posts. And everyone else, your advice is great.  I am preparing for surgery, and all this advice is fabulous!  Sue, keep that sense of humor so you can keep the rest of us laughing.  Hope you are feeling well! ",
      "MessageIndex": 448,
      "PostDate": "15/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 23, 2007 06:58PM mrs_X_Sunneedazee wrote: Hello, Sue.... I am so glad that tomorrow you get your results! I will cross my fingers and toes that they are good results. I envy you being DONE with your surgery. I will have mine on Thursday, and my oncologist wants me to have my ovaries out the same time. I went to see the OB-GYN today, and after doing an ultrasound, he wants me to have my uterus removed also. So, I get to have a double surgery. At least I only have to do the worry and anxiety once, instead of twice. I love reading your posts. You always make me laugh when I am feeling down. Good luck tomorrow..... I know everything is going to be fine...... Hugs!",
      "MessageIndex": 551,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 6, 2007 08:52PM mrs_X_Sunneedazee wrote: Karen, i checked out your wig pictures.  They are terrific. What a fun time it looked like you had.  It really does help to do the wig thing with family and friends and laugh, and it lightens the sadness.  So, Sue, make sure you do the same thing when you go wig shopping. Fumi, welcome to the group.  We are happy to have you.  I really enjoy this terrfic circle of friends.  Thanks Sue for bringing us all together!!!!  You are such a popular girl.  I am never on at the same time as you. It must be the time difference. Shirlann, you are so lucky to be going on a cruise. I am begging my husband to take me on a cruise once I get all recovered from surgery.  January or february would be great.  We would probably do the last minute booking so to get a good deal, and also less risk of something happening to derail our plans. I am doing great and am off my pain meds!  Yippeee!!!  It is so good to not have pain, only a little.  I had my first weekly herceptin treatment without the taxol today.  I also had zometa.  It is great to not be feeling nauseated or have my hands and feet burning from the taxol.  I was so tired of that. I received my pathology report today also.  There were a couple of spots of cancer left in the breast, so my onc and surgeon are both still recommending 6 weeks of radiation to prevent recurrence on the chest wall.  I was really hoping to get out of radiation.  At least they told me I could wait a couple of months to recover from my dual surgery.   I also have to start taking Aromasin today.  Anyone else taking this??  Have many side effects? I don't know how to post pictures here, but I do have a blog that I posted pictures on, so if anyone would like to check them out, here is the web address... www.amberchase.weebly.com have a great night everyone!!  hugs! ",
      "MessageIndex": 830,
      "PostDate": "06/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 17, 2008 11:24PM mrs_X_Sunneedazee wrote: Kimmy I have the flu symptoms with the zometa.  The first couple of times I got the fever and terrible body aches.  It has gotten better.  I still have the bone pain the night of and the day after, but no fever. Kelly, Are you on zometa?",
      "MessageIndex": 3,
      "PostDate": "17/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700543",
      "Title": "Side Effects of Faslodex kellypa ceci4555"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 21, 2008 04:49PM mrs_X_Sunneedazee wrote: oh sweet sue!  I know how you feel!  Remember it is only temporary, you will get feeling better in a couple of days.  You are still going to be here for your boys, I just know it!  You are too strong of a woman to let this ugly bootface get you!!!!!!! Shirlann-I will have to ask my Dr. about that drug.  I am on Zoloft, antidepressant, so I wonder if I can take both or if I would have to change?  ",
      "MessageIndex": 4336,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 19, 2007 11:17AM mrs_X_Sunneedazee wrote: Sue, that is such a bummer you are having so much pain!  Be careful not to overdo hun!  Just rest and let yourself heal.   I am glad you are so willing to share your experience and feelings.  It has been very helpful for me in preparing for my mastectomy next week.  Take care of yourself!!!!!!",
      "MessageIndex": 488,
      "PostDate": "19/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 21, 2007 10:29PM mrs_X_Sunneedazee wrote: Hi to everyone. Great pictures, shirlann, sounds like you had a wonderful time.   Poppy- congrats on your great news! Melody, that all sounds so yummy, can you send me some?? Happy thanksgiving to all, whether from the US or not.  We can all take a day to be thankful for all of the blessings in our lives.",
      "MessageIndex": 1134,
      "PostDate": "21/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Feb 21, 2008 11:24AM mrs_X_Sunneedazee wrote: Hello everyone! Just popping in to say hello.  I can't believe how many posts and views there are on this thread!  140 pages!!!!!!  WOW!!!!! I am doing well.  I finished radiation a month ago, that was tedious. I hated going to the hospital every day, and it was so painful to my back and hip to lay on that hard table.   I go in every three weeks to receive herceptin now, and hopefully that will keep me stable for a long time.  I also take Aromasin, and I hate it.  I am achy like an old woman, and the hot flashes are so annoying.  Better that than dead, though!!!  ;) It is so cold here, I am ready for spring!   Take care everyone!  I will try to check in with you all a little more often. ",
      "MessageIndex": 4325,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Jul 6, 2008 06:34PM mrs_X_Sunneedazee wrote: Adding my name to the list of sisters praying for you........",
      "MessageIndex": 64,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708563",
      "Title": "Can't Walk.... Headed to ER TripleNeg booklady"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 4, 2007 09:59AM - edited Oct 4, 2007 09:59AM by mrs_X_Sunneedazee Oy!  It is morning here, and I have to get through a whole day to get through!  Love your ping pong ball comment.  I can just see them bouncing all over the place, and trying to catch them.  LOL!  That sounds a lot like my life. Staying busy for the weekend seems smart.  Try to keep your mind off things.   I think once you can have your surgery, you can start the healing and moving on.  I was so relieved when I started treatment so I could feel like I was doing SOMETHING to get rid on the terrible thing inside of me.  ",
      "MessageIndex": 214,
      "PostDate": "04/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 9, 2007 12:39AM - edited Oct 9, 2007 12:39AM by mrs_X_Sunneedazee Sue, just letting you know that another sister is praying for you.  Best wishes, and speedy recovery!",
      "MessageIndex": 308,
      "PostDate": "09/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 24, 2007 08:20AM mrs_X_Sunneedazee wrote: Sue, I'm so glad that your lymph nodes were clear!  Isn't it frustrating that now you have to wait again to see about needing chemo.  I hope that you won't need that or radiation, and you can just heal and have life go back to normal.  This whole process is so frustrating!  I hope I am as resilient as you after surgery.  I love what you said about all chewed up and spat out!!!  That is too funny, and too true! Have a good day!  (or is it evening there?  It is morning here....) ",
      "MessageIndex": 555,
      "PostDate": "24/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 14, 2007 06:12PM mrs_X_Sunneedazee wrote: Hey Sue, I HATED the steroids.  They made me so wired and jittery and I couldn't sleep the night after chemo.  I still have to get steroids with my weekly Herceptin treatments (because I had a bad reaction to my first tx) but only 1/2 as much as I was with the Taxol and Herceptin.  The only day I could eat was the day of chemo because I would get the munchies really bad...  After that first day and night, I lost my appetite and was sick for about 3 days. You are amazing that you went to work..... That is wonderful.  Make sure you get the rest you need, though!!!!!  Have a good night! ",
      "MessageIndex": 986,
      "PostDate": "14/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 27, 2007 06:01PM - edited Nov 27, 2007 06:04PM by mrs_X_Sunneedazee Hi Sue, you should be sleeping!!!  I've missed you.  I have been feeling too good this last week and have been busy \"decking the halls\" for christmas.  It is so much fun.  Once my hair began to fall out, I kept it in a ponytail to keep it from going everywhere until I finally braved it and shaved it.  My dear husband shaved his head the day before I did mine, and the day I shaved my head my sweet brother came over and let me shave his head.  Then my 3 boys shaved their heads as well.  It was so fun instead of traumatic.  It was still hard (and still is!) to look in the mirror and see the stranger looking back at me.  On the plus side, the savings in hair care and time spent blowdrying and curling my hair has been a blessing.  I'm not sure how to post pictures on this site, but here is a link to the page of my blog where the picture of us all is posted after our headshaving party: You have to scroll all the way to the very bottom amberchase.weebly.com/1/archiv... Hope you can go back to sleep!!!! ",
      "MessageIndex": 1318,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 2, 2007 11:26PM mrs_X_Sunneedazee wrote: Sue, You have been having quite a hard time. I am so glad to read your posts and know that there are others out there that have the EXACT same feelings as me. I had a hard time yesterday mourning the disfigurement of my body. My tummy is so bloated from the hysterectomy, and I am bruised everywhere from the mast and hyst, and I just BAWLED. I hate not having hair...I wonder if I will ever look halfway normal again. It is so good to know that others have the same feelings and mourn the way I do. Some days, it is easy to be positive, but then there are days when all I can think about is how much having cancer SUCKS!! It is hard to be hopeful sometimes. I am so glad we have each other to help one another through this difficult trial that life has dealt us. I loved everyones pictures!!! I will have to post some pics once I feel a little better. I hope everyone has a good weekend! Hugs to everyone! Amber ... Sunneedazee",
      "MessageIndex": 781,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 19, 2007 02:49PM mrs_X_Sunneedazee wrote:",
      "MessageIndex": 1093,
      "PostDate": "19/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Oct 4, 2007 09:35AM - edited Oct 4, 2007 09:35AM by mrs_X_Sunneedazee Oh sue, I am so sorry you are so sad today.  I too have been waiting for surgery.  I have been doing chemo for almost 5 months so they could shrink the cancer enough to do surgery.  I worry so much, and I wish I could just KNOW what the future holds.   I wish I knew how long until the cancer starts growing again.  I will have surgery the beginning of november, and I dread it.   It is nice to know that I am not alone and that others have the same worries and fears as me.  Hugs to you!  you are not alone!",
      "MessageIndex": 211,
      "PostDate": "04/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 6, 2007 09:11PM mrs_X_Sunneedazee wrote: Oh, and fumi, I forgot to say, that chocolate cake looks DIVINE!!!  Yummy! ",
      "MessageIndex": 831,
      "PostDate": "06/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "mrs_X_Sunne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49864/profile",
      "Content": "Nov 12, 2007 03:32PM mrs_X_Sunneedazee wrote: Hello everyone! Sue, just wanted to wish you good luck.  You will be fine.  It is so relieving to begin treatment, and KNOW what to expect rather than WORRY about it.   LOVE the wizard of oz analogies, all.  I have been a huge fan of the wizard of oz, and even read all of the books by Frank Baum.  The month after I was diagnosed my husband took me on a trip to California to see the musical Wicked.  It was awesome. Have a wonderful week all!  Keep on keepin on! ",
      "MessageIndex": 952,
      "PostDate": "12/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}