{
  "AuthorID": "MrsCich",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
  "Posts": [
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Oct 15, 2012 10:17PM MrsCich wrote: loveranurse, did you see the Dr yet?  please keep us posted!  I too am 33 but unlike you, I have no family hx of BC... it has to start somewhere though, right? Thankfully I tested negative for the BRCA gene so my 3 daughters dont have to worry as much about it. If they were to get BC it would be a fluke, just like me.  Wishing you the best!",
      "MessageIndex": 5,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794916",
      "Title": "New and concerned, support needed Loveanurse33 MrsCich"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 18, 2012 09:17AM MrsCich wrote: Very encouraging words, Curlylocks. Dale, I am 33 and when I heard those words I really just went blank. I had a DMX on Aug 31 with immediate tissue expander placement for implants. I have my first appt with my Oncologist this Thursday, right after my first fill in the tissue expanders. I'm terrified. If you or your wife would like to private message me with questions or just to talk, please feel free. You came to a great place for support and answers to the many, many questions you all will have. The ladies on this site are amazing. Congratulations on that sweet baby!!!!",
      "MessageIndex": 18,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793103",
      "Title": "My wife and the battle we didn't want to fight! Nautica00 msphil"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 21, 2012 10:24AM MrsCich wrote: Hi all, I've been on the site for a while but never in this thread.  I see some ladies from my other boards though, so HELLO!  I'm wanting to hear from any of you stage 1 sisters that have had treatment other than surgery.  I am 33 years old and as you can see in my signature and treatment below, I had IDC, Grade 2, Stage 1 and DCIS Grade 3 no lymph involvement with a DMX with TE on Aug 31. My Onco score is 24 and my Oncologist is recommending 6 rounds of chemo (1 every 3 weeks for a total of 18 weeks) and 10 years hormone therapy...5 of which will be Tamoxafen.  I was ER/PR+....ER was 80%.   Thoughts on the recommended treatment would be appreciated.",
      "MessageIndex": 13575,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 25, 2012 09:49AM - edited Sep 25, 2012 09:50AM by MrsCich My u/s didn't show my mass. If it wasn't for me pushing to get a MRI I would never have known that I had 2 areas..one being IDC. The mammo I got the day of the biopsy didn't show my cancers due to dense breasts.",
      "MessageIndex": 13611,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 22, 2012 01:20AM MrsCich wrote: Well, these women were here for me when I was waiting and waiting and waiting for results.  Waiting really is the worst part.  Once you get the MRI on Monday, you will wait even more for the results.  Do you have any lumps?  Redness? Warmth? Skin changes or dimpling in the breast?  Not that I'm a professional but like you, and all women on this site, I've done my research.  Do not let the internet searches scare you.  A lot of women will tell you 80% of tumours are benign, but I'm not too sold on that.  I had a low chance of getting it and now I have 2 kinds.  Please feel free to rant and scream if you need to.  Once the waiting is over, at least you can finally think about recovering from this.",
      "MessageIndex": 3,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793864",
      "Title": "Having a bad day dustyGreen MrsCich"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 22, 2012 03:14AM MrsCich wrote: Dusty, we are our own advocates. You are ok to get mad. Like I said, mine wasn't seen in an u/s. the day of my biopsies they gave me a mammo and it wasn't there either because I have sense breasts. The MRI will tell all. It does have false positives which means unnecessary biopsies, but if rather a false positive than not knowing at all. Be sure to keep us updated.",
      "MessageIndex": 6,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793864",
      "Title": "Having a bad day dustyGreen MrsCich"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 28, 2012 11:09AM MrsCich wrote: So how'd the appt go Monday, Dusty??",
      "MessageIndex": 8,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793864",
      "Title": "Having a bad day dustyGreen MrsCich"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Oct 15, 2012 12:41PM MrsCich wrote: Scared, how long did they say until you get your results?  I was Birad 5 in two areas, one of which was only found because I demanded a MRI.  Long story (which you can read in my biography on my profile page), but I'm 33 with no family hx either.  It was very scary waiting for the results. I had my MRI on a Monday, results that afternoon, biopsies Thursday morning and Monday I got my results.  Please feel free to PM me if you would like to talk.  Praying for you.",
      "MessageIndex": 8,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794855",
      "Title": "Melting down over ultrasound report scaredinal scaredinal"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 22, 2012 01:04AM MrsCich wrote: Dusty, you are not crazy!!!  I am 33 and found my own lump.  When I brought it up to my gyno he said it felt cystic but sent me for an u/s.  My lump was not seen on the u/s.  I was told it was PROBABLY a ridge of breast tissue.  I was not comfortable with a probably.  I called my Dr's office back and asked for a MRI. The lady on the phone said it wasn't medically necessary and I'd have to pay out of pocket. I called a Breast surgeon and asked how much it would cost, I explained my story and the staff there made me an appt so the surgeon could make it medically necessary.  At my appt, the surgeon also said it felt cystic but allowed me to get a MRI.  My MRI showed TWO areas with high suspicion of being malignant (>=95%), BIRAD score 5 on both. The surgeon was shocked but still didn't think it would be malignant because I am young with no history of BC.  I had a 7% chance of the biopsies coming back malignant.  As you can see by my diagnosis, they were!  If your gut is telling you to check further, LISTEN!  It was my gut that lead me to a MRI which showed TWO areas!  I only had one lump!  Do not feel crazy!!!  Come here to cry, rant, scream, cuss, etc. We have ALL been down the road you are on.  I pray you find answers and can relax.  Just know that regardless if it is or isnt BC, waiting another week wont make or break you.  If it is BC, it's been there for a while already.  Please feel free to PM me if you'd like to talk.  We are all here for you and wish for the best. ",
      "MessageIndex": 1,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793864",
      "Title": "Having a bad day dustyGreen MrsCich"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Jul 31, 2012 06:23PM - edited Jul 31, 2012 06:33PM by MrsCich",
      "MessageIndex": 10,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791158",
      "Title": "Palpable lump, negative ultrasound kmwondering Janet456"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 25, 2012 06:11PM MrsCich wrote: If your dr says its medically necessary, they should. Thats what I had to have so they would pay.",
      "MessageIndex": 13624,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 26, 2012 11:06AM MrsCich wrote: Morning ladies. I got my call from my Onc. The tumor board met and even the pathologist that did my actual biopsy was there. He showed the images of before and after the biopsy and my the size of invasive cancer in my tumor was 1.2 cm and .6 of it was DCIS. So I do get to join the dreaded chemo club. She said all of the Drs were unanimous in their recommendations. Even though I'm reassured that all the head drs at my cancer center reviewed my case and agree on a treatment, I was still hoping for less than .5 being invasive. Blah!!! The other mass that was quite large was mainly high grade DCIS but she's not ruling out that some invasive was in there hiding as well. I'm waiting my call for my first treatment. I told her I want to start ASAP so I can get it done with ASAP.",
      "MessageIndex": 13628,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 26, 2012 12:58PM MrsCich wrote: Well it's all moving right along. I start chemo on Friday. I sit in the dreaded BGC at 1030. They are calling in my Zofran and Decadron now for me to start the Decadron tomorrow. Labs today or tomorrow. So I guess since they say you start to lose your hair in the first week or so, I should enjoy this weekend and week with my hair (if im not deathly ill from the chemo), huh? Blah!",
      "MessageIndex": 13631,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 28, 2012 09:56AM MrsCich wrote: T minus 1 hour and 30 minutes until I sit in the BGC for chemo. Blah",
      "MessageIndex": 13639,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 21, 2012 03:27PM MrsCich wrote: Got my BRCA results. It's negative for me carrying the BC gene. The girls don't have to worry now!!!! It's not hereditary!!!!!",
      "MessageIndex": 13583,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 24, 2012 10:05AM MrsCich wrote:",
      "MessageIndex": 13598,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 24, 2012 07:26PM MrsCich wrote:",
      "MessageIndex": 13602,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "MrsCich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157609/profile",
      "Content": "Sep 25, 2012 12:16PM MrsCich wrote: I found mine as well. My first u/s showed nothing and I was told it was \"probably a ridge of breast tissue\" and that didn't sit well with me. I called a bs to see how much a MRI out of pocket was because I was told it wouldn't be covered by insurance because it wasn't medically necessary. I have no Hc of BC and am too young for yearly mammos. The only reason I got the one I did was because try wanted to try a mammo or u/s guided biopsy if possible. MRI guided was the plan but its much more difficult thy way. Luckily the 2nd u/s I had showed the areas and we were able to do an u/s guided biopsy. The mammo wasn't too painful for me but I was big busted before BC now I just have these awful TEs.",
      "MessageIndex": 13615,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}