{
  "AuthorID": "mrschilicook",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73460/profile",
  "Posts": [
    {
      "AuthorID": "mrschilicook",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73460/profile",
      "Content": "mrschilicook wrote: Okay...I don't want to scare anyone, but I'm wondering if anyone else has experienced or knows anyone who has experienced some sort of major side effect that wasn't expected.   During my third TC I had a reaction to one of the chemicals which caused them to stop the session, pump me full of steriods, histamines, saline, etc...then they restarted the session slowly to ensure I could take it okay.  That night I had a strange \"brain freeze\" feeling that concerned us enough to call the oncology hotline who indicated that it was \"probably\" the extra chemicals.  It passed but the next morning it happened again accompanied by quadruple vision.  After a 911 call and a ride to the hospital by ambulance, I was diagonosed with a cerebral infarction (blood clot/stroke).  I was lucky in that it impacted only my balance to the right for a few weeks...no muscle impact so I'm okay.  However, the oncologist while saying that the chemo had nothing to do with the stroke, also indicated that session #4 probably wasn't critical since I had caught my BC early and had gone thru radiation.  I also admit that I had other stressors going on in my life (my husband had just died) besides all of the things connected to BC.  But I'm still highly suspicious about the chemicals and the stroke being related in some way.  Anyone experience unexpected major health impacts?  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738568",
      "Title": "Major side effects not expected? mrschilicook hschwarzer"
    },
    {
      "AuthorID": "mrschilicook",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73460/profile",
      "Content": "mrschilicook wrote: All of the forum's discuss the starting of chemo so I thought it would be nice to have a place to celebrate the ENDING of chemo....  I was diagonosed with B/C in August, had surgery in Sept. and completed mammosite radiation in October.  Chemo begin October 30th, 2008.  I was scheduled for 4 T & C sessions 21 days apart.  Scared?  You bet!  I live alone in a rather rural area outside Branson MO.  My friend from Texas came to stay for 3 months.  My mom came in December to stay another 3 months (I was also recently widowed in May 2008) just for morale support.   Was it as bad as I had imagined?  No...not by any stretch.  The first session was the worst and it was actually \"livable\".  Mostly tired, thirsty, listless, and did I say thirsty?  Nothing tasted good but toast and peanut butter.  12 days after my first session I was pretty much back to \"normal\" although red meat didn't even sound good.  Salt and sugar were my strongest taste factors.  Fat, especially in meat, were positively uky.   I had EXTREME dry mouth so I brushed my teeth with Biotyne (?) EVERY time I put something in my mouth.  I used everything I could to produce more saliva...sugerless gum, sour sugarless candy, saliva tablets.  The dry mouth was probably the worst side effect.  Trying to get 25-35 grams of fiber, as recommended by my cancer team, was a challenge.  I've become an expert on al things fiber.  V8 has a fiber veggie juice, Natures Own has a whole wheat  bread with 7 grams of fiber, and a large pear has 7 grams of fiber.  Peanut butter, dried apricots, and Fiber One (in my tea) rounded out my fiber day.  My nutritionist said that protein was very important to help with the healing process. That too, was a challenge since the idea of eating meat became distastful.  So Fiber One Yogurt became a double winner...both protein AND fiber. Peanut Butter, yogurt, protein bars, and other odds and ends became my protein sources for three months....and to a certain extent still are since red meat continues to not sound good to my taste buds.  About day 17 I started losing my hair.  I had cut it short before chemo started, so the shock of it falling out in my hands wasn't as great as it might have been with longer hair.  The next day I went to the hair dressers with my friend in tow, and while she got a pink extension in honor of breast cancer support, I had my head shaved.  After we had martini's and laughed alot. I had no nausea, no headaches, no reaction to odor (although things smelled stronger).  Just thirst, tiredness, and the need to nap for about a week. It wasn't nearly as bad as movies show us. The second chemo session was about the same with a shorter \"recovery\" period (10 days).   They also did the \"T\" before the \"C\" in a slower IV drip and that seemed to help with the thirst.  Still drank tons of water, but the thirst itself wasn't overwhelming.  Appetite came back about the same as before.   It was pretty much the same as the first, but less of everything.  Third chemo was scheduled for Dec. 11th.  During the chemo I had a reaction to the chemicals.  They paused the session, pumped me full (IV drip) of steroids, histamines, and Benedryl, and then resumed the chemo.  The next day I had a cerebral infarction which they said was not directly caused by the chemo but rather by a combination of factors including stress.   So after I recovered from the immediate impact of that, the oncologist indicated that not doing chemo #4 posed minimal risk and he would leave it up to me as to whether I continued or not......I had a choice?  Well, my choice was, you guessed it, we're DONE!  So now we're in 2009.  In early January the immediate impacts of chemo (appetite, listlessness) were gone, and I now have a full head of fuzz covering my head. I get my first diagnostic mammogram in April, the port removed in the summer, and I can move on.  I feel strong, I feel positive, and I'm entering this year with the most upbeat attitude I can muster.  I hope some of you, too, have ended your chemo and are looking forward to getting on with your life. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728357",
      "Title": "ENDING Chemo mrschilicook Titan"
    }
  ]
}