{
  "AuthorID": "MrsGreenJea…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220269/profile",
  "Posts": [
    {
      "AuthorID": "MrsGreenJea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220269/profile",
      "Content": "Dec 10, 2015 12:38PM MrsGreenJeans wrote: I had excisional biopsy in June with local sedation. It is normal for me to have side effects from anesthesia. My surgery was on a Friday. I felt nauseated and lightheaded through the weekend, and went back to work as a pharmacy technician the following Monday. I was feeling mostly normal by then. Last week I had BMX under general anesthesia. I told them that I react poorly and they gave me the scopalamine patch before surgery as well as some IV meds during. The patch was removed the following day, on Thursday. Although I was weak and somewhat lightheaded, I did not experience nausea until a day or two after that. By Monday I was miserable, and my PS wrote an rx for Zofran which has helped a great deal. I am still experiencing side effects 8 days after surgery, mostly a fuzzy brain and still some lightheadedness, as well as a lack of energy. I wish you well, and hope that you do not suffer serious side effects. Good luck.",
      "MessageIndex": 3,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837419",
      "Title": "Local Anesthesia for Lumpectomy Kar324 Kar324"
    },
    {
      "AuthorID": "MrsGreenJea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220269/profile",
      "Content": "Dec 10, 2015 08:25PM MrsGreenJeans wrote: So sorry that this journey has been so difficult for you. What a lot you have gone through. I will pray that your nodes are clear and that you continue to progress in your healing. Best wishes to you.",
      "MessageIndex": 1,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/838149",
      "Title": "Doub Mast/Lat Dorsi,Reconstruct,Seromas,Infection,Swollen nodes monroe7702 MrsGreenJeans"
    },
    {
      "AuthorID": "MrsGreenJea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220269/profile",
      "Content": "Oct 14, 2015 01:41AM MrsGreenJeans wrote: Waiting to hear back on a date, expecting sometime in November.",
      "MessageIndex": 3,
      "PostDate": "14/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "MrsGreenJea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220269/profile",
      "Content": "Oct 1, 2015 06:18PM MrsGreenJeans wrote: girl53, I too am not pleased with my MO. The doc herself is meh, I neither liked nor disliked her. My issue is with the facility and staff. Making my appointment was a major task (multiple office locations, minimal availability at each), Checking out after my appointment, I commented that they seemed pretty busy. The girl checking me out said yes, they were very busy. \"I don't even know why we are taking new patients\". Really???? This is what you say to a new patient??? It was all downhill from there, it actually got worse. I will absolutely NOT be returning there. Meeting with BS next Tuesday, I will ask her for another MO recommendation. As others suggested, run, as fast as you can. Her attitude toward you was completely inappropriate and unacceptable.",
      "MessageIndex": 14,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/835387",
      "Title": "Terrible Experience with Oncologist Girl53 MsVeryDenseBreasts"
    },
    {
      "AuthorID": "MrsGreenJea…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220269/profile",
      "Content": "Nov 30, 2015 01:01PM MrsGreenJeans wrote: Danielle, hoping for good results for you. Keep well.",
      "MessageIndex": 2,
      "PostDate": "30/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837143",
      "Title": "My surgery was last Friday DanielleH BethL"
    }
  ]
}