{
  "AuthorID": "mrsknmoorejr",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149047/profile",
  "Posts": [{
    "AuthorID": "mrsknmoorejr",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149047/profile",
    "Content": "mrsknmoorejr wrote: I am sitting here at work, somewhat in a fog.  I am trying to decide if i need to be worried or not.  I went to have my first mammogram last thursday (I am 42) because for one, it's time and two, I had a decent size lump on my left breast.  I was supposed to only have the mammogram and then a sonogram \"if necessary\".  We they rushed me into the sonogram immediately and the dr came in looking worried.  When she saw the screen she was immediately relieved, saying it was just a fluid filled cyst.  She said I was very fibrocystic and told me I had a lot of calcification as well.  She said there was one area of concern on my left breast near where the cyst was.  She said this typically is an area of concern but since she didn't have a benchmark she recommended a biopsy of the area.  She then directed her attention to the cyst saying that was simple she could just drain the fluid and the cyst wall would collapse.  The did that right away, however, it never really collasped like she said.  She then took two biopsies from the cyst wall and was going to do a third but apparently i had lost a lot of color in the meantime.  She recommended that I come back for the biopsy of the calcification \"cluster\".  That is what I did today, and that was called a stero something or another.  When I went in however, they told me that the biopsy from the cyst was both atypical and normal. The fluid was aptypical and the cyst wall was normal. However, it is near the area of the calcificaiton cluster. They didn't tell me to worry and they didn't tell me not to worry. They just said that they would call me when the results came back and to \"hang in there\". They may have said things telling me not to worry, but i don't recall them and i am sitting here wondering if this is the beginning of a long journey.  I have never waited for results and been this worried. The more I read online the more upset I become and after they find the cure for breast cancer, they need to find a way to speed up these tests. Can someone tell me if I need to be concerned or if more than likely it is just nothing and I am going to be okay? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "12/04/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/785716",
    "Title": "Should I be worried??? Tuesday seems so far away mrsknmoorejr J9W"
  }]
}