{
  "AuthorID": "mrsmanhatta…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167315/profile",
  "Posts": [
    {
      "AuthorID": "mrsmanhatta…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167315/profile",
      "Content": "Jan 10, 2013 05:55PM mrsmanhattan wrote: Hi sweetie! Good news is you are young so data is in your corner.  Advice is you have to go right now and tell your mom or dad that you need to schedule an appointment with the gyno for a lump and bruising you found in your breast.  You are very smart coming here for answers and advice because you know something isn't right and just imagine how upset your parents will be if they find out later you knew this whole time.  Don't cheat yourself valuable time for silly reasons.  Your family and friends love you so do the right thing and get that appointment.  Maybe you can get an afternoon out of school.  Hey I'm still in school as an adult and I love any reason to get out :)  Wishing you all the best!",
      "MessageIndex": 1,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798677",
      "Title": "Scared out of my mind! soccerchick1997 fenella"
    },
    {
      "AuthorID": "mrsmanhatta…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167315/profile",
      "Content": "Jan 12, 2013 04:03PM mrsmanhattan wrote: I'm actually in Fremont California.  I have the avatar name because my husband likes comics and his favorite character is Mr. Manhattan the blue guy...ha ha.  Anyhow, I type in those keywords for fremont ca and only plastic surgeons come up.  I see a place for women's specialty but that is gyno.  I also used yelp and internist occur.  I was wondering if I should see a surgeon that specializes in breast cancer they have those across the bay at stanford?  Is there a specific term I'm missing?",
      "MessageIndex": 3,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798738",
      "Title": "Super silly question mrsmanhattan fenella"
    },
    {
      "AuthorID": "mrsmanhatta…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167315/profile",
      "Content": "Jan 12, 2013 04:10PM mrsmanhattan wrote: I will see if I can arrange an appointment Monday without having to go to my GP again.  I have PPO so in theory I am allowed to do it but everytime I try they always tell me I need a doctors referral for this reason or that.  My ultrasound today showed nothing so it is getting more complicated than I imagined.  Thank you for your advice :)",
      "MessageIndex": 5,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798738",
      "Title": "Super silly question mrsmanhattan fenella"
    },
    {
      "AuthorID": "mrsmanhatta…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167315/profile",
      "Content": "Jan 12, 2013 04:48PM mrsmanhattan wrote: I was thinking a plastic surgeon would be useless in the diagnosis part that's why I thought I must be missing a minor detail or something.  I seemed to have found this place in a nearby city that seems good.  Here is the link babsurgeons.com",
      "MessageIndex": 7,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798738",
      "Title": "Super silly question mrsmanhattan fenella"
    },
    {
      "AuthorID": "mrsmanhatta…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167315/profile",
      "Content": "Jan 12, 2013 04:17PM mrsmanhattan wrote: Hello and I'm sorry you are with your concerns.  It is really great that you have stayed on top of all of your strange symptoms and things to this date have been addressed.  I think your girlfriend is correct.  Your mri will/should explain your physical breast condition.  I'm not a proffessional so I don't have any medical advice for you.  IMO I find it strange that you have had this discharge for so long.  The fact that it is red and sore makes me think of some kind of infection going on.  Have they ever put you on antibiotics for the discharge?  My thoughts are with you and I wish you all the best for your mri and I hope you can get these symptoms resolved and get them to dissappear completely.  I'm sure all the other women will have some advice for your inflammation symptoms.  You are definitely on the right track though!!!",
      "MessageIndex": 2,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798758",
      "Title": "Sore Dark Green Discharge & Lump Under Breast triciapear mrsmanhattan"
    }
  ]
}