{
  "AuthorID": "Ms-Kris",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188412/profile",
  "Posts": [{
    "AuthorID": "Ms-Kris",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188412/profile",
    "Content": "Sep 21, 2013 11:11AM Ms-Kris wrote: Today I spent 4 hours at a Cancer Center. I noticed a lump in my left breast last week and I immediately made an appointment to see my primary physician to have her examine me and she confirmed my suspicions. She provided me with a referral order to have a mammogram and ultrasound done right away. Knowing that breast cancer runs in my family, requested an appointment to be seen to days later. I have had 3 previous mammograms and they were nothing like this. I was asked on 4 different occasions to come back for more images to be taken at the radiologist request. I was told that other radiologists were brought in to examine the films and compare the history of mammos taken last year. Then I was escorted to the US room, where several more images were taken. I was told that another radiologist was requested to look at the images and that made me more nervous. I was asked by the US tech if I would mind having a radiologist come personally examine my breasts. I said sure. He came into the US room and examined my breast and told me that he believed I had a correlation of cysts, but he didn't think they were benign. Didn't Think?! I was told there was no need to schedule a biopsy, but that he would like to follow up with me in 6 months and schedule a follow up screening. My primary care Dr. had told me that I should expect to have a needle aspiration biopsy, where they would draw fluid to determine if I had the any signs of cancer risks. Well, they didn't think it was necessary and told me that I should be happy to get such good results. However, he did say that if the cysts grew or became more sensitive that I should make an appointment to see my Primary Care Dr. and request she draw out the fluid from these cysts. Okay! Really? I was expecting him to say \" contact me immediately for an appointment, if you notice any change in size or sensitivity.\" WHAT I DON'T UNDERSTAND IS THE DIAGNOSIS. WHAT DOES IT MEAN WHEN A RADIOLOGIST TELLS YOU THAT HIS BELIEVE IS THAT YOU HAVE A CORRELATION OF CYSTS? Has anyone ever heard of that diagnosis? So I took it upon my self to search the net for answers and I couldn't find anything that helped me understand the definition of correlation of cysts. I am ready to contact my primary care Dr. to confirm she is comfortable and well educated on conducting the procedure. I just think that should be his job being that he is the overseeing everything. Does anyone know the definition of \"you have a correlation of Cysts?\" Cuz I would love to hear it. Obviously, I plan to take action ASAP, before it is too late. Please share your direction and advice with me, as I am feeling lost and confused. Any direction you can provide would be greatly appreciated.",
    "MessageIndex": 9,
    "PostDate": "21/09/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808678",
    "Title": "Confused by ultrasound results Scaredinca Beesie"
  }]
}