{
  "AuthorID": "msfoti",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117189/profile",
  "Posts": [{
    "AuthorID": "msfoti",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117189/profile",
    "Content": "Nov 4, 2011 05:54AM - edited Nov 4, 2011 06:02AM by msfoti This exact situation happened in my family not once, but twice. My mother was diagnosed with triple negative breast cancer in 2005 (age 67) and tested negative for BRCA mutations at that time. Two years later, she developed a different type of cancer in the other breast (ER+). When I developed breast cancer last year at 41, I told my surgeon and oncologist this information and they recommended I follow up with a geneticist \"just to be sure.\" After 2 failed lumpectomies (margins weren't clear), a mastectomy and reconstruction, I did see a geneticist with a brain who, after reviewing my atrocious family history (zillions of relatives w/ breast or ovarian cancer going back several generations), recommended that I have the BART testing. He also suspected after looking at my mother's health history/family tree for less than 5 minutes that she probably was in fact positive. Sure enough (after signing several waivers that I would pay the extra $700 -$800 fee for the BART testing if my insurance wouldn't cover it) the BART test was ordered and I tested positive for a BRCA2 mutation. My cousin (who's mother died of ovarian cancer and was my aunt/ my mother's sister) had genetic testing back in 2009 and it came up negative; however, like my mother, she didn't have the BART testing either. She and my mother were both re-tested shortly after my results and both were found to have the same BRCA2 mutation as I have. This infuriates me because had I known I was BRCA 2 positive after my mother's two breast cancers, I would have been tested and perhaps had prophylactic surgery BEFORE getting cancer. And now my cousin, who has not yet developed cancer, must somehow process that her first genetic test was worthless and she now must adjust to the scary reality that she is BRCA 2 positive and decide what to do. By the way, my insurance company ultimately paid for all the genetic testing, including the BART test. But many women are not that fortunate - either they are uninsured and can't afford any testing, or they're underinsured with a lousy policy that doesn't cover BART testing. The testing process as it currently stands is inefficient, grossly unfair and inaccurate. As a result of my own testing, I just had my other breast removed (prophylactic mastectomy) and a total hysterectomy on Oct. 19.",
    "MessageIndex": 11,
    "PostDate": "04/11/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/777136",
    "Title": "BRCA testing incomplete? patoo patoo"
  }]
}