{
  "AuthorID": "Mshaydon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223863/profile",
  "Posts": [{
    "AuthorID": "Mshaydon",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223863/profile",
    "Content": "Apr 7, 2016 06:11AM Mshaydon wrote: I an 47 years old. I was diagnosed with 3c invasive Ductal carcinoma April 2015. I had this lump for years but every time I had a mammogram they said I had dense breasts and it isn't anything to worry about and to cut down on my caffeine. As to my surprise in January 2015 I received a letter saying my mammogram looked good see ya next year. I knew this time I needed further attention because this year it was bigger and getting tender. I had to request an ultra sound and they did a biopsy. They started me on A/C neo-adjuvant chemo and my tumor double in size after only 3 treatments. It Went from 8 cm to 15 1/2 and grew a 4 cm extension. After my tumor grew out of control my breast surgeon scheduled a right mastectomy June 2015. I also has 15 lymph nodes removed 12/15 cancerous. We asked if both breasts should be removed and since there wasn't any history of breast cancer in my family, I am the 1st one, he said it wouldn't be necessary. He decided to do a gene test on me after my mastectomy and that is when I found out I have the CHECK2 gene mutation. After I completed 28 rounds of radiation I flew out to the City of Hope in California to obtain more information. When I returned my local oncologist advised me to start chemo up again to prevent cancer showing up in my organs. I declined further chemo and started taking tamoxifen, vitamin D and magnesium. I was cleared eyes to thighs on my 6 month pet scan and was scheduled to go to San Antonio for the DIEP Flap reconstruction surgery. Right after the scan I was diagnosed with breast cancer in my left breast. Nothing showed up on the pet scan but In asking my doctor about a lump he did a biopsy and it came back cancerous. Lump was there but did not show up on scan. I had another mastectomy in Monday, April 4, 2016. I feel fine. I haven't ever felt sick. They want me to do more chemo and radiation but it concerns me about how fragile my DNA is with CHEK2. It seems like everything that has been done was out of order, backwards or wrong. Sooooo confused. One of my siblings is CHEK2 positive and waiting to see the results of my mom.",
    "MessageIndex": 73,
    "PostDate": "07/04/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817771",
    "Title": "Anyone out there with the Chek2 gene mutation??? MNTaylor80 kber"
  }]
}