{
  "AuthorID": "msholli",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211470/profile",
  "Posts": [
    {
      "AuthorID": "msholli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211470/profile",
      "Content": "msholli wrote: I am still waiting for my 2nd ultrasound since the first was inconclusive,  I originally had one small hard non movable lump, today my breasts are extremely sore,  im a week away from period,  could be relevant,  I was feeling my lump again (I can't stop) and I just found 3 more near the same spot,  ones movable,  ones not and more firm but smoiyh,  the other is little and hard,  the old one feels bigger(could be my imagination) im thinking of taking time off work to make time for the ultrasound sooner if they can get me in, under my armpits is really sore,  they only mentioned a tiny section on the ultrasound that was in question,  so im assuming the rest is fine,  it says \"questionable 0.6x0.7 lesion at 12 o' clock,  4.5cm from nipple, recomended repeat targeted ultrasound under supervision of breast radiologist\" im even more unsure now Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828674",
      "Title": "new lumps out of the blue/repeat ultrasound msholli msholli"
    },
    {
      "AuthorID": "msholli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211470/profile",
      "Content": "msholli wrote: I've had 2 ultrasounds,  one was inconclusive,  the 2nd was with a breast radiologist,  the 2nd they said was normal,  that the lump in question was non fatty breast tissue, whatever that means,  its a small hard non movable lump,  I went to my family docs and they think if the ultrasound said normal I should drop it, Ive seen so many cases where ultrasound missed it, I cried in the office because I don't understand where this lump came from and what it is exactly,  she finally gave me a form for a mammogram,  I have implants and really don't want to subject myself to a mamo, I asked about mri, she just ignored my request and filled it out for a mamo,  should I trust the ultrasound and breast radiologist and ignore the lump or keep pushing?  Or wait and see if the lump disappears? My breast in question is always throbbing, Everyone around me thinks I should be happy with the results and I really want to be, I just can't let it go, I feel like I need a diagnosis of something like a cyst or fat necrosis (I did drop a sign on my breast a little ago. .)  Just some form of an answer. ... any advice is appreciated Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828955",
      "Title": "Am I crazy??? please help me! msholli msholli"
    },
    {
      "AuthorID": "msholli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211470/profile",
      "Content": "Feb 27, 2015 09:19PM msholli wrote: Thanks,  if they had said all that,  I would feel so much better,  They asked if I was pregnant, They asked about the injury,  They kept rescanning the area and looking and they even talked outside the room and finally said its just non fatty breast tissue im feeling,  but its a solid singular pebble like bump,  its hard for me to understand when its different then every other lump I've felt,  Thanks again for the ",
      "MessageIndex": 2,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828955",
      "Title": "Am I crazy??? please help me! msholli msholli"
    },
    {
      "AuthorID": "msholli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211470/profile",
      "Content": "msholli wrote: A little background. .. discovered a hard small immovable bump that felt like frozen pea or a pebble on the top if left breast,  first ultrasound was inconclusive,  today I had my 2nd with a breast radiologist on site,  she says it looks like non fatty breast tissue,  she admits it feels weird but ultrasound shows nothing suspicious,  she said the tissue created a ridge and that's what im feeling,  I feel I can relax a bit, only downside is it feels just like what alot of sites say are suspicious,  hard,  Not movable, edges aren't rough but not super smooth,  I feel if another lump emerges like that ill still freak and want to get it checked, it's been a scary week and a half but it has made me question my drinking habits as I cut out alcohol while I waited, I think cuttingback will make me feel better in the long run as I felt like alot if sites pointed out the increased risk with consumption. ...I appreciate sites like this with real people with similar concerns, made me feel less alone,  so thank  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828845",
      "Title": "Got my results! msholli Nancy2581"
    }
  ]
}