{
  "AuthorID": "mskassie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138865/profile",
  "Posts": [
    {
      "AuthorID": "mskassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138865/profile",
      "Content": "Mar 27, 2012 02:00AM mskassie wrote: Siteman Cancer Center in St Louis is one of the NCI's comprehensive cancer centers and a very good place to go.  I would recommend Dr Michael Naughton as a medical oncologist [he's mine and he's amazing!]  They are one of the top cancer centers in the country as well and have access to any and all new treatments, trials, etc.  If you need to know anything else on Siteman or Dr Naughton [or other docs at Siteman] just let me know! Kassie",
      "MessageIndex": 11,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784656",
      "Title": "Looking for Onc suggestions in MO (KC or STL) Alyad eag1954"
    },
    {
      "AuthorID": "mskassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138865/profile",
      "Content": "Nov 28, 2011 04:30AM - edited Nov 28, 2011 04:31AM by mskassie Hi Ladies!  Though I don't have a definitive day set yet, I know it's coming in December.  I was diagnosed Oct 28, 2011 with Invasive Lobular carcinoma ER+/PR+, HER2- and was told I had two very small masses.  Once was supposedly 5mm and the other 3mm.  Well went for a second open last week who did an MRI and found out that the cancerous area is more like 4 CM in area instead and also has ductal variants.  I'm waiting for the results from the genetic testing they did [BRCA 1/2] I keep going back and forth on surgery/treatment.  I'm going to ask my primary doc tomorrow if she will order a PET scan for me to see if it picks up any metastatic areas hoping that will help me make a decision.  If the genetic testing comes back positive, the BS said she would recommend a BMX.  I have a strong family history of cancer.  I don't want radiation, so that rules out the lumpectomy.  Do I got for the single mastectomy or the BMX?  Should I do BMX even if genetic test is negative so as to not worry as much later?  What's the likelihood that I will have to have chemo? I feel like I need some of these answers before I can make a decision, but it seems like I can't get the answers until after it's already done.  Someone help me unravel my mind please!!! :)",
      "MessageIndex": 61,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "mskassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138865/profile",
      "Content": "Dec 9, 2011 07:05AM mskassie wrote: I don't know if I got good new, bad news or what this week, kind of on overload.  BRCA 1&2 came back negative, so I know that's good; however, labs from Friday show I'm anemic, my vit D is low, alkaline phosphate is high, have a UTI and on an unrelated scan found a liver lesion.  So now everything is on hold again, have to go back to BS on Monday and have CT of chest/abdomen/hips and a biospy of lump that's appeared on upper back/neck [though BS said that would be an unlikely place for it to spread to. Does these results mean that the breast cancer has already spread to my liver and/or bones? Is that what they are concerned about, why they're having me do all these CT's now?  Will I be able to get surgery and treatment started if I'm anemic, have a UTI and low vit D? Now what do I do?  All those make me feel worse already, but put them on top of breast cancer [which I don't know if is spread throughout my body or not] and I honestly feel afraid that I wouldn't make it off the table.  :(",
      "MessageIndex": 295,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "mskassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138865/profile",
      "Content": "Feb 11, 2012 01:12AM mskassie wrote: Hi girls!  Do you all have room in the family for one more sister?  My pathology reports came back a couple days ago and Stage 1 it is.  Had my BMX on Jan 31, 2012 with no recon yet...will do that in a few months if all goes well. ",
      "MessageIndex": 11402,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "mskassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138865/profile",
      "Content": "Nov 30, 2011 01:52AM - edited Nov 30, 2011 01:53AM by mskassie looks like I go do my consult with the PS on Dec 5 and will probably schedule the surgery for sometime after Dec 14 [grad school term ends then]  I'm going to Siteman Cancer Center in St Louis and my original docs that found the cancer sent the actual path slides to my new docs and it seems now my actual diagnosis is Invasive Mammary Carcinoma and the likelihood of having chemo after was \"extremely high\" that I will be having the chemo.  [My doc can't tell me for sure on anything regarding my actual tumors/cancer until it's out and send to the lab,but I asked her \"statistically speaking\" what the likelihood would be.]  So I was trying to be brave and take a step forward and got my hair cut short today [I've had very long hair, below shoulder blades long, my entire life]  Well I was brave enough to do it, now it feels like I'm \"mourning\" the loss of my hair even though.  I think I'm just nuts! Given the diagnosis though and likelihood for needing chemo, I think a BMX would be the best route for me to go.  But good lord, if I cried about cutting my hair, I'll be in a straight jacket cutting off my boobs!!!  How do you do it?  I know it's the best thing for me to do, but actually saying those words to the doctors and scheduling the surgery to have it done...I can't seem to get the words out.  UGH!!!!!",
      "MessageIndex": 86,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    }
  ]
}