{
  "AuthorID": "msvp1226",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280453/profile",
  "Posts": [
    {
      "AuthorID": "msvp1226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280453/profile",
      "Content": "Oct 3, 2018 09:42AM msvp1226 wrote: I think I'm a bit late to this conversation, so I'm playing catch up. I start 15 treatments of radiation on October 8th and my lumpectomy was August 9th. I never heard of boosts before, so I'm wondering what those are as they were never brought up to me. Also, I'd love some specific suggestions on bras to wear as I do go to an office, at least I hope to continue going during this time. I've been an underwire girl for years and about a 36D. I know underwires are out for a while. Thanks!",
      "MessageIndex": 273,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "msvp1226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280453/profile",
      "Content": "Oct 1, 2018 07:08AM msvp1226 wrote: My oncotype was 25 and my K167 was 40%. Lumpectomy was almost 8 weeks ago and my two MOs, first and second opinions, now have divergent opinions. One says no chemo, just radiation and hormonal therapy and the other wants to talk to me tomorrow and seems to be heading me in the direction of starting with chemo first. It is all so confusing and a bit subjective, but I want treatment started already so I can move on to fight this BC. I feel like I don't have the time to wait for more tests/doctors. The Tailorx study would seem to say I don't need chemo as I'm over 50 with a score of 25, but of course I'm on the cusp and with a high k167 score, maybe that changes things. Just too much to absorb. Thoughts??",
      "MessageIndex": 7,
      "PostDate": "01/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852121",
      "Title": "KI-67 and Oncotype Scores - comparison Pyrrh Lisey"
    },
    {
      "AuthorID": "msvp1226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280453/profile",
      "Content": "Oct 1, 2018 04:11PM msvp1226 wrote: I’m assuming you got chemotherapy then regardless of your age, correct",
      "MessageIndex": 11,
      "PostDate": "01/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852121",
      "Title": "KI-67 and Oncotype Scores - comparison Pyrrh Lisey"
    }
  ]
}