{
  "AuthorID": "MsW2012",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
  "Posts": [
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Mar 16, 2013 08:35PM MsW2012 wrote: Outfield, I enjoyed reading your explanation. I think you said it very well, based on only what I have learned through web research and my rad onc. What is your field? Are you in the medical field? It is interesting to understand about the healing process. I knew about antioxidants getting in the way of rad therapy but since many of those things are left afterwards, it follows that we should get back to those vitamin supplements soon after. Dancetrancer, I will look up those guidelines too. My tumor was 3 cm but some margins were 0.02 mm. So why radiate the entire chest wall behind the mastectomy site, when margins were only small in one small area near the skin? Other margins were 2 cm or greater. Some facilities just love to use those machines. There's a lot of money in it for them.",
      "MessageIndex": 242,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Mar 25, 2013 08:42PM MsW2012 wrote: Good morning. I will have #13/33 today. Kind of ticked that the doc & techs didn't tell me to take care of skin on my back too. I noticed a few days ago a large rectangle of reddish brownish skin back there. Just glad I noticed before it got bad. Everywhere else looking great so far. I use vitamin e cream 3-4X a day plus aloe vera gel right after treatment. Does anyone else have pain around the implant port? It is feeling just like it did right after surgery. I hope it doesn't get worse. Take care! We can do this!",
      "MessageIndex": 246,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 2, 2013 10:26PM MsW2012 wrote: Laurascott: I find the next best thing to Aquaphor is vitamin e cream 30,000 IU. I found it at CVS, their brand. Nice and thick so put on slowly like Aquaphor. It has been keeping my skin soft. Hope that helps! waiting for doc now with my xray questions. Take care!",
      "MessageIndex": 272,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 4, 2013 09:02PM MsW2012 wrote: Numbersinger, it's funny, I just made that suggestion to my RO on Tuesday about the skin areas to treat. I said the physicist is able to do so much with all the patient data and digital images, he should be able to print out diagrams of exactly where the skin is going to be exposed. She thought it was a great idea. Why didn't anyone think of that a long time ago? I think I will run it by the ACS too, for general patient tips. It never hurts to ask, and if they have the capability, I think they'd be happy to do it. Everybody's treatment plan is unique. It's all about the angles. I have a kind of trapezoid area on my back, and the area just under my armpit is the reddest. The onc said wherever something is concave, it's going to get \"bounce\" exposure. I am hit from four different angles, and they overlap on my back and side. You are so right. Moisturize beginning a week before, and be diligent about it! I can see the part of my back I was missing with the moisturizer. It does make a difference.",
      "MessageIndex": 280,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 30, 2013 09:03AM MsW2012 wrote: Update. The radiology dept doesn't have on-call after hours but I contacted my MO. She said as long as it looks clean I shouldn't put anything on it, just put some gauze loosely over it for the night, then if it doesn't look better by morning I should go in and have the radiology dept. bandage it for me. She said there is no immediate risk of infection. Phew!",
      "MessageIndex": 302,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jul 6, 2013 05:45AM MsW2012 wrote: Bayoubabe, my plastic surgeon also wants to do my swap earlier than the std 6 mos after rads. Makes me a bit nervous but I will discuss it with him. It's great but don't want complications later, right? It's all about inflammation. So sorry about the machine breakdown. That happened to me too but luckily not on my last day. No fair!!! Slv68, my techs & RO said 1% hydrocortisone cream is fine. When that stopped helping the RO prescribed another cream. Can't find the name right now but if u r interested I will find out the name.",
      "MessageIndex": 350,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Aug 7, 2014 03:02AM MsW2012 wrote: On the subject of \"tanning,\" I too have an area of darker skin from the rads, even now a year after last dose. I had 28 days of X-radiation plus five days of electron radiation. The electron part is the part that left the really dark area. The slight tan I got from the X-radiation faded completely away within I think several months.",
      "MessageIndex": 431,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jun 3, 2015 04:45AM MsW2012 wrote: Raidergirl, I love your sense of humor! :D ",
      "MessageIndex": 541,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 3, 2013 01:06AM MsW2012 wrote: Thanks RMlulu! Yes got my answers. I think my case is complicated because I have four different fields, from 5° to 260°, plus 3 sub-fields! Then you throw in x-rays and well, there's a lot goin on there. Check off #15/33! Woohoo! Moisturize & hydrate everyone!",
      "MessageIndex": 274,
      "PostDate": "03/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 4, 2013 03:29AM MsW2012 wrote: RMlulu thanks for the smile! I think we have some bubbles around here somewhere. Life can always use a little bubbly!",
      "MessageIndex": 276,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 9, 2013 10:34AM MsW2012 wrote: RMlulu- Sorry to hear about the third boob! And sorry to hear your skin is not faring well. For me, so far so good, no blistering or anything, just pretty red under the armpit. I have been using 30,000 IU Vitamin E cream first thing in the morning and twice in afternoon, plus Aloe gel right after treatment and Aquaphor at bed time. Do cold packs take the swelling down? I hope it's not painful. I actually lost count and I realized over the weekend this is my last week, not counting boosts! So I'm 24/33 now. After this week, it's down to boosts, wow! I did get what the RO calls follicular damage in one area so I'm using prescription ointment there. Not out of the woods yet. Just think, once we're through this it's all downhill from there! I will have Herceptin through October plus some kind of reconstruction. Haven't thought too much about that yet. Tomorrow: genetic counseling re BRCA testing, since I'm adopted. That will be interesting. Sweet dreams!",
      "MessageIndex": 287,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 11, 2013 06:13AM MsW2012 wrote: RMlulu, yes that would be so cool if we all had our rads together. I can just imagine. We would do a lot of laughing, for sure! What a nice thought. Better days ahead!",
      "MessageIndex": 295,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "May 2, 2013 10:06PM MsW2012 wrote: RMlulu, how are you doing? I hope your skin is healing well. I keep slathering on the vit e cream, and Aquaphor at night. There was very slight peeling just about everywhere but that really scary heavy peeling was at the boost site. Now, 2-1/2 days later you would never know it was there. Your doc sees you 3 weeks after? Mine gave me 6 weeks. I hope you are doing well. -Elizabeth",
      "MessageIndex": 309,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "May 9, 2013 06:12PM MsW2012 wrote: Hi waiting- yes my skin is doing great. Almost done peeling and not itching or burning at all. Just a little tan on my back. I am glad you were able to get help from the hospital's patient advocate. If it takes going back to school to become a social worker, that's what I'll do! I can't think of a better way to use what I have learned, not just in this cancer journey. Health care just keeps getting better, but more complicated too. We have so many choices, and so many things can go wrong, especially in coordinating care. I hope I can work equally with patients and providers to improve communication and ultimately patient outcome. I am glad you healed well too! Isn't it amazing to be through with it? Yee haw!",
      "MessageIndex": 319,
      "PostDate": "09/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jun 21, 2013 04:06PM MsW2012 wrote: Hi 35Smiling! Congrats on coming through surgery.  I know just what you mean about looking at your body. I still have my temporary (expander) implant and it's not pretty. In a bra I look ok though, so that is some comfort. My plastic surgeon keeps reminding me this is just temporary, and the nurses keep reminding me I am lucky to be alive and cancer free and they're all right - but that doesn't change the kind of mild distress of looking at myself this way. It takes a whole lot of patience. For you, there will probably be a couple of months for the swelling to settle down. For me, I've been waiting almost a whole year so far, getting through chemo and radiation since my mastectomy last September. My medical onc and rad onc say they recommend waiting six months after rads before doing final reconstruction surgery but the plastic surgeon says four - I will see him next month and see if he still thinks my body will be ready for our tentative August 3 date. I hope so! Hang in there! I'm right here with you. It's a long scary road but it has an end! Let us know how everything turns out, ok? Best wishes. You will be in my thoughts and prayers. -ELizabeth",
      "MessageIndex": 328,
      "PostDate": "21/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jun 23, 2013 02:35PM MsW2012 wrote: Thank you Cindy! My skin looks excellent except for the boost area. There it is tan, tough and taut - hey, 3T's! lol I have lots of faith in my plastic surgeon so I don't expect it to be a problem. That area is off to the side anyway. I hope you are doing well too! I haven't followed every post here - let me know how you are doing. Kind of cool getting used to not having appointments every day, ha? -Elizabeth",
      "MessageIndex": 333,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jul 5, 2013 11:45PM MsW2012 wrote: Celineflower, I feel you! It's awful what we have to go through. Yet it is possible to power through, as you have done so far. There are things you can do to minimize side effects. I feel like the best thing was to use the creams or lotions faithfully to protect your skin. Coming here is great too! We are in your pocket, cheering you on. It was great to be finished with chemo, and even better when I finished rads, because the whole journey is that much closer to the end. Enjoy your weekend. You will be in my thoughts and prayers.",
      "MessageIndex": 342,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jul 15, 2014 06:40AM MsW2012 wrote: Lol infobabe you are so right. I finished treatment and haven't checked back, that was April 2013. So, just checking in to say like I've said before to new patients: never be afraid of asking too many questions. Bottom line is, understand what it is the rad onc wants to do and why, and do whatever you need to do - research, second opinion, more questions - to feel confident. Not every doc is ethical, unfortunately, and mistakes do happen. It's your body and you have the right to make the final treatment decisions. Your decision may be based on your doc's advice and that is ok too, as long as you have trust and confidence. I have a lot of tough tissue from the rads, but now I am going to have DIEP flap surgery and the PS will just remove it all and replace it with the nice, soft skin and fat from my tummy. I wish I had known about this option from the start, never would have gone with the implants. Broken record time: Moisturize, moisturize, moisturize! Before, during and after. My skin on the surface stayed nice and soft, although after the electron radiation I did have skin breakdown. Pure aloe gel right after treatment each day, Vitamin E cream and Aquaphor every night. Best wishes my bosom buddies!",
      "MessageIndex": 426,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Aug 8, 2014 08:24AM MsW2012 wrote: Hey there 'lulu! Thanks, yes, I am well. This DIEP flap surgery is a long process but feels so much better than my previous giant implant. (504 grams=about 18 oz of silicone!) My surgeon did a good job although her bedside manner is awful. I will probably find someone else for the remaining touch-ups. How are you doing?",
      "MessageIndex": 433,
      "PostDate": "08/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Aug 9, 2014 09:26AM MsW2012 wrote: Thanks 'lulu! I'm not up on all the shorthand. LE and dragon sleeve? I take it Al is chemo? Anyway I hope you tolerate the Zometa well. I still have slow-healing joints & bones from Herceptin. MO says eventually that will improve back to normal. I ran my toe into a door in Feb. Four months before redness & swelling went away and it's still tender! Minor complaints. As far as rads, I have a kind of crater edge of tough tissue all around the MX site that is more obvious since the DIEP flap surgery. I have had this area of perpetual purple bruising there but with my new lady it looks like the bruising is finally starting to fade, yay! Best wishes with the Zometa. How long, how many infusions?",
      "MessageIndex": 437,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Dec 5, 2014 12:04AM MsW2012 wrote: Raidergirl, you are so right. It was quite an eye-opener for me when I first discovered all those things you pointed out about different doctors and different levels of understanding and opinions. We absolutely need to be our own advocates. Also, yes, daily skin care is important, and we do need extra rest to heal the collateral damage from the rads. I found rad therapy a walk in the park compared to chemo. Being here with friends helped the most. Leenso, we are here for you. Hang in there, and keep asking questions. -Elizabeth",
      "MessageIndex": 455,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jan 14, 2015 12:58AM MsW2012 wrote:",
      "MessageIndex": 477,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "May 2, 2013 09:57AM MsW2012 wrote: A note about speaking up when you have questions. I made a super pest of myself, asking repeatedly, beginning a week before my boost, where the boost would be and how strong. Got a partial answer the Friday afternoon before treatment. Went ahead with Monday morn tx but was told I could see the RO the next morning. Threw them off sched. Long story short they showed me all the imagery & explained how they arrived at the tx area, but I am still certain they targeted the wrong spot. I believe they explained their science as completely as they could, but I believe the science failed them this time. I gave up. I felt like I was a \"problem patient\" so I gave up. I wish it had occurred to me right away, when I went into the changing room and saw the area marked with ink on my skin, to ask them to confer with my surgeon. He could have told them they had it wrong. The ROs never saw me before my mx, never felt the tumor. I know it was in my breast, not my armpit. It was halfway between nipple and outer edge of the breast. The skin is thinnest where the tumor was close to it, that same area, where they should have directed the boost. I feel sure that when I see my surgeon in July he will see the error. But then what? The damage is done. I feel defeated. I am trying hard to remain positive. Overall, I feel fortunate to have all this treatment available to me. I will be fine, and if it turns out I need further treatment to that skin, I will get it elsewhere. Moral of story: we have a right. Maybe an obligation. To feel confident about our treatment. If you feel worried or concerned, speak up. The other side of the coin: listen to and trust your drs. Unless they give you a specific reason to doubt them. Thanks for listening.",
      "MessageIndex": 311,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Oct 28, 2014 03:46AM MsW2012 wrote:",
      "MessageIndex": 449,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 30, 2013 05:49AM MsW2012 wrote: Ugh, I just found some awfully ugly skin at the boost site, today is 10 days after last treatment. This morning it just looked like leather and just now it looked like cobwebs and lifted off like paper - is that normal? I'm afraid to put anything on the shiny skin underneath. I washed the area with soap and dabbed it dry and that didn't hurt. Anyone experience this? Do you do anything different once this happens? I'm wearing a giant t-shirt so nothing touches it. Of course this happened right before 5:00 so I can't call the nurses. Thanks.",
      "MessageIndex": 299,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 30, 2013 06:52AM MsW2012 wrote: Thanks Cindy. What a sweetheart you are. I will try calling and see if they have an after-hours number. Thanks for your healing thoughts! And congratulations on finishing, yippee!!! :D",
      "MessageIndex": 301,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "May 2, 2013 01:09AM MsW2012 wrote: I got an appt to see the ro at 2 pm the next day. That morning it still looked so scary I couldnt wait. Then by 1 pm it had dried considerably and looked so much better I cancelled. It was healed enough that I wasn't too afraid to touch it. Slathered on aloe gel. It is looking great now. It just looked so scary the other day I could hardly sleep. Praise God for our wonderful resilient bodies! Best wishes to everyone. The healing time is the best.",
      "MessageIndex": 305,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "May 2, 2013 04:31PM MsW2012 wrote: Good news Cindy. Glad your skin is looking good. Enjoy the break in treatment!",
      "MessageIndex": 314,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jun 22, 2013 01:55PM MsW2012 wrote: Hi sciencegal. Yes, I actually came through radiation extremely well, until the boost portion. I had no skin problems at all, but I did use the moisturizers 3-4 times a day faithfully. The Aquaphor is greasy like Vaseline but I glommed it on at night, wearing old t-shirts to bed. During the day I used aloe gel right after treatment and a strong Vitamin E cream (30,000 IU) during the day. I used cornstarch for deodorant and it worked surprisingly well. My skin didn't like the boost. It broke down a few days after the last treatment. I also didn't understand why they were treating the area they did with the boost. If I had it to do over again I would have declined the boost portion of treatment. I still feel like the boost (last 5 days) treated the wrong area. But that's an issue that hopefully won't apply to you!  Drink fluids and moisturize! Good luck. -Elizabeth",
      "MessageIndex": 330,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jul 18, 2013 01:37AM MsW2012 wrote: I will be very interested to hear the answed on that. One month after chemo, my wbc's had been coming up nicely. Then two wks into rads they started dropping again. My rad onc said it was not from rad. Then I thought it might be the Neulasta having taxed my bone marrow too much during chemo so I called their number. They were very concerned and called my med onc. Then she said I sd have told them I was in radiation. I trusted the rad onc so I didnt mention it. Now the med onc says radiation definitely lowers wbc's because it radiates through bone, in my case some ribs. So what's the scoop?",
      "MessageIndex": 360,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Aug 1, 2014 06:07AM MsW2012 wrote: Good to hear from you too, RMLulu. The DIEP surgery went, well,... pretty well. You're right, there's no chart to predict exactly how any of these major procedures will turn out. Each case is truly unique.  I am thrilled to have that troublesome silicone implant out, and I am healing nicely. Not sure I'll ever look as normal as I had hoped but at least I remain cancer free.",
      "MessageIndex": 428,
      "PostDate": "01/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 28, 2015 08:41AM MsW2012 wrote: Hopeful, I am with you on what you said about ROs. They act like side effects are nothing, and they dismiss daily concerns. Genetics must play a part in response to treatment but also state of technology at the facility, including Dr. familiarity. I had MX with 28 days x-radiation with bolus, no real problems. I was faithful with care regimen of aloe gel, aquaphor and 20,000 vitamin e cream. I did get skin breakdown a few days after the last of five boosts of electron radiation, also with bolus. Nobody ever said anything about wanting to see a burn! And I didn't understand the extent of the toughened tissue. Chest wall radiation left me with that all around the upper front rib cage and especially a big ridge all around the mx site.",
      "MessageIndex": 526,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Mar 26, 2013 01:35AM MsW2012 wrote: adagio, I have been very apprehensive too about the radiation. I just had #13 of 33 and by now the tension has eased quite a bit. For me it was just such a huge unknown. I asked LOTS of questions! But the RO's and techs are super nice and helpful. We want to zap that cancer good so it doesn't come back any time soon. Don't kick yourself for being nervous. It's some powerful stuff.",
      "MessageIndex": 252,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Apr 8, 2013 10:58AM MsW2012 wrote: Thx RMlulu! I am doing well. Just two more weeks of rads, I can hardly believe it. How are you doing?",
      "MessageIndex": 282,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "May 9, 2013 03:58PM MsW2012 wrote: Hi Peggy, It's weird but I think many here would agree - on the one hand rads is nothing compared to chemo, but then again it another way it is more stressful. There is more unknown. It is even less an exact science than chemo - and the drs will tell you that. You don't feel anything, you don't see any direct result, there are no meds to alleviate symptoms like chemo. Most people experience what feels and looks just like sunburned skin, even though it's entirely different. I had 28 days of treatment plus five days of electron-radiation boost for the skin, and my skin finally \"broke down,\" as they put it, about a week after the last day of treatment. Even then, the skin looked much better less than 24 hours later, and never required any special teatment. Just use your moisturizers of choice generously a week or so before, during and after treatment to enhance healing. About my question about the treatment area, I did send photos to my cancer surgeon. He said from one angle it looked like it \"might\" have hit the right spot but from the other photo he \"couldn't be sure\" without seeing me. I don't know how to shorten this story so here's how it turned out: I phoned Tuesday morning to request the report the RO had promised me since before the boost treatment started, but I never got. It's called a skin rendering and it's an image of the body, like a sketch of the skin surface, with an outline of exactly where the beam is going to hit the skin. The receptionist asked if I wanted to come in and pick it up, or have her mail it to me. I was going in the next day for a nutrition class anyway, so I said if it was ready, I would pick it up then. To my surprise, when I got there she said the doctor wanted to give it to me. So after the class, the RO came in and took me into her office. I was completely caught off guard, not expecting to see her that day. She handed me the printout, but told me she understood that I still had concerns and wanted to know if there was anything more she could do for me. Here was my chance! I consciously put aside my respectful subservient attitude and addressed her like I would a close friend. I explained that not being a doctor, there was only so much I could grasp about how they came to determine the treatment area. I told her I trust that the physicist knows what he is doing, and that I trust that she and the other docs know what they're doing, but that I feel certain the science must have failed them. I repeated what I had been saying about how I couldn't see how any skin that had been adjacent to my tumor could have migrated directly under my arm! The tumor had been behind the nipple and extended to about 10:00 towards the breast surface to my right. The center of that surface area was about 2\" away from the center of the well under my armpit, where they centered the boost treatment (which by the way was directed at skin-only). She repeated her spiel about how the implant is so differently placed than the original breast, and how the skin shifts during the mx/reconstruction. I then repeated what I had been saying: wherever the skin may have shifted, it would have shifted towards center, towards the incision, not outward towards my side. But the argument that finally seemed to convince her was this one: There is a circular area of skin on my breast (foob!) now that is visibly thinner than the rest, just towards center from where the tumor used to be. That's when her eyes lit up. Yes, she said, she remembered me pointing that out early on during the initial treatment because it was swelling up more than the rest. That's when she finally acknowledged that the boost treatment may well have missed the mark. She said, \"you would think that would correspond to the area where the tumor was closest to the skin during surgery.\" Yes! I was not angry or disappointed. I already knew this. I told her that my impression was that radio-therapy is not an exact science, that in fact there was no guarantee I actually needed it at all, nor any guarantee that it got everything they were hoping. Same thing with chemotherapy. It is good science and in fact our best bet, but it is not perfect. Those beams don't behave like lasers and although we can be a lot more precise now than 20 years ago, it still isn't perfect. She acknowledged that. She also offered,saying she didn't know if it would make me feel better or worse, that the initial 28 days of treatment did radiate the area in question, so it's not as if it didn't get treated at all. I told her actually, I hadn't thought about that, and in fact she was right - it did get treated, and I did feel better realizing that. So, even if the five days of boost radiation may have been wasted, at least I was still in very good shape. I really feel ok about this. I am especially gratified that this doctor was willing to be straightforward with me, which is different from other experiences I've had during this cancer journey. Even though ideally, one of the RO's would have been able to figure this out from the start, at least once she realized there was something to what I was saying, she was willing to admit it. That doctor-patient trust is soooo crucial! The lesson that comes out of it for both me and the doctors is: listen to your patient, even if you think they are way off in their comprehension of the process. But even more so, I think, as a patient, keep on trying until you get through to your doctor. If you have a concern, I really believe they want to address it, and correct anything that is amiss. Don't worry about inconveniencing anyone. You are paying them to help you. Think your question through as best you can and try to present it plainly and clearly, not throwing a bunch of concerns out there at once. Give the doctor the opportunity to answer, and try your best to be open-minded enough to consider what he or she is saying. But don't get exasperated and give up. Get the answers you feel you need. Listen to your instincts. Oh, and to answer the other question, no, the RO's never saw me before my mastecomy surgery, so they never actuall saw or felt the tumor. Like I said, I still think they should have consulted with the surgeon, especially once I pointed out that the tumor was not in the area they were targeting. They just didn't think there was anything to what I was saying because all they could see was the science, which they derived from the PET and CT scans. I want to put this out here too: I have decided to change course in my career, instead of pursuing freelance writing for the performance industry, I want to become a patient advocate. I have no idea where to begin, but I am starting by asking questions! I will do some research and talk to people until I find a good place to start. I have no medical background but I do have a college degree. I want to spend my time and energy doing something that will make a difference in other people's lives. The social worker at my cancer center was a great example: I had a problem with the administration at the hospital and he laid out for me, without emotion, what my options were and helped me weigh them. I want to do that for others! Thanks Peggy and Cindy for caring. We are all in this together! We learn so much from each other - I sure have learned from everyone here. Love and hugs!",
      "MessageIndex": 317,
      "PostDate": "09/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "MsW2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162423/profile",
      "Content": "Jul 6, 2013 07:58AM MsW2012 wrote: Bayoubabe, I was really disappointed when the RO and MO said the wait wd be 6 mos after end of rads. When I asked the PS he said no, we cd do it sooner. I am sure it depends on what your tissues look and feel like, plus the whole anatomy of the original surgery. Maybe 6 mos is the max. I will see my PS next week and ask him about it. Slv58 yes like RMlulu said, lube your back too, because x-radiation goes all the way through your body. They should be able to give you a \"skin rendering\" that shows exactly where your skin will be affected, front and back. Also they might have a way that you can bring your own music to be played during treatment. I brought Mozart, very soothing. As for long term effects, the RO can explain the risks vs benefit and you have the right to do it or not. I imagine it as sterilizing the tissue, rendering it useless to the cancer. I don't understand how it can increase cancer risk tho, I just accept that it does. But don't ever hesitate to ask questions and express your concerns. It's your body and your life! Sending calming, healing thoughts your way. Hugs!",
      "MessageIndex": 354,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    }
  ]
}