{
  "AuthorID": "mtmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195573/profile",
  "Posts": [
    {
      "AuthorID": "mtmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195573/profile",
      "Content": "Feb 21, 2015 12:09PM mtmom wrote: Ladies, First please forgive me. I started reading thru the postings and got overwhelmed. So, I'm sure my question is on here somewhere. I'm wondering what were your first symptoms before dx of lung mets? I go in on Tues for CT but I'm anxiously diagnosing myself. Quick background: stage 4 dx Sept. 2014. Have been on hormone and chemo therapies. Mets to liver, nodes, and skin. I'm having a hard time this cycle of Xeloda...doc doubled dose. This cycle was Taxotere, Xeloda, and Faslodex. I've been sleeping ALOT! As for breathing I get winded easily, hard to catch my breath, O2 sats were at 90 this last week, and small cough. I find if I roll out of bed I have to cough when I sit upright. I am diabetic type 1 as well and my ketones have been very high. I had a bag of fluids to help the other day. My tumor markers are up and so I'm thankful for the CT. I'm also having a hard time eating or drinking. Thanks in advance for your time and input. ~Mtmom",
      "MessageIndex": 1376,
      "PostDate": "21/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "mtmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195573/profile",
      "Content": "Feb 21, 2015 08:15PM mtmom wrote: Thank you, Calico. It does help to read all that. Gives me additional info when I go in on Tuesday. I hadn't ever heard of chemo affecting breathing in that way but it makes sense. That stuff causes such chaos sometimes. Thanks and blessings, ~Mtmom",
      "MessageIndex": 1379,
      "PostDate": "21/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "mtmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195573/profile",
      "Content": "Feb 26, 2015 11:26AM mtmom wrote: Thanks for the response. After CT lungs themselves look ok but I did have fluid around both. Had a liter drained off right lung yesterday and they will let the left sit and see what happens. Waiting for results of biopsy on fluid. Today I see the surgeon and tomorrow I go in for lymph node biopsy on left side (had mx on right already). Not quite sure how I went from worrying about lung mets to getting a node biopsy!!??!! Sometimes...cancer, the gift that keeps on giving. Darn! ~Mtmom",
      "MessageIndex": 1381,
      "PostDate": "26/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "mtmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195573/profile",
      "Content": "mtmom wrote: Have you felt like all of this is going so fast? Hard to wrap your head around? I go in tomorrow for my 5th cycle of Taxotere but I also start Xeloda. Then next week I have to go in for my Faslodex shot. I know after reading several posts and putting together some of your stories that this can be a long, bumpy road. But, it feels like a roller coaster in a tornado! I was diagnosed in March 2013 and finished chemo, surgery, and radiation by November 2013 and started Tamoxifen. Hair started to grow back and I was still deciding on a style. Mets to liver and lymph nodes dx in September 2014. I hadn't even gone a year! Started with hormone therapy but nodes grew so fast I couldn't use my arm or keep my head up (nodes in neck and shoulder) so in October we started Taxotere. Scan in November was wonderful. All tumors were shrinking, liver mets were dying, and lymph nodes looked normal. Bumps on skin in radiation area found in December...skin mets...and new scan done January (2 weeks ago) showed liver was still responding but lymph nodes were growing again and more are participating. Staying on Taxotere for liver and adding the Xeloda for skin and nodes. Faslodex is a catch all. I feel like I haven't had time to catch my breath and that it will always be this speed. Is it just trying stuff until we find the best combo? I would love to hear from you. I ask my doc and the nurses and they try to give me honest answers, but sometimes there aren't answers. Thanks in advance for the input. This board has been so helpful. Blessings, ~Mtmom Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827699",
      "Title": "Feels like it is all happening sooo fast! Know what I mean? mtmom Bestbird"
    },
    {
      "AuthorID": "mtmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195573/profile",
      "Content": "Jan 19, 2015 08:10PM mtmom wrote: Bonnie, My first thought was \"What?\" I had heard of not doing additional radiation treatments because of too much exposure, but I NEVER thought about scans! But, it looks like you have been stage 4 from the start? Thank you for the reminder that there are still some good days and thank you for the hug. :) Smiley, Thank you for sharing. I've worried about the chemo for life...doesn't sound like fun. I still have kids at home and hope to keep some energy just to enjoy them and my hubby. I know the numb feeling. Seems like it goes with the progression. I hope you can get your anxiety under control. That in itself is a joy and life stealer. Starbrightlyshines, Thank you for the encouragement. I'm sorry you were sick for the 2-1/2 years, but glad you are better. That is hopeful to me. I hate that I've had to take from others' pain but I am thankful for all of you that are willing to share. It does help with the loneliness. Will you post how your scans come out in Feb? Thank you, thank you, thank you!!! Blessings, ~Mtmom",
      "MessageIndex": 3,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827699",
      "Title": "Feels like it is all happening sooo fast! Know what I mean? mtmom Bestbird"
    },
    {
      "AuthorID": "mtmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195573/profile",
      "Content": "Jan 19, 2015 08:47PM mtmom wrote: Maureen, Thanks for the reply. We've talked about having the tumors tested. Doc wants to wait a bit. I'm also a type 1 Diabetic (since I was 13) and he isn't too interested in \"carving\" me up until we need to just for healing reasons. I had my port taken out 1 month before I needed it put back in again and I had trouble with healing and infection at that time. But, now that I think about it I'm not sure that was for tumor testing but more for biopsies. I'll ask him when I go in tomorrow just to clarify. Aaah, lovely chemo brain! I always try to take someone with me to appointments to help me remember what was discussed. Blessings, ~Mtmom",
      "MessageIndex": 5,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827699",
      "Title": "Feels like it is all happening sooo fast! Know what I mean? mtmom Bestbird"
    },
    {
      "AuthorID": "mtmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195573/profile",
      "Content": "Jan 29, 2015 12:54PM - edited Jan 29, 2015 12:58PM by mtmom Hi All! I just hopped on this thread. What beautiful children! And families. I've read through the posts and was wondering how everyone is doing? I'm here with my little one who is running a fever and has a nasty sore throat and cough. Hate that we can't snuggle!! And my 19 yr. old will be home soon to help take care of things. Have a blessed day! ~Mtmom (8, 16, 19, 29 year olds...love them all!) Edit: Okay, I feel stupid...and a fine example of chemo brain...I thought there was only one page on this thread! Read that and wondered how everyone was doing. Duh! Okay, I've found all the pages and am catching up right now. So sorry!!",
      "MessageIndex": 378,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    }
  ]
}