{
  "AuthorID": "MuddlingThr…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
  "Posts": [
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 30, 2018 01:27PM MuddlingThrough wrote: I have not heard of Ixempra before but I hope it will work well for you. Hopefully someone who has experience with this treatment will be along and discuss it with you. ",
      "MessageIndex": 1,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866909",
      "Title": "Ixempra and skin mets nancylp Daniel86"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 3, 2018 03:31PM MuddlingThrough wrote: Hi Stage 4 2018, de novo",
      "MessageIndex": 554,
      "PostDate": "03/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 30, 2019 04:33PM MuddlingThrough wrote: Mae, it's funny you started this. I was going to start a reverse bucket list thread since I probably won't reach my further bucket list goals in the future but it is SO good to remember the things I've already done that are bucket list worthy. Here goes, in no particular order: Go to a Duke basketball game in Cameron! DH and I did this and had fantastic seats next to the band with seats close to the action. Also had a tour behind the scenes and had a luncheon with some of the basketball staff before the game, including former players. Ride in an original Model A car. So much fun! Went to Disney World...the year it opened! Experienced Hale-Bopp comet. No other word than \"experienced\". I've been an avid sky watcher for decades, but this long term sky show was the most eerie feeling ever. (Second place goes to meteors that are big enough to make noise. Yep, I've seen and heard those too.) Watched a giraffe being born, live and in person at Natl Zoo, waaaaaay before internet star April was ever heard of. Rode a couple of laps around Charlotte Motor Speedway. So what if it was in a tour bus? It was awesome. I saw a ghost. Hard for me to believe too, considering my science background and skepticism. However, it's true. This was long before my mbc dx, but I wish I could see another one. I've got questions.",
      "MessageIndex": 5,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869608",
      "Title": "What’s on your bucket list? illimae Andi67"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 30, 2019 06:50PM MuddlingThrough wrote: Philly, that sounds reasonable to me, but sad ( possibly dangerous) for the person who is being high-jacked. In spite of my \"knowledge\" I know there is so much we don't know. Maybe, one day we will. In the spirit of this great topic, I'm going to try to think of future bucket list items that I might be able to attain, even with current limitations. Mae, thanks again for a great topic. ",
      "MessageIndex": 12,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869608",
      "Title": "What’s on your bucket list? illimae Andi67"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 30, 2019 06:21PM MuddlingThrough wrote: Philly, saying prayers for you. The ghost I saw was of a well loved family member. Nothing scary. I saw him under a street light across the street. I double checked to see just who was watching the house. I saw who it was and all the hair on my neck raised up. (He'd been dead 6 or 8 years then.) Not more than 50 feet away. So calm and peaceful. I asked him, aloud, if he was okay. He nodded. I said we were doing okay. He put his arm out to the side, and bowed his head. I asked, aloud, if he wanted to say anything and he nodded, looked left and right and...faded out very slowly. I was wide awake and stone cold sober. I wish I'd walked across the street rather than talk from the porch. As you can imagine, I'd have many different questions today.",
      "MessageIndex": 10,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869608",
      "Title": "What’s on your bucket list? illimae Andi67"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 19, 2018 05:07PM MuddlingThrough wrote: finallyoverit, I could have written your first paragraph word for word today. I am very sad for that young man who died from pancreatic cancer. I truly hate cancer especially when it affects children and young people. I am \"lucky\" and I'm better than I was at dx, but something this week really has me down. Maybe it's the earlier sunsets? I don't know. I'll probably turn around but I'm so tired of being tired and hurting.",
      "MessageIndex": 6,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867280",
      "Title": "Perspective finallyoverit finallyoverit"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 31, 2019 02:13PM - edited Jan 31, 2019 02:14PM by MuddlingThrough Divine,thanks for the reminder to see, really see, places close to us. Heidi, if the ghost hadn't been a family member, I would have been freaked right out! I'd never thought to see him. Never saw another, although my grandmother made a music box in my house play a few notes at the time she died in another city. Sort of a \"toodle-ooo\". Kayla, seeing Auschwitz isn't morbid; it's honoring the enormous loss and placing it in history. I love all your lists and plans, everyone!",
      "MessageIndex": 28,
      "PostDate": "31/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869608",
      "Title": "What’s on your bucket list? illimae Andi67"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 31, 2019 04:21PM MuddlingThrough wrote: Mindi, you are new to stage 4. Stay here and also jump in on some other stage 4 threads too. I love the name of the Fat Ass Run! I would certainly qualify, and not on the running part.",
      "MessageIndex": 37,
      "PostDate": "31/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869608",
      "Title": "What’s on your bucket list? illimae Andi67"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 9, 2019 03:43PM MuddlingThrough wrote: Live, I had pleural effusion at diagnosis last Jan with thoros, pleuradecis, all that. Was on oxygen 24/7. After my 12 weeks of taxol I started Ibrance and letrozole at the end of March. By the end of May I was able to go several hours a day w/o oxygen and extended that time until I didn't need it at all by mid-summer. I didn't need a thoro after I started Ibrance. The fluid I did have gradually went away. I hope it works quickly for you.",
      "MessageIndex": 2069,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 18, 2018 10:50AM MuddlingThrough wrote: There's a great topic called \" Liver mets: resection, ablation, SBRT, Y-90, anything else? \" here in the Stage IV forum. (I'd give the link if I could figure out this tablet.) Anyway there are many knowledgeable ladies there who've had various surgeries that were successful. I'm following there because even though my liver mets are not causing trouble now, I know things can change in a hurry.",
      "MessageIndex": 5,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/865272",
      "Title": "Liver surgery Kanga_Roo MuddlingThrough"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 19, 2018 05:00AM - edited Jun 19, 2018 07:44AM by MuddlingThrough KarPC, Thanks for posting the link! ðŸ˜€",
      "MessageIndex": 8,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/865272",
      "Title": "Liver surgery Kanga_Roo MuddlingThrough"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 27, 2018 07:38PM MuddlingThrough wrote: illimae, sorry you have a knee injury. Hope it gets better very soon.",
      "MessageIndex": 1867,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 30, 2018 12:01PM MuddlingThrough wrote: GracieM2007, did you tell your MO about this shortness of breath? Maybe they need to give you some blood? Maybe oxygen at home for a while? Please find out how they can help you and make them do it!",
      "MessageIndex": 1879,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 5, 2018 03:36PM MuddlingThrough wrote: Wow, illimae! Great way to get exercise and so much to show for it! Better than my walking in circles here in the house, lol. It's too hot to go outside though. ",
      "MessageIndex": 1791,
      "PostDate": "05/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 11, 2018 12:00AM MuddlingThrough wrote: CelebrateLife, I'm glad you got to play! I know that was your first goal!",
      "MessageIndex": 1899,
      "PostDate": "11/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 1, 2018 03:11PM MuddlingThrough wrote: Great reminders about exercise! You'll find a route to hike if the park stays closed. For years I walked 1 to 3 miles a day until last summer when I began to feel bad. I miss it. I've been on oxygen since Jan and was barely able to get to the bathroom for a few months. I am a little stronger now and use light weights with my good arm and gently with my bad lymphedema hand and arm. I walk back and forth in the hall and sometimes a short distance in the yard. I just want to put on the headphones and stride powerfully along the road as before. I hope I'll eventually get there. It's important now because I've gained some weight due to my medicine and/or my returning appetite. I want it gone!",
      "MessageIndex": 1751,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 26, 2018 06:31PM MuddlingThrough wrote: Scwilly and KatyK, I house walk. I walk up and down the hall and around the dining room table to the front door and start again LOL. It's a small house so I'm like a hamster on a wheel. I tell Alexa to play \"Love Shack\" but I don't try to step with the beat, it's too fast. I just walk, and sing (badly) and get warmed up. Then I tell her to play \"Double Dutch Bus\" and I do step to that beat. Last I order \"Uptown Funk\", again walking to the beat. That's about fifteen minutes so if I'm tired I stop or I get other songs and keep going. Before I walk I use my hand weights for a gentle set of arm and shoulder exercises, gentle because of bone mets and compression fracture in T11. I try to do some laps throughout the day, while I'm waiting on something in the microwave or during a tv commercial. Some days I do better than others! Earlier this summer I started walking my rural road like I used to do. That was fine until I got a tick bitten into the back of my shoulder. So far so good but Lyme disease is not in my plan. I stay inside!",
      "MessageIndex": 1863,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 19, 2018 10:35AM MuddlingThrough wrote: DivineMrsM, thanks for the nudge to get an avatar photo. I found this four leaf clover this morning on my walk. Six weeks ago I never believed I'd be able to take walks outside again. I can't walk that far yet, but I'm working on it.",
      "MessageIndex": 4736,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 19, 2018 02:55PM MuddlingThrough wrote: Lynnwood1960, I see it :)",
      "MessageIndex": 4739,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 23, 2018 12:59PM MuddlingThrough wrote: Prayers for your daughter, Grannax.",
      "MessageIndex": 4806,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 14, 2018 08:58AM MuddlingThrough wrote: Gracie, glad the port is in and that your surgeon seems to be making sure of your comfort with it. I know you're glad that's done! ",
      "MessageIndex": 5067,
      "PostDate": "14/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 24, 2018 06:32PM MuddlingThrough wrote: Lynne(man), I held my breath until I read he was okay. Whew. My husband and I dated 7 years before we married. Not sure how he has put up with me that long! Naturally I worry about him the most when thinking ahead.",
      "MessageIndex": 5211,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 27, 2018 03:27PM MuddlingThrough wrote: Bigbhome, sending you and DH and all the family healing and peaceful thoughts. Quite a lot going on with you all.",
      "MessageIndex": 5261,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 31, 2018 11:05AM MuddlingThrough wrote: Well, for nine months I have not had much use of my right hand due to some evil mix of neuropathy, actual cancer, lymphedema, and maybe even carpal tunnel for all I know. ( That's what I thought before dx.) Last night the pain was so bad I was whimpering before the tylenol could take effect. Every evening I tell myself to calm down...breeeeeathe...calm etc and try to list the positives, of which one is that my left hand is fine even if it's not my dominant hand. So, this morning I wake to my left hand completely numb. Some of that went away with movements but each fingertip is still numb. Damn letrozole (Ibrance?), which I need to stay alive. Very, very down today. Trying hard not to ask myself what is next and why bother. All I can remember is the onc who talked to me the day of dx saying \"There is no cure. There is NO cure. I can treat you until you can't tolerate the side effects.\" He isn't the onc I usually see but he was right, damn it. Pain, check. Crushing fatigue, check. Weight gain, check. Hair loss, check. Bone issues, check. Yadda, yadda, yadda. But at least I could use my good hand and flipper hand for some things. Sorry I'm just whining so will close now. I know you all understand. I'll probably adapt to this additional crap, but, wow, how I hate to ask for help with simplest things. Life in reverse. ",
      "MessageIndex": 5323,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 31, 2018 12:53PM MuddlingThrough wrote: Iwrite, that pizza is almost too pretty to eat. Hooray for new grandbaby! Thanks for news on Z, too.",
      "MessageIndex": 5325,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 9, 2018 08:51AM MuddlingThrough wrote: Micmel, thanks for the reassurance re: Claudia. Also that's a pretty cabinet you assembled! More pics when your curtains are up, ok? The shower preps will all get done and you will all have a great time. I used to use a spray called Spot Shot for carpet stains. If they still make it, get some and try it. Might buy you some time on having to do a big shampoo right now. We took up most of the carpet and got hardwood floors so I seldom need a stain spray now. Scwilly, that's a pretty sign, and true! Hello to everyone.",
      "MessageIndex": 5430,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 14, 2018 12:01PM MuddlingThrough wrote: Lynne, with you on growling about doctor office mess-ups! illimae, fried chicken date night! That my DH's favorite so he'd love for us to have that. Micmel, I also miss the energetic me, the one who walked 2, 3, or 4 miles outdoors, going up and down hills every day to the beat of my walking playlist. I house-walk now, since it's so hot and mosquito-y. Not nearly a mile though. I make laps up and down the hall and around the dining room table, ha ha. At first it's creaky, hobbly, old-lady laps but it does smooth out if I keep going. I had to get 1 pound hand weights and do gentle arm and back exercises because, Lord knows I don't want to harm my weak vertebrae, but my muscles need to do something. Lynnwood, sending you good thought for your tests! Waving hi to all. It's sunny and bright here, at least for now. ",
      "MessageIndex": 5515,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 20, 2018 09:53AM MuddlingThrough wrote: runor, I would ROTFLOL if I thought I could get back up. As it is, I am LOL. Then, I'm going to drink secretly in the laundry room, which up until now only hid one secret. It's the perfect spot to hide a box of pop tarts because no one else will ever stay there long enough to discover the stash. Micmel, I hope your test day was okay and that you got that tummy tamed. Now, go get those cosmetics ðŸ’„ ! Tanya, what a lovely surprise! You have a lot of spoiling to do â˜º",
      "MessageIndex": 5584,
      "PostDate": "20/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 22, 2018 01:54PM MuddlingThrough wrote: Shelia, I understand the worry. I hope you can find something to relieve your pain. Micmel, that sinus infection doesn't want to let you go! I hope you have antibiotics. Lynwood, I make plenty of excuses myself! Sometimes when I feel very bad and get upset with being weak and hurting I try to remember that I have gotten better, just not where I want to be.",
      "MessageIndex": 5615,
      "PostDate": "22/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 24, 2018 07:53PM MuddlingThrough wrote: Micmel, stalling is exactly what's happening. I'll just try to be patient. Not my best trait.",
      "MessageIndex": 5650,
      "PostDate": "24/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 25, 2018 06:35PM MuddlingThrough wrote: Thanks Tanya, I hope your weekend is good too. I had company today. Glad to see my sister and BIL but I am tired out! She lives a few hundred miles away so don't see her very often. I had been through my jewelry and I gave her what belonged to our mother or grandmother and a few things of mine that she might like. One thing off \"the list\".",
      "MessageIndex": 5661,
      "PostDate": "25/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 27, 2018 09:11AM MuddlingThrough wrote: Micmel, with you today for your bloodwork and Xgeva. It is all going to go perfectly.",
      "MessageIndex": 5683,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 27, 2018 11:30AM MuddlingThrough wrote: Micmel, my port acts up sometimes. Two weeks ago I was pleased to see it working great and filling those vials in record time. I had to go to the chemo room instead of the labs room and there was a man on my left so I scooted to the edge of the chair and turned right so that my left leg was straight down. Port is on the left too. I wonder if the leg being relaxed as almost a dead weight didn't help straighten everything and get it lined up on the left side? Maybe it was just a fluke but I'll try it again if it gets stubborn next time. ",
      "MessageIndex": 5688,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 31, 2018 11:55AM - edited Aug 31, 2018 11:55AM by MuddlingThrough Clearing off my computer desk today, I came across a poem I have read for years when I need to be calm. I read it a lot when I was working but read it today from a different perspective. The Peace of Wild Things by Wendell Berry When despair for the world grows in me and I wake in the night at the least sound in fear of what my life and my children's lives may be, I go and lie down where the wood drake rests in his beauty on the water, and the great heron feeds. I come into the peace of wild things who do not tax their lives with forethought of grief. I come into the presence of still water. And I feel above me the day-blind stars waiting with their light. For a time I rest in the grace of the world, and am free. ",
      "MessageIndex": 5749,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 18, 2018 03:33PM MuddlingThrough wrote: Just finished my first four 4 rounds of Ibrance & L and had scans Mon. Saw onc today and bone news was mostly good, some \"significant\" improvement and some unchanged with a possible (not certain) compression fracture in previously involved vertebra that we will watch. All liver lesions had shrunk since April and are now a lot smaller than at dx. I have a ways to go yet but I'm glad of improvement and good liver numbers on bloodwork. My lung issues are also much improved according to the scans also. Mostly good news and the onc says he's not changing a thing.",
      "MessageIndex": 9278,
      "PostDate": "18/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 27, 2018 08:25AM MuddlingThrough wrote: lulubee, Z posted on the abraxane thread a week or two ago and said she was feeling pretty good. Another member said they are connected via fitbit and that Z has been getting her steps in :) so I think she's just taking a break from the boards hopefully.",
      "MessageIndex": 9308,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 4, 2018 04:44PM MuddlingThrough wrote: Raven, don't panic. Deep breath. The environment in the liver is much different than other sites. The doctors are watching you (and all of us) *because* they know what can happen. They still have a lot of steps in the plan. At first, before any treatment, I went to another hospital for a second opinion and my onc was pleased that I did. I stayed with my first place after all. Once you feel like it, you might ask your current doctor a list of questions about treatment plans and whether you can have local treatment to your liver. Then take the same list to another doctor. Your current clinic will send your records ahead, with your permission. You may find, like I did, that both places would follow the same course. Maybe not. Then you decide.",
      "MessageIndex": 9382,
      "PostDate": "04/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 15, 2018 11:16AM MuddlingThrough wrote: Raven, there's lots of good advice here. I want to praise your exercise and encourage you to keep it up! Keep walking! I think I read that you play golf too! That's wonderful. Your counts will rebound and eating right and exercise will help that a lot.",
      "MessageIndex": 9458,
      "PostDate": "15/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 28, 2018 01:20PM MuddlingThrough wrote: Raven, so glad you're feeling better!!",
      "MessageIndex": 9820,
      "PostDate": "28/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Apr 14, 2019 05:37PM MuddlingThrough wrote: Max Otto, Kathy, I wish I had some good words to share. I'm struck by your kindness to let us know about you going into hospice care. I'll be praying for comfort and peace for you and your husband.",
      "MessageIndex": 11037,
      "PostDate": "14/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 17, 2019 05:20PM MuddlingThrough wrote: dlb823, I like that Conditional Survival chart! I'm only one year last MBC dx bit those statistics are encouraging, even while I also know how statistics work.",
      "MessageIndex": 4740,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 12, 2018 01:38PM MuddlingThrough wrote: Daniel86, Thank you for that link! I'm only a few months in but I hope they find many long-term survivors to participate. It already helps to know they exist but it's exciting to think what researchers could discover to help all of us.",
      "MessageIndex": 28,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864202",
      "Title": "Anyone 5+ years with liver mets and ER+ Her2-? ShetlandPony PaulaAmy"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 19, 2018 01:35PM MuddlingThrough wrote: Gracie, I'm glad you're in recovery!",
      "MessageIndex": 9141,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 8, 2018 08:13AM MuddlingThrough wrote: Raven, I finished my Taxol at the end of March. At that time my liver mets had gotten a bit smaller. My breathing troubles had gotten better and my \"innumerable\" bone mets were slightly improved or stable. I've been on Ibrance/Letrozole since then with generally good results but a possible new spot on bones and a possible compression fracture on T-11 (from previous damage) as of scans this month. Ouch. I have uncomfortable side effects from the Letrozole but I'm trying to deal with them since I hope and pray this treatment will work for a long time. I have four liver mets that the doctor mentioned and that are in the scan reports. I hope you and your doctors will get the right treatment in place and that they can help lessen your side effects right away. Keep us posted.",
      "MessageIndex": 9414,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 29, 2018 03:23PM - edited Aug 29, 2018 03:25PM by MuddlingThrough Raven, I just read this on the Xeloda thread. This excerpt is part of a post from Miaomix. It wouldn't hurt to try â˜º \"To get your immune system working again, to bring those elusive WBC levels up is important to eat tryptophan rich foods which the body uses to make melatonin. Tryptophan is an essential amino acid and one of the precursors to melatoninproduction. Increasing your intake of tryptophan-rich foods may boost melatonin levels. Some of the foods with the highest amount of tryptophan are spirulina, cottage cheese, chicken liver, pumpkin seeds, turkey, chicken watermelon seeds, almonds, peanuts, and yogurt. Garbanzo beans, however, win the tryptophan prize. They are loaded with free tryptophan (meaning it is not attached to a protein like in other foods) making the uptake of this source of tryptophan the best, and who doesn't love some chickpeas in a spicy tomato sauce with some chunks of chicken and green veggies?\" Edited to add link to the topic containing the post I quoted: https://community.breastcancer.org/forum/8/topics/772113?page=303#idx_9076",
      "MessageIndex": 9570,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 9, 2018 02:09PM MuddlingThrough wrote: Celebrate_Life, thank you for the encouraging words.",
      "MessageIndex": 9660,
      "PostDate": "09/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Nov 5, 2018 02:18PM MuddlingThrough wrote: kaufmanscsi, that is good to know! Glad it worked so well for you. After recovery, how do you feel, overall? Do you have other mets? I'm going to ask the oncologist about this some day.",
      "MessageIndex": 10068,
      "PostDate": "05/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "May 30, 2018 12:20PM MuddlingThrough wrote: Hello. I haven't posted before but I've been reading this thread and others in the Stage IV forum for a few months. I'll eventually fill out the bio but I was diagnosed de novo in January of this year. I was in very bad shape and the Oncologist said I probably had only days left without treatment. I knew it from how I felt! Anyway I have liver mets, numerous bone mets, and chest-area lymph nodes involved. Just the effects on the lungs would be a long story. I went once a week for ten consecutive weeks for taxol chemo. Then I started on Ibrance and Letrozole. I'm on the third round now and early indications from blood work are that I am responding well with tumor markers down quite a lot. I'll have scans in July and I'm hoping for good results then. I'm 58 with a very supportive husband of nearly 35 years and one grown son who is doing great on his own but he lives too far away! I have learned so much here and I thank you all for sharing your knowledge and experiences. I'm happy when there's good news and so sad when there are setbacks and losses. ",
      "MessageIndex": 8977,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "May 31, 2018 10:59AM MuddlingThrough wrote: Thanks for the welcome, everyone. After many months of physical misery before my diagnosis and a few months of physical and mental hell after it, I'm still reeling. I'll keep following along here and on the Ibrance topic and the bone mets topic too. I may chime in now and then.",
      "MessageIndex": 8988,
      "PostDate": "31/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 5, 2019 12:37PM MuddlingThrough wrote: So sad for Lisajo's passing.",
      "MessageIndex": 10476,
      "PostDate": "05/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 22, 2019 09:56AM MuddlingThrough wrote: Grannax, do you have an appetite and want to eat? If you eat do you feel sick or actually get sick? Or do you just have no interest in eating? Are you drinking enough water and liquids to stay hydrated? I'll think about this and I'm sure others will be along with good ideas.",
      "MessageIndex": 10561,
      "PostDate": "22/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 30, 2019 07:56PM MuddlingThrough wrote: RowWellandLive, good for you. I've been reading along. Be well, and I pray you never have to be here by necessity, but glad to have your viewpoints. God bless.",
      "MessageIndex": 10620,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 10, 2018 08:21AM MuddlingThrough wrote: Raine-Wells, I hope you and your med team get a new plan that is very effective.",
      "MessageIndex": 9241,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Oct 6, 2018 12:29PM MuddlingThrough wrote: Grannax, gorgeous! It looks like you had fun too!",
      "MessageIndex": 9890,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 5, 2019 08:21AM MuddlingThrough wrote: Miaomix I don't think money is withheld or research either. I don't even see how people could believe that, but some people do. I agree with you completely that cancer happens to everyone, rich or not, and to our own doctors and their loved ones. They want to unlock it as much as we do. I don't believe in some shady element holding back cures or better treatments. As JFL said I'm worried that something old might be a big help but not many are looking at it because it's not a shiny new thing. Recently I've read of antabuse and statins as being interesting. I hope they will run those leads to the end. They may not be \"it\", but perhaps will lead to better things. There is a lot of money and brain power in this. I just pray the ones who decide where to use it choose wisely. I always like to read your posts.",
      "MessageIndex": 10469,
      "PostDate": "05/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Mar 1, 2019 05:51PM MuddlingThrough wrote: Grannax, here's a thread for it :  https://community.breastcancer.org/forum/8/topics/... I follow it as a 'favorite' topic.",
      "MessageIndex": 10773,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 7, 2018 04:12PM MuddlingThrough wrote: Micmel, that chair looks so comfy and pretty too. PLEASE tell me you didn't haul it up the stairs!I He will like sitting there and keeping you company.",
      "MessageIndex": 5401,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 12, 2018 06:47PM - edited Aug 12, 2018 06:49PM by MuddlingThrough Micmel, be gentle with yourself right now, in grief for your friend. Everyone we see is slowly dying. Every one of us, since that first breath. None of us knows our lifespan. No. One. Is it that those of us with MBC will go before most of the people we know? Maybe. We are all on the same path and we go the best we can- strong one day and maybe weaker tomorrow but back to strong after that. We just do the best we can in that step and the next.",
      "MessageIndex": 5485,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 17, 2018 02:15PM MuddlingThrough wrote: Micmel, so glad you were there to hear your dog. You were exactly where you were supposed to be at that moment for sure! Close the door to that room until your DH can fix the problem. Snuggle and spoil that fur baby.",
      "MessageIndex": 5557,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 19, 2018 06:53PM MuddlingThrough wrote: Micmel, hope you feel better soon. illimae, happy half birthday. When my son was little we had half birthday celebrations in Jan. for him. We all needed cheering up in Jan! Nothing elaborate but special. Grannax, happy and safe travels! I have felt so bad today and couldn't figure out why. Not tolerating pain I can usually take, snappish, very depressed, just sort of whimpering, moaning with pain without meaning to. Then I remembered the fruit cup I had at lunch. Hmm. Did it have artificial sweeteners in it?? I got the label out of the trash can and, yep, artificial sweeteners!! I cannot tolerate them at all and never could. It's not a cancer thing. So, I still feel horrible but I know why. Hoping for a better day tomorrow.",
      "MessageIndex": 5579,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 24, 2018 10:13AM MuddlingThrough wrote: Micmel, I hope you won't have to take a break, but understand if you do. Lynne (Man), thanks for your kind words but not deserved! I try to move and exercise but some days are better than others! Some days I'm a couch potato! Hi to everyone! In the past week my DH and I have each had a cousin to pass away. My cousin had cancer, but he died in a car wreck. We just heard about the other cousin and don't know what happened but she'd had many health challenges for a long time. So sad for their families too. Many of my first cousins have or had cancer. Each one with a different kind. I'm the only BC in the list and I hope it stays that way!",
      "MessageIndex": 5633,
      "PostDate": "24/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 31, 2018 04:32PM MuddlingThrough wrote: I'm sorry for this period of sadness and remembrance Lynnwood. It has been hard to see the services for Sen. McCain. Earlier this year I watched the Billy Graham services just a short time after my dx. Hard.",
      "MessageIndex": 5752,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 20, 2018 08:01AM MuddlingThrough wrote: Micmel, how awful. I have no words. I hope they get the brutal monster so no one else will be harmed.  Tanya, beautiful pictures!  ",
      "MessageIndex": 4758,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 21, 2018 02:07PM MuddlingThrough wrote: I just got a call from the nurse that tumor markers are way down again. I like the downward.trend and hope it continues. Starting fourth round of Ibrance tomorrow. ",
      "MessageIndex": 4773,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 21, 2018 05:27PM MuddlingThrough wrote: Have fun at the concert, Lynne!",
      "MessageIndex": 4784,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 1, 2018 01:14PM MuddlingThrough wrote: Grannax, your rooms are so pretty!",
      "MessageIndex": 4897,
      "PostDate": "01/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 3, 2018 06:53PM MuddlingThrough wrote: Lynne (Man.), Thank God, indeed!",
      "MessageIndex": 4938,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 13, 2018 09:12AM MuddlingThrough wrote: Micmel, I've been thinking of you too and was wondering if or how to post to you since I'm a newbie here. I echo 50sgirl's gently expressed posts. You have certainly had so much going on and add this disease and its management to it and anyone would be overwhelmed. You wrote that you are nead and I so want you to feel able to enjoy that status, even knowing you have the challenges of long term se's and some that come and go. Please ask your doctor for help or a referral to others on the team who have experience with patients with long term illness. Someone who's not in the middle of the storm needs to take a look at the whole situation: meds, appetite and food, energy, sleep, and the upheaval in the family which naturally shocked your whole system.",
      "MessageIndex": 5050,
      "PostDate": "13/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 25, 2018 01:32PM MuddlingThrough wrote: illimae, that's great!",
      "MessageIndex": 5216,
      "PostDate": "25/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 3, 2018 09:08AM MuddlingThrough wrote: Micmel, so glad for the report of benign after your surgery. Rest as much as you can and heal. I'm okay today. Had homemade muffins with fresh picked blueberries that DH picked at our neighbor's. They both garden and share what the other one doesn't grow. Nice. To everyone here, have a good Friday. Lots of rain and flooding in my state, but not in my area. I saw water rescues on the news, in the city where my son lives and works. You know Mama sent a text lightning fast! He's fine and it wasn't in his part of town.",
      "MessageIndex": 5365,
      "PostDate": "03/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 2, 2018 09:05AM MuddlingThrough wrote: Micmel thanks for the flowers. Here's a party balloon as you all get ready for a reception party.ðŸŽˆ Quiet weekend here and I hope it stays that way! Tennis to watch today and race to watch tonight! (RafaðŸ’–) I love to watch live sports. Football season is just about here but I haven't watched it much the last few seasons. My teams have not been so good. Wishing everyone a calm weekend to do just what you want to do.",
      "MessageIndex": 5783,
      "PostDate": "02/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 4, 2018 11:57AM MuddlingThrough wrote: Good thoughts to those having scans, treatments, surgery, and insurance problems. I'm okay, not great but okay. Mostly I'm just a little down but I'll bounce out of it I think. Seeing oncologist next week for regular visit. He'll be so happy to see my long list of questions,LOL. Talking to him usually does make me feel better. ",
      "MessageIndex": 5812,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 23, 2018 08:18PM MuddlingThrough wrote: Tanya, thanks for.your good wishes. I pray you'll have much less pain as you recover.",
      "MessageIndex": 5195,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 28, 2018 08:14AM MuddlingThrough wrote: Waving back to you, Micmel. We got our postponed anniversary dinner last night. Quiet weekend ahead, I hope.",
      "MessageIndex": 5269,
      "PostDate": "28/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 8, 2018 02:03PM MuddlingThrough wrote: Micmel, almost a week ago Bigbhome, herself, on another thread (Xeloda??? can't remember) posted that she was having funny symptoms,fluttering in heart area, and other symptoms. I've been hoping she's okay. Bigbhome, if you're reading, let us know how you are .",
      "MessageIndex": 5419,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 8, 2018 07:04PM MuddlingThrough wrote: This whole year I've done very little cooking. I just haven't had the energy for much other than some baking and a few meals. However today I made the best supper! We've had many beautiful green bell peppers coming from the garden so I decided to make a huge skillet of kielbasa, potatoes,peppers,and onions. I took my time and got the meat browned then out of the pan and then the potatoes browned and out. I got rid of most of the oil and then cooked the peppers and onions. Finally everything went back in together to get hot. It was so good and we have leftovers! My DH did cut the ingredients, since neuropathy has left my right hand mostly useless and really dangerous around sharp knives. My tummy is very happy. ",
      "MessageIndex": 5424,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 10, 2018 07:39PM MuddlingThrough wrote: Such a beauty. Such a sad loss.",
      "MessageIndex": 5457,
      "PostDate": "10/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 12, 2018 09:03AM MuddlingThrough wrote: Micmel!!! Great pictures of a great day. Pretty decorations and food. I'd have been sneaking over and snitching a bite, LOL. Loved the pic of you and the family. Relax now and enjoy the satisfaction of a job well done. You've really helped the newlyweds to have a good start for their home.",
      "MessageIndex": 5480,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 18, 2018 10:23AM - edited Sep 18, 2018 10:25AM by MuddlingThrough I know just what you mean. In my right arm and hand, I have a combination of neuropathy, lymphedema, joint pain and trigger fingers from letrozole, and perhaps some degree of carpal tunnel that was there before dx. The LE and neuropathy got very bad after taxol started and I have also noticed severe changes in my bicep especially. It's not exactly atrophy because I have used my arm as normally as possible throughout this...but...the muscle isn't in the same place as it was and it doesn't flex and lengthen as it did and as compared to the left arm. It was almost as if it had been torn, and it felt stringy, and had moved toward the inner part of my arm, yet I could still use it to some degree. Very distressing on top of everything else! Two or three months ago, I started using one- and two-pound hand weights again, trying to increase strength in my arms, chest, and upper back to support my spine which has mets and a compression fracture. These are gentle exercises but at first my 'bad' arm was just really awkward, although it would bend and lift in some fashion. Over the weeks it has gotten a little better and the muscle seems to be more in line with where it should be so I'm hopeful it will keep improving. It has been very weird and uncomfortable. ",
      "MessageIndex": 7,
      "PostDate": "18/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867242",
      "Title": "Not Neuropathy, Loss of Muscle? Gingermiss65 Gingermiss65"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 20, 2018 07:17AM MuddlingThrough wrote: Sharmal, I'm sorry your mom is feeling so bad. I hope the onc will have an effective plan for treatment.",
      "MessageIndex": 9146,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 10, 2018 04:10PM MuddlingThrough wrote: CL, great to read your good news! ",
      "MessageIndex": 9246,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 14, 2018 04:27PM MuddlingThrough wrote: Raven, I'm sorry you feel panic. I'm not familiar with your new meds but if you've only had one dose or cycle of them it may not have been enough time to see results. ??? What does your MO say? I'm sure you already do this, but I'd stay away from crowds and anyone who is sick with anything. I'm not a doctor at all, so disregard anything that disagrees with your doctor's advice. Your team is keeping a close eye on you! Hoping your numbers settle down soon. ",
      "MessageIndex": 9444,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 17, 2018 02:34PM MuddlingThrough wrote: Hi Raven, I take Ibrance and letrozole, both are pills. I get an injection of Xgeva once a month for my bones. That's all I take at this time. I have \"innumerable\" bone mets and a compression fracture to T11. I think it is somewhat better; it doesn't hurt as much. Yes I have liver mets ( I think I have four ) ,and I had some kind of lung involvement that seems much better now. I never got a very good explanation about the lung part of it and I'm deliberately not focusing on that other than reading the scan reports every three months or so. My breathing trouble is what led to my dx but it is SO much better now. Knock wood ðŸ˜‰ I'm sending you best wishes that they will soon get your liver straightened out and back on track! ",
      "MessageIndex": 9478,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 24, 2018 07:53PM MuddlingThrough wrote: So sad. Thank you for posting LindaLou. ",
      "MessageIndex": 5649,
      "PostDate": "24/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 31, 2018 08:34AM MuddlingThrough wrote: Daniel, I hope today goes perfectly, with the best results for your wife. Micmel, have an easy appointment today! Pretty bedding! Grannax, thinking of you at your appointment today. illimae, that's a cute dress. Pics of the makeup and wig combos, please. Hello to everyone! I hope the holiday weekend will be calm and safe. We have no plans, which is good. I'm going to be watching tennis all day, every day, like I do all season. ðŸŽ¾ I'm sorry to miss the night matches, but at seven or eight in the evening, I deflate as if a switch is turned off.",
      "MessageIndex": 5743,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 20, 2018 09:53AM MuddlingThrough wrote: Tristaan, thank you for writing to us. My prayers are for calm and comfort for her and all of your family.",
      "MessageIndex": 9755,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 20, 2018 06:04PM MuddlingThrough wrote: Tristaan, so heartbroken for you. God bless your family.",
      "MessageIndex": 9771,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 22, 2018 03:27PM MuddlingThrough wrote: KPW3, I hope you can stay on the trial. Glad for your kidney improvement. Sounds like you and your doctors are watching all the angles.",
      "MessageIndex": 9795,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 4, 2018 04:12PM MuddlingThrough wrote: Thanks Micmel. I got two emails from my DS today so that perked me right up. Normally he's a texter but I don't have a phone with text unless I want to use DH's phone which I don't. Son doesn't like to email, I guess it's too old fashioned, LOL.",
      "MessageIndex": 5820,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Oct 5, 2018 09:57AM MuddlingThrough wrote: leftfootforward, have you had taxol before? I had 12 weeks as first treatment. You probably know but there's a Weekly Taxol thread that I still follow.",
      "MessageIndex": 9882,
      "PostDate": "05/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Oct 28, 2018 03:30PM - edited Oct 28, 2018 06:22PM by MuddlingThrough zarovka, so very glad that you posted. Thank you for sharing your fasting and oxygen regimen. I'm in awe of your ability to fast, but when you say you feel amazing I'm so glad. Hoping your liver is more comfortable than when you had to lie over a bolster for some relief. I need to do better at fasting but at least I'm fasting at least 12 hours a day and often a little longer. The oxygen angle is intriguing. I still have my oxygen machine and some tanks. What do I do with them? Hmmmm. I'm looking forward to the tome you're going to post! Also sending all the best for you and for your focus on your family.",
      "MessageIndex": 10037,
      "PostDate": "28/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Nov 21, 2018 12:15PM MuddlingThrough wrote: Raven, that sounds like a good report! Hopefully those numbers will get back in line soon.",
      "MessageIndex": 10208,
      "PostDate": "21/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 2, 2018 11:05AM MuddlingThrough wrote: Thanks, Tricia. I subscribed and also read an article in this month's newsletter called \"Putting The Brakes on Metastasis\" or something close to that title. Good stuff and hopefully going to human trials in the next few years. I want them to be pushing at this from every possible angle : -)",
      "MessageIndex": 2620,
      "PostDate": "02/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 18, 2018 12:14PM MuddlingThrough wrote: Gracie, I'm still kind of new here and not yet finding the rhythm of posting, replying, etc. Please know that I read all posts and send up prayers for you and for all who report new bc trouble when I read the post. I value your posts here and on other topics.",
      "MessageIndex": 4726,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jun 30, 2018 08:25PM MuddlingThrough wrote: 50's, beautiful family!",
      "MessageIndex": 4880,
      "PostDate": "30/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 14, 2018 01:45PM MuddlingThrough wrote: Waving back to you, Micmel. It's too hot outside for me so I'm staying in and watching a lot of sports today. I like watching live sports because it's real. I don't like tv \"shows\" very much. Can't stand dramas and so-called comedies and I hate \"reality\" shows. I rarely watch movies but if I do, they are sci fi or comic book heroes because I like to escape from my all-to-real reality. I usually watch certain cooking, craft, sewing, travel (like Rick Steves) shows and sports. Tennis is my fave so I've been very keen on Wimbledon these last two weeks. Of course soccer and tour de France are going and there's usually a baseball game! I love watching the skill and grit from the pros! I have quite a bit of pain so these help distract me and I read A LOT too. I hope you are having a better day!",
      "MessageIndex": 5071,
      "PostDate": "14/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 23, 2018 11:42AM MuddlingThrough wrote: Today my husband and I celebrate our 35th anniversary! He's a great guy. I'm just so sad that he has to deal with all my stage iv b.s. He doesn't complain and helps in every way but I'm so damn angry that I can't pull my own weight any more. I'm trying to think on the positives for today though. I'm better than I was even if I'm light years away from where I should be. He's going to our Mexican restaurant to take out our favorites for supper and we'll share a bottle of wine, or maybe two, LOL.",
      "MessageIndex": 5186,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 23, 2018 12:56PM MuddlingThrough wrote: illimae, I will be thinking of you tomorrow and Wed. Only good vibes coming your way. MJHJAN1014, beautiful photo!",
      "MessageIndex": 5189,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 26, 2018 06:06PM MuddlingThrough wrote: Dear runor, no one else can hurt us like our child can. No one. Please see a counselor. Find one that specializes in family crises. You are right to protect yourself from an abusive grown woman. You matter! I wish I could help. I will pray for your heartbreak because that is exactly what is happening to you. Talk to your doctor too, please.ðŸ™",
      "MessageIndex": 5244,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 31, 2018 06:45PM MuddlingThrough wrote: Thanks Lynne, Tanya, and Minnie. It will be what it will be but I want it to pass me by. Micmel! You shouldn't have done that. I probably would have also. And paid dearly for it later. Rest!",
      "MessageIndex": 5331,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 8, 2018 02:37PM MuddlingThrough wrote: Micmel, I know! I worry about all of us but with everything she's had going on, I think it stood out to me. I didn't mean to worry you though; you've got a lot happening now yourself.",
      "MessageIndex": 5422,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 22, 2018 12:01PM MuddlingThrough wrote: I'm feeling fairly well today. I take my I & L in the morning, so I try to do anything I need to do early in the day before my energy runs out. I walked for 35 minutes and did my arm exercises with my one pound weights. I feel like a baby with those tiny weights but with a compression fracture I think it's better to be safe than sorry. The exercises are gentle for the same reason but I want to strengthen the upper body muscles. In the winter I was barely able to walk 20 steps to the bathroom and 20 steps back even though I was on oxygen 24/7. Today I got 2,500 steps without resting and not on oxygen. I am going to get back to 10,000 steps a day but it might take a while! I'm resting now and probably won't get much else done today, just a little chore here and there.",
      "MessageIndex": 5610,
      "PostDate": "22/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 24, 2018 06:21PM MuddlingThrough wrote: I know this isn't the taxol thread but I do have a question about hair. I lost all mine from taxol. My last chemo was five months ago and I do have a little hair trying to grow BUT it seems like it got to a short length...and stopped. Very short...like Sgt. Carter on Gomer Pyle. Is this it? I had long hair before but now I'd be thrilled with a pixie 'do. Will it ever grow more?",
      "MessageIndex": 5643,
      "PostDate": "24/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 26, 2018 03:23PM MuddlingThrough wrote: Gracie, for years I have taken blackberries for diarrhea. Knock wood, I haven't had D from chemo or meds, but it works well for other situations. Eat a few fresh or frozen blackberries, no sugar or sweeteners, a few times a day. Also, I sometimes get a jar of \"all fruit\" blackberries in the jelly and jam aisle. Again, no sugar or sweeteners. I'd eat a teaspoon or two at a time a few times a day.",
      "MessageIndex": 5674,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 27, 2018 08:01PM MuddlingThrough wrote: Gracie, great drop on tumor markers! And,yay on lower dose. Hope that is more tolerable!",
      "MessageIndex": 5707,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 31, 2018 07:42PM MuddlingThrough wrote: Looking out my window at DH trying so hard to get his grandpa's tractor to start. Our 14 year old dog is nearby, his formerly brown face now all white is \"helping\". It is just too sweet. DH has loved that tractor, from the 50's so much and enjoyed plowing and bush-hogging the fields with it and spending waaaaay too much money to keep it going, but I.Get. It.",
      "MessageIndex": 5757,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 19, 2018 08:50AM MuddlingThrough wrote: Just finished my first four 4 rounds of Ibrance & L and had scans Mon. Saw onc yesterday and bone news was mostly good, some \"significant\" improvement and some unchanged with a possible (not certain) compression fracture in a previously involved vertebra that we will watch. All liver lesions had shrunk since April and are now a lot smaller than at dx. I have a ways to go yet but I'm glad of improvement and good liver numbers on bloodwork. My lung issues are also much improved according to the scans also. Mostly good news and the onc says he's not changing a thing. Isn't it an odd life that when my doc said I might have a broken vertebra I said \"Okay but what about my liver?\", LOL. In my old life I'd have been shocked and dismayed about a fracture but now it's barely on my radar. As the song says, \" I felt a little fear upon my back but I said 'Don't look back just keep on walking.' \"",
      "MessageIndex": 5127,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 23, 2018 06:18PM MuddlingThrough wrote: Dear 50'sgirl, thank you for your kind words. If roles were reversed I'd do everything I could do for him. I've always been verrrrrrrrry independent and it's hard to admit the need and accept the help for the simplest things. I *wouldn't* from anyone else. Thanks to all for your anniversary wishes! We had a change in plans and will get the Mexican food later in the week which just means I still look forward to it! We're having other goodies and gifts. And some wine all the same. He got champagne. Yes, he's a keeper. ",
      "MessageIndex": 5193,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 29, 2018 09:59AM MuddlingThrough wrote: Micmel, keeping you in my thoughts for your procedure tomorrow. Post an update when you can.",
      "MessageIndex": 5279,
      "PostDate": "29/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 29, 2018 06:08PM MuddlingThrough wrote: 50's, I'll miss your posts but understand a break. Please come back when you're ready.",
      "MessageIndex": 5288,
      "PostDate": "29/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 30, 2018 02:18PM MuddlingThrough wrote: keetmom, Allie did a great job. Love the pictures. I've refused any pictures during my MBC ordeal. Your photos are making me think about that!",
      "MessageIndex": 5306,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 30, 2018 07:51PM MuddlingThrough wrote: I'm doing fair today Michel and glad you're home. I'm a green-eyed lady* too. Very green like yours, illimae. Maybe I need a cat hat. :)  *Song from Sugarloaf, one of my fav songs.",
      "MessageIndex": 5317,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 1, 2018 08:05PM MuddlingThrough wrote: Lynne, your last sentence made think of the Huey Lewis song. \"I want a new drug, one that does what it should, one that don't make me feel too bad, one that don't make me feel too good.\" Although we would take feeling too good, right? ?? Seriously, I hope they come up with a great combo that will be very tolerable and effective for you.",
      "MessageIndex": 5339,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 8, 2018 08:24AM MuddlingThrough wrote: Daywalker, such good news. I know you're relieved and I'm also impressed at the extent your radiologist went to, to deeply study the images and to explain and reassure you. That is a blessing in itself!",
      "MessageIndex": 5409,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 8, 2018 01:05PM MuddlingThrough wrote: Has anyone heard from Bigbhome?",
      "MessageIndex": 5415,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 11, 2018 08:57AM MuddlingThrough wrote: Micmel, thinking of you today and this special day! Make this a fun and happy day to remember. The hard work is done so now enjoy! If you want to, share some photos. I want to see the food table and your pretty decorations ;-)",
      "MessageIndex": 5460,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 13, 2018 08:31AM MuddlingThrough wrote: DivineMrsM, I like the arch and stairway ideas. I particularly like the spiral stair.",
      "MessageIndex": 5491,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 14, 2018 08:00PM MuddlingThrough wrote: Lynnwood, how great that your onc called tonight so you wouldn't worry. Sleep well!",
      "MessageIndex": 5523,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 16, 2018 12:03PM MuddlingThrough wrote: I had my routine blood work yesterday and all is well to keep on with the I/L. Also had Xgeva. I have a question about B-12 and folate. I get some in my multi vitamin and in the B complex tablet but I wonder if any of your doctors have given you recommendations about how much to take.",
      "MessageIndex": 5546,
      "PostDate": "16/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 16, 2018 02:44PM MuddlingThrough wrote: Micmel, your blood work is going to be superb on Monday! Of course we'll all be with you. KatyK, during the bone scan it is so hard to lie still for so long with that box just millimeters from your face to start with. I always plot a story the day before and spend the scan time 'inside my head' and mentally develop the characters and write the story. Even if I never put any of it down on paper, it's a pleasant way to pass half an hour. I shamelessly use a character from books I've read and see if I can weave a tale that would be believable. I like old fashioned mysteries, usually set in small villages, and it's entertaining to build and populate my own! It helps pass the time and is usually calming.",
      "MessageIndex": 5550,
      "PostDate": "16/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 21, 2018 05:19PM MuddlingThrough wrote: Minnie, yay for good bloodwork! Bigbhome, so glad your husband's surgeries are behind you. Hoping for a long time of calm, peaceful healing! Micmel, I'll bet your doggie is staying at your side! Decades ago we had a big dog hit by a car and I took care of her, carrying her in a sling out to potty and feeding her from my hand when she didn't eat any other way. When she recovered she rarely left my side and was super protective of me. ",
      "MessageIndex": 5605,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 27, 2018 02:07PM MuddlingThrough wrote: Micmel, you are so right about the port hijinks. Flap your arms up and down like wings, look up, now look down, deeeep breath, cough-cough, hold your breath, look left, look right, turn back just a little bit...don t move! Yes, those nurses are angels and I tell them so.",
      "MessageIndex": 5694,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 17, 2018 05:23PM MuddlingThrough wrote: She posted on another thread today. I think it was the Abraxane thread. Sounded good.",
      "MessageIndex": 9276,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jul 19, 2018 08:34AM MuddlingThrough wrote: Thank you hartrish, JFL, and Liwi. ",
      "MessageIndex": 9283,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 6, 2018 12:36PM - edited Aug 6, 2018 12:37PM by MuddlingThrough Raven, this is the link to the thread on which people discuss their local liver treatments. https://community.breastcancer.org/forum/8/topics/832767?page=19#post_5246050",
      "MessageIndex": 9403,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 17, 2018 11:52AM MuddlingThrough wrote: Hi Raven, I haven't had that but I hope it works well! Someone who has had it will be along to answer your question. Keep us posted how you're doing.",
      "MessageIndex": 9468,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 30, 2018 11:26AM MuddlingThrough wrote: Tricia, happy anniversary and it's great to read your low TM numbers!",
      "MessageIndex": 9577,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Oct 12, 2018 04:46PM MuddlingThrough wrote: lulubee, I've wondered that same thing. I explained it to myself that if she hasn't shown MBC in all this time while not having any other treatment, then...???? I have read a couple of articles about her but not extensively so I could be wrong about her not having any further ongoing treatment.",
      "MessageIndex": 9953,
      "PostDate": "12/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Jan 4, 2019 08:35AM MuddlingThrough wrote: Miaomix, that is an interesting article. My better nature agrees with the doctors who don't want their colleagues on boards and sometimes getting hundreds of thousands of dollars. The little gibbering part of me, deep inside is constantly whimpering 'I'm dying of cancer. I'm DYING of cancer! Do something. Do ANYTHING! Now now now now now...' Still, the old conflict is that maybe these experts can steer the resources in the right direction, but when might that moment come when the dollar signs cause them to divert away from a future cure to something less promising, perhaps when they don't even realize it? On the other hand this set up may have led to Ibrance, etc, but it also may have squashed something better. I hate to think a cure might not get the attention or that they might not fine tune existing treatments for better results and QOL because...where's the money in that? It's complicated. Katty, very interesting trial. I hope it continues to be so tolerable and that it will be extremely effective. I look forward to reading your posts about it. ",
      "MessageIndex": 10461,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 7, 2018 02:29PM MuddlingThrough wrote: Thank you for your post, Therese. Congratulations!",
      "MessageIndex": 14,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866431",
      "Title": "Ten years-whooopeeee! Celebrate_Life dorimak"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 16, 2018 06:01PM MuddlingThrough wrote: LovefromPhilly, gorgeous! Glad you had a nice date.",
      "MessageIndex": 18,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867178",
      "Title": "Vent about long term treatment Larkin Crazeejane"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Sep 1, 2018 02:44PM MuddlingThrough wrote: PrincessPincushion, sorry for your recent news. I completely understand why you are angry. I had thoracentesis 4 times to drain pleural effusions in Jan. I won't say they were fun but they were not bad. You'll sit up, leaning slightly forward on a table with a pillow. They numb the area and I felt a little pinchy sensation while they got started. When the draining was finished I felt a little sore for an hour or two but didn't need a tylenol. I just had a band aid. It was nice to be able to breathe better. All the best for you on what comes next. ",
      "MessageIndex": 88,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Oct 17, 2018 03:10PM MuddlingThrough wrote: Done. Thank you for posting the link.",
      "MessageIndex": 7,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867771",
      "Title": "New Online MBC Registry for Patients and Researchers! Bestbird MuddlingThrough"
    },
    {
      "AuthorID": "MuddlingThr…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269533/profile",
      "Content": "Aug 1, 2018 08:12PM MuddlingThrough wrote: Thanks, Sago. Hoping for lots more success for your mom!",
      "MessageIndex": 2,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866336",
      "Title": "5 years! Sago RonnieKay"
    }
  ]
}