{
  "AuthorID": "Mummalua",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245905/profile",
  "Posts": [
    {
      "AuthorID": "Mummalua",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245905/profile",
      "Content": "Mummalua wrote: I had an pretty big indenting develop in my left breast so I went and seen my breast surgeon that did my subareolar duct excision (pathology from this showed precancerous cells) in 2014. She felt around and noticed a lump!!! She sent me for a diagnostic mammo/us and when I went for it they only did the u/s cause they said the mammo would be pointless after the u/s was done. The radiologist said he found several calcifications in my imaging and that I should wait and follow up in 6 months. My question is should I wait 6 months or push to get something done now? or do I even to need worry ? My mom had breast cancer as well as all my dads aunts and his sister died from breast cancer after a 10 year battle. I test negative for BRCA as well as them but we do have the KRAS variant. The radiology report says 6 o'clock position a 3 x 3 x 4 mm hypoechoic focus is seen 4 o'clock position palpable lump measures 3 x 2 mm 3 o'clock position behind the nipple a 4 x 7 mm Isoechoic nodule Indeterminate retroareolar foci from 3 to 6 position Thanks in advance for any advice I just don't want to worry like crazy over nothing. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852094",
      "Title": "Do I need to worry?... Mummalua Mummalua"
    },
    {
      "AuthorID": "Mummalua",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245905/profile",
      "Content": "Jan 24, 2017 06:14PM Mummalua wrote: Forgot to mention that I had a total hysterectomy in 2010 and was on hormone replacement for awhile till I stopped cause it made me feel funny.",
      "MessageIndex": 2,
      "PostDate": "24/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852094",
      "Title": "Do I need to worry?... Mummalua Mummalua"
    },
    {
      "AuthorID": "Mummalua",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245905/profile",
      "Content": "Jan 24, 2017 07:02PM Mummalua wrote: yes it Says BI-RADS 3 six month follow up The rest says Remainder ofthe breast survey is unremarkable. There is no auxiliary lymphadenopathy Recommend six-month follow-up of left breast ultrasound to document stability. Mammogram is deferred today and is considered likely to be noncontributory. Findings and recommendations were reviewed with the patient in the exam room following the study.",
      "MessageIndex": 4,
      "PostDate": "24/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852094",
      "Title": "Do I need to worry?... Mummalua Mummalua"
    }
  ]
}