{
  "AuthorID": "Mumtothree",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
  "Posts": [
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 1, 2012 04:33PM Mumtothree wrote: Marilyn, you're amazing! I can't believe you're well enough to post this soon, and it gives me great hope for next week. Good luck to anyone having surgery today. ",
      "MessageIndex": 280,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 3, 2012 02:37AM Mumtothree wrote: Hi Everyone, it's great to hear about people getting excited now. I have been pretty positive and energetic about all of this until today. I have just said goodbye to my mother, as she has had a 6 week trip to UK planned for about 8 months, and I really didn't want her to either cancel it, or to worry endlessly while she's away. She has two very elderly sisters over there and this is probably the last time she'll see them, and for other reasons, I didn't want her to have to change her plans. But I feel a bit empty and alone now too! I had my visit to the anaesthetist today. I didn't care much for him - he was obviously really rushing and not listening very well. Oh well, I guess at least I will be asleep most of the time that he's involved! To all the August gals who've already had their surgery, I hope you're recovering really well. And to all of us getting closer, I'm very glad I've found the site and somewhere to vent a bit to, thanks! ",
      "MessageIndex": 312,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 4, 2012 10:02PM Mumtothree wrote: Hi Everyone, Great to hear that everyone who's had their surgery is doing well - long may it continue! Blessings20 thank you so much for your tips, and advice re photos etc - all much appreciated. ChristyRN, we seem to be in a similar sort of situation - I got my diagnosis a week ago tomorrow, and surgery is on Wednesday. I've had a much better couple of days - read a book called Anticancer which is fabulously encouraging and empowering, about all the foods known to have anticancer effects etc, and other ways to help our bodies get through all the treatment (it's absolutely not a book that tells you not to follow your doctor's advice btw!).  Anyway, all the best again and great to hear from people so soon after their surgery - very inspiring! ",
      "MessageIndex": 353,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 5, 2012 07:15PM Mumtothree wrote: Hi everyone,  Justegan, how about sporting/activewear type tops? There are lots of cool zip up tops around that might make you feel brighter, maybe? And if you get the baggy type then there should be lots of room to pin drains etc inside I'm thinking.  Shabby, re anxiety, for me I am just trying to a) keep really busy organizing everything for the kids and b) focussing on the fact that the op will be removing the cancer and most of the risk of further breast cancer, and that can't come soon enough for me! ",
      "MessageIndex": 379,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 20, 2012 03:38AM Mumtothree wrote: Blessings, I'm so glad to hear that someone else looked heavily pregnant post surgery (although without the mammary contribution!). What with constipation, and a great blob of fluid that obviously hasn't yet found a way to drain, that's exactly how I feel!",
      "MessageIndex": 862,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Sep 5, 2012 05:52AM Mumtothree wrote: Hello Everyone, Sorry I haven't posted or been on here in a while, I think it has all caught up with me. Nearly 12 months off work with newly diagnosed rheumatoid arthritis, total alopecia from autoimmune disease, and three children who I am solely responsible for, without much social support, have taken their toll. I'm sorry I haven't had the time or energy to read the posts made since I was last on here. I have had FEC chemo recommended, and wonder where to go on this site now, or do we just stay on this thread? I have been really down and fed up as I'm sure most people have. I've had 60ml fluid drained from each side last week (surgery was 8/8) and some has reaccumulated so I am sore again. I am constipated ++++ from the pain meds despite stool softeners and eating almost nothing but vegetables and drinking loads. I am so glad I didn't opt for recon now, as I just can't imagine the pain you ladies are in - my thoughts are so with you. Sorry to rant but I don't have much support here, and I have really gotten down the last week or so. Anyone else headed for chemo? I am due to start in about 3 weeks. ",
      "MessageIndex": 1291,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Sep 13, 2012 02:58AM Mumtothree wrote: Wintersocks, regarding the seroma/fluid collections, it seems it is very very common, but most surgeons don't feel the need to drain unless the collection is very large, or it is causing you a lot of discomfort or pain. Hope that helps!",
      "MessageIndex": 1387,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 7, 2012 03:37AM Mumtothree wrote: Hi Everyone, I echo the same thoughts and best wishes to the front line, and to those waiting. I thought I'd share this with you all - the admissions nurse rang me this morning - it's standard for the hospital, although I really don't think it was that useful as she just read everything I'd written on the form I'd sent in... however, she asked amongst other things if I had trouble sleeping. I said that it was a bit difficult at the moment, and she said \"Oh, why's that?\"  I've not quite picked my jaw up from the ground yet! ",
      "MessageIndex": 445,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Oct 10, 2012 10:34PM Mumtothree wrote: Nbnotes, I was awake in the night and thinking of you (and everyone else, of course!) and this thought came to me. If you had no signs or symptoms of liver mets and they were found serendipitously on a sort of 'optional'  scan, then I wonder how many more people who are told they have stage 1 and are treated successfully, might have also had 'hidden' liver mets...? Just a thought, but I hope it helps. Hang in there, Ali ",
      "MessageIndex": 1548,
      "PostDate": "10/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 18, 2012 04:35AM Mumtothree wrote: Thanks Blessings - slumping furthere here. I may not be up to posting much for a while. Hugs to everyone. ",
      "MessageIndex": 795,
      "PostDate": "18/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 7, 2012 03:04PM Mumtothree wrote: Hi Everyone, Well, the big day is here! (Australia's about half a day ahead of US time, so I get in early). My friend is coming in just over an hour to collect me, and I am frequently reminding myself that I WANT this procedure done asap, and to keep positive. Good luck to Stacey, Justegan, Gmafoley and Leama, and to Beckers, TrailGirl, Mlo69 and Christina, as I probably won't be able to get online for a couple of days. Christy I hope things went well, and to those waiting and recovering, my thoughts are with you. Back soon! ",
      "MessageIndex": 458,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Jan 8, 2013 05:12AM Mumtothree wrote: Hi Everyone, Happy New Year to us all. Sorry to hear of the pain and loss some of us have suffered, and hugs to all. Happy to hear how many people are nearing the end of their chemo or have gone through their next surgery. I will be having my 6th and last (HOORAY!!) chemo on Jan. 18th. It has been a revolting process and I am so glad the end is in sight. I feel like vomiting every time I think about chemo, and despite good advice from people on here, it has been really difficult to alter my thought process to see it in a more positive light. Don't get me wrong, I am happy to be having it for the good it's doing, but the best I can do is to try not to think about it until I have to. It doesn't help that Australia has had the hottest 6 days nationally on record! 40 degrees C plus and humid many days, which is unbearable, especially with a wig or hat on. We have air con in the house, thank goodness, but I hate having to have all the blinds down etc to keep the cool air in - the dark makes me depressed. anyway, less of my woes, big hugs and positive vibes to everyone, Ali xx",
      "MessageIndex": 2069,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 17, 2012 04:36AM Mumtothree wrote: PS Ironically, although I should feel more positive today after the results etc, I feel the lowest that I have since the surgery. Is there such a thing as day 9 blues?",
      "MessageIndex": 761,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 15, 2012 04:07AM Mumtothree wrote: Hi Everyone, I am now one week post bmx and left snb, and can't believe how many posts I've missed. I've tried to read through the last few pages, but sorry if I have missed something. Blessings20, I think you have a week to go until surgery? You have been a big source of comfort to me and I'm sure many many others on here, and I hope you are getting all the comfort and reassurance you need too. I don't know how bad exchange surgery is likely to make you feel, but I hope that it goes superbly well and that you are the proud owner of beautiful new cancer free breasts very soon! Damiana - I'm sorry about your chemo room experience - it is something I am dreading too. I agree with Markat that comfort trumps all - I have spent the last 7 years wearing a wig and false eyebrows, eyelashes etc due to a hairloss condition, and in a circumstance like chemo, you don't want to be worrying about how you look to others. Go for comfort every time. 301724 - I was saying the same sort of thing to my visiting nurse today. My mother had breast cancer 17 years ago, had a lumpectomy and has had no issues since (her sister however, 5 years younger, diagnosed mid 50's 2 years earlier, died 3 years ago from metastatic disease). Medicine today is vastly different from that 17 years ago, and I am so glad, like you, that we have access to current diagnostic methods and treatments. I was also thinking of y 13 yo daughter, and whether or not she should be offered gene testing - but hey, in 10-20 years time there might be another much better test! Shabby - I see you've had your surgery and am thrilled to know it's gone well. Hang on in there and keep on posting! Tazzy - Tiredness...??? Our diseases must have read the same book. I came home 2 days after surgery and told the kids - \"watch out, I'll fall asleep without warning.\" And it's continued, although getting a bit less now a week later. I can be happily doing something and then BAM - fall asleep without any preliminaries. I guess this too will pass. Re drains, I still have 2 in, and both are happily draining about 50ml per day. They are an absolute nuisance, and remind me of those awful rigid dog collars my pups had to wear after their sterilization surgery. I reckon the collars must have been worse than the drains though. I have managed to drive to the shops (OK'd by my bs btw), but was looked at as if I was a shoplifter with the 2 x 500ml drain bottles tucked under my son's hoodie (the only garment that would cover them). Cassie - welcome to this site and glad all went well with your surgery. I too will get my results a week from surgery, and it's the one thought I try to stop from entering my mind.... was the node clear etc. Gma Foley - I'm so sorry to hear you are feeling despondent. I wish I could give you a big hug, but from Oz I would need really really long arms, and no drains (I can feel them rolling around when I reach a bit too far!). After all you've been through, it would probably be abnormal not to be a bit down, and I hope that all around you are giving you heaps of loving! Littleredoregon - from my reading of the science, having implants does not seem to negatively impact on detecting recurrences, but as others have said, in your situation I would definitely be seeing an oncologist. Summer60 - hang in there, girl. It's OK to feel scared, and I think nearly all of us would admit to having felt that at least some of the time. You have a daughter? Great, concentrate on her, and your beautiful grandchild, and how much you must be around to be with them. I'm sure there must be support groups you can access (apart from this wonderful site!) - maybe check with your doctor or the hospital? I don't want to downplay BMX and SNB, but I do want to tell people that I really have felt pretty good since the op 1 week ago (people should hear the positives too, shouldn't they?). I stayed in hospital 2 nights, but I was getting up to go to the toilet on my own within 12 hours of the op, and could have gone home the next day in reality. I could move my arms nearly fully in all directions straight afterwards, and apart from the pain of one particular drain, which resolved within 12 hours, I really have had only discomfort since the op. The drains, as everyone will tell, are a real nuisance! Mine are draining into 2x500ml  bottles, which means they are bulky to take out anywhere. The tubing is also long, as I think someone else has mentioned, and if not tucked into a bag, catches on doorknobs, chair arms etc all the time. I also forget about them, and stand up, set off to the bathroom etc, only to be cruelly reminded that these things are attached to me!  My surgeon said I could drive locally any time after I was discharged (2 nights in hospital), and I drove yesterday. It was fine. I didn't need cushions for the seat belt, as the site isn't that tender. I have vacuumed the house, carried light loads, walked the dogs, cooked, done washing etc all without any problems. I do find it hard to lift dishes out of the oven though, and to hang towels on the high rack. Please know I am not in any way trying to boast, just trying to portray the good side of this surgery! I am amazed however, that I can sleep. I have mostly been someone who moves around a lot during the night, and although alone in a double bed, usually my book, spectacles etc have been knocked off by morning. Now, as I have to plump up lots of pillows at my back and sides, it seems I don't move at all during the night - everything is in place in the morning, including me! Everyone askes me how my kids are doing. I say that I have to wave the drains in front of them to remind them why I can't do certain things for them - but that I'd rather it was this way than that they were tiptoeing around me worried I was going to die. They know I have had cancer, but they know their granny had it 17 years ago, and that she is fine.  Sorry if I've rambled on - best wishes to all those with upcoming surgery, and for speedy recoveries to those who've already had it. I think I am likely to be up for oophorectomy next, so if anyone else is on that path, I'd be happy to hear your story.  xx ",
      "MessageIndex": 705,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 19, 2012 04:47AM - edited Aug 19, 2012 04:48AM by Mumtothree GmaFoley, Christina, Howhm, Trinity and Justine, and all the others who have thought of me, thank you so much. I vowed when my breast cancer was diagnosed that I would truly try and listen to my poor body, instead of endlessly warring with it as I have done since adolescence (brutal dieting, exercise, very long work hours, huge stress etc etc). And yesterday my poor old body (remember I also have a hip replacement, rheumatoid arthritis and autoimmune total hairloss at age 46) was telling me \"These drains need to come out!\" I think that was why I was feeling so very bad. Anyway, today, my drains were removed!! Hooray!! Whilst I'm still not anywhere near my pre-op state, I feel oh so much better, and I think it is probably not down only to having the drains out, but to all your good wishes, as well. Drains are essential, and there's no point getting them out early, but after 11 days, my body had had enough of them.  Best wishes to all of you, and thank you so much for your thoughts and good wishes. ",
      "MessageIndex": 827,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Oct 9, 2012 07:01PM Mumtothree wrote: Just popping in to say hi to everyone and wish you all well. I had my first round of chemo last week - very tolerable, with tiredness, mild nausea for the first couple of days, and wound swelling and discomfort being the only real side effects to speak of. Tazzy, glad the radio is going well. Justegan, you look and sound terrific! Keep it up. Blessings, what sort of a diet are you on? I am sad to see my weight increasing even more, but I am trying hard to eat healthily and figure it's not the time to stress my body further with a strict diet. Keen to know what others are doing in this area. Best wishes to all, Ali. ",
      "MessageIndex": 1533,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Jul 31, 2012 07:14PM Mumtothree wrote: Hi Everyone, I hope you don't mind me joining you. I got my diagnosis on Monday and am booked for bmx and left snb on August 8th. It's all happened pretty fast and I found this blog a few days ago. It's been a big help. I don't have receptor status yet, but the bs recommended my Mirena come out, so I'm off to get that done today. Good luck to everyone. ",
      "MessageIndex": 258,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 3, 2012 07:21AM Mumtothree wrote: Guys, I'm possibly going a little insane here now that my major support in my life (my mum) has left for 6 weeks, but I have just taken images on my computer of my poor cancerous breast, and indeed of my pair - in their last days. Is it inappropriate to post the pics? My poor cancerous leftie, who has always been the problem girl - babies could never latch on to her etc, is black and blue, but it does also show what a breast might look like after 4 core biopsies a week earlier. Please, I'm new to this site, I don't want to do anything inappropriate. Could someone tell me if I should just assign these pics to my own hall of (previous) achievements or if they sound OK to post?  I'm so sorry if I sound flippant or anything. I'm absolutely not that. I'm just getting really really anxious and unsettled, and I don't even know what's appropriate or not anymore. Absolutely everyone I know (except one long time friend) is telling me I am stupid to not have reconstruction (I'm 46 and still premenopausal), yet most of them don't know that I have had another disfiguring disease, autoimmune hairloss, and have had no scalp, eyebrow or eyelash hair for over 5 years. I think that is a major issue to have to get over, and so, loss of breasts especially when it means massive reduction in the likelihood of recurrence of breast cancer, is not such a huge deal.  Btw, I am trying to help myself along here ( sad face) - as I've already had to deal with loss of all that normal hair, the bmx does really feel like a knife in the heart to have yet another major cosmetic loss. But, I'm telling myself that, I'd already decided it was highly unlikely I'd ever have another intimate relationship (difficult without revealing your permanent hairless state), and if someone is willing to take me on without any body hair, then lack of breasts shouldn't make any difference. Please help me along here.......someone!!  Right now, however, I am just focusing on getting the surgery done, and getting home to my kids. I really don't care how much pain or annoyance with drains whatever, I just want to  be home with them. My eldest turned 18 today, but he's a boy, and he's an Aussie boy, and at least in this house, it means he's not really that responsible regarding the welfare of his younger siblings. Plus he starts his first full time job the day before I go into surgery. I will be so happy if someone replies to me in any form as right now I feel like I am the only person in the whole world in my situation. Statistically I know that 's not true, but hey - Perth is the most isolated capital city in the whole world, and even with the internet, sometimes I know it!! ",
      "MessageIndex": 314,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 10, 2012 03:51AM Mumtothree wrote: Hi Everyone, I'm home again! My surgeon told me to expect to be in 3-5 days, but this morning said I could go home anytime as things were goind so well. My friend who has been looking after the kids told them she was bringing something special for dinner, and it was me! Great to be home. Honestly, I didn't have any issues. I had to wait around from the SN injection at 0830 until 1530 when I was taken into theatre, and woke up in recovery at 1830. Took pain meds intermittently, and other than one drain on the right (non cancer side) that really felt like it was sticking in at right angles, had no pain. Fortunately that settled down after a shower the next day. 2 drains out this morning as they'd drained nothing since the op. The other two had drained about 30 mls and will stay in and a nurse comes to the house daily to check up on them and the dressings. The really amazing thing is that I felt completely free and unencumbered waking up with no breasts! I was quite happy to look at the area and dressings and everything and didn't have any negative feelings at all. Lovely not to have to worry about bras too. I bought a button down shirt after reading all the advice, but I don't need it as I can lift both arms way over my head, scratch my back and everything already. They stuck the drains down lower on my tummy too, so they just emerge from under my t-shirt. Overall I had a nice time in hospital, the food was great, it was restful and I slept well. I hope everyone else has a good experience too. Justegan, so happy to hear about your nodes, and also to hear of all the others coming through OK. Good luck and best wishes to the next wave! PS Happy to answer any specific questions too - oh, and the drains they gave me are suction ones that collect up to 500ml, so I don't have to worry about emptying them etc. They also gave me a shoulder pouch thing to put them in, and some nifty little curved handbag shaped satin cushions that you slip over your shoulders and they keep your upper arms away from your chest. Very helpful! ",
      "MessageIndex": 551,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Nov 22, 2012 04:19AM Mumtothree wrote: Everyone, I'm sorry I haven't had the energy to read through the posts but I do send all my best karmic thoughts to everyone. I am having huge problems with pain along my rib cage on my cancer and sentinel node side - now almost 4 months post surgery (BMX). Is anyone else still having significant pain in the region at this time?",
      "MessageIndex": 1879,
      "PostDate": "22/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Sep 11, 2012 03:40AM Mumtothree wrote: Hi Everyone, I hope you are all travelling as well as can be expected, or better! Thank you to everyone who posted with suggestions and kind thoughts after my last post. I'm still having the occasional teary days, especially when outside things occur (like a council truck parking in my driveway blocking my exit a few days ago!!! They were doing work on the verges and assumed for some reason it would be OK to park on my private property stopping me getting my car out.....). The local breast cancer organization have been great and have sent some cleaners around as well as calling frequently to chat and have even paid a bill or two! Thanks to all those who suggested I contact them. Marianeliza - thank you for your lovely message. Yes, it was a bit of a whirlwind for me - I found the dimple on my breast while on holiday mid July, BMX 8th August and starting chemo before the end of September. I'm sorry you have had to wait so long for your surgery. It must be difficult and worrying and I'm glad you've finally made it. I hope you are now recovering well. I had the alopecia 6 years before the rheumatoid and so far the specialists have not connected the 2, although to me any autoimmune disease seems likely to be linked. As I've had no hair at all for the last 5 years, it's extremely unlikely I will ever regrow any now. At least it's one major loss I have already gone through before starting chemo I suppose. Thanks for suggesting there might be a thread for Ozzies - another lady has messaged me about an Aussie thread, and I will catch up with them soon. I only have my 78yo mother as family - she is overseas for 6 weeks and doesn't yet know about this. My kids are 18, 16 and 13 and have coped apparently well - a few more than usual days off school with minor 'viral type' symptoms since I was diagnosed, but I figure that's OK in the scheme of things. I had no reconstruction as I wanted to be back recovered from the surgery as soon as possible. Listening to the posts on here about pain from recon etc I think anyone having recon is very brave to go through it, and I'm glad I didn't! I suppose though that already having permanent hairloss (including lashes and eyebrows) and not being in a relationship or ever expecting to, breasts are not important to me. Best wishes anyway and I look forward to hearing how you get on! And thanks for being there for me ranting. Gma Foley - Thanks for the tips - I am probably guilty of not eating enough protein as it doesn't really appeal. Berries - yay - I love them, as well as figs and prunes. I have finally resorted to bisacodyl for the constipation and things have started moving at last. I hope you are doing well now and feeling more positive and optimistic about everything. Tazzy - Thanks for your words - and yes, at 5 weeks out, I am still sore, especially near the armpits. I am still taking the equivalent of half to one vicodin at night most nights as I have trouble sleeping without. During the day I sometimes take 1-2 co-codamols too (in case I've got my equivalents wrong, I'm talking 15-30mg codeine at night and 15-20mg during the day). This does help, and usually the days I'm most sore are when I realise at about 4pm that I haven't taken anything. I saw my surgeon again yesterday and he took 70ml of fluid out of the right (non-node) side, which helped a lot. btw fluid draining and drain removal haven't hurt at all! Also btw, I worked at Ealing Hospital for a while in the early '90's - and I read you lived there at some stage too! Beckers - thanks so much for your thoughts,  and I hope you're recovering well. Wintersocks - thanks for your post, I really appreciate it. As you'll read above, the local breast cancer agency have helped out a lot, although I am a bit of a troglodyte and having people coming into the house is quite stressful in itself! Thanks for your hugs too, and all the best with your staging etc. The fact your CT is clear (assumimg chest/abdo/pelvis?) is great though! To anyone I haven't mentioned, it isn't that I haven't read and appreciated your thoughts. To EVERYONE on this thread, best wishes and e-hugs. Overall, 5 weeks out from BMX and L SLNB, I have discomfort far more than pain, and if I take regular paracetamol with indomethacin I can mostly get by except for at night. Drains were a complete pain and the colour of the world changed the day they were removed. Actually having them removed didn't hurt a bit. Having fluid drained also didn't hurt, as I am still mostly numb around the incision sites. I have seen two oncologists, both of whom gave me the same advice. Basically, for a Stage 1 ductal (12mm no node involvement), I am looking at a 2% mortality reduction and 6% recurrence reduction over 10 years by having chemo on top of hormonal therapy ( I am premenopausal at 46yo). They both told me that it was entirely my decision because I fell into a\"borderline benefit\" category where the side effects from chemo might outweigh the potential benefit to me. However, the most likely side effects are hairloss, fatigue, nausea and mouth ulcers, with a very remote chance of anything permanent or life threatening. I watched my mother's younger sister die from metastatic breast cancer, and I don't want to be in a situation in the future where I am asking myself \"why didn't I have the chemo back then?\" Which is why I am going to have it.  Sorry to rattle on - all the best to everyone,  Ali  ",
      "MessageIndex": 1361,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Dec 23, 2012 03:08AM Mumtothree wrote: Hi Everyone, Just dropping in to say Happy Christmas to all. I am just back from 10 days in the country with my kids, mother, dogs and cat - reasonably relaxing is all I can say.......... ! Second last chemo on 28th. I am almost getting aversion symptoms about each session, as most of the week following it is such a nightmare. Hooray to all those who have finished their chemo! Anyway, all the best to everyone, I haven't had time to read all the posts, but will do so over Christmas. Ali xx",
      "MessageIndex": 1981,
      "PostDate": "23/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 17, 2012 02:00AM Mumtothree wrote: I saw my bs today. The sentinel node wasn't involved, and there were no other tumours found, just the original one which was 12mm sitting in a 22mm area of high grade dcis. So overall it's about as positive as it could be in my situation! He thinks no chemo will be necessary, but hormonal rx and maybe oophorectomy - I have to see the oncologist next week. Anyone else NOT been referred for chemo? My thoughts are with everyone - those under the knife today, those recovering and those counting down the days. ",
      "MessageIndex": 760,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Sep 16, 2012 06:06AM Mumtothree wrote: Hi Everyone, I don't have enough energy to read every post and comment tonight, but rest assured I am thinking of all of you and wishing you all the best. From what I've read, there are several comments about alcohol. The first oncologist I saw told me that there was good research to show that women drinking less than 3 units of alcohol per week had a lower rate of recurrence. However, the second oncologist (and my preferred one for many other reasons) told me that there was no convincing evidence and that as soon as one study showed alcohol (in moderation) to be a negative, another showed it to have no effect. He told me that drinking \"sensibly\" was not a problem, and I'm taking his advice, as I love my glass or 2 of red a few nights a week!  On another note, I am now 5 and a half weeks from BMX and SNB, and am still exhausted and still needing some amount of codeine at night for discomfort. Is anyone else still quite uncomfortable this late from surgery?  All the best to everyone. ",
      "MessageIndex": 1416,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Jan 15, 2013 03:50AM - edited Jan 18, 2013 04:33PM by Mumtothree",
      "MessageIndex": 2096,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Oct 10, 2012 06:18AM Mumtothree wrote: nbnotes, I was shattered to hear your news - and am sending all my thoughts and prayers across the globe to you. Why was the PET scan done anyway?  One oncologist wanted to scan me from head to foot and I was reluctant - I figured if I had mets I didn't really want to know, I'd just take the most aggressive treatment anyway. Probably a silly attitude on my behalf, but you must be really shaken.  Stay strong and positive, and keep the success rates in mind! Ali xx",
      "MessageIndex": 1539,
      "PostDate": "10/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Oct 17, 2012 06:29PM Mumtothree wrote: Beckers - try this link for more info on low FODMAP diet, but there are plenty of others.  http://shepherdworks.com.au/disease-information/low-fodmap-diet Ali.",
      "MessageIndex": 1637,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Oct 17, 2012 06:08AM - edited Oct 23, 2012 07:40PM by Mumtothree GmaFoley - you seem to have had so many never ending issues, I really feel for you. I do so hope things improve soon. Granelie - welcome too. I too chose no reconstruction, and am still quite happy with that choice. My scars are a little lumpy and numb still, with a small dog ear on one side. Probably because I am a bit too fat! I am just waiting - a year is the time I have given myself, to see how the scars all settle down, before thinking about dog ear excision etc. Re your chores - hey, use it as an excuse not to have to lift too much, I would! Beckers - I'm so sorry about all your problems and your mother - I hope things are improving. I had a phantom nipple itch the other night - really weird! Blessings - thank you for all the info about your diet, and well done you. What a lot of determination you must have. I have recently been reading about FODMAPS and have cut down bigtime the foods containing them, which were also the foods I had started eating a lot of due to possible anticancer properties. My abdomen now looks about 6 months pregnant rather than 12 months as it did before... As you say, as long as I'm putting healthy food in me at the moment, that's all I need to think about. 30172 - what's the metformin study? Mcelbee - I identify totally with what you say about lack of energy and feeling fat. This week I have managed to get up and go to the supermarket once, and otherwise all I want to and can do, is sleep. I'll get my blood checked on Monday before the next chemo, maybe that will show why I'm so tired...or maybe it's just the treatment. I'm trying to not be too hard on myself - once chemo is finished I'll really try to exercise regularly etc. Waterpolomom - I was interested to read about your views on BRCA testing and your daughters. I have a 13 year old daughter and I wonder what difference it would make if I/we were gene tested - how old are your daughters? I'm hoping that by the time she is an adult there will be advances in the relevant medicine, and I know that she is in a high risk group and will need checks at maximal frequency anyway. Having to think about prophylactic mastectomy as a young teenager is not something I want to put her through, but I'm interested to hear other views. Omeggo - I chose to have chemo, in a similar situation to you, although HER-, but the stats were a 6% reduction in the chance of recurrence within 10 years. I figured that recurrence was the biggest predictor of death from the disease, and given the low rate of serious complications from the chemo, I'd rather run with the 6% decrease. Whatever choice you've made, I hope you feel positive about it, as I think that's an important part. Incidentally, I read the posts about the 'red devil.' I'm having FEC and the epirubicin is bright red too, and makes you pee red for a couple of days. Nbnotes, my thoughts are with you often, and I'm glad to hear you're feeling good. Best wishes to everyone and sorry not to mention all those posting on here, but it's a lovely thread. My next chemo is next Tuesday if bloods are OK on Monday. I don't have much hair anyway due to autoimmune hairloss (wig wearer fulltime) but what I had fell out yesterday. I feel for those of you losing your hair now but at least it's only temporary for you and you will get through it. All the best, Ali.",
      "MessageIndex": 1628,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Mumtothree",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157576/profile",
      "Content": "Aug 1, 2012 02:46AM Mumtothree wrote: Thank you Tazzy. I've been feeling pretty upbeat and positive until this afternoon, and now I'm feeling sick and agitated. I guess that's normal? There's a lot to do to organize everything for the kids etc but I don't feel like doing it right now. I swing from not wanting to think about breast cancer at all, to rushing back to the site to find out answers to more questions.   A big one is does anyone know roughly how long after bmx w/o recon before I can drive? All the best to those having their surgery soon, I'm so glad I found this forum and people going through the same thing. ",
      "MessageIndex": 263,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    }
  ]
}