{
  "AuthorID": "Munchkin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101077/profile",
  "Posts": [
    {
      "AuthorID": "Munchkin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101077/profile",
      "Content": "Nov 30, 2011 07:58PM Munchkin wrote: Friends of Elizabeth (aka Konakat):  My dear friend passed away on 14Jun at her home in Ottawa.  The obituary from the Ottawa Citizen follows:    BLAIR, Elizabeth Ruth Passed away at her home on Tuesday June 14, 2011 at the age of 49 years.  Daughter of Patricia Blair and the late John Blair, sister of David (Hoang), Barbara (Wade), and Mary-Louise (Darrell).  Special friend of John Trullo of Boston.  She will be greately missed by her many friends in Ottawa and Boston.  According to Elizabeth's wishes there will be no viistation or funeral service.  Memorial donations may be made to the Ottawa Humane Society through www.kellyfh.ca You fought so valiently, and encouraged so many with your honesty and humor.  I miss you, Lizzie, and wish you peace and beauty and lots of kitties to love you!  You were, and are, loved greatly by a great many.  ",
      "MessageIndex": 769,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "Munchkin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101077/profile",
      "Content": "Dec 1, 2011 07:03PM Munchkin wrote: Oh, I wished I had known about the memorial...I'd have moved heaven and earth to be there.  I've been thinking of her all day today: mentally revisiting the sites where we went to lunch every day, or had cocktails and cake after work, or my friends who very much wanted to meet her, and the stick drawing she made of herself with 2/3 of a boob on our office whiteboard!  Others at Harvard have been asking about Lizzie since I returned a month ago.  We somehow missed the news, but oh, how we loved her!",
      "MessageIndex": 776,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "Munchkin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101077/profile",
      "Content": "Dec 1, 2011 07:08PM Munchkin wrote: By the way, I think this is an amazing site, and you are all such incredible, strong people.  I know it is you who kept Lizzie alive for so long after her diagnosis; she thrived because of you who are in this, sharing your experiences and knowledge and especially humor.  Please keep encouraging and loving each other!",
      "MessageIndex": 777,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "Munchkin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101077/profile",
      "Content": "Apr 27, 2010 09:40AM Munchkin wrote: Lizzie, I am your long lost best Boston friend (no, NOT the bf!...he's a turkey, imho, for his unwillingness to come see you...but you already know that). I'll be in your neighborhood in May, and will arrange my trip to coincide with your \"good\" days.  But I need your phone number to coordinate with you!  I'm posting this message here, so your cyber friends will apply some pressure for you to give up that number (privately, of course!), since your Boston cell phone has been disconnected.  (Ladies, I joined this site to reconnect with Lizzie...please help me with this crusade!) Yes, I can be evil, too.  :-)  I miss my Canuck friend terribly!  It's time we shared some vino and cake, just like the good ol' days at Harvard, eh? Mary",
      "MessageIndex": 975,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "Munchkin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101077/profile",
      "Content": "Apr 27, 2010 11:20AM Munchkin wrote: Lizzie, do you have any procedures in the coming weeks that will keep you down?  I certainly don't want to interfere with those!  They take priority over all else, imho.  I'll more than likely be in MTL for 3-4 days...trying to get my bf to stay for the weekend, but that's like pulling teeth (he values his time at home...understandably).  We are talking the week of 11May...that's Mothers' Day week...arriving Sun eve, leaving probably Wed/Thur.  As you know, I'll be piggybacking on his business trip, so all my days are totally free.  :-)  What a nice man! Hugs!! Mary",
      "MessageIndex": 977,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    }
  ]
}