{
  "AuthorID": "Murasaki",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112515/profile",
  "Posts": [
    {
      "AuthorID": "Murasaki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112515/profile",
      "Content": "Murasaki wrote: So, I just found out that somebody who's very important to me is getting tested for breast cancer.  When she told me I tried to be very rational about it...I didn't want to make her worry unnessassarily about it.  I asked her to keep me updated about what they found, but she said that she wanted to keep that information private.  I don't understand why she'd tell me about the risk and then not tell me the diagnosis.  I told her that she was one of my best friends in the whole world, but she still said it was a personal matter.  So I just let her know that if she ever changed her mind and wanted to talk to me, I'd be here for her. Now I don't know what to do.  Part of me is worried that she thinks I don't care because of my matter-of-fact reaction to the whole thing...when the truth is that I've been crying with worry for her.  She means so much to me and I want her to know that.  At the same time, I'm afraid that if I let her know how worried I am she'll start to worry too and I don't want to make this any more stressful for her.  Or maybe she'll feel guilty about not sharing information with me and making her feel bad about herself is the last thing she needs from me right now. She's always been there for me when I've been going through hard times.  I just want to be there for her and know what's going on with her.  Two of my past friends have died of cancer and I don't know what I'll do if something happens to her too.  I want to be a good friend, but I don't know how.  Do I tell her how worried I am?  Do I play it cool and just hope that she comes to me if she needs anything?  Do I wait for a certain amount of time - maybe long enough for her to get the test results back - and then ask her about it again?  Please tell me what to do. Thank you so much.  I really appreciate your advice. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760170",
      "Title": "Need Some Advice Murasaki Murasaki"
    },
    {
      "AuthorID": "Murasaki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112515/profile",
      "Content": "Nov 1, 2010 04:29PM Murasaki wrote: Thank you so much for the advice, leaf.  I really appreciate it.  And, yeah, it might be nothing at all.  Hopefully. Your description actually made me think that I may have already done something wrong.  When she told me that she'd been to a doctor that had then referred her to another doctor and told me what it was about, I told her that it was good to get these things checked out as soon as possible.  I hope that she took this in the spirit in which it was intended, not as intrusive, unsolicited advice. Hm...I always ask people how they're doing.  I'm worried that if I stop asking her that she might take it as a sign that I don't care or something.  On the other hand, maybe you're right, maybe it would be less intrusive if I put it a different way.  On the other hand, I'm afraid that if I say something like, \"Please know I'm thinking of you,\" she might think I'm falling in love with her or something.  Arg...it's so hard to know how people are going to interpret what you say.  Some months back had an incident where somebody told me about a traumatic experience and I didn't know how to respond.  So I told them that I thought it was horrible and then tried not to push the subject further because I didn't want to make them relive it.  Then months later I found out that this person took my responce to mean that I didn't care.  I don't want the same thing to happen with this friend.  I want to be the best friend to her that I can...I want to make this easier for her...I want to say the right things...but sometimes it's really hard to know what the right thing is.  Since you've gone through this sort of thing, I will definitely take your advice into consideration.  Again, thank you so much....",
      "MessageIndex": 3,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760170",
      "Title": "Need Some Advice Murasaki Murasaki"
    },
    {
      "AuthorID": "Murasaki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112515/profile",
      "Content": "Nov 1, 2010 09:44PM Murasaki wrote: While there are exceptions, I like to think (or at least hope) that most people who make hurtful comments are doing so without really understanding the full effect of what their words.  For years I've had a knack at saying the wrong things to various people, and I want to make sure I don't make that same mistake here.  The thread you linked me to seems to be a good lesson at what not to say.  In some cases it seems pretty remarkable how selfish and/or insensitive some people can be...in other cases I really think it's more of a matter of just not knowing the right way to communicate.  And, like you said, people are individuals and sometimes they need different things.  I'll admit, I'm not the best person at taking cues, but I'll try.",
      "MessageIndex": 6,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760170",
      "Title": "Need Some Advice Murasaki Murasaki"
    },
    {
      "AuthorID": "Murasaki",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112515/profile",
      "Content": "Nov 1, 2010 04:39PM Murasaki wrote: debbie, thank you for the response.  I guess it's hard for me to understand when people want to keep things to themselves, because I tend to be very open about all aspects of my life...but from what I've read here it sounds like it's very natural to want to keep this sort of thing private, even from those people who are close to you.  I've told her many times in the past that if she ever needs to talk about anything, she can always come to me.  I guess she knows that's true...she must know that I care...she just wants to keep this sort of thing to herself.  What I've been getting from both of the responses here is: don't push it, let her come to you in her own time, so I guess that's what I'll do.  I really appreciate your input.  She's very important to me and I just want to handle this in whatever way is best for her.",
      "MessageIndex": 4,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/760170",
      "Title": "Need Some Advice Murasaki Murasaki"
    }
  ]
}