{
  "AuthorID": "murielwhite…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
  "Posts": [
    {
      "AuthorID": "murielwhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
      "Content": "Apr 1, 2016 04:06PM - edited Apr 1, 2016 04:09PM by murielwhite5 Hi Deanna and BadAtUserNames, Thank you both for taking the time to post your experiences for me. This particular Topic \"If' you are not stage 4 but have questions\" is perfect for this type of question. Although I agree with what you say about ladies fretting over every ache and pain I also think that its very important for us to be aware of things that are 'not quite right' Unfortunately it appears all too common that signs are ignored and passed off by our doctors and oncologists. I think the most important thing for us to do is strongly advocate for ourselves. There appears to be many occasions where the patient has noted something different and the doctor/onc has passed it off as nothing and it turns out to be MBC. Thanks again for your posts. Best wishes Muriel White p.s The other thing I wanted to say was about the ladies that actually have no symptoms and find out they have mets just by sheer luck. For me the statistic percentages mean nothing if you happen to be in that 30% or 5% or 10%",
      "MessageIndex": 3411,
      "PostDate": "01/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "murielwhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
      "Content": "Apr 22, 2016 09:38PM murielwhite5 wrote: Hi Chef127, Thank you for that. No you haven't caused me any anxiety. This has been going on for so long I will just be glad to know whats causing it. Even if it turned out to be awful, its still better to know. Thanks again. Love Muriel",
      "MessageIndex": 3457,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "murielwhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
      "Content": "Mar 30, 2016 10:06AM murielwhite5 wrote: Hi Everyone, I am wondering if ladies would be kind enough to share some of their symptoms which took them to stage 4? Throughout the boards there are posts regarding 'obscure' symptoms and of course some people who progress with no symptoms at all. For those of us who have lots of symptoms and SEs it would be useful to understand these 'obscure' symptoms. Thank you so much , Best wishes Muriel White",
      "MessageIndex": 3407,
      "PostDate": "30/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "murielwhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
      "Content": "Apr 20, 2016 10:46AM murielwhite5 wrote: Hi, Just wondering if anyone has/had some weird symptoms that I have. Apart from head pressure which I started getting last July (and has just gone from occasionally to virtually all the time) I have lots of ache and pains (don't we all!!!!!!!!!!!). My main concern is that now I walk funny! I am a very fit person who walks every day (at least 3 kilometres with my DH). I did it all through chemo, radio and surgery. My DH and I used to pace at the same rate but now I take very short steps and scuff my feet as I seem to have become flat footed. On a walk I often walk/shuffle all over the place like a drunk. My legs and feet are okay, it seems like a motor problem. I have had a couple of spells in hospital and lots of scans and tests. At this moment they still dont know what is causing it. I had a CT done last week of my adrenal glands and this coming week I am having an MRI of head and neck blood vessels. I would really like to know what Is the problem and I would very much appreciate any input? Thanking you in anticipation. Best wishes Muriel",
      "MessageIndex": 3444,
      "PostDate": "20/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "murielwhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
      "Content": "Oct 13, 2015 09:15PM murielwhite5 wrote: Hi everyone, I cant help but be surprised at the amount of ladies that get stage 1V after starting out with Stage 1 and a good prognosis. I see one lady had stage one , grade one and you cant get much better than that. Best wishes to everyone whatever stage you are. There are no guarantees for any of us!!! Love Muriel",
      "MessageIndex": 3145,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "murielwhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
      "Content": "Feb 13, 2016 10:43PM - edited Feb 15, 2016 10:12AM by murielwhite5",
      "MessageIndex": 3375,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "murielwhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
      "Content": "Apr 22, 2016 10:37AM murielwhite5 wrote: Hi Chrissy, Shetland Pony, Mags09 and Chef127, Thanks to you for posting regarding my problems. I was only on femara for a short while as I went back onto Tamoxifen when I discovered that I already had osteoporosis. I have been on Tamox now for nearly 2 years. I have had 2 spells off it to see if the symptoms go away and they didn't so that has been ruled out. Regarding chemo, I had 4 cycles but that finished Oct 2014 so I doubt if that's the culprit. Chef127 I am interested in your neuro based condition? Do you mind if I ask what it is and if you want to keep it private please feel free to PM me. I don't get dizzy, just feel its a 'head' thing with my walking and the swaying seems to be when I correct myself!!!! All very bizarre and hopefully I will get some answers soon!! Thanks again. Love Muriel",
      "MessageIndex": 3452,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "murielwhite…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213979/profile",
      "Content": "Oct 26, 2015 08:26AM murielwhite5 wrote: Hi Musical, Thanks for your reply. I had Docetaxel and Cyclophosphamide chemo. I believe that Docetaxel is a taxane. I was sent some info from the Cancer Council on peripheral neuropathy. It states that there is no cure or treatment available however there have been trials using duloxetine which is an anti-depressant which shows great promise. It also says \"Peripheral neuropathy affects 20 - 30% of patients treated wit taxanes and platinum-based chemotherapy, with a spectrum of severity that can affect such daily activities as walking, working, sleep patterns and mood. Although many patients may experience manageable numbness and tingling in the hands and feet, others find peripheral neuropathy chronic and debilitating\" \"CIPN (Chemotherapy-induced peripheral neuropathy) may continue for months or even years after treatment is stopped and may worsen over time\". Thanks for your input. Love muriel",
      "MessageIndex": 3,
      "PostDate": "26/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/836083",
      "Title": "Neuropathy murielwhite5 wirdgirl118"
    }
  ]
}