{
  "AuthorID": "MusicalLaur…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69231/profile",
  "Posts": [
    {
      "AuthorID": "MusicalLaur…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69231/profile",
      "Content": "Jul 15, 2008 11:26AM MusicalLauren wrote: Just back from doc. She sent me for an ultrasound, scheduled 7/21 and also referred to surgeon, consult the day after. Here we go.....",
      "MessageIndex": 3,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/709064",
      "Title": "Waiting MusicalLauren leaf"
    },
    {
      "AuthorID": "MusicalLaur…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69231/profile",
      "Content": "Jul 15, 2008 03:10PM MusicalLauren wrote: At first she was like, \"Its probably a cyst\" since its just the one. And I said how I'd felt 'others' around it and in generally the area was a lot \"bumpier\" than before. So she felt the area again and felt the corresponding area on the other breast and was like, \"Yeah, I'm going to send you for an ultrasound and give you a referral. You need a biopsy.\" So, she wasn't going to tell me exactly because obviously, she can't.  I don't know if this sounds weird, but I'm a bit more relaxed now than I was before. Before, nothing was happening but now its getting looked at. My parents are more worried though. They were hoping that she'd be like, its nothing, just normal growing stuff. The look on my moms face when I told her I had a surgical referall. I could tell she tried to hide it relatively quickly, but it was still there. She's scared. And so is my dad. My grandmother died of cancer, and my grandfather is on hopsice right now with cancer. Our deacon at church just had a heart attack after our previous rector died of brain cancer last october. And there are a bunch of people at church that have cancer (and a bunch with breast cancer). My dad was like, if this turns out to be something, we're leaving Epiphany! It must be cursed or something! (Joking of course...i hope...)  But we've been through hell and back in the last year. So everyone's on edge. It just seems like something that would happen to our family if something was wrong with me too........ So anyway, thats my story so far :) Thanks for everything! ",
      "MessageIndex": 5,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/709064",
      "Title": "Waiting MusicalLauren leaf"
    }
  ]
}