{
  "AuthorID": "Musicmomjv",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160375/profile",
  "Posts": [
    {
      "AuthorID": "Musicmomjv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160375/profile",
      "Content": "Dec 29, 2012 09:09PM Musicmomjv wrote: I was diagnosed with breast cancer in June. I too have very dense breasts and calcium deposits. Well this last time 2 of them looked suspicious on a mammogram. Nothing showed up on the ultrasound. Went for an MRI before I had surgery it showed more diseased breast than the biopsy or mammogram. I had 3 tumors the largest being 1cm. They were in different areas of the breast. I had to have the breast removed. I opted to just have the other removed also. By the way when I first found out it was from my primary care dr. My breast surgeon was out of town and I had to wait a week to find out the details. It was a difficult time to say the least. And waiting does suck. I was very scared. Tried to be positive and take things 1 day at a time. And try to be positive. That is a big part of it in my opinion. Best of luck to you. Let us know what you find out. Will be thinking of you.",
      "MessageIndex": 2,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/797837",
      "Title": "Very Scared mom2mbc Musicmomjv"
    },
    {
      "AuthorID": "Musicmomjv",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160375/profile",
      "Content": "Jan 4, 2013 10:59PM Musicmomjv wrote: I am sorry to hear of your cancer I too saw a breast surgeon first after my mammo and ultrasound. Mammo showed 2new calcium deposits that looked suspicious. Ultrasound showed nothing. Shie sent me for a biopsy. Dx ductal carcinoma. Then she sent me for an MRI before she did surgery. At first it was mentioned having a lumpectomy but the MRI showed 3 tumors biggest being 1 centimeter. Because they were in different areas of the breast I had to have a mastectomy to get clear margins. It was stage . I decided to have the other one removed. Turned out there was no lymph node involvement so am just on tamoxifen for 5 years. I know what you mean about waiting. When my primary care dr. Called me with the diagnosis my breast surgeon was out of town. He tried to get me in to see an oncologist because he felt waiting for 1 week before I knew anything else was not right. Well I think someone got things mixed up. Saw the breast surgeon the following week. The the oncologists office calls the next day saying my dr. Wanted me to see someone ASAP. Well this all happened after the fact. It is always going to be on your mind. All I can say is to try and think positive even though that can be difficult and make sure you are surrounded by people who are supportive and will listen to you and what you are feeling. Cry and get angry. Just go with what you feel. I will be thinking of you. Wishing you all the best. Keep us posted. Judy",
      "MessageIndex": 15,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798393",
      "Title": "seeing a surgeon, not an oncologist ihearthedgie Speedy4"
    }
  ]
}