{
  "AuthorID": "MusicTeache…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57985/profile",
  "Posts": [{
    "AuthorID": "MusicTeache…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57985/profile",
    "Content": "Oct 21, 2007 05:43PM MusicTeacher wrote: One thing I did that helped my ungodly angst/panic was to Take Control of My Life again.  My diet changed to vegetarian (with eggs once in awhile and a little fish now and then).  Walking and trying to keep up with a Pilates DVD (!) has helped my spirit a lot. Turning over my bigtime fears (like yours) to a Higher Source (be it God, The Universe, Allah, Jesus, whomever) was huge and I took up meditation, which is calming.  I constantly read everything I can get my hands on about rebuilding the body's immune system and help to 'help myself' heal from within in more ways than one. AND, I might add that I took just one capsule of St. John's Wort (wort=plant) a day and it helped to take the edge off. There is no one answer for everyone here, and the PTSD comment is SO right on - - had never thought of that, but gosh, how true.  But these are practical things that I grabbed hold of fast in order to take charge of me again.  Being in Control of ANYthing is a huge boost in setting our sites straight again.  You know, Shirley Hughes puts the Serenity Prayer on her comments. Sure applies: God grant me the Serenity to accept the things I cannot change, the Courage to change the things I can and the Wisdom to know the difference.  Sisters, help your bodies help themselves.  Get up and do something for YOU now.  It's easier to ACT your way into a new way of thinking than it is to THINK your way into a new way of acting. Forgive the philosophical moment here! SO many hugs to all of you.  This site has helped me so much.  Music Teacher",
    "MessageIndex": 11,
    "PostDate": "21/10/2007",
    "ThreadURL": "https://community.breastcancer.org/forum/70/topics/693426",
    "Title": "Anyone anxious at end of rads treatment? Stressin67 arnica"
  }]
}