{
  "AuthorID": "My2-Girls",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195204/profile",
  "Posts": [
    {
      "AuthorID": "My2-Girls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195204/profile",
      "Content": "My2-Girls wrote: I've read some comments that people with ki67 results that are a high number, have a better response to chemo.  I am confused for a change. My daughter had a low response to her ki67 test. The result was reported as \"<10 favorable\". We know she will need chemotherapy because of her young age and because of nodal involvement. So is this favorable result actually not favorable because it means she will not respond to chemo as well? Thanks in advance for your response. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818271",
      "Title": "Ki67 results My2-Girls ziggypop"
    },
    {
      "AuthorID": "My2-Girls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195204/profile",
      "Content": "Feb 21, 2014 05:19AM My2-Girls wrote: Thanks so much ladies. It's comforting to know that you are out there to answer questions for me. I don't ask my daughter because I am trying to stay very upbeat and positive for her and that is not my usual modus operandi. I scare easily. Ziggy, I will look for the caregivers forum. Thank you. My daughter had a bilateral MX last Friday, with reconstruction (tissue ex). She is doing well. Pathology is not back yet although we know she has some nodes affected. Her sister, our younger daughter is having a bilateral mastectomy this coming Tuesday. They are BRCA negative, but we do have a family history. Thanks again for your kindness in answering my question with such great explanations.",
      "MessageIndex": 4,
      "PostDate": "21/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818271",
      "Title": "Ki67 results My2-Girls ziggypop"
    }
  ]
}