{
  "AuthorID": "myboysmom3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148522/profile",
  "Posts": [
    {
      "AuthorID": "myboysmom3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148522/profile",
      "Content": "Apr 6, 2012 02:20PM myboysmom3 wrote: I appreciate everyone that posted .  Anything you can think of for me to ask the doctor when I get in let me know.  I havn't talked to my PC dr yet I am sure she hasn't received the results because they told me that my films and the actual radiologist reports wouldn't be ready until Tues at least that is when I can pick up my copies.  Hope that everyone has a great Easter weekend!! Angie",
      "MessageIndex": 6,
      "PostDate": "06/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785331",
      "Title": "second opinion myboysmom3 CoolBreeze"
    },
    {
      "AuthorID": "myboysmom3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148522/profile",
      "Content": "Apr 6, 2012 02:13PM myboysmom3 wrote: Debbie  thanks so much for answering back so quickly. I do know that it is probably nothing but my husband and I both agree that everything that can be done should be to make sure. We have good insurance so hopefully I wont have any trouble getting a specialist to at least listen to me and  do an MRI since I have some thickening of the skin and dense breast. Should I ask for the MRI and a biopsy of the lump what about the discharge should I also have them remove the ducts for biopsy? Hugs to you too!!! We can never have too many! Angie",
      "MessageIndex": 5,
      "PostDate": "06/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785331",
      "Title": "second opinion myboysmom3 CoolBreeze"
    },
    {
      "AuthorID": "myboysmom3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148522/profile",
      "Content": "myboysmom3 wrote: I am 40 and had a hysterectomy in 2007 I still have my ovaries (I did not have cancer ). I have also had a discharge in my breast since that time ranging in colors from yellow to black right now it is kind of a green color. Two weeks ago I developed Mastitis. I had a 2cm mass and swelling, redness and fever in my rt breast along with pain and itchiness.  Went to the dr was told take 10 days of antibiotics. Since then the swelling and redness are gone still have the small mass ,itchiness, and pain (feels like a heaviness sometimes burning feeling almost like when milk would let down. Had a mammo and ultrasound today .  The doctor that spoke with me after said that my discharge was common not to worry and that I have very dense breast but they are healthy.Should I get a second opinion especially since I can feel a lump? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785331",
      "Title": "second opinion myboysmom3 CoolBreeze"
    }
  ]
}