{
  "AuthorID": "MyCatSpot",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238876/profile",
  "Posts": [{
    "AuthorID": "MyCatSpot",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238876/profile",
    "Content": "Sep 3, 2016 03:23PM MyCatSpot wrote: Hi All, I am having neoadjuvant treatment(chemo first and surgery second). My tale is pretty uneventful until earlier this week. I had a power port installed on August 10th, my first Chemo treatment on August 11, extra fluids on August 12th with a Neulasta shot, and extra fluids on August 13. The extra fluids are an attempt to prevent kidney damage from some of the Chemo drugs. I had no nausea or vomiting. First constipation then diarrhea day 1 to day 6. Manageable. Funky mouth from about day 4 to about day 14. Started to lose my hair at about 14 days after first treatment. I have a few strands left but they look dumb. I am thinking of having my daughter shave my head. And of course some fatigue. The real fun started about day 20. The day before I was to have my second treatment. I had what I was thinking was swollen glands in my neck which was worse from the day before. I call my OD and he sent me off to the emergency room. Long story short my body/chemo drugs started attacking the power port I had installed on August 10th. I blood clots above the port and in my neck. I had the power port removed at the hospital on the same night by the BS. My second treatment has been postponed by a week. I am now on a blood thinner (Eliquis). My body needs absorb the blood clots back into my system. I think this is going to take way longer than I would like. Internet searches seem to indicate it could take several days, several weeks or several months. I hope I am one of a very few. Take care Ladies. ",
    "MessageIndex": 642,
    "PostDate": "03/09/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
    "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
  }]
}