{
  "AuthorID": "mykids711",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123002/profile",
  "Posts": [
    {
      "AuthorID": "mykids711",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123002/profile",
      "Content": "Dec 22, 2011 06:35AM mykids711 wrote: Thank you. I had the first biopsy when it was very small and I could see the doctor did not hit the spot it was way off. she did not use any imaging to guide her she did it free hand.  I had another biopsy done in a different spot at a later date this lump was not there during the first biopsy  The doctor told me it came back scant and she told me to come back in six months.. I asked what Scant meant and she told me she did not get enough tissue. I no longer go to this breast care doctor",
      "MessageIndex": 4,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779888",
      "Title": "diagnosis mykids711 mykids711"
    },
    {
      "AuthorID": "mykids711",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123002/profile",
      "Content": "Dec 22, 2011 06:38AM mykids711 wrote: I originally had only one very small lump now I have many and some large at least the size of a marble. i have breast implants yet they are very small and I have they say one cm of breast tissue so there is not a lot of breast tissue the implants are under the mussel",
      "MessageIndex": 5,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779888",
      "Title": "diagnosis mykids711 mykids711"
    },
    {
      "AuthorID": "mykids711",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123002/profile",
      "Content": "Dec 22, 2011 06:20AM mykids711 wrote: I am sorry if this does not make sence I just need to vent. I guess I just have to wait for new MRI to come back. I feel like I am not getting the best care because of my insurance I am a low income mother",
      "MessageIndex": 1,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779888",
      "Title": "diagnosis mykids711 mykids711"
    },
    {
      "AuthorID": "mykids711",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123002/profile",
      "Content": "mykids711 wrote:  I had a lump in breast went and had a biopsy. I told the doctor she did not hit it. She said she got close enough. I left it at that. Biopsy came back no cancer. I had a MRI done heard nothing from doctors and  left it at that. A year later had MRI came back invasive mammary carcinoma. asked to read my last mri's found out they said invasive mammary carcinoma in that MRI (that is the MRI i heard nothing back from any doctors.)Then I was to have 3 lumps removed before there was only one tiny one.  Jan 13.2010. I went to get a second oppinon and the new doctor said no cancer. I left it at that went 6 months later to a new imaging company and they said no cancer. Now 2011 I am waiting for my results to come back from MRI done yesturday. There is a lot more I would like to talk about having a skin tag show up last Dec that was never there and had it removed this was before second Mri and the doctors that read it put an indendum in saying they see the bright single cus of the skin tag. That was removed the lump is under the nipple . What I am trying to say is the Imaging co and doctors really have messed up my mri readings Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779888",
      "Title": "diagnosis mykids711 mykids711"
    },
    {
      "AuthorID": "mykids711",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123002/profile",
      "Content": "Dec 22, 2011 06:40AM mykids711 wrote: Thank you for the tip insisting on a new  biopsy.",
      "MessageIndex": 6,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779888",
      "Title": "diagnosis mykids711 mykids711"
    }
  ]
}