{
  "AuthorID": "myrenewal",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
  "Posts": [
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Jun 13, 2007 01:54PM myrenewal wrote: Hi Diane - I agree with the response that it is probably \"distancing\" behaviour from your sister-in-law. Does not make it any less painful for you, though! I also am on the receiving end of that behaviour from my husband's family. A couple of weeks ago, at the end of a family barbeque, my husband's brother's wife (so raised by her own family, NOT my husband's) asked me how everything was going and how I was. (I had not been asked by anyone since Christmas - which I hosted - as to how I was.) I had finished chemo in December and started two months of radiation. My mother-in-law, who was standing there, WALKED AWAY as I was answering!! Talk about distancing behaviour!! Maybe it is that entire family's version of denial. I suppose they don't know how hurtful they are, or they would not do it. I try not to dwell on it. It does change my relationship with them, as it is important to devote my energies to the people who are supportful and loving - unfortunately, the way I protect my emotions from them is avoidance.",
      "MessageIndex": 8,
      "PostDate": "13/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/629508",
      "Title": "The comments Bendcoles WendyInCalif"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Oct 18, 2007 09:29PM myrenewal wrote: I agree with Rose that bad news travels faster than good news - I was told my biopsy results would take about three days - when my doctor's office called me the following day by noon and said I needed to come in, I knew I was in trouble.  Sure enough - they already had results that the biopsy was positive. Hope you hear good news soon!",
      "MessageIndex": 6,
      "PostDate": "18/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/693997",
      "Title": "Long wait for results-is that bad? hopefor30 Catherinemk"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Oct 14, 2007 08:08PM myrenewal wrote: Terry - my tumor markers were very elevated during chemo.  My onc told me many, many times that this often happened during chemo and that they were not exactly sure why this happened but believed it was due to destruction of cancer cells.  (He had to tell me over and over because I hated seeing the elevated markers on my blood tests and would question it over and over!)  He was right, since chemo has ended all my markers dropped back into the normal range, when they had not been in the normal range for over six months.  WHEW!",
      "MessageIndex": 3,
      "PostDate": "14/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/693517",
      "Title": "Chemo and elevated tumor markers TerryNY TerryNY"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "May 28, 2007 02:01AM myrenewal wrote:",
      "MessageIndex": 8992,
      "PostDate": "28/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/185035",
      "Title": "2005 ROCK-TOBER CHEMO GIRLS sherryhaire Curlylocks"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Sep 7, 2007 10:16PM myrenewal wrote: You only see the atavars if you log in??!!",
      "MessageIndex": 7,
      "PostDate": "07/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/691735",
      "Title": "took me forever to log back in!! Fitztwins lkc"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Nov 9, 2007 04:30PM myrenewal wrote: Deb - I can only imagine what you went through this week, having just had some follow-up tests myself.  My doctors always warn me about false-positives, but it is still frightening for us - we are always just on \"high-alert\" now. Just curious - did you previously have radiation?  I had some radiation damage show up on my lungs on a PET scan, but it was immediately identified as such.  Anyway, I am thrilled your tests ultimately came out okay and am so glad that you had your results prior to the weekend.  Now go enjoy!",
      "MessageIndex": 33,
      "PostDate": "09/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695104",
      "Title": "Help, they think it might be back AlaskaDeb ilenee"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Sep 1, 2007 01:36PM myrenewal wrote: My rads oncologist told me I would not need deodorant and I did not. He stated that the bacteria that causes odor would not be present due the the radiation. Now it is six months later and still no odor or underarm hair!",
      "MessageIndex": 14,
      "PostDate": "01/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/687646",
      "Title": "Stinky Pits! playwriter sheshe48"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Nov 6, 2007 12:50PM - edited Nov 6, 2007 12:52PM by myrenewal Hi Sunshine - they did schedule my surgery at my first appointment with the breast surgeon.  I just wanted it behind me and was comfortable with the surgeon (he was the director of the breast center at the hospital).  But if you need more time to make a decision you should by all means take as much time as you need to feel comfortable! Hope all goes well on Thursday, keep us posted with what you are comfortable sharing. P.S.  My nickname at my first teenage job (which I had for six years) was Suzy Sunshine!!",
      "MessageIndex": 18,
      "PostDate": "06/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694831",
      "Title": "When do I tell my husband Sunshine99 Sunshine99"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Nov 3, 2007 07:07PM - edited Nov 3, 2007 07:08PM by myrenewal Hi Sunshine - when I met my surgeon I was amazed at the amount of time that had been alloted for my appointment.  At least 30 minutes (maybe more) was spent in his office while we went over the mammograms and biopsies and discussed lumpectomy vs. mastectomy, the risks and benefits of each and the procedure for the sentinel node biopsy.  He showed me my previous year's mammogram (done at another facility) side by side with my current mammogram and showed me that the lump had not been there.  My husband and I asked questions.  We then went into an examination room where I had a thorough examination and an ultrasound and we asked more questions.  At least another thirty minutes was spent there.  We did not get a second opinion (although we did for oncology).  We scheduled surgery and the nurse then went over what to expect at the hospital, etc., etc.  One thing that was not discussed was chemo prior to surgery.  I don't know if that would have been an option for me.  I believe it is being done more often now. This is your time to ask questions.  Write everything down.  I never felt that any doctor or nurse was impatient with me - no question is a stupid question.  It is a frightening time!",
      "MessageIndex": 12,
      "PostDate": "03/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694831",
      "Title": "When do I tell my husband Sunshine99 Sunshine99"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Oct 14, 2007 07:14PM myrenewal wrote: Hi Harley - I was very dizzy during chemo and many months afterwards - it was related to low red blood counts.  I believe in my case carboplatin was the culprit.  There are drugs that can counter that such as Aranesp if your blood counts are the cause of your dizziness.  I hope your dizziness improves quickly - perhaps it is just the shock to your body - chemo is tough!",
      "MessageIndex": 1,
      "PostDate": "14/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/693796",
      "Title": "about ONE week post chemo... Harley44 Harley44"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Nov 11, 2007 03:46AM myrenewal wrote: I had a lumpectomy and don't remember the injection for the sentinel node biopsy at all!  However, pre-surgery I did have to go to radiology to have some type of metal markers put into my breast so the surgeon would know the exact location of the lump.  The dye for the nodes was probably injected then also.  It was not particularly painful and done with topical anesthetic only.",
      "MessageIndex": 6,
      "PostDate": "11/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695213",
      "Title": "Surgery bapnkat melody"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Nov 19, 2007 01:11PM myrenewal wrote: Cheryl - you probably have an out-of-pocket maximum that you are required to pay each year for your medical costs, at which point your insurance begins paying at 100%, rather than the standard 70% or 80%.  It is quit possible you are already near your \"out-of-pocket\" if you have had surgery, etc., already.  (Of course - it all starts over in January.)",
      "MessageIndex": 6,
      "PostDate": "19/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/695635",
      "Title": "Price $$$ of Chemo CherylHanson mrs7148"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Jun 3, 2007 10:44AM myrenewal wrote:",
      "MessageIndex": 6,
      "PostDate": "03/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/623680",
      "Title": "chemo and sex konakat Paula3558"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Nov 10, 2007 12:47PM myrenewal wrote: I too have swelling in the radiated breast - 8 months after completing treatment.  My recent breast MRI shows lymphedema in the breast and thickening skin resulting from it.  Skin is still yellowish, but the doctors are okay with it.  Pet scan does show some radiation changes to my lung.  I also wish the possible side effects were more clearly defined by the doctors prior to choosing radiation as part of our treatment.  I was somehow lulled into thinking radiation was a minor part of the treatment, but now know better.  We're so afraid of the surgery and chemo, we don't put much thought into the radiation.  Just my take on it.",
      "MessageIndex": 9,
      "PostDate": "10/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/695107",
      "Title": "breast still swollen - two years post radiation melmedic06 Binney4"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Nov 29, 2007 07:37PM - edited Nov 29, 2007 07:39PM by myrenewal I had a friend who ended up with Bell's palsy while pregnant - it went away after the birth of her child - they don't seem to know too much about it. My father also had an episode of Bell's Palsy about 13 years ago - it began at my daughter's 8th birthday party at Knott's Berry Farm and we thought he was having a stroke so rushed him to the hospital.  (Memory as clear as if it was yesterday, it was so traumatic!)  They diagnosed Bell's Palsy, it went away relatively quickly (month or so) and has never returned.",
      "MessageIndex": 4,
      "PostDate": "29/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696153",
      "Title": "Bell's palsy while on chemo? luckywife luckywife"
    },
    {
      "AuthorID": "myrenewal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/47753/profile",
      "Content": "Nov 1, 2007 08:00PM myrenewal wrote: Blue Willow - would it be possible to delay your trip a month?  The only reason I bring this up is that my radiation had to be delayed twice due to skin issues - about 5 days lost each time.  Of course, many women have no skin issues at all during radiation, in which case you would probably be good to go - just with less energy than you would normally have.  I finished radiation last February, and we traveled on April 12 - although I was still having dizziness and fatigue I did enjoy the fabulous food and laying on the beach! Can you purchase trip insurance?  We did just in case and even though we did not use it I still consider it a good investment.",
      "MessageIndex": 3,
      "PostDate": "01/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/694554",
      "Title": "need advice from bc tx \"veterans\" re: traveling at end of tx bluewillow luckymel"
    }
  ]
}