{
  "AuthorID": "myyoga4me",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277027/profile",
  "Posts": [
    {
      "AuthorID": "myyoga4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277027/profile",
      "Content": "Aug 9, 2018 12:43PM myyoga4me wrote: hello. Been reading SAVI posts for a few hours thank you for sharing. I'm going in right now for my scan to see if I am a candidate. Lumpectomy was 2 weeks ago today. IF I am a candidate, treatment probably won't start until the 27th.... isn't that a long time to wait? A full month post surgery? Still having lots of fluid build up and pain from surgery - breast surgeon thinks my fibromyalgia was triggered. Worried about the pain of the device, insertion, 8-10 days with it in, treatment, and removal..... and thoughts, advice would be appreciated. Thanks.",
      "MessageIndex": 270,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842473",
      "Title": "Savi radiation treatment Sweetpea5741 ceanna"
    },
    {
      "AuthorID": "myyoga4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277027/profile",
      "Content": "Aug 25, 2018 05:51PM myyoga4me wrote: Hello Again, Irishgirl, sorry to hear the news. How did appointments go this week? I decided against SAVI APBI. I was having a really, really tough time post-op lumpectomy, sentinel node removal - tons of pain and swelling, lots of fluid accumulation, fibromyalgia was triggered and the nerve pain was almost unbearable. Surgeon was so worried about my pain that she suggested, if I chose to go ahead with the SAVI, that she do the insertion in a surgical procedure instead of in the office.... BUT, I also have a terrible time with surgeries (17 so far!) and have a genetic tendency for malignant hyperthermia and even with all the precautions I have trouble... so she was worried we'd be inviting 5 more problems to fix one or two problems. Then my radiation oncologist - after reading through the reports from the two weeks post-op (breast surgeon, radiologist who drained me twice, medical oncologist), he said if I was even slightly worried about pain, he recommended NOT doing it. Even with all that, I was still thinking, \"I can do this! I can tough out! I can make it through this!\" It took a dear friend who is a 6-year survivor of a hellish breast cancer (dx at 28, triple positive, radical BMX, 40+ nodes removed, hysterectomy, 18 mos of chemo, 12 mos of radiation, tamoxifen plus other meds... hellish!) .... she said to me, \"I have no doubt you CAN do it, but why do you have to? Who says you have to do the treatment that seems and feels hardest for you? Same outcomes, why do you feel like you HAVE to choose the toughest one?\" (Long story there, childhood/adolescent trauma survivor.... \"toughing it out\" is what I do to survive!). Anyway.... decided to pass on having more incisions, 10 days of a device partly in and partly out, 10 days of no showers, 10 days of trying not to move very much to avoid moving the device to avoid the pain that comes with readjusting the device, 10 days of a large dressing in an area that is STILL severely swollen and hurting like hell, 15 days of antibiotics (great for my messed-up-from-surgery-still GI system), missing 8 straight days of school, 10+ days of intense heavy pain medications again and the nausea and headaches I get with all of that, 14 or more scans in a very short time..... just did not feel like the right choice for me. So.... I will be having traditional external full breast radiation - likely 16 to 21 sessions, accelerated doses (incl boost). We're waiting on a tumor board decision on whether to do chemo or not...... my oncotype dx score was 14, Ki-67 was 56.8. Lower edge of intermediate, my MO felt no chemo but I'm not sure and he was going to present to tumor board anyway, so we decided to have him do that and use their recommendation as our 2nd, 3rd, 4th, etc opinions on chemo or not. Find out that decision on Tuesday afternoon. Following chemo (maybe) and radiation, I will then likely go on an AI (Letrozole).... pretty sure my blood work is menopausal... had it done a few weeks before I was diagnosed, just can't remember the results! MO is getting those results. Hopefully, by Tuesday afternoon we'll have a better idea of what's to come. Then meet with RO on Thursday to plan radiation (if I end up not having to do chemo.) Thanks, ladies!",
      "MessageIndex": 278,
      "PostDate": "25/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842473",
      "Title": "Savi radiation treatment Sweetpea5741 ceanna"
    }
  ]
}