{
  "AuthorID": "Mzbillieb76",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289791/profile",
  "Posts": [
    {
      "AuthorID": "Mzbillieb76…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289791/profile",
      "Content": "23 hours ago Mzbillieb76 wrote: I am in Canada so all our health care is free. My city has a very well known popular cancer hospital with state of the art equipment. I’m going to call again today and be assertive. Given my family history of breast cancer I am not about to wait this thing out",
      "MessageIndex": 6,
      "PostDate": "04/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871866",
      "Title": "Waiting on biopsy appointment Mzbillieb76 Fairydragonfly"
    },
    {
      "AuthorID": "Mzbillieb76…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289791/profile",
      "Content": "Jun 2, 2019 09:48PM Mzbillieb76 wrote: I have yet to get a biopsy on the tumor. Does anyone know how long the wait is to get a biopsy appointment at the cancer clinic? I’m going to call my dr again tomorrow to ask for the number of clinic they referred me to so I can follow up on an",
      "MessageIndex": 2,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871866",
      "Title": "Waiting on biopsy appointment Mzbillieb76 Fairydragonfly"
    },
    {
      "AuthorID": "Mzbillieb76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289791/profile",
      "Content": "Mzbillieb76 wrote: Here's my story: 2 months ago my right nipple started to pus and was painful and tingling, with an odd pain shooting from chest into shoulder blade, best way to describe the pain is it feels like when you need to crack your knuckles, like it needs to pop. I went to Dr. He put me on antibiotics. After finishing those my nipple was still the same, back to Dr. And another round of antibiotics. Still no change, not better.Back to Dr. He orders an ultrasound and bloodwork. Went Thursday May 30 for results and I'm told there is a large tumor on my right breast at 12 o'clock. Says he is sending me to jurivinski breast centre for a biopsy. I am now waiting for that appointment. I called my drs office on Friday to ask how long until I get an appointment and she told me \"should be\" this coming week. My doctor was not very informative, but I could see the highlighter on ultrasound report briefly and saw it said 12 o'clock. I have breast implants from 17 yrs ago and cannot feel anything in my breasts. My aunt was diagnosed at exactly my age, went into remission and relapsed 3 yrs later and lost her battle. My cousin was only 23yrs old when she lost her battle. Also my hemoglobin was very low along with my ironand during the antibiotics my nipple completely inverted and has remained that way. I’m so stressed out and going out of my mind. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871866",
      "Title": "Waiting on biopsy appointment Mzbillieb76 Fairydragonfly"
    }
  ]
}