{
  "AuthorID": "MzCaprcorn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103094/profile",
  "Posts": [
    {
      "AuthorID": "MzCaprcorn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103094/profile",
      "Content": "Jun 12, 2010 12:36PM - edited Jun 12, 2010 12:37PM by MzCaprcorn Hi Ladies I'm starting chemo on June 17. 4 AC every 3 weeks, then 4 D every 3 weeks, then radiation, then surgery.  It's been a whirlwind week here. Had an ultrasound on June 1, results on June 2, sent to a cancer surgeon June 3, had a needle biopsy one hour later, got a call June 4 to see the Oncologist June 9. Had a bone scan on June 11, CT scan coming up June 14, core biopsy on June 15, then a MUGA June 21. No details on the cancer, but it's a round hard lump 7cm x 8 cm (they removed 40cc fluid with the biopsy) with red skin splotches. He did find one hard lump lymph node. They are moving me really fast on this, which makes me very worried. I am guessing more details after the core biopsy. He talked about hormone positive/negative. I think I'm still in shock, more or less operating like a robot. I am so glad I found you ladies that are so sharing and caring as well as very knowledgeable. Any advice/good tips is welcome.   ",
      "MessageIndex": 272,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MzCaprcorn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103094/profile",
      "Content": "Jun 18, 2010 09:10AM MzCaprcorn wrote: Ladies, thanks to your encouragement and great information, I was ready for my first chemo. It went very well, the only discomfort was the iv installation. So glad I am having a port installed. No immediate reaction to the drugs so I am good for a quicker infusion next time. Had a diarrhea onset, took immodium right away and it stopped. Just a slight off taste but still snacking or is it called grazing?   I've made myself a white \"fun fur\" chemo cap that is really cute. Thinking I should make a blue/aqua on - my favorite colors, maybe stick on a temporary tattoo on my cheek for my next visit. That should get some \"looks\" or even \"laughs\" - we all need that. So glad number one is done. I think the waiting/anxiety was the worst part of it. Can't wait for my hair to fall out, that means those little buggers in my breast are going too!! ",
      "MessageIndex": 431,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "MzCaprcorn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103094/profile",
      "Content": "Dec 18, 2010 09:54AM MzCaprcorn wrote: Hi Everyone Have been absent so you may not remember me, also not an active poster. Update here. I spent 6 weeks in hospital from a ruptured bowel caused by Taxol. The first two weeks in a coma at death's door. Survival rate less than 50%, so lucky me. Had to learn to walk all over again and am still a bit weak. Have requested a new oncologist and got one since my old one wasn't paying enough attention to my bad reactions to the first 2 Taxols. Wondering if they want me to do more, less dosage or diff chemo.???    Have double mastectomy ahead when I am strong enough to handle the anaestetic. So glad to see the great progress most everyone is having. Hopefully I can be on that list eventually. Merry Christmas all, enjoy your loved ones!!!!",
      "MessageIndex": 2962,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    }
  ]
}