{
  "AuthorID": "nala24",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64471/profile",
  "Posts": [
    {
      "AuthorID": "nala24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64471/profile",
      "Content": "Apr 12, 2008 08:03AM nala24 wrote: I also have had a diagnosis change.  Last week my diagnosis following an MRI core biopsy was that I had  a large diffuse area of LCIS in one breast.  The report did say that additional stains were being done for DCIS; invasive cells; and hormone receptors.  Yesterday my doctor called and said the diagnosis was changed to DCIS with lobular morphology.  He said the slides were sent to Dr. Page at Vanderbilt and he confirmed the results.  In one week I got two different opinions.  I definitely want another opinion.  I'm so confused!",
      "MessageIndex": 3,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/703560",
      "Title": "Second opinion pathology is different!! formygirls myheidiscrapbooking"
    },
    {
      "AuthorID": "nala24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64471/profile",
      "Content": "nala24 wrote: I had a mammogram in August that was repeated and followed by an ultrasound.  The report said it was abnormal and most probably benign and to repeat the mammo and ultrasound in 6 months.  Last month, I had them both repeated and the radiologist said that the mammo and ultrasound don't agree and that I should have an MRI.  I had the MRI ten days ago and the report came back that in the right breast was a mass suspicious for malignancy and something was in the left breast that needed to be evaluated by ultrasound. No one ever mentioned a problem with the left breast before. This week the radiologist did the ultrasound of the left breast and said that he couldn't find anything.  He sent me to a surgeon to evaluate the right breast.  He said the physical exam, mammo, and ultrasound seem normal, but he suggested I have the radiologist follow up with a MRI guided biopsy.  I am now waiting for this to be scheduled.  Can anyone give me insight into the biopsy?  How long does it usually take to schedule this procedure?  I am supposed to go way next week and I'm afraid to postpone it to the following week. I am so nervous and can't wait for this to be over.  I am praying for a miracle. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702694",
      "Title": "MRI Guided Biopsy nala24 Blinx"
    },
    {
      "AuthorID": "nala24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64471/profile",
      "Content": "Mar 22, 2008 07:24PM nala24 wrote: Thanks rdawud, Did you move into the MRI machine several times?  Did they place a clip in you?  Did they do a  mammo to confirm placement? Sorry, but I am so nervous. Nala",
      "MessageIndex": 4,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702694",
      "Title": "MRI Guided Biopsy nala24 Blinx"
    },
    {
      "AuthorID": "nala24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64471/profile",
      "Content": "Mar 22, 2008 06:49PM nala24 wrote: I didn't get a chance to talk directly to the radiologist because when I saw him, I thought the surgeon was going to do a biopsy.  I am nervous and called the MRI center and the girl told me the biopsy would be vacuum assisted.  I would appreciate anything you can tell me.",
      "MessageIndex": 2,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702694",
      "Title": "MRI Guided Biopsy nala24 Blinx"
    },
    {
      "AuthorID": "nala24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64471/profile",
      "Content": "Mar 23, 2008 08:33AM nala24 wrote: Thank you for all the information and support.  My husband will be with me every step of the way.  He always is, even if he just sits in the waiting room.  He is trying so hard to be strong.  I am so glad I have you to talk to because he is wonderful, but a man.  My mom understands.  She has had 3 biopsies, all benign.  Everyone of her sisters  and most of her nieces have had biopsies.  Two of her sisters have had positive results, lumpectomies and radiation. Everyone else was benign.  One of my aunts was scheduled for a biopsy and when they went to place the wire during the mammo before surgery, the area was gone.  I am hoping for that miracle.  Does anyone know the recovery time after the biopsy?  Thanks for listening. ",
      "MessageIndex": 9,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702694",
      "Title": "MRI Guided Biopsy nala24 Blinx"
    },
    {
      "AuthorID": "nala24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64471/profile",
      "Content": "Apr 20, 2008 08:19AM nala24 wrote: Why don't they use Mammosite on premenopausal women?",
      "MessageIndex": 5,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/704207",
      "Title": "5-day vs. 6 week radiation treatment? ftreloar CherylRubie"
    },
    {
      "AuthorID": "nala24",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64471/profile",
      "Content": "nala24 wrote: Hi, I was wondering how soon after surgery does radiation usually begin?  I had a lumpectomy on 5/22 and I am scheduled for a re-excision on 6/16.  I was hoping to get the radiation over as soon as possible and was not expecting a re-excision to delay things.  Since I have a \"complicated\" diagnosis, the surgeon does not expect me to need any more surgery after 6/16, even if the margins are not clean.  When do you think I would start radiation? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/706899",
      "Title": "How soon after surgery does radiation usually begin? nala24 shepherdess"
    }
  ]
}