{
  "AuthorID": "nanadeb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
  "Posts": [
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 02:49AM nanadeb wrote: Add me to the group :( I have already placed this thread in my toolbar favorites as I expect to make wonderful friends here.so I can check back often to see how you all are doing. WHAT A WAY TO MAKE FRIENDS , HUH? I go in for my BMX , Aug 11th. I am not having recon at this time as they found a heart problem during my echo and stress test and I have to have a heart cath and possible stents 6 weeks after the BMX. When it rains it pours ........... I also have moderate COPD and my PS was worried about a surgery taking double the time and that I may have to go on a ventilator  for a couple days...BOO !!! But the heart thing did it in for sure. I may have recon in the future....but I doubt it. Not sure its worth the risk of dying for boobs. I've been waiting for the Aug list to go up....(kinda with dread) So thank you to who did it. I hope to support you all in our journey.  (((hugs)))  Deb74 Thinking of you today. Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 20,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 6, 2011 04:21AM nanadeb wrote: Welcome to all the new girls!!! I have to leave this morning for awhile. But I wanted to check in and scan thru the posts real quick Will post more later. I had what I thought was my last appointment before my BMX next Thursday But that wasnt so...more tests Tues..And more problems...BOO ! I blogged all about it here ~ http://atoosassygal.blogspot.com/ Do any others of you blog , so you can keep a journal of your journey thru this? If you do...please post a link here so I can read it. My family and friends were emailing and PMing me on facebook 50 times a day. I just didnt have the time to write them all back. And I knew it would just get worse thru surgery and treatment....They encouraged me to use blogger.com and start a blog. It's free..and it keeps everyone informed with out writing all those emails and PM's back I was feeling so guilty not writing them all back. Will be back later today to read more...((((hugs)))) to you all",
      "MessageIndex": 71,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 8, 2011 06:16AM nanadeb wrote: Wow...there is a lot having surgery this week. My thoughts and prayers will be with you ALL !!! Lots of new ones joining our group.So sad :(   I am so behind I will never catch up until after my surgery. I have so much stuff to do yet. I ended up in the ER Saturday by ambulance. And then tried to feel good enough for a family picnic giving for me. I blogged all about it, if any of you want to know more.And added pics. I look horrible after the day and night I had. But somehow think its better then I will look Thursday after surgery :( (((hugs))))",
      "MessageIndex": 90,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 10, 2011 10:20AM nanadeb wrote:",
      "MessageIndex": 112,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 29, 2011 07:14AM nanadeb wrote: I read somewhere that you are also dealing with 2 forms of cancer  (((hugs))) I think it was here and in a new forum they started on the site for those of us with multiple diagnoses  Yes....I've read what Blonde is going thru too. That has to be the worst. I just can't imagine losing your husband too. I just keep trying to stay positive and knowing that this is all in Gods hands",
      "MessageIndex": 355,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 03:37AM nanadeb wrote: Oh my gosh...I just seen that out of this small Aug group (so far) There are 3 of us from Ohio....Lilylady, Rangermom and myself... Are there any others? Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 21,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 05:06AM nanadeb wrote: Yes Chulita....you just keep going over everything in your mind over and over. It's worse at night for me when I wake up. Glad you were able to get 5 hours of sleep last night. Thats pretty good !!! Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 28,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 16, 2011 01:45PM nanadeb wrote: I am just now back from my Moms . Hope to get to stay home for good now. I hate not having a computer there My thoughts and prayers are with BlondeLawyer, RangerMom and FLWarriortoday. I didnt get the drains out. Boo. Would have been nice if one of the nurses would have told me I could pin them to the binding. It was the hanging that really hurt. Am doing much better painwise now that they are not pulling and swinging... :) My thoughts have been with you all thru the last week, Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 191,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 4, 2011 04:12AM nanadeb wrote: Sending prayers and good thoughts to tigerblood. blondelawyer...I was kinda wondering where you went. Bless you...you poor thing...In the hospital :( BOO !!!! Hope you get to go home today!! Wow dogeyed...sounds like you are glad to be home !! Glad that is over for you. They knocked a tooth out? Oh my gosh !!! Just what you needed on top of everything else  Flpinkwarrior and alamik...welcome to the August group. I hope we all become great friends and supporters of each other thru this journey rockym...thank you for all the great info. I will have to ask about the XL you're right. The Ambian puts me right to sleep...but I dont stay asleep long. Will be very careful about taking Zanax. I really hate having to take any meds :(",
      "MessageIndex": 44,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Sep 24, 2011 05:33AM nanadeb wrote: I havent been around  much. It was a crazy week. I had Doctors appointments. Wayyy to many.... Surgery to put in the Power Port under the skin for chemo. It was just crazy...All that after two of Tom and our neighbors died of lung cancer last week.VERY upsetting to us :( I start chemo Thursday.(Is there a chemo group for us?) I then go back for a shot Friday to boost my white blood count, then to my surgeon Friday also. I tried to write it all down in my blog. But I've been pretty down this week. No need posting when you're Debbie Downer...lol I go back for another stress test /echo Oct 11th so they can see it the results are still showing a blockage. But this time will use a chemical instead of me trying to do the treadmill, since I didn't do well with my COPD. They have to find out if I do have a blockage before I have the next surgery for cancer that is in both sides of my chest yet. :( I will find out Friday when they are doing that. I am so sick of hurting already. I can't imagine how its going to be when they go deeper this next time. I am so worried about chemo...I have such a touchy stomach anyways...I am so worried I will get very sick. I am already very under weight. Any helpful idea's to prevent nausea I would appreciate. They did give me a prescription for Compazine. Which I have to take every month already for migraines..... Please continue to keep me in your prayers. I will try to update you as I can..or the blog.I just dont know how much of this I can do...I am getting very depressed about it all. (((hugs))) Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 670,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Sep 14, 2011 04:28AM nanadeb wrote: I havent been around much....though I have thought of you all My life right now seems to be even more full of Drs appointments and tests.:( I feel so upset.....lied to thru this all... After having a nuclear body scan and CT scans of my head, abdomen and pelvis I was told I have spots on my thyroid.....Now I was told last Thursday by my Oncologist at my first appointment with him...that I also have spots on my lungs. I was just in shock. Tom and I both were sitting there in shock. Why wasn't I told this????? Why was all this held back from me...and now being told this in bits and pieces? I ask for all these scans so I could make a judgement over what I wanted to do BEFORE the BMX. So I havent been around much...To much pain...To many appointments.. The swelling/fluid  is finally going down. The pain is finally getting better. Blondelawyer I am so sorry for everything you and the others have been going though too:( Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 566,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 15, 2011 10:53AM - edited Aug 15, 2011 10:54AM by nanadeb I am praying for you all that still have surgery. I had a really really rough time . Will post more later I am still in a lot of pain and lots of nausea I am just home from my Moms and will be heading back there in a few minutes. I did make a post on my blog so all of my family and friends know I'm ok.",
      "MessageIndex": 172,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 22, 2011 05:19PM nanadeb wrote: I am so sorry I have been able to offer so little support over the last week since my surgery. I had a really bad time . Enough said about that. Today I went to my Drs at Cleveland clinic and they removed the drains. So much better. But path results were not good at all. And very upset that a nuclear body scan that I had showed spots on my thyroid , yet they told me it was clear. I posted all about the path results on my blog :( Lots of Drs appointments coming up still for heart cath, stents...chemo ...more surgery etc. My thoughts have been with you all thru the last week, And I read when I can...even if I cant post. Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 260,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 29, 2011 06:47AM - edited Aug 29, 2011 06:47AM by nanadeb I'm sorry I haven't been around much. But I am dealing with a lot of pain and problems right now.(like so many of you are) You are all in my prayers and thoughts. I hope that the ones of you who have had your surgeries are doing better And that the ones who have them this week , do well  (((hugs))) I may have thyroid cancer now. I just keep getting hit with bad news :( Trying so hard to stay positive and find the humor in it all. Remember the song that went \"If it weren't for bad luck I'd have no luck at all?\" My Drs office called on the thyroid scan results. It was\"inconclusive\" More of the \"B\" word (biopsy)...with my luck more of the \"C\" word too. I blogged all about it....It's the way I get it out and put down my thoughts thru all of this. Thank you for the prayers and caring thoughts And to those of you who read my blog and support me ,thank you too! Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 353,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Oct 14, 2011 07:32AM - edited Oct 14, 2011 09:26AM by nanadeb I just had to stop in and check in on you girls. I am not having reconstruction done, but have yucky hanging flaps where they did the \"skin sparing\" BMX , so that if in the future I wanted it done. I DON'T !!! I am hoping when they do my second surgery for the cancer left in my skin they can just cut that part away when they have to do the skin grafts... Its an ugly reminder off boobs that arent there anymore. The scar's are enough.  Hope everyone is doing well...I just got out of the hospital with pneumonia....12 days after my first chemo...I was so mad..The Dr put me back on steroids and I was FINALLY feeling good again!!! I was madder then a hornet..lol DebbiMy blog ~http://atoosassygal.blogspot.com/",
      "MessageIndex": 745,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 03:15AM nanadeb wrote: Is any one else having trouble sleeping? During the day , I seem to do good now..... I have been taking Ambian...but it only knocks me out for 3-4 hours.. Then I am awake at or drifting back to sleep and having nightmares :( Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 26,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 06:43AM nanadeb wrote: Sheypres.. So sorry you have to join this group :( So young...and such little ones  ((hugs)) The gals here are wonderful and theres sooo much info. Praying for good path report Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 30,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 12:50PM nanadeb wrote: Well being new I didnt know to fav plac this thread.. And I searched to see how you were doing. Not so good news I see.  ((((hugs))) Will keep you in my prayers hon Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 22,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770909",
      "Title": "DCIS High Grade Non Estrogen NYruralrider nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 29, 2011 02:56PM nanadeb wrote: I cant add anything to this as I too am so new of all this. But the ladies here are wonderful. I will just add my prayers for you",
      "MessageIndex": 6,
      "PostDate": "29/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770909",
      "Title": "DCIS High Grade Non Estrogen NYruralrider nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 02:27AM nanadeb wrote: Hi Rebecca I am having my BMX , no recon ,Aug 11th and going thru the same thing Yes,, try ACS. Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 2,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772536",
      "Title": "Where to get Mastectomy Products blubecca7 DocBabs"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 03:19AM - edited Aug 3, 2011 03:19AM by nanadeb I hope you here the results very soon after they are done I found out the day after my CT scans that all was clear. I found out at the same time the bone scans I had the week before was clear also.. Praise God.  Hoping for the same for you Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 9,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 05:04AM nanadeb wrote: I'm so glad this biopsy wasnt as bad for you Yes...take hubby when you go for another pair of ears and support. Hopefully it will be better news  ((hugs))) I will be thinking of you tomorrow when you go for your scans. I'm glad you don't have to wait to long for results. Praying for good results Debbi ~ atoosassygal.blogspot.com/",
      "MessageIndex": 14,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 4, 2011 04:04AM nanadeb wrote: Merrysee I see you just posted. Glad you were able to get in early. Will be watching for an update . Praying its good news. I'm so sorry you didnt sleep well last night. I'm having the same problem  ((hugs))",
      "MessageIndex": 27,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jul 31, 2011 10:50AM nanadeb wrote: I know all to well the rollar coaster ride. I think we all do. You sure don't need more added to it  (((hugs))) Will be saying prayers for you  Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 3,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772448",
      "Title": "My emotional rollercoaster ride... Mulligan Mulligan"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 23, 2011 05:27AM nanadeb wrote: I'm with the others...I cant believe you have to wait a month to see your onc. I'd try calling to get in sooner. I hate thinking of you having to worry about it that long......Saying prayers that its nothing to worry about.",
      "MessageIndex": 3,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770698",
      "Title": "Cough carcharm carcharm"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 4, 2011 04:02AM nanadeb wrote: Yes you are tough and you WILL beat this ... We ALL will.Praying for good scan results!!! The wait is awful...we all know.. You girls with the small children and babies are going to be that much more determined!!!!! Ireland sorry you too have to join our group. I'm glad you got to go on holiday. I think 9 weeks will be fine. I'm sure your surgeon knows what hes doing..Praying for a stage 1~ Wonderful supportive ladies here...and so much info. Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 26,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 4, 2011 07:13AM nanadeb wrote: Hi Madismonny !! You're another young one. I find it horrible that women are led to beleive BC is an  old lady type cancer. Why do they say you dont need a mamo until 40????? Younger are left on their own with a false sense of safety I think. Unless it runs in your family. They are left to their own to find the lump..some ductal dont even make lumps you can feel  The more I read on here...the more young girls I see. It just burns me up. Glad you got thru your MX and it wasnt as bad as you thought. I am so dreading it..as I know the other gals are.Sorry you're not sleeping well neither",
      "MessageIndex": 33,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 04:36AM nanadeb wrote: (((HUGS)))) I just cant imagine having such little ones. Its not \"fair\" for anyone to get breast cancer.  But totally not fair for such young women with small children to get it. I dont know what to say sweetie. Know this is a wonderful supporting place. We will all be here for you Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 2,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 05:54AM - edited Aug 2, 2011 05:55AM by nanadeb Yep ...walking in a daze is what I called it...And I sure was. I dont think I cried until they told me the bone and CT scans were clear. Then I praised God and bawled like a baby. I was so sure it was all thru me. As I have a huge swollen lymph node in my groin (like a golf ball) and bad stomach pains for months. But I dont have it no where, but in the breasts..and I am going to fight this ugly thing and win !!!  You will too.  Lots of wonderful caring women here. We will be there for you ((((hugs)))",
      "MessageIndex": 5,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 05:34AM - edited Aug 3, 2011 06:39AM by nanadeb Merrysee I wanted to tell you I am so sorry you are dealing with this also. Smart move to ask for a biopsy. No you should not have to be worrying about this now :( Will be praying for you and your baby Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 16,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Sep 13, 2011 11:11AM nanadeb wrote: Thats wonderful that you have such a caring understanding boss. I'm sure it is a huge relief Yes...you are going to beat this !!!!!  Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 6,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774739",
      "Title": "Off to the doctor today. martygra martygra"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 1, 2011 09:31PM nanadeb wrote: Thats horrible that you have to wait so long Vacation is no excuse. They should have had someone to cover for them to give you the results I am MAD for you !!! Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 8,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/772485",
      "Title": "Long wait for biopsy results in Montreal Harvest debsie1"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 28, 2011 08:26AM - edited Aug 28, 2011 08:28AM by nanadeb Sorry I am just feeling good enough to get back to the site. My path report came back Monday and it wasnt good. I walked around in a daze for 2 days...just like the day I was diagnosed :( I am doing better now. Here is my blog about my path report if you'd like to read atoosassygal.blogspot.com/2011...  Praying for you all who are newly diagnosed.",
      "MessageIndex": 10,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772824",
      "Title": "To those of you just diagnosed... nanadeb nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 28, 2011 09:39PM nanadeb wrote: Bella How did your first chemo treatment go? I read how a nurse was mean to you on another thread :( Just what ch need right now....Rrrrrrrrrrrr Thinking of you ! Debbi",
      "MessageIndex": 5,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773798",
      "Title": "Has anyone else had this happen? Beanpole nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 01:31PM - edited Aug 3, 2011 01:33PM by nanadeb I am so sorry about your diagnosis. But welcome to the group. Its small...so thats good  (((hugs))) I dont know much about it...but... it sounds like what I have :( Right breast - Invasive mammary carcinoma with predominantly lobular features, nuclear grade 2 -size 2 cm and I have Left breast-atypical ductal hyperplasia bordering on low grade ductal carcinoma in situ So I am having a double MX in the 11th.  Do you have a surgery date yet? You will find some good caring people here.Yes !! Ask for copies of EVERYTHING Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 4,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772601",
      "Title": "INVASIVE MAMMARY CARCINOMA W/ LABULARY rose1523 rose1523"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 1, 2011 09:28PM nanadeb wrote: Praying its nothing.Will be checking back on you Congrats on your new little one! Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 10,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/772402",
      "Title": "Waiting for Core Biopsy results bella76 bevin"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 08:39AM nanadeb wrote: Oh no :(   I am so very sorry to hear this I understand the shock. I was walking in a daze for a week or more sweetie I wish I could help you make sense of the report. But I know so little myself. Someone will be along to help I'm sure. What type of surgerydo you have to have, and when? Or has that been talked about yet? I will say prayers for you. We will get thru this together.",
      "MessageIndex": 12,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/772402",
      "Title": "Waiting for Core Biopsy results bella76 bevin"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 09:42PM - edited Aug 2, 2011 09:44PM by nanadeb I agree with you both. I am one of those people who never took a sleep aid or anything for stress. My Dr was very good about giving me Ambian to help me sleep and Zanax for those bad days for tests or just a panic filled day. It helps.  Marie ...I love that line....",
      "MessageIndex": 17,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/772402",
      "Title": "Waiting for Core Biopsy results bella76 bevin"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 04:54AM nanadeb wrote: Thinking of you this morning Michelle. I hope you were able to get some rest last night.  ((((hugs)))) Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 19,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/772402",
      "Title": "Waiting for Core Biopsy results bella76 bevin"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 08:13AM nanadeb wrote: Yep...As Marie says its morning here in the USA And if I'm not mistaken you are a day ahead of us too. It is Wednesday here. Is it already Thursday there? No matter...we will all be on checking on you girl. It is sooooo normal to keep playing things over and over in your mind. And that terrible feeling...Sweetie...we all know just how you feel  (((hugs))) Its a lot better for me now ,diag June 23, so it,s been awhile, but nights are still bad. And now I have started with nightmares :(  Ughhhhh hate that !! Just will be glad when the surgery is over. I don't know anything about those caps other then in the USA some Drs are very against them. I would read up on it for sure , before getting them. Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 23,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/772402",
      "Title": "Waiting for Core Biopsy results bella76 bevin"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 10, 2011 01:29PM nanadeb wrote: Have been uplifted by so many prayers. Thank you. I will admit I am so afraid...I will be so glad when it's over with. I have several members of my family going tomorrow. But most of all...I am in God's hands.I am safe Hugs to ALL of you going thru this. We will all make it together !",
      "MessageIndex": 4,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772824",
      "Title": "To those of you just diagnosed... nanadeb nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "nanadeb wrote: I want you to know am trying to read even tho I don't have time to post. My thoughts and prayers are with you all. I know the over whelming fear you are feeling.(((((hugs)))) I have so much to do I won't be posting much until after my BMX on Thursday. I know many of you don't know if you'll be in the August surgery or not yet. But I posted this there. Wow...there is a lot having surgery this week. My thoughts and prayers will be with you ALL !!! Lots of new ones joining our group. I am so behind I will never catch up until after my surgery. I have so much stuff to do yet. I ended up in the ER Saturday by ambulance. And then tried to feel good enough for a family picnic giving for me. I blogged all about it, if any of you want to know more.And added pics. I look horrible after the day and night I had. But somehow think its better then I will look Thursday after surgery :( (((hugs)))) Debbi http://atoosassygal.blogspot.com/ My blog ~atoosassygal.blogspot.com/ BMX 8-11-11 No rec. Invasive lobular in right breast 2cm and 1.7cm tumor AND DCIS... DCIS in left breast.chemo started 9-29.6 xTC then RADS and more surgery and skin grafts for skin cancer left Dx 6/23/2011, ILC, 2cm, Grade 2, 1/3 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772824",
      "Title": "To those of you just diagnosed... nanadeb nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 25, 2011 06:08AM nanadeb wrote: I am so sorry to read this.  Its sounds like you have a wonderful family and will have lots of support I know you didnt want to join this club neither. But we are with a great bunch of people !!",
      "MessageIndex": 15,
      "PostDate": "25/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/770653",
      "Title": "Not yet diagnosed... Robyn6463 Robyn6463"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 22, 2011 06:17PM nanadeb wrote: I'm so sorry you are going thru this scary time Waiting is the worst...I know. I had 3 biopsies on 2 breast for masses last Weds. and dont find out until I go to the surgeon's tomorrow. Hang in there...Keep as busy as you can. And try ( I know how hard it is) to not worry.",
      "MessageIndex": 7,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/770653",
      "Title": "Not yet diagnosed... Robyn6463 Robyn6463"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 05:50AM nanadeb wrote: I am so sorry you are having to join \"the group\" I have read for weeks here amazed at the info and caring people here. A wealth of info and friendship. Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 20,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772209",
      "Title": "Newly diagnosed and trying to keep it together Leighsa Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 28, 2011 08:08AM nanadeb wrote: Linda I don't know the answer to that neither. I do have it in one of the nodes out of 3 they took out But I had no pain what so ever I'm sorry you had to join us here :( Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 2,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773798",
      "Title": "Has anyone else had this happen? Beanpole nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "nanadeb wrote: This Post was deleted by nanadeb. My blog ~atoosassygal.blogspot.com/ BMX 8-11-11 No rec. Invasive lobular in right breast 2cm and 1.7cm tumor AND DCIS... DCIS in left breast.chemo started 9-29.6 xTC then RADS and more surgery and skin grafts for skin cancer left Dx 6/23/2011, ILC, 2cm, Grade 2, 1/3 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773893",
      "Title": "How much fluid is too much? nanadeb nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 21, 2011 10:28AM nanadeb wrote: I am so happy your biopsy results were B9. Will be thinking of you during your surgeon appointment today",
      "MessageIndex": 13,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770275",
      "Title": "Biopsy today now the WAIT!! kimmie44 nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Oct 19, 2011 09:47AM nanadeb wrote: I am so sorry you had to join us here. I dont know a whole lot about marco or micro node involvement.  I was told they found ONE Isolated cell in one out of 3 nodes..and they told me that was good. Your oncologist will for sure be able to tell you more. But coolbreeze is right. We just have to have faith that our treatments work. I go for my 2nd chemo tomorrow...Gosh hope I do better this time If not I wont be around for awhile..  Debbi    My blog ~http://atoosassygal.blogspot.com/",
      "MessageIndex": 6,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776691",
      "Title": "Node Involvement Teakay BocaCiegaBabe"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 05:39AM nanadeb wrote: I always hate saying welcome on these threads. It just somehow doesnt seem \"right\" does it?  The not knowing is the hardest thing.  I am new to this...but can tell you , the waiting for all the tests is very stressful. Hang in there...will pray for B9 results for you . Theres a wonderful group of women here and so much info , if you need us.  ((((hugs))) Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 4,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772590",
      "Title": "The waiting game... Zombean80 Zombean80"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 3, 2011 08:38AM nanadeb wrote: You're so right Jenny. I am finding out just how many very young people with young children get BC, Makes me rethink at what age they advise you start having mammo's  I'm sorry I dont know anything about blood flow.But the face on your Rad Dr would scare me too. Make me think its something bad. I'm glad you're getting it out. Someone will come in who does, I'm sure Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 8,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772590",
      "Title": "The waiting game... Zombean80 Zombean80"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 20, 2011 08:59PM nanadeb wrote: So happy for you !!!!! Such blessings",
      "MessageIndex": 6,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770349",
      "Title": "More nervous as it gets closer Tildymom hilda1976"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 25, 2011 06:12AM nanadeb wrote: Great news on the B9 result!!! I too am sorry about your upcoming surgery Glad you did well after surgery. Praying for another B9 result. NO CANCER !!!",
      "MessageIndex": 55,
      "PostDate": "25/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770144",
      "Title": "scared to death NmbrLcky13 mommyrnx2"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 17, 2011 02:28PM - edited Aug 17, 2011 02:29PM by nanadeb Thank you all for the prayers and good thoughts. I am home for good now I hope. I am doing pretty well after the surgery. I felt blessed to have been surrounded by love and God I blogged about it for myself (journal) and to update family and friends if you'd like to read. AFTER the surgery is when things didnt go very well. But it didnt have anything to do with the BMX, Thinking of you all and saying prayers for all your upcoming surgeries and treatments  Debbi http://atoosassygal.blogspot.com/",
      "MessageIndex": 7,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772824",
      "Title": "To those of you just diagnosed... nanadeb nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Oct 11, 2011 01:30PM nanadeb wrote: Darla... This is just too much for words. So many times life doesnt seem fair... Prayers for you and your son Debbi",
      "MessageIndex": 26,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776210",
      "Title": "Out of remission, now my son has cancer mcbird edwh001"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 23, 2011 10:31AM nanadeb wrote: Thank you mommyrnx2 Was checking in to see if  NmbrLcky13 has checked in yet :(",
      "MessageIndex": 51,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770144",
      "Title": "scared to death NmbrLcky13 mommyrnx2"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jun 22, 2011 03:31PM nanadeb wrote: Checking in on you....Hoping and praying it was B9 I go tomorrow at 2;00 for my results. I too am terrified. I want to know..but I dont :( ",
      "MessageIndex": 49,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770144",
      "Title": "scared to death NmbrLcky13 mommyrnx2"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 10, 2011 02:32PM nanadeb wrote: My thoughts and prayers are with you too  Debbi",
      "MessageIndex": 24,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772209",
      "Title": "Newly diagnosed and trying to keep it together Leighsa Joan811"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Oct 11, 2011 12:47PM nanadeb wrote: As the others said...Welcome, but sad you had to join us. I also kept getting \"new bad news\" with each appointment (spots on lungs...spots on thyroid)...so I know just how you're feeling right now. Keep in touch and let us know how things go. (((hugs))) I am also sorry for the loss of your mother. It sounds like she was a very strong lady and fought hard.  Debbi",
      "MessageIndex": 9,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774998",
      "Title": "Just Diagnosed-Not sure how I feel FilterLady nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Aug 2, 2011 07:33AM nanadeb wrote: Its great that they are getting you in so fast. No..you are not alone....worrying ...crying and waiting is the worst :( saying prayers for good results. Debbi  http://atoosassygal.blogspot.com/",
      "MessageIndex": 11,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772513",
      "Title": "scared and worried like never before... scaredmommyof6 SarahsMom"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Oct 14, 2011 09:59AM - edited Oct 14, 2011 10:00AM by nanadeb I think a lot  depends on how big the lumps are as far as a lumpectomy... Mine were large in the right breast 2.cm and 1.7 AND I was very small breasted anyway.So there wouldn't have been much left. It was also already invasive , so well into my chest wall and skin. More surgery coming up for the skin :( DebbiMy blog ~http://atoosassygal.blogspot.com/",
      "MessageIndex": 3,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776436",
      "Title": "Totally Confused bojo nanadeb"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Oct 15, 2011 08:15AM nanadeb wrote: Shelly is right...Everyone talks about even borrowing a recliner if you dont have one. Yes...that darn port makes you so sore for about a week. I had a heck of a time with it, as I hadnt healed from the BMX yet and I am such a thin person , Dr didnt even know if he could get it in there. He did...but I was black and blue the whole side of my chest and it hurt for a while. all better now. So glad I got it. DebbiMy blog ~http://atoosassygal.blogspot.com/",
      "MessageIndex": 8,
      "PostDate": "15/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776463",
      "Title": "So Sick of Sleeping On My Back! Michele_T fairweather9"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Oct 14, 2011 10:46AM nanadeb wrote: I'm sorry you too are going thru this.Those drains are the worse. I couldn't even sleep on my sides for weeks. I don't know if you'll have to have chemo or RADS. But it wouldn't surprise me if you do have to have chemo :(  You are still waiting on your HER2 too? They didn't have that on my PATH report neither...I still ha vent heard anything . I wish you still had people there helping you...I'm sure you still need it this soon out. Hugs  DebbiMy blog ~http://atoosassygal.blogspot.com/",
      "MessageIndex": 1,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776463",
      "Title": "So Sick of Sleeping On My Back! Michele_T fairweather9"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Oct 15, 2011 10:26AM nanadeb wrote: I got one of those wedges for the bed...but it put me at such a weird angle...I kept sliding down. But maybe you wouldnt.... The memory foam does help lots on the mattress..and the pillow under the legs :) Hope you slept some better last night   HUGS DebbiMy blog ~http://atoosassygal.blogspot.com/",
      "MessageIndex": 10,
      "PostDate": "15/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776463",
      "Title": "So Sick of Sleeping On My Back! Michele_T fairweather9"
    },
    {
      "AuthorID": "nanadeb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130728/profile",
      "Content": "Jul 31, 2011 01:21PM nanadeb wrote: Elaine , sending you good thoughts and prayers that the scans come back clear. Will be watching for news  ((hugs))",
      "MessageIndex": 16296,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}