{
  "AuthorID": "nanaof2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
  "Posts": [
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 26, 2010 04:02PM nanaof2 wrote: I am through menopause and was told very much the same thing.  Will still produce estrogen and need to take a pill for five years - arimidex ( I believe)",
      "MessageIndex": 10,
      "PostDate": "26/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/752807",
      "Title": "Tamoxifen vs. ovary removal lindamcm DFC1994"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 22, 2010 10:04PM nanaof2 wrote: The birad rate is good at #2.  THe higher it is the more likely cancer.  It goes to #6.",
      "MessageIndex": 5,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/752961",
      "Title": "mri result question texasgirl150 MRDRN"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 7, 2011 06:06PM nanaof2 wrote: Shelbytroy, it is a personal choice, but like you my husband said any chance is too much, so I did the treatments. We didn't want to second guess ourselves later.",
      "MessageIndex": 135,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763815",
      "Title": "Anyone with an intermediate oncotype? Lovelillian nem126"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jul 8, 2010 09:14AM nanaof2 wrote: Sacphotomom, so sorry to hear what your Dad has had to go through.  I had a DVT once and it is very scary and I only had to be hospitalized a few days and on coumadin for one year.  It is still scary to think that you can get something like that and not really know.  Glad he is doing much better. Golfergirl, I have put on about 6 pounds, it is very frustrating.  Hopefully, when this is over it will come off as quickly as it seems to have been gained. Leanna, the wig place I went to first wanted to charge me $25.00 for helping me, right....I just walked out.  Happy to hear your treatment went so quickly. Day, sounds like to you a like of 'natural' foods, drinks.  I admire you for that.  I don't know what half of what you are talking about, but think I may make a visit to the store to look around. My sister came for a visit, which is why I have not been blogging.  Anyway, she gave me the best 'feel better' card.  It had a turtle with a bandage on it.  Thing is my dad used to stop and pick up turtles on the road and carry them across to 'safety'.  She wrote in it that she sawa it and felt like my Dad was guiding her hand to it.  (He passed away 3 years ago)  It really hit home, that he is up there looking down, willing me to get better.  Little things like that make all the difference, don't you think?  Feel good everyone! Judy",
      "MessageIndex": 910,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 8, 2011 11:51AM nanaof2 wrote: Jenn, you are right it is our worst fears. I pray you can go home soon. Paxton, he's a real cutie, love that he is playing in the dirt. My sons loved to do that. Brings back great memories! Being on this prednisone for the radiation pnuemonitis has given mr the dreaded \"moon face\" I look awful. I am suppose to be on it for at least another month, Hoping to get off of it sooner. Wishing everyone a Happy Mother's Day!",
      "MessageIndex": 2366,
      "PostDate": "08/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 27, 2011 10:39PM nanaof2 wrote: Jenn, so sorry to hear you are back in the hospital. Pray you go home soon. Day, sometimes I think we need to be reminded of what we have been through. We think we can lift more than we should. Feel better soon. Leanna, that constipation, you don't know you have till it is too late...ugh is right! Sacphotomom I'm going for a trim on wednesday. I swear if she over cuts, I don't know what I will do. It has been three months since the last trim and I need some kind of shaping. I think I will remind her that I have already had the very, very short look and didn't like it! Had a ct scan today to check on the radiation pneumonitis, I'm a little concerned that they did the neck done and added a contrast dye this time. Why is it we seem to get these tests on fridays when you have to wait a weekend to get answers....and then this is a holiday weekend. Love and enjoy the Memorial weekend. Very hot here in Florida!",
      "MessageIndex": 2423,
      "PostDate": "27/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Sep 25, 2011 03:06PM nanaof2 wrote: Hi everyone, I agree keep posting and letting us know how you doing. I'm still coughing from the radiation, getting another ct scan. They also took me off of one of my blood pressure pills. They said it too could cause chronic cough. Who knows? Otherwise, life is great! I'm going to be a nana of three in April. My son and his wife are expecting another child. Being a mom of two sons and two grandsons, should I secretly hope for a girl? Judy",
      "MessageIndex": 2568,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Oct 7, 2011 10:19PM nanaof2 wrote: Hi Ladies, well, the ENT dr. thinks it is acid reflux that has gone crazy from the radiation pnemonitis.  I am having an endoscopy on Friday.  They are actually sewing in a capsule near my stomach, then I wear a belt with a device that records information for two days.  Medicine is truly amazing, why they can't find a cure for cancers is beyond me. On another note, had my mamo today and untrasound, they saw a spot that could be a seroma, hoping it is.  They are sending me for another MRI. Hopefully in the beginning of the week. Wish me luck ladies. Also, Beth and I are playing some scrabble on 'words with friends'  join in if you like the game. I will keep you posted. Judy ",
      "MessageIndex": 2582,
      "PostDate": "07/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Oct 18, 2011 01:48AM nanaof2 wrote: Yea, great news. Radiologist says the lump is a seroma, fluid still from the surgery. I am happy beyond belief. Day, hope your ribs are doing better. Have you heard from your onc? Judy",
      "MessageIndex": 2588,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 10, 2010 06:02PM nanaof2 wrote: So nice to hear most of you are doing very well.  Just got back from my first treatment.  I feel fine so far, reading what most of you have to say, I will good tomorrow too.  I love this website, it gives me such hope and inspiration.  You ladies are terrific for sharing everything.  Love to you all!   Judy",
      "MessageIndex": 187,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 12, 2010 03:35PM nanaof2 wrote: Hi Ladies, just got in from work.  Not feeling to badly today.  PackJen- I completely agree, without eyebrows people just don't look well.  JennyB - I have heard about the Look Good, Feel Better and plan on signing up for it too.  Hoping for help in learning to put on the brows once they are gone. Drim - so nice to know you have such good friends, it makes all the difference.  My best friend is driving 7 hours this weekend to see me. Can't wait to see her either! CTerese and Redbarb, I'll be thinking of you tomorrow. I know you will do great! Alice  and Irishtess- It really is never too late to join, this has helped me more than anything.  Best wishes to you during this very challenging time.  Drim - wow you are really getting the water in.  I am trying, but it has been hard.  I never realized how little I drank. I have not heard anything from my dr. about Neulasta. My best to everyone! D",
      "MessageIndex": 216,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 14, 2010 12:24PM nanaof2 wrote: Felt very achy last night. Came home early from work today. Sunflower, I'm with you, going for a wig this weekend.  Barb, one treatment down, happy to hear no complications! CTherese, glad your treatment went so well.  I am fighting getting in this water.... All of you wonderful ladies, hang in there, have a great weekend!",
      "MessageIndex": 260,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 17, 2010 04:46PM nanaof2 wrote: Hello Friends,  I have not written because I have been sick.  I spent Saturday night (day6) in the hospital.  I picked up a virus somewhere - easy to do in education.  Had fever, severe stomach cramps, diarrehea, bleeding. uck - uck - uck.  My husband and best friend sat with me from 9:00pm to 6:00am, when they let me go home.  DX - bladder infection and virus.  Was told to see a GI, I have a call into my ONC. this morning to see what he wants me to do.  Stayed home from work for the first time today, just to regain my strength. On a positive note, my friend and I picked out a wig.  I am debating getting my haircut this week to look like the wig, or just letting it all fall out in 10 or so.  I agree with everyone, hair is so much a part of us.   Welcome to Summer 38! Sorry you have to go through this, but these women are remarkable and you will learn a lot! Packjen, sorry to hear about your hand.  I have a port, so I can't compare with you.  Hope the next round goes better. Sacphotomom, Wow - four miles that is incredible.  I made myself walk the other night, but could only do one mile.  Will try a little tonight, if my strength holds up.",
      "MessageIndex": 312,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 26, 2010 11:50PM nanaof2 wrote: I agree with MNLinda, once the hair starts to fall out, it is quite simply amazing.  Mine started on the 14th day and I have worn a scarf with my hair for two days.  Will do the same for Thursday and Friday, then Friday night the buzz....thanks for the website MNLinda, they are beautiful scarves. Thanks Redbard, I will try the mix on my sores.  I have two now.  Hang in there with the hair thing. My night is Friday, with my sons.  They are shaving their hair too! (They are 33 and 35 years old - both married with sons of their own.) My DH so far is not joining in with the shaving, but he has been the most incredible man, so that doesn't matter - I actually don't want the boys to do it either.... Welcome Kim, hope you get as much from this site as I do.  If you have a join, these are fabulous women. Javahog, glad to hear things are going well. Cleob, you are right, we are survivors and this is just a big bump in the road, nothing we cannot do. CTherese - you have a wonderful attitude. I'm a Leo too.  Hair is just so important to all of us, silly, but very true.  To me, I am trying so hard to put on a ‘good, healthy face' and losing the hair just kinda blows that.",
      "MessageIndex": 452,
      "PostDate": "26/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 26, 2010 11:53PM nanaof2 wrote: fotopet - seriously throat sores?  what do you do? I have two mouth sores and they are bad enough. Hang in there..",
      "MessageIndex": 453,
      "PostDate": "26/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 31, 2010 12:47AM nanaof2 wrote: Anyone have a rash with little blisters?  It is on my hand between my fingers, don't know if I could have touched something or if it is another SE....",
      "MessageIndex": 517,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 3, 2010 11:08PM nanaof2 wrote: Packjen, thought of an idea, maybe some ‘shell' shaped candy, you know - We shall beat this!  Love how creative you are and know that the center you go to must love to see you! My husband not working, but I am, thank goodness.  I do agree it is nice to come home to a home cooked dinner and a great husband who is doing everything possible he can for me. Day, I wouldn't worry about addressing us, we are all here for each other.  I read everything and don't mind if you mix me up with anyone of these ladies!  I did have a UTI.  Redbarb, hope your treatment went well.  Just finished my second on Tuesday.  Teeth hurt again this time, did last treatment too. So, I guess that is what I have to expect.  Not sure if this is okay and I usually check everything out first, but didn't this time.  But here goes, I had two mouth sores after my first treatment, I dipped a q-tip in iodine and put it on the sores, not enough to drip, didn't swallow anything. It burnt a bit, but they healed right away and have stayed away. Irishtess, good sense of humor and we need that.  Good luck with the next treatment. Summer, you have every right to be emotional, it isn't always fair, but you will get through this and your daughter knows how much you would love to be with her. Hang in there. JennyB, I hear it is called ‘chemo brain' or something.  The other night I told my husband I needed to take a Lipitor before I go to bed to make sure I get a good nights sleep, I meant ambient.....I don't even take Lipitor. Sacphotomom,  I love the phone story.... CRAZY! Drim, so happy the penguin caps are working, wish I had time to arrange it, but didn't find out until too late.  If anyone has nothing else to do...The Gainesville Sun, our local newspaper, did a wonderful article about my staff wearing the scarves to show support.  It can be read at sunone.com. the write up is something like \"Staff Show Support for Principal\" .I only agreed to it because it showed educators in the nicest way.  So many get a bad rap now a days. Kathy, welcome on board! Sorry so long, wanted to catch up with everyone, love to all!",
      "MessageIndex": 562,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 4, 2010 10:26AM nanaof2 wrote: Yea, that is it.  These are my two sons.  One shaved all the way, the other cut quite a bit offer.  I didn't want either to do it, but kids do what they want to do...Both boys in their 30's married, with a son of their own.",
      "MessageIndex": 573,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 5, 2010 06:28PM nanaof2 wrote: Day, hope you are feeling better.  I don't think a beer will do any damage.   Drim, you and I are doing about the same.  I am on day 5 of #2 TC.  I felt pretty bad yesterday too and my taste buds, uck!   My biggest problem is the water.  I just can't do it, I get in about 60-70  ounces, but that is it.  Yesterday not nearly that much.   Today woke up with what I though was another UTI, but drank cranberry juice and feel better.  MNLinda, I think I will get some of the AZO stuff, thanks.  Just laying around watching tv today, thought I would try to clean, but that isn't going to happen.",
      "MessageIndex": 581,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 9, 2010 09:13PM nanaof2 wrote: Marilyn,  thanks for fletting us know how your are doing, I think that you are ahead of us and give us  input on what we will go through. So happry for you that you are ahalf way through the treatmens.  I too am going to read the stories.  I think it is so lovely that you all right and it helps us. SO, thankyou. Today was a very hard day for me, I gus getting the port in yesterday and the retmentent tomorrow and made it all too real, even though I knew it waws going.  U have take severl adivan through the day, it they finlly are working.  Hated begin weeping thorough all of Mother's Day. Planning on going to work tomorrow moring and heading for the threatmen at 1:00.  I hope you all stay well!   Judy",
      "MessageIndex": 176,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 13, 2010 01:57PM nanaof2 wrote: Redbarb, hang in there, my first treatment went well.  They put the chemo in very slowly and I had no reactions.  I will be thinking of you today and praying it all goes well. CTherese, I was told I had to take the pill before they could do the treatment and if I didn't take it they would not do it. J",
      "MessageIndex": 233,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 22, 2010 09:32PM nanaof2 wrote: Tricia - think that is a good idea for the hair use too. Anything is better than just throwing it away.  I cried this morning, some is falling out now and I keep telling myself, I am okay with this and then I cry again.  I know I can do it, just the anticipation is making me nrvous.  I have the most DH helping with this and two sons right there with me too. why is it so stressful????",
      "MessageIndex": 396,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 23, 2010 07:33AM nanaof2 wrote: cleob - I don't know how I missed you.  Welcome to our group.  You will find tons of information. Most of us are a week to two weekds ahead of you.  My first treatment went very well. Do what the drs. tell you, for me that was taking meds the day before, the day of and the day after.  THe nurses doing the infusion will watch you carefully, but beaware of any changes your body feels and tell them immediately. Feel free to ask any questions, these women are brilliant have done a lot of research already.",
      "MessageIndex": 406,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 24, 2010 05:39PM nanaof2 wrote: fotopet - hope you are feeling better. I am beginning to wornder if I had caught a bug or it was just what to expect on day 6.  That was the day I had the severe stomach pains and diarhea.  Just hope you are feeling better.   JennyB - stay well..... Keeping everyone in my thoughts and prayers. Judy",
      "MessageIndex": 419,
      "PostDate": "24/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 4, 2010 10:24AM nanaof2 wrote: Hi packjen, thanks for the heads up  on the picture.  I couldn't sleep, so was up reading and decided to try it.  I uploaded from my Iphone, then went to my home and was able to do it - I think.  I will see when I sign off....wish me luck.",
      "MessageIndex": 572,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 21, 2010 07:06PM nanaof2 wrote: Jenny, you have been through more than anyone should have to deal with at any time, let alone all at once.  Hope you are feeling better soon. Summer, Glad to hear from you.  I have been suffering the extreme fatigue around days 5-7.  So,  I am kind of expecting it this weekend.  When you are tired, you need to rest, it is as simple as that. I take lorazepam for anxiety.   I don't take it often, but when I need it, it helps.   Had to take two pills the night I shaved my head.  Golfer Girl, you must be thrilled to be nearing the end of the chemo.  They are giving me 6 treatments of the TC, and having finished #3 tonight and being  half way through, I am very excited. Well, it is an early night for me.  Stay well, love to all of you. Judy",
      "MessageIndex": 771,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 28, 2010 06:14PM nanaof2 wrote: Pax, good luck with your treatment tomorrow.  And remember we are all here for you,  feeling much the same as you, so spout whatever you need to.  We'll listen.... Kim, most of us have had the hardest time with our hair.  I wear  a scarf most days, but did wear a wig today.  I find myself scratching my head and it moves the wig....not a good idea. Barb, I have a rash on my back,  stomach, arm and leg.   Wish this would  all just go away.  I spoke with a firend tonight and told her, I'm just so tired of not feeling well, nothing I can't  handle, but want to feel  like myself again. On a good note, tomorrow I am taking my new grandson (8 weeks old) to a photograher. We are getting our pictures taken  together- both bald heads.  I plan on making a scrapbook page for his album. Hopefully sometime in the future, I will get a chuckle  from it...... Stay well, and if you feel like \"bitchin'\" go for it. Judy",
      "MessageIndex": 827,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 11, 2011 01:01AM nanaof2 wrote: Kim, what a beautiful, meaningful song, thanks for sharing it. One year ago today since my first chemo treatment. Sometimes it feels like yesterday and other times I am amazed at how quickly the time has gone by. I will be seeing my onc and radiologist in June. Jenn, hope your chemo treatment went well. I hear you about the hair. I have never had a bit of curl and now it is really curly. I am able to blow try it somewhat straight, but the ends really curl. UGH! Have a nice night ladies. Judy",
      "MessageIndex": 2375,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 21, 2011 08:56PM nanaof2 wrote: Jenn, what a wonderful surprise and great friendship you have. These are the things that keep us going! Sacphotomom, my sister had shingles and said it was terribly painful. Hope you ate feeling better soon. We had our annual Teaches vs. Fifth grade Kickball game yesterday. Someone tell me why I thought I was up to participating. I kicked the ball, took off running and fell flat on my face. Don't worry I wasn't hurt, but my friend said she looked at the kids and they all looked like \" children of the corn\". Staring, mouths open. I think everyone was afraid to ask if I was okay, sore joints today but otherwise fine... Have a great weekend everone!",
      "MessageIndex": 2406,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 22, 2010 01:26AM nanaof2 wrote: Too tired tonight to post much, but I was told by someone  to sprinkle my hair in the bushes and the birds will use it to build nests.  Love the idea of something useful.",
      "MessageIndex": 390,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 23, 2010 12:13AM nanaof2 wrote: Day, I am so sorry to read all of this.  You must be so angry, frustrated and tired.  Can you call your onc. Monday, just to report all of this?",
      "MessageIndex": 398,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jul 22, 2011 10:41PM nanaof2 wrote: I am so sorry to hear this...so senseless, someone so young. God bless her and take care of her family.",
      "MessageIndex": 2482,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jul 23, 2011 06:29PM nanaof2 wrote: Beth, there are a few Beth Mier, which one are you? Judy",
      "MessageIndex": 2488,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 27, 2010 06:07PM nanaof2 wrote: Paxton, I  too have a yeast infection, hard to believe all of this can go on in one body.  Hope you are feeling better and happy to hear about your fun pot luck dinner. Tuck welcome to you, Kim and Patricia. Tuck, you  and I are on the same schedule, I too go on the 1st.  For some reason I have to have 6 treatments, not sure why. Day, how did your treatment go? Fotopet, hope the sores are improving. Tomorrow is the buzz night for me. At this point it will  almost be a relief, I can't stand the feel of my head and the 'fear' of touching it and having it fall out.  I will let you know how it goes.",
      "MessageIndex": 479,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 31, 2010 10:53AM nanaof2 wrote: Patricia, I haven't taken any pain pills recently, but will keep that in mind.  I have not been given the Neulasta shot yet. Hoping I never need it.  Everyone seems to suffer such pain from that, they sure don't put than in the commercials. Round 2 for me tomorrow afternoon, I will see the Dr. first, maybe he can tell me what to do for the rash. Sacphotomom, I love lemon pie and love that you made it so you like the taste~ Have a great Memorial Day everyone.",
      "MessageIndex": 520,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Aug 28, 2011 10:19PM nanaof2 wrote: The start of the new school year has been very hectic, bu it made mr realize how much better I feel this year. It is so grat to have last year behind me! I know you all feel the same. Kim loved watching some of the games. You must be so proud of Jacob. What memories! So happy the hurricane Is over for my Jersey family and friends. Category 1 is no big deal inFlorida, but very scarey for people up north. Hav a great week!",
      "MessageIndex": 2552,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Sep 1, 2011 01:20AM nanaof2 wrote: I was just telling my husband the exact same thing, I am finally not exhausted. I am so happy you are feeling the same way. It is amazing to just feel tired...I may never use the word exhausted again! Yea for all of us!",
      "MessageIndex": 2555,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 2, 2010 08:30PM nanaof2 wrote: Hi Ladies, didn't get to write yesterday.  Had my treatment but was late, the port developed a clot, so they had to flush it several times and sent the blood to be tested, only to find it still had clots. So, reflushed again, did get a sample that was good. Just took more time for two blood tests.  Good news, was the blood tests were good. Still no need for neulesta.  That was treatment number 2. Best news, was from you Trish.  Thanks for sharing that, I know it boosts everyones spirit. Will write more tomorrow. Had a long day at work, interviews all day. Good night Ladies. Judy",
      "MessageIndex": 550,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Dec 7, 2011 11:17PM nanaof2 wrote: Hi ladies, it has been awhile, but like you, i felt i needed to connect again. It truly is wonderful to be a year out since finishing the radiation. My hair is very dull too. It also still has a bit of a wave to it, but i am trying not to conplain. Better this hair than no hair. I dont remember if any of you did the coldcaps and if they completely worked. Kim prayers to your family and that little baby. A friend had a premie and he is perfectly fine now. Hang in there. Photomom, i dont let nearly as many things bother me, i usually find myself sayimg, does this matter in the scope of life? Most thinhs don't!!! So nice to see you are all here! I wish everyone of you the best Holiday ever! Judy",
      "MessageIndex": 2612,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Mar 18, 2012 12:31PM nanaof2 wrote: Hi Ladies, it has been a long time, but i have enjoyed catching up on all of you. Two years feels wonderful. Hair has finally gotten to a point that i can call it a style. I do have some news, i had my knee replaced in Dec. It was suppose to be done the summer i had the cancer, so that wasn't happening. I am finally feeling better. Also, going to be a Nana again of ,yes,another boy. Two sons and now three grandsons. He is due in two weeks, can't wait i love babies. Stay well!",
      "MessageIndex": 2658,
      "PostDate": "18/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Apr 19, 2012 05:32PM nanaof2 wrote: Day, your garden is beautiful. Makes me smile, so happy everyone is doing so great. I also became a grandmother for the third time, another wonderful boy. I was bald when the last one was born, now i actually have hair! Judy",
      "MessageIndex": 2682,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 17, 2010 03:20PM nanaof2 wrote: Leanna and Kim, hope your treatments went well. Sacphotomom, I do taxotere with cyclophasmide (sp?) with the meds they give me I don't get nausea.  Other SE, but not nausea. I have been using a gum brush and it seems to be helping.  I have only had mouth sores once during the first treatment. Hang in the Ladies!",
      "MessageIndex": 733,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 20, 2010 06:36PM nanaof2 wrote: Day,  Do the SE ever end?  I had to take my nails off  (acrylic)  first time in 10 years, dr. was afraid of water getting underneath causing an infection.  It is also a SE of taxotere, at least that is what they said. Kim, I told the nurse giving me the infusion to put my second in at the same speed as the first, the first treatment went well and second did too.  Tomorrow I am telling them the same thing. That will be treatment #3 and makes me halfway through. I am sorry you had to go through that, but you are wise to tell them next time. Laura, so sorry about the blisters, that sounds so painful. Hope you don't have to deal with it ever, ever again. JennyB, I am truly sad to hear about your tooth.  Can they do anything to get you on your feet and feeling better?  Paxton and JennyB, hang in there.  I had a bad week,  felt like crying, but thought if I did I wouldn't stop. Feeling much better this week.  Just very tired.  Not doing things that I normally do.  Today didn't cook dinner for the family, instead went to a restaurant that my dad loved - he passed away 4 years ago. Paxton, let the dust collect in the house,when you are better it can be cleaned.  Take care of yourself and your little one.  I so admire all of you who have children at home.  I guess you have to do what you have to do, but I know it is much, much harder for all of you .  God Bless! Lisa, listen to Kim, you can rant all you want, we all completely get it!!! I have the most wonderful husband,  children, family and friends, but unless you are going through this, it is hard to explain and understand. Summer,  keep telling them about any eye problems.  My dr. feared a bleed,  now there wasn't one, but he did check me out.  That was my eye dr. who I called. He saw me right away. Leanna, my husband is not working either, he has some health issues.  It is nice having him home.  I have plenty of sick days, if I need them.  With school being out, it is soooo much quieter, I am getting so much more done. Congrats on getting 1/2  way there.  That's me  tomorrow. I can't wait. Hi Fotopet, are you doing okay? Sacphotomom, I am on #3 tomorrow, but it is taxotere and cylophasphomide, so not sure about SE getting better, it would be nice, I will keep everyone posted.  My bad days are usually days 6-10, other days are much less, just don't feel like myself, tired mostly. Well,  wishing eveyrone the very best. Love to you all. Judy",
      "MessageIndex": 765,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jul 3, 2010 06:50PM nanaof2 wrote: Drim, My 4th treatment is the 12th, so I will definately be thinking of you getting your 4th the following day.  We asked my dr. at the time I was diagnosed if the cancer were worse would I have more treatments or less, less treatment, he said that was his standard was 6 , but added we will see how you do after four. So, I guess I will know after the next treatment.  What probiotics are you taking? I think the starving is because of the steroids.  I agree I can eat everything. ",
      "MessageIndex": 870,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 7, 2011 01:24PM nanaof2 wrote: Jenn, I don't think I have ever prayed so hard. A fever surely must lean towards an infection. I hope you are feeling the hopes and prayers of everyone. Day, I am so impressed with your hair, you give me hope. Leanna, I don't recommend a trim, I have had two and they didn't help with the curl and the second just made me cry. My friend reminded me cutting makes your hair shorter... Photomom, I will look into the arimidex link. My biggest complaint is exhaustion. Hope everyone has a great weekend for me looking forward to the rest time. Judy",
      "MessageIndex": 2358,
      "PostDate": "07/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 26, 2011 12:42AM nanaof2 wrote: Yes, Day , so glad you are safe. I used to think hurricanes were bad, but you always have plenty of notice to evacuate. Jen, I think checkers is a great game, especially when I think of how sore I was the next day... Sacphotomom, hope you are feeling better. My hair is a mess, still curly, but it has no shape or style. I may have to get a trim soon. I haven't wanted to do that, but I really look awful.",
      "MessageIndex": 2416,
      "PostDate": "26/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 18, 2011 07:46PM nanaof2 wrote: Hi Ladies, been away for a bit, very busy at work and still feeling the exhaustion from the rdiation pneumonitis. Library Jenn, I am so sorry for hat you are forced to be going through, it really is just so unfair. I know as hard aa it gets you will keep up the fight. We are all praying for you, daily! Packjen, what a wonderful experience for your children, how nice that you found it. Njbhwgrl, you are so right nothing helps the curls. My hair dresser said eventually I will get my natural hair back, which was perfectly straight. I used to hate it, but this wave is so hard for me to get used to.... Madjula, wow the museums sound like it was wonderful! Hope everyone has a great week...love to all!",
      "MessageIndex": 2458,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Sep 5, 2011 12:00AM nanaof2 wrote: Linda that is incredible, I know you must be thrilled! Your journey has definitely taken you to a good place. I know you will do a great job speaking for all BC women. I will look for the merchandise on the website. Have fun! Judy",
      "MessageIndex": 2560,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Oct 11, 2011 01:41AM nanaof2 wrote: Thanks for the positive thoughts, Leanna. I won't be able to get the MRI until Friday, so the wait begins. I am also scheduled for the endoscopy and colonoscopy on Friday, so a busy day. Jen, leg cramps? Does it ever end? I will let you know next week how I make out. Judy",
      "MessageIndex": 2584,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 15, 2012 07:02PM nanaof2 wrote: Hope everyone had a fabulous Mother's Day. I did. I too had to work at figuring the new website.",
      "MessageIndex": 2694,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Sep 4, 2011 06:55PM nanaof2 wrote: I don't believe the bi rate of 2 is much of a concern, I think that means there is a benign tumor. I would still want it checked out and confirmed to be benign. My bi rad rate ws 5, which is 95% cancer and it was. That was a little over a year ago. Best wishes to you!",
      "MessageIndex": 1,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774198",
      "Title": "Newbie worried confused My Info lollysraindrop lollysraindrop"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Apr 28, 2010 10:37PM nanaof2 wrote: I am not sure about the Chemo, I will find out on Monday when the Oncotype score comes back.  I really don't know what to expect.  The worse part is waiting to do something.",
      "MessageIndex": 43,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 7, 2010 06:47PM nanaof2 wrote: Hi Ladies - finally have my start date for the chemo, it is Monday, May 10th.  Got the port put in this morning.  Leanna9, you and I are right there together.  Laurie R - congratulations, I am so happy for you and your family. Beainus - We are happy to have you with us. Together, women can get through anything. Day - I anxiously await what you have to say. Hope it went very, very well. Pack Jen - I have not knowledge of Neulesta yet.....  Marmalade - Great to hear your days are getting better and better!  Redbarb - Love the sayings on the t-shirt, great idea!  My friend suggested naming the chemos a friendly, fighting name...having come up with anything.   Any ideas? Wishing the best to everyone - remember if you want a rainbow, you have to put up with the rain. Judy",
      "MessageIndex": 152,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 11, 2010 03:27AM nanaof2 wrote: Good Morning Ladies, Sunflower so sorry to hear about your first treatment problems.  That has to be so forifying. Even with your problems, you continue to give the rest of us some great tips, thanks. I had my first yesterday and no real problem, but they put the drip very, very slowing .  I will get in lost of water today! Jenny B, Thanks for the update on the hair.  It seems to be everyones question, mine for sure.  I think I could handle this a lot easier with that.  I have finally gotten my hair where I want it and gets lots of complements, and now I will have to start all over.  Small problem in the sceme of things, but none the less, just one more thing to deal with.  It certainly helps me to know around what day to expect it to start, so thanks again. Redbarb, Good luck with your first treatment on the 13th, hope yours goes as well as mine did. Have a great Tuesday everyone. Slept well for five hours last not, I think that is the most since all of this started. ",
      "MessageIndex": 193,
      "PostDate": "11/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 11, 2010 04:32PM nanaof2 wrote: Day 1 down, feeling good.  A little tired, mostly from waking at 3:00 and not able to fall back asleep.  Day, love the wig. I am going shopping for one this weekend with my friend.   Bought one last weekend, but just out of not knowing what to do, it was a cheap one, but everything nicer was sold out.  Won't hurt to have two wigs anyway. Jenny B, thanks so much for keeping us updated on the hair.  It is really the hardest part, just not knowing.",
      "MessageIndex": 198,
      "PostDate": "11/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 19, 2010 10:50PM nanaof2 wrote: Fotopet - that sounds frightening, glad to hear things have settled down I have heard about the Feel Good....I plan on attending too. Redbarb. I can't take pain meds on an empty stomach either. Hope you are keeping everything down now. Danielaes  - Good luck in June.  I had read a lot from the April group and found it very helpful. But, love having these ladies going through this with me - they are all so smart and loving. Packjen- what a great idea with the rollers, definitely worth trying. Victoria - welcome.  I am also having 6 treatments too.  This is a really wonderful group of women. Kristy - How nice to hear from you.  I only imagine being two years out.  You had some great ideas.  I will have to ask around to see where we should all take ourselves. What about it, maybe we should each take a turn or start the destination and have each add something to it?  What do you think?",
      "MessageIndex": 359,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 23, 2010 07:15PM nanaof2 wrote: Photopet - my hair also needed a desperate trim along with color and hightlights too!  I finally went into a quick cut type place.  My hairdresser is on a cruise.  I will definately be buzzing it this week.  It seems to be coming out in handfuls tonight.  I am hoping to get through to Thursday, but not sure.....",
      "MessageIndex": 409,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 29, 2010 11:51PM nanaof2 wrote: Leanna, love the websites, thanks!  I ordered a bunch of the bandanas for summer. Sacphotomom - I cannot believe how rude people are,  I remember when I broke my ankle a few years ago and had to use a wheelchair in the mall, people were amazing, just knocking into the chair - no one offering to help.  Opened my eyes - big time.  I vowed I would always help, although I like to think I would have anyway. Fotopet, truly hope you enjoy your weekend.  I love the mountains in the summer. Jennyb, Leanna, and all of you ladies with children hope, you are my heros.  My children are grown and I have two grandchildren, but I come home from work to a wonderful husband and don't really have much to do.  Seriously, you are remarkable!!!!!!! Packjen you are incredible with incredible friends.  When is your next treatment, maybe we can come up with an idea. Day, I am thinking about you and sending good thoughts your way. On a great note, I too found out how wonderful friends and coworkers are...yesterday almost the entire staff came to school wearing scarves.  I was so touched. We took pictures after the kids left.  I will never forget the feeling of love, support and concern. And my ‘buzz' went as well as can be expected.  My sons and husband were great.  My youngest son clipped it short and then my husband shaved my head.   Today woke up thinking - I'm really bald.  Not wearing anything around the house, went to the store wearing a hat. I hope you all have a fabulous few days off. Rest and stay healthy as you can....",
      "MessageIndex": 511,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 10, 2010 12:08AM nanaof2 wrote: Absolutely love the picture Barb!  Beautiful smile...thanks Linda for letting us know how to do it. Day, maybe they will have a day in a month or two.  I would think you can still attend, even if the chemo has stopped.  I hope so, I plan on going in July.  Laura, that is phenominal fundraising, way to go! ",
      "MessageIndex": 634,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 15, 2010 06:49PM nanaof2 wrote: Hi Everyone, I am sorry I have not been able to keep up with what has been happening.  Besides dealing with SE, I have decided that ending the school year is every bit as busy as starting it.  I have had meetings, parents, students, teachers, everyone.  Things should get a bit easier now, all students and teachers are now finished.  I have my third of six treatment on Monday.  I will be 50% finished and can't wait.  I was sicker this time, but mostly around days 5-10.  Heart rate was racing so they took me off of HCZT a pill I take for my blood pressure.  Now I have put on 10 pounds in three days - I hope all water weight.  So, today I was told to go home and resume taking it.  I guess I will be up most of the night using the bathroom.  Are you all getting in your gallon a day?  I am up to about 110 ounces and still trying.  My husband is constantly reminding me to get your water....ugh. Love and best to everyone. ",
      "MessageIndex": 717,
      "PostDate": "15/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 16, 2010 07:15PM nanaof2 wrote:",
      "MessageIndex": 727,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jul 3, 2010 02:27PM nanaof2 wrote: Barb.I have heard something about the 5 day radiation.  I believe it has to do with the size of the area needing radiaiton. If you find out anything else, let us know.  I don't start rads until mid Sept. Pax, your baby sounds adorable, I age when children start sayings words.  I think I actually love something about every age.  Glad your are having a great weekend, roasting the pig and all.  You deserve a break and I am glad you are getting it. Tess, sorry to hear about your last treatment SE's.  I think some of this is cumulative.  I had a harder time this third treatment.  Fever,  etc.  just basically exhausted and very weepy.  Which is not me at all. Sacphotomom, Sounds like you are turning lemons into lemonade with your party.  Hope you have the best time ever.  And further down in the blog, that drinks looks delicious! Thanks for sharing.... Xray girl, welcome,  you are sure to learn alot, and I have never heard any complaints of any kind. You and I are on the same plan, I started 5/10.  I have had three and my next is July 12. To answer some of you questions, yes, I eat more and attribute it to the steroids.  I crave salty more than sweet.  I also think the water weight is a factor and once this is over things may even out. Fotopet, sounds like you to have a fun weekend plan.  Enjoy and stay away from the 14 days. NJ Girl, passing out really, how scary and dangerous is that - just hang in there. The drs will work with you on getting through the SE. Drim, I am glad you are doing so well, this third TC did me in.  How many are you having?  My dr wants 6, but says we will see how we do after 4. JennyB, CONGRATULATIONS, you are done, I am so happy for you. You will be able to lead us down the path of rads...... Hope eveyone enjoys the 4th of July, spending it with loved ones and not thinking about C. Judy",
      "MessageIndex": 867,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jul 11, 2010 05:25PM nanaof2 wrote: Sacphotomom, glad to hear your Dad is on the road to recovery.  You are right, it is much easier  if you are inthe same town.  You just have to tell yourself, it can't be  this time.   Sorry to hear about the rash, I have rashes, small, but very irritating, it looks awful and itches.  They don't seem to heal  either.  Hope you  are doing  better. Library Jenn, bet you enjoyed your movie night with your DH.  It is so great having a wonderful DH  or DF to help get through this.  Mine is the best, I am sure you all  feel the  same way. Patricia 48,  love the wig picture and the idea of having everyone try it on. At least they may be a little  closer to understanding wearing one.  They day the staff wore scarves, many told me they don't know how I will  do it in the heat.  I live in  Florida.  It certainly helps if others understand.  Hang in there for the treatments, complain and have great days, it just goes with the territory. Redbarb, hope your 4th treatment goes well and that you get to enjoy your vacation. You certainly deserve it. Where are you going? Cleob, you are so right,  sometimes we do need to try and put this all behind us and just live a normal, wonderful  life. Thanks for reminding me. Pacjen, you certainly had a busy time  of it with your neices.  How brave of you to even  attempt.  I continue to believe those of you who have children are my real heros.  I only have to come home to a DH and I feel exhausted going to work the next day. Day, Funny you mentioned the hairs being prickly, I can feel some of them through my scarves, guess I will to find a cap to wear under the scarves when my hair starts to grow back. Xray girl, I am going to look  for that movie, I am always up for a good laugh. Golfergirl, Congrats on finishing this part of your treatment.  Let us know about the rads, since you are ahead of some of us.  I am getting 6 TC so I a bit behind you. Leanna, hope you are feeling better.  Hang in there, you can do this.... Day,  I cannot believe  the medical  staff you have had to deal with.   I have been very lucky so far.  Twice I had the same nurse and the other time,  the nurse was equally as good.  It can make all  the difference.  I had my best friend come visit me for a few days.  Had a wonderful time, just relaxed by the pool for part of the day, talked and talked.  It was great.  I go to treatment 4 tomorrow.  Can't wait to get it done. Then only 2 more... Have a great week. Judy",
      "MessageIndex": 958,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 3, 2011 06:26PM nanaof2 wrote: Hi everyone, sorry I haven't written, I am still dealing with the Lung damage from the radiation and coughing constantly. Also, had to hire a new assistant principal, but in between had to deal with most things on my own. Jenn, I am so sorry you are back to dealing with this damn cancer,I will pray it all goes well. Anyone taking arimidex? I am feeling complete fatigue and don't know what to blame it on - since I am takng so many pills and stuff for my lungs.",
      "MessageIndex": 2344,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 12, 2011 11:18AM nanaof2 wrote: Jenn, what great news, hang in there! I know you can't wait to get home and hold that little boy of yours. I'm thrilled for you! I'm going to have a good day now!",
      "MessageIndex": 2379,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 23, 2011 01:37AM nanaof2 wrote: Hi everyone, saw my radiologist today, first time in six months. She said everything looks good. She said she was very surprised I had the radiation pneumonitis, only 1-9 chance in me getting it. At least it is better, finally stopped the prednisone on Monday. Hope to get rid of this \"moon face\" soon...love to all.",
      "MessageIndex": 2462,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Aug 9, 2011 06:28PM nanaof2 wrote: I think the say way, Kim, it is just heart breaking. I also am so thankful to have had all of you to lean on,listen to, get support from and just walk this journey with. It truly has made a huge difference in my outlook and health. Thank you all!",
      "MessageIndex": 2519,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Aug 19, 2011 05:56PM nanaof2 wrote: Love the stories of the tattoos. I keep saying I want to get my husbands name on me. Some place discreet...he put my name in a heart on his arm 38 years ago! Maybe I will get the courage now, Kim, I love Little League, my home town Toms River NJ won several years back, very exciting. Congrats to your family! Anyone see GMA with the new song byMartina Mcbride, \"I'm Gonna Love You Through It\", It is amazing. All of us have people who have helped us through our ordeal. I highly recommend you google her at GMA, but get some tissues. My friends you have all helped me through this...stay well!",
      "MessageIndex": 2540,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 25, 2012 11:50PM nanaof2 wrote: I know what you mean about chasing down everything, but it is best to get things checked out. Prayers that it went well. Happy Memorial Day everyone! Judy",
      "MessageIndex": 2698,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 22, 2011 08:31PM nanaof2 wrote: I don't want to worry you needlessly, but yes, my doctor diagnosed me from the ultrasound. My mammo never did show it, the tumor is very high up near the breast bone. My biopsy came back negative, but my dr. called it false negative. My husband wouldn't believe it until the surgery was done, tumor removed and biopsied. It was cancer, but as everyone has been saying, it is do able. Hang in there. You have found a wonderful website here.",
      "MessageIndex": 10,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/770502",
      "Title": "Need help understanding mammo results.. worriednlost barbe1958"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 3, 2010 07:51PM nanaof2 wrote: Looks like you ladies are a few days ahead of me.  I found out today my treatment will be DC x 6 @ 3 weeks.  I first need to get the port, then will have the dates.  I look forward to hearing from my new 'sisters' - I will keep all of you in my thoughts and prayers.   ",
      "MessageIndex": 85,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 18, 2010 11:33PM nanaof2 wrote: For anyone that hasn't found this website yet, http://www.chemotherapy.com/ is great. Lots of info and forms to help you organize your treatment. Ctherese - I hope you have already gone through the worse, can't believe you are walking a mile. Keep going girl! Day - I too have not received the neulasta shot or even spoken to a dr. about it.  I will at my next treatment.  I can't imagine dealing with what you have to be going through - the very least you expect is someone to listen.  I love your idea of the dark glasses and earrings! Jen- hope you are feeling better.  The drs. told me my numbers were 2400 and that if they were 500, I would have been admitted.  Happy they were high. DancerMel - Good luck to you this Friday! Sunflower - as I said above, no neulasta so far for me.  You are just a few days ahead of me.  I am on day 9 today.  My hair is okay so far, but it is the biggest thing I am concerned about.  I too have very thick hair and I finally love my haircut.... Claudette - Keeping you in my thoughts today, hope it went well. Countryfrau - So glad your treatment was uneventful...that is what is best! JennyB - I hear what you are saying about going out in public with a wig...everyone says, don't worry, you'll look great, but I am not looking forward to it.  Hang in there, I am feeling your pain and hoping knowing others feel the same, makes it a little more tolerable. Sacphotomom - hope your treatment goes well tomorrow. Welcome to Mommyto4!  I know you will enjoy being on this blog, it has the best women in the world!!!!! Hi Drim, hope you are having a great day. Everyone have a great Wednesday!",
      "MessageIndex": 339,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 23, 2010 07:29AM nanaof2 wrote: Redbard, were you still on the antinasuea meds?  I am afraid to not take mine.  My dr. said it is easier to take them and not start the nauseaousness than to have to fix it.  Sacphotomom and Jenny B - you are both about one week ahead of me and I so hear what you are saying about the hair.  I am deciding on when to do the buzz.  I have a principal's meeting this Thursday and hope I can make it.  Why, why, why,....I have decided that I am upset because everyone says how well I am handling this and once the hair is off , it is all out there in the open. golfergirl - you and I are only a couple of days apart - my nxt treatment is Tuesday.  Hope your treatment goes well. Really curious to hear about your cold caps.  Wish I had heard about them in time. Best to everyone getting the second treatment this week.  Keep us posted.  Hope it all goes well with you all! ",
      "MessageIndex": 405,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 25, 2010 11:53PM nanaof2 wrote: JennyB, I too have gained a few pounds.  We can both worry about losing it later.  Water weight tends to go up and down anyway.... Paxton, wow having a baby and dealing with this.  I am having trouble enough trying to see my ew born grandson as often as I want to.  I am thinking of you....... Well, like most everyone, I am losing my hair very quickly now. Day 15 and it is in handfuls.  I have very thick hair, but it is rapidly thinning, it is so amazing.  I find it so hard to believe.   I am wearing a scarf with my hair for the next few days then getting a buzz on Friday.  It will give me the weekend to emotionally recuperate.  Stay well everyone!",
      "MessageIndex": 440,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 30, 2010 01:59PM nanaof2 wrote: patricia48, so sorry to hear about the pain from the neulasta.  I have not had the shot yet, but everyone seems to get the pain, so I am not looking forward to it. Feel better...I too love watching those type of movies. Day, I still cannot believe what you have had to go through.  Is the new Onc. from a bigger cancer center? Leanna, good luck working this week and have a great time at Disney.  Everything Disney does is first class and fun, so I know you will enjoy it. Glad to hear about your blood work! ",
      "MessageIndex": 514,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 8, 2010 11:02AM nanaof2 wrote: Westiemom,  sorry to hear about the difficulties.  Do pray things improve.  I spent Saturday and Sunday on the couch, feeling very weak.  Wondering how I will make it till the end of August...felt if I started to cry, I wouldn't stop.  So, I didn't start.  Worked yesterday, but not up to speed.  Up early this am and feeling a lot more like I can do this. Redbarb,  you have a great attitude,  I am actually liking getting out of the shower and not having to do my hair....AND  what an amazing weekend.  You have such a great support group.  Winning the meet just caps off how great you are and how loved you are! Snipinfool, it must be so much worse when you have to deal with a ‘period'.  Being through menopause makes this easier.  It just gives me more cause to hold all of you up as heros!  Love the mohawk story, this too will be memories for you and your family - making it stronger. Leanna, so glad you are getting to put this aside for a little bit and enjoy your vacation.  Disney is such fun. Three year olds are so amazing.  My grandson is nine and I so remember all of the wonderful things he would say at that age....I loved it. NJgirl, you sound amazing, taking your 19 year old to Universal, such fun.  He'll never forget it!  Our kids went places with us well into their 20's.  Still do, just harder now, having their own families and schedules. Irishtess, you are amazing, one cancer should be enough.  I admire your strength and courage. I have taken the Zofran and have not had any nausea at all. Packjen, sorry to hear about the allergy - rash.  Do hope they figure it out, so you can stay on this path to recovery sooner. Summer38 - as I said earlier, felt like crying most of the weekend.  I think it is okay to have our dips - every so often. Cleob, way to let nothing hold you down. - you're amazing and an inspiration to all of us! Day, pray everything gets on course for you now that you have confidence in your dr. It makes all the difference. Have a great day - off to get dressed for work!",
      "MessageIndex": 608,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 27, 2010 02:01PM nanaof2 wrote: Hi Everyone, sorry I have not posted for awhile.  I actually had a chance to babysit my newest grandson, while his mom went back to work.   So, by the time I got home, I was pretty tired. Once again, I don't know how you moms do it all.  He is only 8 weeks old so there was a lot of holding and rocking.  Tomorrow back to my real job..... Latte, sorry for the late post, I do have a port and it works beautifully, but it was put in before I started.  Hope you can get one, I think it makes it easier, but it is also what I am used to doing so, who knows? Jenny, I too take the Ativan at night, it helps me sleep. Paxton, love the pictures of you and the baby! Kim, Love that hubby shaved his head too, what a guy! I'm going to use the website you sent too, thanks! You and golfergirl are ahead of us.  Best wishes for a full and  speedy recovery. NJ Girl, I know this is late, but hope all is went well with your treatment.. Sacphotomom, love the youtube video, thanks. I think you can tell, when blood levels are low, no one knows our bodies, like we do. Laura, sorry to hear about the sore throat, when is this ever enough already?  Will you need radiation too? Patricia, congrats to you for still walking, I get short of breath and lay on the couch. Day, I too got my Good Wishes scarf, and I love it.  What a wonderful organization.  It is so nice to know there are very good people in the world. Also, glad to hear you won't have to do more treatments after the chemo, other than the tamoxifen. Golfergirl, Things are winding down for you on the chemo., I am very happy for you.  You will have to let us know how the radiation goes. You will be in the fore front for most of us. Barb, sorry to hear about your feet and hands.  I haven't had that SE.  How did the treatment go? Mel, to be so close to finishing, I agree, try to stick with the regimen you started,  just listen to the dr.  too,... Jen, I get the hives too.   Rashes sporadically all over, stomach, legs, back, I have begun  to  use iodine.  It burns, but it dries it up quickly. Summer, a daughter graduating, high emotions! Leanna, thanks for the advice on the cleaning and wow; how lucky to win. Stay well everyone, have no SE this week and breeze through any of your treatments. Judy ...",
      "MessageIndex": 822,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jul 12, 2010 06:04PM nanaof2 wrote: xraygirl, everything went well.  I just got home.  I did find out I will need the neulasta shot tomorrow. Have you had that, I remember awhile back there was some talk about it, but haven't heard much lately.  I will need for my last three treatments.  I go there to get it tomorrow and for the last two, I will be able to give them to myself. sacphotomom,  do the SE ever end?  I have  found my eyes aching at night.  I am not sure if it exhaustion or just another SE.  Woke up at 4:30 this morning, hopefully will sleep tonight, but that is hard after all of the steroids. Stay well everyone.",
      "MessageIndex": 965,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Aug 3, 2010 12:40AM nanaof2 wrote: Hi Everyone,  I have tried to catch up with everything I have missed, but there are so many....so I will  tell you why I have not been able to keep in touch.  Two weeks ago I had a bleed in my eye,  called a vitreous hemorraghe.  It was totally unrelated to the chemo, but I temporarily lost my sight in my left eye.  It was scary, but I am finally able to read a little easier on the computer. I also saw my onc., he is stopping the last two chemo treatments due to some severe low blood pressure 80/37 and a rapid heart rate.  So, now I am gearing up for the radiation.  I will go to two doctors tomorrow - my radiologist for the CT and my eye doctor for a check up on how things are progressing. You have all been in my thoughts and prayers.  Hope to never be away this long again. I seriously missed reading and writing to everyone.  Hang in there, we are all so important to our families, friends and especially to each other. Judy",
      "MessageIndex": 1172,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 16, 2011 02:23AM nanaof2 wrote: Jenn, so glad you are home with your family and that your oxygen levels are up. Have a great week! I went to a bridal shower yesterday, so nice to see friends together in one place. Hard to believe but four women there have had to deal with bc personally. The wedding is in June. Saw the lung doctor on thursday, he wants me on the prednisone for two more months, I was really hoping for one, but will see how things go. Keeping all of you in my prayers. Judy",
      "MessageIndex": 2393,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 28, 2011 11:01PM nanaof2 wrote: DAy, you are a riot. Jenn, hope you are home and feeling better. I was invited to my sons home this morning for a wonderful breakfast, my husband is out of town for a few days. It is wonderful to have such a great daughter in law. Then came home foe a quiet afternoon by the pool. It was a beautiful day. Hope everyone is enjoying their weekend too! Judy",
      "MessageIndex": 2425,
      "PostDate": "28/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 2, 2011 02:13AM nanaof2 wrote: New jersey, I still have famiky there, they are frustrated with going from winter to summer - what happened to spring? Kim, I love it - the painting certainly is different, but sounds like real fun. The tattoo- well I have always wanted my husband's name tattooed on me. He had my name put on him over 38 years ago. Maybe I wiil actually do it! Leanna, the haircut came out nice. At least my hair has a little style. Still curly and a totally different color, but I'm getting used to it. Jenn, you are in my prayers, hoping the nausea lessens. Happy to hear your husband is able to get off to help you. Sending good thoughts you way, with the hopes things begin to improve for you, it is so unfair! Enjoy the rest of the week, ladies! Judy",
      "MessageIndex": 2430,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jun 8, 2011 02:00AM nanaof2 wrote: Packjen, what a beautiful family you are and how nice the girls are to cut their hair too! Cancer has stricken another friend and just as her daughter is battling breast cancer... Praying for them, hoping cures come quickly!",
      "MessageIndex": 2441,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "Jul 27, 2011 12:36AM nanaof2 wrote: It is still so hard to believe tat someone we started this journey with is gone from this horrible disease. Having lost a wonderful brother-in-law to pancreatic cancer, I know we never know what God's plan is, what someone so young with a baby to raise, it just doesn't seem fair. It doesn't feel right to be posting something happy, but my husband and I just came back from a very relaxing vacation in NC. We took our motorcycle up in the mountains. It was very nice, first time away since my diagnosis. It was great to have some time away not thinking about cancer, treatments and the radiation pneumonitis - which is finally gone. Pray everyone stays well and gets sometime to enjoy life again! Judy",
      "MessageIndex": 2493,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 23, 2011 03:04AM nanaof2 wrote: Penn, I had a tumor that never showed up on the mammogram, but it did show up on the ultrasound and the MRI. The waiting is the hardest. Hang in there, it is a very stressful time.",
      "MessageIndex": 6,
      "PostDate": "23/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769248",
      "Title": "Lump felt but did not show up in Mammo or ultrasound PennStateMac kehjj04"
    },
    {
      "AuthorID": "nanaof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101185/profile",
      "Content": "May 27, 2011 06:26PM nanaof2 wrote: From what I have heard the ultrasound tells a lot. My lump could not be detected on a mammo, but scored a 5 on the ultrasound - meaning 95 % sure it was cancer. It was I have completed my treatments. Waiting is the worst, I am actually waiting myself today for news on a ct scan. Hang I there, I'm thinking very positive for you.",
      "MessageIndex": 14,
      "PostDate": "27/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769474",
      "Title": "sick with fear beausoleil mommyrnx2"
    }
  ]
}