{
  "AuthorID": "Nancyinct",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
  "Posts": [
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Feb 18, 2014 03:11PM Nancyinct wrote: Hi Franny....thought I would chime in. I had extensive DCIS, and had a lumpectomy. The path report from that showed DCIS with 3 small foci of IDC, so 6 weeks later I had a right mastectomy with immediate reconstruction/permanent saline implant. Luckily, there was no lymph node involvement and I didn't have to have chemo or rads. I just saw my bs yesterday for my 6 month check up and everything is good! I'm triple neg so no tamoxofine for me. Good luck to you and stay positive. You'll be on the other side of this before you know it. Nancy",
      "MessageIndex": 39,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815593",
      "Title": "Thought I'd be one of the 80% FrannyM424 sweetjam"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Aug 27, 2013 10:37AM Nancyinct wrote: Hi Shira, I had a lumpectomy on June 5th and a mastectomy on July 23rd. My circumstances are a bit different than yours but I would like to add my two cents if I may. I live in Connectict and go to Smilow Cancer Center at Yale. I have had the best care I could've asked for. I would suggest to you to go to a cancer center and use doctors and staff that strictly deal with breast cancer. You really need to look at all treatment options available to you so that you can make the decision that is right for you. You need to compare the risks against the benefits to treatment options, chances for reoccurance etc. Your friends and family are going to have their own opinions of what you should do, but you need to be at peace with your choice. I know that you want this to be all behind you, but I would suggest taking a little more time to gather more information. Good luck to you and good good good thoughts and prayers are coming your way! Nancy",
      "MessageIndex": 8,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809835",
      "Title": "Just diagnosed and Lumpectomy early next week Shira CTMOM1234"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Oct 29, 2014 09:42AM Nancyinct wrote: Hi ThinkingPositive! I received my IDC dx after my mx at my first follow-up visit with my breast surgeon. They really don't know everything and therefore cannot propose the right treatment plan until the pathology report is complete. Your symptoms are normal. Your pain will come and go and change in intensity, but you will find that it is very tolerable. Tylenol worked wonders for me to take the edge off the pain that I was feeling. I had two drains which came out a week to the day after my mx. with no problems. They were just more inconvenient than anything. Your anxiety will come and go too. All very normal. You don't have to suffer through any intense pain or anxiety; that's what the meds are for. Don't be afraid to take them if it helps you get throught this difficult time. We are all here for you and will support you and answer your questions. WE can truly understand and totally relate to what you are going through.  ",
      "MessageIndex": 4,
      "PostDate": "29/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/825822",
      "Title": "Mastectomy and Sentinol Node Removal a few days ago ThinkingPositive ThinkingPositive"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Dec 31, 2013 05:43AM Nancyinct wrote: Hi There! I initially had a lumpectomy on the left and a ruduction on the right. The initial dx was DCIS but after the pathology was done I had 3 small areas of IDC as well. They did not get clear margins so back I went for a right mx. I had two surgeries in 6 weeks and I have to tell you that they the experience(s) were so much better than I feared and expected. What little pain I had was easily managed. That's not to say that there is no pain, but nothing that cannot be managed. I was only on the heavy meds for about a day and a half after my surgeries, then I only took Tylenol. During my second surgery, the mx, I had immediate reconstructions with a saline implant. Although that feels a little foreign still I am not in any pain.",
      "MessageIndex": 5,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816279",
      "Title": "DCIS - Left Mast with Recon Need to know what to expect mubadub Nancyinct"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jul 3, 2014 10:51PM Nancyinct wrote: Hi Chrissy! Thank you for starting this thread. I was dx'd with DCIS (9.3 cm) and had a lumpectomy. Pathology showed 3 areas of IDC each less than 0.1 cm. I then had a mx and SN biopsy 0/1. Pathology showed an undetected area of DCIS (1.4 cm) removed with clear but small margins (<0.1cm). No rads and no chemo due to no LN involvement and small IDC. I am tripple negative and grade 3 on all. I can't help but worry that my cancer will return somewhere else because I had no other treatment other than surgery. Can you weigh in on this?",
      "MessageIndex": 2555,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jul 3, 2014 11:42PM Nancyinct wrote: Thank you, Chrissy! After my mx I met with a radiation oncologist and medical oncologist who were both in agreement that the risks of rads to treat the newly founnd DCIS outweighed the benefits. I had a permanent implant during my mx which was another reason they didn't want to do rads. Since I am TN no Tamox either. They said that they would just watch me. I go for mammos and ultrasounds every 6 mos.",
      "MessageIndex": 2557,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jul 4, 2014 12:16AM Nancyinct wrote: Thank you once again, Chrissy. I feel that they are on top of my follow-up care but it's never bad to question and reevaluate. I find great comfort in your opinion(s). Nancy :0)",
      "MessageIndex": 2559,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 4, 2013 08:22AM Nancyinct wrote: Hi Jan...hang in there! I am sending good, positive and healthy thoughts and prayers to you. Keep busy. I have been so busy at work it keeps my mind occupied. My poor husband took the whole week off and he had too much time to think and worry yesterday. He was so upset when I got home. As hard as it is for us, who have cancer, it is so hard for our family and friends too see what we're going through. They're trying so hard to be strong for us and sometimes forget to take care of themselves. Love and peace to you and your family!!!!! We're going to be alright!!!!! I'll be checking on you........ :0)",
      "MessageIndex": 20,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Nov 4, 2013 02:21PM - edited Nov 4, 2013 02:28PM by Nancyinct",
      "MessageIndex": 5520,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Mar 31, 2014 01:52PM Nancyinct wrote: I had no symptoms at the time of my dx but one year prior I had a discharge from my breast and the year before that I had a breast infection which is what young nursing mothers get. I was 50 years old at that time. I've always had mammos every year and the next year (which was last year) I had extensive DCIS. I can't help thinking and wondering of those issues I had were precursors to this dx.",
      "MessageIndex": 16,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819541",
      "Title": "Did you have any symptoms prior to being diagnosed? Footballnut Footballnut"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "May 29, 2013 10:55AM Nancyinct wrote: Hi Sydneyluv! Thank you for this post. I am having a lumpectomy next week and am so grateful I found your post. How encouraging for me. Here you are, posting the day after your surgery. I hope mine goes as well. I am also having a reduction on the left breast, and my DCIS is quite large 9 cm. So my surgery will be longer than if I was just having the lumpectomy. Thank you again for sharing your experience, it is really helping me keep my sanity in tact for a little longer :0) Nancy",
      "MessageIndex": 1,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/804409",
      "Title": "Day after lumpectomy Sydneyluv Nancyinct"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Oct 26, 2013 05:38AM Nancyinct wrote: Hi jlarry, so sorry about your dx. I was dx'd with DCIS on April 5th and after my lumpectomy (on June 5th) the pathology showed that I had IDC as well. I ended up having to have a mastectomy six weeks later on July 23rd.  I know you are scared and waiting for test results is the hardest thing to do. It is very normal to still be sore after a biopsy. I developed a hematoma that was the size of a walnut after one of mine. You can take Tylenol to ease your pain and discomfort from the biopsy. It's hard to know what to do or think until you have the pathology report back. It's an agonizing wait, I know. Try to keep yourself busy and keep in touch with others on this discussion board. You will find a wealth of information here and women that are very very compassionate. I am happy to answer any questions that you have if I can. And if not, I am here to listen and support you. Nancy",
      "MessageIndex": 1,
      "PostDate": "26/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/813551",
      "Title": "29 and just diagnosed jlarry msphil"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "May 30, 2013 12:48PM Nancyinct wrote: Hi jstans! So happy to hear from you. Yesterday was not the greatest day for me. I was beside myself with anxiety. But, today is a new day and I am feeling better. I am still working and have been very busy today which has kept my mind occupied. I have presicriptions to fill and a list of post surgical items that I was told to get by my plastic surgeon, so I'll be doing all that this weekend. I hope you are having a good day today. Every day is different and we have the opportunity to start fresh every day. I have been thinking about you too. The thing that I've noticed is that everything that I've been afraid of relating to my bc treatment so far has not been as bad as I've feared. I am hoping that this procedure will be the same. Sending good vibes and positive thoughts to you! Nancy",
      "MessageIndex": 11,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "May 31, 2013 10:03AM Nancyinct wrote: Thank you fab1!!!!!!! I am so encouraged!!! Nancy",
      "MessageIndex": 16,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Nov 20, 2013 06:25PM Nancyinct wrote: 52.... was diagnosed on my birthday...",
      "MessageIndex": 97,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 1, 2013 03:13AM Nancyinct wrote: Hi Nyama - Similar to you, I have a DD+ cup size so I have a lot of \"extra\" tissue to work with. Luckily for me because my DCIS is 9cm long by about 2 cm. My BS offered this option to me and I am comfortable trying it. My reasoning is that even if she doesn't or cannot get clear margins, or there is an invasive component then at least I know that I tried to excape a possible unnecessary mx when I could've had a lumpectomy. Reducing the other breast made sense to me too so that it would match my other breast. My surgery is in 4 days (not counting or anything LOL) and I have moments of peace along with moments of anxiety. I was happy to read your posts. They helped me so much. (Maybe I can go back to sleep now :0) Nancy",
      "MessageIndex": 3,
      "PostDate": "01/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "May 30, 2013 02:15PM Nancyinct wrote: Hi Liz! The most important thing is that you are comfortable with your treatment plan. Everyone is so different,. You have to have a treatment plan that truly feels right for YOU. Many people who don't have cancer may give you their opinion on what they would do, or tell you what you should do but only you know what is right for you. You sound very secure with your treatment plan and that is great! Now, it's the waiting game til surgery. I'll be posting as often as I can, before and after my surgery. Although I am having a \"lumpectomy\" I have a very large area of DCIS (9cm x 2cm). Luckily I have large breasts and I can still try the lumpectomy route. I'll be having a reduction on the other side so it's just a little more complicated than a smaller lumpectomy and no reduction. Keep posting and reading and we'll get through this on step at a time. Nancy ",
      "MessageIndex": 13,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 7, 2013 02:51AM Nancyinct wrote: Jan - thank you for your prayers! I am doing well. I'm home now and thinking about you. I was with you in prayer and spirit for your surgery and I know it went well. It's time for healing now. They ended up taking 13cm of DCIS and margin from my breast. OMG! that's a lot. Hopefully they got it all. They managed my pain wonderfully at the hospital. It was a good experience. Every single person from the doctors, nurses to the people transporting me were wonderful!!!! I feel good and am in no pain right now. I've been laying down in the same position for so long, I woke up so I thought I'd post about my experience so far. I was so afraid of pain....but it never was unbearable. I hope my experience eases the minds of those with upcoming surgeries. A bonus, I have two new breasts now. I had the reduction on the other breast and they look beautiful. I can tell that I'm healing already. I can feel bruising but no pain per se.  N2travel - I will be thinking of you on Tuesday. Stay busy until then.  ((((healing prayers)))))) Nancy",
      "MessageIndex": 30,
      "PostDate": "07/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "May 29, 2013 12:26PM Nancyinct wrote: Thank you, and I will be praying for you on Thursday! ",
      "MessageIndex": 8,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 5, 2013 07:39AM Nancyinct wrote: Jan....2 pm tomorrow....I'll be there with you too!!!!! I''ll be leaving in a few minutes. I'm feeling very good and calm and peaceful. Peace and love. Nancy",
      "MessageIndex": 24,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 18, 2013 02:42PM Nancyinct wrote: Hi All! I got the path results yesterday at my post-op visit. No clean margins, and 3 small areas of IDC.....big disappointment but I'm not shocked about it. I knew going into the surgery that those things could happen. So now, I have to see my ps and learn a little about reconstruction. I'm not really keen on any reconstruction but I will listen and see what the ps has to say. Everyone around me including my bs wants me to consider reconstruction so I will \"consider\" it with an open mind. They'll be taking lymph nodes during surgery so my NEW HOPE is for negative on the LN's. Shockingly, I am doing pretty well with this new dx. I thought I would lose my mind if I heard this, but I just want to get out of this cancer treatment cycle and get on the other side of it. So step by step I re-set my sights on the next thing to get through. I am healing so well from my lumpectomy and I expect to bounce right back after the mx. I have a couple of appointments with the bs and the ps and then we'll schedule the surgery as soon as possible.",
      "MessageIndex": 36,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "May 29, 2013 10:03AM Nancyinct wrote: Hi jstans! My surgery is set for next Wednesday (June 5) I'll be having a lumpectomy (right) and a reduction on the left. I am sick to my stomach and scared to death of having this surgery. But I know it is the next step toward recovery. I am quite independent and a strong woman but since this dx I am a wreck. I don't show it on the outside, but I am a mess inside. I know this is typical. The waiting is the worst part from what I read and hear. And really, from my own bc experience so far, everything that I was afraid of (the biopsies, mri's etc.) have all been not as bad as I feared and imagined. So in my heart of hearts, I know this will be the same. The \"dread-factor\" is setting in. I dread what is about to come and looking forward to getting past that. Good luck with your upcoming surgery. You are in my prayers and I'm sending you good vibes and (((hugs)))) Keep us posted on your progress and recovery. Nancy",
      "MessageIndex": 6,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "May 31, 2013 07:39AM Nancyinct wrote: Ok, so 2 days ago I had so much anxiety I could hardly function. Today, feeling very peaceful. I don't know why, but it's a great feeling. So I'm sending (((((peace and love)))) to all my friends with upcoming surgery(s). Nancy",
      "MessageIndex": 14,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 3, 2013 11:00AM Nancyinct wrote: Thank you jakig. I do feel encouraged. I appreciate you sharing your experience. I'm keeping myself busy until the surgery on Wednesday. Nancy",
      "MessageIndex": 18,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 4, 2013 11:13AM Nancyinct wrote: Hi Jan, Ms. lunchlady61 shared this quote with me and I thought I would share it with my sisters having surgery this month......\"Your mind is a garden and your thoughts are the seeds.  You can grow flowers or you can grow weeds!!!\" I find that I have periods of calmness and periods of fear and dread. But I choose to \"grow flowers\". It's time to take this next all important step to wellness. WE CAN DO THIS!!!!!! I certainly feel all the love and prayers that you and so many people are sending to me. What time is your surgery Jan? I want to say a special prayer while you are in surgery. Nancy ",
      "MessageIndex": 22,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 11, 2013 09:51AM - edited Jun 11, 2013 09:52AM by Nancyinct Hi Everyone! Well, it's day 6 after my surgery. I am feeling great!!!!!!! I feel like a new person. Although I haven't gotten my pathology results back yet, I have a really good feeling about it. I'm lovin my new boobs. I didn't realize how cumbersome they were before. My posture is better and people think I've lost weight. I did lose a few pounds but that's all. I go to the ps today. I am wrapped up in a saran wrap type of dressing. I have hundreds of stitches, but they don't hurt and will dissolve over time. The saran wrap comes off today. Oh, I didn't mention that I didn't have to have drains put in. The bs told me it was because they were able to take out the cancer and margin in one piece. I cannot tell you how grateful I am for that. To all my sisters recovering from or going to surgery, my thoughts and prayers are with you for strength and healing.  Nancy",
      "MessageIndex": 34,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805319",
      "Title": "June 2013 Surgeries jstans purple87"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Oct 28, 2013 10:26AM Nancyinct wrote: Hi Dawn, I read your post and thought that I would chime in. I live in Connecticut as well. I had a (right) lumpectomy and reduction on the left on June 5th. The pain was perfectly managed and I only had to take the hard meds for a day or so after I got home. Tylenol managed it very well. I healed pretty quick and am doing quite well. When I got the pathology results after the first surgery, it showed that I had 3 areas of IDC in addition to the extensive DCIS and they didn't get glear margins either. So, 6 weeks later on July 23rd I had a mastectomy with immediate reconstruction. I was afraid of having a lot of pain and having another surgery so soon after the first one, but I did amazingly well, same as before, pain meds for a day after the surgery and then Tylenol. There was no lymph node involvement and I didn't have to have rads, chemo or hormone therapy. I am back to work and doing very very well. Nancy",
      "MessageIndex": 47,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 1, 2013 03:01AM Nancyinct wrote: Hi Nyama! Thank you for this most informative post. (I also read your other post to me as well :0) )  As you can see, it's 2:48am here in CT and again I can't sleep all night. I do have sleeping pills but I only take them if I truly have to. My PS gave me a list of prescriptions and post surgical things to get which I thought was great. The prescriptoins he gave me were: Percocet for pain, Keflex for infection and Zofran for nausea. He also told me to take a stool softener (Colase) three days before my surgery as the anestesia and medications usually cause constipation. He also told me to get a front closure sports bra and  to order Tegaderm patches for scar care (website:www.amazon.com, search 3M - Tagaderm Transparent Dressing with Label - 4 x 4 3/4) I will continue to post so I can share my experience(s) with anyone else thinking about this type of treatment. Thank you again. I'm sure we'll talk again soon :0) Nancy",
      "MessageIndex": 2,
      "PostDate": "01/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "Nancyinct",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179397/profile",
      "Content": "Jun 3, 2013 02:04AM Nancyinct wrote: Hy Nyama - Yes, they will be doing a wire-guided surgery. They will insert two wires prior to the surgery. I asked how painful that part would be and they said that I wouldn't feel a thing. It will be much like the biopsies that I had and they will inject lidocain into the area first. I did well with the biopsies so I am not worried about the wire guides. I still need to get a front closure bra, which are a bit hard to find. I looked over the weekend and couldn't find one. I'll try again after work today. I've read on this site that Walmart has some, so I'll try there. Thank you for your post and your wealth of information. It has helped me so much.  Nancy",
      "MessageIndex": 5,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    }
  ]
}