{
  "AuthorID": "nandy1975",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
  "Posts": [
    {
      "AuthorID": "nandy1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
      "Content": "Mar 9, 2009 11:11AM nandy1975 wrote: I was diagnosed with reynauds about 4 years ago. When i am having an attack i try to take a minute and swing my arms in a circular motion for a minute or so. It helps. Also, following my mastectomy for one month the surgeon prescribed an aspirin a day to help with circulation and i noticed i had NO symptoms of Reynauds that whole time. Perhaps you could ask your Dr if that is acceptable?",
      "MessageIndex": 8,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730237",
      "Title": "Raynaud's Disease Tracy01 Tracy01"
    },
    {
      "AuthorID": "nandy1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
      "Content": "Apr 20, 2009 05:08PM nandy1975 wrote: LADYJANE-glad to hear the vicodin worked! Kim, funny you mentioned being depressed on 2nd day. Do you think this is a SE of the taxol? I feel extremely depressed the day after tx. Obviously we have a lot to be depressed about but i feel like this is something more. My husband says i am definitely not right the next day or two and i feel like that too. I also thought maybe it was a SE of being pushed into menopause? i am only 33 so i wasn't anywhere near menopause but now my cycles have stopped, so i can only imagine what that's doing to me!",
      "MessageIndex": 2061,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "nandy1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
      "Content": "Mar 9, 2009 01:51PM nandy1975 wrote: Hi Twogirls,   I am almost 4 mos post-mastectomy. I had DIEP surgery and have found some very hard lumps on my left (cancer) side. Plastic Surgeon said it was necrotic tissue (dead fat). I had fine needle biospy same day which confirmed this. Plastics told me you can leave it if you want to or we can take it out. I am scheduled for another surgery post radiation (about september) so i am going to have it taken out then. I would push for needle biospy just to make sure.",
      "MessageIndex": 6,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730213",
      "Title": "1 year out from bilat mast - have lumps twogirls BessB"
    },
    {
      "AuthorID": "nandy1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
      "Content": "Apr 20, 2009 11:33PM nandy1975 wrote: Hi Alison, i am 33 and going through treatment now. I have 4 sons (ages 5-11) I also was diagnosed with IDC and DCIS. You can have both in the same breast. I also had many many calcifications in that breast (and none in the other) which onc felt were related to the cancer and recommended mastectomy b/c of that. I opted for double mastectomy with immediate DIEP reconstruction, although i didn't test postive for either BC gene. This is a very personal choice and one only you can make but we will all be here for you and be willing to tell you how we feel about the choices we made. I too was told i need aggressive treatment, which for me meant 4 rounds of Adriamycin/Cytoxan chemo and 12 rounds of Taxol (i have #7 on Wed). I will also need radiation when that is over and hormone therapy. Things are overwhelming for you at this point but i can tell you this: you WILL get through this. Not all at once but one doctor's visit at a tine, one treatment at a time, one day at a time. It will happen, i promise. We are here for you when you need us. Feel free to private message anytime. Nikki",
      "MessageIndex": 12,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732355",
      "Title": "just diagnosed at the age of 33 aaronali12 nandy1975"
    },
    {
      "AuthorID": "nandy1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
      "Content": "Apr 21, 2009 02:47PM nandy1975 wrote: Diane, thats wonderful news! i cant wait to say i have had my last treatment and my port is coming out! I will be curious to know how the tamoxifen is-it's my next step too.  Renrel, i have the exact same problem with the taste. Basically no taste or gross taste and its definitely worse with sugary sweet things. I feel so moody though and frustrated.  My husband made a sarcastic comment about something this AM and i just started to cry. Probably an overreaction. I feel like breaking something sometimes. Then it goes away, for some reason it hasn't occured to me until lately that maybe its chemical or hormonal. rsben70-A/C was tough. Taxol is definitely easier. How many rounds do you have to do? The only advice i can give is to see if you can get something like ativan to help you \"deal with the dread\", then take it as much as you can! Especially the day of treatment, it also helps with nausea. This is a short-term problem and there is nothing wrong as far as i am concerned with medicating yourself right through it if necessary. You can be in a chemo fog or you can be in a drug fog. I would choose the latter ;) Also, what premeds are you getting? Maybe you need to change something. For each A/C i was given premeds as follows: Emend, decadron, zofran at home the morning of and also in my infusion. Same thing on day two and three following infusion, compasine and ativan as needed. I didnt feel that the compasine worked though so used zofran a few times during the day-very constipating though so you really have to stay on top of that. Also, not sure if you are getting emend but i understand its extremely expensive (i think about $600 per round) so might not be a doctor's first choice but you might get it if you ask for it. Despite all this there were still a few times i just stayed in bed all day but overall i made it through with these drugs and just planning letting myself off the hook. Like i said-it's temporary and all things pass. I got to the point where i knew if i got treatment on Wed i would feel a lot better by Monday and basically \"normal\" on Wed again. Then i would get a week off and do it again the following Wed. Despite not feeling well i thought it helped to at least know what to expect of myself. I will be thinking about you.",
      "MessageIndex": 2074,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "nandy1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
      "Content": "Apr 21, 2009 04:33PM nandy1975 wrote:",
      "MessageIndex": 2076,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "nandy1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
      "Content": "Apr 19, 2009 09:35PM nandy1975 wrote: HI everyone, i started chemo in January 2009 as well and wish i had seen this thread! I just came across it a few days ago. It would have been great to be going through this with someone else. Anyway, i had four rounds of AC (which sucked but is over!) and now i have had 6 out of 12 weekly Taxol treatments. I have to say i have had almost no reaction to the taxol at all. The big exception so far is have been NOSE SORES! I havent seen many people mentioning them-just wondering if anyone else has had a problem with this? I am in a clinical trial and may be receiving avastin-wondering if this is causing sores? I have tried prescription bactroban but it hasnt cleared them up frankly.  I received Neulasta with AC-again no problem (i know i am very lucky)! I am sorry to hear how bad it has been for so many of you. My doctor does not give me neulasta with the taxol. My counts have been fine. I believe hydrocodone is just Vicodin? I have 6 more treatments to go! I have to have rads too but at least this phase is almost over!!",
      "MessageIndex": 2052,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "nandy1975",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73724/profile",
      "Content": "Apr 11, 2009 03:43PM nandy1975 wrote: I have had five weekly rounds of Taxol, mostly without issue. I have heard that type of reaction is possible though, which is why they are so careful with the premeds. The awful taste in the mouth has been the worst along with sores in my nose but other than that I can not complain. Hopefully you won't have this reaction every time.  ",
      "MessageIndex": 2,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/732275",
      "Title": "Taxol questions living4today living4today"
    }
  ]
}