{
  "AuthorID": "Natasha007",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
  "Posts": [
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 12, 2019 06:09PM Natasha007 wrote: trish, any update?",
      "MessageIndex": 14,
      "PostDate": "12/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870042",
      "Title": "New to all this Trishmariep Salamandra"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 6, 2019 05:14PM - edited Mar 6, 2019 08:25PM by Natasha007 Trish, I am praying for you. Waiting is it's own kind of painful torment. Praying bunches for you.",
      "MessageIndex": 13,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870042",
      "Title": "New to all this Trishmariep Salamandra"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 1, 2019 05:22PM - edited Mar 1, 2019 07:47PM by Natasha007 I just made it through a similar situation that was agonizing. I literally thought I might die of a heart attack waiting to find out. Please be encouraged that people with 4C ratings (like me) do often turn out to not be cancer. My nurse navigator was great in calming my fears and I really hope that you will have hope. I went for annual mammogram on 1/28, back for additional views on 2/6, biopsy of two masses (atypical and solid and irregular and all the scary stuff) on 2/13 and results were benign on 2/14. Sarbar22 was same, 4C was benign. Please have hope. There are lots of others on this site that post and are scared and then just stop posting. I assume they received good results and returned to normal life and forgot to post good results. Please have hope.",
      "MessageIndex": 7,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870042",
      "Title": "New to all this Trishmariep Salamandra"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 5, 2019 07:33PM Natasha007 wrote: I’m praying for you for your biopsy tomorrow, please let us know.",
      "MessageIndex": 8,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870042",
      "Title": "New to all this Trishmariep Salamandra"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Feb 27, 2019 10:17PM Natasha007 wrote: I’m praying. When will you get results?",
      "MessageIndex": 7,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870059",
      "Title": "First Mammogram and Scared OverwhelmedwithWorry GreenHarbor"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Feb 28, 2019 12:29PM Natasha007 wrote: Let us know when you have your results. Praying",
      "MessageIndex": 8,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870059",
      "Title": "First Mammogram and Scared OverwhelmedwithWorry GreenHarbor"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Feb 26, 2019 10:34PM - edited Feb 27, 2019 09:59PM by Natasha007 I just went through something very similar. I was called back for mammogram and they said I would need a biopsy on two irregular masses. I asked if it could be a cyst and she said no as it has \"no fluid\". The Dr seemed pretty convinced it would be cancer. She told me that she \"saw a surgery in my future\". She labeled it BIRAD 4C - \"high suspicion for malignancy\". I was worried sick. Literally sick, throwing up and not sleeping. I could not think of anything but this. When I bought milk, I would look at the date and think that I will be fighting cancer by then. It was all consuming. They were trying to get me an appointment with the breast surgeon before the biopsy results were back. I was certain it would be cancer. Biopsy came back benign for both spots. One was fiber something and other was a cyst. The nurse navigator later told me that my doctor was young (probably early 40s) and she was aggressive in terms of ordering biopsies and labeling them 4C. She said she felt it was better to label it 4C and have it be benign than label it 4A and have it be cancer. Nurse navigator said she gives out \"lots\" of benign results to people who are worried sick like I was and people with 4C. She said to remember that 80% of biopsies come back benign. While waiting for the results I had asked her if she felt that 80% benign applies to 4C and she said yes. I was where you are and I understand the panic you are experiencing. Please allow yourself to have some hope. Have some hope. You hold on to that 80% number and don't allow the devil to steal every bit of your hope. Pray. God hears you. Give this to God. I'm praying for you, girl. Even if you have to pray every 30 seconds then do it. Just pray for the Holy Spirit to pray for you. You don't have to pray anything else. Praying for you to be calm and have peace. 80% includes you!",
      "MessageIndex": 4,
      "PostDate": "26/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870059",
      "Title": "First Mammogram and Scared OverwhelmedwithWorry GreenHarbor"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Feb 28, 2019 05:25PM Natasha007 wrote: I'm so happy for you. Praise the Lord! You and I can now share hope with those waiting. So very thrilled for you!",
      "MessageIndex": 10,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870059",
      "Title": "First Mammogram and Scared OverwhelmedwithWorry GreenHarbor"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Apr 25, 2019 07:51PM Natasha007 wrote: G 1973 and dog mom, I will be praying for both of you as you tackle this.",
      "MessageIndex": 19,
      "PostDate": "25/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/871118",
      "Title": "I got a bad feeling about this.. DogMomRunner DogMomRunner"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 7, 2019 05:37AM Natasha007 wrote: pip, did you get results? Praying for you",
      "MessageIndex": 1,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870201",
      "Title": "What Type Of Cancer will it be pippy1963 JFL"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Feb 28, 2019 11:42AM Natasha007 wrote: Ok well now you know who's ass you have to kick. I really don't say that to lighten the situation but now you know your enemy. My best friend's niece has a website i think you should visit. http://christytibbets.simplesite.com Christy is young like you (34), with two boys and two girls and a full time job (preschool teacher). After the initial shock, she looked at her kids and said she has to kick cancer's ass and for them not to worry, because she is a big enough bitch to do it. She found out on a random Thursday this past November and had a double mastectomy on Monday. She has said that she's going to beat this and get it out of her life and she is doing it. She told her team that she wanted to go nuclear on this cancer and get rid of it once and for all. She is going at it with both barrels, take no prisoners. She is really inspirational and maybe in a few days you will get the strength to have some similar thoughts. I am sincerely sorry this is happening. I've been reading about all the dumb things people say when you tell them you have cancer and I hope this post doesn't wind up in that category. I'm writing up a prayer sheet right now for with-pity and my family will be praying big time. ",
      "MessageIndex": 13,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870090",
      "Title": "Can’t handle all the waiting wity-pity wity-pity"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 1, 2019 12:34AM - edited Mar 1, 2019 02:47AM by Natasha007 Beep7bop, I had routine mammogram and was called back. Had Ultrasound and color Doppler. They found an irregular hypoechoic mass as well as a subtle irregular hypoechoic mass. Bi-Rad 4C high suspicion for malignancy. They did a spring loaded core needle biopsy on both places, taking about 8 samples. I had not mentally prepared myself for how many times in and out would occur with the biopsy. However, I'm the biopsy was super easy, I could go in for another today and not give it a second thought. I worked myself up that it would be awful and hurt and it was so easy and didn't hurt. I didn't want to be there but it was fine. I'm a classic over thinker and I worried way too much about the pain of the biopsy. Everything was benign, both masses. My nurse navigator said 4Cs come back benign often. She said Fibroadenomas mimic cancer and it is difficult to tell. Please don't assume the worst although I know that is hard. While waiting, I made myself sick with worry. Physically throwing up and sick. Not sleeping and weeping. I imagine that's normal but after I saw the 4C I just lost all hope. Try not to if you can. Call the breast center and speak with the nurse navigator. It really helped me. I also downloaded the calm app (blue cursive) and that helped. I prayed every 30 seconds in my head. Keeping my mind on God helped. I didn't have the strength or mental/emotional capacity to say meaning prayers so I just prayed for the Holy Spirit to pray for me. That's all I could muster. I'm so sorry you are going through this. I want to give you hope that even 4C can be benign. My nurse navigator said doctors have different reasons for labeling 4C and she told me to stay off google about it. Please see if you can speak to nurse navigator.    ",
      "MessageIndex": 19,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869981",
      "Title": "Waiting for biopsy Sep745 beep7bop"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 1, 2019 10:59PM - edited Mar 1, 2019 11:00PM by Natasha007 hi there! I'm pretty useless here since I don't know. But, I'm praying for you and hoping someone with knowledge will answer.",
      "MessageIndex": 1,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870106",
      "Title": "Waiting for biopsy results from tumor and lymph nodes Imgoingtofight buffalowings"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Feb 28, 2019 09:09AM Natasha007 wrote: I’m praying for you wity. When will results come in",
      "MessageIndex": 10,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870090",
      "Title": "Can’t handle all the waiting wity-pity wity-pity"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 28, 2019 11:12PM Natasha007 wrote: praise the Lord! Thrilled for you!!",
      "MessageIndex": 3,
      "PostDate": "28/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870684",
      "Title": "Results MsRukia Natasha007"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Feb 24, 2019 12:31AM - edited Feb 24, 2019 12:37AM by Natasha007 I just went through something very similar. I was called back for mammogram and they said I would need a biopsy on two irregular masses. I asked if it could be a cyst and she said no as it has \"no fluid\". The Dr seemed pretty convinced it would be cancer. She told me that she \"saw a surgery in my future\". She labeled it BIRAD 4C - \"high suspicion for malignancy\". I was worried sick. Literally sick, throwing up and not sleeping. I could not think of anything but this. When I bought milk, I would look at the date and think that I will be fighting cancer by then. It was all consuming. They were trying to get me an appointment with the breast surgeon before the biopsy results were back. I was certain it would be cancer. Biopsy came back benign for both spots. One was fiber something and other was a cyst. The nurse navigator later told me that my doctor was young (probably early 40s) and she was aggressive in terms of ordering biopsies and labeling them 4C. She said she felt it was better to label it 4C and have it be benign than label it 4A and have it be cancer. Nurse navigator said she gives out \"lots\" of benign results to people who are worried sick like I was and people with 4C. She said to remember that 80% of biopsies come back benign. While waiting for the results I had asked her if she felt that 80% benign applies to 4C and she said yes. You asked if it looks like you have cancer just from the report and no, it doesn't. It looks like you have a mass and they need to biopsy it. I was where you are and I understand the panic you are experiencing. Please allow yourself to have some hope. Have some hope. You hold on to that 80% number and don't allow the devil to steal every bit of your hope. Pray. God hears you. Give this to God. I'm praying for you, girl. Even if you have to pray every 30 seconds then do it. Just pray for the Holy Spirit to pray for you. You don't have to pray anything else. Praying for you to be calm and have peace. 80% includes you! ",
      "MessageIndex": 6,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869998",
      "Title": "Birad score 4c...need help understanding mammo and us! Sara_smile4503 Natasha007"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Mar 6, 2019 08:12PM Natasha007 wrote: beep, praying for you for tomorrow. Let us know.",
      "MessageIndex": 25,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "Natasha007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286203/profile",
      "Content": "Apr 1, 2019 09:14PM - edited Apr 1, 2019 09:20PM by Natasha007 cecyc, I'm not much help but wanted to say to please consider that you have not been diagnosed and you may not be. You absolutely have to allow yourself to have a little hope. The odds are definitely in your favor at this point. Please consider calling your breast center and asking to speak with the nurse navigator. Your center should have one. Mine was so helpful and she gave me general information (not about my specific case) and after speaking with her, Ihad hope that I desperately needed. She also told me to download the calm app (blue cursive) and go through that several times a day. That helped. I also downloaded candy crush and made a goal to get through 20 levels a day. I also agree about Netflix. My Bi-Rad was 4C and turned out benign. Please have hope. I'm praying for you.",
      "MessageIndex": 6,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870751",
      "Title": "How do you cope? cecyc cecyc"
    }
  ]
}