{
  "AuthorID": "Natejordlee…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
  "Posts": [
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Sep 30, 2015 03:27AM Natejordlee wrote: So sorry to hear you are going through this ! As far as the biopsy itself I found it rather painless once they numb the area you just feel a little pressure. This is the scariest time with the not knowing but stay strong, sending you positive vibes for a positive outcome.",
      "MessageIndex": 1,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835374",
      "Title": "New here but am scared to death brandyb719 27heart"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 17, 2015 03:57AM Natejordlee wrote: Since you are looking for someone with a similar experience my original symptoms were non spontaneous discharge from my left nipple. I did not have the discharge in my right nipple. I do know it can me numerous things but i wold get it checked to be sure, it is scary but better to safe,also i agree with getting the fluid cultured, my doc did mammo/us and all were clear for he first 2 so a culture would have been better. I am fairly new at my diagnosis so I have little experience but I know how frustrating and scary it is. I am sure things will be fine ,keep us posted :)",
      "MessageIndex": 9,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832665",
      "Title": "Beyond Freaked Out! velvetstorm78 Jonnilynn"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Nov 7, 2015 11:43AM Natejordlee wrote: Hello All ! Day three post op and it has not been too bad at all. I was stuck in over ight because i had a little bit of excess bleeding. I was very down the week before surgery but woke up feeling much better mentally so hopefully some of you will have the same result. The only major complaint is my right leg is numb from hip to knee .. will follow up next week when i see the doc. Sending healing thoughts to thiose who have had thier surgeries and positive energy to thiose waiting xxxooo",
      "MessageIndex": 118,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Dec 15, 2015 07:24AM - edited Dec 15, 2015 07:50AM by Natejordlee Morning all !! I know my situation is a little different in that I never had drains ( think this was a big mistake) but wondering if anyone out here is dealing with seromas? I am at week 6 post op tomorrow and keep getting radiation postponed because my seroma is too big. I have it drained 6 times over 3000 ccs so far and frustrated !! I am wondering if anyone has been fiven tips or tricks to help get rid of them :) Hope everyone is well and other then this annoyance I can say I am finally feeling normal ( well the new normal) since surgery !! Update - Just got a call going in to get drains in until radiation is over... frustrating to say the least !!",
      "MessageIndex": 429,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 24, 2016 05:54PM Natejordlee wrote: Hello all ! I am a little late in responding but Tall so sorry for your loss hugss. Mominator your name says it all, thanks for remembering all of our posts and thinking of us all :) Glad you are doing well after your exchanges. Rads are going Ok for me week 3 done , 2 more left. I have some cording in my arm so I am going to PT and massage at a Cancer Rehab center we have hear and the people are incredible as they deal mostly with BC and are are also specialized in Lymphedma treatment and prevention. I hope the rest of you ladies are doing well! Lee Anne",
      "MessageIndex": 490,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Dec 20, 2015 09:28AM Natejordlee wrote: Mominator - thanks for the kind words. I got a drain and it wasn't terrible and we were able to get my radiation simulation done but Friday night , twenty minutes before my guests are due for a Christmas gathering I pulled it out :( SO Monday I got back but it didn't hurt and it was much easier to get all my things done this weekend. Glad everyone is doing well! For those on Chemo now I will keep you in my thoughts, I remember those days too well. Stay hydrated and rest but most of all enjoy your Christmas everyone !!",
      "MessageIndex": 445,
      "PostDate": "20/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 10, 2016 04:29PM Natejordlee wrote: Glad to see for the most everyone is fairing well !! Sucks on the insurance issue, being in Canada that is one thing that I haven't had to stress about and It seems unfair to have that on top of everything else. I am sure some of these amazing ladies have great advice for you. Moving on to week 2 of rads tomorrow :) Wishing you all a fabulous 2016 !!",
      "MessageIndex": 463,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Nov 1, 2015 01:12PM Natejordlee wrote: Joining you ladies with a radical left mastectomy Nov 4th birthday is Nov 9th.. worse gift ever. Finished neo chemo in sept but had pneumonia so its a little delayed. Since have IBC I can't have recon for a long while. I felt so prepared for it and really not stressed but just found out that my surgeon doesn't do drains. I admit I should have asked more questions at our appt but I was really sick and it was the lady at the mastectomy bra store who told me. I was quite surprised, I can't find anything on the internet and its so close I feel like I have no option but to go in and see what happens. Anyone heard of that ? I am usually so informed and I feel like i dropped the ball here.",
      "MessageIndex": 59,
      "PostDate": "01/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Nov 2, 2015 04:47AM Natejordlee wrote: Good Luck Miss Bee !! I too have been enjoying your posts !! I an 48 hours out and for some unknown reason have become super emotional over it.. I will chalk it up to anxiety and grab back my positive attitude ! Sendiig positive thoughts to you today ! ",
      "MessageIndex": 69,
      "PostDate": "02/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Nov 14, 2015 11:56AM Natejordlee wrote: I have been following all the posts and looks like everyone is doing fairly well. I had a fabulous first 5 days and since then not so good. My surgeon doesn't do drains and convinced me that this was actually a good thing :( I have had to go in to ER twice due to pain/swelling/leaking to have my side drained ( over 800 ccs of fluid) and I feel like I am in a lot more pain now then I was. My biggest concern is ROM. Since my surgery was a day surgery I have a book with exercises but i don't feel like i am as far as i should be. I had all nodes removed and the pain in my underarm and side hurts so much i cannot manage through the exercises. Not sure if I am over tired but just feeling a little down for the first time since this crap started. I will keep moving forward but just need to vent somewhere :)",
      "MessageIndex": 208,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Nov 2, 2015 05:43PM Natejordlee wrote: cjafarm _ that came at the right time. I have not cried since the day I was diagnosed back in May and for some reason today every time I got to talk about my surgery Wednesday I cry. I think its anxiety and debated taking the Lorazepam from when i was diagnosed, you convinced me ! Best of luck to the ladies from today and tomorrow !!",
      "MessageIndex": 78,
      "PostDate": "02/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Nov 8, 2015 03:20PM - edited Nov 8, 2015 03:21PM by Natejordlee Sugar and Spice .. sorry you have to be here but you couldn't find more support anywhere else. Its a very hard thing to process and you are allowed to be sad. I just had my left side mastectomy done Wednesday and I also can't get reconstruction for another year an half as I have radiation and herceptin left. I can say the pain has been much less them anticipated and though I cant really see the full extent yet it doesn't seem so bad. I turn 41 tomorrow and I was devastated at the loss but I can promise it probably wont be as bad as your imagination. You just go Tuesday and kick cancers ass and know you have support here. On a side note had some photos done the day before my surgery of me and \"Lefty\" and it really did help me.. its an idea :) xxoo gentle hugs",
      "MessageIndex": 131,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Dec 2, 2015 12:44PM Natejordlee wrote: Hello Ladies. It has been awhile since I wrote but I have been following all your posts and happy to see for the most part we are all doing well !! I have had a bit of a rocky road but things are looking up. I am almost 4 weeks post op, my surgeon didn't do drains and I have developed a Seroma that has been drained 5 times ( 400-800 cc's each time) so my radiation is postponed but the good news is that my pathology came back and I have what is considered a complete response to treatment ( I had Chemo before ) and there is no sign of cancer :) Since I have IBC I still need to do radiation but it is the best Christmas present ever. Stay strong ladies and for those entering Chemo , stay strong and advocate for yourselves, it is temporary and you will get through but use the boards to ask questions and vent, lean on people and accept offers to help, there will be ups and downs for sure but in the end you will all kick cancers ass !",
      "MessageIndex": 376,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 15, 2016 10:55PM Natejordlee wrote: Wow such a busy thread, it is kind of awesome. Finishing day 10 of 25 today. Phoebe58 great advice for the puffiness, I will definitely try that as my mold is very tight already! And the cabbage idea brilliant. I have a bit of redness so far but RO said to expect the worse case as we are also treating skin.. fingers crossed I can avoid it. Congrats to all those who finished and enjoy the break to those still having treatments !! Lee Anne",
      "MessageIndex": 642,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 11, 2016 10:39AM Natejordlee wrote: Jd2015 - Sucks to deal with for sure , I was 40 and was blindsided by it for sure. I see your new to the board so welcome, couldn't find a better group of women ! This is a very busy thread so I am sure there is a lot of helpful information. Sucks about the breast infection , was it from the rads? I am heading into 6 of 25 tomorrow. So far not too bad a little irritation under my breast and a little tired. I had a drain inserted mid December for a Seroma so managing that around the area is a pain Good luck to all the ladies this week !",
      "MessageIndex": 516,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 8, 2016 04:41AM Natejordlee wrote: Week one almost done here too .. so far so good.. I have a Tomo machine so my hubby and I have taken to singing the Mr Roboto song every time we go. yes we are weirdos...lol. Glad to see everyone is making it through and what a supportive thread !! KateB79 I had a mastectomy and am getting chest wall rads. Met with my RO again today for our weekly meeting and she said that she had just come back from a case review for me, biggest concern being heart but again they say its a risk/benefit game. She says at my age (41) that's the main concern but that when I beat cancer and I live long into my senior years and potentially face heart issues then its a win. I have stopped worrying about the potential risks as it seems that with every cancer treatment there is always a potential risk to face.. fingers crossed we avoid any of it !",
      "MessageIndex": 454,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 20, 2016 08:57AM Natejordlee wrote: First congrats to all of you ending this week !!! El tigre - I had never heard of the boosts either , I asked my doc and she said that it is more for people who do not have complete mastectomy's, also depends where you are, She said more common in US where she used to practice but in Canada (Ontario) where I am from we get it a little different. I get my regular dose (which is also slightly higher then in the US to chest wall, lymph nodes, skin (IBC) and i get a slightly higher dose to the collarbone lymphs because they weren't touched in surgery ( hope it helps) Ask your doc though they can explain it pretty well. All those that mentioned feeling a little more down , I too was the champion of postivity through out and the rads are getting to me and I can't figure out why. Went to see someone yesterday at our cancer center but she was useless so I am trying to journal ?? Etsna girl - i read on here Cabbage leaves seem to really help , sorry you had such a tough first treatment.WTG Shopgal. Fingers crossed you don't get sick. For all those in treatment still.. half way through the week !!! Lee Anne",
      "MessageIndex": 749,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 20, 2016 07:24PM Natejordlee wrote: Jabe _ Congrats !! Etsna I have met some great people in the waiting room and had some great conversations. I know what you mena about missing them .. strange how quick you bond when we are vulnerable and open. Lee Anne",
      "MessageIndex": 771,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 24, 2016 05:25PM Natejordlee wrote: LMN - we have the same diagnosis and my doc is from the US but now works here in Canada. She did tell me since we get a higher dose For IBC in some states they split it to twice a day. Beryl - I too am in Ottawa they are a great group over there and I am sure you will do great !Dr chang is incredible and I highly recommend her. I am currently doing rads at the general so I can use the Tomo machine but most of my treatments were are the QCH. So I had 14 of so far and noticed a blister today, luckily on the numb part. Should I be putting anything on it to prevent infection ? My creams have been great and I can ask tomorrow but wondering if anyone had been given advice on if they come up. Lee Anne",
      "MessageIndex": 858,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 5, 2016 10:49AM Natejordlee wrote: I was given the same advice as rainnyc. I had my first session today and they said deodorant doesn't matter anymore and apply my cream a few hours before ( worse case they will wipe it off but it won't have an effect). I was recommended a cream from a local mastectomy shop that alot of women recommended, Glaxol from Costco. Day one was good except my mold is a little tight on my surgery site but otherwise quick and painless. Wishing you all the best . Lee Anne",
      "MessageIndex": 410,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 19, 2016 12:52PM Natejordlee wrote: Fastest moving thread I have ever seen ..love it ! I have headaches right after and slight dizziness but by far the worst is the nausea right after and later in the evening, RO had me fill a prescription from Chemo for nausea I never used. I drink a TON of water so hydration wasn't an issue for me , she said sometimes it radiation can get to the stomach area depending on positioning etc and since I have digestive issues its even more sensitive. On the dreaming about taking your shirt off , no dreams.. I had a good laugh the other day when I walked into an appt and started to lift my top, doc laughed and stopped me as it was just an information appt, just my natural reaction now. !1 days down and 14 to go ! Good Luck All. Lee Anne",
      "MessageIndex": 707,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 3, 2016 06:39PM Natejordlee wrote: Hello Ladies ! I have my start day tomorrow. Tall N Terrific I am getting my done on a Tomo machine because its on my left side and its my chest wall. I have to travel across the city instead of using the cancer center close to home but its the standard course here apparently. I don;t have a ton of information on it except its suppose to be more accurate which reduces chance of any injury to the heart ? Best of luck ladies!",
      "MessageIndex": 392,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 13, 2016 12:16PM Natejordlee wrote: El Tigre, I did have swelling and a seroma and they will tell you of its an issue. They did tell me underarm wasn't a big deal and very common.. Good Luck. This thread moves so fast I cannot recall who started the conversation about feeling the radiation, I swear I feel flutterring primarily on my underarm side. :) Hope everyone is doing well this evening Lee Anne",
      "MessageIndex": 573,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jan 15, 2016 01:06AM Natejordlee wrote: MaggieMae123..sorry you have to be here but there is a lot of information here !! Did you have your SIM done yet :) Good luck and ask any questions the people here are very helpful. Lee Anne :)",
      "MessageIndex": 609,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Dec 2, 2015 08:03AM Natejordlee wrote: Hello Ladies ! I should be starting in January , 5 weeks ( 25 treatments). I have my CT scan scheduled for December 14th to get my mold and markings done. Wishing you all the best !",
      "MessageIndex": 95,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Dec 19, 2015 09:37AM Natejordlee wrote: Sorry you have to be here MM2221. Those shots can be hard I didn't do claritin but i do hear it works. I would see if there is a December Chemo board so you can have people going through the same thing at the same time , it really helps and look through old chemo boards they are all still pretty active .. ask questions whenever you need people here are great about sharing. Glad it went better then expected, drink lots of fluids and get your rest but most of all enjoy your Christmas !! Sending postive vibe. Lee Anne",
      "MessageIndex": 1723,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 16, 2015 04:04AM - edited Jun 16, 2015 05:07AM by Natejordlee Some people may want to check out this great list of Chemo hints .. it was a great read and very helpful,, https://community.breastcancer.org/forum/69/topic/... :) Hope everyone is feeling good today. Day 14 for me today and as I was typing and feeling pretty good, I ran my fingers through my hair ( which i mostly cut off and donated)and came out with a bunch.. so i guess it starts :)",
      "MessageIndex": 82,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 23, 2015 06:57AM Natejordlee wrote: Eaglemom - Great hair style !! DayLily15 - we are on the same cocktail (FEC-D) and I do number 2 today too !! I have my port placement this morning and then off for round 2! Hope all goes well ! Hope everyone is feeling as best they can today !",
      "MessageIndex": 145,
      "PostDate": "23/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Aug 7, 2015 04:50PM Natejordlee wrote: Well day three out of my first Taxotere .. pain from the shots has started , mouth is sore despite rinses and taste has left me .. still better then FEC so far but It is still early. No nausea is nice but being hungry and nothing tastes right sucks. Keeping my chin up and hoping everyone is doing ok. Littletatas.. i hear you , pulled over today and had a good cry just out of frustration .. sending positive gentle hugs",
      "MessageIndex": 378,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 28, 2015 04:01PM Natejordlee wrote: Hello everyone ! Have been disconnected enjoying some recovery at the cottage and went off the grid which made me realize how much I depend on this board , even if I am just reading. Had my port placed Tuesday morning and round 2 of FEC that afternoon. Used Emend this time and no nausea but I am shocked at how sore my neck, back and arms are. I assume I am holding myself in a tense position or something. Anyway today was my oldest sons prom so donned the new wig and sent him off, now everyone is gone and its some down time!! I hope you are all feeling ok and sending out support to anyone who needs an extra does today. Stay strong warriors !!",
      "MessageIndex": 207,
      "PostDate": "28/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 28, 2015 08:02PM Natejordlee wrote: Agerl - The amazing lady where i got my wig told me eyebrows usually take about another month.. hope that helps.",
      "MessageIndex": 212,
      "PostDate": "28/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jul 17, 2015 12:59AM Natejordlee wrote: Espanola _ I am not sure if your hair has started falling out yet but mine was very sore when it did. I had a very sore scalp and a few irritated follicles. Some of it felt like I had worn a tight ponytail all over and some just hurt. I think its par for the course keep an eye for folliculitis, On a side note once i buzzed it pain went away completely!Sending you positive vibes.",
      "MessageIndex": 340,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Aug 13, 2015 02:38PM Natejordlee wrote: Hey All !! DayLily15 - I am with you this has been terrible !! I wasn't given anything for pain so let me tell you I found something ! I had my treatment Aug 4, started fevers this Monday sent to ER .. neuropenia, iv fluids and iv antibiotics.. needless to say i ahve been in 3 times this week once overnight but counts are back and pain is dulling... i keep saying, 2 more, 2 more, 2 more.. in my subconcious its more like TWO MORE ????? TWO MORE????? Feel free to message me anytime as we have such a similar plan. Tamkay123 -I am doing Taxotere but same side effect, they had my feet and hands in ice gloves and shoes so the meds didnt reach the nails ( or reduce the chance) .. i assume they will d something similar for you .. good luck! Everyone hope things are going ok.. keep kicking cancer ass !!",
      "MessageIndex": 387,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 8, 2015 10:49AM Natejordlee wrote: Hi Ladies! DX May 15th , started Chemo June 2nd.. port wont be placed until the morning of my second cycle because things moved to quick... so far besides extreme fatigue and a giant cold sore things are allright... glad for the information on this site for sure !",
      "MessageIndex": 39,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jul 13, 2015 08:40PM Natejordlee wrote: Treatment three today.. after a 3 hour delay because of bad counts from Friday (which they forgot to call and tell me) we retested and all was good ! During Chemo I mentioned how sore my arm was since my port and off I was shipped to ultrasound and its a blood clot in the arm prob from the port. Now blood thinner injections to add to the mix. Wasn't the best day but its over. So to my sisters watch out for signs of blood clots they told me there are very common but I had no idea,",
      "MessageIndex": 327,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Aug 5, 2015 03:50AM Natejordlee wrote: DayLily15 - we are on the same protocol send FeC round 3 was also nightmare for me . Just had my first Tax yesterday and my first shot later today. We have come care nurses who come and show yu the first shot and then i am on my own to do it. Sucks that they don't offer you something like that :(. Good healing vibes to all !!",
      "MessageIndex": 376,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Sep 20, 2015 04:50PM Natejordlee wrote: Hello All ! Haven't posted in awhile but I have been reading everyones updates. Congrats to the ladies who are done and sending postive vibes to the ladies still going through it. Finished my last treatment last Tuesday and only 2 more injections of Neuprogen left ! I also have to get Herceptin every 3 weeks but at least no more SE's !! Meet with the surgeon this Wednesday to schedule my mastectomy ( as long as Chemo did its job). Ready for step 2 and thanks to all you amazing ladies for sharing.",
      "MessageIndex": 449,
      "PostDate": "20/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Dec 2, 2015 05:51AM Natejordlee wrote: Hey ladies its been awhile but I had to share that my pathology report came back after mastectomy and no signs of cancer left :) Complete response to treatment. Since I have IBC I have to do radiation once I recover but I am happy all the crappy Chemo side effects and pain were worth it !! Sending you all happy and healthy healing vibes, Stay Strong ladies ! Keep posting because I know we all like reading the updates.",
      "MessageIndex": 486,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 19, 2015 04:08AM Natejordlee wrote: Tamkay - Mysunshine48 is on the money. Day 15 mine started and my hairdresser warned me that I would want it shaved within 2 days and sure enough 2 days later is drove me too crazy. It really wasn't that bad and it an inevitability so make a day of it, i did lunch with my girlfriends then my 15 Y/0, my mom and my best friend came and took a turn at shaving it ( free at the hairdresser). I took it as the Chemo is working !! Sending you some posit. ",
      "MessageIndex": 107,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Aug 17, 2015 05:03PM Natejordlee wrote: Hey All Happy monday !! So this was my first round of Taxotere with Neuprogen shots and ended up with a neutropenic fever and an infection in the blood.. spent a couple nights in the hospital with IV antibiotics and now oral. I have had neutropenia every cycle and am feeling very frustrated. I eat well, walk, am careful around people ( starting to feel like a recluse), use antibacterial... not sure what else to do ! That's my rant for today .. good news is I feel great right now .. one week until #7 of 8 ...getting there !! Sending positive vibes out there !!",
      "MessageIndex": 406,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 9, 2015 07:21PM Natejordlee wrote: I too was exhausted, day 7 and finally getting my energy up! I am lucky in that insurance has allowed me to be off work or I am not sure I could muster the energy... i will send whatever energy vibes I can your way :) I went to buy a wig today as they told me by day 21 expect to be bald and of course my sons high school grad and prom will fall on days 25/26 :) I wondered if anyone had any sore spots on their scalp.. i felt itching and now had what feels like a couple sore bumps, hubby says he can't see anything but its bugging me. Hope everyone is doing OK tonight.",
      "MessageIndex": 44,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 15, 2015 09:06PM Natejordlee wrote: Hightops5280..I too was a lurker..lol.. scary to jump in and I was the same way, afraid to read something that made me second guess something but found a lot for information that has helped. Good luck tomorrow !!",
      "MessageIndex": 79,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 16, 2015 07:39AM Natejordlee wrote: KH04: i am the same, i knew it was coming but I felt a little emotional whenit started this morning. My appetite is good but taste is off and I am so glad you mentioned the eyes I was not sure if this was expected or not.. i am with you .. hope it is fast and as smooth as possible!",
      "MessageIndex": 84,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jun 17, 2015 07:59PM Natejordlee wrote: Had it with the hair everywhere so tomorrow we decided to go for the buzz. I cut 12 inches off already but I cannot stand this hair all over me. The amazing wig lady/ hairdresser will buzz me but my 15 year old daughter gets a few swipes in as per her request :) Ready for the next big step , on a side note i had not shaved my underarms and they are bare so that's a bonus :) Hope everyone finds themselves in a happy place tonight. Theycallmecommdorable- enjoy your meai and the wine !! Have a relaxing evening with your hubby!",
      "MessageIndex": 100,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Natejordlee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214773/profile",
      "Content": "Jul 13, 2015 06:00AM Natejordlee wrote: Hello All !! Heading in for round three this morning of the FEC ( last one ) then move on to the Taxotetere next cycle. Hope everyone is doing well . Lucky so far on the FEC as far as side effects besides hair and fatigue. Great information in everyones posts!!! On hair I bought a great wig and scarves and hates.. and in the end I am going out bald unless i will be in sun.. it's just too hot !! Happy Anniversary and birthday Brightside! I love the pics so i decided to share mine ( the wig i wore once to my sons grad ...lol) Pre shave ( I had cut 10 inches off already but the hair was falling out in clumps).. My cancer team .. Mom, best friend and daughter ( she shaved some of it)  The day after out picking berries ( removed hat for picture)  The sassy wig    Stay strong warriors !!  ",
      "MessageIndex": 322,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    }
  ]
}