{
  "AuthorID": "natldo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146155/profile",
  "Posts": [
    {
      "AuthorID": "natldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146155/profile",
      "Content": "Mar 3, 2012 04:57AM natldo wrote: Thank you to you both so much.I was told instead of biospsy they would remove the lumps straight away.I haven't had any other scans just an ultrasound.I was told by him that it would be tested when it was removed.He said i may have to undergo radiation after the lumps are removed.",
      "MessageIndex": 3,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783560",
      "Title": "Scared and Alone natldo Jodycat"
    },
    {
      "AuthorID": "natldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146155/profile",
      "Content": "natldo wrote: I have had an ultrasound that showed a lump in my right breast i was scheduled to have it removed in a lumpectomy 2 weeks later.In that time i got really sick with other medical problems i was hospitalised for quiet a while then i had another ultrasound that showed it had increased in size and i also had one in the left breast.So i am scheduled for surgery again.But I am really worried about how much damage this could have already done to me considering it has been left a while since detected.It was never sore before and it is now and i just feel completely shithouse.I have no family to talk to about it and I am also a mother to a 13 yr old girl,who I am trying to be positive around.I am scared and alone and would really appreciate some feedback.And also to tell everybody how brave and inspirational everyone is on here. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/783560",
      "Title": "Scared and Alone natldo Jodycat"
    }
  ]
}