{
  "AuthorID": "naturelover39",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67554/profile",
  "Posts": [
    {
      "AuthorID": "naturelover39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67554/profile",
      "Content": "naturelover39 wrote: Hello Everyone ,                  Its been a while. this place has so much love and knowledge I should be here more. I could sure use some advice and others experiences.                  Last surgery end of Aug 08 -  3 nodes taken through breast- no drain-  huge hematoma in breast- about 10-12cm.  Was healing slowly . Got convinced to do ultrasound . It now measured 2.50 cm but swelled more afterwards. Well I had alot of pain and swelling. No redness or heat.                  I saw a \"certified lyphadema therapist\" well first time I felt a little better. She said it was scar tissue and cordings , and was very gentle.                  Second visit was totally different. i was trusting and she was very rough. It hurt but I thought she knew what she was doing. My breast swelled immed aftger session. I said something and she said well maybe it would feel different. Anyway I think she was angry because of a missed session.  Don't know. All I know is my breast is swollen and it hurts. I don't know what to do..??? Is it normal to hurt during and after a session of \"healing\" ?? There was deep tissue massage and now I am scared.  Its been a couple of weeks.              Anybody have a similiar experience? Whats normal? Will it ever go back to how it was? It was finally healing. I had an MRI and thank God NED , I asked a /doc before the ultrasound because I was concerned about the pressure from it. Well it happened.  I called the Onc he said it was the trauma from the ultrasound and to see a lyph specialist , well then I did that.  the first time she was gentle and worked my neck and breast very gently. So then I trusted and she was very rough, breaking up tissue????            I am beside myself.  Also , very stressed.  My brother has been in the hospital for the last 3 weeks and I am the go to person for it all.  He was in ICU , he is stable biut across the country and needs my help...!!!!           I am sitting here in pain, no temp, no redness, just swelling.  Will it ever get better???        Thanks for reading and responding.        Many blessings and prayers of healing for everyone, Naturelover Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/749415",
      "Title": "Breast pain and swelling after ultrasound /lyph treatment naturelover39 Binney4"
    },
    {
      "AuthorID": "naturelover39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67554/profile",
      "Content": "naturelover39 wrote: This Post was deleted by naturelover39. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721596",
      "Title": "How long did your breast stay swollen? naturelover39 naturelover39"
    },
    {
      "AuthorID": "naturelover39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67554/profile",
      "Content": "naturelover39 wrote: Hi All,        Since I've gotten sick and tired of being not myself I took a risk today and lifted 2lb wieghts. I still have a hematoma/lymph in breast only. It is getting smaller but been dealing with it since Aug26th. Saw a great therapist at Mayo who did lots of massage and nothing else , but seemed to help alot. I have been continuing  the basic exercises most days. So, what does anyone think about doing some light careful weight lifting. Gotten  too weak, so I thought I would do it. Also needed to go to Dentist , do we need antibiotics first? Just had an absess so I took it. Anybody have ideas of getting stronger and healthier would be greatly appreciated. Been going through too many medical prob at the same time. thanks and Many Prayers of Healing For Everybody Naturelover Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/731135",
      "Title": "Opinions needed on weight lifting and LYmpadema ... naturelover39 LizinKS"
    },
    {
      "AuthorID": "naturelover39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67554/profile",
      "Content": "naturelover39 wrote: Hi All,    I need some advice.  Been calling out since surgery. WEll, I now have a very large , bigger than DD, other side a c . hematoma. Don't know what to do. Feeling like I shouldn't have had surgery. Also have run a low grade temp for me. normally lower than average so when I was 99.5- 100. they kept saying I was fine. Started feeling very weak. Used natural stuffas antibiotic got temp down, blood didn't show infection but this is ???????????????????? Today I have more energy but the breast is swollen, hard, used cabbage leaves. Went to a BS who said it was a very larger hematoma  that will take months to absorb. Original surgeon didn 't put in a drain . I think he should of and said he left the flow open from nodes to breast to fill in tissue because of how much he took out. Anyway, anybody been there? It hurts and looks swollen, discolored and is painful. What can I do? any ideas please? ready to throw in the towel here. Getting old quick. If this is all there is , that is not a whole lot. thanks for being there E Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/723056",
      "Title": "hematoma post surgerry- Anybody else ? naturelover39 nobleanna007"
    },
    {
      "AuthorID": "naturelover39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67554/profile",
      "Content": "naturelover39 wrote: This Post was deleted by naturelover39. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721595",
      "Title": "How long did your breast tstay swollen!!???? naturelover39 naturelover39"
    }
  ]
}