{
  "AuthorID": "naturegirl11",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192999/profile",
  "Posts": [
    {
      "AuthorID": "naturegirl11",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192999/profile",
      "Content": "naturegirl11 wrote: Hi, I discover a lump in my breast 15 months ago. I immediately went to my doctor who scheduled me for my first mammogram (she is of the belief that it is not necessary to start them at 40, disagree). Anyway, I have very dense breast tissue. Even though the lump was clearly there and all could feel it, they could not see it! It was the size and shape of an almond,  wider than tall. Diagnosed me clear. Second mammogram, could barely see on the ultrasound but radiologist felt he could do a needle biopsy if I was worried but he stated 'I feel that this is simply normal breast tissue we are feeling. I insisted on follow up even though he was inclined to call it clear and not have me back for another year. Third mammogram 6 months later, same radiologist on my request. Now they can see it, it is 3.5 cm and quite dark and very visible only on ultrasound. It has grown. Somehow I have went to a dr. of radiology saying I'm clear and fast forward 6 months I have a birad 4b based strictly on the ultrasound as they still can't see it on the mammo. Now I'm really frightened. I took it a step further and called the breast surgeon who reviewed the ultrasound. His words were \"this isn't screaming cancer to me\". But of course he wants the biopsy anyway. So, I have a question, Who is the bigger expert, the breast surgeon or the radiologist? The radiologist seemed much more concerned than the surgeon. My dilemma, do I have this biopsy done now and get the news at Christmas-time or should I wait until after the holiday? I appreciate anyone who has been through this and your thoughts and know I am praying for all of you going through this uncertainty and those who are fighting cancer. Sincere prayers for your wellness. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815516",
      "Title": "Biopsy before or after the holiday? birad 4b, scared naturegirl11 Nora5"
    },
    {
      "AuthorID": "naturegirl11",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192999/profile",
      "Content": "naturegirl11 wrote: Hi, I discover a lump in my breast 15 months ago. I immediately went to my doctor who scheduled me for my first mammogram (she is of the belief that it is not necessary to start them at 40, disagree). Anyway, I have very dense breast tissue. Even though the lump was clearly there and all could feel it, they could not see it! It was the size and shape of an almond,  wider than tall. Diagnosed me clear. Second mammogram, could barely see on the ultrasound but radiologist felt he could do a needle biopsy if I was worried but he stated 'I feel that this is simply normal breast tissue we are feeling. I insisted on follow up even though he was inclined to call it clear and not have me back for another year. Third mammogram 6 months later, same radiologist on my request. Now they can see it, it is 3.5 cm and quite dark and very visible only on ultrasound. It has grown. Somehow I have went to a dr. of radiology saying I'm clear and fast forward 6 months I have a birad 4b based strictly on the ultrasound as they still can't see it on the mammo. Now I'm really frightened. I took it a step further and called the breast surgeon who reviewed the ultrasound. His words were \"this isn't screaming cancer to me\". But of course he wants the biopsy anyway. So, I have a question, Who is the bigger expert, the breast surgeon or the radiologist? The radiologist seemed much more concerned than the surgeon. My dilemma, do I have this biopsy done now and get the news at Christmas-time or should I wait until after the holiday? I appreciate anyone who has been through this and your thoughts and know I am praying for all of you going through this uncertainty and those who are fighting cancer. Sincere prayers for your wellness. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "08/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815516",
      "Title": "Biopsy before or after the holiday? birad 4b, scared naturegirl11 Nora5"
    },
    {
      "AuthorID": "naturegirl11",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192999/profile",
      "Content": "naturegirl11 wrote: I've just been so stressed and with that stress been doing a lot of research as it seems that's all I can do to pass the time. Maybe the worse thing I could have done? Because my lump has grown really large in the past 6 months I'm very concerned and it was graded a 4b. This site has been helpful but has also scared the living daylights out of me. I have questions, not asking anyone to diagnose me, but now that I've read too much the answers might help me to be prepared for my upcoming biopsy. One radiologist told me that radiology is more of an art than a science when I reviewed my films, not very comforting.  With extremely dense breast tissue, is ultrasound a good means of detection or is it questionable, like the mammogram? Because even with this huge lump they can't see it at all on the mammogram. Would calcifications show up on a mammogram of a breast that was extremely dense? They said there was none but can I trust that? I'm thinking of my other breast and the best course in the future for evaluation. Also wondering if fibrosis of the breast present as large and only affect one breast? Just curious as to what you have read or experienced. Both breast have always been very tender, but just one is lumpy. I'm making myself sick here, got through Christmas but having a hard time mentally now that the holidays are over. I have a few more days until the biopsy.  This thing has changed since the mammogram and now there is a bump right under my nipple that wasn't there before. :( I'm praying a lot and this experience has changed me not matter how it turns out. I wish I could here from anyone who had a lump of this size (3.5cm) that still turned out to be benign. It was stable over two mammograms but then doubled in size in 6 months. I guess I'm just looking for a little hope to hold on to to get myself out of this downward spriral of stress and un-controllable worry and dread of what the future holds for me. :( My doctor is of the belief that you don't have mammograms until your 50, wish I would have had a better doctor or questioned that. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/816300",
      "Title": "Have questions for the knowledgeable, stressing out pretty badly naturegirl11 edwards750"
    }
  ]
}