{
  "AuthorID": "Naughtyboob…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268878/profile",
  "Posts": [
    {
      "AuthorID": "Naughtyboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268878/profile",
      "Content": "Feb 18, 2018 06:08AM Naughtyboobies5 wrote: Thank you Georgie1",
      "MessageIndex": 12,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862477",
      "Title": "Beyond overwhelmed with this potential Naughtyboobies5 Zukee"
    },
    {
      "AuthorID": "Naughtyboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268878/profile",
      "Content": "Feb 18, 2018 05:47AM Naughtyboobies5 wrote: thank you! How do I look for someone? This is the first time I have ever been on a message board. I’m trying very hard to keep busy. I’m so exhausted and will just start crying out of nowhere.",
      "MessageIndex": 10,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862477",
      "Title": "Beyond overwhelmed with this potential Naughtyboobies5 Zukee"
    },
    {
      "AuthorID": "Naughtyboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268878/profile",
      "Content": "Feb 15, 2018 11:34PM Naughtyboobies5 wrote: NotVeryBrave Thank you for your response. This has been so difficult, I'm overwhelmed with affect and truly so exhausted. I have told minimal people which makes it much more difficult because I feel so alone. I just want to know either way. The wait feels like forever and I truly am trying to remain realistic as opposed to catastrophic. I will definitely post my results and appreciate the support. :) Zukee I am sorry that you are going through this as well. I realize that the BIRADS is definitely not a diagnosis however there are several things in both reports that have me worried such as bilateral BIRADS 4C, in a line behind the right nipple, in a group in both breasts with additional scattered calcification, and pleomorphic microcalcifications. I will keep my fingers crossed for both of us. :) My emotions fluctuate so quickly: one minute i feel strong and fine, the next minute I feel scared to death, the next miute I feel overwhelmed with sadness, the nesxt minute I am angry. I think of my children, I think of my job, I think of how unfair this is, and I also think of all the brave woemn that have been through this.",
      "MessageIndex": 3,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862477",
      "Title": "Beyond overwhelmed with this potential Naughtyboobies5 Zukee"
    },
    {
      "AuthorID": "Naughtyboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268878/profile",
      "Content": "Feb 22, 2018 03:30AM Naughtyboobies5 wrote: Thank you so much for sharing your story Ceci, Yesterday was my Biopsy however they were only able to do one side Because I experienced what they called vagal response and my blood pressure dropped to almost 40. It was horrrible, I was sweating, and could feel myself fading. Luckily they did the most concerning side first. I meet with the surgeon tomorrow afternoon. I’m sore and feel drained as though I’ve been hit by a truck. I had all the kids stay over night at my sisters because I didn’t know how my mental status would be. I was so physically drained from what happened immediately after the procedure that I slept the rest of the day. I will post after my appointment tomorrow. Thank you for all the support.",
      "MessageIndex": 14,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862477",
      "Title": "Beyond overwhelmed with this potential Naughtyboobies5 Zukee"
    },
    {
      "AuthorID": "Naughtyboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268878/profile",
      "Content": "Feb 17, 2018 11:10PM Naughtyboobies5 wrote: Thank you ladies. I appreciate the support. I’m definitely trying to keep myself busy until Tuesday and then I will get the results on Thursday when I meet with the surgeon. I feel so exhausted. I’m also recently separated and have three kiddos plus I’m a Clinician so I manage everyone else’s emotions and struggles all day and all night and for the past two weeks I have just wanted to have a tantrum of my own and tell everyone to solve their own problems. Lol! Instead any second I’m alone I have a meltdown. Didany of you who have children tell them? My kids definitely know something is going on. And my twelve year old son is starting to get angry with me Beciase he feeIs like I’m hiding something. I really don’t want to stress them out anymore than they are.",
      "MessageIndex": 6,
      "PostDate": "17/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862477",
      "Title": "Beyond overwhelmed with this potential Naughtyboobies5 Zukee"
    }
  ]
}