{
  "AuthorID": "Naughtyboobies5",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268878/profile",
  "Posts": [{
    "AuthorID": "Naughtyboobies5",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268878/profile",
    "Content": "Naughtyboobies5 wrote: Hello I am very new to the board. I’ve never actually even been on any type of board before. I am 41 years old and had my first mammogram in January. Bad I know, I should have gone last year. My first mammogram showed concerning findings in both breasts. The report read as follows: breasts are heterogeneously dense. BIRADS C, Calcifications in the right breast mid depth on the line behind the nipple that require additional imaging. Calcifications in the left breast that require additional imaging. BIRADS 0 incomplete requires additional imaging. I had a more magnified mammogram several days later with the following results: One group of pleomorphic microcalcifications found on each side with additional scattered calcifications. Breast are heterogeneously dense BIRADS 4c. Bilateral Initially I was a little in shock and heard little of what the radiologist said when he was telling me that I needed to have a guided core needle biopsy in both breasts. The hospital only does the procedure every other Tuesday therefore I was given February. 20 as a date. Again initially took it in stride but then as days passed I began to panic and then took to the evil Google. However I have been careful to only access medical journals and Reputable sites. I’m going over the language in both of my reports there are several things that are concerning me: line behind the nipple, pleomorphic, micro as opposed to macro, Group, the 4C rating, and both breasts. I also have done several years of fertility treatments as a gestational carrier. I’m not sure if that matters. Does anyone have any real transparent feedback for me? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "14/02/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862477",
    "Title": "Beyond overwhelmed with this potential Naughtyboobies5 Zukee"
  }]
}