{
  "AuthorID": "Nautica00",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160069/profile",
  "Posts": [
    {
      "AuthorID": "Nautica00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160069/profile",
      "Content": "Nautica00 wrote: Hi, My name is Dale, and i have been browsing these message boards for a couple of days now. First off, my wife was diagnosed last week via biopsy that she had breast cancer. She has always had the BRCA 1 gene and we knew that we would have to deal with this at one point or another. She had planned from her doctors recommendation to have both breasts removed when we were done having children, well fate had another plan. I am 28 yrs old and my wife is 26. She is now 10 months pregnant with our first child and what was suppose to be the happiest point in our life has now turned into a real living nightmare. I am scared to death and trying not to have a meltdown as i write this, but i know she is too. I just have to stay strong for her. Both her grandmother and 2 aunts have been from this horrible ordeal, and now she's been thrown into it. I'm not real good on all the medical terms, but i am picking up on them quickly now that doctors visits are going to for sure be in our future for awhile. The doctors are moving fast as time is of the essence in these situations. Just yesterday she had her first dose of chemo. The doctors say they cannot run a MRI to check everything because of harm to the baby, but have done a couple of x-rays and said if they had to they would guess anywhere from stage 2 to 3. The plan we are hearing from the doctors is: give her 2 doses of chemo, give her a 1 month break to have the baby, then back on chemo for i'm not sure how long, then at some point she has to be off chemo for 6 weeks so that she can a double mastectomy, and reconstruction at the same time. I'm not really sure how all this will play out as we are both new to this having only dealt with it for about 1-1/2 weeks now. Things are moving very quickly, and i am just trying my best to be there for her. She doesn't get on the internet and search anything because lets be honest, everything you find on-line is scary to read. I have read a lot, a lot more than i wish i would have at times. I just want to try to educate myself so that when she does want to ask what i think about something i can try to explain it in easier ways than i have read. But this is not about me, I just wanted to know what everyone's thoughts were having dealt with these situations and what the doctors are telling us? Also she is having a really hard time with the soon to be loss of her hair, which they are telling us will happen in about 3 weeks. I'm sure some of you could recommend some good companies to deal with regarding wigs. She is worried that it will look fake. So i want to get her a good one if possible. I think if she cant feel good about her hair it will go a long way with how positive she stays.        Thank you all in advance, Dale Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793103",
      "Title": "My wife and the battle we didn't want to fight! Nautica00 msphil"
    },
    {
      "AuthorID": "Nautica00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160069/profile",
      "Content": "Nautica00 wrote: Hi, My name is Dale, and i have been browsing these message boards for a couple of days now. First off, my wife was diagnosed last week via biopsy that she had breast cancer. She has always had the BRCA 1 gene and we knew that we would have to deal with this at one point or another. She had planned from her doctors recommendation to have both breasts removed when we were done having children, well fate had another plan. I am 28 yrs old and my wife is 26. She is now 10 months pregnant with our first child and what was suppose to be the happiest point in our life has now turned into a real living nightmare. I am scared to death and trying not to have a meltdown as i write this, but i know she is too. I just have to stay strong for her. Both her grandmother and 2 aunts have been from this horrible ordeal, and now she's been thrown into it. I'm not real good on all the medical terms, but i am picking up on them quickly now that doctors visits are going to for sure be in our future for awhile. The doctors are moving fast as time is of the essence in these situations. Just yesterday she had her first dose of chemo. The doctors say they cannot run a MRI to check everything because of harm to the baby, but have done a couple of x-rays and said if they had to they would guess anywhere from stage 2 to 3. The plan we are hearing from the doctors is: give her 2 doses of chemo, give her a 1 month break to have the baby, then back on chemo for i'm not sure how long, then at some point she has to be off chemo for 6 weeks so that she can a double mastectomy, and reconstruction at the same time. I'm not really sure how all this will play out as we are both new to this having only dealt with it for about 1-1/2 weeks now. Things are moving very quickly, and i am just trying my best to be there for her. She doesn't get on the internet and search anything because lets be honest, everything you find on-line is scary to read. I have read a lot, a lot more than i wish i would have at times. I just want to try to educate myself so that when she does want to ask what i think about something i can try to explain it in easier ways than i have read. But this is not about me, I just wanted to know what everyone's thoughts were having dealt with these situations and what the doctors are telling us? Also she is having a really hard time with the soon to be loss of her hair, which they are telling us will happen in about 3 weeks. I'm sure some of you could recommend some good companies to deal with regarding wigs. She is worried that it will look fake. So i want to get her a good one if possible. I think if she cant feel good about her hair it will go a long way with how positive she stays.        Thank you all in advance, Dale Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793103",
      "Title": "My wife and the battle we didn't want to fight! Nautica00 msphil"
    },
    {
      "AuthorID": "Nautica00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160069/profile",
      "Content": "Sep 26, 2012 06:23AM Nautica00 wrote: Everyone, Got some great news yesterday! Me and the wife went in for her second dose of chemo yesterday morning and they measured the tumor to see if it had shrunk any. Well the first time 3 weeks ago before any treatment they said it was measuring 5 cm by 4 cm at the seven o'clock position. Yesterday when we went in after just one treatment it has already shrunk down to 1.8 cm!!!! That is more than half its size with just one treatment!! They told us that after this treatment it is possible that it will be even smaller or gone!! She will obviously still have to have surgery, but it seems the chemo is working wonders. She has started loosing hair now so that made her feel better knowing that she is getting some benefit even though her hair is thinning out very fast now. As far as the baby goes we had that checkup the day before yesterday and he is doing just fine. They said the baby is in the 66% range in weight so he will be a little above average in size. Probably weighing about 6 lbs with 1 month to go! Even though we still haven't done all the tests to find out exactly what we are dealing with we both feel much better about how well it is responding to the treatment. The doctors even seemed to be pretty ecstatic about the progress after just one treatment! ",
      "MessageIndex": 19,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793103",
      "Title": "My wife and the battle we didn't want to fight! Nautica00 msphil"
    },
    {
      "AuthorID": "Nautica00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160069/profile",
      "Content": "Nov 2, 2012 06:49AM Nautica00 wrote: Everyone, Just wanted to check back in with ya'll and give you a little update. The wife and I are doing fine and on Wednesday Oct. 24th @ 2:17pm we welcomed our first born child into the world. A 8lb 9oz, 21in long baby boy. All went well and doctors say he is as healthy as can be!!!! We only had to stay at the hospital for 2 nights. She had him vaginally so no C-section surgery thank god. She has plenty of surgery coming soon and we didn't want to add one more to the plate. Her recovery is going well it has been about a week since birth so she is still in some pain but getting better daily , and i am back at work while she is at home enjoying time with our little man. We couldn't be more excited to finally be parents, and i thank god that everything went well. Just happy that we had the opportunity to have at least one before all this cancer crap. They are going to take her ovaries sometime in the near future so she doesn't have to worry about any cancer spreading there in the future. So this looks to be our one and only child. But that's fine by me. According to the doctors she will get back on with the chemo treatment in about 2 weeks. So she has a little window to feel good and just live the normal life before we have to get back to business. I don't believe they are going to do any surgeries until after all the chemo is done if i am understanding them correctly. But anyways, just happy to have something in this world that can take her mind away from all the problems going on right now. Also, some friends and family have gotten together a benefit golf tournament for my wife to raise some funds for her upcoming medical expenses. Several people have been getting the word out about it and i actually received a call from our local paper to do a article on it. They sent a columnist to the house, and actually put our little story on the front page! Here's the article for those interested:  http://fayobserver.com/articles/2012/10/31/1211663?sac=fo.community/hopemills I am so proud of my wife for bringing us a healthy baby into the world all while dealing with this crap that life has dealt her. I can't wait until this is all behind us and we get to concentrate on just being parents and living a so called normal life. But i will settle for the positive things we have going right now, and just be happy we get to hold a little awesome child everyday! Thank you all, (proud daddy) Dale",
      "MessageIndex": 25,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793103",
      "Title": "My wife and the battle we didn't want to fight! Nautica00 msphil"
    },
    {
      "AuthorID": "Nautica00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160069/profile",
      "Content": "Sep 10, 2012 12:08PM Nautica00 wrote: Everyone, Thank you for all the kind words. We actually went in for a ultrasound on the baby today, and had a great check up! The doctors say that he is doing just fine and he is measuring at 34 weeks even though she is 33 weeks pregnant. As far as the wife goes she is doing very good with all of this. After last weeks first dose of chemo life is starting to return a little to normal. It's kind of like we have finally realized that it's happening and now it's time to handle it. She has not lost any hair yet but tomorrow will be the 1 week mark from when they gave it to her. We did ride up to a bigger city this weekend to some better wig shops than what we had locally, and she was very happy with the quality of the things we found. We have got her a wig ordered and she is not nearly as worried about losing the hair now that she knows that you honestly cannot tell with the quality of wigs these days that people are wearing them.  I'm hoping that all of her chemo treatments go this well, because as far as she can tell there have been no side affects at all. No nausea or anything. Other than a little heartburn and some tiredness, but we believe that's more the pregnancy than anything. We are trying our best to stay positive. Her sister came home to help out and all of our immediate family is pretty much in a 5 mile radius of our home anyways. She and i should have plenty of support for the battle ahead! She only has one more dose of chemo and then she will be of of it for 1 month for the baby to be born. I hate that he is coming into the world in the middle of this mess, but i try to think that it's good because that will be all she needs to make her happy and kick this craps a$$! Trying not to think about the financial side of all this, as we are both pretty young and were obviously not prepared for this financially. Thank god she does have a good insurance policy through the college that she attends, but one of our main concerns now is how can we keep this policy active if she cannot attend school. I am confident that the school will work with us, or at least i hope that they do. She only had about 3 months left and she would have been done with college and have her elementary education degree. Luckily i have a job right now that can pay all of the bills around the house, so she can concentrate on what's most important right now. As for the medical bills that we incur along the way. I don't have a clue but it will all work out i'm sure! Thanks Everyone, Dale",
      "MessageIndex": 8,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793103",
      "Title": "My wife and the battle we didn't want to fight! Nautica00 msphil"
    },
    {
      "AuthorID": "Nautica00",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160069/profile",
      "Content": "Sep 10, 2012 12:17PM Nautica00 wrote: Also, Not to say that im glad to hear from others that are/have been pregnant while dealing with this. Because nobody should have to deal with this and pregnancy. It does feel good to know that they are out there with positive stories. Every doctor we have been to so far looks at us like this is some kind of weird joke when we walk in only being 26 yrs old and pregnant. I hope that in a short while we can be one of the ones that dealt with this while pregnant and can maybe help the next person who feels like this is a 1 in a million thing. When it actuality it seems like its a little more common than we knew.  Thanks again, Dale",
      "MessageIndex": 9,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793103",
      "Title": "My wife and the battle we didn't want to fight! Nautica00 msphil"
    }
  ]
}