{
  "AuthorID": "navygirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
  "Posts": [
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Dec 10, 2009 02:58PM navygirl wrote: Oh Janis, you CRACK me up! I can only imagine how funny you are in person...CONGRATULATIONS sister...you are one amazing survivor! XOXOXO ",
      "MessageIndex": 17,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745176",
      "Title": "My five year cancerversary is this week. Fitztwins sushanna1"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 7, 2010 01:58PM navygirl wrote: ps. I meant to broach the subject of why I wasn't made aware of all this going into this, but I was met with such concern and compassion for what has transpired - that when my Onc. and staff went through all that has transpired over the last two weeks, and we discussed the current plan and where we go next -that I just never go to say \"hey, how come\". While it frustrates me that I wasn't made aware - I do think that there must be a fine line from their perspective, on how much information is too much information to give out. You want to give the patient all the info they need, but you don't want to overwhelm them either. I'm in no way defending the idea that information should be deliberately with held, I'm just thinking I wouldn't want to be the one to have the job either! ",
      "MessageIndex": 20,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/746283",
      "Title": "Dangers of AC chemo long after treatment ends navygirl Luah"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 9, 2010 07:10AM navygirl wrote: Otter and Diana...thank you both for sharing. Clearly there is more work to be done on the doctors behalf in listening to the patients! With everything that is going through our heads at the time of diagnosis, it's easy to not get all the information. There are so many aspects of treatment to consider, we need help overturning all the stones! I am so glad these boards are available for women to come to and get the benefit of our collective experiences. ",
      "MessageIndex": 25,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/746283",
      "Title": "Dangers of AC chemo long after treatment ends navygirl Luah"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 5, 2010 07:11AM navygirl wrote: Elaine, you make a very good point - and my best answer is - I don't know. I probably never will know for sure. The timing of it is what makes us suspicious that this is from the AC as opposed to a hereditary change that would have occurred anyway. I am now at the point where changes can and usually do occur. I thought it was important to speak up because until all this started I was not aware of the potential for the AC to cause problems a year and a half later. I am grateful I know about this early in the game so that I can take extra measures to keep my heart healthy. ",
      "MessageIndex": 4,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/746283",
      "Title": "Dangers of AC chemo long after treatment ends navygirl Luah"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 8, 2010 05:32PM navygirl wrote: Nancy...we'd have been screwed without the internet and this site! I wouldn't have known to ask about the OncoDX test which changed the whole treatment plan for me! ",
      "MessageIndex": 22,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/746283",
      "Title": "Dangers of AC chemo long after treatment ends navygirl Luah"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "navygirl wrote: Friends, I hesitated to put this out there because I don't want to scare someone off a treatment plan that they need. So, please take this as an individual experience being shared so that you can gather your own information and make the best decision for you. For months I have been having fatigue. Then I was having shortness of breath while exercising or doing heavy yard/housework. Finally I could not breathe just walking across the living room or talking. I went to my PCP initially who thought I might have asthma, but wanted to run some other tests \"just to be sure\". In the mean time, I called my ONC to ask if there was anything about my treatment that we should be concerned about here ~ which is when I found out that yes, AC chemotherapy can cause congestive heart failure for years after treatment is complete. Needless to say, my family and I were dumbfounded. We discussed all the hazards that were there DURING the treatment...but no where did the conversation cover the fact that this treatment could cause me problems years down the road. It's easy to find this information - if you know what you're looking for. Unfortunately, while we researched this side effects of treatment we never found or were given the information about long term effects. My ONC ran some tests and told me my heart was fine. The PCP, Pulmonologist and Cardiologist I have seen all say that it is not fine. In fact, they said the same thing: essentially I have borderline damage and a drop in my LVF. Now, while not severe enough to cause the current problem that brought me to them (we are still testing) this damage showing to my heart is indicative of having problems from having had chemotherapy. We will be watching this to track any progression I may have into congestive heart failure.  In my experience I have found that I had 3 very important things (strikes) to consider that are possible links to people who have sustained heart damage long after treatment is completed.   1. I have extensive family history of heart disease, heart attacks and strokes. While my blood pressure and heart rate were perfect and my initial muga scan showed above average performance, I most likely have a genetic factor that should have been taken into consideration. 2. Adrimyacin given concurrently with cytoxan (sp?) instead of getting one dose, then the other, is thought to be more likely to result in long term congestive heart failure. 3. AC given as a \"push\" or injection as opposed to given over a 90 minute IV drip is also considered more at risk for long term congestive heart failure.  Had I had this information up front, there would have been more discussion with my ONC on how I was getting what I was getting. I can't say after the fact that I would have done anything different, it may not have changed a thing. But my decision would have been an informed one and there would be nothing to \"what if\" now. I hope this helps future women coming here to ask the questions that I didn't and be better informed about what they are getting themselves into.   life is short, play hard Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/746283",
      "Title": "Dangers of AC chemo long after treatment ends navygirl Luah"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 5, 2010 01:47PM navygirl wrote: Thanks kmmd...part of what I found out is that the people who have immediate cardiac change (while still getting treatment) it is almost always reversible, but when the damage occurs after the treatment -sometimes years down the road, it is not reversible. Right now I'm focusing on stopping it where it is :)  Tierney, from what I read about them, the best measure of the LVF is a MUGA scan - an echo can give an estimate but the MUGA is more accurate on the flow measurement. I am getting a copy of the MUGA I had to see what that had in comparison. Echo is good for identifying thickening of the walls, blockages, flap problems etc., but for whatever reason is not as accurate on the LVF so you may not be as low as it shows. If it's possible to get a MUGA I would ask about that to compare. 40-45 is pretty low and I'd think you wouldn't be that low to start without some other issue involved, but hey - I'm no cardiologist! The information I referenced was I believe from a paper on the National Institutes of Health/National Cancer Institute (NCI) website, but I am not 100% certain. I was researching \"Adrimyacin long term effects\". I'll see if I can find it again as I read quite a few links to it.  Anacortes...I'm glad it gave you some peace of mind. That always helps too... ",
      "MessageIndex": 8,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/746283",
      "Title": "Dangers of AC chemo long after treatment ends navygirl Luah"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 7, 2010 01:45PM navygirl wrote: I think if I had not been triple positive, I probably would not have gotten the echo/muga before chemo. I had to be on herceptin which for them the protocol is check before, midway through, and after. I can't be sure what they do if you are getting chemo alone. I know I requested a copy of the MUGA today and it shows me at 65% -which while it is still within normal limits - is down from the 85% I started at. Overall, to me, it seems that the Cardiologist has a stronger criteria or expectation of what my tests should show.  From my conversations with all 3 doctors involved now, no one disagrees that the chemotherapy seems to have started a chain reaction with my immune system that they have they have not yet figured out or come to understand.  For those of you who have already gone through Chemo, or have no choice BUT to go through Chemo (as many of us don't) the one take away I'd like for you to have is know what the symptoms are for heart failure. Know what your blood pressure and Heart Rate are so you know if there is a sudden unexplainable change. We have to be more vigilant than the average joe! ",
      "MessageIndex": 18,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/746283",
      "Title": "Dangers of AC chemo long after treatment ends navygirl Luah"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 26, 2011 04:58PM navygirl wrote: I am so sorry for what you and your wife are going through - from the bottom of my heart I want to thank you for the warning. Many of us would not have known that such a difference could be made in gettting the contrast vs. regular. The fact that you thought to warn others while you are still reeling from the horrible hand you and your wife have been delt tells me what kind of person you are. I'm truly sorry for what you have to face but I send you much love and many thanks - your information may well save another persons life! ((hugs)) to you both Navy ",
      "MessageIndex": 37,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771897",
      "Title": "For mjsmom: MRI options IMPORTANT mjsdad donnabee"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 28, 2012 04:13PM navygirl wrote: Otter - you're the only one who's ever been able to crack the code on what gene expressions they look at to compile the Oncotype score. I'm actually not surprised ;) I really liked your explanantion though. Much better than any I got.  Mary71, it's always a good idea to get input from here...as you said, they know what the real deal is. My own ER was 80% PR 95% onco was 50... but I was also HER+++ and my understanding is that usually equates to a higher score. I've also had one other cancer myself, and a family history of Liver cancer, so my score wasn't a surprise to me. I was glad to have it, as they initially wanted to only do hormonal treatment since I had a bmx. I didn't necessarily WANT to do chemo, but I'd hate to have needed it and not got it. Best wishes on settling on a treatment plan, follow your gut, sometimes it's your best guide. Navy ",
      "MessageIndex": 68,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 28, 2010 09:32AM navygirl wrote: It's just ridiculous and I am sorry that you have to take the helm here to make a stink but I do think that is your best option for a quick resolution to this predicament. I wish you the best of luck in getting your wife the treatment she deserves.",
      "MessageIndex": 11,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751841",
      "Title": "Looks Like I'll Have To Take My Wife Out Of The Country Sepahunt22 CathyB"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 5, 2012 08:41PM navygirl wrote: My score was 50 and I'm 3 1/2 years out. My tx was 4 rounds of dd a/c, 12 rounds of tch, and 6mos. Of herceptin after. Currently on femara. Ditto what 10ugirl said :)",
      "MessageIndex": 12,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773658",
      "Title": "oncoType over 40-anyone a few years from diagnosis? Steff66 edwards750"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 20, 2010 12:14AM navygirl wrote: WOW is right...there is nothing about it that isn't mind boggling, but YES...you can do it! It's a whirlwind at first, but once you're into the rhythm of your treatment schedule, it will FLY by. Just keep telling yourself; there is a light at the end of the tunnel! Be gentle with yourself, rest when you need too, stay hydrated, and come here often for support. We're here for you! ",
      "MessageIndex": 6,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/755573",
      "Title": "I have cancer...It is sinking in...uuuggghhh... Ondagrow Ondagrow"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jun 11, 2010 02:36PM navygirl wrote: Ang7 and Molly...thanks for putting this up there. I was diagnosed with an \"inactive\" hernia...but I've been having increasing trouble with what feels more like a charlie horse than a bulge. It can be quite painful and incapacitating at times, the last time I moved wrong...I was in pain for 2 days -unable to sit comfortably. My family Dr. told me I needed to go back to the PS to get it looked at and maybe fixed...but the problem with that plan is, I don't trust him! He was told specifically that I choose DIEP because it could be done without taking any muscle, and he took muscle anyway. Fear of a hernia is exactly why I didn't want to do it if it meant taking any of my stomach muscles. So, who do you see about something like this if you don't want to go to the PS? Any ideas?",
      "MessageIndex": 16,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749990",
      "Title": "HERNIA OR BULGING AFTER DIEP SURGERY Mollydog carmstr835"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jun 14, 2010 09:57AM navygirl wrote: Molly, I really don't know how else to describe it? The left boob, the left side -about about 2 O'clock if you are facing me, just where the boob meets the area where my lymph nodes would be for under my arm, looks like it is literally sewed to the chest wall -which creates a large divot. It almost looks like you took an icecream scoop and scooped the area out. I imagine it's much what a larger sized lumpectomy would look like. It looks nothing like the right one. Which in turn makes it sit at a different height and slightly off center. It just looks aweful. I've been told it could be fixed the same way, but I have extensive nerve damage from that same blmx, so I have no real desire to go under the knife for anything that isn't necessary. It doesn't cause any problems, it just looks bad. I hope this helps...",
      "MessageIndex": 27,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749990",
      "Title": "HERNIA OR BULGING AFTER DIEP SURGERY Mollydog carmstr835"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jun 12, 2010 01:23PM - edited Jun 12, 2010 05:07PM by navygirl",
      "MessageIndex": 24,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749990",
      "Title": "HERNIA OR BULGING AFTER DIEP SURGERY Mollydog carmstr835"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Feb 9, 2010 03:34PM navygirl wrote: I am so regretting not getting a properly fitted sleeve. I tried the one I got after surgery but it's too small so I'm using an ace bandage to add extra support. We had 40 inches in our back lot and our driveway is about 150ft long! We did it in 2 hours sections but tonight I plan to drive my car up and down every 2 hours to pack the snow down, my arm and hand are still swollen a bit and very sore from this weekends snow. I don't know what else to do - so any tips or suggestions are welcome! I find that the snow makes great margarita's if you don't have a blender to chop ice with!",
      "MessageIndex": 5,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748075",
      "Title": "Shoveling, shoveling, and more shoveling! NatsFan tweetybird"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Feb 9, 2010 07:11PM navygirl wrote: Binney, thank you for the advice...I haven't talked to anyone about lymphedema because I didn't think I was at risk with only 2 nodes removed. This is the first I've had any trouble with it so I'm glad I came here because obviously I was going about it wrong :) I will follow your advice and if it becomes a problem again over the next 48 hours, contact my doctor for a referral. ",
      "MessageIndex": 10,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748075",
      "Title": "Shoveling, shoveling, and more shoveling! NatsFan tweetybird"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jun 12, 2010 01:21PM navygirl wrote: I found out about the hernia after I had severe pain in my belly while recovering from ooph. I then requested the surgical report and plain as day it says the muscle was used. Now I have to constantly be aware of how I move or it acts up. I really can't fathom the thought of one more surgery, let alone an abdominal one. It just makes me want to cry at the thought of it. I finally just had my ankle replaced after 2 years of putting it off for all the BC stuff...I just want to get back to being me and be done with the surgeries. My PS did a double recon on me; one side is fine but the other has a huge divot where it looks like my breast is tacked to the chest wall by my armpit. I asked about this from day one and he told me it was fine, that it would \"settle in\" after a few months. That was two years ago and its just gotten worse. Between that and using the muscle when he never told me that was a possibility, I could be happy never seeing him again. For now ill just try to live with the stomach issues, maybe one day I won't feel so burned out and ill seek out a hernia specialist. Thanks for all the tips and advice. As usual, the ladies here provide more support and information than the doctors.",
      "MessageIndex": 23,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749990",
      "Title": "HERNIA OR BULGING AFTER DIEP SURGERY Mollydog carmstr835"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jun 20, 2010 07:22AM navygirl wrote: Ang, glad all went well! I don't know why it surprises me that you have a drain, for some reason I thought that was only for recon...I hope your recovery is going well and you can get the drain out on Tuesday - take good care of yourself until then!",
      "MessageIndex": 30,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749990",
      "Title": "HERNIA OR BULGING AFTER DIEP SURGERY Mollydog carmstr835"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Feb 11, 2010 08:13AM navygirl wrote: Ladies thank you so much for the advice and links...Thankfully the swelling has gone down considerably with the exception of my fingers. I only did about 20 minutes yesterday and my arm started feeling heavy again, so I stopped right then and there - not, I'll just finish this section, I stopped. I elevated it and massaged as best as I could. My arm hurt awful when I woke up but it's not swelling, so that's a plus. I will get a LE appointment as soon as we are able to get around town. There will be no shoveling at all for me...if I can't get up the driveway, then it will have to wait or I'll have to ask the kids next door to do it! Maybe I can bribe them with a pizza or something :) I know LE is no joke so I won't risk it! ",
      "MessageIndex": 25,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748075",
      "Title": "Shoveling, shoveling, and more shoveling! NatsFan tweetybird"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 13, 2013 02:48PM navygirl wrote: scarlett...you are very ordinary here :) It's very stressful. I agree with all of the above. I was fortunate that I didn't have young kids to shield, so I calmed down with a giant glass of wine. It is perfectly ok to vent here, because we all have been on that train. I hope you are able to busy your mind with other things until those results come back. We'll all be rooting for b9 outcome!",
      "MessageIndex": 5,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801769",
      "Title": "Core Needle Biopsy tomorrow and trying not to panic scarlettm512 bearcub"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Aug 14, 2010 04:20AM navygirl wrote: luvmylab...a plan can do wonders for your nerves. I'm assuming you meant grade 3 as well; that's common when you're HER2 positive. FECK is right, no matter how you look at it! Good luck with your meeting, I hope you're off and running in no time! Keep us posted on your progress...",
      "MessageIndex": 5,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756692",
      "Title": "Got results LuvMyLab JannyM"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 23, 2009 02:44PM navygirl wrote: WTF???? I was sure it was going to be just a run of the mill Lymph node doing what it should be doing...filtering out the gunk. And there is just nothing worse than having something that they can only say \"unknown\" when you ask why...we are so programmed to think doctors always have an answer. I'm so sorry you got this latest kick right before the holidays too. Please know we are all here for you...I'll be channeling strength and courage your way as you face another round...",
      "MessageIndex": 10,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744315",
      "Title": "Horrible News re Swollen Groin Node mshalto mshalto"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Oct 11, 2009 07:30PM navygirl wrote: I'm with Katalin, I wish I had known I'd suffer permanent nerve damage from surgery and the chemo would wreak havoc on my system - for how long no one knows...it's already been a year. ",
      "MessageIndex": 53,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "May 1, 2010 04:50PM navygirl wrote: BTW...there is much information to be found here and on the web at large, please remember that while information helps us understand what's on the road ahead, each person's journey is not exactly like another's so don't let stories and statistics freak you out - I know, easier said than done!",
      "MessageIndex": 8,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752064",
      "Title": "Diagnosed yesterday. Shock. in_cognito pupfoster1"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 3, 2010 03:17PM navygirl wrote: Michelle, I have not had this issue but wanted to put my two cents in the same pot as your husbands! Yes, you should keep the appointment! The pain may be gone but that is not an all clear. It's obvious that something is going on and there is only one way to find out what it is! I wish you the best of luck, my hope is that it's something glandular and easily corrected with antibiotics or other quick treatment. Please keep us posted, we are waiting and pacing with you :)",
      "MessageIndex": 12,
      "PostDate": "03/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/748222",
      "Title": "Am i being silly? michelleb Fabulicious_Mami"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "May 1, 2010 04:45PM navygirl wrote: I'm glad you found the one place where you can just let it all out...as the other ladies said, the beginning is the scariest part of the journey. There is so much to learn, know, gather, schedule. Just remember to BREATHE. Remember there are thousands of us on this journey with you - many more ahead of you and unfortunately there will be more behind you who you in turn will comfort and educate. Welcome to our community, let us help you in any way we can on your journey... Peace and Hugs my friend..... ",
      "MessageIndex": 7,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752064",
      "Title": "Diagnosed yesterday. Shock. in_cognito pupfoster1"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 10, 2009 05:43PM navygirl wrote: Kelly you're so funny...I'm glad you're so busy! There are two songs...both of which remind me of sad times and people gone too soon...Tim McGraw with Live like you were dying...and K.T. Oslin's 80's ladies...they get me every time.",
      "MessageIndex": 32,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730432",
      "Title": "What Song Makes You Go Over The Edge? KellyC cp418"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 15, 2009 10:36AM navygirl wrote: YAY for you Janis...that's fabulous news!!!",
      "MessageIndex": 46,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737391",
      "Title": "STABLE!! Fitztwins MJLToday"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 31, 2009 08:00PM navygirl wrote: Hi prnciss...I'm sorry you got the news none of us want, but I'm really glad a) you have your mom to look to as a 22 year survivor and b) you found this site! The begining is just the craziest time with scheduling doctors, oncologists, pathology etc. Just remember - breathe deep, release. Come here as much as you want, ask anything that you want...we are here for you.",
      "MessageIndex": 1,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731732",
      "Title": "Just Diagnosed prnciss74 prnciss74"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Dec 27, 2010 06:21AM navygirl wrote: Jen...do you have an address where we can send a card?",
      "MessageIndex": 73,
      "PostDate": "27/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762218",
      "Title": "Tonya (Nine_Rugrats) is an Angel JeninMichigan kittycat"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Feb 12, 2010 02:51PM navygirl wrote: hugs babygirl...I'm sorry you got such sucky news...I know you were due for a good round! I hope you're trip down deNile gets you through -today at least...",
      "MessageIndex": 10,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Dec 27, 2010 06:21AM navygirl wrote: I hope Tonya could feel the love and hear the prayers being said on her behalf, and her families behalf, this Christmas. Tonya had so much determination, it's hard to accept that determination alone did not beat this. I pray her children know how hard she tried and how much she wanted to beat this. I hope her husband can step in and provide those children with the love and support they are going to need to get through this. ((((Tonya))))",
      "MessageIndex": 72,
      "PostDate": "27/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762218",
      "Title": "Tonya (Nine_Rugrats) is an Angel JeninMichigan kittycat"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Feb 24, 2009 06:20PM navygirl wrote: I love these pictures...don't they just make the hardest of days better ! I don't have the brain space to do the whole photobucket thing tonight (not sure if I even remember my password) but my oldest girl is my avatar...along with my cutie pie niece. Keep the pics coming ...it's great.",
      "MessageIndex": 413,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700523",
      "Title": "Your Furry Buddy JoyRebecca heatherpalmerton"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 24, 2009 01:00PM navygirl wrote: Hi Junebug, Correct...while my center treats it like and labels it chemo...it's not technically a chemo - so hair loss shouldn't be an issue although, new hair growth is typically slow for a lot of women. Most side effects are mild. I am allergic to the Herceptin but given weekly in the smaller doses (they put me on larger dose every 3 weeks after I finished my rounds of A/C and Taxol/Herceptin...) it is much more tolerable. If you do have severe side effects, talk to your doctor. There shouldn't be any reason to suffer as it can be given weekly as well. More inconvenient but better than not doing it at all...best wishes!",
      "MessageIndex": 3,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731274",
      "Title": "Herceptin treatment?? Junebug40 Misty1"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 13, 2010 11:09PM navygirl wrote: adding to my favorites, just in case I forget where I saw the thread :)",
      "MessageIndex": 4,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/755260",
      "Title": "Foggy Brain-3 Years After Chemo Treatment bluesky Joviangeldeb"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 8, 2010 05:43PM navygirl wrote: I thought it was stupid as hell and had no desire to play. I'm glad you spoke up...people should be aware that there are REAL people behind the statistics and what they were doing was just D U M B. I did notice that the only people who sent it to me were people I used to work with who probably had no idea I had even gone through Breast Cancer. If I'd known you were being bombarded with harsh replies I'd have stuck up for you in my status :)",
      "MessageIndex": 36,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746451",
      "Title": "Hiding over here while the rocks fly my way... Running_Violet kim40"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 13, 2010 11:09PM navygirl wrote: The irony of me finding this thread today; I just said to my girlfriend that I really feel like my chemo brain is getting worse! I'm 18 months out from finishing chemo, I thought it was as bad as it was going to get but these past few weeks - I am having a horrible time with remembering things, finding words, remembering what was just said to me or by me. I'm going to have to check out these links so I am more aware of what's happening and what I can do about it...it's gotten to the point where I'm finding mistakes I've made at work and that's just not something I can accept. ",
      "MessageIndex": 3,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/755260",
      "Title": "Foggy Brain-3 Years After Chemo Treatment bluesky Joviangeldeb"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Aug 19, 2010 03:54PM navygirl wrote: Baby shampoo! My stylist said my hair was just as fine as baby hair when it started coming back and told me to use that...I did and it was just as gentle as I needed it to be! I swear by it for anyone with hair coming back :)",
      "MessageIndex": 9,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/756945",
      "Title": "What shampoo to use when your hair starts growing back? cs34 suzieq60"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 2, 2009 06:55PM navygirl wrote: Oh Kathy...what an absolutely crappy deal for you at a time when you have enough to deal with. I'm so sorry you are dealing with all of this. I totally understand your not wanting to worry your parents with this, it's very sweet of you to keep them in mind at a time that's so stressful! I just posted on another thread about support groups and would they help, that I think we kind of get thrown into this by the doctors -who really have no idea what it's like to be on the receiving end of such news. It's a pretty big load to carry alone. That being said, I can give you my opinion for what it's worth and what I've experienced. Most of us do not get seen by the surgeons right away...it's not uncommon to have to wait 2-3 weeks. While it's stressful and seems like a LONG time for us, realistically as far as the cancer (if it IS cancer) is concerned, it's not a long time. I can't imagine why anyone would be telling you to just have a mastectomy a) before you even have the biopsy to determine if it's cancer and b) without any family history of it at all. Dump that doctor! Ok, maybe I'm exaggerating by dumping them -but I really don't know what they are thinking sometimes. The biopsy isn't fun...but it's not the worst thing in the world. Depending on the type they do they numb you in some fashion for it. It's painful afterwards but the first 48 hours are the worst of it. The lump could or could not be cancerous -only a biopsy will tell for sure. IF it is cancerous...the breast surgeon can make recommendations on mastectomy, lumpectomy, radiation, chemo etc. Not all lumps are cancer and not all cancers require chemo. Unfortunately, right now you are in the worst part of it all at a very bad time in your life. Fortunately, somehow you found this forum which, I have found to be a wonderful source of information, support and distraction from the mind bending stress of it all. Please, if there is anything you need, need to know or we can do...just ask. You can PM if you'd like...I and many others will be here to support you.",
      "MessageIndex": 4,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731827",
      "Title": "just feeling all alone Kathyi6re desdemona222b"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Sep 18, 2009 05:43PM navygirl wrote: Jumping on the wagon to wish Diane well...we miss her a LOT!!!",
      "MessageIndex": 30,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739945",
      "Title": "Sending Badboob67(Diane) big HUGS heatherpalmerton lovinmomma"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 7, 2009 08:53PM navygirl wrote: When I was a kid, my mother used to put twinkies in my lunch every day. For 8 years. I'm pretty sure that had something to do with it. I'm just sayin'.....",
      "MessageIndex": 36,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742933",
      "Title": "study shows chemo, radiation can cause cancer to spread Fairyfloss bluedasher"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 7, 2013 03:14PM navygirl wrote: 29, I agree with those who are telling you to follow up with the lymph node as well. It's not impossible for you to have two separate issues, and a swollen lymph node that doesn't go down, should always be biopsied. Best wishs!",
      "MessageIndex": 15,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799053",
      "Title": "I'm nervous and wondering what your thoughts are 29momoftwo MailGalUSA"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 24, 2009 05:21PM navygirl wrote: LuAnn ~ Thank you for letting us know so we don't worry, you're so thoughtful. I'm happy for everything you have going on and can't think of a better reason for you to be MIA. Best wishes for you and the family, enjoy the coming events and time with your kids!",
      "MessageIndex": 12,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733043",
      "Title": "Will be out of touch for a while LuAnnH marshakb"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Dec 30, 2010 05:47PM - edited Dec 30, 2010 06:19PM by navygirl MHP70...I was 42 when I went through chemo. I did 4 dd a/c, and 12 taxol/herceptin. I finished chemo at the end of October and my period came back in March. It also came back with a vengance!! I had an oopharectomy in April so I didn't have it long, but I did get it back. I think whether it returns or not may have something to do with how close you were to going into peri-menopause when you do the chemo. That's just my thought, I don't have any data to back that up. I hope you do get it, early menopause sucks! All those years I spent wishing I didn't have my period - and now I'd love, love, love to have it (and my hormones) back. :( ",
      "MessageIndex": 1,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762701",
      "Title": "Return of menses LtotheK slanderson"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 9, 2009 06:16PM navygirl wrote: BETTER LIVING THROUGH PHARMACEUTICALS Ambien to sleep Ativan for anxiety Dilauded or tramadol for pain  Cymbalta for the blues Lyrica for nerve pain Flexiral for your muscle spasms and of course, don't forget the stool softner. (((HUGS))) Watson...shame them into giving you what works to make it better right now ",
      "MessageIndex": 33,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743559",
      "Title": "Waah! I had a meltdown. I don't care who posts! Watson konakat"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 2, 2009 07:07PM navygirl wrote: See...this is why I should not post when I'm on pain meds...Lisa, you are right - I confused my surgeon appoitment wait time AFTER my biopsy...When I had the abnormal mamo they got the biopsy scheduled within days...I'm sorry Kathy, re-reading it does seem a bit odd that you are being referred to a surgeon BEFORE you get the biopsy...",
      "MessageIndex": 6,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731827",
      "Title": "just feeling all alone Kathyi6re desdemona222b"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 7, 2009 08:28AM navygirl wrote: Just checking in to see how you're doing Kathy... 2frogs....love the name, would love to hear the reason for it!",
      "MessageIndex": 16,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731827",
      "Title": "just feeling all alone Kathyi6re desdemona222b"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Oct 29, 2009 06:15AM navygirl wrote: I believe that cancer is a sneaky b*st*rd and there is more than one reason why some people survive it, while others dont. I'm sure there are miracle cure cases in every kind of cancer known to man but what cures one person may not cure another. Which is why it's so important to do whats right for you and right for your body. One of my \"chemo posse\" friends (a group of friends made while getting chemo) was and still is the healthiest person I know of - she bikes 80 miles a day, eats no sugar, no red meat, doesn't smoke or drink and weighs about 95lbs soaking wet. I on the other hand, need to lose more than a few pounds, love sweets, smoked for 27 years and did my fair share of binge drinking back in my younger days. Two polar opposites who met getting chemo for the same cancer -hers was worse than mine (stage wise). It's thoughtful of you to post the link so that others can be aware, but I caution people against being alarmed by the results of ANY one study. You are your own best advocate and the only one who can say what is right for you. Best wishes to all...",
      "MessageIndex": 2,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742933",
      "Title": "study shows chemo, radiation can cause cancer to spread Fairyfloss bluedasher"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Sep 3, 2009 09:27PM navygirl wrote: Thank you for doing this Heather! I was thinking of Diane last week and wondering where she'd been. A BIG SHOUT OUT followed up by a BIG HUG Diane!! I hope all is well for you and the dh!",
      "MessageIndex": 3,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739945",
      "Title": "Sending Badboob67(Diane) big HUGS heatherpalmerton lovinmomma"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 9, 2009 11:20PM navygirl wrote: my standard response \"I'm not a sir, I'm a girl with BREAST CANCER\" once followed by \"dumbass\" with a vendor I knew well who just didn't realize it was me...",
      "MessageIndex": 7,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743547",
      "Title": "Got called \"Sir\" this morning... Christine2000 americanpinay"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 8, 2010 05:17PM navygirl wrote: NatsFan, can you PM me you new onc info? I may need a new one myself after this Thursday. tks.",
      "MessageIndex": 17,
      "PostDate": "08/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/747667",
      "Title": "I love my oncologist . . . and looking for a new one NatsFan NatsFan"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Aug 24, 2010 06:21PM navygirl wrote: That is an amazing video; I pray that everyones efforts are effective in keeping the FDA from taking this drug away from all the women who rely on it. I will repost the link on my fb page as well - I hope we can get it all around the world for people to sign!!!",
      "MessageIndex": 13,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757138",
      "Title": "My son made a you tube video to help us fight!! stage4triplenegsurvivor nancyh"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 4, 2009 08:55PM navygirl wrote: I was 42...it was only my second mamogram...they had pulled me back in for my first one for a second look but then said there was nothing to worry about...I guess that depends on who is doing the worrying? The cancer was in the same spot on the films as the first thing they saw.",
      "MessageIndex": 167,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 31, 2009 11:42AM navygirl wrote: Susan, I'm going to ditto what geebung has said...don't beat yourself up - you have been very diligent. The waiting period is not unreasonable as most breast lumps found are b9. Microcalcifications are very common and by following up this time with a biopsy seems appropriate if there was any change. It's the only way to be certain. As for the biopsy itself...the stress of waiting to hear is the worst part. It's never fun, but it's a minor inconvenience considering the peace of mind you will get. Do whatever you need to in order to relax...the waiting is the worst part. I'm sending positive vibes your way and praying for positive results from your tests.",
      "MessageIndex": 3,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/728268",
      "Title": "Going for a biopsy susant dlb823"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Dec 6, 2010 07:13PM navygirl wrote: Laura, great idea! Does anyone know how we could go about it? It just breaks my heart, even more so, when children are involved. I am praying she is comfortable and surrounded by those who love her.",
      "MessageIndex": 26,
      "PostDate": "06/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761600",
      "Title": "Elizabeth Edwards jleigh Lowrider54"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 3, 2009 09:41AM navygirl wrote: Gosh Roberta, I'm so sorry you are in such a place...I'm in the same neighborhood with no real explanation of why yet...but you sound like you could use a nice vacation from it for sure. I can't get you to the Bahamas but I can give you a ((((hug)))). I hope it turns out to be something non-serious and quickly healing...my prayers will be with you!",
      "MessageIndex": 1,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731830",
      "Title": "Why so much pain?? Roberta77 shakira"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Dec 4, 2009 08:56AM navygirl wrote: These are amazing. What a wonderful gift for you and us - to be able to express it this way. It brougth tears to my eyes.",
      "MessageIndex": 26,
      "PostDate": "04/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/741584",
      "Title": "\"its not good news\" littlebird75 badger"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Oct 30, 2009 05:30PM navygirl wrote: 42",
      "MessageIndex": 316,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jun 1, 2010 08:06PM navygirl wrote: I'd say this qualifies as a good day for sure! Good for you!!!",
      "MessageIndex": 2,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/753459",
      "Title": "This is a good day thegoodfight Lisa1962"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Dec 7, 2010 07:26PM navygirl wrote: I am at a loss for words; we all knew that from her fb post and what the news was reporting, that her situation was grave, but I did not expect to log on tonight and see that she passed so soon. God speed Elisabeth, I hope Wade was there to greet you and that your family takes comfort in knowing what a truly amazing woman you were and how much you touched the lives of those who didn't have the priviledge to know you in person. RIP, Elisabeth, RIP...",
      "MessageIndex": 91,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761600",
      "Title": "Elizabeth Edwards jleigh Lowrider54"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jun 1, 2010 08:28PM navygirl wrote: Sandy...I'm sorry you had to come here...I just wanted to second the suggestion of an anxiety med if you don't have other methods of reducing your stress...you're in the worst part of it right now and the stress of knowing you have cancer, but not having all the facts and a plan - it's the worst part. Yes, even worse than the surgery/chemo etc. At least, it was for me! Once I knew the facts and could figure out what treatment plan I was comfortable with, it all moved along and my stress level came back down. I hope that you can find ways to pass the time between now and the 9th, I'll keep you in my thoughts and pray for you to get the answers you need at this next appointment. I'm glad you are getting a second opinion...best wishes for you! Let us know if there is anything we can do to help...",
      "MessageIndex": 4,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/753173",
      "Title": "More Questions sandy_2124 navygirl"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 11, 2009 08:50PM navygirl wrote:",
      "MessageIndex": 20,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730557",
      "Title": "New stage 4 here"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 28, 2010 04:51PM navygirl wrote: I agree with Dream, the most important thing you do is set an example for your kids; what you do from here on out is something they are going to remember for the rest of their lives. What you are being subjected to is bullying, plain and simple. Showing your kids how to handle a bully can make the difference between them growing up to defend the meek, be the meek or pick on the meek. Then there's what it's doing to your psyche. Like fitz said, do you really want to spend the rest of your days being treated this way? F-him! Where there is a will there is a way!!!",
      "MessageIndex": 10,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/750435",
      "Title": "Spouse that just doesn't care my3sonz cancersuks"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 3, 2009 10:58AM navygirl wrote: I so love reading your thread...it's like watching (reading) an episode of real life friends. Laughing, crying and marveling at the wonderful friendship you guys formed and held through your treatments. I am so, so sorry to read of RanD's passing. I have no doubt you will honor her in a way she deserves and remember her always. My prayers are with you as well as her family.",
      "MessageIndex": 6536,
      "PostDate": "03/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Feb 25, 2010 12:46AM navygirl wrote: Diane, you are deeply missed over on the bitch and moan thread...I pray they are keeping you comfortable and pain free. Hugs my friend, we love you!",
      "MessageIndex": 19,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748885",
      "Title": "BadBoob67 is in Hospice Now :( LuAnnH Danie"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 4, 2009 10:22PM navygirl wrote: That's the spirit girl...you are soo right, there is no point in staring at the walls here when you could be walking on the beach there. If I may make some \"hind sight\" suggestions for you... 1. have a note pad you write your questions down on...no question is dumb. Many you will get answers to here, others from your Dr.s 2. Get a copy of your pathology report...and all other tests you have done. It gives you something to refer back to when you want to look things up or remember what was said. I didn't do that and I actually FORGOT that they had told me they found something on the MRI before my bilateral...and that I had IDC and DCIS after my final pathology. WHO FORGETS THOSE THINGS? People with too much going on, that's who. 3. Don't ever be afraid to push or push back on your doctors for better answers, more options, better understanding. Some are great at it...others not so much. You have to be your own advocate and don't just do something because the Dr. said so...understand what they want you to do and why. Do you mind my asking how old you are? Will you have to work?",
      "MessageIndex": 13,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730035",
      "Title": "Going out of my mind TexasRose momo3esb"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Feb 24, 2010 07:20PM navygirl wrote: Les, I am so glad you are on here reading, and actively searching out information in books, etc. A little knowledge will go along way. I'm glad, for your wifes sake, that you have chosen to participate as opposed to withdrawing and ignoring the situation. Best wishes for you and your family, you are now a part of ours :)",
      "MessageIndex": 2,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748887",
      "Title": "A thank you, from a husband Lesinindy Sassa"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 4, 2009 09:57PM navygirl wrote: Hi Texas...I am so sorry you did not get good news ~ but I'm so glad you have your family with you now. In 3 months you will look back on this and realize the worst is behind you...the whirlwind of appointments, info gathering, figuring out all the terminology. You will find most of the answers to your questions here, or in the section explaining diagnosis and pathology. I know it's small comfort to you right now when you are just getting used to this...but you will be ok. You will get through this. You will survive. Information is power, and the more you know the better you will feel. Each appointment will give you a bit more information and a bit more power. Do not hesitate to reach out...to friends, family, the women here...we are all here to support you and answer any questions you have. Go, enjoy that vacation...I'm very jealous...I would love to walk on a sandy beach right about now!  It will be a good time to prepare mentally for the days ahead.",
      "MessageIndex": 11,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730035",
      "Title": "Going out of my mind TexasRose momo3esb"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jan 2, 2011 07:48PM - edited Jan 4, 2011 09:35AM by navygirl MDG,  I was 42 at diagnosis, ER/PR and HER2+, 1.9cm grade 3 IDC/DCIS. Initially I was told hormone therapy only (edited to add:) after Herceptin, because I opted for a bilateral (BC in both sides), that changed when my Oncotype came back at 50. I ended up doing 4x dd a/c and 12 taxol/herceptin. Chemo only came into the picture when the Oncotype score came back so high. I pray your score comes in low and you do not have to do the chemo. Best Wishes... ",
      "MessageIndex": 22,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 23, 2011 03:27PM navygirl wrote: Yan, I'm sorry for your loss. It is good that you were with her when her time came. Much love to you and the boys. ",
      "MessageIndex": 107,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Dec 10, 2009 04:12PM navygirl wrote: Bumping for those of you just starting.... A shout out to Rock, who was smart enough to put all this in one place for everyone! Thinking of you and hoping things are well ... ",
      "MessageIndex": 379,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 7, 2010 12:11PM navygirl wrote: CS...you are not crazy and you are not alone! I'm still going every 3 months after finishing treatmen a year ago in April. The week of my follow up I am noticeably on edge, have trouble sleeping etc. I hate it. I hope all goes well for you, hugs my friend :)",
      "MessageIndex": 7,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755018",
      "Title": "A venting session...the 18 wheeler. cs34 Kate33"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 1, 2009 07:05AM navygirl wrote: I'd have to say, having my ovaries out is one of the best decisions I've made and one of the best outcomes I've had. I bottomed out on my hormones about 5 weeks after surgery, and I had some very intense PMS weeks follow and this lasted about 2 months. Once everything settled down, I have been WAY more even keeled than I was with the hormones, I am still losing weight with exercising (which I was afraid would stop) and there is no worry of fibroids growing (I had them) no monthly mess or cramps (although sometimes I still get phantom cramps that last a day or so) and the hot flashes that started about the same time my hormones bottomed out in week 5, through September, have become almost nil now. I get them in the morning, and a few quick ones in the evening when I first settle into bed.  The recovery is quick...I was back in action after a few days, and the incisions are so small -you hardly notice them. As for Arimidex, the only thing I get now that I didn't get before is frequent headaches that do not respond to aspirin and such...the other issues & aches and pains were here before Arimidex and they'll be there when I'm done with it. I thought it might be the drug, but I went off of it and everything but the headaches was the same frequency and level off the drug as it was on it so i have to assume it's just the way my body is.  Best wishes. If you decide to do it I don't think you'll be disappointed in the results.  ",
      "MessageIndex": 12,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743076",
      "Title": "Remove ovaries after treatment, Yes or No? Jean09 Jean09"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Feb 24, 2009 10:03PM navygirl wrote: Steph...I love the person that you are and your heart is why I always read your posts...I can't imagine the boards without you, I was just getting used to your avatar not being the pink bra on the fence! I don't know if you'll change your mind or not...I understand if you don't. So, Thank You...for sharing, empowering, reminding, caring...you touch so many lives just by putting yourself out there. I for one, wouldn't want you any other way... God is ABLE...will always remind me of you.",
      "MessageIndex": 123,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729109",
      "Title": "I'm Done TripleNeg AliceJean"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 11, 2009 12:59AM navygirl wrote: Jin...I don't have personal experience with the cyberknife but I have talked with a couple ladies at my center who have used it and they have had exceptional responses with it. One is still alive today when many had given up on her. If it's available to you, money is not an issue, and you think it will help your mom - then GO FOR IT! Hugs and well wishes being sent your way!",
      "MessageIndex": 1,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730495",
      "Title": "Do u Think i should take her there?!!!! pls help! jinan22 LuAnnH"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 3, 2009 10:54AM navygirl wrote: anxiousmomma the Onco test doesn't relate to your other scans...as Hope said it only helps determine the likliness of your cancer returning and how beneficial chemo would be to your cancers specific makeup. You can bet stage one and have a very high score, or you could be a later stage and have a low score. At this point they are determining how effective chemo would be for you. Until I got my onco score I was not going to do any chemo because I had a dbmx and no node involement. My score came back at 50 so I did chemo. If it had been under 20 I had already decided I would not even if they suggested it. I will say a prayer for you to get a LOW score!",
      "MessageIndex": 3,
      "PostDate": "03/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736888",
      "Title": "Oncatype dx testing? Anxiousmama mich1224"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 26, 2009 03:54AM navygirl wrote: wow...good answer to that dumb remark! I can't imagine being released in 24 hours, with or without recon..that seems harsh.",
      "MessageIndex": 8,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731379",
      "Title": "How long was your Hosp stay for BLMas LynnVA NancyD"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 31, 2009 07:46PM navygirl wrote: Hey Natsfan...long time no see, I'm so happy to hear your news! I love the part about keeping it and smashing it to pieces. I never even thought about that but now I know I'll be asking for mine back too! CONGRATULATIONS!",
      "MessageIndex": 4,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731718",
      "Title": "Three cheers! Port coming out tomorrow!! NatsFan NatsFan"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Oct 24, 2009 09:11AM navygirl wrote: Lifeisbeautiful...I'm sorry you didn't get better news. It sucks, no two ways about it. You say your surgery is on the 26th, so I hope you can ask about having a sentinel node biopsy. I don't know where you are having it or if this is common practice there - but if you can, it beats the hell out of having all your nodes removed. I'm skeptical about any doctor \"looking\" to see if they are cancerous -because until the node is major compromised you can't tell. Sentinal node means injecting a chemical (I forgot what) into the nipple and tracing it's path to the first lymph node in the path that drains the lymph fluid. If the first one in the path is clear then it's a great indication that there is no lymph node involvement and you don't lose a whole group of lymph nodes which increases your chances of lymphedema. I would also ask about the OncDX testing. It's a test the helps determine who effective doing chemo therapy would be for someone with your genetic profile, tumor type, and treatment plan. There are way more in depth discussion and explanations about it on here, but this is the gist of it. A low score (roughly 15 or less) would indicate no additional benefit from doing chemo, a high score (26 and up) would indicate that you would respond to and benefit from chemo.....the grey areas inbetween are the hard ones because it's harder to determine the benefit and course of chemo. From my experience...and in my opinion, those are the two most important things missing in what you've touched on and remember from your conversations so far. I wish you the best of the worst and hope you will come here and ask as much as you need to. ",
      "MessageIndex": 7,
      "PostDate": "24/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742686",
      "Title": "Pathology Is Back - Cancer Lifeisbeautiful jenn3"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 1, 2009 12:35PM navygirl wrote: it is outpatient but they knock you out completely. I asked about doing twilight but I was told they couldn't do it. I don't remember why, but there was a reason. ",
      "MessageIndex": 16,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743076",
      "Title": "Remove ovaries after treatment, Yes or No? Jean09 Jean09"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jul 8, 2011 01:31PM navygirl wrote: CP - for what it's worth - I developed a resting heart rate of 130 and bp 180/140...compared to pre-treatment of 70bpm and 90/65 bp. They switched my AI, and it took a year for things to settle back down -but my resting is now 80 and my bp is pretty consistent at 105/70. Consider switching your AI if you don't have any other reason for this change. Best wishes for an answer and a cure!",
      "MessageIndex": 6,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771287",
      "Title": "Anyone develop cardiac issues post chemo? cp418 Pegs"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 8, 2009 08:13AM navygirl wrote: Irina, my prayers are with you. Please, while you are there, consider asking your doctor to help you find a way to get pain meds. Some companies will give you the meds if you don't have insurance and can't afford them. No one, no matter the circumstance, should have to live with the pain. God Bless you...",
      "MessageIndex": 7,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732124",
      "Title": "Need prayers Irina riverinerabbit"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "May 30, 2010 07:58PM navygirl wrote: KMP, I don't have any suggestions beyond having steroids added but I did want to offer my support. You have been through the ringer and I would totally ask my onc about putting this dose off a week for an extra rest period. If' it's not wise, your onc will tell you so, you have nothing to lose by asking. I hope you can, and if you can't, I hope this last round is easier on you that the previous ones were. (((HUGS))) ",
      "MessageIndex": 6,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753341",
      "Title": "In need of help and guidance... KMP Shelly1953"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 9, 2009 01:47AM navygirl wrote: Lovin....sending you good vibrations and saying calming prayers for you!!!",
      "MessageIndex": 6,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732150",
      "Title": "Getting scans tomorrow lovinmomma virginiamom"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 26, 2009 03:52AM navygirl wrote: I had immediate reconn so I may have been a little more sore than usual, and I stayed the first 48hours in ICU and then another 48 hours on the surgical unit. I went in on Wednesday and came home Saturday. Even though I had 3 drains in and some initial complications, I wasn't really that bad off. The pain was more soreness, although I was not able to go upstairs and sleep in my own bed for the first week. It did take a bit of time to be able to do that comfortably. I used A LOT of pillows as props. Bathing was a challenge - I used baby wipes and pan with a wash cloth for the first few weeks because of infection. No showering or bathing was allowed at first. That was probably the easiest thing to do anyway as I am not sure I would have been well enough to shower on my own within the first two weeks. Other than that, everything I wanted to do I was able to do, just at a slower pace on somethings. (sitting, standing, using the bathroom, etc.) If you could arrange to have someone stay for the first 3-5 days it would be a good idea, at leat until you get a handle on what your limits are. Good luck Lynn...",
      "MessageIndex": 6,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731379",
      "Title": "How long was your Hosp stay for BLMas LynnVA NancyD"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 22, 2010 06:05PM navygirl wrote: LMBO @ Seyla...now I feel better :)",
      "MessageIndex": 12,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761062",
      "Title": "This made me angry... Am I over-reacting? Anne068 kelben"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 23, 2010 07:37PM navygirl wrote: Otter, as always, well said. I think you've hit the nail on the head with your view. I'm sure it is frustrating for the other diseases to see how much \"awareness\" and attention BC gets, when the others are just as devastating to those who have them. I'm glad we've opened this discussion, I don't harbor the resentment towards the chosen words anymore, and that's always nice ;)",
      "MessageIndex": 17,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761062",
      "Title": "This made me angry... Am I over-reacting? Anne068 kelben"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 22, 2010 05:11PM navygirl wrote: Anne - it wasn't \"her\" post...I don't remember which of my friends posted it, but I know it's one of the viral status posts going around. Madalyn and Patmom, thanks for your perspectives. I, of course, know the F/U wasn't appropriate that's why I didnt' actually say it - but I do think the way this particular \"awareness\" post was written was not very well thought out, to say the least. October is also infant and pregnancy loss month and having just lost a premature baby in my family, I'm aware of it now -but I wasn't before. There's lots of causes that have their campaigns...so I was particularly annoyed at how they said \"it isn't pink, or sexy. It doesn't involve boobs, football players or cute t-shirts\". That part was unnecessary to make the point, if the point was to raise awareness.",
      "MessageIndex": 9,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761062",
      "Title": "This made me angry... Am I over-reacting? Anne068 kelben"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Nov 22, 2010 12:49PM navygirl wrote: Anne - I saw the same thing posted on my page, and I gotta tell you, it pissed me off too! I didn't know what to say to it, except that I also thought F**CK YOU! I'm glad I'm not the only one who thought it was a condescending AND minimized the BC awareness. Now just thinking about it, I'm ticked all over again - they could have made thier point without making it sound like we have it easy because pink is everywhere and everyone loves boobs -so we don't have it that bad! BITE ME B*TCH, I'd rather check my insulin that check my tumor markers, but I'd rather check my tumor markers than have my leg amputated from the effects of diabetes - so neither of these disease are anything to make light of! My uncle also died of complications from diabetes, so I know it's not glamerous or easy -but I would never minimize his struggle to try and promote awareness for mine. I thought that post was completely wrong, insensitive, and a pathetic way to draw attention to your cause!!! In fact, I think I'll respond with just that later tonight when I log on :)",
      "MessageIndex": 2,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761062",
      "Title": "This made me angry... Am I over-reacting? Anne068 kelben"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Apr 10, 2009 03:51AM navygirl wrote: We are with you today Irina, praying for a safe trip and that you are able to speak with someone who can help you with the pain.",
      "MessageIndex": 20,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732124",
      "Title": "Need prayers Irina riverinerabbit"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Mar 23, 2010 05:48PM navygirl wrote: To be the devils advocate; I had my first mamo at 41, was called back for a second look and maybe ultrasound. They took the pictures and said, never mind..we don't need an ultrasound, you're fine. I skipped on out of there and never gave it a second thought. Until I found a lump less than a year later. And had a mamo, and ultra sound, a core needle biopsy, a double mastectomy and 2 rounds of chemotherapy and herceptin. My point is...don't settle for a second set of mamograms, push for the ultrasound. When my breast surgeon held my two mamo films side by side the lump was the exact same spot as the first time they saw something and called me to come back. Either they didn't see it on the second one...or they didn't say anything because they thought it was nothing. I, not knowing any better at the time, trusted them when they said not to worry. I know better now, I hope yours IS nothing...but I also want to make sure if it's not, that you don't find out the hard way. Keeping my fingers crossed for you!",
      "MessageIndex": 4,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750191",
      "Title": "really worried itsmevalerie Fidelia"
    },
    {
      "AuthorID": "navygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78618/profile",
      "Content": "Jun 21, 2010 08:08PM navygirl wrote: I know of at least one other person who also has fibromyalgia on these boards. Personally, I've had issues with chronic inflammation - infections and rashes. When I finished chemo I had huge issues with joint and muscle pain. The only time it eased up was when I was put back on steroids for an issue that came up with my heart. They ran extensive tests and came up with some things that pointed towards lupus -but then somethings that didn't confirm it. I saw 5 doctors and the best they could come up with was \"it's something auto-immune but we can't put a name to it\". I'd like an answer, but since it doesn't look like I'm going to get one I'm just working around it as best as I can. ",
      "MessageIndex": 4,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    }
  ]
}