{
  "AuthorID": "Nbb1032",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103144/profile",
  "Posts": [
    {
      "AuthorID": "Nbb1032",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103144/profile",
      "Content": "Aug 4, 2011 09:15AM Nbb1032 wrote: Hi Everyone,  Just a special note to wish everyone well for their August 2011 surgeries.  Today is the one year anniversary of my BMX/w TE.  I had my exchange surgery in Nov 2010 and am doing well.  I was very lucky.    I was the one who started the August 2010 Mastectomy thread and I know the support system really helped me and everyone to cope with the diagnosis and surgery. I wish you all a speedy recovery and a special thank you to blondelawyer who started this thread for all of you.   Good luck everyone!  It is much better on the other side! Nancy",
      "MessageIndex": 48,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Nbb1032",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103144/profile",
      "Content": "Jun 16, 2010 11:59AM Nbb1032 wrote: I am 60 and just diagnosed.  Hotsya, you CAN get a copy of your 1st mammo.  It is your right under the law to request your medical records.  I have all of mine and keep them current with each test.  BarbaraJo50, just came from genetic testing - was neg for BRCA 1 and 2.  But, just because those genes were negative, there are plenty more out there that have not been discovered yet.  My dad had it twice, my aunt on my dad's side and my sister last year.",
      "MessageIndex": 498,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Nbb1032",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103144/profile",
      "Content": "Jun 13, 2010 01:42PM Nbb1032 wrote: Hi Everyone, New to this thread.  Just diagnosed 5/12/10 and already having pain in armpit after a single lymph node biopsy two weeks ago.  Also, my sister had a bilat w/immed implants last year and is still in pain!  I need to schedule my surgery ASAP so the question is this:  Has anyone recently had their surgery using th paravertebral block that you all were talking about.  And if so, did you have immediate reconstruction?  I really want to avoid the nerve pain that you are all experiencing (or at least minimize it)   Thanks for your imput!",
      "MessageIndex": 445,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    }
  ]
}