{
  "AuthorID": "nbeck",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
  "Posts": [
    {
      "AuthorID": "nbeck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
      "Content": "Mar 2, 2015 03:10PM nbeck wrote: I think the reasoning on not doing an immediate MRI is probably not because they just don't want to... I think that without either 1. a diagnosis, 2. \"something\" showing up on mammo/ultrasound, or 3. being seen as \"high risk\" it is very hard to get insurance approval for an MRI... my breast surgeon just referred me to a high risk clinic for this very reason. My mammo/ultrasound looked ok but they were able to refer me to high risk clinic in the oncology department due to very strong family history, bloody nipple discharge, and a mass.... he calls it \"jumping the insurance hurdles\". So there could still be avenues they could take to get you one.... it might just take time.... My first appointment was in January and I still have one to go before the MRI will even be scheduled.",
      "MessageIndex": 3,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828954",
      "Title": "Can u say Frustrated libra79 libra79"
    },
    {
      "AuthorID": "nbeck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
      "Content": "Mar 2, 2015 07:16PM nbeck wrote: If you aren't being seen in a high risk clinic it sounds like you would have every right to be referred to one!! My breast surgeon said it is much easier for the high risk BS to get approval on MRI testing... hope that helps!",
      "MessageIndex": 5,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828954",
      "Title": "Can u say Frustrated libra79 libra79"
    },
    {
      "AuthorID": "nbeck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
      "Content": "Mar 2, 2015 07:37PM nbeck wrote: Best of luck tomorrow!!! Sending good vibes your way!",
      "MessageIndex": 7,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828954",
      "Title": "Can u say Frustrated libra79 libra79"
    },
    {
      "AuthorID": "nbeck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
      "Content": "Jun 24, 2015 03:54PM nbeck wrote: Hi there, I'm kinda in the same boat with you. I've been seeing a breast care center for several months due to bloody discharge and breast changes. From my understanding of what my breast surgeon told me, if they can locate the duct that is bleeding they always take it out. Due to a combination of things, 1. to make SURE it's not cancer (a very VERY small percentage are) 2. because bloody discharge is disarming to most, 3. because of an ever so slight increased risk of cancer occurring down the road in that location. So if they can pinpoint the location they do a duct excision. In my case they have been unable to locate the problem area. Nothing shows on imaging and my discharge is spontaneous only and unable to be expressed. Which means if they don't see anything on imaging in 2 months (they are actually hoping to see something to pinpoint the problem area) I will have all of the ducts behind my nipple removed. So having a excision done doesn't mean that there is any more concern, it's just what they do in cases of bloody discharge. From the studies that I have looked into the fact that it can be expressed is a good thing and almost always a papilloma. Sorry, kinda long winded, just have learned a lot about this lately and wanted to share. :) Best of luck!!!",
      "MessageIndex": 9,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832781",
      "Title": "Need opinions/advice STAT! Kojono79 awb"
    },
    {
      "AuthorID": "nbeck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
      "Content": "Mar 1, 2015 10:17PM nbeck wrote: Thanks for your response! The breast surgeon really emphasized catching something early if/when it would happen. The cancer in my family tends to happen young and has had a habit of being caught too late unfortunately... Probably part of the slight panic that seemed to be going on at first... they were making me appointments left and right, high risk clinic, MRI, genetic counselor.... All I could think was \"if my mom had screening half this good she would probably still be alive\"... she was told by a small town hospital that her cancer was \"just a cyst\" for over a year.... by the time she decided to go to the big city breast center that I got sent to they took one look at her, said \"you have inflammatory breast cancer\" and come to find out she had 2 different cancers and was a stage 3b at that point. My next appointment is not until March 12 but I will update after that.",
      "MessageIndex": 3,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829001",
      "Title": "Anyone have a good mammogram/ ultrasound but bad MRI?? nbeck annika12"
    },
    {
      "AuthorID": "nbeck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
      "Content": "nbeck wrote: I am 29 with an extremely strong family history of very young breast cancer. I have noticed breast changes for months (indentation, bloody discharge, lump) all in the left breast but was breastfeeding at the time so just kinda blew it off until the beginning of this year when I started getting a lot of pain through that breast and my left armpit. Was sent to a breast surgeon and got a VERY thorough, mammogram/ultrasound. Was thinking I would be given the all clear and sent on my way... WRONG. I have been referred to the high risk breast clinic in the oncology department, after seeing the high risk clinic I will be sent for am MRI, (apparently it is easier to get insurance approval if you're being seen as high risk) and they kept telling me over and over that even with a \"good\" mammogram and ultrasound that at least 20% of cancers can't be seen on mammo and ultrasound, and due to extremely dense breasts that it was just too hard for them to see anything. It sounds like in my near future I can expect being a high risk patient, an MRI, a good possibility of a biopsy of the mass I have now (2cmx2.5cm) and if that all turns out good I will have yearly screening here on out with alternating screening MRI's. SO now that I have rambled on and on... 1. with the fact that even 80% of biopsies are benign, and 2. only 20% of cancers can't be seen on mammo/ultrasound... is there really many people out there that had a perfectly normal mammo/ultrasound and ended up diagnosed with breast cancer??? I mean.... my family history always HAS worried me.... but the way they were talking it was like they were preparing me for finding the worst on the MRI when I was thinking \"no big deal, everything looks good.\" Would just love to hear if anyone had good screening to go on and find they had breast cancer. Thanks in advance!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829001",
      "Title": "Anyone have a good mammogram/ ultrasound but bad MRI?? nbeck annika12"
    },
    {
      "AuthorID": "nbeck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
      "Content": "Mar 1, 2015 04:32PM nbeck wrote: Oh I forgot to throw in that they did see some dilated ducts and slightly swollen lymph nodes on ultrasound... but that all could still be from breastfeeding...",
      "MessageIndex": 1,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829001",
      "Title": "Anyone have a good mammogram/ ultrasound but bad MRI?? nbeck annika12"
    },
    {
      "AuthorID": "nbeck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211602/profile",
      "Content": "Mar 2, 2015 01:23AM nbeck wrote: Those are the kind of things that I need to hear to at least get me to take the time to take care of myself for once... I work at a dialysis unit, have 4 kids, and with mom gone I kinda overtook the roll of \"head lady\" of the whole family. I tend to worry about everyone else and hate to waste time on myself, so when they started scheduling all these appointments it just kinda shocked me. I expected to get the same kinda dismissal that I got from the small town hospital here and got totally opposite. At the same time I do feel a kind of deep relaxation now, I feel like they are going to be very vigilant for me and I wont have to worry about the \"what if\" it happens, and \"will I catch it early enough\". They said when I go in for the MRI if I WANT a biopsy they would go ahead and do one.... after hearing your story I think I will be cautious and request one!! Thank you!",
      "MessageIndex": 6,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829001",
      "Title": "Anyone have a good mammogram/ ultrasound but bad MRI?? nbeck annika12"
    }
  ]
}