{
  "AuthorID": "NBee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272840/profile",
  "Posts": [
    {
      "AuthorID": "NBee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272840/profile",
      "Content": "Apr 21, 2018 11:58AM NBee wrote: Hello! 35 years old. Stage 3 inflammatory breast cancer 6/13/2016 at age 33, chemo then double mastectomy in 2016. Radiation and remission @ stage 2, and reconstruction in July 2017. Then Stage 4 inflammatory breast cancer in August 2017 with Mets to bones, almost weekly chemotherapy ever since",
      "MessageIndex": 529,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "NBee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272840/profile",
      "Content": "NBee wrote: I have stage 4 inflammatory breast cancer with metastasis to the bones and lung. I've recently been told that I have pleural effusion. My left lung was full of fluid, I was having horrible pain in my left shoulder (referred pain from my lung, they said). They drained the fluid and placed a pleural catheter in my left lung so I can drain when I need to, which has been once a week lately. After they drained my lung and changed my meds I started feeling much better. They said that the fluid that came from my lung was full of cancer, so I'm assuming that means I have malignant pleural effusion. I've looked online at the prognosis for this and it scares me! Has anyone else had pleural effusion? What have your experiences been like? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870217",
      "Title": "Has anyone had pleural effusion? NBee NewGardener"
    },
    {
      "AuthorID": "NBee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272840/profile",
      "Content": "NBee wrote: My old life insurance company I used to have (Texas Life) for me and my husband, through my old job, dropped me last year shortly after I let them know what was going on with me medically. See, I was apparently behind on two payments, which was strange because payments had always automatically been deducted from my payroll through the school system I worked for. Well, for a couple of months, for some reason that I don't understand and that's not my fault, my life insurance payments weren't taken out. And nobody with payroll or H.R. notified me. I didn't know until I received a letter from Texas Life stating that I was behind in the payments. At the time that I received that letter, I had just recently been told that my cancer had come back and was stage 4 now, and I had had to start weekly chemotherapy, which is rough for me. I contacted the insurance company and told them that I had no idea why the payments hadn't been taken out and I mailed them checks to pay the amount that I owed. Texas Life then mailed me a letter stating that I needed to fill out a form stating my current health/medical report....right after the cancer came back and I'd been diagnosed with stage 4. I filled out the paperwork, turned it in, and they dropped me. Now I'm going to have to try to find life insurance through another company, I guess, but who is going to accept me with my medical diagnosis? It's so frustrating. So, I was wondering, does anyone know of any life insurance companies that would accept people like me, a person with stage 4 inflammatory breast cancer (a rare and aggressive form of breast cancer, unfortunately)? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864171",
      "Title": "Need info on life insurance for people w/stage 4 cancer NBee NBee"
    },
    {
      "AuthorID": "NBee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272840/profile",
      "Content": "Apr 25, 2018 04:43PM NBee wrote: DivineMrsM and SusanR, thank you so much for this information! I've got so much stuff I need to look into and paperwork to do, while not feeling well, I can't even imagine trying to find and consult with a lawyer over my old insurance policy too. I wonder if they were counting on that? Oh well. I think I will just try to get coverage through these companies you guys have suggested. It sounds like a better deal than no life insurance at all. Thanks again for your help!",
      "MessageIndex": 4,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864171",
      "Title": "Need info on life insurance for people w/stage 4 cancer NBee NBee"
    }
  ]
}