{
  "AuthorID": "ne0n",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
  "Posts": [
    {
      "AuthorID": "ne0n",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
      "Content": "Nov 17, 2018 06:45PM ne0n wrote: I can't diagnose you, but it sounds a lot like my fibrocystic breast symptoms. I have lumps and 'ropey' tissue in one of my breasts. It's scary and terrible, but I'm told it's benign. I hope you can stay calm for a couple weeks until you can see your doctor.",
      "MessageIndex": 1,
      "PostDate": "17/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/868323",
      "Title": "Cord like feeling in my breast with a couple lumps Wintercex Wintercex"
    },
    {
      "AuthorID": "ne0n",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
      "Content": "Aug 21, 2018 03:57AM ne0n wrote: Hi Cbrown, I'm replying because this looks like an older post and might not have much activity. I was about to turn 29 a month or so ago when I found a lump too. I went and had it checked out, was sent for an ultrasound and requested a biopsied - it came back as benign, but I learned more about what it was and that my family history and some other factors put me at a high risk category, so I will be going for genetic testing this year and a follow up ultrasound in a few months, by my own choice. As other women have commented, it is possible to have cancer at our age (and even younger, sadly) but the odds are statistically in your favor... and if something does turn out to be a problem, you will be doing all you can to treat it as soon as possible. I'm sorry you're going through the anxiety of finding breast changes but you're doing the right thing by scheduling screening. Your ob/gyn seems to be taking your concerns seriously, which means you will be able to address this head on. Try to relax if you can before you get your results or assuming... I found it very difficult, but even doing things like having a nice cup of tea or a few extra minutes in the shower can be enough. Hope everything turns out benign for you.",
      "MessageIndex": 9,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703445",
      "Title": "Finding a lump at 28 years old melissag0816 ne0n"
    },
    {
      "AuthorID": "ne0n",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
      "Content": "Aug 14, 2018 04:26AM - edited Aug 14, 2018 04:37AM by ne0n Have you considered consulting your gynecologist or a breast specialist instead of your GP? If your GP didn't actually examine it and it's still bothering you, it seems like seeing someone whose specialty relates to breast issues might be a good option. It sounds like you and your husband could use the peace of mind! There are many things it could be, but it sounds like having a focused appointment for the issue could help you determine what it is. If you're anything like me, you'll feel better for having someone give it a focused examination, and if it is something dangerous you'll be happy you got it checked out sooner. Hoping everything turns out okay.",
      "MessageIndex": 1,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866578",
      "Title": "Not sure if i should worry? Musiclover1990 Musiclover1990"
    },
    {
      "AuthorID": "ne0n",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
      "Content": "Aug 13, 2018 02:01PM ne0n wrote: Thank you for your kind and helpful thoughts! I am trying to be proactive, just bumping up my exercise, drinking water, ditching booze and planning for a follow up. It's nice to hear an empathetic viewpoint... it's the first time I've dealt with lumps, I'm under 30 and hoping I have a long life ahead of me. My mother had LCIS, so I'm super aware of all these things suddenly, and have been maybe over-preparing myself with knowledge. Again, thank you. Your words and viewpoint have been really helpful. I hope you're having a lovely day.",
      "MessageIndex": 2,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866541",
      "Title": "Dimpling or Stretch Marks? ne0n I_Spy"
    },
    {
      "AuthorID": "ne0n",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
      "Content": "ne0n wrote: Sorry in advance if this is a silly question. I hope I'm just being over-attentive, but wondering if anyone else has had this issue or has some thoughts to share. A couple weeks ago I went to my doctor to get my breast looked at for a lump. Got an ultrasound and a guided core needle biopsy, was told it was a benign fibroadenoma and that my one breast is fibrocystic. My bruises are still healing up and to be fair, I've been giving a lot of attention to it and touching it to put cream on the skin. The trouble I'm having is it's still so incredibly hard to shake the worry and upset that came with the whole process, to the point where I'm not sure if I'm being a paranoid person or if I should continue following up. I've noticed a couple light dents on the skin of the breast, they mostly seem to just rest on the skin and I don't notice any particular changes in shape when I move the breast. Still, the unevenness is definitely there. For the life of me I can't seem to remember if they're just stretch marks that have been there forever or if it's something new. I can feel it when I run my fingers over it, and there's nothing matching on the other side. I looked through old photos and couldn't find anything to put my mind at ease, but in all fairness even when I photographed them today it was difficult to see until I went close up. My breast has been warm but I've kind of been chalking it up to the healing bruises. Worse yet, I have a chronically overworked arm, so I have fairly consistent armpit and neck strain all in that side... it's hard to tell whether I'm having real malicious symptoms or not. I guess what I'm asking is, should I wait and monitor this or should I push for a follow up? I'm a bit worried my doctor would brush me off if I did (and also, honestly, I realize I might be too focused on it). On the other hand, I understand that IBC can be especially sneaky and terrifying, and if there is something I'd hardly want to wait to let it grow. I'm not sure if any of the checks I went through would have caught it anyway. Does anyone have any advice for an anxious young woman trying to do things right? :/ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866541",
      "Title": "Dimpling or Stretch Marks? ne0n I_Spy"
    },
    {
      "AuthorID": "ne0n",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
      "Content": "Aug 29, 2018 03:09PM ne0n wrote: Hello, I suffer from cysts, have a family history, a number of other risk factors and I totally 1000% also have health anxiety that I'm trying to manage on top of it... and I found my first lumps when I was bout to turn 29, so, you're not alone at all! I'm not entirely sure what your lumps could be and I'm super definitely not a doctor, but from what I have read it doesn't immediately sound like your lumps have malignant features, especially if they've changed so quickly (but again, not a doctor, and I have only been personally diagnosed with benign breast changes). It sounds like you should avoid touching it for a while, though. My fibroadenomas and what-I-suspect-are-cystic bumps move a little to a lot, but they do stay sort of in the same place (gotta be attached to something, somewhere I guess, it's not as though breasts are full of air). It sounds like maybe it feels bigger because it's been aggravated and your body might just be trying to heal up... try not to panic! An ultrasound is certainly the right step to take to find out more about what's happening, just try not to aggravate your breasts anymore. Hoping everything turns out to be benign for you.",
      "MessageIndex": 1,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866905",
      "Title": "Found a lump in my breast. Convinced it's malignant... Scaredshtlss Scaredshtlss"
    },
    {
      "AuthorID": "ne0n",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
      "Content": "ne0n wrote: Hi all. I hope I'm posting in the right place, please let me know if I'm not. Recently, I found my first lump in my breast. I went in and had it assessed, got an ultrasound and a core needle biopsy (I'm just under 30, so they told me a mammogram wouldn't be particularly helpful). Happily, my results were benign, and I was told it was a fibroadenoma. I also was told I had a couple other small things that 'looked like fibroadenomas' and cysts in one breast. I was told that the one breast has indications fibrocystic change, and the four specialists who helped me through this process are satisfied that all looks well at this time. I'm currently (if a little impatiently) waiting for my doctor to get back to me about where I can get genetic testing. So, while all of this was basically fine (I guess), in the process of all this I dug into my family history. My mother and her mother both had breast cancer. While they were both treated and moved past it, having all this knowledge hasn't really quelled my fear and stress around the subject. On top of it, during my biopsy the radiologist mentioned my 'extremely dense' breasts, which is apparently another risk to be aware of. There's also my personal history (took bc pills for 3 years as a teenager, and while I'm not a big drinker I've had patches of drinking more and less in my 20's, though currently my drinking habits are well below the recommended limit). I can change some of these things, and I can always strive to be healthier, but much of it is out of my control. As I mentioned, I'm going to pursue genetic testing (my mother said she tested negative), but I'm realistically assessing how I'm going to afford the screening I will need in the future, and honestly... I'm just not sure how to cope with all of it. I have had some real financial trouble in the last couple years and that's stressful enough, but now I'm feeling like I MUST fix that problem or else I will not be able to pursue risk-reducing screenings. I have some real health anxiety still weighing on me, and feeling my one lumpy, sore breast still has me thinking, 'but what if they missed something?' (I would like to think it's unlikely at this point, and certainly once my biopsy bruise clears up I'll go back to regular BSEs, but there's just that little fear in the back of my mind that's messing me all the way up lately.) Does anyone have tips of how to be proactive without being paranoid after learning about having a lot of risk factors? I guess it's hard because I've begun to perceive this as a very real threat, and the negative thought spirals are definitely not productive or helpful in any way, but it is hard to escape them. I'd like to think there are better ways of mentally and emotionally dealing with all this. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/866433",
      "Title": "Strong Family History...How do you deal with stress? ne0n WC3"
    },
    {
      "AuthorID": "ne0n",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278179/profile",
      "Content": "Aug 9, 2018 09:01AM ne0n wrote: Thank you guys for your insights. (Ladybugmommy, I am also 29, though my birthday just passed.) I'm glad I've been able to start now, but it's nervewracking... especially because I can feel 2 lumps now and I'm very aware of them being there. The best I've been able to do is plan on being proactive (I'm going to schedule a 6 month follow up, pursue the genetic test anyway, NOT go on hormonal birth control, etc). It's such an odd, nebulous kind of anxiety... just trying to stay healthy and sane, I suppose.",
      "MessageIndex": 4,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/866433",
      "Title": "Strong Family History...How do you deal with stress? ne0n WC3"
    }
  ]
}