{
  "AuthorID": "Neen56",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225687/profile",
  "Posts": [
    {
      "AuthorID": "Neen56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225687/profile",
      "Content": "Dec 14, 2015 11:24PM Neen56 wrote: I am brand spanking new to this forum so forgive me for not knowing all the abbreviations. I am having surgery, a left breast lumpectomy and sentinal node removal on January 6th. It seems like I've been waiting forever, it's been a few months. I am stage 1A, both hormones+ and Her2-. After that I will have the oncotype test to determine whether or not I will need chemo. I will have 15 to 19 doses of daily radiation because my hospital hasn't yet been approved by the government to do radiation at the time of surgery.",
      "MessageIndex": 12,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "Neen56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225687/profile",
      "Content": "Mar 20, 2016 10:30PM Neen56 wrote: I finished by 16 treatments of radiation on March 10th! Woo Woo! Ten days later I'm dragging. It's much worse than when I was in treatment. I can do some things,things that don't require a lot of energy, like type, read, and watch television. Some days I can grocery shop, some days not. I've needed to do laundry for days and just can't get up the energy to do it. I'm sleeping a lot, 9,10 even 11 hours a night but it doesn't seem to make much difference. How long will this last? I know everyone's different but this is such a drag! I want to feel better.",
      "MessageIndex": 2212,
      "PostDate": "20/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Neen56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225687/profile",
      "Content": "Feb 9, 2016 07:49PM Neen56 wrote: I have my planning session later this afternoon and will begin radiation next week. I will have a 16 sessions. I had radiation in 2003 for cervical cancer and never had any skin problems. I hope I'm that lucky this time.",
      "MessageIndex": 1171,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Neen56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225687/profile",
      "Content": "Feb 19, 2016 12:31AM Neen56 wrote: I have a question for those who have completed radiation. I began treatment today and should finish March 10th. How long after that will I feel fatigue? We have a long planned trip to Europe on April 30th. Will I have returned to my normal activity level by then? For most of the trip we will be on a luxury cruise where I can do as little, or as much, as I want to do but I am hoping to feel well enough to walk around ports and see the sights. Will I feel up to that 6 weeks after radiation ends? Thank you for sharing your experiences with recovery from rads. Much appreciated.",
      "MessageIndex": 1481,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Neen56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225687/profile",
      "Content": "Feb 9, 2016 07:51PM Neen56 wrote: Can someone tell me why we need \"boosts\"? My RO hasn't mentioned that. How will it be determined if I need them or not?",
      "MessageIndex": 1172,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}