{
  "AuthorID": "nekk1977",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
  "Posts": [
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "May 24, 2010 08:17AM nekk1977 wrote: I am 32 and have 1 lump which has been biopsied twice. It had changed in 2 years so my surgeon wanted to be sure. She also put a clip in it (kind of like a homing device :) They told me many things can cantribute, weight fluctuations, hormones, stress, etc.I'm most likely going to have it removed in September for peace of mind.  We don't always know whats going on inside our bodies but you have to be alert and proactive, and it sounds like you are, keep with the routine of checking that you are on and all will be well. Best of luck",
      "MessageIndex": 5,
      "PostDate": "24/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752855",
      "Title": "Can you please answer my questions? flower123 nekk1977"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "Jan 17, 2018 03:19PM nekk1977 wrote: hi Katie, any news? Sending positive vibes your way",
      "MessageIndex": 4,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/861662",
      "Title": "Biopsy today Kati218 Georgia1"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "Jan 19, 2018 05:39PM nekk1977 wrote: Hiiii!! I am also 40 and just had my first. What a stresser.. Almost the same as you. Had it Friday- called back Monday, back in Tuesday, met with the radiologist and she wanted me back in 6 months as well for what she said was a dilated duct.. she told me the chances were less than 1% that it was anything but I asked for the biopsy.. had that Wednesday. (This is my second- I had a fibrodenoma removed in 2009) it’s not bad at all and will be worth the peace of mind. I actually got my results today and it was not a dilated duct, it was another fibro- (benign) but back again in 6 months anyway. I’m very lumpy so I asked to listed as high risk so no more waiting in the future. You’ll do great! It’s quick and like I said the peace of mind will be awesome! Goooooood luck 😘",
      "MessageIndex": 4,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/861791",
      "Title": "Upcoming Core Biopsy-Nervous cmh1977 MayDayMelK"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "Sep 17, 2010 07:08AM nekk1977 wrote: Thanks ladies, I think I'm doing the right thing as well. Plus my Mother is flying up from FL to be with me for the week and fiance taking time off of work so pamper city here I come Somanywoman: That is exactly my point in doing it, better to be safe!! You ladies are all the best here! Helped me through the biopsy and the waiting and now the final chapter (I hope) Thanks so much!!!",
      "MessageIndex": 5,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758111",
      "Title": "Being a big girl nekk1977 nekk1977"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "nekk1977 wrote: Hello all, Had to biopsies on a lump in my right breast, both came back benign but it got bigger. I opted to get it out! My thoughts are that I don't want to have this lump and miss something else that (god willing doesn't happen) show up and I mistake it for my old trusty lump. So Lumpectomy here I come. A little nervous about the surgery, can someone tell me what to expect? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758111",
      "Title": "Being a big girl nekk1977 nekk1977"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "Jan 17, 2011 10:28PM nekk1977 wrote: Hi there!  I am sitting on my couch typing right now with my sutures and funny bra from my excision this morning. So far it has been super easy. I have a fibroadenoma that was core biopsied twice because it grew. Both times results were benign but I asked to have it removed for my own peace of mind. I would recommend this to anyone. Though the lump I had was not cancer, I did not want to risk missing something due to thinking it was the same ole lump. I went in this morning, they asked me questions about my health, got my IV going, gave me some sedatives and I woke up feeling great! I of course am a little sore but not bad at all and Im back to work Thursday morning. Even if they say you dont need it out. Just take it out, better all around. Feel free to email me if you have any questions and Good luck!!",
      "MessageIndex": 4,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763434",
      "Title": "Any questions I should be asking about an excisional biopsy? Robynmummy Robynmummy"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "nekk1977 wrote: This Post was deleted by nekk1977. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752698",
      "Title": "More nervous by the day nekk1977 nekk1977"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "May 16, 2010 01:59PM nekk1977 wrote: Ooops, I deleted my post. Can someone please tell me why a lump would suddenly appear on an ultrasound that wasn't there before?? Lump was there just no picture. I had a biopsy on the lump 2 years ago and it was benign. I just had another biopsy done and am waiting results and it doesnt seem many people have had this please help me.",
      "MessageIndex": 1,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752698",
      "Title": "More nervous by the day nekk1977 nekk1977"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "May 16, 2010 03:43PM nekk1977 wrote: Lisa, You are absolutely correct. I went back to my surgeon because it was a little sore, she thought it felt the same but did a US to double check, was in the room with me for the US, saw the lump and did the biopsy right then. I appreciate your kind words and how great for your Mom!!! Praying for B9 as well and wish we didn't have to go through these scares..",
      "MessageIndex": 4,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752698",
      "Title": "More nervous by the day nekk1977 nekk1977"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "May 19, 2010 10:21PM nekk1977 wrote: My surgeon was amazing!! I went in 2 years ago after my primary found a lump, they sent me for an ultrasound and nothing showed up. Surgeon gave me 3 options. Leave and come back in 6 months and check again, mammogram (which she said may also show nothing) or biopsy (a last option as she felt things were normal) Me being the nervous person I am, asked for the biopsy which was done that day. Results, benign!!!! Just had another one as the lump this time showed up on the ultrasound and again, thank God, the results were normal, but I truely appreciate my surgeon who gave ME the option to decide what I wanted to do. I sleep much easier now. I reccomend that if you feel uneasy, find someone to check, chances are it's fine but you'll sleep better and stop worrying. All my best to you ",
      "MessageIndex": 3,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752838",
      "Title": "Did you ever think you were overreacting? LONG! yearbookteach wallycat"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "nekk1977 wrote: Hi Ladies!!! So I told you my results were B9 but... Dr. said she would remove my lump for me if I wanted... Should I, I'm a little scared, anyone who's had one removed, tell me your thoughts.. I don't have to decide right now but.......????????? I think I'd feel better with it gone. maybe.. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752959",
      "Title": "Questions about surgery nekk1977 mawhinney"
    },
    {
      "AuthorID": "nekk1977",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102057/profile",
      "Content": "May 16, 2010 06:57PM nekk1977 wrote: Generally I think.. 3 business days, thats for a core biopsy.  Don't hesitate to call and ask if they got them early. I had to call last time and I had another biopsy and am supposed to hear Tuesday. I will be calling at noon if I havent yet heard. Good luck and best wishes for B9!",
      "MessageIndex": 11,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/752317",
      "Title": "surgical biopsy question jdfnj2 SWELL"
    }
  ]
}