{
  "AuthorID": "nessa367",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155859/profile",
  "Posts": [{
    "AuthorID": "nessa367",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155859/profile",
    "Content": "nessa367 wrote: Hi Ladies,  Frustrated !!!!!!!!!!! About 3 months ago I developed what appeared to be very similar to Mastitis except one side of my breast seemed to have a ridge. I tried to massage it in a hot shower to relieve this, but did not work.  Went to a walk in gp who prescribed antiobiotics, he said if not better return. Three days later returned to my doctor who sent me straight away to ED as he thought it was a huge abcess. At hospital I was prescribed another set of Antibiotics and told to return the next day for Ultrasound. I did return and also had a needle biopsy there was no puss, was more like chessy. Biopsy results revealed it was non-bacterial with Inflammation. Ed doctor said he would make me an appt for Breast Clinic.  Another 6 days later returned to my dr as it had not improved. He said he was not happy so prescibed me a stronger set of antibiotics 3 rd set. These did make some small improvement. I had not been feeling well with my glands in my neck flaring up on a regular basis with feeling of itch and burning sensation and pains running up my chest.. Breast Clinic phoned me and said dr would like me seen this week but no available appts for at least 4-5 weeks they would send out appt card.  I dont have alot of money but at this stage decided I would go and see a Breast specialist.  Appt with breast specialist woohoo was very excited to hopefully get some answers. She booked me in for Ultrasound and Mammogram, plus core biopsy all in about a week. Had core biopsy which they discovered about 3 ml of pus. Mammogram results said  there is diffuse, poorly defined increased parenchymal density, assosciated with thickening of the skin of the areola. There is no malignancy. Minor benign calcification is present. My breast specialist was not happy with results and suggested surgery so we can have pathology test it. They cut around my nipple to remove mass. I have since had this done and was very happy. I had my 4 th set of antiibiotics when I had s my surgery. And another set when I got home from hospital. I went back for my post op appt last week. No Malignancy, still have inflammation and duct ectasia, she cleaned up my ducts. She removed a 4cm cyst and blood filled sack. I have started to feel un well again and experience soreness and pain. She has prescribed another set of antibiotics and has asked for my ultra sounds and mammograms so that she can look through them with a Pathologist as she said you can feel a palpable nodularity retroaelar.  Trying to stay happy but when I get the aches and pains, it is so frustrating.  Should I wait for her to contact me if she finds anything on my scans etc ... Or would you make another appt? cheers Vanessa :)  Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "09/07/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790283",
    "Title": "Not 100% happy! nessa367 proudtospin"
  }]
}