{
  "AuthorID": "NettaGER",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265992/profile",
  "Posts": [
    {
      "AuthorID": "NettaGER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265992/profile",
      "Content": "Jan 2, 2018 02:06PM NettaGER wrote: Hallo everybody! I have been diagnosed with de novo stage IV end of August 2017 at the age of 40, when having an MRI due to thorax back pain. My breast cancer is ER+/PR+ and HER2-. I have various bone mets in my whole spine and my sculp bone, but no current fracture risk.",
      "MessageIndex": 464,
      "PostDate": "02/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "NettaGER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265992/profile",
      "Content": "Jan 4, 2018 10:06AM NettaGER wrote: Yes! I kind of got a go from my MO wrt skiing. Of course, he told me that no doctor would ever advise any patient to go skiing due to the general risk of injury. However, he told me that I currently do not have an increased risk of fracture and that I might as well fall down the stairs, which would be worse than landing in softer snow. And he agreed that I should do what I enjoy as long as I am able to. I guess more Go cannot be expected.",
      "MessageIndex": 1477,
      "PostDate": "04/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "NettaGER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265992/profile",
      "Content": "Jan 3, 2018 01:04AM NettaGER wrote: Question from a Newbie: has anyone with various bone mets to spine and calotte done skiing or roadbike cycling? I have quite small lesions, no fracture risk, only one lesion which causes slight pain since top of th11 looks like a tooth with a hole. Sclerotic healing has started on the outer rim of the lesions, Zometa appears to help. I am a bit afraid that a fall could cause severe injury, on the other side, I would really love to do both again. Unfortunately, I do not really have a qualified doc to discuss this topic, as the MO in the breast center is not an orthopedic expert. And since my lesions not are severe enough (thank god), I was not yet sent to see an orthopedist in the hospital.",
      "MessageIndex": 1471,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "NettaGER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265992/profile",
      "Content": "Mar 27, 2018 02:13PM NettaGER wrote: Sunset: that would truely be great. I do not yet need it myself, however, there is a good chance that I will move on to Everolimus when Ibrance fails me, therefore I believe it is a good idea to already support my MO with this issue. I will surely benefit from this sometime as well.",
      "MessageIndex": 45,
      "PostDate": "27/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "NettaGER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265992/profile",
      "Content": "Jan 20, 2018 01:56PM NettaGER wrote: Sounds like a very interesting combi, the study results look quite nice. Good luck! I am looking foward to your future postings.",
      "MessageIndex": 1,
      "PostDate": "20/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "NettaGER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265992/profile",
      "Content": "Mar 27, 2018 05:34AM NettaGER wrote: Sunset: Can you tell me the ingredients/amounts of your dexamethasone mouth wash? My MO asked me about this during my last visit for another patient, because he thought that I am a pharmacist (I am not, just working in pharma industry). Using a dexamethasone mouthwash is described in a lot of literature wrt Everolimus, however, a recipe is given nowhere. And there is no commercially available mouthwash here in Germany, it needs to be mixed by the pharmacy. It would be great, if I would surprise my MO during my next appointment ;-) .",
      "MessageIndex": 43,
      "PostDate": "27/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    }
  ]
}