{
  "AuthorID": "Newbie2theb…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251387/profile",
  "Posts": [{
    "AuthorID": "Newbie2theb…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251387/profile",
    "Content": "May 2, 2017 04:19PM Newbie2thebigC wrote: Although you'll hear that titanium allergy is rare, people who have a history of metal allergies should be evaluated prior to having any type of metal implanted, no matter how small! Below is one of many articles I read months ago because I am having a reaction that can only be attributed to titanium breast clips. I've had several tests; allergy patch testing, blood tests and biopsies, but the proper test is really something that looks at your immunological response to what's already inside of you. Melisa Testing is performed for that! I've just had that and am awaiting results! Tamai K, et al. Breast Cancer. 2001. We report a case of a 28-year-old woman with right-sided breast cancer. The patient had been treated for atopic dermatitis since her infancy. She underwent breast-conserving surgery (BCS) in July 1998, and three titanium clips were placed at the margin of the excision cavity at the time of surgery. Two months after surgery, the patient exhibited a rapid exacerbation of atopic dermatitis. Various drugs were suspected to be the cause of the allergic reaction, but the results of a bi-digital O-ring test (BDORT) suggested an allergic reaction to titanium clips. In August 1999, the patient underwent a second operation to remove the titanium clips under local anesthesia. Allergy to surgical titanium clips is a rare complication, but in patients with a history of severe allergic diseases, a preoperative immunologic examination should be performed and the patient's history of metal allergy should be investigated. 11180773 [PubMed - indexed for MEDLINE]",
    "MessageIndex": 21,
    "PostDate": "02/05/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813169",
    "Title": "Breast Biopsy Marker Clip Allergy 8y7hrt sas-schatzi"
  }]
}