{
  "AuthorID": "NewEnglandC…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240992/profile",
  "Posts": [
    {
      "AuthorID": "NewEnglandC…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240992/profile",
      "Content": "Jan 19, 2017 01:35AM NewEnglandChic wrote: Thank you for replying! Taxol has been much easier to tolerate. I have a side effect that has started. On call dr. said probably Hand-Foot Syndrome. Pain in fingers and feet. But much more bearable than the awful symptoms of A/C! I was able to sit with my family for dinner. Not possible before. Wishing you luck on your Taxol adventures!",
      "MessageIndex": 1193,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "NewEnglandC…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240992/profile",
      "Content": "Jan 19, 2017 07:44AM - edited Jan 19, 2017 07:51AM by NewEnglandChic Hi there chickensandgoats! I started Taxol on Tuesday and I was there for 2 hours, the actual infusion was 1 hour. (When I was on the A/C my longest infusion time was 30 minutes, but I was there longer because there were more steps in the process and 2 separate meds administered.) Hope this helps! Love your profile name, by the way! I have 3 chickens and grew up with goats. ❤️🐓",
      "MessageIndex": 1195,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "NewEnglandC…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240992/profile",
      "Content": "Jan 18, 2017 01:52AM - edited Jan 18, 2017 01:59AM by NewEnglandChic Just came across this group! So happy to see others here who started chemo therapy when I did so I can read about your experiences. I'm so in need of connecting with others going through something similar to what I am experiencing. I thought I'd introduce myself. I am a 43 year old mother of 2, from Massachusetts in the U.S. Had my very first mammogram in July, resulting in followup tests, and diagnosis of invasive ductal carcinoma of the right breast, Stage I (I think there is an A or B after that, but I can't remember at the moment), tumor just over 1cm, HER2-, negative for all 28 genetic mutations. Biopsy showed aggressive cancer cells. I underwent a lumpectomy on 10/13/16 that went well, sentinel nodes that were removed tested negative for cancer. The only odd thing was that they found a small lymph node oddly placed in the tissue right next to my tumor that hadn't shown up on any images, and that tested positive for cancer - meaning that technically cancer could have started to get into the blood stream. (I had breast reduction surgery in 2011, so wondering it that oddly placed lymph node ended up there from being moved around during that breast reconstruct.) Ended up having negative estrogen receptors ER-. My Oncotype DX test performed on my tumor came back pretty high, 65 I think - my cancer was aggressive for this type of cancer. So all of these factors lead to doctors recommending aggressive treatment to reduce the chance of recurrence. Started chemo on November 23, 2016 - CYTOXAN & DOXOrubicin every 2 weeks for 4 treatments (accompanied by DECADRON, EMEND, ALOXI at each treatment). I have had a really difficult time with these medications. Started with 10 days of symptoms & discomfort (more than a week mostly in bed), then 4 good days before next treatment. The good days became fewer as time went on, this past 2 weeks I had no actual good days. The anti-nausea infusions have caused lots of trouble with headaches. I've been able to do very little of my normal activities, which stinks because I have 2 little girls to take care of, so my dear husband is having to manage an awful lot without my help. Going to be joining a support group in the next few weeks. Today I started the next phase of treatment, no more of the other meds. This will be Taxol for 12 weeks, once a week (accompanied by DECADRON, Benadryl, and Pepcid at each treatment to manage possible allergic reactions). This phase of treatment is supposed to be less invasive and carry less of those really unpleasant symptoms that I've been experiencing. Fingers crossed! After chemo ends, I start radiation 2 weeks later 5 days a week for 6 1/2 weeks. Then 10 years of hormones after that. That's most of my story. Sound familiar to anyone else? Looking forward to reading through your posts. Thank you for having me! ",
      "MessageIndex": 1184,
      "PostDate": "18/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    }
  ]
}