{
  "AuthorID": "NewGardener…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
  "Posts": [
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Mar 17, 2014 12:28PM NewGardener wrote: Hi CajunQueen, You are right that becoming post menopausal increases the number of medications at your oncologist's disposal (the aromatase inhibitors like letrozole & exemestane but also fulvestrant, a SERD).  Estrogen is produced by the ovaries in premenopausal women, but also by other glands in post menopausal women. After my stage II diagnosis I had tamoxifen and then added monthly Lupron shots to stop my ovarian function.  I had the shots because I wanted to be able to reverse it to try to have kids.  Then the cancer spread, so it seemed an oophorectomy was the better option.  At that point I was 42.  The day surgery was easy and my recovery was only a couple of days.  It's been 4 years - that's 48 fewer visits to the pharmacy & doctor's office for the shots.  For both the Lupron and the oophorectomy I had the usual menopausal symptoms, but they were all manageable.  Well, the hot flashes were pretty miserable, but they've stopped now.  Hope the information helps, good luck with your decision.    ",
      "MessageIndex": 2,
      "PostDate": "17/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819213",
      "Title": "38, newly Stage IV, bone mets, Dr wants to remove ovaries ASAP CajunQueen KATE1974"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Apr 15, 2013 10:49AM NewGardener wrote: 195.  Another lurker, I appreciate everyone's posts.  Best to all. ",
      "MessageIndex": 238,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "May 16, 2016 07:25PM NewGardener wrote: My thoughts are with Nancy's friends and family. Nancy was such a positive mentor and spirit In this community Heather",
      "MessageIndex": 33,
      "PostDate": "16/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/844276",
      "Title": "Nancyh exbrnxgrl PaulaAmy"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Dec 13, 2018 03:36PM NewGardener wrote: Hi Pajim, I have also been trying hard to squeak every possible hormonal treatment in an attempt to avoid IV chemo. I'm now on my third trial. My current trial is for a pi3kca inhibitor with fulvestrant - I qualiified after doing a FoundationOne genomic profile that found I had the mutation. I haven't had any of the three options in the metastatic setting. I had taxol when I was Stage II and hated it. My oncologist had offered Navelbine before I started my clinical trial in 2015. I understand erubilin/Halaven can be tolerable - and I believe the clinic visit is short. I'm chiming in here to mention that Phase 1 trials may be very time consuming. I am not working so I've been able to manage it, but it might be hard if your employer isn't truly accommodating. For the first 8 weeks of my current phase 1 trial I had to go weekly. 3 of those visits were multi-day. 3 of those days involved 8 hours of hourly blood tests. So be sure to ask about time commitment for the oral Taxol trial, which otherwise sounds quite interesting. Good luck with your choice.  ",
      "MessageIndex": 8,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868803",
      "Title": "Choices, Choices (Taxol, Navelbine, Halavan) pajim SandiBeach57"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Feb 7, 2012 01:32PM NewGardener wrote: I'm also on femara/letrozole - coming up to 2 years.  I had recurrence/metatasis on tamoxifen after 4.5 years (started as Stage IIa).  I am stable, but pleural lesions are still there. So my first impression to your question was - \"No way, stay the course on letrozole until it stops working then move to the next AI.\"  But as I think more, I agree the idea may be interesting...If they can prolong how long letrozole works, then it could better in the long run.  The challenge is they don't seem to have reported any initial results from the SOLE trial - unless I'm not finding them.  I think I would want to see those results.  Another concern I have is the SOLE participants are all early stage.  Maybe they never would have had it spread, so will the results be applicable to people who have mets? So thanks for posting about SOLE.  I'll be watching responses to your inquiry as well.",
      "MessageIndex": 5,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782298",
      "Title": "what would you do? Heidihill ma111"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Mar 11, 2019 03:24PM NewGardener wrote: Hi NBee I've had a handful of pleural effusions. First one in 2014 while on everolimus/exemestane - it resolved itself. In June 2015, I had one again - had a thoracentesis and changed treatments...and I was lucky that the PE didn't return. Most recently I had a PE at the end of 2017 while waiting to get into a clinical trial - the pain drove me into the ER (shoulder, back, chest). Again I had a thoracentesis - with the new trial drugs again I was lucky it didn't return. So hopefully your new meds will do the trick and address it and they'll be able to remove the catheter. Good luck!    ",
      "MessageIndex": 1,
      "PostDate": "11/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870217",
      "Title": "Has anyone had pleural effusion? NBee NewGardener"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Jun 8, 2011 02:19PM NewGardener wrote: Hi Buggy1996, You seem to be in a somewhat similar situation to mine after my first round at Stage II back in 2005.  I had a mastectomy, and they found 1 positive node.  I decided not to have the radiation, partly because of the cosmetic effects with the skin and implant, but mostly because of the long term impact of radiation on the lungs.   Also, I had treatment fatigue and just wanted to get on with my life.  I spoke to two rad onc's - and both agreed it was ok to skip.  But, since I recurred 5 years later with it spreading to my lungs, I would have to admit to wondering what if.   I believe there have been recent studies suggesting benefits of radiation - it might be worth asking your doctors if its applicable (www.theglobeandmail.com/life/h...  To your question about recovery from a full mastectomy, while in truth I experience the most acute pain of my treatment (chemo and all) with the replacement of the expander and the implant on my non-affected size (I upgraded from A to B), it lasted only one long night.  I was reorganizing the living room the next day.  I couldn't run for 6 weeks or so (because they told me not to), and I haven't had any problems since.  Good luck with your decision. ",
      "MessageIndex": 1,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770047",
      "Title": "Mastectomy/radiation/implant buggy1996 buggy1996"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "May 26, 2015 02:05PM NewGardener wrote: Hi Nancy, I sent a PM with some information I have. Good luck with the trip planning.",
      "MessageIndex": 1,
      "PostDate": "26/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832050",
      "Title": "Trip insurance without pre-existing medical? nancyh Sarah0915"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Apr 27, 2011 05:45PM NewGardener wrote: Dear 15andmore, I hope (and believe) that by signing in here you will get another boost of energy from this supportive group.  Your success to date is inspiring.  I'm 6.5 years in from my Stage II diagnosis and 1.5 years since we discovered the pleural metastases.  It's also my first post, although shamefully I've been lurking for 10 months or so.  Thank you to EnglishMajor for the link to the 10+ year stories.  I find myself not knowing how to behave with this \"Sword of Damocles\" hanging over me, but then I read about others, and I'm motivated to live as rich a life as I can.   ",
      "MessageIndex": 18,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768161",
      "Title": "Long Term Survivor with Active Mets 15andmore 15andmore"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Jun 12, 2013 02:52PM NewGardener wrote: Dear Marsha, I'm sorry to hear this news.  10 years is a good run, but we all want (deserve) more.  I do hope your oncologist is able to come up with a new treatment, and can address your pain.  Take care, Heather",
      "MessageIndex": 1,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806021",
      "Title": "out of options onedayatatime NickyJ"
    },
    {
      "AuthorID": "NewGardener…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128349/profile",
      "Content": "Dec 13, 2018 02:40PM - edited Dec 13, 2018 02:42PM by NewGardener Thank you Bestbird. Your observation about the number of studies that pertained to MBC is encouraging. I found that the headlines out of SABCS were mostly older new (alpesib, announced at ESMO) or early stage related, so it's good to hear that in the background MBC is being looked at. Heather",
      "MessageIndex": 12,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868799",
      "Title": "SABCS 2018 Update (Sorry, Very Long!) Bestbird Frisky"
    }
  ]
}