{
  "AuthorID": "Newmomma",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149360/profile",
  "Posts": [
    {
      "AuthorID": "Newmomma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149360/profile",
      "Content": "Newmomma wrote: Hello All, I just wanted to share my story and get feedback from others who might have been through this.  Back in November of 2011 I had a horrible case of Mastitis on the left side of breast.  Red, inflammed, and clogged up.  The doctor wanted to put me in the hospital but I decided to treat it at home and was on 14 days of antibiotics. The milk was cultured before treatment and I also had an ultrasound.  The culture came back positive for strep and staph and the ultrasound showed a cyst in the left breast.  After treatment I recultured and everything came back negative.  January 2012 mammogram which came back showing nothing was wrong.  I continued to have pain in the left breast until April of 2012.  Went back to the doctor had it recultured.  It cultured for a little bit of staph but she said that it could be living on the outside of my skin.  I went back on antibiotics for another 10 days and a MRI was ordered.  MRI came back stating that no evidence of cystic masses.  There is a 3 cm area of breast parenchyma in the upper outer quadrant of the left breast which demonstrates malignant washout contrast enhancement.  While this could be seondary to beign etiology such as breast feeding or mastitis tumor including lobular carcinoma cannot be excluded.  Therefore biopsy of the area is recommended.  BIRADS 4. I was in the surgeons office within the week and I was still breast feeding and had finished the antibiotics.  She asked me to dry up before taking the biopsy.  Three weeks later I went back and she said that the tumor had shrank to around 2.3 cm and she wanted to watch it for another two weeks (which will be three because I'm on vacation).  I'm livid because I have a strong family hx of cancer and dried up my milk supply for a biopsy I did not get.  My gut instint is that it needs to be looked into further. I sit here now and can still feel the lump.  I have a history of fatty tumors that have been removed on the left side and my mother was diagnosed with tripple negative breast cancer at 45 years old.  I have also had melanoma stage 0 right under the breast with the issues on the left side.  I'm looking to others just to ease my mind.  Did anyone else have a shrinking lump that was just mastitis that took forever to go away?  Am I just being paranoid. Thanks for any feedback. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785995",
      "Title": "Mastitis or Lobular Cancer Newmomma toomuch"
    },
    {
      "AuthorID": "Newmomma",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149360/profile",
      "Content": "Apr 17, 2012 02:53PM Newmomma wrote: By the way my mother did not test positive for the BRCA gene.",
      "MessageIndex": 1,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/785995",
      "Title": "Mastitis or Lobular Cancer Newmomma toomuch"
    }
  ]
}