{
  "AuthorID": "nic42",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127056/profile",
  "Posts": [
    {
      "AuthorID": "nic42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127056/profile",
      "Content": "May 9, 2011 02:27AM - edited May 9, 2011 03:32AM by nic42 Hi Everyone - I too have been lingering for 2 months now. I start my rads on May 10th(exactly 2 mos from my surgery). I am nervous about starting but want to get this over with as well. I bought emu oil and have been applying to my scars and nipple for a week now - I hope it helps. I will let you know. Thank you everyone for all your great suggestions. I am going to buy lottery tickets too!! Great idea!!! Well I will be hanging out and reading all your stories.",
      "MessageIndex": 107,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "nic42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127056/profile",
      "Content": "May 12, 2011 05:47PM nic42 wrote: HI Ladies - Started my rads on the 10th, Tuesday. Still haven't had a chance to buy the scratch offs but plan on it tonight. Hopefully I will win - need some pick me up. So far so good with any SE. Just a little discomfort and tingles.  Although everytime I have left the office after rads - I cry all the way to work. I feel like I am in a good place but there is this terrible feeling I get when they leave the room and shut the door and leave me all alone with the damn green beam. In my head I say positive things and ask the green light to get my \"crumbles\" and make me better. But I leave so emotional everytime. I guess I need a good cry - I don't know. Anyone else feel this way after? Nic",
      "MessageIndex": 169,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "nic42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127056/profile",
      "Content": "May 12, 2011 11:24PM nic42 wrote: duckyb1 -  My friends have offered to come along for the 45 min ride so tomorrow I am taking a dear friend with me - your right I do feel like \"debbie downer\". But after reading what you wrote GabbyCal - I realized it is daily reminder that I have breast cancer AND I DON'T LIKE IT!! I feel marked or tagged - like defective mdse.  I'll get over it. There is no way cancer is taking over MY LIFE!! Thanks ladies for your insights. Sadly I know I am not alone but very thankful! sincerely, nic",
      "MessageIndex": 176,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "nic42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127056/profile",
      "Content": "May 16, 2011 10:55PM nic42 wrote: No winnings yet but hoping for a postive scratcher in my future! :-) 5/20 today - the emotions seem to be better, no skin problems so far. BUT a lot of fatigue and occasional pain in my armpit. I have fibromaylgia so I don't know if its just that or the rads is making it worse.",
      "MessageIndex": 224,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    }
  ]
}