{
  "AuthorID": "nic443",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283621/profile",
  "Posts": [
    {
      "AuthorID": "nic443",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283621/profile",
      "Content": "nic443 wrote: I am 32 years old, turning 33 in a few weeks. My story begins a year ago in December '17. I found a dimple in the bottom of my breast, similar to the ones posted online, and contacted a local breast clinic. I went for an ultrasound, waited anxiously for the results, and was told they didn't see anything out of the ordinary and to enjoy my Christmas. No follow up required. I was ecstatic and believed that if there was anything there, they definitely would have found it. 10 months later, the indent is still there and looks the same, maybe a bit bigger? It disappears when my bathroom light is on but very visible in natural light with my arm raised, like someone is poking a finger slightly into the skin. (I have gained about 30 pounds in the last few years and thought it might be related to that, but there is nothing similar in the other breast.) I started Googling, found this website among others, and read a ton of stories about how ultrasounds and mammograms miss breast cancer. Start panicking. Book another ultrasound. This was in October. Waited again, and when I received the phone call was told the radiologist couldn't see anything but if I still have concerns I could have a mammogram. Booked the mammogram. Waited for the results. The phone call comes -- the radiologist doesn't see anything, but since you're having a physical symptom, we'd like to do a second look ultrasound. Went for the second look ultrasound. The call comes -- we see some faint shadowing in the area above your symptom and would like to schedule a biopsy. My biopsy is scheduled for Dec 26 at 8am. The birads rating is 4, which the person on the phone told me was because they wanted to do follow up testing to see what the shadowing is but I still have a great chance it's nothing bad. I'm freaking out! I'm so worried that if it's cancer, it's been there for a long time and has already spread. Best wishes to everyone going through the same thing. I'll keep you updated. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868960",
      "Title": "Birads 4 - dimple in bottom of breast nic443 nic443"
    },
    {
      "AuthorID": "nic443",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283621/profile",
      "Content": "Dec 21, 2018 03:30PM nic443 wrote: Thanks for the kind words KBeee. Just trying to manage my anxiety for now. Happy holidays!",
      "MessageIndex": 2,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868960",
      "Title": "Birads 4 - dimple in bottom of breast nic443 nic443"
    }
  ]
}