{
  "AuthorID": "Nicole22",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66607/profile",
  "Posts": [
    {
      "AuthorID": "Nicole22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66607/profile",
      "Content": "Nicole22 wrote: I'm really panicking right now, I have just gotten back from the PS who said that there is a chance that during my surgery to remove a large benign tumor, that blood supply to the nipple could be cut off and the nipple will die and have to be removed.  The tumor is in the lower outer quadrant but some of it extends very close to my nipple.  Has anyone had this happen to them??? What are the chances that this could happen to me? Please help me, I'm only 22, I don't want to lose my nipple. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706200",
      "Title": "don't want to lose my nipple... help me Nicole22 tamc130"
    },
    {
      "AuthorID": "Nicole22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66607/profile",
      "Content": "May 29, 2008 11:20AM Nicole22 wrote: tamc- I got so excited when I read your post about the cryoablation so I looked it up but unfortunately I don't think you can do that with the type of tumor I have (a phyllodes tumor).  I don't know if I am right here but is it possible that with Tamc and Janine that the blood supply did get cut off to your nipple a little bit- hence the black scabs but not enough to actually lose the nipple (am i right??).  What worries me is that my PS said that if she sees that the blood supply to my nipple has been cut off that she'll just remove it right then and there.  I would really rather that she does not jump the gun on removing it if there is a chance that the blood supply could be re-established and it would just scab over as it is healing... Is this something I should tell her?  It just seems weird that surgeons can reattach fingers but not nipples- can doctor's reattach nipples?  Is she just telling me that she would have to remove it because she doesn't know how to reattach it?  If so I would much rather have a surgeon who would know how to reattach.  Nevertheless I feel much better about everything after reading everyone's posts- it makes losing a nipple seem like not as totally awful as i thought it was, and also give me hope that I can keep mine.  But if anyone can answer some of these questions it would be greatly appreciated!",
      "MessageIndex": 12,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706200",
      "Title": "don't want to lose my nipple... help me Nicole22 tamc130"
    },
    {
      "AuthorID": "Nicole22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66607/profile",
      "Content": "May 27, 2008 11:16AM Nicole22 wrote: I asked the PS what the chances were and she just sort of shook her head like she wouldn't really know until she actually got in there and looked at it during the surgery.  The more a think about it and the more I research, I think she might just be referring to a complication that could happen with any breast surgery rather than specifically with mine... but maybe I'm just telling myself that to make myself feel better.  If that is the case I wish she had not even told me about it- the thought of waking up without my nipple is more than I can handle.  Why did yours have to get removed?  Did you eventually get reconstruction?",
      "MessageIndex": 4,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706200",
      "Title": "don't want to lose my nipple... help me Nicole22 tamc130"
    },
    {
      "AuthorID": "Nicole22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66607/profile",
      "Content": "May 27, 2008 11:20AM Nicole22 wrote: PS: I'm very sorry that you had to go through that, it is nice to know that there are people on here that offer their experience and support so readily",
      "MessageIndex": 5,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706200",
      "Title": "don't want to lose my nipple... help me Nicole22 tamc130"
    },
    {
      "AuthorID": "Nicole22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66607/profile",
      "Content": "Jun 27, 2008 03:16AM Nicole22 wrote: Hi Dre  I know EXACTLY how you feel- I am 22 years old and I am about to go in tomorrow to get a large phyllodes tumor removed and reconstruction.  I will be having a mastectomy because my tumor is so large in comparison to the rest of my breast.  It was a HUGE shock to begin with and sooo stressful- but if you have to do it- you WILL get through it, I promise.  The good news is the chance of having another phyllodes tumor in the OTHER breast is extremely unlikely- unless it is in the same breast the you first got it removed from, in which case it could just be coming back.  The chances of having a phyllodes tumor at our age is so small that we are more likely to actually get breast cancer, therefore having two phyllodes tumors, one in each breast is sooo unlikely.  You should get a biopsy done first to determine what it is and then consider your options- I know its easy to start getting worried about these things before you find out :)  It's probably a fibroadenoma- they are VERY similar to phyllodes- and they are completely benign.  But definately get it checked out asap!  Best of luck- pm me if you ever want to chat!",
      "MessageIndex": 3,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707413",
      "Title": "Masectomy and possibly reconstruction fears dre1045 auroravtj"
    }
  ]
}