{
  "AuthorID": "niiankrah1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
  "Posts": [
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 7, 2018 08:11AM niiankrah1 wrote: Dear Jen. I am pleading, begging for information, on the naturalist treatment that you are taking. Other posters here know a lot, but I know next to nothing except for a few anectdotes. This is not about them. They are trying to be your mouthpiece but they dont know what your naturalist regimen is. They know so much that they dont have to learn from you, but I do want to learn from you. I believe in anectdotes, one off stories of individuals like you. I have been on this board quietly learning from many people. Books and publushed studies have a place too. I appreciate all the responses here but I am looking for the specific information of your naturalist treatments. It is only you who can answer that. Thank you.",
      "MessageIndex": 59,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 7, 2018 02:52AM niiankrah1 wrote: Thanks jojo for your voice. I have learnt a lot from your inquiring mind, your skeptism, and your steadfastness. You are one of my favorites on this board. I have read most of what exbrnxgrl has written on this board. She brings depth to any discussion. Thank you exbrnxgrl. This thread is not about us. It is about Jen and her miracle. I know how to search for information in old threads. That is what I have been doing silently till the miracle of Jen. I am here to learn. Light and not heat please. I am patiently waiting on the OP to enlighten me.",
      "MessageIndex": 55,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "Jan 18, 2017 07:03AM niiankrah1 wrote: Thank you so much for what you have taught me. I am a man. I have been lurking for a long time now to learn from your brutal honesty and unfiltered narrative. You say it like it is. I wish you peace on your journey.",
      "MessageIndex": 1931,
      "PostDate": "18/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "Jan 21, 2017 07:23AM niiankrah1 wrote: I hold out hope that you will bounce back again, like you did before, when all hope seemed lost.",
      "MessageIndex": 1968,
      "PostDate": "21/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 4, 2018 10:53AM niiankrah1 wrote: I am not happy that you are not taking anything. Your cancer has been kept at bay because something has been working for you. The problem with cancer treatment is that doctors do not know what treatment would work for who. So it is a trial and error. You are a miracle because the choice of treatment worked for you. The cancer is still there but not detectable or measurable. Therefore it is a mistake, in my view, to give it any wiggle room to flare up by coming off everything. I say this because I have followed a few who died within 3 weeks of their last NED declaration. They did not make it to the next 6 month scan. The cancer sneaked up on them as they rejoiced. The doctors let down their guard. And it went downhill very quickly. I want you to continue to beat this disease. Despite the myriad of treatments we are very far from conquering a stage 4 diagnosis. Keep your guard up.",
      "MessageIndex": 21,
      "PostDate": "04/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 5, 2018 10:29PM - edited May 5, 2018 10:56PM by niiankrah1 DATNY thanks for adding to my skepticsm. OP please help by giving more details on what you have done besides the oncology experts. As far as I know stage 4 means terminal in their book so it does not make sense to take one completely off drugs. Reduce dosage, take breaks, yes, but not completely off. There may be more to your wonderful story although you may not want to credit naturalists and other lifestyle changes. When the experts tout the wonders of herceptin they will omit, just as you did in your original post, that you were doing other anectdotal things. But you do those unproven things because they are valuable.",
      "MessageIndex": 30,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 6, 2018 11:10PM - edited May 6, 2018 11:14PM by niiankrah1 This is not about me. I dont have anything to share. I am only here to learn what is missing from the reputable books and publications like Pubmed, and even then I cannot ask questions. I am not after the theory of treatment. I can only get what I want from anectdotes. Here we have Jen to answer questions. I learned so much from Rosevalley more than I learned from books because she put it all out there without holding back anything. I never asked her any questions. What I got from Rosevalley was the unsanitised version, the full details, the whole nine yards. My first post was to say thank you to Rosevalley shortly before she departed. It was only after I voiced skeptism that I learned that the OP is still in treatment albeit by a naturalist. Does that not count for something? I am still waiting for the OP herself to enlighten me on her naturalist treatment. That is a big deal to complete this uplifting story that is a gem on this board. Thank you Jen. ",
      "MessageIndex": 49,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 7, 2018 09:27AM niiankrah1 wrote: Thank you gone girl. Oncologists know a lot of theory. I have read and listened and read and listened. But up to this point the practical application of their theories is measured on a 5 year survival scale assuming their theories work. Most of the time the theories dont work. And the times when they work very well they dont know why. Certain unapproved things work outside their theory, but are ignored because they have not yet been subjected to the rigors of testing. They are written off as anectdotes, of no value. When Jen first posted I voiced skepticism about going off everything based on an anectdote. Her response showed that she is very smart to listen to others outside the field of oncology expertise. Then others took over the thread to make it about themselves. I have seen this dynamic a few times where people have been run off these boards. They have nothing to learn, and would throw a monkey wrench into any good discussion. There is exbrnxgrl who is taking letrozole every night yet claims she is not actively fighting cancer. I am so discouraged by these hijacks. I hope that one day Jen will come back to enlighten me. I will keep checking.",
      "MessageIndex": 61,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 7, 2018 11:45PM - edited May 8, 2018 02:29AM by Moderators Exbrnxgrl, I know very little about cancer. You know a lot. Others know a lot. I am learning from what you and others write. You bring vibrancy to a discussion. When you take letrozole every night the purpose is to actively control your cancer. I believe you know that. So why would you say otherwise?  ",
      "MessageIndex": 70,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 5, 2018 07:41PM niiankrah1 wrote: Thank you for clarifying that you see your naturalist regularly. That is a big deal. It means that you are not off everything as your original post impressed. Until a permanent cure, not measured on a 5 year scale, is found, we are left with anectdotes. ",
      "MessageIndex": 27,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 6, 2018 09:09AM - edited May 6, 2018 09:11AM by niiankrah1 exbrnxgrl you are actively fighting your cancer by taking letrozole every night. I dont see how you can declare otherwise. Likewise the OP is also actively fighting cancer by regulary seeing a naturalist, though she does not want to give credit for reasons I would like to know. Letrozole counts for something, and naturalists also count for something. Am I missing the point ?",
      "MessageIndex": 38,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 6, 2018 12:48PM niiankrah1 wrote: The main point of the OP, as I see it, is that her doctor thinks she has exceeded expectations as a stage 4, given that her treatment worked. She is a miracle because she is not expected to still be responding and doing this well. Compared to others similarly situated she is different, a one off. Others dont get this long a ride. Rare. As far as her oncs are concerned it is all due to conventional treatment. But we have since learned that there is unconventional treatment as well, which is ongoing, which was not initially mentioned, and for which no credit is given. What is this treatment and why is no credit given? When treatment is integrated credit must be given to all parts. There are people scouring these boards, looking for glimmers of hope like in this instance, right now and long after this thread tapers off. The OP will do us a lot of good by telling us about the unconventional treatment component. Conventional treatment works. Integrated treatment also works.",
      "MessageIndex": 42,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    },
    {
      "AuthorID": "niiankrah1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223158/profile",
      "Content": "May 6, 2018 06:54PM niiankrah1 wrote: exbrnxgrl if you know the details of the OP's unconventional treatments then fill us in. I am hungry for this information.",
      "MessageIndex": 45,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864357",
      "Title": "I am a miracle?? Ok, I'll take that!! JeninMichigan Moderators"
    }
  ]
}