{
  "AuthorID": "nikkiea76",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
  "Posts": [
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "nikkiea76 wrote: I had a duct excision last Tuesday, I was told to take the main bandage off 48 hrs after surgery, which I did.  So now all that was covering the wound was steri-strips.  Last night they started coming off, and I can actually see the \"wound\".  The edge of my nipple is rolling up.  It is like an area rug on a hard wood floor, and you can roll up the side.  It doesnt roll up too much, but im wondering if this is normal?  it doesnt look good.  I am wondering is the edge of my nipple always going to have that \"edge\" to it?  When I saw it last night I was mortified.  I put some peroxide on it and a big bandage over the steri-strips.  I plan on calling the dr at 9 am.  I was just wondering if anyone had this experience as well? Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/735501",
      "Title": "is this normal? nikkiea76 LynneB"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "Apr 22, 2009 11:06PM nikkiea76 wrote: Thank you everyone so much!  I am just a ball of nerves, and this site has been a wonderful retreat and reminder that there are so many of us out there that have been affected by BC one way or another and that none of us are alone.  My appointment is tomorrow morning with the surgeon, and i am pretty sure nothing will happen tomorrw and we will just decide the next step, but I am anxious nonetheless.  When this whole thing began, everyone in my fam kept saying \"oh its prob. just ur hormones\" (being that I only have 1/2 a thyroid due to a tumor that I had removed 10 years ago) but when all the test came back that it wasnt hormones, i really began to panic.  Part of me knows its prob nothing and I should just relax, but how do you do that?  Especially after caring for your mother, and seeing all she went through.  Cancer has been running like wild fire through my family these past 2 years alone, and im sure that is what has me all worked up.  My mom is of course doing wonderful now but she went through so much, and I have 5 children, how will i keep up with them and with everything?  ok so im panicking alot....lol I am sure in a few weeks we will all be laughing and I will feel so silly for being so worried when it turns out to be nothing...lol thanks again for letting me vent!  u guys rock!",
      "MessageIndex": 5,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732807",
      "Title": "appointment with surgeon on Thursday nikkiea76 nikkiea76"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "May 13, 2009 05:46AM nikkiea76 wrote:",
      "MessageIndex": 8,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732807",
      "Title": "appointment with surgeon on Thursday nikkiea76 nikkiea76"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "nikkiea76 wrote: Hello , I have been reading through most of these post all day, and I am so happy a forum like this one exsists!  i am almost 33 and I am a mother to 5 children.  My mother was diagnosed with bc when she was 42.  She is 10 years cancer free now.  Some months ago I began having nipple discharge from my right nipple.  I had a mammo and some blood work done (thyroid, and prolactin) all came back ok.  at the time we didnt have insurance and I saw a surgeon who wanted to do a sono and possible removal of the particular milk duct that seemed to be the problem duct.  I could not afford anymore tests.  We now have insurance and we have relocated.  I went to my ob/gyn, where he took a slide of the discharge from the nipple, and he referred me to a surgeon, where I will be seen this thursday morning.  I am so nervous and so scared.  My family says I shouldnt be so worried that it is probably nothing, and maybe they are right, but i cant help but worry.  Am I just being paranoid? Thanks for listeniing! (well for reading...lol) -nicolle Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732807",
      "Title": "appointment with surgeon on Thursday nikkiea76 nikkiea76"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "Apr 21, 2009 06:39AM nikkiea76 wrote: Thank you so much for your reply!  It is not a milky discharge, it is mostly  clear although sometimes it appears to have a  bloody tinge to it.  My mother had a lumpectomy and 3 of her nodes removed.  she had chemo and radiation and was on tamoxifen for 5 years.  She is an awesome role model.  People do get better!  That is an inspiration in itself! thank you again.",
      "MessageIndex": 2,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732807",
      "Title": "appointment with surgeon on Thursday nikkiea76 nikkiea76"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "May 14, 2009 10:03PM nikkiea76 wrote: Good morning Stephanieb, Thank you so much for your post!  you gave me so much info, so I really feel like I know what to expect!  Do you happen to know how long the duct excision takes?  i just like to know approximately how long I will be under for...lol  Tomorrow is my MRI and I think I am ready, although we seem to be getting a stomach bug in this house and I feel it coming on today, ugh I hope its gone by tomorrow. Thanks agin for all the info, you have really helped me ease my mind a bit.",
      "MessageIndex": 10,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732807",
      "Title": "appointment with surgeon on Thursday nikkiea76 nikkiea76"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "May 16, 2009 10:18AM nikkiea76 wrote: Thanks again for the info on the surgery.  I just got home from my MRI a few hours ago and it wasnt as bad as I had played it all out in my head.  i will have the results on Monday.  so this is gonna be a long weekend.  thank you again.  I have been bragging about this site to all my family and friends.... it has been a life saver.  ill keep you posted!!",
      "MessageIndex": 12,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732807",
      "Title": "appointment with surgeon on Thursday nikkiea76 nikkiea76"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "Apr 24, 2009 07:17AM nikkiea76 wrote: hello everyone.  so I went to the surgeon today and he did another slide of the nipple discharge.  I have an ultrasound at the breast center at a nearby hospital tomorrow morning, and we discussed doing the major ductal excision.  I am game for it, to be honest.  I want to know for sure what is goin on in there.  So I go back to him in exactly 2 weeks, we should have the results from the slides and the ultrasound and we will then decide what to do next.  So I guess ill be stressing for another 2 weeks! lol I am going to be working out alot in thie next 2 weeks...lol  Thank you guys again for all of your support!  I will keep you posted.",
      "MessageIndex": 7,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732807",
      "Title": "appointment with surgeon on Thursday nikkiea76 nikkiea76"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "nikkiea76 wrote: B9!!!  this is what my path report says... Fibroadenoma and intramammary lipoma. fibrocystic changes with duct epithelial hyperplasia, apocrine metaplasia and focal psuedoangiomatous stromal hyperplasia to be honest, my surgeon did not explain any of these things to me and I am having a hell of a time trying to decifer them myself.  do i need to be concerned about the hyperplasia in the future?  my surgeon wants to see me again in a month. and he said my nipple \"roll up\" looks just fine. thanks everyone! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/735527",
      "Title": "I got my results today nikkiea76 lvtwoqlt"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "Jun 11, 2009 01:44PM nikkiea76 wrote: good luck to you!!  you will do great!  the hardest part is waiting, but we can help you with that too!   good luck!",
      "MessageIndex": 2,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/735699",
      "Title": "Biopsy @ 3:30 today CKCSLover CKCSLover"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "Jun 8, 2009 01:02PM nikkiea76 wrote: LOL!!  my doc didnt even put new bandages on me, he just said to keep wearing my sports bra, and if I wanted to put one of those big bandages on i could so it doesnt get irritated (thank you o wise one)  I feel like i cannot find any straight answers to the things on my report, but i think since im anxious, im all over the place.  lmk as soon as you hear anything!",
      "MessageIndex": 3,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/735527",
      "Title": "I got my results today nikkiea76 lvtwoqlt"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "Jun 8, 2009 01:38PM nikkiea76 wrote: men... is all i have to say to that.  Maybe he is trying to tease you to make you laugh?  I have a good feeling, everything will be b9 for you too, try not to let him get to you. again....men is all i can say....lol",
      "MessageIndex": 6,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/735527",
      "Title": "I got my results today nikkiea76 lvtwoqlt"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "Jun 8, 2009 08:15PM nikkiea76 wrote: Mamamari, I think you are doing the right thing by going for the excision/lumpectomy.  my mother was dx with bc when she was 42, in turns out her mass was left in for awhile because they said it was b9.  she is cancer free 12 years now, but i say surgery is the way to go.  it was a no brainer for me, i didnt want to take any chances.  when it comes to something as serious as bc, you have to do whatever it takes to put your mind at ease.  good luck and keep us posted!  i got my results of b9 today, but my bs didnt explain anything to me that is on the report...like the hyperplasia...tomorrow i am going to another dr. to have the report explained to me.",
      "MessageIndex": 27,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732947",
      "Title": "bloody nipple discharge amybrown MTwoman"
    },
    {
      "AuthorID": "nikkiea76",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82575/profile",
      "Content": "Jun 11, 2009 02:42PM nikkiea76 wrote: ooo i went to disney too....girls i think we are on to something here...lol eagle713- my new wonderful glorious surgeon said although the hyperplasia are not cancer cells, they are \"angry\" cells (i thought that was a great way to put it) so between the hyperplasia and my mother having bc at 42, he is going to do a different type of biopsy in 2 months after im all healed up.  he is even going to do it on both breasts.  he said it may be able to show what is in store for me in the future.  I believe the test is called a ductal lavage. ",
      "MessageIndex": 34,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732947",
      "Title": "bloody nipple discharge amybrown MTwoman"
    }
  ]
}