{
  "AuthorID": "ninjamom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85866/profile",
  "Posts": [
    {
      "AuthorID": "ninjamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85866/profile",
      "Content": "Aug 16, 2009 11:26PM ninjamom wrote: I am currently awaiting bilaterals with T/E, scheduled 8/27. I have been through chemo already, I had my first dose on March 20th Taxotere/Carboplatin/Herceptin. I was switched to Abraxane/Carboplatin/Herceptin on my 2nd dose and continued to get that weekly until June. I can share with you the main things I learned and hopefully it may help some of you. When they give you the anti-nausea drugs, take each and every one you are suppose to take even if you feel okay. Also, the mound of drugs they gave me with the first dose did not work very well at all. I was then switched and put on Emend (3pk pill 125 mg and 2 80 mg) it worked very well for me. One thing I did find with it was it does constipate you. I have had problems with that my entire life but nothing even came close to what that stuff did to me! It worked great on the sickness but be sure you take stool softeners with it. I was able to work after the first few weeks and just went home and rested when I needed to. I believe for me the fear of the unknown was the worst. Just like this surgery coming up. I will be glad once it is over with and I am recovering. Best wishes to all of you!",
      "MessageIndex": 5,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738978",
      "Title": "Starting chemo September 2009 krcll sanaisa"
    },
    {
      "AuthorID": "ninjamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85866/profile",
      "Content": "Aug 16, 2009 06:42PM ninjamom wrote: I had my last treatment the middle of June and I have a full head of hair now, it is just barely starting to creep over the top of my ears. I wore a baseball cap all the time and just this past weekend I went all weekend without it. I have already colored it as well and it is very short but I just couldn't take the grey anymore. It did just fine and now I have my dark hair back. I haven't noticed any curls yet but have been told it is not quite long enough to tell. I didn't completely go bald but had bald spots so I shaved it down several times through treatment. I was worried about the top coming back in at first but it has done great. I will be glad when it gets long enough to look like a trendy haircut, I still get those strange looks and double takes. It has only been 2 months since treatment though and I do have a full head of dark hair now so I think that is very good! It will grow, I just think chemo effects everyone differently. Hang in there!",
      "MessageIndex": 3085,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}