{
  "AuthorID": "Nisha517",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
  "Posts": [
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Sep 21, 2018 07:06AM Nisha517 wrote: I’m 37 years old. My first infusion was on 8/10. I got a regular period for that cycle. However, my second infusion was 9/4 and I was technically supposed to get my period last Saturday and did not. I also had no cramps or symptoms of getting my period. So I guess my menopause has kicked in. I’m not too mad, however, because to have to deal with cramps and a period while trying to over come side effects from chemo is too much for me to ha",
      "MessageIndex": 293,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Sep 22, 2018 07:00AM Nisha517 wrote: hi m- I am the same way, my hair is very important to me. Some may call it vain, but we are going through so much, that to be somewhat normal, I feel like having hair, even if it’s a wig is important. Let us know how your wig looks, and I hope you stay well and continue to not have side effects",
      "MessageIndex": 305,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Sep 24, 2018 05:58AM Nisha517 wrote: I have also noticed blurry vision and I’m not on AC. I’m sure it’s just an unfortunate, temporary side effect of the chemo. But it is always a good idea to get it checked out for peace of mind. For those who can’t be as active during these trying times, it’s nothing to feel guilty about. Everyone is different. Our bodies do things differently. You should be fine with whatever you are able to do. Even if it’s a 10 minute walk, hey you did something and that is a huge accomplishment! This is your time to heal, not push yourself too much to exhaustion I see number one concern for most woman is losing hair. Mine too. I guess we just have to accept this as another unfortunate side effect of this terrible disease. My fear also is that if people see me bald, they will see me as sickly and feel bad for me. I don’t want that. Lookup09- welcome! My biggest suggestion to you will be to make sure you do everything you can to combat the possible side effects. This can also mean taking medications a few days before chemo, eating or not eating a certain foods the week of chemo and on chemo day that will bother you later. Make a daily medicine chart. There’s a lot of great advice on here about controlling SE’s or talk to your MO or infusion nurse in detail about it all",
      "MessageIndex": 331,
      "PostDate": "24/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Sep 23, 2018 06:07AM Nisha517 wrote: stopping cold caps and getting a wig wasn’t an easy decision because I wanted my own hair at the end. But then I saw how popular wigs were even with non-cancer patients who just want a new look, it motivated me to just go that route. The difference is that I have to get a wig because of a disease and those people don’t, but oh well",
      "MessageIndex": 313,
      "PostDate": "23/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Sep 21, 2018 05:34AM Nisha517 wrote: are there any ladies on here who uses Taxotere ans did suffer permanent hair loss??",
      "MessageIndex": 289,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Sep 22, 2018 03:48AM Nisha517 wrote: I actually cold capped for my first 2 chemos in hopes to saving at least most of my hair. However, after seeing how much fall out I had after just the first chemo, I decided to order a prosthetic wig. I just couldn’t deal with the stress of trying to get better and having to deal with hair loss. I didn’t want the uncertainty of not knowing how well the cold cap will or will not work. After my second chemo A LOT more hair fell out. I am lucky, people can’t tell how thin my hair has gotten and I’m able to cover up the little bald spot I have on top, but I’m glad I opted to get the wig and notworry about cold capping. My third infusion is next Friday and I won’t have my wig till mid October so I’ll still have to cold cap for that infusion. I just hope I don’t lose too much More hair before the wig arrives. I honestly would’ve loved to still have all my own natural hair at the end of all the chemos, but managing hair and chemo side effects at the same time is too stressful",
      "MessageIndex": 302,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Sep 26, 2018 08:17AM Nisha517 wrote: my infusion nurse never suggested this, but I am definitely going to try it on Friday! Thanks you",
      "MessageIndex": 362,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Nisha517 wrote: hi all- Can someone send what they do and take to relieve all sideeffects of chemo including but not limited to nausea, vomiting, diarrhea, body aches, mouth sores, gum bleeding/tenderness, weakness, insomnia, lack of appetite, no taste, etc. what do you take or do days before chemo, during chemo and after chemo? Thank you! Dx 7/11/2018, IDC, Left, Stage IIIA, 1/1 nodes, ER-/PR-, HER2+ Targeted Therapy 8/10/2018 Perjeta (pertuzumab) Chemotherapy 8/10/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867357",
      "Title": "Controlling chemo side effects Nisha517 Nisha517"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Sep 23, 2018 08:06AM Nisha517 wrote: thank you, all!!! This is great information!!",
      "MessageIndex": 4,
      "PostDate": "23/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867357",
      "Title": "Controlling chemo side effects Nisha517 Nisha517"
    },
    {
      "AuthorID": "Nisha517",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280168/profile",
      "Content": "Oct 8, 2018 04:42PM Nisha517 wrote: Robyn- My first two rounds felt way worst than a flu. To be honest, I felt like I was dying. But I hadn’t educated myself on how to minimize SE’s. The third time around my husband and I did a lot of research on what to do and take even before chemo day and the 3rd time around was different. The worst thing I feel so far third time around (I’m day 10 after the third chemo), is my mouth became EXTREMELY dry this time, not even biotene was working. My husband can see white dryness on the roof of my mouth. And the taste in my mouth this time around was way worse, also. Due to all this, my gag reflex was heightened and I puked twice on Saturday. I also haven’t been been able to eat or drink properly since Friday. Buthopefully today all this is subsiding. I also can’t sleep night. I sleep more in the daytime. But all in all, keep up with all the possible side effects medications even if you don’t have the SE’s and that should help. I’m thinking that because I took so much medication, that may have caused the bad dry mouth.",
      "MessageIndex": 19,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863885",
      "Title": "TCH - what to expect? and THANK YOU! Roots RobynS4"
    }
  ]
}