{
  "AuthorID": "Nitsana",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68754/profile",
  "Posts": [
    {
      "AuthorID": "Nitsana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68754/profile",
      "Content": "Jun 26, 2008 05:55PM Nitsana wrote: Hi i dont know about the rate of recurrence unfortunately - but your doctor should be able to tell you. There is an online tool called Ajuvant - dont remember the link or i would tell you - but i am pretty certain that your oncologist can tell you - and it gives scores for your particular situation - for recurrene with and without different treatments.  thanks for all this information by the way - it really is helpful. i am an ex-smoker with concerns about radiation (with or without being an ex smoker!). What i did notice about the article (pointed out in the comments by the Breast Cancer org on the side) that the study was done many years ago and the type of radiation was different than was done now. However, BreastCancer org's comment says that current practices mean that they dont radiate to the lungs - but I've done my simulation for radiation - and they necessarily will radiate 2 cm of my lung - which they consider small - and from what they say that is quite common to radiate a small part of the lung when radiating right breast. So, it seems that perhaps modern treatments reduce the effects to lungs - but do not exclude it completely. Thats what it seems to me... but i am still doing more research on this. There is also another treatment - which seems to be still experimental - called Partial Breast Irradiation - where they only deliver radiation to the area of the tumor as that is the location of most recurrences. Seems to have positive of leaving lung out and negative that not much is known about it  - no long term knowledge. And also - less is known on giving higher doses of radiation at one time - which this treatment necessitates. if anyone has knowledge about that - would l;ove to hear! ",
      "MessageIndex": 5,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/705853",
      "Title": "Smoking and Radiation Therapy Leia Shirlann"
    },
    {
      "AuthorID": "Nitsana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68754/profile",
      "Content": "Jun 27, 2008 11:00PM Nitsana wrote: i am also about to start radiation and this time has been harder for me than any other time during my treatment too - and especially because everyone around you is kind of thinking that you are almost done with it all - and so you feel like you are supposed to feel happier. And something about subjecting yourself to more pain and a kind of poison - no matter how good for you it is - is difficult, It really helped me to see how many other people experienced the same feeling - and it is just par for the course and it passes. It is ok to cry and to be weak - and to ask the people around you for help. Im glad you wrote in your feelings - and I send you much love and understanding. Remember your thoughts and feelings are not you - they are valid and normal but they pass and soon you will feel completely differently.  I find meditation helps a bit - and also sometimes just going out and doing something fun - with one person who will be there for me - not a whole group where you can feel lost. Big birthday parties and hosting can be daunting at the best of times. Try as much as you can to reduce the things you take on yourself and pamper yourself - let people take care of you! You deserve it! ",
      "MessageIndex": 7,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/708195",
      "Title": "I'm desperately unhappy just now. jacquibutterfly dalycity"
    },
    {
      "AuthorID": "Nitsana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68754/profile",
      "Content": "Jun 27, 2008 11:19AM Nitsana wrote: thank you all for your posts!! I am going through the same questions just now. I am after a lumpectomy in each breast and a/c chemo, her-, estrogen+ 1,5 cm intraductal with cribform pattern and hi k. Tomorrow i am meeting with a specialist who does the partial radiation as i am concerned about effects on my lung (I thankfully only have to radiate right breast). I was recommended whole breast by my doctors but i am looking at other options and really having difficulty choosing, even considering maybe going back and doing a mastectomy - but that doesnt really feel like what i want to do. I just want to say how grateful I am to hear all of you express a lot of what I feel - confusion at the different options, absolute exhaustion with being treated - even though you know it is for the best and you should be thankful for it, feeling fed up with being strong, being scared of the medication - and also scared of not taking the medication... Reading these posts really helps me feel normal and to stop being angry at myself for the things that are hard for me. And actually to congratulate myself for dealing with what I am dealing with.  Thank you - and kind, best wishes to everyone here who is making these decisions that no one can really help us with!",
      "MessageIndex": 13,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/707537",
      "Title": "focused radiation vs whole brest radiation Marykak Nitsana"
    }
  ]
}