{
  "AuthorID": "nixie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173382/profile",
  "Posts": [
    {
      "AuthorID": "nixie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173382/profile",
      "Content": "Oct 10, 2013 05:26PM nixie wrote: we were told by the ultrasound doctor that it looked suspicious. when i pressed him, asking him his opinion he said 99.9% cancer.",
      "MessageIndex": 21,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/812591",
      "Title": "45 yr old found a 3cmx1.5cm AnnieeC Janet456"
    },
    {
      "AuthorID": "nixie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173382/profile",
      "Content": "Oct 10, 2013 05:03PM nixie wrote: let me give u the basics annieec; all figures are approx. short term uve got nothing to worry about. usually (but not always) breast cancer is a lazy cancer. malignant = cancer benign = non cancer the reason they do a biopsy is to find out what grade your tumour is. also to find out whether ur tumour is oestregen driven. they also do a biopsy to check whether the cancer has spread to the nearby lymph nodes.they put the clips in to see how well u r responding to the treatment. usually with a tumour that size they mite offer neo-adjuvant chemo. that means u r given the chemo first so that u can preserve u r breast and have a lumpectomy rather than a full removal. u r medical team will run all the options with u. treatment is usually in 4 parts. operation, chemo, radiation and hormonal treatment. my wife just finished radiation very recently...seeing the surgeon tom'row. she is doing ok. also the next year of ur life will be spent in and out of hospital and treatment centers. dr appointments. scans. dont let this put u off. thats the procedure. be strong. support groups for spouses? not where we live. mind u being billy no mates i wouldnt wanna join one even if there was one. ;)",
      "MessageIndex": 18,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/812591",
      "Title": "45 yr old found a 3cmx1.5cm AnnieeC Janet456"
    },
    {
      "AuthorID": "nixie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173382/profile",
      "Content": "Oct 10, 2013 05:22PM nixie wrote: birad4 means suspicious, biopsy needed to confirm that the mass is indeed cancer.",
      "MessageIndex": 20,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/812591",
      "Title": "45 yr old found a 3cmx1.5cm AnnieeC Janet456"
    },
    {
      "AuthorID": "nixie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173382/profile",
      "Content": "Oct 10, 2013 10:46AM nixie wrote: ull find some pretty switched on people here that can help. ultrasound doctor pretty much can tell just by taking a look at it. this was the case with my wife (same age as u by the way). my wife was diagnosed 8 months back so its still pretty fresh. next week or so ull b bombarded with info and u wont b able to process it. have a good cry and say it with me. fuck it, im gonna beat this shit. uve got a long journey ahead of u and a lot of thinking to do. i know its difficult but b positive. biology of belief by prof lipton. dont worry if u dont know who he is ull soon learn. :) wish u nothing but a speedy recovery...",
      "MessageIndex": 7,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/812591",
      "Title": "45 yr old found a 3cmx1.5cm AnnieeC Janet456"
    },
    {
      "AuthorID": "nixie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173382/profile",
      "Content": "nixie wrote: right, hello people. mrs is gonna start chemo on the 15th b4 they do the op. i hear a lot of people r taking ahcc. ive done a lot of research on this. now, i know its not a cure but a treatment. having said that some of the research is impressive. like this one. spolier, pics of dead lab rats... http://www.sciencedirect.com/science/article/pii/S0041008X07001366 ok with most chemo drugs taking ahcc is fine but with some it makes them weak. also tamoxifen and ahcc uses the same pathway possibly making tamoxifen less efficient. having said all that some people in here r using it. wanted opinions on this matter. our onc said: 'as long as u dont take 30gr of vit c everyday take what u want' mind u he also said 'diet doesnt change ur prognosis'. ty in advance. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/801645",
      "Title": "ahcc with tac chemo nixie nixie"
    },
    {
      "AuthorID": "nixie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173382/profile",
      "Content": "Mar 23, 2013 09:00PM nixie wrote: first meeting with our chemo consultant: me: we now have cut all dairy products from her diet doc, because of the igfs. doc: u shouldnt have bothered, it aint gonna make a difference to ur prognosis. me: u piece of shite. (didnt say it. just thought it. mind u, u didnt have to be a mind reader to figure out what i was thinking.) got many more...",
      "MessageIndex": 601,
      "PostDate": "23/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    }
  ]
}