{
  "AuthorID": "njnative",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66614/profile",
  "Posts": [
    {
      "AuthorID": "njnative",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66614/profile",
      "Content": "njnative wrote: I have been searching for some info. This last surgery days ago was my 5th reconstructive and I thought last since my right breast mastectomy for DCIS. I told my PS that I wanted a nipple that would match my left breast and what resulted was like literally a finger. I freaked and my PS said oh don't worry it will get smaller. It's been a week and it still looks like a part of a finger -it's so big.. plus they cut a circle around that which I didn't expect (thought the tattoo would cover that) any body have info on this stage of nipple reconstruction?? Diane Dx 1/6/2017, IDC, Left, <1cm, Stage IA, Grade 1, 1/1 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738141",
      "Title": "5th surgery nipple reconstruction njnative mawhinney"
    },
    {
      "AuthorID": "njnative",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66614/profile",
      "Content": "Apr 20, 2017 10:35PM njnative wrote: I am having a lumpectomy May 11th left breast after having a mastectomy and reconstruction right breast 9 years ago. I work full time (desk/computer type work) and I wonder how much time I should put in for disability. With the mastectomy it was kind of intense and I took 6 weeks off. I am understanding that the lumpectomy will be less invasive. The surgeon says 2 weeks but will sign off on whatever I need and I want to take as much time as I need. What do you think....is adequate. I am also big chested and wearing a bra to work will be an effort or at least it was with mastectomy. I would appreciate any insight/advice. Thanks.",
      "MessageIndex": 16,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "njnative",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66614/profile",
      "Content": "Sep 18, 2008 06:47AM njnative wrote: took me two weeks and you think it would be easier because I am a single mom and don't have anyone to share the \"peek\" with. I made a conscious effort to look away in the shower but after 2 weeks got the strength to look. I have to say it was hard, I had big boobs.... so I got used to it as we do and now after reconstruction getting used to it again. I would love to have my old body back but understand that this is pretty darn good in the scheme of things.",
      "MessageIndex": 9,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721344",
      "Title": "Getting your first peek after Skin Sparing Mastectomy Route53 Route53"
    },
    {
      "AuthorID": "njnative",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66614/profile",
      "Content": "Apr 22, 2009 03:16PM njnative wrote: It will come together. I hear your confusion... I was there and still am on the next phase but it always seems to work out. I couldn't believe that my expander phase could work out to a regular size breast. I was filled to 750 and it was still high and small in comparison to my original breast. I have actually had 3 surgeries to finish my breast and I am really happy now.",
      "MessageIndex": 10,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732454",
      "Title": "Did anyone have a \"two-part\" boob? robinjs19 robinjs19"
    },
    {
      "AuthorID": "njnative",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66614/profile",
      "Content": "Jun 5, 2008 01:46AM njnative wrote: I had a unilateral mastectomy with expanders and snb 2 weeks ago. I could drive as soon as I was off pain meds and that was after a week. I am a single mother and had my best friend stay with me for 4 days and was fine to get around after that. I really needed her more for moral support and to help with my kids. I took a leave from work for 4 weeks which seems just right. I still have my drains and should have for 4 weeks which is the only thing that is keeping me from doing more outside of the house. I'm sure everyone is different with recovery but other than having to sleep on my back and the soreness it's not as bad as I imagined. Hope this helps. Diane",
      "MessageIndex": 7,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706657",
      "Title": "How long will I need FT help at home after surgery? BustersMom Nice_Nichols"
    },
    {
      "AuthorID": "njnative",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66614/profile",
      "Content": "May 15, 2008 01:50AM njnative wrote: I'm confused. i am having my mastectomy on Tuesday and just had my preop and asked my PS when can I take a shower and he said in about 3/4 days after surgery.. Is it really 3 wks?",
      "MessageIndex": 4,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705463",
      "Title": "after surgery, when can I take a bath? kaye45 AnnNYC"
    }
  ]
}