{
  "AuthorID": "Nkb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
  "Posts": [
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 6, 2017 05:50PM Nkb wrote: Finallyoverit- I understand completely your feelings about your progression. I feel like I went through all the really dark horrible days and nights with the initial diagnosis. Always felt like the other shoe was going to drop- now it has and I feel calm.",
      "MessageIndex": 16,
      "PostDate": "06/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/859021",
      "Title": "Question about protocol finallyoverit finallyoverit"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 30, 2017 07:22PM Nkb wrote: I started out IIIC which was a new category then and thought to be poor prognosis. I felt more comfortable on the stage III posts. Now I am IV and mostly stay on stage IV posts. The people there are great and many thoughtful suggestions and lots of research and heads up about new meds. I think part of it has to do with what is relevant to you at the time. At the beginning I did feel that stage IV was a death sentence and glad I didn't have it- but, I didn't know anything about it at the time. I'm just surprised that stage 0-->Stage IIIC all have the potential to become stage IV-none of us are immune to this. (and some people 20+ years later) Ultimately we ALL need $ and options for a cure. Check out some stage IV and see if they work for you.",
      "MessageIndex": 12,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/859021",
      "Title": "Question about protocol finallyoverit finallyoverit"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 8, 2017 06:18AM Nkb wrote: I just wanted to add that every child has a different response and need to know. You as the mom are the best judge of how to handle it with your own kids. I wanted to tell my kids in person (20,20 and 24 at the time) they came home for Christmas and I was going to tell them when one of their friends committed suicide-so I thought that is enough sorrow. Anyway-put it off a few days and downplayed it a lot-hadn't had surgery yet so I didn't really know how bad it was. We all cried together. I did end up needing chemo and radiation so I am glad I had told them-, but, also glad they were away at college for the tough parts. They did call me every chemo day which I loved. 5 years later when I got mets to my bones I asked my MO should I tell the kids? And she said, if it was in your liver I would say yes, but, maybe not while it is just in your bones. I did visit with each of them separately and told them - the first question they each asked unbeknownst to the others was \"How long have you known this?\" I was really glad I had told them right away-sometimes they worry more if you don't tell them. ",
      "MessageIndex": 30,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860382",
      "Title": "How and when did you tell your kids? ps0705 NotVeryBrave"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 20, 2017 02:18PM Nkb wrote: 2012 Bilateral Stage IIIC 45+ nodes 2017 Mets to bones and bone marrow",
      "MessageIndex": 405,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Mar 6, 2019 07:07PM Nkb wrote: I have had mine done every month since the Mets diagnosis and although they bounce around A LOT when they trended up 2-3 months in a row it was predictive of progression. The progression was detected by PET scan after seeing them trend up. Some people have quite normal TMs even with progression- so it is really a matter of seeing if your numbers are helpful or not",
      "MessageIndex": 2,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870098",
      "Title": "Carcinoembryonic antigen (CEA)/CA-15-3 Blood Tests nowaldron Nkb"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 7, 2019 08:49PM Nkb wrote: This has been really interesting to read people's take on this. It really shows the \"art\" involved in medicine and how our MOs are all trying to figure this out. I had no scans after initial treatment for Stage III C ILC- was on Arimidex only for about 5 years. I was told that there was no advantage to detecting MBC early- to wait for symptoms. I don't know when the bone mets and bone marrow mets actually occurred- I was severely SOB on a hike and had a HGB of 7.5- that led to the discovery. Perhaps if it really started 2 years earlier and frequent scans would have picked it up- but, I may have not have been given Ibrance- maybe would have burned through a bunch of treatments. Who knows? After the MBC diagnosis I had scans every 3 months times 3- then at 4 months. My MO told me if all stayed stable I could wait a year for another scan. I was shocked and a bit worried. But, she said that I had such a good response and she has so many patients on F/I for 3-4 years that she thought the monthly lab and TMs was enough unless I wanted a sooner scan or felt bad. It's been 9 months since then and I find that I am less worried and consumed. Yes, a stable scan made me happy- but, only for a short while- then I started worrying about the next scan. I felt like I could get off that seesaw a little. My TMs are super high- they went down about 40% with I/F and now bounce around- now they are heading up again and I will have a scan- If it is a small progression I hope to deal with it with radiation and stay on I/F as Cure-ious has planned. My MO did mention that studies have shown that too much surveillance is psychologically damaging to people- but, she would go with what I wanted to do also. Since I am kaiser- I do not need insurance permission, and no co-pay for the scan, I get PETs due to her preference and my allergy to CT dye. In the back of my mind I see all the comments about scans not being accurate esp if you have ILC- hard to hang your hat on any one approach. TMs are a crap shoot too for many. ",
      "MessageIndex": 22,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869169",
      "Title": "An Interesting Perspective on MBC Progression Monitoring Bestbird Heidihill"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 7, 2012 03:43PM Nkb wrote: I was getting chemo today and overheard the nurses chatting in the nurses station and one said \" I know some really good hair removal products, I'm going to bring them tomorrow for you to try\" And I thought I know a really good hair removal product too! Lol",
      "MessageIndex": 17009,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 7, 2012 08:09PM Nkb wrote: Nails nails nails- mine feel sore and I have slight neuropathy, fingers kind of clumsy, but, ok. They look a little weird and are tentative. I can't do certains things without apprehension. Anyway- I went to try on some new shoes( def, finally feel up to a little retail therapy, plus, all my old shoes hurt a little now). Anyway- the sales lady brings me the box of shoes, i open the box- they have never been tried on before and there is paper stuffed into the toes. I can't get it out! Hurts and seems too hard. I consider asking the lady sitting next to me to pull it out,but, worry that she'll think I'm a complete nut. Finally, with lots of probing with my knuckles I get it out. The simple things in life.",
      "MessageIndex": 17016,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 21, 2012 12:15PM Nkb wrote: Aem and Kristen, how much PFC did you start the biotin?",
      "MessageIndex": 17208,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 24, 2012 04:47PM Nkb wrote: 10 days PFC- Eyebrows have fallen back out,but only in the middle. Eyelashes scraggly and mostly blond, a few are two toned. Hair that grew in during taxol is white and 1/2 inch long, but shedding daily, no new growth yet. Rest of body 99% hairless. I have a baseball hat with hair attached that looks the most natural and a wig and a few hats. No merkin. Nails are rainbow color and very painful. Never knew how much I used my nails! Feeling a little down today and muscles tight and hurting and am tired- hoping as I move further away from the taxol I will feel better. Reading your posts really helps my mood- you understand.",
      "MessageIndex": 17274,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 13, 2012 02:19PM Nkb wrote: Well doing rads has given me less time to obsess about hair growth! Am 4 weeks PFC and I have 2 upper lashes left on each side, no lower lashes, some scraggles of eyebrows, some are two- tone white and dark. On my head I have one inch of mostly white sparce on top, thicker but, not normal thickness on sides and back (fluffy stuff) and I can see one micron long new hairs poking out in between. Racy, I agree, if I had to do chemo again, I would strongly consider cold caps, they are quite pricy and require an assistant, but, maybe price will come down. This time I wanted chemo to get to all the places where cancer could make a comeback ( the scalp) and I heard such mixed reviews of the cold caps. I'll have to talk with my hair dresser about extensions when the time comes. I heard they were hard on your newborn hair- but, sounds like they worked well for you!",
      "MessageIndex": 17507,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 27, 2012 05:29PM Nkb wrote: MizMarie- I love your hair- looks like a real chosen style. New glasses too. What are you doing to make it behave and do you have plans to grow it longer? Joan- will you be posting a picture?",
      "MessageIndex": 17922,
      "PostDate": "27/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 2, 2012 09:53PM Nkb wrote: I think part of Kelly Pickler's hair is that it's all growing in at the same time whereas for me some hair began growing in a couple months ago and some just adding now and it's not not nearly as thick as hers. mine did stick up a lot at the beginning but it was more whispy.. She looks adorable!",
      "MessageIndex": 17979,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 24, 2012 11:01AM Nkb wrote: Lumpy- we are our harshest critics. When others tell you that you look good to them you probably do. The whole treatment process is exhausting and demoralizing at times and having hair is a very primal need. You will feel better and you are killing cancer .",
      "MessageIndex": 17266,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 6, 2012 11:06AM Nkb wrote: Kristen- you look so cute! So many women seem to be opting for a shorter hairstyle after this. Schatzi- haha I bet men do wear more hats because their heads are cold. I should continue hats when my hair is back, i always hated hats and only wore them in extreme situations- well when I was bald several areas in my the place i parted my hair had pre- skin cancer and needed to be cryoed.",
      "MessageIndex": 18222,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 13, 2013 08:02PM Nkb wrote: If I ever had to do chemo again I'd do the cold caps- although I had 16 rounds of chemo not 6. Losing my hair has been a lot worse than I could have ever imagined it would be. You lose so much including your privacy which I have come to discover I am value extremely highly. Good luck with the cold caps!",
      "MessageIndex": 18481,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 14, 2012 05:54PM Nkb wrote: Mama- how long is your hair now?",
      "MessageIndex": 17536,
      "PostDate": "14/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 17, 2013 01:34PM Nkb wrote: Thank you for the pictures you all look really good with the long hair and short hair. I think people say how cute you look because you do look cute and we are all being so much more hypercritical of ourselves than other people are. An old friend of mine just give me a picture from when we were both 24 and in graduate school, my hair was several inches past my shoulder and thick and beautiful and his hair was also several inches past his shoulders and in a ponytail. I said \"I don't think my hair is ever going to look like that again\", and he who is now half bald said \" I don't think mine is ever going to look like that again either\"! I had a trim six weeks ago and colored and now I'm going back next week to have it colored again.. I know my hair stylist is going to want to trim it again to make it look cute at this length but I'm going to resist and just let it grow for another couple months. I know I'm going to have to go through awkward phases where it doesn't look good, but, I'm going to just try to go for length right now. I'm 22 weeks PFC and plan to go without a wig after next week. My leg hair seems to be growing faster than my hair on my head, armpits slowed down, probably due to radiation. Eyelashes and eyebrows shedding although I do see some tiny new growth right behind them so hopefully it won't be too long without them.",
      "MessageIndex": 18512,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 23, 2012 05:25PM Nkb wrote: Congrats TNNurse! At first I could only see mine with a magnifying glass. You may want to take a picture every 1-2 weeks so you notice the change- it is encouraging.",
      "MessageIndex": 17894,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Feb 26, 2013 10:26PM Nkb wrote: I did not tell lots of people about BC so I kept my Wig on longer even when I took it off at about five months I got a tremendous number of comments. Seems like the whole world cares about our hair. I did go without my wig if we were on road trips to go into the store or bathroom. I had mine colored at about 17 weeks PFC and cut and it looked so much better but still seemed way too short to go public Without engendering a lot of comments as it was still fairly thin. The second time I had it colored I didn't cut it at all and then I stopped wearing the wig. It may be that younger women's hair comes in all at once but mine still has new hairs coming in seven months plus later and it's really thickening up now. I have decided to go for length for the next several months not trying to even it out, it will stay short for so long if I try to even out all the layers of hair that is coming in. I'm sure that my hairdresser could make it look a lot better but I decided I'm going to have to go through some awkward phases to get some length so may as well do it now. I had baseball cap with hair which I wore through most of the chemo phase unless I was inside, it was really cute and comfortable and looked just like my old hair. At some point as the weather got colder it seemed kind of silly to be wearing a hat inside and outside so I changed to my wig. Many people complemented my hair not knowing that it was a wig which felt kind of odd-and they were particularly disappointed to see my real hair so short. I find it incredibly convenient to have my own hair pretty much no matter what it looks like.",
      "MessageIndex": 18884,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 13, 2012 01:56PM Nkb wrote: MamaV- I definitely Understand. I'm going to have to face it in about a month when I color my hair and I know my hairstylist will want me to trim it a little bit and I dread it. I just thought if it would look a little better I would try to do it. Sounds like from what everybody says that it's going to be growing in layers for a year or two. I certainly hope mine continues to get thicker. my husband says that the length of my hair is similar to what many women in my area wear which is probably true, but mine is thinner and doesn't look like a style yet. Thanks everyone for sharing your hair stories no one else understands this obsession, they all think they would be fine without hair. When I was first told I would lose all my hair I was also a bit casual about it but I think it's because I thought it would grow back in three or four months. It is so reassuring to see people who were bald and now have a thick growth of hair again. A bit of a funny story I went for my colonoscopy yesterday I was wearing my wig which I think doesn't look real but, maybe other people do. Anyway one of the nurses said I love the color of your hair is it natural? I said no and she said \"I'll be right back I want the details.\" When she returned she said \"okay do you color it yourself or does someone else do it?\" I said \" it's a wig, I just had chemo.\". Suddenly three or four other nurses came in to all look and tell me how great and natural and beautiful it was. Several neighbors have also told me they like my new hairstyle, I just think it's a lot neater looking then my old hair was and that's what they're noticing, every hair eerily is in place all the time.",
      "MessageIndex": 18049,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 16, 2012 06:02PM Nkb wrote: I'm starting to have a lot of hair dreams. I dream I run up to sit with my daughter and her friends and oops I forgot to put my Wig on and my little 1 inch gray hair is showing. I think you should go get your wig, and I think no everybody already knows you don't have much hair. The next night it's the same dream except for it's about running into my son and his friends instead.",
      "MessageIndex": 18078,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 28, 2012 10:57PM Nkb wrote: Kjib! Your hair is so thick and a beautiful color. I hope mine looks that thick at 5 months. That's only 5 weeks away, so I sort of doubt it. What is your plan for eventual length?",
      "MessageIndex": 18169,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Apr 9, 2013 07:43PM Nkb wrote: I never had highlights, but, my hair is not taking the non permanent dye I used before chemo like my hairdresser likes it- she says it is dull. I said \" put highlights in\". She said it was too fragile right now for that. I'm 32 weeks PFC. I personally know nothing about highlights beyond that comment- but, others probably do.",
      "MessageIndex": 19120,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 9, 2013 02:04PM Nkb wrote: I am 21 weeks PFC and my eyelashes and eyebrows have started to shed over the last couple weeks. I hope they don't all fall out just thin or at least do it over a longer period to ensure better randomizing for the next cycle. I was really enjoying mascara and was putting a little color on the brows also. I had a trim and color -nonpermanent dye at 17 weeks PFC am going to have it colored again in two weeks, I really don't want to trim it again, although it is a layered mess. I'm sure my hairdresser will want to trim it but I just feel like I can't lose any length right now. What amazes me is that some of the hair started to grow in seven months ago while on Taxol and some of it is just starting to grow in now and everything in between-a truly layered look. I'm still wearing my wig outside although not inside at all. It's very odd that I get lots of compliments from people who don't typically notice things, about my (wig) hair, so expect to get a lot of comments about my real hair which is not as shiny, beautifully colored or styled. I don't feel ready for all the why did you cut your hair I liked it so much better before type of comments. In the looking around I noticed that actually most people's hair doesn't look very good. It typically doesn't look healthy or cut well which is maybe why the perfectly coiffed wig attracts so much many compliments. Once I get over the initial shock and questions from people I think it's going to be a great relief to no longer worry about throwing on the wig to take out the garbage etc.",
      "MessageIndex": 18437,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Feb 28, 2013 04:20PM Nkb wrote: I had my hair colored at 17 weeks PFC with the same color I had used for the last several years. it is not a permanent color and does not use peroxide it is more of a wash that fades over time I am a strawberry blonde. My hairdresser thought it looked dull compared to prior to chemo and there was one area that did not take the color well in front. I had it done again 7 weeks later and we decided to go slightly darker and my hairdresser also thought it looked dull not typical shiny, I have heard it takes nine months to a year for the shine to start coming back. I'm 28 weeks PFC and have noticed it starting to actually get a little oilier or dirty, before I didn't notice it ever looking or feeling dirty so maybe the oil glands are waking up or something. anyone know anything about this?",
      "MessageIndex": 18905,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 15, 2012 04:10PM Nkb wrote: Jpmom thanks for your response, i was so surprised when it started to grow during taxol, and then grew so attached to those little white fuzzies. I think my hair obsession has made my husband certifiably crazy! Thought I'd spend one day not talking about it ( he went backpacking which will make that a done deal!) I do think that taking a photo once every week or two would help, so will do that. Will you be doing radiation?",
      "MessageIndex": 16572,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 26, 2012 11:54AM Nkb wrote: Jp mom: sorry about the nodes, a shock to get over! Your hair looks quite thick and long Since lumpectomy was not an option for me, I had surgery first, an awful lot of positive nodes, freaks me out and hoping the rads gets whatever nodes are left. Starting arimidex probably next month and metformin also, the first dose of AC chemo gave me some major hot flashes! Had to change my pajamas 4 times a night some nights. Just had taxol #9 and the hair that started to grow after #2 is still falling out, all those hard earned 1/2\" little white hairs. Nails a bit sore too and eye brows seems suspended in growth at about 1/2 their usual length and too blond to see without a pencil.",
      "MessageIndex": 16815,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 18, 2012 10:12PM Nkb wrote: Wave whisper- never time to \"look your age\". My mom still dyes her hair at 86. She said every time she let it go gray people treated her like a helpless little old lady. Some people like it gray and look great- if you don't then dye it.",
      "MessageIndex": 17162,
      "PostDate": "18/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 21, 2012 01:09AM Nkb wrote: Beautiful. Can't wait to see ours all grow in.",
      "MessageIndex": 17194,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 3, 2012 01:48PM Nkb wrote: Joan- I can see them now. Wow, your hair is coming in nice and dark! You look so good. I can't wait for 15 weeks PFC.",
      "MessageIndex": 17381,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 11, 2012 10:13PM Nkb wrote: Interesting article about vitamin D and hair loss in the journal section of the wall street journal. It's years away from figuring out a cure, but vitamin D receptors seem important.",
      "MessageIndex": 17482,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 19, 2012 04:22PM Nkb wrote: My hair started growing in at about Taxol number two or three and then at Taxol six or seven I noticed it starting to shed, noticed several strands on hats when I took them off. After I was off chemo the hair started thickening a lot and continued to grow and seem to shed less. Eyelashes longer and thicker than pre-chemo but I realize they'll fall out again. Have been on arimidex for about three weeks and have not noticed thinning or shedding to increase, but I just turned 60 and my originally thick hair has been thinning slowly for years. The sudden very decreased estrogen due to tamoxifen is probably what's going on for the 40-year-olds in the group.",
      "MessageIndex": 18103,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 30, 2012 03:18PM Nkb wrote: Still wearing a wig I'm 15 weeks PFC- getting it colored when I am 17 weeks PFC and will decide after that. It's long and thick in back, thick and short on top and thin and long on sides and salt and pepper, although more pepper coming lately. Will have a sl trim at 17 weeks as well. A bit cold for little hair. Super short bangs seem to give away the not on purpose feel of it.",
      "MessageIndex": 18195,
      "PostDate": "30/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 14, 2012 08:42PM Nkb wrote: I just did taxol number 7 after four ACs . Some white fuzz started after taxol #2 and continued to grow. I was so excited! But,then a few days ago felt a funny scalp feeling and the little white hairs are falling out. I really liked the fuzz, and hats and wig felt more comfortable not sitting on top of a totally bald head I knew my hair would fall out and that is hard enough, I think a the new hard realization for me is how long it takes to grow back in. Knowing myself it will be hard to go topless until I have some length. DH has been totally supportive and thinks my head shape is nice etc. I think it is the lack of privacy and the focus on me being \"sick\" that I get obsessed with. I mostly wear a baseball hat with hair attached that is my same color and length which looks natural. The wig does not, so I rarely wear it, looks funny at times to be in a restaurant etc with a baseball hat. I wake up obsessed with thinking about my BC also, but, find I don't want to talk about it anymore. Plan to walk with a friend soon and not tell her I have BC just to keep the topic away.",
      "MessageIndex": 16537,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 15, 2012 02:18PM Nkb wrote: Jpmom, thanks I think you perfectly captured what I felt. When the hair started to grow I thought I was winning. ( have gone through many dark days about my mortality given my bilateral IIIC dx) I felt hopeful that my body was going to beat this BC. When all those little white hairs were found in my hat I felt invalidated and mortal again. I am already adjusting, it is out of my control and I will just hope for enough of them to stick around to make the wig more comfortable. What does the nadir of taxol is 3 weeks mean?",
      "MessageIndex": 16565,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 6, 2012 01:23AM Nkb wrote: Where did you find it?",
      "MessageIndex": 16998,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 9, 2012 02:28AM Nkb wrote: I love the hair and the shirt, the setting is pretty nice also",
      "MessageIndex": 17042,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 20, 2012 06:26PM Nkb wrote: Aem- I can't see your pics.",
      "MessageIndex": 17181,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 15, 2012 01:27PM Nkb wrote: Jpmom. I wrote something yest about what is happening to me, I don't know if you saw it. The growth I got during taxol is starting to fall out. (I am getting taxol #8 in 2 days). I have been slowly losing armpit hair and I think I now have 2-3 left. a few other bare places are making a few tiny hairs and eyebrows are a jungle of mid length hairs.",
      "MessageIndex": 16560,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 22, 2012 06:32PM Nkb wrote: I am not working during chemo, although there are several days that I feel like I could, my job is so demanding with 12-15 hour days and around a lot of sick people that the risk outweighed the benefit. My boss wants me to concentrate on living which I really appreciate. Many days I feel almost normal. While on the AC I felt normal the last 7-10 days of each cycle( although my white count was scary low during those times and work could have been dangerous). When I told my boss this, he said next time you feel good with a week to go before the next treatment- Go to Hawaii! It has also been great to not stress about changed Appts, delayed chemo due to low white counts, trying to work when i felt bad, I don't have a flexible job for last minute changes. I am getting a bit lazy tho, I worry about the transition to revving back up, but, that will come. I also worry about the hair and nails when I return and since I am getting bilateral rads to my chest wall, I worry that I will be too sore or burned to wear the prosthetic bra. Guess I will have to wait and see on all those things.",
      "MessageIndex": 16784,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 27, 2012 01:24PM Nkb wrote: Luv- I love the color! Your brows look wonderful also. I hope to use my round brush someday also. Hope not too big of a learning curve on that.",
      "MessageIndex": 16831,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 8, 2012 03:03PM Nkb wrote: Lago- thanks. Don't really care about what strangers think,but,would like to stay competent. Good to know that it takes about a year Just amazed at what seemed so easy in the past, putting on shoes and socks are a challenge now. One thing I am really learning to do is offer concrete help to people if I can think of something useful I can do. I no longer want to say if you need anything let me know. When my DH went backpacking during one of my chemos (which he really needed to do) he didn't want me to go to chemo alone, the people i thought of asking were the ones who spontaneously had said they would take me if I ever needed them to- not the ones who said if you need anything let me know.",
      "MessageIndex": 17031,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 31, 2012 07:57PM Nkb wrote: Rock- I wonder that also. Mine is spiky white and some is growing and some is falling out- I have 2 taxols left. When the surgeon said your beautiful hair is going to fall out. She didn't tell me it will take 3 years from the time it falls out to get to where it is now( 2-3 inches below my shoulders). I somehow thought as soon as chemo stops it is just going to grow back in over a few Months, how silly of me . I guess you can handle so much loss at a time- and there was plenty of loss from the surgeon without so much reality about the hair regrowth. All those products out there have a needy consumer I guess. My hairdresser is talented ( and has super curly hair herself) so I am relying on her to Shepard me through this. A few years ago there was a Japanese product to straighten your hair for,6 months. It was put on at the salon. It was super pricy tho. I haven't heard anything about it in awhile. Wonder what that would do to chemoed hair. Anyone know?",
      "MessageIndex": 16923,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 2, 2012 04:13PM Nkb wrote: Wow your hair looks amazingly thick and healthy!!",
      "MessageIndex": 17736,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 6, 2012 05:31PM Nkb wrote: I love it! Did you cut off white fluff or evened out and styled it?",
      "MessageIndex": 17769,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 6, 2012 12:46PM Nkb wrote: MamaV-do you think a little tiny trim could make your hair look better? I have seen people write that even though it was very hard to lose any hair it looked remarkably better to get the little irregular tips of wispy hair trimmed off. I am meeting with my hairdresser next month when I will be 17 weeks PFC and I'm going to have my hair dyed and I know she's going to want to trim some of this which will probably break my heart but if it makes it look better I will do it. She told me a story of a young woman who waited until her hair had grown past her shoulders and she has little white wisps all along her beautiful blonde hair and she finally was able to trim it and it looks a lot better.",
      "MessageIndex": 18014,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 12, 2012 08:41PM Nkb wrote: Kjiberty- ( and others) when did your hair start getting curly?",
      "MessageIndex": 18044,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 16, 2012 12:11AM Nkb wrote: Cayh- just thinking of you today and wondered what your updated picture looked like. Wow- your hair has really gotten thick! It definitively looks like an on purpose haircut! I like the side by side comparisons. Lots of women with very short hair in my area- some even with shaved sides and one inch long tops. But, you can tell it is on purpose. I'm 14 weeks PFC- color and trim in ~ 3 weeks. It is so strange to look in the mirror with the wig on and then take it off and have this totally different person look back at me.",
      "MessageIndex": 18075,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 21, 2012 01:33PM Nkb wrote: KCB- I agree! When I have seen pictures here of bald or fuzzy heads the faces look beautiful to me. When I look in the mirror with just a hat, I sometimes look beautiful to myself. My DH thinks I look cute. I still want hair and eyebrows. Lol",
      "MessageIndex": 17213,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 25, 2012 06:06PM Nkb wrote: Onvacation-UGH, I wondered when it would happen. I'm 15 weeks PFC, guess I should keep enjoying the mascara etc while I can. I thought of randomizing my eyebrows a bit myself and maybe still will I heard that they grow in faster the second time and here's hoping they will! Keep us informed. Going for my first pedicure ( professional) in 9 months tomorrow.",
      "MessageIndex": 18150,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 27, 2012 05:25PM Nkb wrote: Yikes!! Would a flat iron help? Has it been trimmed at all yet? Maybe the hair tips are the problem.",
      "MessageIndex": 18164,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 2, 2012 03:26PM Nkb wrote: Joan, I couldnt see your hair timeline without a password.",
      "MessageIndex": 17374,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 13, 2012 08:10PM Nkb wrote: Cayh- love it. I like the gray",
      "MessageIndex": 17520,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 19, 2013 03:20PM Nkb wrote: Herstrong I think a lot of this super thickness is due to the fact that it's incredibly layered, each hair practically is at a different level of growth. Perhaps if you trim the bottom and got more hair at the same length you would it would be less thick. thinning it seems like it would temporarily help, but, it is going to end up having it layered even more. I am not a hair stylist- I just noticed with my hair,some grew in seven months ago and some is just starting now. I'm sure a good hairstylist could help you if you can handle losing more length.",
      "MessageIndex": 18531,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 8, 2012 04:57PM Nkb wrote: I had a funny thought while looking at the hair growth- eye brows- yes! Unibrow not so much. As I was plucking the unibrow hairs I wondered, ( perish the thought of plucking a good eyebrow hair) but,... Since eyebrows and lashes fall out a few more times over the next year due to all being synchronized by the chemo- what if I randomly plucked an eyebrow here and there over the next few months? Could I create a randomization quicker and not go through a year of falling out and coming back?? Just a question- not sure re results.",
      "MessageIndex": 17789,
      "PostDate": "08/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 21, 2012 04:38PM Nkb wrote: Let's see a picture Ossa.",
      "MessageIndex": 17890,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 1, 2012 12:41AM Nkb wrote: I'm 11 weeks PFC and my hair is starting to grow in mostly salt and some pepper. I am suddenly looking at a lot of women's hair and seeing a lot of very short hair. Some of these hairstyles might be shorter then my hair, but their hair looks like a hairstyle mine looks like I recently had chemo. A lot of women really rock the gray hair look but I think I will dye my hair. The difference may be the quality of the hair or maybe the thickness, I'm not sure. The thought of it taking another year before it looks good is distressing. On an upbeat note the eyelashes and eyebrows have never looked better and I am putting mascara on to honor their presence.",
      "MessageIndex": 17956,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 1, 2012 04:29PM Nkb wrote: I took my hairdresser with me to the wig store she is a good old friend of mine,when I went to look for wigs. She also said that most of these wigs have too much hair and need to be thinned and that's why they don't look natural. I bought a baseball cap with hair which was the same length as my usual hair when I wore it people really had no idea it really looked like me with a baseball cap on. That didn't work as well for being inside. I also bought a wig which I felt really weird wearing, and eventually I started wearing it more and would often forget that I had it on. One of the first times I wore it, I was in the mall and a salesperson said\" I really like your hair \" and I said \"it's not real\" then I wondered to myself why did you have to say that I couldnt you just say \"thank you.\" Since then, random people say I like your new haircut I really don't think they know it's a wig and I say thank you although it feels weird, and usually I had forgotten I was wearing a wig. I am 11 weeks PFC in about a month plan to have my hairdresser color it and style it if she can do it only taking one micron off and see how it goes. It Will really be short still. It will be a relief not to run for a hat or hair when the doorbell rings.",
      "MessageIndex": 17968,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 13, 2012 06:38PM Nkb wrote: Today I got my first cut and color I'm 17 weeks PFC. It was hard to see some of this hair gone but it's mostly hair that she said would not be manageable and would be flyaway. She put the same color wash that she'd used prior to my hair loss which she used to cover streaks of gray. It was not permanent dye and just faded over time and has no peroxide. She thought the color looked much flatter on the new hair that I have grown and will make changes next time to brighten it up a bit until I start growing in my old type of hair. It's nice to have the gray gone but it's really short still and I haven't completely decided whether to just go topless now or wear a wig. At least now gray wisps don't try to poke out of the sides of wig. Almost everyone in the salon had short hair, not as short as mine, except one of the hairdressers whose was shorter except her bangs.",
      "MessageIndex": 18248,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 27, 2013 12:08PM Nkb wrote: I'm six-month PFC and I finally took off the wig everywhere. I got it colored for the second time and asked her to make it a little bit darker, I am a redhead. Not sure how much is gray since I have had a color wash on it for years. Went to a surprise birthday party in my neighborhood and this was the first time most neighbors saw me without my wig which was beloved by them. Thet don't know about the BC. as I feared I got a lot of comments, from: ,\"I like your hair\", to \"what made you decide to cut your hair again?\" ,\"Why is the front straight and the back curly?\" No wonder we're so hung up upon our hair, everybody else is also! I was so uncomfortable, like I had a neon light flashing on top of my head. Lessons learned? Yes, make sure your words validate people and have only good intentions if you feel the need to comment on their appearance.",
      "MessageIndex": 18596,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Feb 13, 2013 10:25PM Nkb wrote: A girlfriend just sent me a picture of her new haircut that she loves!! And it looks like my 6 month PFC do at I can't wait to grow past!! Still- so grateful to have hair.",
      "MessageIndex": 18745,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Mar 9, 2013 10:43AM Nkb wrote: Crazy- your hair looks adorable to me. Cut and colored my hair at 17 weeks PFC. Made a huge difference. Colored it 7 weeks later, no cut. I have chemo curls only in the lower back of my hair and use a straightner and with a few swipes they are gone. I'd probably have to cut 1.5 inches off to get rid of them and even out the back- but, no plans to do that yet. I go back in a week for color again and will probably not cut it. I think my hairstylist could make it look really cute, but it will take a lot longer to grow out if I want it cute all along the way. My wig had bangs which I pulled a little lower when my eyebrows were mostly gone, you couldn't tell as much that they were gone. My eyebrows are quite light strawberry blond, so not as visible anyway before lost. I love having them back tho.",
      "MessageIndex": 18982,
      "PostDate": "09/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 15, 2012 03:14PM Nkb wrote: Well, I am going out on the deck for some sun and breeze therapy for my hair, read the Sunday paper!",
      "MessageIndex": 16570,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 29, 2012 02:21PM Nkb wrote: Schatzi- it all counts! 29th anniversary falls on my last day of chemo! My sister's birthday also. So much to celebrate!",
      "MessageIndex": 16870,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 30, 2012 12:52PM Nkb wrote: Jp- I can understand not wanting to cut a micron off your hair. My hairdresser told me she had a young client who did not cut off the white fuzz until her hair was shoulder length and even then it was emotional and required friends to be present. I would take the picture, you can always decide not to display it. Not sure what I would do, it is easier to give advise sometimes than follow it. I have white spikes that started at taxol# 2 and started to fall out at taxol # 6. Every day 50 or more fall out, some seem to be growing still. I would be hard pressed to cut any of it. It feels a lot more comfortable with hats and wigs to have a layer of fuzz so I hope I keep some. Nails feeling tender and like I shouldn't do certain tasks. Advise?",
      "MessageIndex": 16905,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 1, 2017 12:31AM Nkb wrote: iWrite- wow-what an elevation gain! Takes a lot of oxygen carrying capacity (RBCs) to do that. Moving at 11,400 is an exercise in shortness of breath on a good day. Love the picture and the snow in the background.",
      "MessageIndex": 1207,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 17, 2018 01:14AM Nkb wrote: Z- Napili Beach in Maui.",
      "MessageIndex": 1494,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 4, 2017 05:52PM Nkb wrote: Z- yoga has been a life saver for me. I have taken 2 classes per week since I finished my chemo and radiation treatment in 2012. It has really helped with pain, and I think the taxol really hurt my muscles and the radiation and double mastectomy caused chest wall and shoulder issues. It has been a gentle way to gain function and strength and works well with the walking and other exercise. I do a 15 minute stretch routine the days I don't have yoga.",
      "MessageIndex": 1142,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 4, 2017 07:43PM Nkb wrote: Z- I definitely understand about the holding back, as I have injured myself trying to do the max in the past. I am no longer competing with myself or others in the class. I also have a very experienced teacher who knows about all my issues and is very knowledgeable about bodies and married to and collaborates with a sports chiropractor . there are 6-10 people in the class. Most of the people in the class are my age or older and so many people have injuries to beware of and modify for. I have injured myself a few times lifting weights and am being much more careful with that also. Daily walks and stair climbing and some exercise bike are my other exercises. Judith Lasseter and others seem to be modifying some of the beliefs about some of the iyengar poses especially if you have osteoporosis, back or hip issues. I would be quite sad to not have yoga in my life, although I would probably do something privately with this teacher if I couldn't go to a class. I will double down on the meditation! Thanks for your knowledgeable input.",
      "MessageIndex": 1148,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 5, 2017 01:19AM Nkb wrote: I've made my bed into quite a comfortable nest- so far I am still leaving it during the day.",
      "MessageIndex": 1150,
      "PostDate": "05/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 8, 2017 03:30PM Nkb wrote: Z- That yoga post at the top of the thread doesn't open for me-it's just a ? that doesn't work.",
      "MessageIndex": 1163,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 2, 2017 01:52AM Nkb wrote: Shetland- so sorry you had such a frustrating day- you definitely made the right choice with the yoga class. I did a yoga class also-made some cookie choices later however.",
      "MessageIndex": 1214,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 8, 2017 05:27PM Nkb wrote: DGHoff/Z and others- I had an interesting yoga class today, influenced by the fact that my teacher is currently going to a yoga workshop with Angela Farmer. I don't know if you know her- she is an 80 year old long time practitioner/teacher of iyengar yoga who has been thought of as a rebel. She believes in adding some serpiginous movement into your poses to prevent woodenness and find your body's place in the pose. It was very interesting. Anyway, she lives and practices on the Greek Island of Lesbos with her husband who is also a yoga teacher. Off for my walk.",
      "MessageIndex": 1251,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 8, 2017 10:04PM Nkb wrote: DGHoff-even though I think that the work serpiginous was used- I think the word is really serpentine. (I might have mixed up the two though) snakelike, curving. Serpiginous is also curving, but seems to be used to describe rashes mostly.  Lots of steps! and beautiful pictures.",
      "MessageIndex": 1253,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 15, 2017 10:18PM Nkb wrote: Paula- so sorry to read about your brain Mets. I hope you have a friend who can be with you during treatment. You said you were alone which worries me!",
      "MessageIndex": 1281,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 18, 2017 12:59PM Nkb wrote: snowfall- good plan. I would go slowly with the weights and do more reps with lower weight at first and see how it goes. Injury takes so long to heal. Z- definitely can relate to the food in Japan. We took a 10 day walk on the old imperial nakasendo way and stayed in rural ryokans and the food literally turned my stomach. Lived on energy bars until Kyoto ( then Italian) weight loss is orten good however. Walked 6 miles so far today, but, did a major wimp out at the Eiffel Tower- got in the wrong line and could only buy tickets for the elevator up , the tickets for the stairs were in a totally different area and it was enough of a barrier to not do the stairs. Was 720 stairs! Didn’t feel hydrated enough to do it either. Maybe next time. Sneezing like crazy- hope it is just allergies. Don’t want to be sick here- so many sick people everywhere we go   ",
      "MessageIndex": 1298,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 21, 2017 01:53PM Nkb wrote: I got major stair steps and miles going to the Sacr-Coeur Basilica in Montmartre today. It is quite a climb up to get there. The Parisians who take the subway are getting a major workout with the stairs. Below is the mosaic above the alter- of Christ exposing his sacred heart burning with love and compassion for humanity. It is an emotionally extreme feeling to see regardless of your faith.",
      "MessageIndex": 1317,
      "PostDate": "21/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 22, 2017 01:26PM Nkb wrote: almost warrior poses from Degas.",
      "MessageIndex": 1322,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 10, 2017 01:12AM Nkb wrote: Gracie- sometimes low blood pressure makes you feel lightheaded upon standing- I always sit for a few seconds and then get up- ready to hold on to my dresser in the transition if needed. Also stay hydrated- seems like with the ibrance and faslodex i need lots more fluids than usual. Z- how great to feel like your old self againfor awhile. I feel so much more competent in general when not feeling physically fragile.",
      "MessageIndex": 1379,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 25, 2017 11:20PM Nkb wrote: ",
      "MessageIndex": 1408,
      "PostDate": "25/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 14, 2017 12:43PM Nkb wrote: Devine-Fabulous news! Not only are you healthier and probably feel better with 20 fewer pounds- you are decreasing your health risks in so many categories. I like books on tape if I am walking alone or music or the TV if I am on the treadmill. Keep it up! iWrite- I did do a few weights- need to get back to it. stair climbing and walks seem to be my main exercise these days. I used to get on the exercise bike every morning before breakfast for 20 minutes- I should get back to that too. After that no carb day before the PET I feel like I need to carb load-hahaha.",
      "MessageIndex": 1425,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 17, 2017 12:27PM Nkb wrote: Paula- the hope is to change MBC into a chronic disease until we figure out how to use immunologic drugs to hopefully cure. Walked 6 miles on cobblestone streets today in- Paris! Beautiful day in the 70’s. Carb loading is possible on almost every block!",
      "MessageIndex": 1291,
      "PostDate": "17/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 18, 2017 03:11PM Nkb wrote: DGHoff-Good luck with scans tomorrow and glad you are back to increased steps. AZS- keep it up- I think that you will notice that your cardio gets better with the more exercise you do. Happy Holidays and after dinner walks with the family.",
      "MessageIndex": 1440,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 4, 2017 06:37PM Nkb wrote: Z- I have extensive bone mets! Diagnosed several months ago. I am doing iyengar yoga. Are you worried about fracture? (I have gotten every 6 months Zometa for years due to a belief at some point that it would help prevent bone mets.) now on it every 3 months.",
      "MessageIndex": 1144,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 6, 2017 08:56PM Nkb wrote: GracieM2007- I bought a firm mattress a few years ago (after 20+ years with a water bed) thinking that it would be great, but, too hard. I went to Costco and got a memory foam topper to put on top of my firm mattress and it is heaven.",
      "MessageIndex": 1154,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 28, 2017 12:29AM Nkb wrote: DGHoff- I forgot how much I love to dance also. I'm still going to my 2 yoga classes per week- now that my HGB has increased from 7.5 to 9.6 I feel so much stronger in the class, less fragile. I have figured out that a higher calorie breakfast 2 hours before class and then 1/2 of an energy bar right before class and fluids during class has really helped me feel great through the whole class. Also still doing 4-5 mile walk or walk plus stair climbing- 5x 120 stairs every day. My neighborhood has a lot of these sets of stairs as short cuts for kids to get to school and they are great exercise opportunities. I still want to do more of a home yoga sequence for the days I don't go to class. So far I do about 15 minutes of stretches before bed. So if you have time to make a sequence I am still interested.",
      "MessageIndex": 1200,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 22, 2017 04:58AM Nkb wrote: Z- good luck with the weather. Sounds like it will be very crowded underground! When will the cells be re-infused",
      "MessageIndex": 1321,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 23, 2017 01:08PM Nkb wrote: Z- sounds amazing. Do you feel anything after the infusions? How do they monitor your response?",
      "MessageIndex": 1327,
      "PostDate": "23/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 2, 2017 01:57PM Nkb wrote: Z- it would be money well spent. I just got a Apple Watch instead of a Fitbit- mostly for fitness, also needed a watch (I know watches are archaic- ) anyway- I got on our exercise bike and put the heart rate monitor on also and the heart rate on the polar heart rate monitor showed that my heart rate got up to 140, but the watch said maximum heart rate 109-DH thinks that the polar is probably more accurate since in sits right over your heart. I was hoping that the watch would help me with outside exercise encouraging me to up my game-but, now am wondering about its accuracy. Emmy- got to get back to Pilates- core strength has helped me out of so many situations.",
      "MessageIndex": 1362,
      "PostDate": "02/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 6, 2017 10:37AM Nkb wrote: Heidihill- I agree. That was a little disturbing. Today it said 56- against my count of 60. Will watch it. Seems like with Ibrance it takes a lot of fluids to stay hydrated! My BP and pulse have always been a little on the low side, but, I’m not sure that reading was correct. Hope everyone else is out and about today.",
      "MessageIndex": 1375,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 12, 2017 07:06PM Nkb wrote: Shetland- sounds lovely. Did my intermediate yoga class after no yoga for a month. Felt great-I did use restraint.",
      "MessageIndex": 1384,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 29, 2017 09:13PM Nkb wrote: iwrite- good work-sounds very well rounded. Hope for no pain tomorrow-just soreness that sends a message to your brain to make you stronger. I jogged a little yesterday (used to be my favorite exercise) and definitely used muscles that I haven't used in a long time-went well though.",
      "MessageIndex": 1411,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 2, 2017 06:43PM Nkb wrote: Heidi-impressed with the kettle balls. I want to get back to weight lifting which I love-kept hurting myself-now that mets are better I will try again. lots of reps and lower weights. Z- hope the port pain is resolved. I never had one so have no idea of the pains or pleasures of them. long walk today with a museum mid walk and on the way home a huge parade for Our lady of Guadalupe- music, costumes, food and joy.",
      "MessageIndex": 1418,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 9, 2017 04:45PM Nkb wrote: Z- what about stairs? We have several 116 stair areas in our neighborhood between streets and that gets my heart rate up. Hills too. At the infusion clinic they leave a warm heating pad over the IV site the whole time for the Zometa-not sure if that counts. Sorry the port has been hard- hope you find a sports bra that works and doesn’t bother your port. I suppose you could modify a sports bra as well.",
      "MessageIndex": 1421,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 8, 2018 12:27AM Nkb wrote: Bravo DGHoff! The weather reports are scary. You look prepared. I hadn’t been to yoga in about a month with holidays etc. today’s class exhausted me!",
      "MessageIndex": 1480,
      "PostDate": "08/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 16, 2018 10:14PM Nkb wrote: Getting steps in the hard way.",
      "MessageIndex": 1492,
      "PostDate": "16/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 31, 2018 01:40AM Nkb wrote: DHHoff- this is wonderful news! I’m so happy to hear it. I thought of you today re yoga and wondered how winter was treating you. I’m so glad that you are getting in shape for an outdoor trip! I’m am back to strengthening and feel so much more valid being stronger. Hope everyone else is getting out and about.",
      "MessageIndex": 1510,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 31, 2018 06:18PM Nkb wrote: Z- para scapular pain (if that is what you have) can be from so many things. Often stress/tension, poor posture (like on a computer for hours etc), heavy backpack. It can be referred pain from neck etc. ice or heat, massage do help, making sure your alignment is good. I also have just gotten costochondritis after sneezing and coughing. I have coughed my brains out many times in my life and never got this. My new theory is that our low estrogen state makes everything more fragile and less elastic. I feel like I've injured myself just turning over in bed or some equally benign movement. I am mystified by some of the injuries I have had recently. Illimae- you are inspiring",
      "MessageIndex": 1516,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Feb 1, 2018 01:33PM Nkb wrote: DGHoff- when I went to Europe in 2014 we took only trains so lots of lifting my suitcase. My son told me about some exercises to do and it really helped. One is the farmer’s walk ( you can look it up on YouTube) then triceps, biceps and overhead weights to strengthen upper back so you can get the backpack on and off. Legs can get stronger walking uphill with the pack- or up your stairs.",
      "MessageIndex": 1521,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 11, 2018 04:39AM Nkb wrote: KatyK- weight loss is really hard and different things work for different people. I had recently gained 8# which made my clothes feel uncomfortable and me feel not is good control of my life. I was eating lots of bread and nightly ice cream. I also thought I should enjoy life. DH has gained also. I stopped the sweets ( I am addicted I think) and most of the bread and that helped me lose about 6#. DH lost 9#. For me sugar makes a big difference - for other people it is fat that they need to cut down on. The first few weeks are the hardest for me. Exercise is important for me also",
      "MessageIndex": 1823,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 8, 2017 12:24AM Nkb wrote: DGHoff- Thank you for your thoughtful message. I would love to see your sequence of poses that you think would be good for me and others with bone mets. So far, I am doing well in the classes- I am really paying attention to breathing more and holding back on inverted poses. I will never be standing on my head and I am totally good with that. Since the Stage IV diagnosis I feel like I've moved into a kinder to me place and sanguine about so many things. I feel so much less attached to outcome which is lovely. Although no one in the class knows about my cancer, my teacher does and watches out for me. I've known her for 5 years. There is a woman's cancer resource center where I live that has free yoga classes for women with cancer, taught by a rotation of 8 different teachers who volunteer and one of them is my teacher. Another one is a restorative yoga teacher who is wonderful. My husband's first yoga teacher was Judith Lasseter! My teacher has gone to many of her workshops and talks about the new thinking to protect joints etc. Before my first cancer I once went to a yoga class with my daughter who was in college-it was in Santa Monica and it was a 'yoga for the people class'. It was awful, >100 people crammed into a small room with the teacher using a microphone to shout poses out, with an occasional don't hurt yourself and I was crippled the next day-course my daughter was ready to go back the next day! I don't know if that was Ashtanga- ",
      "MessageIndex": 1159,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 15, 2017 01:25AM Nkb wrote: Mary-thank you for the article! Good news!",
      "MessageIndex": 1184,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 2, 2017 01:15PM Nkb wrote: Heidihill- is that a drone photograph? gorgeous. chocolate is a health food in my house.",
      "MessageIndex": 1217,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 4, 2017 01:26AM Nkb wrote: Devine- Way to go! Losing 15# is hard- but, I think a really meaningful amount for your health and well being. I know I sound like a broken record about the yoga-but, I really think that it has been a life saver for me. Between the muscle affects of the chemo and the joint issues of the arimidex, I was in a lot of pain. Especially if I sat for like lunch with a friend or in the car- I could barely get out of the chair. I love the feedback from Fitbit-keeps me motivated. Bravo!",
      "MessageIndex": 1227,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 9, 2017 03:26PM Nkb wrote: Gracie- I wake up hungry. In a perfect world- I ride my exercise bike for 15-20 minutes before breakfast. Then later in the day I do a longer bike ride or walk 3-5 miles. Usually, since the Ibrance I eat breakfast as soon as I wake up and exercise later. I go to 1 1/2-2 hour yoga classes and eat a full breakfast 2 hours before the class and 1/2 of an energy bar right before the class. I felt the need for mid exercise calories if I didn't do that-low blood sugar perhaps, not sure. Some people do exercise early morning before life intervenes to distract them away from it. I always take a 1/2 mile walk with hubby after dinner also- I feel better since I have taken the Ibrance with dinner- and it's fun to yack and catch up with him.",
      "MessageIndex": 1258,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 14, 2017 09:46PM Nkb wrote: I’m in Montreal visiting DH - a healthy vigorous exercising, weight lifting, stretching fanatic. Anyway- we spent the day together- went to the very gorgeousMont Royal. Subways- with lots of stairs. Got a bit winded and had to stop a few times. Felt a bit depleted and noticed the stamina is not the same. Long story short- walked 10 miles and did an elevation (stairs and hills ) was 600 feet. Happy to be back at the hotel. I should have brought a few more energy bars with me. Tomorrow ?!?",
      "MessageIndex": 1268,
      "PostDate": "14/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 15, 2017 04:44PM Nkb wrote: I have recovered from yesterday’s massive activity. I have noticed with palbo/fulvestrant something similar to when on chemo where I suddenly feel a need for calories. I eat half an energy bar and feel better. I assume it is low blood sugar, but, have no proof. When only on arimidex r off Meds or before cancer I never had this. Anyone else notice this?",
      "MessageIndex": 1275,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 2, 2017 02:31PM Nkb wrote: Emmy- so far I love the watch. I don't have to dig out my phone for all those notifications and texts and even tho things are small-it works. I love answering texts with it, although now I look like a crazy person talking into my watch. It does have all sorts of exercise goals and programs-",
      "MessageIndex": 1365,
      "PostDate": "02/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 4, 2017 01:00PM Nkb wrote: GracieM2007-I'm glad you got out for 30 minutes. Years ago when I had children who didn't want to hang out at the gym's kiddie area-I bought an exercise bike and now use it early morning or evening if I get too busy to exercise in daylight. If you have room for one it could be your backup. I've also heard that people go to indoor malls and walk-some malls even open up early just for the walkers. I did a faster pace walk yesterday and 3 reps of an outdoor flight of stairs (116 stairs x 3) at the top on the 3rd rep I felt like I was going to faint-almost sat down, but, weathered it and then walked home. My Apple Watch said that my heart rate was 126-if it is 30 points off like it was using the polar and the bike-that is probably why I felt so bad. I also think that I probably wasn't as hydrated as I should have been.",
      "MessageIndex": 1371,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 5, 2017 07:30PM Nkb wrote: A little update on the Apple Watch. Today I went for a walk with some big hills and checked the apple watch heart rate against my count at my carotid with a second hand watch several times. It was surprisingly accurate! Within 2-4 beats. I am not sure if this is because I am wearing it a notch tighter on my wrist? or if the watch is \"learning\"? I still don't buy a resting low of 51 beats per minute (wore it overnight) and will check that resting HR if is comes up again as that low. ",
      "MessageIndex": 1373,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 17, 2017 04:06PM - edited Nov 17, 2017 04:07PM by Nkb the sun is out after a big rainstorm. I woke up feeling good so went back to the stairs and did 6 sets of 116. I felt really good with heart rate maxed at 145. I will take my 4 mile walk later. Thinking that his means my HGB may be 10! A few days ago I could only do 1 flight - did try it after a walk- don't think that is the reason. Back to yoga also. Fleece lined pants sound wonderful.",
      "MessageIndex": 1404,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 9, 2017 12:24AM Nkb wrote: just wanted to add an Apple Watch update. When I first got the watch I wore it on my exercise bike and compared it with the polar heart rate monitor. It was way off. But, tried it again tonight and they were both perfectly aligned almost to the exact number the whole ride. The key is that you have to wear the watch vey snug on your wrist. I have my no exercise weekend before my Monday scan. And no carb Sunday Hope everyone is well. ",
      "MessageIndex": 1419,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 17, 2018 05:53PM Nkb wrote: 12,660 round trip to Dragon Teeth",
      "MessageIndex": 1495,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 21, 2018 09:50PM Nkb wrote: hiked  down ( and then up again)a steep rocky hill to this blow hole sorry can’t seem to send the video.",
      "MessageIndex": 1503,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 27, 2012 12:54PM Nkb wrote: Jp. I was told that it is controversial whether to do a complete AND vs take a few and my surgeon told me that the MO treat people differently if they know that they have 12 positive nodes vs 5/5 etc so I agreed to AND. My MO says he is glad she did it and it does change his tx re aggressiveness and follow up. It may be that they are both in their 50s and more comfortable with this approach. I met someone who was 49 at dx did the chemo and rads and then went back for the reconstruction and they found one more positive node! She feared they would want to give her chemo again,mbut, they decided she'd had enough treatment. I thought rads if 4 or more positive nodes. Well, in my case there are no grey areas re treatment- I need it all. I am interested in what tumor board says. Yay to no wig!",
      "MessageIndex": 295,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 14, 2012 05:43PM Nkb wrote: Summer- I'm so sorry. Good luck with your rads!",
      "MessageIndex": 473,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 16, 2012 09:42PM Nkb wrote: How beautiful, gorgeous wedding dress, loved the blue dress also.",
      "MessageIndex": 752,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 26, 2012 11:58AM Nkb wrote: I will be starting bilateral rads to the chest wall and supraclavicular and infraclavicular and axillary nodes mid sept. I met with the RO who said people use lots of different creams and swear by them, but, in studies none work any better than aquaphor. Didn't offer miaderm. So you buy it on line? If you can't wear a bra, can you wear the camis with the breast forms in them? Or are you too sore?",
      "MessageIndex": 270,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 26, 2012 01:12PM Nkb wrote: Stacie, yes both breasts had lots of cancer and lots of positive nodes at diagnosis! I kept being told i had cysts and mammo and US never showed anything. After bx of one of the \"cysts\" showed cancer, I insisted on breast MRI which showed multiple cancers in the The other breast that I had been feeling a mass 6 months earlier. The lobular cancer often presents on both sides and is very hard to detect so called sneaky. so rads both sides at once aiming at the chest wall since breasts are gone, and the nodes around there.",
      "MessageIndex": 274,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 5, 2012 09:01PM Nkb wrote: I am going to start rads in about 6 weeks and wonder about people who have had a mastectomy and getting rads- did you wear a bra with breast forms? A cami with breast forms? Or just a loose t- shirt without any sort of foobie? What can your skin tolerate as far as clothing touching it? I would like to do some sort of foobie, the sunken chest look makes me feel uncomfortable.",
      "MessageIndex": 392,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 20, 2012 06:32PM Nkb wrote: Rads planning tomorrow, had to meet a new RO, my first one was lovely, but 8 months pregnant. She said aquaphor or whatever I wanted- no studies showed one better than another. The new RO says aloe Vera and don't start til your skin is red. Will see what the nurse says. Supposed to get 25 days, both sides at once. Seems short compared to what a lot of you are doing.",
      "MessageIndex": 516,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 13, 2012 02:28PM Nkb wrote: I have done 3/25 and feel a bit irritated, armpits worst than chest wall. Thanks for the tip about sox and sports bra. I already stopped wearing the bra with breast forms- it seemed uncomfortable and tight. Ali- I have low back pain- I think due to lying in an unsupported way for my back through all that planning and the rads. I tense my lower body I think while trying to stay still. I am doing back exercises to try to mitigate this. I'm getting both sides done at the same time- so takes about 20-25 on the table while they do all the adjustments. They are putting a fake skin form on me for part of it to keep the rads from going too deep into my chest wall. What a long strange journey killing cancer is.",
      "MessageIndex": 725,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 14, 2012 09:04PM Nkb wrote: I think this back pain might be taxol also. I am stiff several places, some of the spots move around, thumb for a few days with no injury, calves always quite stiff, quads and neck also.",
      "MessageIndex": 741,
      "PostDate": "14/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 9, 2017 11:50AM Nkb wrote: Keetmom- love the picture, the light is beautiful there. First day of school was always so exciting Micmel- I think that what you are going through is very common-every family has some variation of how to grow up kids. I think for us the old plan of kids leave home at 18 and are on their own and make a go of it etc doesn't work well anymore. A lot of it is the super high cost of living-rent was $50-$100 per month with a Roomate when I left home, now it's thousands of dollars. College costs so much money and if you end up in tremendous debt from it, then your whole life is changed trying to pay off college debt instead of buy a house, or get married or have kids. You will have to let go of some outcomes and standards for them to get independent. I stopped doing my kids laundry when they were 10 and my son announced that he wanted to wear the same shirt everyday. It's true I had to share my washing machine and dryer with them-and they were rough on them-but, whether they had clean clothes or not was their problem now. They made their own lunches from 2nd grade. when the school called and said they didn't bring enough food for lunch- I said talk to them, they make their lunches- the food is available. I did let them get away with some stuff because they went to an extremely academic high school and had hours of homework every night and I wanted to \"enable\" them to do it. But, I had a friend who did so much for her kids that they were afraid to make a phone call to a business or even go into a 7/11 to pick up a few things on the way home! That story was a lesson to me. Yours is more complicated by the divorce of course, taking the high road as you did is the right thing. I took walks with friends and asked them how they were dealing with the various growing up issues and we really are in a whole new era without the usual guidelines. Our kids are all different and each need a different roadmap- some need a lot of help, others less and we need to navigate this. I do know that me yelling, begging or whining didn't do much. I don't know the age of your kids or what they are capable of-but helping them to independence is a good thing usually. When my daughter was in college she said their were parents who came every weekend, cleaned their kids apartments, washed their clothes, cooked a lot of food for them-she was appalled ! It's hard to get a little selfish when you are a mom, but, you seem to be building up a lot of resentment which is not good for you. Do what you and your husband want to do, support your decisions, use your active voice, give them a little notice of your plans and move ahead. I wouldn't use cancer as your reason, I would use this is what dad and I are going to do now. Good Luck- it's hard!",
      "MessageIndex": 431,
      "PostDate": "09/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 16, 2017 03:39PM Nkb wrote: The food stuff seems really confusing-when first diagnosed I heard no flax, soy or chickpeas (if other stuff I either forgot or didn't like it anyway so dismissed it) My cereal had a lot of flax so I stopped it for years. Then restarted it and now have mets-so stopped it again. I think a small amounts of any of this stuff (besides soy) is probably ok. The only supplements I take are calcium and Vit D- I try to get most of the calcium in food and then supplement-my MO was very adamant about calcium if on Zometa. Gotta build up a lot of bone once I send the cancer away!",
      "MessageIndex": 519,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 23, 2017 05:25PM Nkb wrote: Micmel- fluffy is one of my favorite words. connotes Warm and cuddly.",
      "MessageIndex": 612,
      "PostDate": "23/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 24, 2017 03:17PM Nkb wrote: Micmel- The darling exuberant puppy! I hope that you heal well. My cat got a little rough a few weeks ago and his teeth grabbed my arm- I was scared for few days-their mouths are more dangerous than dogs. All was well-but, I used antibacterial ointment for a few days also. I would never see \"It\", but, I have a DD who would love it. Comedies for me. I did see an old French movie the other night, which was very good-but, did not have a Hollywood ending by a long shot-left me a bit sad. I must say-I like the Hollywood happy endings. I have an estranged sister-almost everyone I know has some weirdness with a relative or two. Good luck with your re-encounter if you have one.",
      "MessageIndex": 619,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 25, 2017 01:31AM Nkb wrote: Micmel- I was getting shortness of breath with exercise otherwise felt fine. I did a CBC to look for anemia and I was very anemic (which could be due to low iron, or B12 or many other happy reasons) but, my white count was a tiny bit low and the platelets were slightly off and my MO said- I'll do a bunch of blood tests for those happy causes, but, since 3 cell lines are low I suspect something else. She said she could go on and on with the blood tests ruling out this and that, but, a bone marrow will give us the answer right away. And it did. I have breast cancer in the bone marrow which crowds out the marrow so it can't make cells well. The Ibrance is working very well on it though and I am getting less anemic! (7.5-->9.6) not normal, but improved. I like project runway-so now you see where my taste is!",
      "MessageIndex": 638,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 10, 2017 09:56PM Nkb wrote: Goodnight Micmel- I think that it is your turn to have a wonderful stress free week! So lovely that the hair is coming back to normal-it's a big deal toward feeling good.",
      "MessageIndex": 817,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 30, 2017 06:05PM Nkb wrote: Lisbet54- the MBC guide is very useful and informative. see page one of this stage iv forum and you will see the offer from bestbird. send her an email and she will email it to you. I echo 50sgirl in feeling helpless here to lend you a hand with transportation. It makes me realize that as flawed as our health system is- we have options and help from organizations and churches esp if you are not too poor or have good outreach skills. I did Taxol as an initial chemo after some other harsh ones in 2012. I already had lost my hair from the other chemo- and actually my hair started growing back while on Taxol- I think something like 13% of people don't lose their hair on taxol? I did get some nerve damage in my feet and shoes were pretty uncomfortable for about a year. Ice packs may help that. I also was allergic to Taxol and had to do lots of steroids to manage it-I had 6 months of chemo all together and tried very hard not to gain weight- I still gained 15#, but, lost it with hard work afterwards. Your metabolism is slowed down by the chemo and also the steroids cause some weight gain, I don't remember which chemo caused most of the weight gain. I walked every day. Do you have a relative who could stay with you? Could you hire someone to drive you and help with the animals while you see how things go?",
      "MessageIndex": 6002,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 3, 2017 12:15AM Nkb wrote: Wendy-good luck with the scans! Lisbet- I am glad you are getting more information and figuring out a plan to treat your progression. Z- sounds amazing- are they augmenting your NK cells or your T cells or ? Is the Xeloda to keep things in check while they wait for the cells to multiply or is to to try to expose new antigens for the NK cells to recognize and attack? I hope that your liver biopsy ends up in the right hands and gets the desired tests done on it! If you are around Kyoto again- there is an amazing museum outside of Kyoto called the MIHO museum. It was designed by I.M.Pei into a mountain. You take a city bus out there that takes about 1 hour. When you get off you can elect to walk up a hill and cross an amazing bridge to the museum as you round the corner it comes into view and is just magical. The design is based on Tao Yuan Ming's \"Tale of the Peach Blossom\" we took an early morning bus and when arrived there were only a handful of people- when we left after lunchtime it was packed. (There is a shuttle if you don't want to walk)",
      "MessageIndex": 6056,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 3, 2017 04:58PM Nkb wrote: Wendy3-This is very exciting news! I love the happy scan stories-it is so encouraging. Kaylynne- I had one night of nosebleeds/clots with each taxol- I think it only lasted one night-but, every treatment got them. I only did 12 weeks of taxol so am not sure if they would have gone away.",
      "MessageIndex": 6072,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 9, 2017 04:07PM Nkb wrote: Z - looking quickly at that list for California- looks like most of the hospitals in the state are on that list. Rich and poor areas, big and small hospitals. Hmm",
      "MessageIndex": 6165,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 10, 2017 02:41PM Nkb wrote: Lisbet54- Losing your hair is not a small thing. It is not just a vanity thing, it is a signal that you are sick, it is a loss of privacy and many other things. It is primal. I found it hard. My hairdresser went to the wig store with me which helped with color and style etc-i felt overwhelmed there. I am not sure what to do about your \"enormous\" head (men's hair replacement store?-maybe this is a stupid suggestion -I don't know) there are ice caps here to try to decrease hair loss which I would try if I had to use chemo that would cause hair loss again. I suspect that it is very expensive- although I have heard of people having their friends help them and lowering the cost. My favorite \"fake\" hair was a baseball cap with hair attached. It was the most comfortable and easy- not itchy etc- it works well outside or in a store- at home it is a little weird to be wearing a baseball cap. Wigs were less comfortable to me especially on a hot day. I would get the synthetic hair unless you are good at styling. It is cheaper and basically you wash it and it dries right into its style. There is a thread devoted to hair topics that you could go on. I haven't been on it in years-very supportive and informative!",
      "MessageIndex": 6179,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 9, 2017 01:31AM Nkb wrote: JFL- thanks for pointing that out, i see 150 mg BID with a hormonal vs 200 BID for monotherapy. I am so interested and excited about this drug. Will look up the Monarch trial. I have wondered a lot about how bones are repairing after scan resolution and when they become strong again vs susceptibility to fracture. Do you think these wedge fractures were there at the beginning and obscured by the cancer or you have had silent fractures after NEAD? Mom/Dani- thinking of you. ",
      "MessageIndex": 6509,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 20, 2017 11:26PM Nkb wrote: Momallthetime- There are many foods with higher content of potassium than bananas and maybe some of them would appeal to Dani. The highest are dried figs, molasses and seaweed (>25 men/100 gms) the next highest are Avocado, dried fruits esp dates and prunes, nuts, bran cereals, wheat germ and lima beans (>12.5 men/100 gm) then come a large group of veggies and fruits with .6.25meq/100gm) which include bananas, mangos, oranges, kiwis, cantaloupe, spinach,tomatoes,boroccoli, beets, carrots, cauliflower, potatoes and several of the meats. I think that avocados would be a great choice if she likes them since they are high is calories also which she needs, If she likes mayo you could mush it up together and get high potassium and high calorie! I can't imagine eating enough molasses to help, but, maybe. We don't really have any California Avocados left in the farmer's market this year, but, we can get them easily from Mexico in the stores. You might be able to grind up some nuts into soups etc You can also get potassium in pills. Hugs to you both.",
      "MessageIndex": 6684,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 4, 2017 01:57PM Nkb wrote: A new Shingles vaccine has just be approved that is not a live virus vaccine. It was NOT studied on people with decreased immunity (due to medications or other conditions) who are at most risk for Shingles. I am hoping that a study of immunocompromised people is in the works. In the meantime it is working very well for those who received it. It is called Shingrix (zoster vaccine recombinant, adjuvanted) by GSK. You can read more about it if you want to at shingrixhcpdiscover.com. I will be asking my MO to talk with infectious disease folks about this and hope to get it in the future.",
      "MessageIndex": 6844,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 16, 2012 01:15AM Nkb wrote: Consult with RO tomorrow- what do I need sure to find out about?",
      "MessageIndex": 483,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 26, 2012 03:05PM Nkb wrote: Ali68. I haven't been able to look at my stage in writing so didn't fill it in there until today, there is just so much information one can handle at a time. When I did fill it I today I forgot to make it public, will see if it shows up this time. Seems a little confusing to know which stage you are sometimes. Because I have more than 10 nodes I am stage 3c. I am scared for sure esp reading how many young people have progressed, even those with no positive nodes. My MO just says you have a lot of nodes, I am giving you the most aggressive treatment we have. I have to trust him and I try not to obsess and worry too much all the treatments keep me busy and make me feel like I am doing something, I fear the rads, but, part of it is that it is unfamiliar to me. Also, I keep running into providers that have not treated many people with bilateral disease",
      "MessageIndex": 278,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 11, 2012 12:13AM Nkb wrote: Congrats Belinda and onvacation! How wonderful. My first rads is tomorrow. I'm a little afraid, just getting my energy back from chemo.",
      "MessageIndex": 706,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 18, 2017 05:51PM Nkb wrote: Tmattice- there is a very informative thread about Palbociclib which is also call Ibrance that you can read and ask questions on. Many of the women are also on letrozole with their palbociclib. Side effects usually get better with time, some people have to lower their dose for various reasons.",
      "MessageIndex": 11,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/855171",
      "Title": "Just diagnosed with Stage 4 Metastatic Breast cancer, Sparkybuff153 Nkb"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 8, 2019 12:20AM Nkb wrote: I have traveled since MBC also- But, am on orals and Faslodex is monthly. I sometimes have to shift the dates a little, get a \"vacation override\" for the meds. I have not done lab or gotten an injection elsewhere. I do worry a bit about something happening, but, want to continue to travel if possible. I just got back from Vietnam, Cambodia and Laos for 3 weeks. It does seem easier to be gone less than a month to avoid med and lab delays. I get mostly evacuation insurance - so I can get home or to a place that has good medical care. The cancellation insurance on an expensive trip is quite pricey, but, the evacuation is not. I did get a bit panicky while riding an elephant bareback at a sanctuary in Laos-that if I fell off all of my bones would break. but, luckily it didn't happen. I take some antibiotics with me and do extremely careful hand washing, hand gel, careful eating. Early in my MBC diagnosis I had a really nice trip to Paris- we just stayed in the same place for 9 days instead of our usual packing in several cities in one trip- and it was quite lovely- I was afraid that I would get tired or sick, so wanted to stay in the same place. I love Italy also and you can travel easily by train. Enjoy!",
      "MessageIndex": 26,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869100",
      "Title": "Traveling After Stage IV - Questions, Concerns and Conversation Parrynd1 helenlouise"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 28, 2017 10:23PM Nkb wrote: Kandy- I’m so glad you are going to start the Ibrance and hope it works well for you. I find the 100 mg without many side effects. I don’t know about the SEs of letrozole since I am on faslodex. I’m glad you advocated for yourself. Seems like we all have to know a lot about our options since this is a fast moving field of drugs these days. The oncologists where I am are starting to subspecialize since the speciality is getting so complicated.",
      "MessageIndex": 825,
      "PostDate": "28/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 3, 2017 02:58PM Nkb wrote: Very exciting research about the gut bacteria and avoiding antibiotics! Thank you. I have started the kefir by Siggi a few days ago- have been eating yogurt for years. There was some research about not eating for 9-12 hours per day (overnight-so no snacking before bed) helping the gut bacteria regenerate also.",
      "MessageIndex": 853,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 30, 2012 02:11PM Nkb wrote: Needtobe- I'm so glad you took the job, transitions are hard without having cancer, you will be great. I am also fearing going back, what have I forgotten? Will I be short tempered with someone who whines about a hang nail? I told work if I progress to stage 4 I won't be back- but, have decided to let that thought go! I could be in a car accident and be gone in a second. I also was renovating the master bath and thought what a waste of money, I don't deserve it, won't be around long enough to use it etc, luckily DH was there to tell me how silly that was, and I am enjoying it. I think this dx tends to invalidate us and we shouldn't let it. We didn't deserve the cancer and we do deserve a fruitful life.",
      "MessageIndex": 12,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791119",
      "Title": "Moving foward. NeedtobeSTRONG lotusbloomsinmud"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 28, 2017 12:39PM Nkb wrote: Z- wonderful picture! The vending machines are a fun part of Japan. What neighborhood will you be staying in? I hope you feel well enough to keep exploring after the treatment starts. Cat cafes. Kaayborg- thinking of you. Lots of good advice from NO1-2NV to get a nurse case manager working immediately. I would pull out all the stops to get the medication and see who can speed this up for you.",
      "MessageIndex": 5958,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 19, 2017 09:06PM Nkb wrote: JFL- no words! This negligence is completely off the charts and not justifiable in any way. I'm so sorry.",
      "MessageIndex": 5848,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 23, 2017 08:30PM Nkb wrote: Z- as you probably already know- Japan is a really safe country. The subway map looks very daunting, but, is very logical and easy to use. We also could always find someone to guide us if we did not figure it out. it seems like 1/3 of the people in Tokyo are underground in the subway at any one time, there are whole cities under there. Good luck with the treatment-I so hope that it works and that you and DD enjoy your stay!",
      "MessageIndex": 5900,
      "PostDate": "23/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 27, 2017 05:44PM Nkb wrote: Kaayborg- I am truly sorry you are in this situation. Talking to my kids has been painful, but, as you say-it is important for them to process this with you, through your eyes and relationship with them Can you appeal to Merck to pay for Keytruda or Bristol-Myers Squibb to pay for Opdivo until your insurance company figures this out? I hate to have you delay while they cogitate. Your doctor may know a \"rep\" from one of these companies and just appeal directly. Hoping for the best",
      "MessageIndex": 5946,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 1, 2017 12:27PM Nkb wrote: Lisbet/Wendy3- I still walked 3-5 miles per day- I just did it in flip flops which were the most comfortable (chaco) and then slowly able to go back to shoes. I also didn't get Benadryl since that has worse side effects than the taxol for me- I got Zyrtec. much less drowsy. Did get the steroids and stomach protectors however.",
      "MessageIndex": 6022,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 21, 2017 01:31PM Nkb wrote: Z- love the mask Kandy- did you ever ask your MO about Ibrance or Abemaciclib",
      "MessageIndex": 6288,
      "PostDate": "21/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 8, 2017 09:40PM Nkb wrote: Z- interesting and disturbing about the scan discrepancies. Curious why don't you want to take faslodex with the Abemaciclib? I hope that your MRI is good news. Will this MRI be with contrast?",
      "MessageIndex": 6503,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 23, 2017 02:26PM Nkb wrote: babs-beautiful. I hope the Paris air and the lovely daughter are very healing",
      "MessageIndex": 6718,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 27, 2012 02:39AM Nkb wrote: Jp thanks for your response, it made me feel better. I want to be cured! Finish treatment, grow hair back, go back to work, stop being the sick girl. I hate this cancer and still can't quite believe this is happening to me. I think rads will be a challenge, I will be getting a lifetime dose to my chest wall and nodes and have a moderate chance of getting lymph edema, burns, fibrosis and prob have a poor chance of getting a viable reconstruction, these risks are of course worth saving my life. Did you know that you had positive nodes before chemo from a scan ? How did they decide to take 7 nodes vs doing an AND? So you are going to tumor board to see if you should change your current plan?",
      "MessageIndex": 293,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 31, 2012 03:38PM Nkb wrote: I'm worried about the rads also. How has your skin handled the rads if you had a mastectomy? Anyone who had AND get lymph edema from rads?",
      "MessageIndex": 313,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 31, 2012 09:53PM Nkb wrote: Kjib-Good to know thanks",
      "MessageIndex": 322,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Feb 8, 2019 11:39AM Nkb wrote: Grannax- Enjoy the runway! Can't wait to see the dress. I think you are wise to try to forget all the noise for a little while and revel in your NYC adventure. I stopped taking DH to my MO appointments- I was getting annoyed with him in them- then realized his joking around or taking the MOs side had to do with his own anxiety in my situation. I take notes next to my questions and am much happier on my own at the appointments. My primary care doctor retired and my new one was so combative (not used to patients who know a thing or two I think) and I agitated about it for months and just switched to someone new-I heard she was nice- nice has to be part of the care.",
      "MessageIndex": 10670,
      "PostDate": "08/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Aug 11, 2012 08:31PM Nkb wrote: Hortense- that's for the info- been wondering what goes on- rads in ~4 weeks for me.",
      "MessageIndex": 459,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Mar 27, 2019 10:39PM Nkb wrote: bornfighter- how do you know that AA isn’t working after onlyone month? Scans?",
      "MessageIndex": 10926,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "May 24, 2019 07:38PM Nkb wrote: NouzayO- I have been on Afinitor for 2.5 months- don’t know if it is “working “ yet- but, very few aide effects- fatigue and a few mild short lived weird rashes. I was so scared to take this med based on stories I had read here. It seems to be most difficult for diabetics. But, also all these treatments seem like a crapshoot- the cancers and we are so variable. I just wanted to speak up since my MO says that people who don’t have trouble with meds often don’t speak up.",
      "MessageIndex": 11290,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 18, 2017 01:01PM Nkb wrote: Micmel- so sorry to hear about your brother. Maybe you can Skype call (or other similar technology) when he gets out of ICU. Sounds like he is in good hands. It has been a weird year of health issues for people I know, but I ran into a friend who is a cardiologist who said I wish more people were having heart disease instead of cancer- we can fix that more often!",
      "MessageIndex": 541,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 19, 2017 08:54PM Nkb wrote: Took a walk with my step brother to the Bonsai garden here. He was amazed since he works on his own bonsais- then lunch- very nice. Super good for him cause he does 24/7 care giving to his sickly and very cranky wife. Micmel- try warm water gargles with baking soda and or salt. cuts down on the bacteria in your mouth and helps the sores- like 3-4 times per day. I also discovered that I had a problem with sodium lauryl sulfate which is a detergent in almost all toothpastes. causes sores and sore red places. I stopped it and my mouth is so much better. Sensodyne pronamel doesn't have it and toothpastes in health food stores don't- but, Tom's mostly does. got to read the box, not the tube to find it. worth a try.",
      "MessageIndex": 563,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 20, 2017 06:31PM Nkb wrote: Keetsmom- It does seem like so many people have cancer. My mom (who got esophageal cancer, and breast cancer) told me that no one in her family had ever gotten cancer before- her mom died at 94 and her dad at 98 without cancer. Where is it all coming from? Many years ago there was a report saying that if we moved to an area with really low breast cancer rates and lived there a long time our breast cancer risk would be the same as theirs (low) if they moved from a low breast cancer country to ours and lived here a long time theirs would increase to our rate. That makes me think that it is environmental- but, what are the toxins? I was at a party recently talking to a person I had never met (no one at this party knew I have cancer) we were talking about art-out of the blue she said \"and everyone has cancer\" Before I could think of a reply it was announced that the cake was ready. I don't know what I would have said, but, obviously everyone is noticing all this new cancer.",
      "MessageIndex": 577,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 28, 2017 05:43PM Nkb wrote: Something my DH told me years ago which I think about a lot is when you say something to someone think about your motives for saying it. Be honest and insightful with yourself and If they are not good motives-don't say it. As a friend of mine said \"think whatever you want to think, just don't say it\" Bigbhome-previous life perhaps?",
      "MessageIndex": 692,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 4, 2017 12:52AM Nkb wrote: Nan- wow! Thanks for checking in. How weirdly interesting. Sounds from the little googling I did that there are treatments for it- I can't wait for you to make a little more blood-hanging out at 6 must be pretty exhausting-even 7.5 feels hard to do much to me. Hoping for good news soon and run of the mill solutions!",
      "MessageIndex": 743,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 6, 2017 08:35PM Nkb wrote: Micmel-I don't know your situation at all-as few people really know all that goes into each of our decisions -so this is just generic advice. When I got my first diagnosis in 2012- my first thought was oh no! how will the children manage without me? My BS at the time said how old are they? I said 20 in college- she said they will be fine, they are grown. but, I knew that I was very involved in their lives (like our generation has been-so different than my parents who assumed we would figure it out and let us try) and that they were very dependent on me. I started to parent differently in some ways-when asked for advice, \"oh- it sounds like you have some good choices\" Trying to increase their reliance on themselves in case I wasn't going to be around long. It is hard to put yourself first when you have kids-but, it is you who will keep you and DH well-kids are hard wired to put themselves first for a long time, that's how they survive. I was in a meeting at work and someone complained that they were getting burned out and someone else said-\"it is your responsibility to keep yourself from burnout, not ours\". I heard that life lesson loud and clear. I also color my hair every 4 weeks",
      "MessageIndex": 408,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 16, 2017 01:06PM Nkb wrote: Heading to the farmer's market this morning. DH is taking a long hike in Tamalpais with his BF-they couldn't go backpacking as planned because we have too many fires and smoke in California and Oregon. We are planning a trip to see DS in Montreal and then onto Paris for 10 days. I am not sure how I will arrange the Meds since it depends on how my blood tests go, but, MO says we will figure it out-just go. It is fun to plan, this is the first time we will stay in one place for so long-usually just a night or two and off we go to another city-the thought of that was exhausting. We will just explore Paris- we haven't been there in 35 years. Even though I feel more \"fragile\" than in the past-weird health things are happening to a startling number of my friends young and old and I want to try to normalize and live life as much as I can. I feel like I am living from scan to scan, infusion to infusion, shot to shot, blood test to blood test, and then I try to say- everyone lives from scan to scan metaphorically.",
      "MessageIndex": 517,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 24, 2017 11:19PM Nkb wrote: Nan- I had one in early June. It's how my bone mets and bone marrow mets were diagnosed. It's a quick way to find out what the marrow is up to instead of trying to guess why it is not making enough cells. You usually lie on your stomach, they numb up the upper hip area and stick a needle in -to get bone and to get aspirant if they can. (the liquidy stuff) I did not feel pain really, but, lots of pressure. It was hard for him to do because I had already had a lot of Zometa infusions over the last 3 years which made my bones so hard. The area was sore for several days afterwards. Occationally they do it in your sternum instead.",
      "MessageIndex": 634,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 5, 2017 12:38AM Nkb wrote: Micmel- I'm so sorry it has been such a hard 72 hours! I am more convinced every day that kids have to learn this stuff out on their own. We can't save them from a lot of the heartbreak of growing up and making costly mistakes as much as we want to. From my experience and what friends have told me of their experience with grown children living with them- you pretty much don't get what you are asking for here. After college my DS moved home for awhile, he was darling, sweet and fun to live with- but, chores, money etc-no. I decided that darling, sweet and fun was good for me and that he probably would never live with me again in life and I wanted to be left with a nice relationship without lots of memories of fights over who took the garbage out. I have plenty of friends who \"can't live with their ungrateful kids\" who my son said their house was so tense all the time. Some friends of mine have a college graduate who is coming back to live with them and all they talked about was the talks they were going to have with her about leaving her stuff around etc. -This is not going to end well So my practical advice to you is :1) she moves out on her own and learns all those lessons you want her to and figures out how good she has it with you. or 2.) You create rules, assign chores and dates they need to be done, charge rent and stick by a business relationship In regards to those details. Kids can not anticipate your needs or figure this out on their own. (take my word for it, they can't) You knew practical was coming from me  (not that I didn't rant to DH from time to time about Mr darling, sweet and fun). He now lives on his own-\"the landlady is much more neurotic about the washer and dryer than you\". hahahaha",
      "MessageIndex": 753,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 6, 2017 07:44PM Nkb wrote: Lynne from Manchester- It is totally crummy! Your friend will need you for a good long time after the burial. My friend's husband died unexpectantly right before his 62nd Birthday- and she was literally in shock for over a year. That is how I came to make a quilt to have a project together with her. Have you heard of the concept of the 2 casserole friend? Lots of people will bring you 1 casserole when the times are bad- the special ones bring you another one (and another etc) they are the 2 casserole friends. Mae- Im glad that the migraine gave you an early warning-however I think that you ( and others) are way too young for this S***. I think that I read somewhere that 80% of cancer is in super healthy people who didn't do any known thing that was a risk factor.",
      "MessageIndex": 780,
      "PostDate": "06/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 9, 2017 09:13PM Nkb wrote: Illimae- sounds like a potent trio. In reality I have no idea if I have tiny brain mets- no one has checked and I think the PET only shows part of the brain stem maybe. I'm hoping I have a stupid cancer that can't figure out how to get around these drugs.",
      "MessageIndex": 807,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nkb wrote: Hello- I have progressed on Ibrance/Faslodex and my MO's first choice for the next treatment is AA. I have read of many people suffering terribly on these drugs and not particularly helping them. My MO says that is because only people who struggle with the drugs talk about them. Many people talk about how good their lives are on Ibrance- so I wonder if I just missed the good stories. Thank you Dx 1/2012, ILC, Stage IIIC, Grade 2, ER+/PR+, HER2- Surgery 2/4/2012 Lymph node removal: Left, Right, Underarm/Axillary; Mastectomy: Left, Right Chemotherapy 2/28/2012 AC + T (Taxol) Radiation Therapy 9/11/2012 Hormonal Therapy 10/21/2012 Arimidex (anastrozole) Dx 5/2017, Stage IV, metastasized to bone/other, ER+/PR-, HER2- Targeted Therapy 6/1/2017 Ibrance (palbociclib) Hormonal Therapy 6/1/2017 Faslodex (fulvestrant) Hormonal Therapy 3/13/2019 Aromasin (exemestane) Targeted Therapy 3/13/2019 Afinitor (everolimus) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869462",
      "Title": "Looking for good stories about AA (Afinitor and Aromasin ) Nkb pajim"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Apr 23, 2019 04:00PM Nkb wrote: I just got evacuation insurance through AAA- for my last trip- didn’t ask about exclusions. All went well- but, I will ask for next trip.",
      "MessageIndex": 73,
      "PostDate": "23/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869100",
      "Title": "Traveling After Stage IV - Questions, Concerns and Conversation Parrynd1 helenlouise"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 28, 2017 01:37PM Nkb wrote: Cure-ious- bravo for your work with gender equality in STEM. I just heard a bit of an interview with Melinda Gates who said gender equality is far worse than when she was working. She did say that she thought the current trend toward exposing what is going on was going to help. Men need incentives to move out of the old boys network and rules to guide them. (they just don't get it otherwise) Do you think that there is a subset of people who are actually killing cancer with the Ibrance/Faslodex or femara vs just causing a big pause that will eventually mutate and recur-or just that the pause is longer for some people. Would you switch to Abemiciclib because you thought it was a better drug or just a different one. Which immunotherapy are you considering? Seems like the future will be adding the immunotherapy to Ibrance/hormonal right from the beginning. I am early in research of all this however.",
      "MessageIndex": 5960,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 29, 2017 03:42PM Nkb wrote: Lalady- very interested to hear what your MO says about this. Wonder if UCLA is doing any studies adding immunotherapy to a CDK4/6 inhibitor? I think that animalcrackers is doing ribociclib after failing Ibrance. interesting. yes, choices are key!",
      "MessageIndex": 5982,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 30, 2017 09:49PM Nkb wrote: Lisbet54- I'm sorry that you got the idea that I had a lot of side effects- I was trying to let you know that it is totally manageable. The metabolism goes back to normal when you finish the drug- I do understand where you are coming from with chemo- before I got cancer I was almost afraid of Tylenol! I'm still here and doing well 5 years later! It is a hard choice I understand-thinking of you!",
      "MessageIndex": 6011,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 3, 2017 03:46PM Nkb wrote: Kaylynne- It is true that TNMBC can be an aggressive type- on the other hand some very exciting immunotherapy combos are working for just that type. There has been a lot of progress recently. You could look on the immunotherapy threads to get more info- immunotherapy is a complicated topic-but, the more you read the more the same terminology gets used over and over and starts to make more sense. Stats and generalizations scare me sometimes too, try to be your healthiest self-you are unique in your response to everything.",
      "MessageIndex": 6065,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 12, 2017 11:02AM Nkb wrote: Z- these are amazing dispatches from your experience in Japan. Sounds like you are doing very cutting edge and progressive treatment which is clearly called for to beat this beast. You are very brave and I am appreciative and also fascinated. I have ended up with such a western approach to disease and treatment that it has narrowed and biased me- great to see alternate thinking with science behind it. Love the cover of the “novel” you are reading. Time for me to pick up one of these books. Trying to read some of the studies would be much easier. hello to DD and hope you are well enough today to gently frolic together. ",
      "MessageIndex": 6203,
      "PostDate": "12/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 9, 2017 01:07PM Nkb wrote: JFL- i read the monarch 3 study and they started out with the 200 mg BID even with the faslodex and after one month they decreased it down to 150 mg BID- not sure why. It is daily without the week ( or more) off in between. Taking my calcium, vitamin D and doing weight bearing exercises along with the Zometa in the hopes that the bones will get strong again.",
      "MessageIndex": 6524,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 11, 2017 11:11PM Nkb wrote: Cure-ious- this was known as Antabuse (disulfiram) and drinking with it made you very sick. Maybe if it works well you could take some vacations here and there for a drink. I love the “repurposing “. Finding drugs that actually kill the cancer cell or induce it to commit suicide vs just pausing them in G1 would be very welcome. Thanks for that- I’ll try to read it tomorrow.",
      "MessageIndex": 6930,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "May 7, 2019 06:35PM Nkb wrote: WOW Miaomix ! I really hope that works! Is this supposed to be effective without the hormonal in a way that it wasn't effective with the hormonal? or is it going with the theory of being off a CDK for awhile and then it works again?",
      "MessageIndex": 11211,
      "PostDate": "07/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 12, 2017 08:48PM Nkb wrote: illemae- I think exercise really does help the fatigue. and the nausea if you every get that. being outside feels good. always my first choice of treatment when I feel fatigue.",
      "MessageIndex": 473,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 18, 2017 05:37PM Nkb wrote: Micmel- You hit the nail on the head about making sure that your loved ones know they are loved and you have their backs. You are their safety net should they need one. I feel so sad to hear people say they didn't know DH, or mom or someone else loved them! When a friend's DH told me how much he adored her-but, never told her!! Now I am much more aware to offer concrete help, (I can give you a ride to chemo, I can buy take-out food, pick your kids up at school etc) not just say call me if you need anything. When DH wasn't available for one of my chemos, I thought of the two people who had specifically said they would take me if I needed. I send more cards, little gifts if I know it would be fun to receive. Make an effort to be kinder, to offer help, reassure. But, your brother's experience is what I meant by we are all living scan to scan metaphorically.",
      "MessageIndex": 551,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 22, 2017 01:14PM Nkb wrote: Micmel- Congrats on DS and the lawn mowing. If you think about it from your kid's prospective (which I tried to do-remembering what I was like and how willing I was to help as a kid-not) it is not his lawn and he doesn't really care if it is mowed. It is your lawn and you care. So, just presenting it as this is your job if you live here and not trying to make them think about the lawn and care about the lawn or attach their caring about you to how they treat the lawn. Just assign it, give a date and guidelines. our son seemed to be in the Mohawk style of mowing-hope yours does better. When my DH tried to tell my son to put the toilet seat down for me, my son was all logic about it- how it did not make sense, I should pay attention and not fall into the toilet expecting the seat to be down and it was just as inconvenient for him etc. No argument worked with him. Finally DH said-Look, just do it as a favor to mom, ok-you don't have to agree to the concept-just do it. Keep in mind that it is said that frontal lobe maturity is complete at 25 years old.",
      "MessageIndex": 603,
      "PostDate": "22/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 25, 2017 11:53AM Nkb wrote: Micmel-Liver resection is much worse that a bone marrow biopsy! I thought that the double mastectomy was no piece of cake either. I do think that they will turn breast cancer into a chronic disease like high blood pressure or something or be able to cure it completely some day. Just hope it is sooner rather than later. Making a baby quilt for DD1 and going to work on that today and a long walk. it is a beautiful sunny day here-happy Monday everyone else.",
      "MessageIndex": 642,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 25, 2017 02:16PM Nkb wrote: Micmel- I knew how to sew already, but, hadn't in years. A friend of mine who quilts a lot-her DH died suddenly and I wanted to have a project together with her to stay extra connected. I just stumbled along and got her advice and it has been fun. On the subject of worrying about cancer- it is stupid for me to say this- but, if someone had told me hey you are going to have 4 years without problems- I would have worried a lot less. We did travel a lot and try to act normal-but, it was on my mind daily and made me feel less valid. I actually feel less worried now-maybe because the other shoe has and dropped and so far not too bad. I'm not as young as you though. Also-this may not be meaningful-but, I think of people who have it worse than me and decide I am fine. My MO kept saying go out and live your life-but, I don't think I understood it until now. My first MO said \"everyone has a cloud over their head-yours is just bigger\".",
      "MessageIndex": 645,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 27, 2017 06:09PM Nkb wrote: Micmel- You figured me out. I do feel much more calm and rational than with the first diagnosis. I also feel better with more blood-severe anemia made me feel fragile- and therefore fearful. when friends wanted to do something active-I would be afraid I couldn't do it or would hurt myself. Feel much better now and am doing more and trying to act normally. On the other topic- I only told about 10 people total and my DH told his 3 best friends when I was first diagnosed in 2012. I told most of those 10 about being stage 4 and my DH decided not to tell his 3 best friends. I don't hear any of those clueless statements-because no one knows but, very close special people. Just enough to provide support. I get support and tons of time to discuss cancer and read about how people are doing here. I think people really don't know what to do or say and really don't want to talk about cancer. I love having friends who have no clue-it isn't a topic of discussion because they don't know. I used to worry that they would be mad at me for not telling them-now I could care less if they find out and feel I left them out of this detail of my life. This is my news/life to do what I please with. I used to feel weird when people said How are you? and I said fine. But, DH convinced me, you are fine, right now-so it is not deceptive. it's just a point of view- and you get to have the one that works for you. When people say I've never told anyone this -my first thought is -and you don't have to tell me either-only tell me if you think it will make your life better. I don't need the details or drama. I'm good.",
      "MessageIndex": 670,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 8, 2017 03:33PM Nkb wrote: Micmel- what part of the country do you live in?",
      "MessageIndex": 792,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 28, 2017 11:23PM Nkb wrote: Mom- I am horrified by this story. Does the right hand know what the left hand is doing? Is anyone her primary responsible doctor? I am extremely thankful that she has you as her advocate! I wonder if it is the \"fancy\" tertiary care places that seem to have an extraordinary amount of these experiences. When I was going to some of the appointments with my mom at UCSF I had to get real a few times with the egos that practice there. I think I kinda shocked my compliant with the status quo mom- but, message sent and received, and that did help a few times. Luckily in the ER once, a doctor who had met her before and was getting off shift came over and said hi- and I said can you get her a pain shot-that is why we are here- and we are waiting much too long-she stayed overtime and got her that shot-(vs the plan to let all the docs and nurses change shift and then go get a CT first--ah no!). Lisbet- please get more help. I don't know your system there-but, it sounds like your best interests are not being served and you need Plan B -different doctor and more options, and all the other suggestions above.",
      "MessageIndex": 5973,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 29, 2017 12:57PM Nkb wrote: Bluebird DE- your theory of how Ibrance works is what I was suspecting as well. Wonder if Abemaciclib would be different- Lilly says that they \"completely eliminated cancer in 16 patients over 2 studies.\" (semantics?) Shetland- would you consider Abemaciclib? the literature said it could be used on Ibrance failures (and also without a hormonal) since it works differently.",
      "MessageIndex": 5980,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 3, 2017 04:51PM Nkb wrote: Shetland- I hear you! I read somewhere that cancer puts you into \"hypervigilance vs denial mode\" I have thought about the idea of having ovaries out -although more surgery is not on my things to do list. How do they check for a Lynch gene mutation?  ",
      "MessageIndex": 6070,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 11, 2017 12:45AM Nkb wrote: JFL-in the Monarch trial it was lowered after a little more than one month and didn't mention why in the study I saw. The people who started the trial earliest got the higher dose for about a month and the people that started it later did not get the higher dose for a month. I don't remember if there was any difference in outcome of the two. I am interested in Abemaciclib if Palbociclib fails- so all info you find interests me.",
      "MessageIndex": 6543,
      "PostDate": "11/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 16, 2017 12:51PM Nkb wrote: Illmae- I don't eat chickpeas anymore due to their high estrogen content. A nutritionist told me about it years ago- I miss them, - has anyone else heard this? I did see a comparison to other foods and it was off the chart for garbanzos! No horror movies for me- comedy all the way.",
      "MessageIndex": 515,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 21, 2017 03:06PM Nkb wrote: Nan- I don't know you, but, beautiful dresses and smiles in your pictures. I'm so glad it went well. Micmel- One reason in favor of leaving a hospital earlier is that hospitals are full of very sick people and you can get infections and other illness the longer you are there,when you are in a very vulnerable health state yourself. Also ICUs are super stressful places to be and people often get ulcers when they stay there a while. If your brother knows he needs to make lifestyle changes that can be very anxiety provoking also. I think having an experience like his is very scary and leaves you not trusting your body to work correctly for awhile. He will need to build up confidence again.",
      "MessageIndex": 596,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 25, 2017 01:33AM Nkb wrote: Yes, outpatient procedure- probably takes 20 minutes total, stay dressed for the most part.",
      "MessageIndex": 639,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 28, 2017 01:11PM Nkb wrote: Chile- amazing stories and beautiful pictures! 50sgirl- I thought reason 2 was written directly to me also. I was going to try and reconcile with my estranged sister until I made a list of my grievances and thought no-it would not be healthy for me. She only tries to reconcile around Thanksgivings and Christmas which are at my house since I have kids. Also a psychiatrist friend told me that my sister was aware of what she did- I couldn't blame her horrible behavior on mental illness or not knowing what she did. That is how I always justified it in the past. When she did incredibly hurtful things it took me months of nightmares and anger to get over it and she just sashayed through life destroying whatever she needed to for the slightest advantage . I am happier without her, but, do feel guilty about it at times. Micmel- I personally don't understand when people take sides in someone else's divorce or actually anything to do with someone else's marriage unless there is abuse. No one knows the inner workings of a marriage but the two involved. Nan- did you have your bone marrow biopsy yet? How are you?",
      "MessageIndex": 681,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 3, 2017 03:01PM Nkb wrote: Micmel!!-yikes. I hope that there is a simple explanation for your seizures-especially if it is something you can avoid to prevent them. Did you get any electrolyte imbalances or anything from not eating? Please update as you find out more. ChelleG- I had a lot of joint pain with the arimidex that yoga really helped me with-i don't know if you can get to a class-find a teacher that is experienced with this. My friend just died of leukemia and another friend has Glioblastoma- what's going on? got my flu shot today-don't want to add flu to my life Illimae-good luck with MRI.",
      "MessageIndex": 737,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 9, 2017 03:48PM Nkb wrote: Illamae- Im glad that you found the brain lesions when tiny. What else will you be taking after the zapping to keep everything at bay? I read an article that said that when the cancer first comes it sends little messengers to other parts of your body and says make a nice home for me because I am coming there too! Like little scouts looking for future homes- preparing the soil- and we need meds to work on ways to prevent that. Micmel- I feel sorry for parents of small kids now- there are so many more distractions, screen time fights etc. When my kids were small, they had no phones till high school. The Mac was in a common space in our house and when they asked for games I just said they didn't make them for Macs (and got away with that for years) My kids are not good computer gamers- but, they did thank me later for not buying them gameboys etc. What's a parent to do nowadays though??",
      "MessageIndex": 803,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 13, 2017 04:08PM Nkb wrote: kandy- they are both approved drugs that are considered targeted therapy. They are oral. They are similar and so far used in people with HR+ Her2- disease. The palbociclib needs to be taken with a hormonal - usually letrozole or faslodex (monthly shot) or other hormonals. The abemaciclib can be taken with a hormonal or not and supposedly crosses the blood brain barrier. Abrmaciclivwas approved only about a week ago and is apparently appropriate for people who have had multiple drug failures. I would read up on them and discuss with your MO. I think Lilly is the drug co for abemaciclib- they have said the drug is free or $10 for a year “if qualified”. Otherwise these are pricey drugs- what else is new.",
      "MessageIndex": 811,
      "PostDate": "13/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Sep 23, 2017 01:04PM Nkb wrote: Babs- following also and hoping for great news!",
      "MessageIndex": 44,
      "PostDate": "23/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/857416",
      "Title": "Study on GDC0077 babs6287 zarovka"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 5, 2017 06:05PM Nkb wrote: Babs- This Is such exciting news! I am so happy for you and so grateful that you are doing this study! In the future we may all be getting a \"cocktail\" that includes this drug if we have this mutation.",
      "MessageIndex": 54,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/857416",
      "Title": "Study on GDC0077 babs6287 zarovka"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 8, 2017 05:33PM Nkb wrote: Cure-ious- very interesting.",
      "MessageIndex": 68,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/857416",
      "Title": "Study on GDC0077 babs6287 zarovka"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 7, 2017 11:07PM Nkb wrote: I've mostly kept it a secret- but, took out the garbage one night and just had a hat on (no wig) and my next door neighbor said \"are you on chemo?\" I didn't want to tell her, although I like her a lot- I said yes and she proceeded to tell me a horrendous story about her friend with ovarian cancer! I did not need that. Another time when I went in for one of my daily radiation treatments the receptionist said\" here's a pink bracelet for promoting early detection\" I blew up briefly- Look I've had an annual mammogram longer than you have been alive-early detection did nothing for me! Then, I regrouped and said-sorry, no thank you to the pink bracelet. And to the few people who know I'm almost always fine. (which is true in that moment in time) We all do what we hope works for us. People on this forum are who I discuss breast cancer with.",
      "MessageIndex": 25,
      "PostDate": "07/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/857643",
      "Title": "Are you frank with strangers about your cancer? illimae wleeky1952"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 16, 2017 04:01PM Nkb wrote: Blaine Jennifer- so many people have said such wonderfully supportive wise things already. And i hope somehow you are feeling better today. No one ever knows all the details and the loss of a mother no matter the circumstances is primal and hard and sad. I would thank your sister for her care over the years and let her know how grateful you are that she could do it when you couldn’t. All caregivers need this. She may open up more about her delay in telling you. While i was on chemo and so sick, my mother got metastatic esophageal cancer and my older sister moved in with her and took care of her. Years later i heard some of the super hard days she decided not to share with me at the time- she felt i had enough on my plate- and maybe i did- but, she had a lot of pain i didn’t know about for years. Some people say the right thing at the right time and sometimes those people are therapists-i hope you find that person. Your family does not want to lose you! Perspective is off when you feel as sick as you do right now. Lastly DS and ADHD- my DD1 has it also and struggled mightily when she went away to college. We kept her on a pretty structured rope at home and turored her in all subjects. Let’s just say she took a crooked path to success-but, she is a kindergarten teacher now. Thinking of you and sending hugs.",
      "MessageIndex": 13,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/860168",
      "Title": "How to Keep Going, When All My Go is Gone blainejennifer kachincolor"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Apr 19, 2019 07:10PM Nkb wrote: Finallyoverit- I remember one more important aspect to the weight loss issue. Your brain wants to maintain homeostasis- in general when you start losing weight it gets alarmed and wants to hold on to the weight. It does this by making you hungry, making you crave certain high calorie foods. Telling you that you are doing so well you DESERVE the high calorie food. I do notice this every time I lose a few pounds-the brain tells me to go out to dinner, have a hot fudge Sunday etc- you have to use incredible will power and remind yourself that this is a trick of the brain to not derail the weight loss at this moment. ( I'm not talking about when you are ill, depressed, side effect of drugs etc)",
      "MessageIndex": 11,
      "PostDate": "19/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870903",
      "Title": "Stage IV and losing weight intentionally finallyoverit CursiveStars"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 8, 2017 07:58PM Nkb wrote: Kandy-I hope it goes well. It's working well for me so far. I did feel really tired on the first month and my blood counts got too low and I had to lower the dose to 100 mg which is much better for me and I feel good most of the time. I do have to take 2 weeks off before I can start the next cycle, but, my MO is not concerned with that at all. I got mouth sores on the top dose which did well with baking soda mouth rinses-don't really have them now and have stopped the mouth rinses. Anyway, so far my scans are looking good and TMs are coming down. I so hope that it works well for you!",
      "MessageIndex": 872,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 14, 2017 10:31PM Nkb wrote: Kandy- I’m so sorry that you are having this reaction. The blood transfusion will make you feel much better. 5 is really low- no wonder you are short of breath just walking around! I’m hoping that the much lower dose less often is tolerated until a new plan comes up. Someone else got really low platelets also and i think is doing ok on a lower dose, but, i don’t remember if they Ultimately stayed on it. Hoping you feel much better with the blood tomorrow.",
      "MessageIndex": 876,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Dec 7, 2017 11:57AM Nkb wrote: oh Kandy- I’m sorry you feel so bad. I hope they find a solution to get some calories into you - that could go along way. Thinking of you and praying for a brilliant new idea for treatment.",
      "MessageIndex": 936,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 8, 2017 08:29PM Nkb wrote: Kandy- thinking of you and praying for a miracle. After the miracle perhaps the PIK3 drug babs is on could help along with the abemaciclib.",
      "MessageIndex": 760,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Oct 13, 2017 10:50AM Nkb wrote: kandy- are you a candidate for abemiciclb or palbocicib at all?",
      "MessageIndex": 809,
      "PostDate": "13/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 3, 2018 02:56PM Nkb wrote: cure-ious-fascinating! Is a link to this paper available? Thanks",
      "MessageIndex": 1040,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jan 18, 2018 06:40PM Nkb wrote: heartbroken",
      "MessageIndex": 1120,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Apr 9, 2019 07:05PM Nkb wrote: I gained 15# with natural menopause- then decided to lose it. Besides cutting down on calories, I increased exercise and started some mild home weight lifting. you can also get stronger using your own body weight like push ups against the wall at first, plank pose etc. Some researchers believe that 10-20 minutes of exercise BEFORE breakfast leads to more weight loss. I did that with the exercise bike I have at home. The other important thing is to try to go 12 hours or more without eating. It restores your gut biology. So dinner at 7 pm and no food again til 7 am or later. no snacking etc in the 12 hours. The IV chemos slow down your metabolism which leads to weight gain for more than half the people who need them post diagnosis. I also gained 15# over the 6 months of chemo- did the same technique to lose the weight. For me it is important to cut down on carbs, especially sugar. For others it is cutting down on the fat that leads to weight loss. Keeping a food journal can help you pinpoint some of the food issues.",
      "MessageIndex": 7,
      "PostDate": "09/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870903",
      "Title": "Stage IV and losing weight intentionally finallyoverit CursiveStars"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "May 7, 2019 11:14PM Nkb wrote: Nicole- the injections caused nausea for me for the day. I drank ginger tea, ate crystallized ginger and pushed fluids and that helped. I finally brought the ginger with me instead of waiting until I got home and that really helped. besides warming the injections and giving them very slowly, massage the area and do stair climbing or something that uses your glut muscles to help disperse it.",
      "MessageIndex": 3,
      "PostDate": "07/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/871416",
      "Title": "Questions about Faslodex and others.... NicoleRod NicoleRod"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Jul 23, 2012 05:47PM Nkb wrote: I don't like the amoena camisoles. I find the breast forms go to the sides too much and get in the way of the movement of my arms. For awhile I would put a safety pin to prevent them from migrating to the sides, but, too much trouble. I love the amoena Mona bra,sometimes it shows a little because it is not low cut at all, but, family and friends say it looks like a little cami is peaking out, not a bra-- I just go with that!",
      "MessageIndex": 748,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Apr 19, 2019 07:37PM Nkb wrote: Lily55- I hope that you are feeling better soon. I understand how hard it is to go through this by yourself- I wonder if a support group could help you in the interim? I wonder if a palliative care doctor could help find a treatment that you feel well with. I don't know how many treatments you have tried. It would be good to see if there is a passion or project or \"bucket list\" you have as planning for the future as if you are going to be here for awhile is vital to survival. Maybe a second opinion with someone you could trust at least for fresh eyes on your situation. It is said that people with ILC progress later- so several years doing ok and then start to go downhill. For me (bone mets) I also have bone marrow mets and before treatment I got very short of breath walking up hill because the bone marrow was filled with cancer and couldn't make cells- so very anemic (also they said that I had permanent bone marrow damage from my original chemo). I think that without treatment I would have had bone marrow failure- I actually don't know when the bone mets started since I was on Arimidex without any monitoring or scans or TMs etc. So, I don't know how long it would have taken for failure. Hugs to you",
      "MessageIndex": 4,
      "PostDate": "19/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/871091",
      "Title": "How long with no treatment for ^econdary bone mets? Lily55 msmann63"
    },
    {
      "AuthorID": "Nkb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155883/profile",
      "Content": "Nov 4, 2017 02:00PM Nkb wrote: Finallyoverit- How heartbreaking that decision must have been! I can't imagine having to do that. Hope you find some extra hugs today!",
      "MessageIndex": 3,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/859847",
      "Title": "Another kick in the gut finallyoverit DivineMrsM"
    }
  ]
}