{
  "AuthorID": "Nlanzi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210226/profile",
  "Posts": [
    {
      "AuthorID": "Nlanzi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210226/profile",
      "Content": "Jan 18, 2015 03:30PM Nlanzi wrote: Thank you so much Denise-G!!!! ",
      "MessageIndex": 2,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827669",
      "Title": "Paget's disease... Not diagnosed just very concerned Nlanzi Nlanzi"
    },
    {
      "AuthorID": "Nlanzi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210226/profile",
      "Content": "Jan 19, 2015 02:43PM Nlanzi wrote: thank you glennie! I have a dermatologist appointment tomorrow at 3:30. So I will push for a biopsy!",
      "MessageIndex": 4,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827669",
      "Title": "Paget's disease... Not diagnosed just very concerned Nlanzi Nlanzi"
    },
    {
      "AuthorID": "Nlanzi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210226/profile",
      "Content": "Nlanzi wrote: hello. My name is Nicole. I am 23 years old and a mother of a beautiful 2 year old girl. 😃 I've had a crusting/scabbing on my left nipple for probably over a year now. It never really bothered me so I was never concerned. Eventually my right nipple has the same issue. Left is definitely worse than the right. Last week as I was getting into the shower I noticed my skin on my breasts seemed really tight. Then I realized for the past month or so my breasts And nipples have been extremely itchy and sore. So I had my mother in law check it out, she's a breast cancer survivor, she said I need to go to the doctor Asap. So Thursday of last week I went to my family doctor. She seemed very concerned. She said she was pretty positive it was not eczema, and mentioned Pagets Disease. She's going to make an appointment with a dermatologist. I should hear from her Monday or Tuesday about when the appointment is. I am so nervous and scared. 😩 I've also been feeling nauseous on and off for probably the last month and a half. She gave me a pregnancy test, which came back negative. There is NOT any oozing or bleeding, and my doc did not feel any lumps. She did say my breast tissue felt pretty thick, but it's probably because I'm so young. But my breasts have been itchy and sore like crazy lately. I've been reading a lot about Pagets and how it is often mis-diagnosed. Do any of these symptoms sound familiar to anyone who has been diagnosed? Any advise of what to do or ask at my Derm appointment? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827669",
      "Title": "Paget's disease... Not diagnosed just very concerned Nlanzi Nlanzi"
    }
  ]
}