{
  "AuthorID": "NLC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84765/profile",
  "Posts": [
    {
      "AuthorID": "NLC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84765/profile",
      "Content": "Apr 13, 2014 12:46PM NLC wrote: Kicks,  Thank you so much for sharing!  I tried it this morning and was finally able to put on my sleeve.  It doesn't look like a really good fitting sleeve or maybe my arm just became swollen up after the measurement?  Anyway I think I will have to go back to the fitter next week. The fitter is certified and is actually referred to me by my PT.  I guess not a good one.",
      "MessageIndex": 2,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820122",
      "Title": "Compression Sleeve help NLC Binney4"
    },
    {
      "AuthorID": "NLC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84765/profile",
      "Content": "NLC wrote: Hello, I got my compression sleeve for the first time yesterday, and am already having problem.  I couldn't even put it on myself!  When I was at the certified fitter's office yesterday, she was helping me to put it on.  She was pulling the sleeve up my arm.  My arm and hand actually turned red after all the pulling.  (When I was doing some internet search for tips that night, I realized that was not the best way to put on a compression sleeve.)  She sold me a sleeve glider saying it's supposed to help.  When I was using it this morning, the glider did help to slip the sleeve onto my arm, but the glider got stuck to my skin underneath the sleeve!  I think it's because of moisture/sweat on my arm, that plastic glider thing just sticks to my skin.  So I ended up taking off the sleeve and the glider together.  Also the fabric of my compression sleeve seems to be so stiff and thick.  Maybe because it's brand new?  It seems like some people put on their sleeves so effortlessly like putting on pantyhose.  =( Just wondering if anyone would like to share their experience with compression sleeve.  Any tips on putting it on easier? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820122",
      "Title": "Compression Sleeve help NLC Binney4"
    }
  ]
}