{
  "AuthorID": "nlmlillysmo…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179157/profile",
  "Posts": [
    {
      "AuthorID": "nlmlillysmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179157/profile",
      "Content": "Jun 6, 2013 09:07PM nlmlillysmom wrote: Thank you, everyone. Hearing different opinions and experiences is very helpful. Now, I just wait for surgery day. QUESTION: My husband cannot be there, so my best friend is taking me. If the surgeon gets in there and decides things look bad, and wants to take out more, will someone need to OK that? Is written directions signed by me enough if decisions need to be made. Do doctors ever decide to do a full mastectomy or node removal based on what they see? If he does mess with nodes, how worried should I be about lymphadema?",
      "MessageIndex": 11,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805699",
      "Title": "Surgeon wants to remove it... Freaking Out- Have Questions nlmlillysmom chef127"
    },
    {
      "AuthorID": "nlmlillysmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179157/profile",
      "Content": "Jun 4, 2013 09:16PM nlmlillysmom wrote: Thanks all.  The more I think about it, the more relieved I am that it WILL be taken out. It is an unwelcome guest (no matter what it is) that has moved in, raided my refridgerator (caused swelling), left toothpaste in the sink (caused ache in my chest), and has over-stayed its welcome.  Honestly, even if it was possible to biopsy it blindly (since it doesn't show on mammo or u/s), I would never lose the anxious feeling I have every time I feel it.  Not only that, but by taking it out and examining the entire thing, I can have knowledge that the results that I get back are of the entire mass, not just a section of it that may or may not have hit the right spot. I appreciate everyone's insight.  It is such a stressful, worriesome thing to go through.  I just hate it.  I will be so happy to know what it is, rather than the short-list of what it isn't.  I hope for good results, but right now, lack of knowledge is my worst enemy.",
      "MessageIndex": 7,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805699",
      "Title": "Surgeon wants to remove it... Freaking Out- Have Questions nlmlillysmom chef127"
    },
    {
      "AuthorID": "nlmlillysmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179157/profile",
      "Content": "Jun 10, 2013 09:43AM nlmlillysmom wrote: Airianna,  I feel your pain.  I, too, am jumping through the hoops of all this.  There was a one-week lapse between my visit to my PC and then my actual mammo and U/S date, then there was a week-long wait between imaging results (negative despite palpable lump) and the referral to a surgeon, 4 days between the referral and consultation, and now there will end up being a total of 18 days between my visit with the surgeon (who wants to do excision) and my actual surgery date.   It sucks.  I know.  Five weeks feels like an enternity! This is esspecially true when it is all in waiting just to find out what it is! I hate that there is something in my breast and I have no better idea now of what it is than I did when I found it. Hang in there.  Thank goodness for the WWW and places like this, right?",
      "MessageIndex": 9,
      "PostDate": "10/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805800",
      "Title": "2 wks till Excisional Biopsy- too long to wait? Airianna23 leaf"
    }
  ]
}