{
  "AuthorID": "NM71",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221134/profile",
  "Posts": [
    {
      "AuthorID": "NM71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221134/profile",
      "Content": "Sep 11, 2015 10:43PM NM71 wrote: Not sure if this is the way to do my first post. Just finished day 3 of radiation, am using Miaderm. Wondering if it's a good thing to mix creams. I also bought aquafor and aloe vera. My breast feels a little warm only day 3. I'm very fair, was a redhead when I had hair, so I have redhead skin. Was thinking after Miaderm, wait an hour or so and then use some aquafor ointment at night? Any help would be appreciated. I've seen lots of good reviews on Miaderm, but wasn't thrilled about the company's dun and bradstreet report, but that may be meaningless. Anyway, my real question is on mixing creams/lotions. Thanks. btw I'm 69, from a chronological perspective, and I guess my skin is also.",
      "MessageIndex": 158,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "NM71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221134/profile",
      "Content": "Sep 12, 2015 12:38PM NM71 wrote: Thanks - re mixing lotions. I did go ahead and put on aquafor last night some time after miaderm, no problems. I started using miaderm a few days before radiation. It's hard to tell whether or not I'm having any radiation reaction yet (other than warmth) as my breast is still pink from surgery, which was about 7 weeks ago. Dr. said it's pink as there's still some edema there. I'm on this discussion group to be as proactive as possible. Seems like a great bunch of people here.",
      "MessageIndex": 163,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    }
  ]
}