{
  "AuthorID": "nmiller",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
  "Posts": [
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 17, 2010 01:59PM nmiller wrote: Glad the Gemzar went smoothly and I hope it is wreaking ALL kinds of havic in your body killing off LOTS and LOTS of cancer cells.  Sending up lots of prayers and sending you all my very best healing vibes!! ",
      "MessageIndex": 127,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755270",
      "Title": "The prognosis in not good RobinWendy BrokenHeart"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 26, 2010 12:53PM nmiller wrote: Robin, I am SOOOOOOOOO happy for you!!!!  You have been in my prayers and I am so glad that you have already gotten such good news and that you are feeling well!!!!   GO GEMZAR!!!!!!!",
      "MessageIndex": 187,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755270",
      "Title": "The prognosis in not good RobinWendy BrokenHeart"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Feb 11, 2010 02:18PM nmiller wrote: Sumby, I was diagnosed 2 1/2 years ago at the age of 26. No family history and I was vigilent about frequent doctor checkups so it was a pretty big shock.  I was Stage IV from the get go, but I am doing well and living a relatively normal life.  Sometimes it does feel a bit isolating going through this at a relatively young age, so please feel free to PM me if you ever need to talk!  I will turn 30 in September and while so many of my friends are dreading that birthday, I see every birthday as a HUGE reason to celebrate.  I would not wish this disease on anyone, but the silver lining is that it does make you appreciate all the little things in life so much more (sounds very cheesy, but it is true!!). All my best to you as you walk through this journey!!",
      "MessageIndex": 21,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/747329",
      "Title": "Is anybody else as young as i am? sumby nmiller"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Feb 11, 2010 09:01AM nmiller wrote: Great news!!!  Enjoy ever second of your trip and hopefully the next scans will show that the RAD001 was just slow to start working :)",
      "MessageIndex": 10,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748170",
      "Title": "Woo Hoo! I'm still in the RAD001 / Everolimus study MJLToday nmiller"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jan 28, 2010 12:23PM nmiller wrote: MLJ Today, I was on RAD001 for about 6 months last year and got lots of mouth sores and my cholesterol went up.  Sounds like you are definitely getting the real drug!  Try the Kanka wand from the drug store for the mouth sores - it worked the best for me!  I hope the RAD001 will keep working for you for a LONG, LONG time!!! All my best! ",
      "MessageIndex": 7,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746497",
      "Title": "Woo Hoo! I have mouth sores LOL MJLToday heatherpalmerton"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Feb 23, 2010 07:04AM nmiller wrote: Thanks everyone!!!  Very helpful!!  I love that we have so many new great drugs in trial.  Keep them coming!!!",
      "MessageIndex": 3,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748745",
      "Title": "Neratinib trials? nmiller nmiller"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "nmiller wrote: Simba mentioned a possible Neratinib trial on her TDM1 thread, but I decided to start a new thread solely devoted to info on Neratinib to see if I could learn more about available trials.  I am currently on a TDM1 and Pertuzmab trial that I hope will work for a VERY long time, but I am also incredibly interested in hearing if Neratinib trials are now open for us Stage IV gals?  My wonderful doctor at Dana Farber said he thinks Neratinib will be even better than Lapatinib (Tykerb) so I am hoping that if I run my course with TDM1, then a Neratinib trial might be available.  When I asked my onc at UNC (where I am participating in the TDM1 trial) about Neratinib back in September, she didn't seem to think that there were any open trials yet.  Has anyone heard of any? As always, thank you all so much for reading and for helping me navigate this often tricky journey!  I feel so blessed to have found this board :) Dx 6/26/2007, 6cm+, Stage IV, 0/27 nodes, mets, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748745",
      "Title": "Neratinib trials? nmiller nmiller"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Mar 1, 2010 12:10PM nmiller wrote: Praying everything is going well today :)",
      "MessageIndex": 299,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Feb 15, 2010 11:04AM nmiller wrote: Just wanted to say, like all the others before me, I will be praying for you and sending you all my best healing vibes that the cyberknife gets rid of the pesky brain met and then you can find your way into another great trial or treatment.  I'm so glad you had a weekend of fun already planned in Boston (one of my very favorite places) and I hope you were able to enjoy every second of it - I agree that DeNile is a wonderful place to visit :).  All my best!",
      "MessageIndex": 112,
      "PostDate": "15/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Mar 2, 2010 05:15PM nmiller wrote: Kenzie - I am so sorry that you are in a low place right now.  I agree with what the others have said that your onc needs to help you get control of some of your side effects so you can feel like you are in a better position to decide what you want to do with your treatment.  I have lung mets too and I know that feeling like you can't get a decent breath is so incredibly frustrating and tiring.  My onc finally sent me to a pulmonologist to see if he could help with symptons - he put me on Flovent (4 puffs twice a day) and I can say that while things aren't perfect, I feel SO much better.  I know the Flovent isn't actually treating the cancer (hopefully the chemo will do that), but it has made my breathing so much better by cuttting down on all the inflamation in my lungs.  Just thought I'd mention it so you could ask your onc if it might be able to help you with your breathing, too.  All my best to you as you deal with such a terrible situation. Take care of yourself, and never feel like you are beging a Debbie Downer for posting here - we are all here for you!!",
      "MessageIndex": 9,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748778",
      "Title": "Received results of MRI to Hip today kenzie57 ElaineD"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jun 27, 2010 02:11PM nmiller wrote: Here's to MANY years of NED for you!!!!  I am so happy to hear this news!!  Congratulations!  I hope you are doing LOTS of celebrating :)",
      "MessageIndex": 9,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754650",
      "Title": "NED w Gem/Carbo/PARP Jollymom tyra"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Feb 22, 2010 10:49AM nmiller wrote: Cheers to you for enduring 2 years of this ride.   It is always a bumpy ride.  You seem to handle things with such a great outlook - I knew I loved you from the moment I read your \"monkey\" story.  I have a great feeling that you have many more cancerverseries in front of you and I hope you can take some time to celebrate YOU today :)",
      "MessageIndex": 1,
      "PostDate": "22/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748740",
      "Title": "2 year cancerversery and what a ride heatherpalmerton LuAnnH"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jan 14, 2010 12:37PM nmiller wrote: konakat, I am so sorry about your recent scans!!  Definitely sending big hugs your way.  I am currently on a T-DM1 (super-herceptin) trial and after 2 scans, things look a little better (another set of scans set for next Friday and praying they come back looking good as well!).  I hope your onc gets your tissue samples and that you can get started on the trial ASAP!  I think a little friendly pestering might be in order to get things moving!  But for tonight, definitely take some time for yourself.  We should all be better about doing that when we need to! You will be in my prayers!!  Feel free to PM me if you have any specific questions about T-DM1.",
      "MessageIndex": 16,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jun 1, 2010 09:07AM nmiller wrote: Congratulations!!  I love that you are celebrating 6 1/2 years - we all need all the success stories we can get!  I think we should all celebrate every \"mini\" milestone :).  I am coming up on my 3 year cancerversary on the 26th and pray that I am around and feeling as well as you are 3 1/2 years from now!!  Enjoy your celebration and you treatment break - you deserve it!!",
      "MessageIndex": 2,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753428",
      "Title": "Six and a Half Year Cancerversary... RobinWendy Anne45"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Dec 28, 2009 04:43PM nmiller wrote: Hi Nicole, I am 29 with lung mets as well.  I was diagnosed at 26 - stage IV from the beginning (initially with mets to the mediastinal nodes).  I agree with everyone else that waiting for scans is incredibly nerve racking.  Even after over 2 1/2 years of living with scans, the waiting never seems to get much easier.  I have found that I feel better once I know the news - good or bad (but of course I feel MUCH better when the news is good :)) - something about the unknown is just the worst. I am glad you have found this board.  I just joined a few months ago and have found it incredibly helpful.  I know there are (luckily) not too many of us Stage IV girls in their 20's - one of the reasons I love this board is being able to connect with other women going through the same issues.  If you ever have any questions or want to talk, please feel free to PM me.  All my best, Neil",
      "MessageIndex": 8,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745866",
      "Title": "29 stage IV IBC in treatment Nicolethomas Nicolethomas"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Apr 26, 2010 02:55PM nmiller wrote: Sorry to be late responding.  I had treatment last Tuesday and spent much of the rest of the week sleeping :).  I have lymphangitic lung spread - confirmed by a bronch, which appears as \"ground glass\" on my CT scans.  But \"ground glass\" can really be caused by many things...infection, scarring from rads, damage to the lungs from chemo, old bronchcitis or pneumonia, even allergies.  It is very hard to track the level of cancer in your lungs because the ground glass can be due to so many things. In my current trial, my oncologists track a hilar and window node (both outside my lungs) for purposes of the trial - it is a little bit of a game since they are really normal size now, but still considered my only \"measurable disease\" because you can't really measure cancer that shows up as \"ground glass\". My radiologists last summer thought my ground glass was due to damage from chemo, but they were unfortunately wrong.  But don't let my story get you down...most of the time the radiologists are right about these things.  As far as what to do to help you sleep at night, I have tried almost everything.  Recently my oncologists put me on liquid morphine (even though I have no pain) which has helped more than anything.  I just take .25 mL in juice at night.  I know it sounds crazy, but it has made nights SO much better!  Please feel free to PM me if you have any questions.  All my best!",
      "MessageIndex": 8,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751740",
      "Title": "Lymphangitic lung spread cwrightrn joju"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jun 27, 2010 10:22PM nmiller wrote: Wishing you all the best as you start your radiation tomorrow!!  I hope the travel is easy and that you get to enjoy lots of wonderful rest throughout!!",
      "MessageIndex": 24,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754574",
      "Title": "Radiation starting Monday dreamwriter ChocolateLover"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Oct 29, 2009 03:39PM nmiller wrote: 26 Stage IV from the beginning with mets in the mediastinal nodes.  No family history and never missed a regular checkup with my gyn.  Such a strange disease and we are ALL too young for this!!",
      "MessageIndex": 307,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jan 26, 2010 06:25AM nmiller wrote: AMAZING news!!!!!  So excited for you!  Hope you are celebrating :)",
      "MessageIndex": 21,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747310",
      "Title": "Some Good News Kim_888 bourscheid"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 8, 2010 01:04AM nmiller wrote: I am also on Tykerb and my face looks like a 12 year old's...ughh.  My onc also presnscribed Clindamycin which has helped a little and I am on Proactive (which I am not convinced has done much of anything).  My onc said there were other stronger things we could try if the Clindamycin doesn't work (she mentioned that there might be an oral pill I could try).  She also said that the acne normally just \"burns itself out\" and goes away eventually - I am REALLY looking forward to that happening :).",
      "MessageIndex": 4,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755014",
      "Title": "Tykerb acne.. Fitztwins tooyoungtohavebc"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Dec 14, 2009 01:20PM nmiller wrote: I participated on a trial of RAD001 up in Boston from April through September.  The trial I was on was looking at the effectiveness of RAD001 + Herceptin.  As I understand it, RAD001 is an mTOR  inhibitor...mTOR is part of the cell growth pathway, and so the RAD001 is supposed to help block cell growth.  I took RAD001 as a daily pill.  Side effects included low platelets (causing me to have to stop the pill generally for a week out of the three week cycle) and slightly lower white cell counts.  However, the biggest side effect for me was really bad mouth sores.  When I initially began the treatment, I got 15-20 mouth sores at one time (no fun and impossible to eat).  My oncologist then cut my dose in half which helped a lot.  I still got the sores, but not as many at one time and I was able to control the pain pretty well with the Kanka soft wand (which you can find at any drug store). I stopped RAD001 in September after a brohncoscopy confirmed lung mets (which may have actually been there all along).   My oncologist said that he thought I definitely got some benefit from the RAD001 and at some point we will probably try another cell pathway inhibitor.  For now though, I am on a trial of TDM1 and Pertuzamab.  The first set of scans showed improvement and I had my second set of scans on Friday - I get results tomorrow - we are praying they are good!  Good luck with the RAD001!  I pray that it is the magic bullet for you!",
      "MessageIndex": 1,
      "PostDate": "14/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745368",
      "Title": "Qnyone taken Everolimus aka Afinitor aka RAD001 MJLToday Frapp"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Feb 11, 2010 12:07PM nmiller wrote: So glad you are starting the trial!!!!  I pray that it will go after every last one of those pesky cancer cells :) And as far as the port goes, I LOVE mine (it is a power port).  I have had it since my diagnosis 2 1/2 years ago and it has worked beautifully.  Hoping you will have as good of an experience!! All my best!",
      "MessageIndex": 22,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748172",
      "Title": "My oncology nurse (bragging) Fitztwins bourscheid"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 20, 2010 02:31AM nmiller wrote: If you need a quick fix before brushing or eating (or really I just it ALL day long when my mouth was covered in sores on my RAD001 trial), try the Kanka Soft Brush (I called it the Kanka wand for some reason...maybe b/c it was like magic for me!).  I literally bought out every drug store in my city and then my sister bought them for me by the dozens in NYC.  It is just a wand that you click from the end to make numbing medicine come out and then you can spread that on the sensitive areas.  It is nice because it is small and fits in a pocket or a purse and you don't ever have to get anything on your hands while using it.  It really was a Godsend for me (when I had been resorting to holding big ice packs to my cheeks!).  It says to only use 4 times a day or something like that, but my onc said I could use it as often as I wanted - which meant going through at least a wand a day.  If you want to see a picture....http://www.amazon.com/dp/B000M2JW50/ref=asc_df_B000M2JW501181562?smid=A1FRT2DFB93P69&tag=shopzilla_mp_1030-20&linkCode=asn&creative=395105&creativeASIN=B000M2JW50",
      "MessageIndex": 8,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755545",
      "Title": "ouch, my mouth hurts! stephanief tooyoungtohavebc"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 21, 2010 02:33PM nmiller wrote: What AMAZING news!!!!!   Thank you SOOOOOO much for sharing!!!!  Definitely a cause for celebration :)",
      "MessageIndex": 16,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755649",
      "Title": "Brain scan says.... DARLENEDENISE katie11"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 25, 2010 03:51AM nmiller wrote: I have been on Xeloda (with Tykerb) for a few months now and it has been incredibly easy to handle.  I sleep in socks and gloves with bag balm on and haven't had any problem with hand/foot syndrome yet.  I started at a low dosage (1000 mg in the am and 500 at night) and we have been slowly moving it up b/c I have been lucky enough not to have side effects.  I go two weeks on, one week off, and when I start my new cycle on Tuesday, I will start the max dosage I think I am allowed to take which is 1500 mg in the am and 1500 mg in the pm.  I have scans on Thursday, so we will find out soon if it is working....hope so!!!  Please feel free to pm me if you have any other questions! Good luck with everything!  Sending prayers and all my best healing vibes your way!!",
      "MessageIndex": 11,
      "PostDate": "25/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755746",
      "Title": "New to Discussions dejam dejam"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Nov 5, 2009 09:02AM nmiller wrote: I am so sorry to hear your news!  Maybe you can ask about getting in a trial of neratnib?  It is in the same family as tykerb, but a lot of people think it will work a lot better.  I don't think there are a ton of trials open yet, but it may be worth asking.  I was also on a trial of RAD001 and Herceptin, which worked for about 6 months and is fairly easy to tolerate.  I know you will find something great for you, I just hate that you are having to go through all of this stress!!  ",
      "MessageIndex": 13,
      "PostDate": "05/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743232",
      "Title": "Well I am out of the clinical trial..progression tooyoungtohavebc tooyoungtohavebc"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 4, 2010 08:36PM nmiller wrote: CONGRATULATIONS!!!!  I hope you are having an AMAZING time celebrating - you deserve it!!!  Thank you for sharing such amazing news with everyone - you have made my night :).",
      "MessageIndex": 8,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754916",
      "Title": "4 year Cancerversary LuAnnH heatherpalmerton"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 19, 2010 11:46AM nmiller wrote: Congrats, congrats, congrats!!!!! AMAZING news!",
      "MessageIndex": 12,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755547",
      "Title": "Results!!!!!!! chrissyb konakat"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jan 10, 2010 06:17PM nmiller wrote: I second sunflowes!  Robin, I am so happy for you that you are in Dr. Winer's care - I trust him completely.  I also see him (although right now I am on a trial at UNC) and it doesn't surprise me in the least that he would spend his Saturday morning talking to you.  I also agree with sunflowers that so many doctors at Dana Farber are just amazing people, in addition to being at the top of their field.  In addition to Dr. Winer, I also see Dr. Freedman, who is just amazing, too.  She was Dr. Winer's fellow when I began seeing him and when she became an attending at Dana Farber in her own right, they allowed me to continue to see both of them since I valued both of them so much.  The time that Dr. Winer and Dr. Freedman spend with me always amazes me.  Not only do they spend time discussing every symptom and letting me know about available treatments and treatments coming out shortly (which REALLY helps my anxiety!), but they also spend time asking me about my family and even giving me restaurant suggestions for my trips to Boston.  Their care truly makes me feel as if they care about me as a person rather than just as a case #.  I will be eternallly grateful to have them in my life.  I hope everyone has had a wonderful weekend!  All my best. xoxox ",
      "MessageIndex": 19,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746519",
      "Title": "Spoke to Dr. Winer about next steps RobinWendy Reneepals"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 21, 2010 09:16AM nmiller wrote: Just wanted to say hi from one \"nmiller\" to another.  I am not triple-neg, but I can relate to you as I was also diagnosed as Stage IV at an early age (at 26 - a little over three years ago - making me the only one of my friends who is SO excited about turning 30 soon!!).  One thing I have learned is that every chemo is not the same and some won't leave you feeling bad at all so you really won't mind being on those long term (you will actually be glad to squeeze as much use out of them as you can :)).  I have also heard AMAZING things about the PARP trials.  You may want to ask your onc if there is a trial near you. It sounds like you are starting out on a fantastic path on this journey (although I know you must never have wanted to be here at all!).  Please feel to PM if you have questions or ever want to chat.",
      "MessageIndex": 11,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755619",
      "Title": "New, need advice... nmiller1978 nmiller1978"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Mar 2, 2010 11:06AM nmiller wrote: Judi, I am so sorry and can emphathize with how crazy you can start to feel when you just can't get any sleep.  My sleeping problem was a little different than your's (cough from the darn lung mets keeping me up) - but I was definitely feeling overwhelmed like you.  Regular sleeping aids don't work for me (apparantly my doctor says they have the opposite affect on me - I have such a wierd body!), so he prescribed Valium - first in a 5mg dose, which really didn't do much, then up to 10 mg.  The sleeping still isn't perfect, but I am now getting enough sleep that I feel like I can function like a relatively normal person during the day.  CALL YOUR ONC immediatly and ask for something to help you.  Trouble sleeping is a symptom they should be able to control and I really think our bodies need sleep, both to keep us from going insane and to help keep us strong to fight off this darn disease.  I pray for many restful nights of sleep in your future!!  All my best!",
      "MessageIndex": 10,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749166",
      "Title": "TIRED! TIRED! FLIPPING NEEDHELP JustJudi cmhartley"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jul 4, 2010 08:43PM nmiller wrote: Dreamwriter...sending you lots of prayers, cyber hugs and all my best healing vibes!!!  Hope you are feeling MUCH better VERY soon!!",
      "MessageIndex": 35,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754909",
      "Title": "Send Happy Thoughts to Dreamwriter. LivingIt Frapp"
    },
    {
      "AuthorID": "nmiller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91161/profile",
      "Content": "Jun 16, 2010 04:32PM nmiller wrote: Wow...I have never heard of a trial that makes you stop taking the drug if it is working.  All the trials I have been on (even Phase 1) have said that the trial lasts for a certain period of time (maybe 9 months or a year) and then if the drug is still effective at the end of that time, the patient and the doctor can decide that the patient continue on the drug even though not technically in the trial.  I actually asked this exact question of a research assistant assigned to my trial recently and she said that no trial should ever make you stop taking the drug if it is working (as long as the side effects aren't harmful to you).  I would really fight if they try to make you stop taking the drug...it is often hard to find a drug that works and you DEFINITELY should not have to stop taking something that works so well for you!!  I hope this is cleared up very soon for you.  You certainly don't deserve to have to stress over this on top of everything else!!",
      "MessageIndex": 3,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754206",
      "Title": "Trial dropped from Phase 3 to Phase 2?? vickib rkt"
    }
  ]
}