{
  "AuthorID": "NMM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130872/profile",
  "Posts": [
    {
      "AuthorID": "NMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130872/profile",
      "Content": "NMM wrote: Hello By way of indroduction I am active on this other thread here community.breastcancer.org/for... My wife is stage 4 mets to liver with a failure of first gemzar/taxol and then a/c to stop progression. So it is Xeloda starting in the next two weeks. I know there is the \"all abot xeloda\" thread but at nearly 40 pages it has a lot of information regarding a lot of topics and some thread drift as well. I would like to start a thread or sub thread if you will that is focused soley on discusing Xeloda Side effects and what you do to make them more bearable. Discuss what side effects you had, how they bothered you and what you found to be helpful to make it better or at least bearable. Feel free to dicuss mediction that helped, over the counter products, and even things that some would call wacky. If you purchased products feel free to link to them or at least describe in detail so it is easy to find. Also detail how you used something if there was a process of trail and error. Thank you Steven Dx 6/3/2011, IDC, 2cm, Stage IV, Grade 3, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779595",
      "Title": "Xeloda - Your Side Effects and What You Do To Alleviate Them NMM lsacrowe"
    },
    {
      "AuthorID": "NMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130872/profile",
      "Content": "Dec 15, 2011 03:40PM NMM wrote: Scut:  Thanks.  App:  Thank you.  I forwarded your post to my wife.",
      "MessageIndex": 3,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779595",
      "Title": "Xeloda - Your Side Effects and What You Do To Alleviate Them NMM lsacrowe"
    }
  ]
}