{
  "AuthorID": "nnguyenw",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285911/profile",
  "Posts": [
    {
      "AuthorID": "nnguyenw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285911/profile",
      "Content": "nnguyenw wrote: hello, I posted previously and said I'd scheduled an appointment with my doctor due to a large breast lump and pain. The doctor did a mammogram and an ultrasound and said that the oval lump and thickness was most likely benign and requested a recheck at the end of April. My breast tenderness has increased the last few days but I assumed it was due to ovulation. Today I took a good look at the affected breast and there's pronounced redness near the nipple (the mass is just below the nipple) and I think that there's dimpling of the skin near the nipple too. The nipple isn't flat but the skin aerolais definitely different then the other breast. So, needless to say I'm freaking out all over again. Thanks for listening. I'm going crazy and it feels better to be tying this and getting it out. I appreciate you all! N. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870430",
      "Title": "IBC Worry and Panic nnguyenw nnguyenw"
    },
    {
      "AuthorID": "nnguyenw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285911/profile",
      "Content": "Mar 18, 2019 04:04PM - edited Mar 18, 2019 04:05PM by nnguyenw I went back today and she wasn’t happy with how it looked. I'm back tomorrow for another mammogram and ultrasound. I'm going to push hard for a biopsy too. I'm so scared given all of my symptoms and everything I've read about IBC.",
      "MessageIndex": 2,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870430",
      "Title": "IBC Worry and Panic nnguyenw nnguyenw"
    }
  ]
}