{
  "AuthorID": "Nocompromis…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
  "Posts": [
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 14, 2013 01:38AM Nocompromises2013 wrote: what a relief for you. I have my first follow up with BS since July booked for January. Yikes !!!",
      "MessageIndex": 1902,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 14, 2013 01:09PM Nocompromises2013 wrote: hi Headeast Pretty much heading to 2 months on it Only side effect of note was the 2lb a week weight loss for the first 6 weeks or so Hot flushes brought on by chemo pause ?? Still playing golf and have dropped 8 strokes of my handicap since chemo finished :))) And an enebriated spouse who tells me I am an amputee who needs him more than he needs me and I am an ugly mess as no guy wants one boob !!! Lovely !!!! Soooo good for my self esteem Anyone else had acceptance issues from their partners ???",
      "MessageIndex": 1908,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 14, 2013 04:12PM Nocompromises2013 wrote: fur friend - he took himself off upstairs to sleep. I am wide awake downstairs and can't sleep for worry now Maybe an apology will be forth coming in the cold light of day - I haven't sleptva wink with worry - he is my everything - but he was pretty heartless and verbally aggressive about how he felt last night - is it better to verbal use his feelings and get it all off his chest. IDK but he does like to be the victim !!!",
      "MessageIndex": 1914,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Feb 20, 2014 05:58PM Nocompromises2013 wrote: hi roareous  An elevated alp is quite normal after chemo .... 144 is in the right region   - that's why they monitor your LFTs.  My alt started as about 270 ( too much alcohol !!!!!!!). I ceased drinking and during chemo my alt actually fell !! So chemo is less toxic than alcohol for the liver ??? !!!!!!!! Congrats Mercedes for finishing - feels great doesn't it :))))",
      "MessageIndex": 2089,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Sep 21, 2013 07:26PM Nocompromises2013 wrote: Hi marnie I honestly believe for me the very worst part of my whole journey so far was getting my CT and bone scans done and then waiting for the results I felt like my whole future was being offered up to me in a crystal ball I didn't want to read Suffice to say thankfully both scans came back -ve ..... Initial scans they told me usually are -ve ( dunno if that's really a good or bed comment actually :))) ) I just hope and pray we never need to go back for any follow up ones I guess Just make sure you get those margins sorted ... Since you were multi focal ....Are they thinking Mx now? I think they should be !! Good luck with your scans try and not worry too much. ((Hugs ))",
      "MessageIndex": 1777,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Oct 20, 2013 04:28AM Nocompromises2013 wrote: hi Isis - I am so sorry for you .....after 14 years I would have thought you were home and hosed too I would be considering that a new primary rather than a secondary is that what they have said ? I had my last TC x 4 on sept 13th and yes symptoms pretty much as you described ( except the depression ) especially on day 4,5 and to a degree day 6. Also found I was a bit achy day 7 post neulasta although I actually never took any claratin or pain killers at any stage for the symotoms so they can't have felt that bad to me. Just yucky taste buds and sore/burnt mouth I hope you have an easy time of chemo and later on I suspect they might restart AI or give you tamoxifen ?? Recommended for 10 years now not the 5 that you originally did on AI Best wishes Sue :)",
      "MessageIndex": 1791,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jan 18, 2014 11:00PM Nocompromises2013 wrote: I found a lump in the back of my neck DH said it was a hair follicle cyst - but I can't see it  Showed a Dr friend and she said - don't worry yes, the ........ Is correct --- phew  Does get u worried thou - always best to get stuff checked in case ",
      "MessageIndex": 1994,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 14, 2013 03:35PM Nocompromises2013 wrote: I am sorry you both have self acceptance issues - I have tried to take the attitude it is what it is and we do what we have to do to get through it. But he can be a real A....hole at times. I guess tonight is one of those nights. :((((((",
      "MessageIndex": 1911,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 19, 2013 05:09AM Nocompromises2013 wrote: hi furfriend -hope the taxol still treating you kindly !!  Yes spouse is back in his box for now - thank you for asking - thank goodness :)) ",
      "MessageIndex": 1925,
      "PostDate": "19/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Apr 11, 2014 04:51AM Nocompromises2013 wrote: that is GREAT news springsoon - getting those good negative results just makes you feel sooooo positive and hopeful. I still remember the day we got a call to say all scans were clear.  It was a fri Arvo  and they wanted to let us know before the weekend ( I only had the CT scan that morning )  so we could get on and enjoy it - well done   I am sure chemo will be a breeze if you are healthy and positive. Good luck. :)) ",
      "MessageIndex": 2138,
      "PostDate": "11/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "May 5, 2014 08:32AM Nocompromises2013 wrote: yes you are correct Rosie. UMx and no MRI - I asked BS but he said they use it for Dx but mine was so obvious and multi focal that Mx was only option - I twice asked him about BMX and he said only 1% greater chance of contra lateral than anyone else !!  I am not interested in recon on only one side. Quite happy to wait a few years to make sure I don't have any other curve balls - my BS told me you have to be very determined that you want recon as it is a long process and I know I really don't care for it - too hard for an optional procedure in my book. But we are all different :)))  I am due a mammo in 2 weeks and I needed a chest X-ray for a suspected broken rib which was fortuitous as I got to have another peak at what is going on even if an X-ray might not be the best way to do it it's another piece in the jigsaw !!   An MRI would be added insurance to see what's going on I guess but what will be will be - good luck on your research - ",
      "MessageIndex": 2168,
      "PostDate": "05/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "May 29, 2014 08:10PM Nocompromises2013 wrote: hi Rosie  I had 1/13 nodes and mine was 10mm. Who knows if it caught it all we hope so !!... That's why they give you chemo to try and mop up any rogue cells that might have slipped thru.  We just have to hope it did it's job well. I saw my BS this week and asked him if 10mm was big and laughed (nicely) and said they can be as big as a tennis ball !!!  Really the only thing we know for sure is the more lymph nodes affected ( usually 4 or more) then the more likely chance of any metastatic  occurance  down the line  Also it's good to find out if the nodes came out easily with no extra capsular extension or were matted ( not a good thing). You mentioned clear node margins so sounds like at least it was all contained in the node  I asked my onc about vasolymphatic invasion and she explained that the breast tissue slides they analyse after Mx are really only a snapshot. Of time. I couldn't work out why I had a node w/o vasolymphatic invasion and the snapshot in time makes sense to me. It was there but moved to the node - if that makes sense?? ",
      "MessageIndex": 2175,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Feb 5, 2014 07:59AM Nocompromises2013 wrote: I had no evidence of LVI on my path report and the same report says I had a 10mm node - I don't understand that - happy as I am to have no supposed LVI I don't understand how you can have one without the other ?? ",
      "MessageIndex": 2056,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 17, 2013 06:32AM Nocompromises2013 wrote: hi cs13 Welcome to the site no one planned on joining ..... I am sorry you had to be here Wow 3cm node that's interesting .... I thought mine would have been fit to burst at 10mm I always wondered how big they could stretch ...anyone know ?? Try not to worry about the T. I have only been on tamoxifen for a month and have noticed nothing bad at all, yet ?? ( except maybe weightloss of about 1kg a week) hopefully I won't see any ever - but I try to view it as my new best friend Good luck with your chemo :)",
      "MessageIndex": 1821,
      "PostDate": "17/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 16, 2013 05:03AM Nocompromises2013 wrote: Wtf indeed Mercedes :))))) wow. Thank you ladies for being so open We have had a tumultuous 3 years ( been married 26) and the BC diagnosis just about topped it off !! Whilst not openly apologizing he certainly admitted the next morning he finds it very hard gracers, bdavis and furfriend. You are all so strong to face D and Ca !!! I agree that for me Ca would be far easy more me to deal with than separation or D Hugs to all xx-",
      "MessageIndex": 1921,
      "PostDate": "16/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 19, 2013 09:01PM Nocompromises2013 wrote: hi headeast  Yes, Still tracking very well with the tamoxifen - weightloss seems to have steadied so overall about 12lb loss (i am 5ft 8 and 150lb now)  My eyes get tired after a bit of reading but who  knows  if that's coincidence. Pretty painless so far - been  on it  2 months now and just started second bottle  ",
      "MessageIndex": 1928,
      "PostDate": "19/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Mar 27, 2014 05:07AM Nocompromises2013 wrote: Hi 2timer and springsoon - yes i too was extremely healthy prior to Dx. :(. Still am except for all the baggage tgat comes with Dx  Re LNs in breasts - if affected they do seem to indicate a more aggressive cancer from what i have read lymph nodes IN the breast usually referred to as intramammary nodes ..(IMLN)... An article i found on PubMed  CONCLUSIONS: IMLN metastases are a marker for disease severity; recognition of this may influence choice of adjuvant therapy. The presence of metastatic disease in an IMLN is associated with a high rate of axillary nodal involvement, and should mandate axillary dissection. Preoperative lymphoscintigraphy may help identify these extra-axillary metastases. 2timer - imlns are a marker for aggressive cancers but since your grade was 3 - you knew that anyway and at least your axillarys were clear ( YAY) and you have had double Mx plus chemo then i would think you have been as aggressive as you could be ",
      "MessageIndex": 2120,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "May 4, 2014 02:02AM Nocompromises2013 wrote: hi Mag  You are both   right - but in the context of that Q - no you do not seem have distant metastasies - yay !!!!! Placid is right ... You don't have metastasies in the true technical sense of the word. Ie distant part of body and set up its own tumour system, blood supply etc.  True It has somehow moved to a lymph node thru natural lymphatic drainage but hopefully it was/is just 'caught' there by your immune system and hasn't had a chance to get established further afield  do you know is it just one node or more- is it extra capsular?  or still contained ?  Hope that helps. ",
      "MessageIndex": 2166,
      "PostDate": "04/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 5, 2013 01:42AM Nocompromises2013 wrote: Hi Ladies Australia calling... well saw my onc today and she has put me on TC 4 cycles = 12 weeks. I start  on July 11th ..yikes...Portland Lady we must be twins .. hope you are right about it being gentle on me but TOUGH on any lurking C cells !!! ..i will be thinking of you :)  no  port since only 4 sessions.. (only 4 says me... i had figured it would be 6).   Rambo50...we also have that Looking good, Feeling Better here in AUS  and i am going to that tomorrow. Good luck to everybody on this thread.. i am loosing track of so many names... NC x",
      "MessageIndex": 90,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 13, 2013 06:09PM Nocompromises2013 wrote: Don't worry patty smiles. There are no clippers going near my hair unless I am certain it has gone beyond the point of no return. The date is pencilled in but definately changeable. The wig shop ladies are all hairdressers and will shave your hair free when/ if you buy a wig. Yes wigs expensive the one I liked ( Reece in chilli red) was $330 I don't think anyone can really know imagine what they will feel most comfortable with Sounds like maybe you were luckier than some with your degree of hair loss ?? Day 4 TC. No symptoms yet and bowels happy again :))",
      "MessageIndex": 286,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 15, 2013 10:23PM Nocompromises2013 wrote: Hi jerigrace They recommend you take someone to first chemo incase you react ( unlikely). But from my experience so far days 4 and 5 are probably the most tiring .( and not even so at that - I have been SO pleasantly surprised). I feel like a bit of an imposter compared to my image of this chemo would turn out .. Maybe even save the offers of help until the second or third cycle as the fatigue possibly accumulates?? But everyone is different and just having moral support with you at home is huge i guess too Hope it all goes smoothly for you",
      "MessageIndex": 327,
      "PostDate": "15/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 20, 2013 09:46AM - edited Jul 20, 2013 09:49AM by Nocompromises2013 Day # 10 The only thing giving me a lopsided moon face is my wisdom tooth !!!! 😟 Can't even enjoy a good beef stew at present w/o chopping it up into baby bite size pieces :( Still swollen , still on amoxil , paracetamol and Celebrex but still here :)) Rambo you crack me up .. Yes yes I promise I will stop whinging and pull up my big girls panties 😏",
      "MessageIndex": 447,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 21, 2013 12:07AM Nocompromises2013 wrote: Hi Ladies Did you know we are now almost 60 of us on this thread? How scary is that, and scarier still all those poor women out there without the benefit of this sisterhood So we have some second rounders coming up this week. Wow how time moves on Any thoughts on the logic behind onc's choosing AC+T. Versus TC. Is it geographical ?, experience, ? ? Tumour type/aggressiveness? , luck of the drawer? Pretty sure I read somewhere they give pretty similar results? Thanks sweetheatinTX ...unfortunately tooth still being a pain but if I stop moving, talking and eating I can't feel it :))) if it wasn't for the tooth I reckon I would face got off pretty lightly , better not flare up for every cycle Xx",
      "MessageIndex": 466,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 26, 2013 06:48AM Nocompromises2013 wrote: Rambo. I just had my hair cut to a no 4. Today And bought a wig and a couple of pieces of headgear Good luck with your cutting today :)",
      "MessageIndex": 599,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 3, 2013 02:01PM Nocompromises2013 wrote: Lark Yes Clarinase in AUS is same as Claritin-D. In USA Also be aware those suffering from blurred vision. This can be a side effect of both Claritin and Claritin-D Just a thought :)",
      "MessageIndex": 835,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 5, 2013 07:58AM Nocompromises2013 wrote: Day 4. Cycle 2 for me Zero energy achy and totally washed out. :( at least no N &V Roll on day 5 Rambo hope you went well at work today :)",
      "MessageIndex": 856,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 5, 2013 07:03PM - edited Aug 5, 2013 07:04PM by Nocompromises2013",
      "MessageIndex": 865,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 13, 2013 04:33AM Nocompromises2013 wrote: Thought I would add my 2c on the scans debate I was given both a bone scan and a CT scan whilst in hospital the 2 days after my Mx. June 20th and 21st Bone scan on day 1 post Mx And the CT scan on day 2. Then they discharged me ( was only in Hosp 2 nights ) I got given the all clear for both scans about 4 hours after I had had them PHEW. Never been so scared in my life waiting for the results anything else coyld have been there ....Felt like I was looking down the barrel of a gun. But obviously relieved they are over now They told me it is rare to see any mets At initial bone scans -oh great so they see them on the second or third ones??? Then I hope they never recall me for another scan :))))) Hugs to all and good luck all you round3 ACers.",
      "MessageIndex": 991,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 14, 2013 05:48AM Nocompromises2013 wrote: RC - how have you found the TEs ??pain etc I am soooo. undecided what to do if anything after a UMx .... Very tempted to do nothing, otherwise reckon I will always be lop-sided",
      "MessageIndex": 1009,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 21, 2013 06:39AM Nocompromises2013 wrote: Hi Ladies Lark - I understand you needing to put it out there.and happy belated birthday :) I was really down on Monday stressing over my cellulitis and whether it would delay me getting #3 TC tmrw that knocks onto TC4 and then I would be unable to travel to UK and catch up with my mum. ( sorry momx2) as I haven't seen her for 6 years and the trip was booked way b4 BC crept up on me and if I postpone then daughters final high school year begins .... So out of the blue I just burst into tears at work and was pretty weepy all day REALLY unusual. Haven't cried much at all these last 2 -3 months. Probably needed too - felt dumb afterward but everyone was so supportive at work which was nice. So i had blood work today and hopefully #3 tmrw - then ONE TC left woohoo Good luck Hanna, lark and honeybunny on your last red devil - we don't get colorful toxins on TC regime - I almost feel jealous - I said almost !!!! :)",
      "MessageIndex": 1123,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 22, 2013 08:54AM Nocompromises2013 wrote: Thanks Shary. I will treasure my 3 stars. - we all earn them :) Xx",
      "MessageIndex": 1141,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 26, 2013 11:29PM Nocompromises2013 wrote: Soriya I am taking vit D and also B6 100mg to help stop neuropathy Day 6 and coming out of the blah !! TC#3 definately hit harder than #1 and #2. Roll on #4 then I am DONE !!! I admire all u AC +T ladies - fortnightly must be grueling plus all your weeklies afterward .... Congrats to all those nearly finishing with the red devil YAY. and good luck with your first taxols - Zimmy - hard decisions. Have you thought about Rads to mop anything up instead of the risk of neuropathy ? We don't do oncotypeDX here ( well my onc doesn't) - I have only the very minorest of tingling. But definately more so after #3 so it probably would get worse for you and it is the only Q my onc asks me - about neuropathy so they would be very concerned -",
      "MessageIndex": 1216,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 15, 2013 05:59AM Nocompromises2013 wrote: soriya I had RMx and ALND. And minimal pain but I admit IF (and it is highly unlikely) I go for recon it is the TEs that worry the C..... Out of me I got fitted with a prosthesis after Mx and now 5mo down the track I have lost 5kg (11lbs). So now it's slightly too big compared to my left boob !! The woes of life :))))",
      "MessageIndex": 1694,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 27, 2013 04:00PM Nocompromises2013 wrote: soriya - so glad the mass came back benign. Great news. Good luck with your Mx - you will be fine Lark - 6 weeks on T and still no side effects apart from the weightloss. I do still have the occasional hot flushes ( once or twice a day) they started in chemo. But they are just an inconvenience really... And when I get out of bed in the morning my feet ( well heels ) are a bit sore for 2-3 steps - bit of a hobble there.then they are fine Who knows where that's come from. Cos again I think it could be a throw back to chemo ?? I have nearly finished my first T bottle only another 59 bottles of 60 tabs to go. Haha.",
      "MessageIndex": 1751,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jan 9, 2014 04:23PM Nocompromises2013 wrote: good to hear from u lark ... I am 4 months post chemo and have been on Tamoxifen for 3 months  My hair is now a good inch all over - my FiL and MiL reckon it looks very 'trendy' others have said chic and Parisian !!  I have always avoided a pixie cut due to my big nose but I am pleasantly surprised - I am no Jamie-Lee either :)))   I haven't had it cut or styled yet but yesterday someone asked me if I had as they reckoned it looked styled - yay  No peach fuzz but definate normal facial hair plus the occasional gate crashing stubbly ones on the jaw line grrrr I do have some aches and pains mobilizing out of bed or when getting up from sitting that is def more than b4 and I reckon it is the Tamoxifen but more than manageable - wears off after a few steps  Still playing golf and gave dropped 9 strokes in 9 weeks ( can almost claim to be a proper golfer now :))))  Hugs to all - maybe see you all on some other threads xx",
      "MessageIndex": 1905,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Feb 3, 2014 03:41PM Nocompromises2013 wrote: hi Rambo  Nice pics ;). My hair is nearly 16weejs down the track and I nearly need a trim !! - every time I see people they say gosh your hair has grown - it's probably inch and a half and I nearly have a fringe ( albeit a VERY short one  T going well and BS pleased I see onc in April and due a mammo May then I cannot believe it will have been a year since Dx !!!  Hugs to you and bluestars - hope all keeps going well xxx",
      "MessageIndex": 1926,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Feb 6, 2014 03:44PM Nocompromises2013 wrote: Hi LanaB  Anyone who is keen to join our fb group Pls Pm me your  email address  and fb details - I couldn't find the group either when I searched using my Hs  fb - I'm still learning about fb groups :)) - but I can def add you in  :)",
      "MessageIndex": 1942,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 10, 2013 08:11AM Nocompromises2013 wrote: Hi Michelle69 I too start chemo tmrw Took my dexamethasone tonight. So far no ill effects. We went out for a meal to celebrate my last day of normal taste buds !! Willykers ..I am on TC x4. seems to be a standard protocol in AUS due to adriamycin SEs with heart etc Have stocked up on Emla patches to numb hand prior to cannula Hope my vein holds up. Port was never a choice given to me How did you go today Hannariggs and sweetheart?? NC x",
      "MessageIndex": 206,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 13, 2013 09:46AM Nocompromises2013 wrote: Peace. I went to try wigs on a week after Mx. I left the store in tears I revisited yesterday and was stronger. When I go back there in 2-3 weeks I will be ready. Wig is already chosen but not purchased You will be stronger too and don't forget maybe get some variety mix it up a bit . Wig one day , scarf the next ?? Who knows :) Clareinaz - thank you for your encouragement - u are confusing me jumping threads :) I look forward to paying it forward to future chemo cohorts too- just need to reach sept 13th yay.",
      "MessageIndex": 276,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 24, 2013 02:50AM Nocompromises2013 wrote: JeriG. Well done on giving yourself the neulasta shot ... If I need one am sure DH won't be lining up to give it to me. Have friends who r nurses/drs. So maybe I will enlist their help Had a little clump of hair come out in the shower this morning. Nothing mega bad. But def more than usual. Yep you guessed it. Day 14 Welcome (???) vilia and reality check ( love your name)",
      "MessageIndex": 530,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 25, 2013 12:00AM Nocompromises2013 wrote: Biker girl I am TC x 4. July 11th Traveling REALLY well ... Day 14 today. Played golf on days 2,9 and 12, planing to play again day 15 and day 19. Then fri sign 2nd is round 2. Not much shedding of hair (except a few pubes!!!). Hope all went well for you today. I had mild fatigue days 4 and 5 And mega toothache from day7 to 13 unrelated ???? But today it is only 1/10 on the pain Scale so I am a very happy bunny My best advice is too keep busy and active What bike ? I have a HD 883 :) NC x",
      "MessageIndex": 571,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 30, 2013 05:33AM Nocompromises2013 wrote: HVV I am a pharmacist 1. Emend 80mg are supposed to be taken on day 2 and 3 of chemo Usually a 125mg tablet should be given on day 1 OR 115mg prior to chemo by I/V - which they would more likely do 2. Prochlorperazine is given to you to use as needed for breakthrough nausea that the emend fails to mask, USE it if nausea lasts longer than a couple of minutes 3. Yes ondansetron is zofran an excellent anti emetic. Swelling is not listed as a side effect in my AMH reference book 4. Dexamethasone is decadron. It is used usually day b4, day of, also I/V on chemo day and for day 2. Usually to counteract allergies to chemo drugs ( suppresses bodys response ) and also as anti nausea also Steroids usually cause water retention when used for LONG periods ( months ) Usually moon faces etc. use for 2-4 days should not cause water retention or swelling there are other steroids such as fludrocortisone or prednisolone which would have stronger effects. Hope this helps. NC.",
      "MessageIndex": 699,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 1, 2013 12:39AM Nocompromises2013 wrote: Hi ladies Can't wait for #2. Tmrw ..Bring it on JeriG. My Samson effect started on the steroids ( yeah yeah. I know they were only corticosteroids but I can dream ). My drives have been really long. Or maybe I could claim the my right boob was a hinderence as now i can get a full swing right through. Hehe. ( no it wasn't THAT big :)))). Seriously though reckon it has been great for lymph node recovery really stretches those tight muscles on sides and under arms. Best way to try and avoid LE IMHO. Never mind AUG we will always be July firecrackers. - Into cyber infinity and beyond. Have a geat day firecrackers",
      "MessageIndex": 752,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 1, 2013 01:47PM Nocompromises2013 wrote: Welcome karkar Sorry to hear about your hand foot and mouth - not pleasant :( Hope your wig 'grows on you '. And you can feel more beautiful very quickly Wow a real Chinese firecracker to add to our eclectic group. ;)",
      "MessageIndex": 766,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 5, 2013 07:01PM - edited Aug 5, 2013 07:03PM by Nocompromises2013",
      "MessageIndex": 864,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 9, 2013 04:55AM - edited Aug 9, 2013 04:56AM by Nocompromises2013 Hi Ladies Day 8 -cycle 2 Neulasta jab seems to have passed fairly uneventfully -yay Have worked about 15hrs this week and managed to get out and hit some golf balls today and did manage 18 very tired holes :( Dont laugh- I ordered some CBS 'survivor' buffs and they arrived yesterday ..... Sooo comfortable ( not cheap). And got some cool comments on them today from a complete stranger today. Don't like the survivor connotation this early in the piece but bought them cos I love the show. And we can all Outwit, Outlast and Outplay this 'C' card Also have bought a Speedo swim costume specially made for Mx with sexy zip up the front ( although DH turned and said - well that's not really the same anymore is it ???? Cheeky insensitive bogan !! Anyone else got a bumpy, itchy scalp at nape of neck ?? And I am sure I have stubble back where I shaved my head !!!!! ?????? Stay strong ladies NC x",
      "MessageIndex": 920,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 11, 2013 01:50AM Nocompromises2013 wrote: Gma04 ... JeriG and patti have nailed the advice for you I had the neulasta shot for round 2 and was anxious after hearing all about bone pain on this forum. I decided to take nothing and see what happened .... I read the literature and it only supposedly happens in 25% of patients. And even then as Rambo has demonstrated the second time round the pain ( if you even get it first time) isn't nearly as bad ( if at all) I had a few weird sensations in thighs and lower back on 5th day after the jab - wouldn't call it pain but felt like my skeleton didn't fit together properly for a few hours - went to bed and next day it was gone :) I will look forward to having the jab for round 3 and 4. Cos the benefits for me definitely outweigh any potential bone pain Patty. Usabuff are 6 SIX !!!! Buffs lighter now !!!! Can't wait to get them Rambo I haven't put anything between buff and skull .... I have itchy times and non itchy times and was considering using the buff as my underwig lining or any heAdwear lining ... Does anyone find their wigs,or buffs make them shiver ??? Day 10 #2. and I felt so good I have spring cleaned ground floor of home !!!! Didn't feel mad enough to attack the kids rooms upstairs - those pig stys can stay - goodness knows what I might catch in those rooms :)))))))). NC x",
      "MessageIndex": 959,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 17, 2013 02:16AM Nocompromises2013 wrote: KTLe  - did you mean DH?  =Darling Husband sweetheart- I agree the TEs do throw a spanner in the works - i understand your reticence now a bit more..... my only comment  check out that 1-2% figure very thoroughly - 2hobbies and HVV speak volumes of sense. My MO initially told me radiation was a big ??? in my treatment plan until the pathology work was back post Mx and therefore he wasnt prepared to consider recon till we knew exactly what my plan for treatment was going to be precisely for the reasons you now outline....  now for me its no radiation -so  i now have options but initially i was so uninformed i would have done whatever he had told me to... i only had 24hrs from first appt to operation and had signed the admission forms within an hour of his recommendations- although i guess we knew in hearts what had to be so why delay.... i probably would have had TE put in if it was suggested ..... but now I feel very differently probably cos it means more operations and i am more informed and i feel comfortable at present - IDK - at the end of the day as with any of our decisions .....it is your body and your decision - and not an easy one .....  i do feel for you - not easy so this weekends dramas??,..... why is it always at a weekend??... i have managed to develop cellulitis on my MX site- great... about 10cm x 8cm..phoned onc and she put me on oral ABs and said if it gets worse overnight ring BS and consider i/v ABs - overnight it grew to about 10cm x 9.5cm.. rang him and he changed me from fluclox to clindamycin... i have no fever, no pain, but a big warm red area... anyone out there had similar?  initially i FREAKED out and self diagnosed Inflammatory BC... my onc and also a local GP (friend) both repeatedly have assured me it is infective and def. cellulitis -- hope that they are both correct - i am due #3 in 6 days hope it clears up a bit!!!!!!! why oh why cant life be simple?  sorry for the rant .......",
      "MessageIndex": 1062,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 20, 2013 08:39AM Nocompromises2013 wrote: Happy birthday Melissa from the land down under .. ......... Xxx",
      "MessageIndex": 1099,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 21, 2013 09:23AM - edited Aug 21, 2013 09:24AM by Nocompromises2013 Thnx angela and 2hobs. Well I think it has settled down. Doesn't seem angry and inflamed now just residual redness/brownish bordering on receding yellowish bruising. Just wide awake on steroids it's 11.20pm way past my beddybyezzz Night all big day awaits :(. Xx",
      "MessageIndex": 1126,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 24, 2013 01:45AM Nocompromises2013 wrote: 2bkuestars I had my uniMx first 6/19 and then chemo I had 2 drains initially, one was removed in Hosp after 2 days as it was only draining 30ml a day. The other was more like 80-90ml. The bottles are vacuumed gently so the fluid just sucks out along with a bit of gunk ! I lost suction on one ( too active) but I had a spare - make sure you get one and they gave me a bag to hide the drain in and I just tied that to my jean waist - when in shower I hooked the bag over the tap so I had a spare hand - just keep your wound covered and waterproof as best you can My 2nd drain came out day 10 You will be FINE I never felt a thing with either !!!! Sounds weird but its true I was told after Mx not to drive with drains in ( but I did about a week after Mx). I also had full ALND and played 18holes of golf three weeks post Mx - might have been different if I had had a Dbl Mx. Don't know The Mx isn't too bad and once out of theatre they only ever gave me Tylenol in Hosp Good luck when it happens - I am fast thinking there is a lot of negative stuff on forums and not enough positive posting to balance the books :))))) Day 3 post round 3 TC and no ill effects yet. Woo hoo.",
      "MessageIndex": 1171,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 29, 2013 02:09PM Nocompromises2013 wrote: Hi Ladies Anyone had swollen lymph nodes in their opposite arm pit? day 8 postround 3 i have developed 2 little swollen nodes in left armpit - any suggestions? slightly tender... nothing too sore Sue ",
      "MessageIndex": 1250,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Sep 12, 2013 03:05PM Nocompromises2013 wrote: Aaoaao Morning ... You are a b$&@/y inspiration - so strong !!! I am pretty positive usually so thank you you really made me smile this morning - you go girl 2 Hobbs. I feel I can see the finish line for chemo but just can't quite touch it - apprehensive like #1 all over again - who knows why Post more later Soriya, Angela, Hanna, Marsha, lark, HB, R50 ( as opposed to R2D2hehe), of course JeriG and anyone i have missed hope you are all feeling stronger- u all rock Xx",
      "MessageIndex": 1366,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Sep 13, 2013 02:33AM Nocompromises2013 wrote: Cherri what about plain old zinc oxide bappy rash cream to act as a barrier when you pee ?? DONE DONE DONE. All chemo Tx FINISHED. Yay. Yay and yay My son had his 18th yesterday so we celebrated late night Whilst sitting in the BGC at midday today I get a call from him. Where are you mum? Having chemo Ben where r u? I went 4WD and got bogged mum Can a mate go and get u out ? No mum all at work or TAFE So post chemo good old mum picks up his cousin and we drive 1hr out of Perth in DH work ute (OOPPs). To pull him out. Which they succeeded to do after about half an hr of digging, and jacking up etc great. Takes my mind of chemo hey !! Roll on day 7. :))))))",
      "MessageIndex": 1372,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Sep 13, 2013 07:38PM Nocompromises2013 wrote: Blue stars. - I would keep off the Ativan as much as poss. Sure if really anxious go for it. But your MO needs to be proactively trying to prophylactically treat your valid concerns re neuropathy, TN etc Remember Cancer doesn't usually hurt (in early stages at least ) because they are our own body cells I have def had some muscle stiffness around Mx area that I don't recall from the start and have put it down to cumulative chemo effects and chemo is far more effective on TN than other types Did you have Mx or lump? Will u have rads ? Good margins?? So glad you can see a flickery light That will only get brighter :))) Xx",
      "MessageIndex": 1383,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Oct 30, 2013 02:38PM Nocompromises2013 wrote: thank you ladies for your comments - I feel happier knowing I am not so alone I guess it is only 4 months. Due to see BS in January - don't really fancy Any extra surgery. Suspect it's been left for any future recon ( that I still think I don't want ) Ariom - my lands end bathers arrived. Roll on summer. I think that might make re reconsider recon - we will see. I hear too many stories of failed recons.",
      "MessageIndex": 5,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/813760",
      "Title": "Flabby bits? Nocompromises2013 Ariom"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 4, 2013 01:57PM Nocompromises2013 wrote: Ariom - sounds like you have found a great place to retire and yes very serendipitous with the mammo machine !!! paynesville sounds like Mandurah we have inland waterways and canals galore an hour south of Perth - love it My MIL must have had Mondors she described it just like you ( 35 years ago) and I couldn't figure out what she was on about as I never had that sensation at all Erica - interesting info thank you - Will consider angel wing removal down the track if it annoys me enough",
      "MessageIndex": 13,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/813760",
      "Title": "Flabby bits? Nocompromises2013 Ariom"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jun 30, 2013 01:38AM Nocompromises2013 wrote: G'day from AUS I am seeing my onc this Friday and will no doubt learn what toxic cocktail I have in store for the coming months Absolutely scared stiff re possible side effects. Great to have this support group Sue :)",
      "MessageIndex": 18,
      "PostDate": "30/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 15, 2013 01:22AM Nocompromises2013 wrote: Good to hear your updates day 5 for me (july11th) wyllikers ( we r same day) hope you get a bowel Motion soon dont leave it too long before using something stronger option I Entirely understand the weird mouth sensations, have u tried nilstat for mouth thrush ?? Keep posting ladies. :) right there with you.",
      "MessageIndex": 303,
      "PostDate": "15/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 18, 2013 07:19AM - edited Jul 18, 2013 02:49PM by Nocompromises2013 Soriya. I am sure I read dental floss is a no no So lets get to WBCs ladies. His many of you have had them checked pre and post chemo? I am day 8. Of thinking I got the placebo bag of poison but NO. Even though my SEs have been few. I found out today my WBCs have been DECIMATED. I went from a healthy 5.5 to a staggering 0.2. Have another test on Saturday then I guess onc decides if I need neulasta. Anyone else want to share their white cell counts ?? And any actions taken ?? :)",
      "MessageIndex": 383,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 19, 2013 04:16PM Nocompromises2013 wrote: Hi Ladies Well I wish I had had my partially erupted wisdom tooth out years ago now ..anniej76 . They say u r most likely to get infections from yourself . .. I popped into dentist today (day #9) .. After 18holes of golf :). Cos I was fed up with my gum swelling/pain ... Yay on top of everything and exactly at my WBC nadir aparently I have pericoronitis ( oh joy). I am on prophylactic amoxicillin and paracetamol to try and avoid a full blown infection. Thank goodness for the biotene and salt water washes or I reckon I would be in a much worse way I have a second WBC test tmrw ( was always planned) interesting to see if it has started to go up or whether my 0.2 has dropped to nothing Apart from that I feel fine and would never know I have no immune system. Scary what we don't know is going on in our own bodies. Roll on day #10 surely it is all up from here. Oh no wait a minute next week I get to loose my hair. Chemo is the gift that just keeps on giving ... Be worth it in the end though :))) Night all from the land of AUS. Xx",
      "MessageIndex": 423,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 21, 2013 04:23AM - edited Jul 21, 2013 04:25AM by Nocompromises2013 Jerigrace that's interesting. I always thought diabetes or heart disease would get me too Definitely never saw BC on the horizon I was relieved when onc said TC x 4. Then u second guess yourself ... Is it enough ?? Etc etc. have seen articles that say they both gave similar efficacies but if that's true then why risk the A part Oh well spouse the onc's know best Soriya sorry u r having a tough time. Day 4 is probably the hardest I found and you should sleep better tonight as the dex should be out of your system now. Stay strong :)",
      "MessageIndex": 469,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 2, 2013 08:37AM Nocompromises2013 wrote: Hi firecrackers I had #2 today also. Nit with out a chemo moment on the way in. I got too distracted doing girly stuff ( shaving my chrome dome - soo much better than a 0 buzz cut :)) and cutting the fringe on my wig ) that time escaped me and instead of being out the house at 8.30 I left nearer 9.15. Only 30mins till appt and a 60 min journey ahead of me. Ooppppps All went well. WBCs bounced from 0.1 ( day 10 ) to 5.3 day 21. So pround of the little buggers :) WITHOUT neulasta yay. The bad news is that CIA my tooth flared from days 7-14 coincides with nadir. So she wants me to have neulasta thus time :((( and I never took any claratyne. So I am going to act as your placebo ladies and since only 26% of patients show bone pain I will play the % although this forum worries me cus it seems a lot higher here. Yikes Infusions all good once they found a good vein :(((( ended up in back of my hand this time after attempting my arm great considering I forgot my ELMA today and it would have been in the wrong place - chemo pharmacist !!!!!!! Claratin will not help sinus' pain unless it is due to hayfever. They do in AUS make a combo called Clarinase here which is loratadine and pseudo ephedrine that might be a better choice for cytoxan sinus. even plain old pseudo on its own if your MO allows Also going back to neulasta and claratin they also make a desloratadine version that is stronger/ more effective than loratadine for hayfever and therefore might be even better for bone pain. its called AERIUS here in AUS and made only by claratin manufacturers. I wore my wig and was only one. Others all had scarves ( or very good wigs !!!!). I feel self conscious but everyone tells me it looks really natural. Good luck LanaM hope all goes well Have a great weekend peeps NC x",
      "MessageIndex": 797,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 3, 2013 09:54AM Nocompromises2013 wrote: Woohoo. Just self injected my neulasta - never done an injection on anyone or myself b4. 😄💉💉 Momx2 - poor poor timing re your mum - so sad for you :( Karkar - did they harvest some eggs from you b4 chemo ? Or do they think ovary function will return 2bluestars. That us awesome - so pleased for you. Squishy sound great. JeriGrace - absolutely - I don't feel brave at all - you work with what you have - it can be very scary. - we gave to BE strong - sometimes we need extra support be that thru family, friends, or wise and careful use of medication - we do what we need to get us they our individual journeys. NC x",
      "MessageIndex": 827,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 5, 2013 10:37PM Nocompromises2013 wrote: HVV Miralax is only a stool softener. Maybe combine with senna ( stimulant) as you need to get gut movement ( peristalsis) re-established - be careful of promoting diarrhoea again though also consider Glycerin suppositories ??",
      "MessageIndex": 871,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 9, 2013 07:32PM Nocompromises2013 wrote: Vilia - CBS America have a TV program called Survivor. Bern running for 25 seasons ( about 14years). Contestants are divided into 2 teams and each wears a different color 'buff'. Like a tubular scarf that can be worn on head, arm, round neck etcetera. I might change my avatar if I can get a decent picture of one. I have them in green, red and black. :))))",
      "MessageIndex": 933,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 9, 2013 10:06PM Nocompromises2013 wrote: Oh pAttysmiles - naughty , naughty. What have you started? . I am not going to beable to resist Think I shall spend the weekend trawling the Internet for buffs. Those look cool. Thank you :)",
      "MessageIndex": 938,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 9, 2013 10:55PM Nocompromises2013 wrote: Love it !! White fir christenjng and red for Xmas Funny how coordinated we can be when we want to And I reckon we will be wearing them during/ after ?? Hair grows back so we have a good 6-12 months at least and then hubby needs one too. Good for Aussie summer sun Gotta change it up a bit here and there.",
      "MessageIndex": 940,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 17, 2013 07:17AM Nocompromises2013 wrote: Thnx 2hobs :( I have been drawing on it and just checked and 9hrs later it's bigger again. Still no fever though so I Am going to go to bed and hope it settles overnight Temp is 36.3degrees. (96.8 in US language) night all",
      "MessageIndex": 1064,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 21, 2013 04:21PM Nocompromises2013 wrote: Wow ladies everybody has made some awesome posts over night ( well my 5 hrs of interrupted sleep. You are all soooo right in your posts Moderators ??? TAKE NOTE. We need a 'like '. button so we can click each post as we read it to provide quick immediate feedback and a 'LOL ' button too Angela - I am British but emigrated to AUS nearly 20yrs ago and Rambo my mum would have exactly the same response to yours. Whilst she is British stiff upper lip - ooh stuff and bother ( dawn and French comedy thing ) whilat I would never call her an angel ... She has actually been empathetic and tells me I am so strong --- as we all say. LIKE I HAVE A CHOICE - that said 6 yrs is long enough give me 3 days there and I might be climbing the walls :))) Rambo Rambo Rambo. - you surprise me - I thought strict English lecturers hated unnecessary exclamation marks - you naughty naughty troll (lol) - you will be castigated and thrown out of the teaching fraternity for that faux pa. - hehe bet it felt good though ( hugs) Soriya - cellulitis is usually a staph or strep infection internally under the skin - it is hot, red or purple and can come with pain and fever ( our two worst enemies at present ) HannaR great re the 'A'. Since half of us never had anyway - go girl - welcome to the T part. Unsure hiw different taxol and taxotere actually are. But hope its all smooth sailing - sorry about the tonsils - we all seem to have r weak areAs and as we said chemo finds them JeriG like your birthday story wonder if I can scan a second 50th without health issues next year :) Great posts ladies. We r on a roll :)",
      "MessageIndex": 1136,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 24, 2013 08:58AM Nocompromises2013 wrote: And now the truck hits !! Amazing the difference a few hours make !!! BLAH !!!!!!! KTLe - we saw Malcolm MacDonald with Boz Skaggs at an open air winery in the Margaret river area about 3 years ago - excellent I haven't used a face mask at all. But if you are in an enclosed area ? They don't last long and with humidity from yr breath only last about 20mins b4 they get pretty saturated - all personal choice I guess",
      "MessageIndex": 1174,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 31, 2013 01:04AM Nocompromises2013 wrote: Hi Lana They should give neulasta 24hrs later. They make u wait till after weekend cos it suits them. Extea day wont hurt but leaves you more vulnerable for 2-3 days According to manufacturers info Just make sure it is not less than 14 days till your next infusion",
      "MessageIndex": 1265,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Sep 12, 2013 09:04AM Nocompromises2013 wrote: Hi Ladies Well at the start of the week I was so excited to get to TC4 and now night before I feel strangely apprehensive Had bloods drawn today and again they had to stick me 3 times to find any blood so now I have the most vivid purple bruises in my elbow crease and on the back of my hand so goodness knows where they will pump the poisons into tmrw if they can't use my right arm !!! Looks like you all have had a posting feast this morning??? Can't keep up with it all I am off reluctant bed , steroid loaded and ready to get it all over with including the blah days Night all xx",
      "MessageIndex": 1361,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Oct 30, 2013 05:24PM Nocompromises2013 wrote: Rambo and Soriya CONGRATS. It is awesome to get those visits out of the way. Well done ladies. LE sleeve/gauntlet I had one fitted for flights to UK They look real sexy (not). Pretty straight forward really. I haven't worn or looked at mine since. It got a bit tight/sore at elbow after 20hrs on from rubbing Couldn't wait to get if off after first journey but didn't really notice it on return home - after my H reminded me from the other side of the world about 5 minutes after I had checked my bags in for return flight home with them PACKED. OOPPs. Had to get airline to retrieve bag from cargo area to put it on ,... They were very understanding about it Well done again ladies and anyone else finishing up it is a great feeling xx",
      "MessageIndex": 1638,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 1, 2013 06:44PM Nocompromises2013 wrote: 7 weeks post chemo. (One month post the full 3 week effects) I have about a 2-3mm growth it is very slightly patchy but good enough for when it's fully grown salt and pepper no waves in it ( too short ??). Still slightly too short /uneven to look 'normal' in public although we went to a winery last weekend and I was SOOO warm I did go bald for a little while - my first time Should take photos once a month !!!",
      "MessageIndex": 1650,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 5, 2013 05:38PM Nocompromises2013 wrote: Rambo those boobs were so funny !! Excellent hang in there only a few days to go and then you can start to really get strong again Hannariggs sad to see you so down, but you will get there To all of you do speak to your MOs if the neuropathy is that bad. You don't want it to be irreversible !! I have been on the big T for the last 3 weeks and no SEs yet (except for weight loss - YAY !!! ) Hang in there all Firecrsckers 2014 is just around the corner",
      "MessageIndex": 1665,
      "PostDate": "05/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 14, 2013 04:05PM Nocompromises2013 wrote: try not to assume you will be in pain - if you think it then you will feel it !!! once the drains are out it is much better - How much surgery are you having ?",
      "MessageIndex": 1688,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 15, 2013 06:29PM Nocompromises2013 wrote: copy away Angela. :))))",
      "MessageIndex": 1698,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jan 10, 2014 06:55AM - edited Jan 10, 2014 06:57AM by Nocompromises2013 good advice as always Marsha  So JeriG. You have minus 11. !!! Rug up !! And we r forecast for  over 42degree (107degrees ).  tmrw - air con and swimming pool for me ",
      "MessageIndex": 1908,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Feb 6, 2014 12:06AM - edited Feb 6, 2014 12:09AM by Nocompromises2013 ok the group is set up  You can search for it on fb ( Firecrackers) and ask to be a member  It is a closed group anyone can see the group and who is in it but only 'we ' can see the posts  2bluestars you are in Rambo have sent that friend req so I can then invite you  I am going to get confused at who is who with monikers and real names :))))",
      "MessageIndex": 1940,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Apr 10, 2014 05:14AM Nocompromises2013 wrote: hanna if you want to join the firecrackers facebook. Do pm me with your email.  Sue. ",
      "MessageIndex": 1947,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Oct 15, 2013 03:29AM Nocompromises2013 wrote: Hi Ladies So much seems to have gone on whilst I have been away. So I am not going to try to comment individually too much Rambo in answer to your post chemo bloods etc. I had mine drawn today (32days post final chemo) and will get results Friday. So can let you know more then. Since I am not doing rads I suspect she will just check oestrogen levels and put me straight on tamoxifen. My onc appt is slightly later due to having been in UK but am really interested to see what my bloods, liver and hormone levels are doing. I have no scans planned and don't expect to get anymore done since CT and bone scans were all clear in June They dont like scanning unless there are suspicious symptoms and I have none :) To all those finishing up chemo awesome job - Angela and anyone else that finish line is getting closer for all July firecrackers and a month out my stamina is definately back to where it was prior to chemo - after all the walking around disneyland , Paris and London. A mere 18holes of golf this morning felt easy ( and I got my best score for 2013) so the old me is back detoxified and better than ever before and we will all experience that sooner or later As Hannariggs (I think) put it - we are all so fortunate to have been able to help, encourage and be there for each other on this crappy journey - this forum has been an absolute lifeline for me - congrats to you and your daughter for being so caring and generous Donna - so pleased for you re scans - that's awesome news Xx",
      "MessageIndex": 1547,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 16, 2013 02:44PM Nocompromises2013 wrote: bluestars- don't forget although your last chemo was 22 days ago it will still affect your body the same way as previously ( ie your hair would start falling out - if you had any at day 16 onwards. Including eyebrows cos even the hairs u kept are only just hanging in there You will start to notice proper re growth at 4-5 weeks post. So you are only a week or so away from it - at first you can't believe it. It feels soooo soft and downy I am 8 weeks post and have about 10mm on my head. Have shaved armpits/legs once or twice and as someone else said. Why is it the facial hair that comes back first ???? Grrrr I can also see tiny tiny sprouts of hair at the start of eyebrow line You are Soooooo close :))))",
      "MessageIndex": 1701,
      "PostDate": "16/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 19, 2013 10:20AM Nocompromises2013 wrote: just something to bear in mind - if you have had rads once you cannot usually irradiate the same place again. Hence the risk benefit ratio on lymph nodes, margins etcetc. I am not having them -as decided By BS and Onc. But am very happy to know IF anything did return I still have rads as part of my arsenal of weaponry !!! ",
      "MessageIndex": 1848,
      "PostDate": "19/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jan 11, 2014 07:18PM Nocompromises2013 wrote: funny you should say that 2hobs. My daughter asked me yesterday would I rather freeze to death or burn to death .... We decided freezing would be less painful ??? 107F yesterday bit unusual for Perth ....only 100F  today  :)  Rightly or wrongly I haven't really altered my diet but I have kept going with a drastic reduction in my EtOH  intake so would love to see my liver enzymes stats 6 months on  I see BS Tuesday for first checkup  - yikes",
      "MessageIndex": 1911,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Feb 3, 2014 03:43PM Nocompromises2013 wrote: Hannariggs. ((Hugs))  to you too  Yes AUS is great. Just started to see insurance payouts come thru for our bushfire damage now to get those fences replaced !!  Xx",
      "MessageIndex": 1927,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Feb 5, 2014 06:13AM Nocompromises2013 wrote: Lynn I have messaged you on fb let's get this private fb Firecracker group started ....  Any one else want to join us pm me your fb details  and I can friend and invite you :)  unless anyone knows a better way ? ",
      "MessageIndex": 1934,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 3, 2013 06:47AM Nocompromises2013 wrote: Hi all Rambo we are a day or two apart on Mx (19th June) and seeing onc 5th July. Stay strong :) will learn my toxic cocktail then plus dates Jnprsn. I have same ILC as you. And my surgeon has said 4 months (6 cycles?). I will know more Friday and will share then the surgeon and onco share offices and seem to be at the forefront of bc research in Western Australia Welcome to the firecracker group Also read my path report today and had 2 xtra baby tumours and some DCIS just to make life varied. So glad he just did a full Mx. My boob was totally cactus !!!!",
      "MessageIndex": 57,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 11, 2013 06:32AM Nocompromises2013 wrote: well that is Day 1 chemo over and done with  YAY - so far this firecracker lives to fight another day.....  I used EMLA cream (lignocaine cream) to numb the cannula area and i swear i never felt a thing when they put it in. My veins are small and they didnt even bother with the back of thehand and went straight for the elbow ( i had a patch there too  hah).. they also put my arem in warm water first to beef the vein up so all went well there Took about 2.5hrs to put in the dex, granisetron, ducetaxol and cytoxan.  no SE whatsoever.. needed the loo 3x though cos they pumped so much saline thru too (hey saves drinking water :))))) it is 5 hours ost infusions and all good  have drunk some gingle cordiol  and eaten a huge slice of lasagne a friend had left on our doorstep and all is well with the world... we will see what tomorrow and the weekend brings... Michelle69 hope your day is as good as mine... the waiting and the unknown are definately the hardest parts i did paint my nails black,, but my onc took one look and said nothing had been proven on black nails or icing .. they did recommend nail hardeners though.. either way i am sticking to my black nails.. they are growing on me.. pardon the pun :)))))) Sue x",
      "MessageIndex": 225,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 11, 2013 09:41AM Nocompromises2013 wrote: good point Hannariggs... i have an A3 spreadsheet started for each cycle of chemo. for monitoring daily nausea,  toiletting, fatigue,apetite/taste,pain,night sweats and moods/feelings and vol of liquid  should be a good record for future cycle comparison. if anyone wants a copy i can try and PM it. i like your water and crackers on the night stand.. hopefully i wont wake too much to drink it :) .... think i need to use the biotene more frequently though SE headaches?... i did have a mild one fromdex, but ignorable... maybe try paracetamol or NSAID... i darent say more fluids :)))",
      "MessageIndex": 227,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 12, 2013 06:47AM - edited Jul 12, 2013 06:54AM by Nocompromises2013 Rambo50  i have pm'd you for spreadsheet info. Although your regime is different.. i could have worked on infusion day and today ( day 2), i managed to play 18 holes of golf :) .. that is 22 days post MX and axillary clearance ( not 15days as i said in your PM :). So for anyone else out there.. working on chemo day and day 2 definately doable if need be.. days 3, 4 and 5 no doubt a different story :) Still eating well and took my last steroids tonight.. yay... Nc x",
      "MessageIndex": 246,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 13, 2013 03:08AM - edited Jul 13, 2013 05:41AM by Nocompromises2013 Awesome hunnybunny I reckon that first day of chemo has to be the hardest psychologically - for me it was Day 3 and no symptoms but I am Still waiting for my sennacol to kick in Grrrrrr. :(((  edited to add....3-4 hours later ....bombs away woo hoo.. bowels still functioning.... NC x",
      "MessageIndex": 272,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 16, 2013 06:11AM - edited Jul 16, 2013 06:17AM by Nocompromises2013 Hi Rambo Hydration really important. I reckon day minus 1 thru 3. Not so much after that once you are off the antiemetics and your system has flushed thru My onc said water not as well absorbed as sweet or salty drinks. I made sure I had a variety. Milk for breakfast , milo , lemon squash, ginger cordial, some water and soups made sure I had about 2.5L a day minimum. Am being slack again now from day4 only 1.5L Taste slightly weird days 2 -5 but nothing metallic this time around And today I ate some raw onion and spicy tomato juice. Thought it might be a dumb move but I got away with it Mind u. I am on TC :)) Food?? Lots of protein. Roast chicken, roast lamb ( and too many carbs !!!).",
      "MessageIndex": 331,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 18, 2013 10:24AM Nocompromises2013 wrote: Yay. Go Rambo. Glad SEs not too bad yet Yes those pesky steroids do interrupt the sleep patterns. So your 3am is my 5pm :)))) I was so focused on emptying my bladder from the cytoxan that night 1 I don't know if it was the steroids or my bladder emptying waking me Sounds like our starting WBCs were similar but if you have had a neulasta shot then the next readings will be pretty different. Fascinating ( that's the pharmacist in me). Rambos floss advice sounds logical to me Soriya re my nausea meds. They gave me kyril 2mg to take at 7am on day 2 and 3 and I never needed the breakthrough nausea meds so middle of the night wasn't an issue for me If you are awake take it if not be happy you are asleep think it is only the first 3 days really anyway the nighttime dex dose should cover you overnight WBC update post weekend Oh and my oestrogen levels looked perimenopausal anyway <100nmg So bye bye ovary function ???",
      "MessageIndex": 387,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 23, 2013 09:11AM Nocompromises2013 wrote: Day 13 for me Played 18 holes of golf ( again ). Felt pretty tired by the end Saw my physio for 5 week check up post Mx and she was really happy. No sign of Any lymphedema (yay) Lying on couch trying to decide if a few weird tinglings in my toes could be neuropathy stirrings hope not .. Onc reckoned vitB6 100-200mg would be good .. Maybe I should start it? Good luck HR for #2. And puppy mamma ( think u are on TC like me ??). Bikergirl not sure of your regime JeriGrace how did you go? Hope everyone is traveling well Still got my sore tooth :((((",
      "MessageIndex": 521,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 24, 2013 06:44PM Nocompromises2013 wrote: Rambo !!!!!! Just read your post. So sorry for my sister in arms WBC. Dont stress we know it was ALWAYS probably going to happen .... But i Can't remember did you have a neulasta shot ??? My WBCs ended up day 10 as 1.1 and 0.1 wont find out it they are bouncing bsck till Aug 1st I guess if you are on DD you don't get as long to bounce back hopefully they will still treat Maybe we will need to rename you Angelina !!! As aaoaao rightly says at least your daughter is forewarned and therefore forearmed Stay strong always better to know the complete nature of thx beast so you know how to destroy it Sending you lots of hugs. NC xxxxx",
      "MessageIndex": 562,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 25, 2013 08:18PM Nocompromises2013 wrote: Hi ladies, Yes biker girl a sportster, no I haven't ridden it since Mx 5 weeks ago. But my excuse is it is winter here so pretty chilly and wet plus not sure I would have the strength to stop it falling over down our gravel drive !! An HD -hummer. Sounds different :). Good on you Day 16 and Hair coming out in clumps today in shower. Cos it's Friday can't decide whether to bite the bullet and go to wig shop/ shearing shed with hubby today or wait till after weekend when I could be really patchy and have no coverings except for beanies . Don't want to buy or get wig fitted till hair is shaved. Either way with DD 16th birthday on Sunday it's gonna be an emotional weekend NC xx",
      "MessageIndex": 592,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 30, 2013 03:49AM Nocompromises2013 wrote: JeriGrace - hope they have discharged you now and you feel good Rambo -hopefully I have #2 on Friday if my WBCs are up Got Buzz cut to #4 last Friday, now totally shaved and using headgear will use my wig for work tmrw. And yes you guessed it my 4th round of golf for cycle 1 yay Good to hear your teaching schedule will work out and that you have had 3 good days Stay strong everyone. NC x",
      "MessageIndex": 694,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 1, 2013 11:21AM Nocompromises2013 wrote: :(((((( but I haven't got a rash :))))))",
      "MessageIndex": 760,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 1, 2013 10:36PM Nocompromises2013 wrote: Karkar PPE is a similar manifestation of the hands and feet. Typically seem after administration of some chemo drugs ( although more usually the AC. Regime) Was it definitely hand foot and mouth? Or PPE. If PPE be aware it may come back with round 2. They suggest a slower infusion rate or keeping hands and feet COOL. Maybe do a little more research ??? Good luck hope it doesn't reoccur NC x",
      "MessageIndex": 785,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 3, 2013 11:00AM Nocompromises2013 wrote: Karkar. The neulasta was easy/ pain free It comes with a step by step instruction sheet. Make sure you have some alcohol swabs on hand I just did it in the gut the leaflet tells you the areas you can use and clearly how to do it. Just make you you commit to jabbing and then push plunger slowly and steadily all the way in ( helps if you have a nice pinch of stomach fat :). ) Can anyone remind he when the bk e pain mag start. I know Rambo dmsaud she was later with day 8. Any other suggestions i thought it was about day 3. ?? TIA. NC x",
      "MessageIndex": 831,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 5, 2013 07:11PM Nocompromises2013 wrote: Can't get the thread to print all my stuff :( Day 5 I feel more normal :) - yay So glad your day went well Rambo Daisy - my mouth feels icky too, no sores just weird Ckmoss - you r right re rads. My onc said none for me and I have read and read.as best I can figure If you have a full Mx , good margins, less than 4 nodes involved and small tumour then apparently the risks of rads do out weigh benefits of rads. We get to choose. Potential recurrence of BC ( low risk). Or damaged heart and future issues there. Lumpectomy and rads are a given Hope all traveling well NC x",
      "MessageIndex": 866,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 7, 2013 01:36PM Nocompromises2013 wrote: Jnprsn - hope all settles down for you and #2 happens soon enough Rambo - ditto pain/rash?? I am trying Daktosin ( a combo of nappy rash zinc oxide and an anti fungal) failing that I will try a hydrocortisone with anti fungal . Am thinking since I noticed same sensation round #1 and now you have mentioned it perhaps it is skin sensitivity to the cyclophosphamide Hopefully will clear up soon. But mine is VERY itchy. 2 blue stars agree re time flying when not having fun - in my case winter is going fast and maybe we can be more tolerant after all this Vilia - stay strong :)",
      "MessageIndex": 896,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 22, 2013 08:13AM Nocompromises2013 wrote: Round 3 DONE. Took 3 goes to get a vein !! Grrrr Went factory outlet shopping afterward then out for a vindaloo curry !!!! Onc didn't even ask to see my cellulitis !!! Got my WBC s. Rambo here r the figures day 20 post round 2 all in range and WBC - 6.5. (ANC 4.7 w/ neulasta) Hb hanging in there I have a theory - no bone pain= less boost to neutrophils ??? Onc said they can blow out to 50000! Didn't someone here a high figure ? I don't need to see onc before 9/13 infusions as she is on holiday and I dont want to delay 5 days. So since bloods are good I have a gold pass. YAY. Hope everyone else had a good infusion day",
      "MessageIndex": 1139,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 23, 2013 01:40AM Nocompromises2013 wrote: Lana - mark it and watch if it grows. If fever, swelling or it enlarges then yes. But if on both legs and face more likely to be allergy than infection Anti Histamine???? - but you are not on taxol. Unsure if AC or T do that. Keep a close eye on it",
      "MessageIndex": 1150,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 27, 2013 01:06AM Nocompromises2013 wrote: Soriya - I take the vits everyday regardless of chemo Will cease B6 maybe 3 weeks post chemo. Will keep up vit D as its suspected BC ladies need higher vitD levels ( more than 75 instead of conventional 50)",
      "MessageIndex": 1221,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Sep 7, 2013 09:41AM Nocompromises2013 wrote: I mentioned icing to the nurses at one of my Tx and she said my onc doesn't allow it at all because if you are going to do chemo you don't want to then try and take short cuts .....thus potentially making it less effective. I agree with lark this would be especially true for capping. Day 17 and went to the theatre today. Probably luckily it was pretty empty so no germs anywhere near us -yay. Angela sorry to hear of your rough time with taxol Hunnybunny glad to see you are posting again - you had gone quiet :) Good luck to all this week",
      "MessageIndex": 1329,
      "PostDate": "07/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Oct 18, 2013 03:21AM Nocompromises2013 wrote: I have officially been signed off my onc for 6 months :)))))))) Rambo my bloods 5weeks post final chemo all pretty much back to normal. Neuts were 4.3. WBC overall 5.3. Lymphocytes a little low but nothing in the scheme of things The funniest thing my liver is now in better condition during and post chemo than it was at the start due to cessation ( or dramatic cut down of ETOH ) so ladies my message to you is chemo is better for your liver than alcohol - how scary is that !!! I Now have 6 monthly checks alternating between BS and onc. So no Drs or procedures for 3 months. And I am officially in menopause so starting tamoxifen tmrw Hugs to all. Xx",
      "MessageIndex": 1580,
      "PostDate": "18/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 17, 2013 01:45AM Nocompromises2013 wrote: OMG Lyn .... That is way too close to home and soooo quick - do you know what her initial Dx and Tx were nodes etc? That is REALLY very sobering and scary !! We are ALL strong and beautiful as I m sure she was . Very very sad. By the way ...Facial hair ....Just to put it out there. I only have 3-4 pesky ones that keep coming back in the same place - incase u all think I am a Neanderthal :)))))",
      "MessageIndex": 1708,
      "PostDate": "17/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 19, 2013 02:26AM Nocompromises2013 wrote: Lyn. Thank you for sharing your friends Dx and Tx. IBC is a whole different ball game !!! Still tragic for her and her family thou JeriG. Can't believe you are Half way thru rads - well done. Has gone so fast ( seems to me) KBee. Do keep us informed re the 6 or 4 debate.",
      "MessageIndex": 1716,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 10, 2013 01:36PM Nocompromises2013 wrote: JeriG - final rads. Well done it's been a long journey. Don't worry the free fall isn't too bad and they won't let you go that easily .... Still have 3mthly check ups :)) Congrats for completing rads. Xx",
      "MessageIndex": 1799,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jan 12, 2014 08:14PM Nocompromises2013 wrote: ok little update on our heat wave  Due to high temps. We just had a massive bushfire come thru yesterday  44 homes lost  We have lost 1/3rd of paddocks  No power so No A/c anymore 2hobs  House safe Family safe  Total devastation. Looks like Armageddon here !! Welcome to 2014 !! Only 82F today but pretty windy !! ",
      "MessageIndex": 1914,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 1, 2013 07:11AM Nocompromises2013 wrote: Hi again ladies Yes Hannariggs, it is winter here, think I will be wearing a beanie in bed ( seamless of course :) ) I am in Perth on the west coast , did you visit the east ?? I am grabbing your hand and making sure I have taken all possible treatments available too Marsha. So sorry re your second cancer. From your signature it looks like a different/ new cancer .. Not a reoccurrence. Which I guess gives some of us newbies hope that the chemo really does work and it looks like you have caught it very early :) and I hope you have no further complications ! Puppy momma. I visited bethesda, Maryland once in 1978. Same same re staying up Late at night researching in these threads. I have a list longer than my arm of things for my chemo basket but have yet to get anything. I did visit a wig shop. But it was only day 7 post Mx and my arm was hurting so much by the Arvo that I couldn't commit to anything and ended up highly emotional. I shall be stronger next time as I won't be so badly prepared Saw a wig hubby liked he reckoned I looked like Tina Turner. Blackish brown with chilli red streaks Well when else can you do it :). Couple of scarves looked good too Ho hum. Roll on Friday Here's to holding hands on the roller coaster :).",
      "MessageIndex": 22,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 12, 2013 09:54PM Nocompromises2013 wrote: Hi Hannarigs.. i had movement days 1 and 2 but nothing yet today  i am on senna and coloxyl ( 2 @n and 2@ morning) but feel i need to either have a good walk or up the ante... my onc recommended glycerin supps, movicol  lactulose ( too sugary)  and colonlytely  then see GP NC :)",
      "MessageIndex": 265,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 15, 2013 08:01PM Nocompromises2013 wrote: Hannariggs I took 2 x sennacol ( senna and coloxyl) the night of chemo, the night after and the morning of day 3. That was enough and but I was very gripy by the night of day 3. Haven't taken anything since but haven't seen a stool for 48hrs although I think I was emptied out. If nothing by end of today I will take 2 more sennacol I only took the antiemetics ( kytril) on day 2and 3 so hopefully if no anti nausea tabs then less chance of constipation Starting day 6 today Mouth feels a bit better and I have energy hopefully it's all OK now till cycle 2 but I do have blood tests day 8 and 10 to check WBC counts Hopefully no neulasta for me. Have booked for golf again for day 9 Unsure if 9 or 18 holes at this stage I Did 2 hrs of work day5. But wasn't really interested Don't fear the chemo ward folks day 1 is pretty easy seriously it is the daunting unknown ... I was terrified BUT I have been SO pleasantly surprised so far. Chemo is nothing how I had imagined it Good luck for this week hunnybunny, dwfmom, lanam et al Xx",
      "MessageIndex": 321,
      "PostDate": "15/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 15, 2013 08:07PM Nocompromises2013 wrote: Soriya. I had cycle 1 TC by I/V.to elbow crook No probs at all and plan to do the remaining cycles that way too maybe a different site but all I/V with emla first No port for me .. I have small veins am sure you will be FINE. :)))) :)",
      "MessageIndex": 323,
      "PostDate": "15/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 21, 2013 07:58AM Nocompromises2013 wrote: Peace and jerigrace My dad and grandma both had maturity onset diabetes , I had gestational diabetes 16years ago. They say type2 follows within 10years. But I would probably still classify myself as pre diabetic. Probably only a matter of time but I try to keep exercising and keeping weight down to try and stave it off Jerigrace it sounds like you have a lot of juggling to do ... Am Sure I read about a possible connection between BC and low thyroid... How long ago was yours removed? Rambo I have my chemo kit in the bathroom and a chemo bag that accompanies me everywhere ( yes even the golf course) My second dose is August 2nd reckon there is a heap of us all that week Scribblinhanna must be hitting her second by now and hunnybunny must be this week maybe??? I need spreadsheet to keep up with who's doing what and when with these different regimes :)))) Feel free to talk anytime jeriG isn't that what time differences are for?? I go to bed and next morning you have all had a good ol chin wag without me. Roll on day 12. :))",
      "MessageIndex": 475,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jul 30, 2013 06:40PM Nocompromises2013 wrote: JeriG. There is no doubt the neulasta played its HUGE part in your WBCs bouncing up the way they did and as quickly as they did. As we know at day 10 my neutrophils were 100 also. Although I was fortunate enough not to get the fever or an infection ( just that chronic toothache ) I have new WBC count being done tmrw. So it will be really interesting to see how they bounce with out neulasta. After 20 days Re the generic loratadine there should be no reason why they did not do their job, the active ingredient and strength would be identical however the fillers are sometimes different ( starch, glucose, gluten etc). Occasionally the absorption can maybe be slightly altered because of this. But if this was really the case then substitution with generics would never be permitted so in answer to your question - in theory no - in practice it seems to happen occasionally. There are generics that are actually manufactured by the originator brands known as 'cross-licensed'. These normally come off the same conveyor belt. Maybe you could source some of them ( the originators make them to try to grab the generic market for themselves as well as the original brand ) Who is slated for rads after their chemo??? . I have been told I don't need them and am ??? If that is OK. I had very clear margins and my node had not gone extra capsular (yay) appreciate any feedback. NC x",
      "MessageIndex": 725,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 1, 2013 05:47AM Nocompromises2013 wrote: Reality check - know what u mean re the photos. I sent one to my MiL and next thing my BiL is ringing me to commiserate !!!!!!!!! Who knows where else she had sent it. NOT HAPPY. I bit the bullet and put it on fb the next day. But even sooooooo. I am a week ahead of you. So let's see if I get knocked about for #2 tmrw good luck for next week LanaM - snap. :) Lynn. Your blog was really good I agree with JG Definitely puts a face and family to the monicker. My DH refused point blank to join my shave party it might not grow back for him :). His work told him yesterday he has to go up to Darwin for a couple of FIFO stints. 3 weeks on 1 week off. They have been really supportive for the past 6 weeks. So I guess it had to happen. Life carries on. :). NC x",
      "MessageIndex": 757,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 1, 2013 06:33PM - edited Aug 1, 2013 06:34PM by Nocompromises2013 I am a firm believer that chemo weeds out the weaknesses your body is already prone If you have had any occasional minor but chronic afflictions thru your life. Eg acne, rashes, occasional wisdom tooth, prone to constipation. Etc just name your weakness and chemo will sledgehammer it IMHO :)",
      "MessageIndex": 779,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 10, 2013 05:53AM Nocompromises2013 wrote: Hi HVV There are some videos on the buffusa website. Although we are fairly limited I have worn mine the obvious way ( plonk it on and have the spare down the rear or like a beany - turn it inside out twist in the middle and turn it on itself - watch one of the videos for the original buff ) and also used it under other headwear /hats as layering - it's all trial and error I guess and after awhile I get soooo itchy with anything on my head today - grrrr",
      "MessageIndex": 942,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 16, 2013 04:12AM Nocompromises2013 wrote: Hi Ladies Lana M Ditto all the above re the continual updates and asking how i feel , guess they are all caring and anxious but i know week 1 will be crappy - weeks 2 and 3 i am a NORMAL person quit asking me .... yes i view this as a bump/ hurdle not a continual fight Think eyebrows/lashes and nails come much later - hope I am wrong and they never fall out - so far so good SweetheartinTX - I am not medico BUT GET THE RADIATION - if as you say it was 1. attached to your pectoral muscles - 2. It was TN 3. grade 3 (even with no nodes) AND your surgeon said he could not get all of it without killing muscle/skin then you really should take the radio option - lecture over Angela good to hear re eyes KTle. Appreciate your comments - I feel totally comfortable with UMx have bought some nice M bras and all (75%) covered on private health have the original \" nursing pad\" and also a \"you beaut \" Amoena prosthesis which the AUS govt pays $400 of and my health insurance the extra $29 My problem is I feel DH really wants me to get a recon and I am totally happy ( well u know what I mean) as I am and really don't want any more surgery 2hobs- if I had had a dbl Mx I might feel differently but I didn't ( and it was discussed at start and surgeon reckoned definately not needed ) - this is probably a Topic for a different thread - but how do I make hubby feel involved in the decision when he is adamant one way and I am pretty adamant the other way - it is my body after all GRrrrr think that is my biggest challenge at present ( more even than chemo !!! ) Not seeing BS till January so plenty of time - maybe summer will make me change my mind - who knows there is no sell by date on when/if we choose recon Rambo - so glad for your daughters results - interesting re your WBC - they do seem low overall. Here are mine Initial - 7.2 ( ANC -5.1) Day 10 -1.1 (ANC 0.1 no neulasta ) Day 20 - 7.2 ( ANC 5.3) Will get next results( with neulasta) next Thursday prior to number 3 Fasting ??? I am eating what I want when I want ( within reason). Which means days 2-6 bit of an effort but rest of cycle all good - BUT thank goodness I have still had no nausea or indigestion since the start - hopefully I will scrape thru to the end w/o At the end of the day. Hydration is probably the most important thing to get right and good amounts of protein to help our bodies rebuild Apologies to any one I should have mentioned but didn't Have a great weekend - mine starts NOW :) Hugs to all ( and no I am not a huggy person either lanaM",
      "MessageIndex": 1043,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 27, 2013 04:39AM Nocompromises2013 wrote: Soriya - any brand vit D as Long as it is D3 (cholecalciferol)1000IU - 25mcg Rambo - so sorry to hear of your upcoming surgery and delays - my onc tried to delay #4 on me by 4 days cos she was on holiday - I nearly jumped the table on her in my disagreeance - she got the message and agreed I can have the treatment in her absence - amazing how we focus on set times scales / finish lines and any delays absolutely floor us - I was ropeable Any Surgery is serious and I guess you need to understand that any risk of GIT infection needs to be dealt with rather than risk peritonitis, septicemia or worse. I hope it all goes smoothly and you don't have too much delay I think AC and TC have been looked at with varying frequencies ie fortnightly , 3 weekly maybe even 4 weekly I guess it is quite moveable if some onc's don't seem to mind stretching the periods between cycles to suit them too Stay safe and infection free !!! Xx",
      "MessageIndex": 1229,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Aug 31, 2013 06:01PM Nocompromises2013 wrote: I am sorry Lana didn't mean to worry you ..... I suspect that giving that much later it will nearly have a chance to really kick in b4 your next cycle. So you maybe well be neutropenic for a little longer The main worry was usually if you give it at same time as chemo that the poison will kill off the immature stem cells and that might cause more probs. so moral of story probably better later than earlier or u could just skip it for this cycle- you are traveling well . Next time If you keep having it ask to take it home and self admin 24hrs post chemo - that's what I have done for 2 rounds - it's EASY to do and painless in stomach as long as you do it slowly. How brave to consider rocking the bald If it was me I would definately wear a wig or scarf Lana. But it is your choice. I teased H yesterday about going out bald and he never skipped a beat. I still wore my wig though. I don't even notice it really now and loads of people have said to jeep my hair like that when it grows back. But I would never have the time or patience to persuade my hair daily to have such volume. Maybe I will just keep the wig. Haha Anyone else's eyebrows thinning ?? Rambo you are very quiet ?? Angela - glad to hear those Sx were nothing serious was sounding pretty bad - I was thinking stroke and all sorts - sinus sounds like a better option - stay strong and great your stepson is so patient for you - he is a good boy !!",
      "MessageIndex": 1276,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Sep 18, 2013 04:22AM Nocompromises2013 wrote: Hi Cherri Taxol is paclitaxol - natural yew tree derivative Taxotere is docetaxel - synthetic Weekly is a lower dose more frequently = less SEs ????? Dose dense is fortnightly ???? And taxotere ( with cyclophos) usually done 3 weekly guess it lessens use of beds, oncologists time and a neglible difference in survival / reoccurrence rates all depends on protocols at each location I guess I think we all wonder if someone else is getting a better/ worse cocktail than each other :))))",
      "MessageIndex": 1413,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Oct 9, 2013 08:49PM Nocompromises2013 wrote: wise words indeed DonnaD08. Stay positive UNTIL there is a reason not to",
      "MessageIndex": 1517,
      "PostDate": "09/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 20, 2013 03:49PM Nocompromises2013 wrote: soriya - so sorry if they have detected a new mass - hopefully it won't change anything if you are due for Mx anyway in dec then this other mass too has been subjected to chemo and like your current tumour will SOON be GONE !! Shame they can't do the biopsy quicker for you .... They usually do them here same day as mammos and stuff to save the waiting Wishing you all the best. Xx",
      "MessageIndex": 1730,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Dec 11, 2013 10:57PM Nocompromises2013 wrote: JeriG -and 2Hobs loved those phrases Rambo. Good luck for Mx and you recover quickly ready for Crimbo. An early Happy Christmas to everybody !!",
      "MessageIndex": 1814,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jan 4, 2014 01:17AM Nocompromises2013 wrote: hi Ladies  Apologies for my tardiness - been too busy partying and boating in the Aussie sun -  hehe.  Happy New Year to everyone may 2014 be happy, very healthy and filled with fun and excitement - you have all been incredible in 2013 and a great support forum - I feel priviledged to have shared our journeys together  JeriG. Well done on Hiking Xmas day. What a beautiful place to have  been - I spent my 30th bday in Yosemite and Sonoma Valley and loooved it all  Here's to health and happiness  S xxx ",
      "MessageIndex": 1898,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jan 17, 2014 07:09AM Nocompromises2013 wrote: 6 days on still no power :(((",
      "MessageIndex": 1918,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Jan 18, 2014 08:57PM Nocompromises2013 wrote: Thanks for your thoughts ladies yay power came back on ..... Sat mid-morning  We borrowed a noisy generator from work and had it going during the day to keep fridge and freezerS hanging in there, it also powered mobile phones ( think it has wrecked an iPad ) and a couple of lights and the toaster each morning :))  I cooked a bit with gas and we had hot showers at nearby friends house or cold showers/ pool at home and were invited out to eat with friends a couple of evenings  I skipped work Monday but went in wed and thurs. Insurance assessor cane out from MEL and saw us Thursday and said no probs. so we will see what figure they offer us. Reckon the damage  runs to about $20,000 minimum  Yes I had that exact same thought re chemo ... That would have been toooo much !!  Snuck  out of hot Zone to see BS on Tuesday and he was 'very happy' - so that was good news  Can my life get back to normal now please ????? NC xx",
      "MessageIndex": 1921,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Feb 5, 2014 02:11PM - edited Feb 5, 2014 02:41PM by Nocompromises2013 that's weird cos there were definately pictures of you on the profile -  and a big tiger - it is a message not a friend request - will send another :) - your account doesn't seem to be set up for a friend request ? I need to friend someone to make the group after that others can see the group ( but not the comments ) and request to join - best to make it closed rather than secret I think - ",
      "MessageIndex": 1936,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Mar 10, 2014 12:43AM Nocompromises2013 wrote: hi soriya. Have pM'd you :) ",
      "MessageIndex": 1944,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Oct 31, 2013 10:28PM Nocompromises2013 wrote: weathers great thanks Just wondering if I started Tami 2 weeks ago - I wonder if the additional stiffness/tenderness in general Mx and ALD area could be related to that ??? I haven't noticed anything else wrong since starting on it ???",
      "MessageIndex": 7,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/813760",
      "Title": "Flabby bits? Nocompromises2013 Ariom"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Nov 1, 2013 01:14PM Nocompromises2013 wrote: hi Ariom Yes still moisturizing and throw in PT exercises to reassure me I still have full movement etc. The change in sensation I guess could be any number of things Warmer weather ? Tami? LE? ( hope not PT was pretty sure in sept that I will escape it ) No itching, No cording either and lots of exercise ( as in golf) Ho hum will await BS comments in Jan Paynesville looks very scenic ?",
      "MessageIndex": 9,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/813760",
      "Title": "Flabby bits? Nocompromises2013 Ariom"
    },
    {
      "AuthorID": "Nocompromis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182978/profile",
      "Content": "Apr 4, 2014 11:22AM - edited Apr 4, 2014 11:24AM by Nocompromises2013 hi Ladies and good luck to you all as you begin yr chemo journeys  I did TC for 4 rounds last year  I never had any nausea or vomiting. Make sure you keep yr fluids up and try to keep as normal a routine as possible  I found a spreadsheet for each cycle helping me keep track of symptoms, food, temp, weight , etcetc. Then it was good to look back on previous cycles and see the prehaps the next day was going to be even easier - it follows a definate pattern  I worked P/t  and still played 18holes of golf once or twice a week  Chemo is very doable ( I would prefer not to have to repeat it) - and make sure your bowels are regular especially in the first 5 days of each  cycle  Feel free to PM with any Qs or queries  I hope you all find it as doable as I did. ",
      "MessageIndex": 55,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    }
  ]
}