{
  "AuthorID": "Nona32",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197320/profile",
  "Posts": [
    {
      "AuthorID": "Nona32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197320/profile",
      "Content": "Mar 5, 2014 03:56PM Nona32 wrote: Thank you Marie5890! My doctors are confident this isn't going to be anything to worry about. My concerns are that it's dealing with my milk ducts and the area is very sore. My worry is DCIS. Hopefully this will not be the case. I appreciate all the info, it does make me feel better!",
      "MessageIndex": 7,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818787",
      "Title": "Wondering if I'm alone on this journey? Nona32 NorthwindsGS"
    },
    {
      "AuthorID": "Nona32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197320/profile",
      "Content": "Mar 5, 2014 02:36PM Nona32 wrote: Thanks everyone! I don't know my Birad number and honestly until this site didn't even know what that was. But I'm in the process of getting my mammogram report so I can look at it. I do understand how when BC happens to someone in your family you are always on high alert but then when YOU are the one having a concern it all seems surreal. I just don't want to be disapointed if something bad does come of this so I'm trying to learn all I can just in case. I wasn't expecting to have to go back for this core biopsy and now that I do I'm beginning to question everything. I will keep everyone updated.....I go March 18 and they said I should have results in two days.  ",
      "MessageIndex": 4,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818787",
      "Title": "Wondering if I'm alone on this journey? Nona32 NorthwindsGS"
    },
    {
      "AuthorID": "Nona32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197320/profile",
      "Content": "Nona32 wrote: Hi I'm 32 years old and went to the dr last month for a lump in my breast. Long story short I have had a mammogram, ultrasound, fine needle aspiration and now I'm having to go back for a core biopsy in a couple if weeks. Everyone I talk to clinically says it's probably not going to be cancer. But I can't help but worry. My mom had breast cancer 4 years ago and is a survivor. My paternal grandmother had H. Lymphoma and died at 43 years old. So you can see why I'm concerned. My symptoms are mild just a dense lump at 3 o'clock position of my areola that is painful. Ultrasound showed complex cyst. Path from needle biopsy showed that to be a Aprocrine Cyst with atypical epithelium cells. Thus being the reason I have to go for a core biopsy. Has anyone else my age been in this same situation? How did things turn out for you?  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818787",
      "Title": "Wondering if I'm alone on this journey? Nona32 NorthwindsGS"
    },
    {
      "AuthorID": "Nona32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197320/profile",
      "Content": "Mar 5, 2014 03:31PM Nona32 wrote: Ok my Birad is a 4......",
      "MessageIndex": 5,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818787",
      "Title": "Wondering if I'm alone on this journey? Nona32 NorthwindsGS"
    }
  ]
}