{
  "AuthorID": "Nonni2015",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289265/profile",
  "Posts": [
    {
      "AuthorID": "Nonni2015",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289265/profile",
      "Content": "May 17, 2019 07:32PM Nonni2015 wrote: Hi - I had a mastectomy on left, still have right one. This was pretty recent, 4 months ago. In the middle of chemo now. I chose no reconstruction. For me, the less trauma on the body the better. I am totally fine with my body. I do not wear a prosthetic, although I might if need be maybe for a certain dress or whatever but so far I’m good being who I am now & I go with what is. I found a sports bra that has supportive cups with a zipper in the front. Zip it up & I’m good to go or I just wear a camisole. Hope this helps",
      "MessageIndex": 1,
      "PostDate": "17/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/871581",
      "Title": "Anyone have a uniboob and does Not wear prosthetic? ShadePink Nonni2015"
    },
    {
      "AuthorID": "Nonni2015",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289265/profile",
      "Content": "May 25, 2019 07:38PM Nonni2015 wrote: ShadePink - Thanks for your response. I had 4 rounds Taxol and that was an adventure, still dealing with neuropathy, I start CMF next Wednesday and am terrified, I had one A/C and ended up in hospital, couldn’t tolerate it. I am constantly trying to lift myself up & be positive but it’s hard to do sometimes. I don’t mind the uni boob situation, I can deal with that just fine but the upcoming chemo.....wish I felt more confident. Hope you’re doing well today- Nonni ",
      "MessageIndex": 5,
      "PostDate": "25/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/871581",
      "Title": "Anyone have a uniboob and does Not wear prosthetic? ShadePink Nonni2015"
    },
    {
      "AuthorID": "Nonni2015",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289265/profile",
      "Content": "May 25, 2019 05:24PM Nonni2015 wrote: Hello all - I am starting 4 rounds of CMF this coming Wednesday May 29. I am terrified; I completed 4 rounds of Taxol, experienced a lot of neuropathy. I also had one round of A/C which I could not tolerate, so it was changed to CMF. I had a mastectomy as well. I just need to get through 4 rounds of CMF and radiation and I am so scared because the A/C was not tolerable & I ended up in the hospital. I am 65 years old, was always a fitness person, looked & felt 20 years younger now it’s a different story. I need to know the CMF is worth it and is tolerable",
      "MessageIndex": 323,
      "PostDate": "25/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    }
  ]
}