{
  "AuthorID": "NonniO",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79387/profile",
  "Posts": [
    {
      "AuthorID": "NonniO",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79387/profile",
      "Content": "Feb 13, 2009 09:00PM NonniO wrote: Hi Denali, This is my first post on this forum. I too will be starting TCH (3 week intervals with Herceptin every week for 1 year), although I will probably start the first week in March so I hope it's ok to respond here. Maybe we can share experiences. I've signed up for a clinical trial that will add Avastin to the TCH regimen - hope I get accepted and the computer selects me to receive it!  I'm a little scared, but want to get this thing over with as soon as possible.  I hope to continue working through my chemo treatments, with as little down time as possible.  I work in a high school and have already taken several weeks off for my surgeries (mastectomy left breast and lymphectomy), so I don't want be out of work forever!  And I've already got an appointment at a local hair salon to pick out a wig - can't wear hats or scarves at school and I really don't want students to notice the difference.  Good to hear that your first treatment went so great.  I also have a port - it was inserted during my mastectomy surgery.",
      "MessageIndex": 1,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729027",
      "Title": "Starting TCH in Feb 2009? (Taxotere, Carboplatin, Herceptin) Denali Smile2006"
    },
    {
      "AuthorID": "NonniO",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79387/profile",
      "Content": "Oct 18, 2010 05:02PM NonniO wrote: Oh - Godlistens - don't worry!  I've had three colonoscopies (one every 5 years because my mother had colon cancer) and they weren't that bad at all.  They put you out for the actual procedure, so the only discomfort you'll experience is with drinking all that prep solution. Plus, you spend a lot of time on the toilet.  If you're given a choice, I'd suggest taking all the prep the night before your procedure.  I did the half the night before & half the next morning routine once and I was \"going\" right up until the appointment!",
      "MessageIndex": 1,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759536",
      "Title": "MY FIRST COLONOSCOPY - ANY ADVICE? Godlistens BarbaraA"
    }
  ]
}