{
  "AuthorID": "Noodi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258752/profile",
  "Posts": [{
    "AuthorID": "Noodi",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/258752/profile",
    "Content": "Noodi wrote: Hello ladies, Well, my story goes.... I received a letter in the mail stating I needed to go back in for more imaging. My screening mammography indicated there was a suspicious finding. I went back in for 3d mammo and spot tomo, and an ultrasound. That resulted in findings of: An Area of Focal Asymmetry with Architectural Distortion in left breast, ultrasound was unremarkable, biopsy recommended. I was terrified, I have read EVERY LAST THING about AD and it was looking pretty bad. I asked a question on a \"medical\" forum, \"ask the expert\". I told them what my report read, their answer the term \"architectural distortion\" is a worrisome term, and it seems VERY likely I have an area of irregularity. Google irregular, and tons more info on irregular findings = cancer. I just wanted to give you all HOPE, I was you until today, worried stiff, I couldn't move, until they called today and gave me the results, BENIGN ABSOLUTELY ZERO wrong, they found nothing, dense breast tissue. I had read that when you get sited with AD the chances of malignancy are 3/4, 75 percent. I know it is hard, I was online 24/7, but the truth is, radiologists OBVIOUSLY make mistakes too. I have to believe mine did, how can I go from AD to ABSOLUTELY ZERO. Anyway, I wanted to post to give you all hope, because many people come on here, leave there problem and then never update what happened. I am beyond HAPPY. Wishes all of you have benign results. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "31/08/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858352",
    "Title": "Birad4 Suspicious Malignancy, Architectural Distortion - B9 Noodi Noodi"
  }]
}