{
  "AuthorID": "Northern100",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152541/profile",
  "Posts": [
    {
      "AuthorID": "Northern100",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152541/profile",
      "Content": "Northern100 wrote: Hi Just a question I had a masectomy for 5cm of dcis and 5mm invasive grade 2/3. Oncotype is 20 I have done 4 rounds of dense dose ac and am on number 5 of 12 weekly taxol. Initially I felt lucky in the sense that was got so early I am forty and went for mammogram myself in my country would not be standard to go for mammogram at 40. Recently I feel very worried as I wonder if treatment is overkill for size of tumour and I also fear getting leukemia down the line from the treAtment. Oncologist did not give me a choice just said taking an agressive approach. He did say scans would not have been clear if I had not had mammogram . Family etc just feel your prognosis is good do the treatment and you be finished with it . Just I can't feel like that. Just wondering if anyone had similar oncotype or tumour size and what their treatment plan . Thank you so much for reading my post. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/793589",
      "Title": "Treatment for small tumour Northern100 peggy_j"
    },
    {
      "AuthorID": "Northern100",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152541/profile",
      "Content": "Northern100 wrote: Hello I am new to this board. My tumour has just been sent away for above test , I do not live in the states and this test is only available in our country I. The last few months . I am just checking how accurate is this test and is it safe to skip chemo based on low score. My tumour is very small 5cm dcis and 5mm invasive grade 3 node negative lymphvascular invasion nil . I am forthy with 4small kids and my mother had breast cancer T age 59 10years ago and had no recurrence. I just want to make sure this never comes back as I have seen people go from dcis /stage 1 to stage 4 . I had a masectomy and have been told to take tamoxifen for 5 years. Thank you so much for reading. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/788007",
      "Title": "Oncotype test Northern100 HealingDreams"
    }
  ]
}