{
  "AuthorID": "notready4this32",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169699/profile",
  "Posts": [
    {
      "AuthorID": "notready4this32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169699/profile",
      "Content": "notready4this32 wrote: New to these discussions, posted one a while back, before I had a core needle biopsy, however I cannot find it.  So here is a little info.  Dr. found a spiculated mass 2.2x2cm on an mri.  So that is when I had a core needle biopsy.  Dr called with my results, and told me it was sclerosing adenosis.  Good news.  She asked me if I wanted it removed and I said no, because she said there was no chance of it becomming cancer.  She did say that it would possibly grow, and become painful, so I told her if that happened, I would have it removed then.  After a couple of weeks of pondering, and talking with my husband and mom, I decided that I at least talk to a breast dr, to see about having it removed.  So I went to see a breast surgeon.  They called me and asked me to come in early, for more pics.  (they had gotten all my mamos, u/s pics and mri scans) from my dr, however they wanted to look at it further.  So I went in, had a series of mamos, went and had lunch, came back for an ultrasound.  The tech took some pics, and went to talk to the radiology drs.  Then the tech came back with 2 radiology drs who proceded to do more with the ultrasound.  One dr did the machine, while the other dr, explained to me why they do not believe it is sclerosing, and that they believe my biopsy to be wrong.  Weather they took the wrong tissue, or pathology read wrong.  After all this went and spoke to the breast surgeon.  She too agreed that this was not sclerosing, and she thinks it is a stage 1 cancer.  (Oh how I hope they are wrong.)  I go in on Tuesday for excisional biopsy, and central duct excision.  So I guess my ? is has anyone else been \"misdiagnosed\".  I understand that sclerosing is very hard to decifer from bc. Dx 3/2013, LCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801504",
      "Title": "misdiagnosed? how comon is it? notready4this32 lago"
    },
    {
      "AuthorID": "notready4this32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169699/profile",
      "Content": "notready4this32 wrote: I have never posted on a blog befor.  I have read through some of the threads here, and was thinking maybe this could help calm my nerves.  I am a 32 year old mother of 2 boys, (4 and 6) and my story is alot like most.  In June I had a mamo because I found a lump in my right breast, and since I have never had one they did a baseline as well.  All was good after mamo, they also did an ultrasound because I have dense tissue.  They saw nothing suspicous.  Then the end of Oct early Nov, I noticed I had discharge from my left nipple.  The only thing I could think is am I pregnant.  No that was not the case.  So I mentioned this to my dr at my sons apt, and she said I should have another mamo, so I did. (end of Dec)  Mamo did not show anything as suspected however this time the ultrasound showed I had an enlarged duct.  Dr told me it could be hormonal or something else, so she wanted me to have an MRI.  Since that is an expensive test we decided to wait abit and see if it stopped.  Early Jan. I went in for my yearly pap, and during breast exam Dr. said the \"spot, duct\" felt bigger, so we went ahead and scheduled MRI with dye.  I had that done Jan 28th, and a few days latter my Dr called and said they found a 2x2 cm spiculated mass, that \"lit\" up on image. I am so scared that this is cancer.  She told me it is a very big possibility.  Also asked me where I would like to see an oncologist, etc.  Pretty much told me what to expect if it truley is cancer.  So now tom is my ultrasound guided biopsy.  The waiting is the hardest part. I guess I was just wondering is there any similar stories that turned out not to be cancer?  I'm hoping that is the case here.  Also any women in thier early 30's that have been diagnosed?  I have also read that most premeno women would more than likley have to do chemo,.  My Dr. only mentioned lumpectomy and radiation.  She also stated that a couple of her younger patients had to have chemo as well.  Thanks ladies for listening.  Have only told my husband, and a couple other family members.  So just typing this out makes me feel a little better. Dx 3/2013, LCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800065",
      "Title": "Biopsy Tomorrow and I'm scared notready4this32 Sallyann"
    }
  ]
}