{
  "AuthorID": "notsure",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103996/profile",
  "Posts": [
    {
      "AuthorID": "notsure",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103996/profile",
      "Content": "notsure wrote: I had a biopsy in early August and have a meeting tomorrow with someone for 2nd opinion.  They call today and tell me they need another magnified mammogram and want me in in the am.  That is not possible based on daycare commute etc.  Why do they need more mammos?  I did the biopsy and had additional films taken. Do doctors require they do there own testing or is this really necessary?  How do I find out?   I just think they are trying to make more money.  There is no way possible I do not need surgery.  This pricess is so so frustrating.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756023",
      "Title": "are they trying to make more money? notsure dlb823"
    },
    {
      "AuthorID": "notsure",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103996/profile",
      "Content": "notsure wrote: I am taking a flight in two weeks, and that will be two months after surgery.  I had a double masectomy with reconstruction.  Is there any place to find facts on how soon after surgery flying impacts the chances of you having Lymphedema?  I am planning to wear the sleeve and glove, flight is about 2 hours Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/759625",
      "Title": "First Flight notsure gillyone"
    },
    {
      "AuthorID": "notsure",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103996/profile",
      "Content": "notsure wrote: I have seen details and can not find them.  how do I get to the picture forum? Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/755414",
      "Title": "Picture forum notsure MistyJ"
    },
    {
      "AuthorID": "notsure",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103996/profile",
      "Content": "notsure wrote: Meeting with surgeon tomorrow to discuss a mastectomy.  I have been diagnosed with DCIS - since there are few areas in left breast surgeon said I would be disfigured and only mastsectomy is option.   Need to know what to ask about for the surgery?  Where did you learn the most before meeting with dr?  What types are there?  Benefits of them?  Reconstruction sounds tough and can not imagine not having it? When will I be back to myself again?  Keep thinking by Christmas will I smile again?  I know life will never be the same, want to close my eyes and let this all end and be a few months ahead of here. How did you find a support group? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/755321",
      "Title": "Need to have surgery - help notsure calamtykel"
    },
    {
      "AuthorID": "notsure",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103996/profile",
      "Content": "notsure wrote: Need some help understanding if you have a masectomy why do you have drains?  How long do you have them?  What is the typical time to be somewhat back to your normal self after surgery?  Assuming reconstruction makes everything more difficult Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754808",
      "Title": "Drains notsure Gabrielledr"
    },
    {
      "AuthorID": "notsure",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103996/profile",
      "Content": "notsure wrote: Finally heard from surgeon after 2nd review of films.  1st radiologist recommended a biopsy.  Surgeon concerned about 2 areas of calcifications.  Now they say I have four and two need a biopsy.  Surgeon did say would be very difficult to do lump surgery and it would most likely be a masectomy.  I am freaking out now.  I call tomorrow to schedule the biopsy and additional mamo pictures of the other two areas.  May sound crazy I like my boobs and do not want to get rid of them.  I sometimes have a strange pain in the once with issues and now I keep thinking the cancer is growing.  I can barely breathe.  Any questions to ask before scheduling the biopsy other than sooner than later, this wait is making me nuts.  I just do not understand why this is all happening Thanks for reading Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754807",
      "Title": "Really worried now notsure rogue01"
    }
  ]
}