{
  "AuthorID": "nrsteph",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
  "Posts": [
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jul 19, 2016 05:42PM nrsteph wrote: I am so sorry to hear your news but so glad you found this site. I am new too and have found great comfort in these boards. The first month was really hard for me, I cried every morning as I became conscience and had to relearn that I was stage 4 again. I don't think I will enjoy the movie Groundhog Day ever again having lived it. I asked for a mood stabilizer to stop the tearfulness and frantically got all my affairs in order and then I had to tell myself that I am not dying today so I need to live! It is really scary in the beginning but I hope you will have your ah ha moment soon. Reading these boards and posting will help! Ask anything and everyone will respond!",
      "MessageIndex": 2,
      "PostDate": "19/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846124",
      "Title": "I'm new. Antonietta1647 Laflint"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Aug 3, 2016 10:27AM - edited Aug 4, 2016 09:53AM by nrsteph Hello! 4/13/16 - Stage IV mets to liver and bone. De Novo",
      "MessageIndex": 149,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Sep 2, 2016 01:07PM nrsteph wrote: Thank you Bestbird for the quick response! I have been reading away! I now have so many questions for my onc. Very informative! I especially appreciate the concerted effort to include info for TNBC! I read a post from a stage 0 doesn't even need chemo person and she made TNBC sound like the worst thing in the world...so it was nice reading that it is being worked on from many different angles! THANK YOU!!!!",
      "MessageIndex": 54,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831507",
      "Title": "Request a Free MBC Guide about Treatments, SE's, and more...\" Bestbird SandiBeach57"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 24, 2016 05:02PM nrsteph wrote: Rosieo- thank you for sharing how you are feeling. It really sucks to be aware of your face with pain. I am wondering what you have growing in your garden and I hope you feel up to getting out there soon! Minxie- I am sorry for your recurrence but on the other hand I am glad you made it 7 1/2 years. Everything I have read says that Triple Negative comes back. With this knowledge, my mother and I have decided to live in denial because nothing bad ever happens there;) My onc, said with triple negative it is about getting as much mileage out of each drug as possible but there is ssome new research happening specifically for TN. Sorry I don't have much information but thank you for joining this board. I hope you go much longer without recurrence after this bump in the road. Your post gives me hope! ",
      "MessageIndex": 1625,
      "PostDate": "24/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jul 6, 2016 01:46PM nrsteph wrote: hydeskate- I hope the love affair with NED continues! If I could I would trade you 8-9 hours of sleep for awake time as I am not sleeping at all so I just got some melatonin....fingers crossed I will get back all the lost hours of sleep and you can have the waking hours! I too am encouraged to read about those of you that have reached NED status...KEEP POSTING PLEASE!!!! I like all the positive posts as I am new or maybe naively hoping that there is a lot more hope than the statistics suggest! I live in a wonderful land called denial and kinda refuse to step out into reality because I don't feel like I have cancer, I feel perfectly healthy. I keep trying to find the bright side in everything, for example I am going on three weeks with little to no ability to taste but this makes me feel like my carrot juice, beet juice, and pea protien powder should all go down a lot easier now....see a bright side my body gets all nutrients, digestive system gets a break, and I don't have to taste it!!!! #Brightside I hope everyone had a great holiday weekend and gets back to posting regularly! Now back to making chili per my 6 year olds request, I guess she doesn't understand that no one wants to eat chili qhen it is 80 degrees outside but it is her favorite...what I won't do to please her;)",
      "MessageIndex": 1640,
      "PostDate": "06/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jul 14, 2016 06:07PM nrsteph wrote: Kaayborg- It amazes me what we can't do anything about. I have never been told this so many times as since my diagnosis. I have a 6 year old daughter, 4 year old son, and a 2 year old son. So prior to being diagnosed I have been pregnant or nursing for the past 7 years. I had to stop nursing my then 21 month old due to this diagnosis. They really keep me busy! You have three also, right?",
      "MessageIndex": 1656,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Aug 2, 2016 03:36PM nrsteph wrote: Sherriw- I hope your scan is good. I will be happy to hear all about it! Donnadd- You will live your port! Texas- So happy your scan shows stable and shrinking! I will be looking forward to hearing all about your cruise, the commercials look amazing! Enjoy! Kaayborg- my daughter starts first grade in three weeks, where has the summer gone? In general- while scheduling my next appointment the lady said she has a friend who is going on ten years after her stage 4 triple negative diagnosis. She said she oly has yearly check ups now...I asked her to see if she would be willing to talk with me because this was so encouraging!",
      "MessageIndex": 1698,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Sep 1, 2016 02:14PM nrsteph wrote: Barb - I am so sorry for your experience.  I recently read an awful post by a stage 0 TNBC and it bounced me right out of denial land (where I live happily) and into a horrible state, I understand.  I hope you still feel comfortable going there but always remember that you are interviewing your care team and if one doesn't work there are others.  I am so glad you have a husband who will not stand for this.  They are coming up with new things all the time, just hold on!  Upon reading that horrible post I requested the MBC guide from Bestbird and began to read, all the information in there made me feel a little better knowing that smarter people than me are working on this and now I am back in denial land, come and visit the water is warm!!!  I recommend the MBC guide that Bestbird has put together because it is just so full of information and knowledge is power!  Let us know how it goes!",
      "MessageIndex": 1749,
      "PostDate": "01/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Sep 17, 2016 05:18PM nrsteph wrote: http://dfw.cbslocal.com/2016/09/14/unt-researchers... A wonderful member Cathytoo shared this...good news!  Donadd aren't you in Israel?  Please read and let me know what you think!",
      "MessageIndex": 1773,
      "PostDate": "17/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 13, 2016 08:18PM nrsteph wrote: I really wish I had something to tell you but I don't . I am so sorry. Please let us know what the onc. says we are here for you!!!",
      "MessageIndex": 1817,
      "PostDate": "13/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Dec 6, 2016 03:20PM nrsteph wrote: We will take the small ssuccess!!!! I am happy you got hopeful news today. Also glad you are sounding more yourself!!! Fierce!",
      "MessageIndex": 1920,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 11, 2017 07:58PM nrsteph wrote: Rhys- I found the guidebook written by Bestbird helpful. It helped me to formulate some questions and gave me a heads up for symptoms to look for as TN. Just look her up and she will e-mail you a copy to review. She is pretty active on this site, she is not act Dr. just a fellow roller coaster rider who as done a lot of research. I glad you found us, THE Women On This Thread ARE MY lifeline.",
      "MessageIndex": 1967,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 12, 2017 10:14AM nrsteph wrote: rhys- stick around and ask anything you want here....I usually ask here first and I just get everyones input and it helps me to fine tune what my question really is! ♡♡♡",
      "MessageIndex": 1971,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 18, 2017 07:30PM nrsteph wrote: Sister- Hang in there!  Good news you don't have to count calories!!! Eat what you can and try not to get too stressed out.  Best of luck, hugs!!!!",
      "MessageIndex": 1977,
      "PostDate": "18/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jul 13, 2016 07:49PM nrsteph wrote: Awwww Kaayborg I am so sorry. As if having cancer isn't bad enough...allergic reactions and low white counts. Does this mean you are closer to moving to the immunotherapy? I am new to this stage 4 thing but are you taking any vitamins, probiotics, or drinking fresh juices? I am sorry if these questions are insensitive I am just reading a book by a geologist who developed breast cancer and she went on a search to find the cause vs. the cure. Any way she suggests some immune system boosters. Again sorry I am new and I am sure you have researched everything. I take vitamin A, B, C, D, calcium, selenium, daily probiotic, melatonin to sleep, oh and a daily allergy pill for my extreme sun sensitivity. I am a natural redhead with very pale skin so the sun and I are not friends! My white count has been going up I don't know if the vitamins have anything to do with it or not but maybe worth a shot. I hope things get better for you soon! Josie1 - did you make the trial? Donnadd- I do chemo every week, taxol. I think you may need a second opinion or personality. My first onc, said my prognosis was not good and that I would die from this. My second onc said She isn't afraid of having difficult conversations but that she didn't see a need until the time comes, she was very encouraging about the world of reasearch going on right now for TNBC. I felt more hopeful leaving her office that the first onc i met with.  Sherriew- welcome I am sorry you are here. However, so far this thread has gotten me through the initial emotions associated with this diagnosis, Texas Rose and Kaayborg especially! I am glad for all the new comers and everyone who posts regularly. I log in several times a day everyday and get very bummed out when there is nothing new to read. I hope this thread is as beneficial to your sanity as it has been for mine! In general I am a hot mess. I try and stay as positive as possible because I feel like it would be really easy to stay in the dark. But I have three small children and I refuse to die everyday. I am not dying today so I need to live and be the very best I can be. I have had days that I could barely take a shower and just walked out wrapped myself in a towel and laid down in my closet and cried. I think I really worry my husband on those days. I cling to this one board for hope everyday. But everyday we are posting is another day we are living so thank you for eveeyone who posts you are my light.",
      "MessageIndex": 1654,
      "PostDate": "13/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jul 28, 2016 09:49PM nrsteph wrote: Hello EVERYONE, I know I have been missed but I see the board has been busy without me! I also recommend a port! So now, back to me I had a PET scan at Mayo on Monday...No lights!!!!! I don't know what this means really but am thrilled and was called an \"extraordinary responder.\"  I don't think this is a technical term but I have never been extraordinary in anything so I am milking this all for what it is worth.  Prior to my scan on Monday I had 10 low dose taxol infusions.  My initial PET scan, I say, lit up like a Christmas tree....lights in the breast, lymph nodes, approx. 20 small lights in my liver, mammory gland behind the sternum, iliac (sp?) bone, and collar bone (this was found to be a benign giant cell tumor).  This scan, all the lights are out and the benign tumor in my collar bone was very dim!  I look like a normal person...well at least a person without cancer.  I am very excited about this but also feel naïve. I couldn't really get the doctor to tell me what this means, she just said we can move to maintance chemo - three weeks on and one week off for three months until my next PET.  Does anyone else know what this means with regards to recurrence, overall survival, ect.????? So odd, this scan made me so happy and it was so crazy to see when I had been expecting to see \"lights,\" and now I just want to know what it means... Sorry this post is really all about me!  I will start checking in five times a day and growling at you ladies for not posting your every thought again!  Thank you in advance for any ideas as to what this...\"now you see me now you don't\" game my cancer is playing on me!   ",
      "MessageIndex": 1691,
      "PostDate": "28/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Sep 2, 2016 12:58PM nrsteph wrote: kaayborg- is your current treatment still working? Are you just planning the next step ( I know you said you like to do that)!? I saw on another thread that you were training for a big run, how's that going? I hope you have a good class this year so far. My oldest just started 1st grade after going to a Montessori school for the past three years. She is frustrated that she has to write letters...she has been a proficient reader since four. I think she is just sad she hasn't really made a best friend yet...ah first grade woes! I hope they get on this TN things so I can live to see her graduate college!!!!!",
      "MessageIndex": 1751,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Sep 28, 2016 11:49AM nrsteph wrote: my thoughts are with you! You are right you can't give up....second or third opinion??? You just keep posting! And taking care of your girls! Sending you hugs!!!!",
      "MessageIndex": 1786,
      "PostDate": "28/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Sep 30, 2016 05:37PM nrsteph wrote: not a remote chance...the liver has amazing abilities to regenerate! Don't go quietly...kick and scream!",
      "MessageIndex": 1792,
      "PostDate": "30/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 2, 2016 02:00PM nrsteph wrote: THIS IS GREAT NEWS Sherri!!!! Awww two months with blinders on, I am totally jealous!!! ENJOY!",
      "MessageIndex": 1855,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 2, 2016 02:08PM nrsteph wrote: http://www.newstalk.com/Irish-research-teams-make-potential-breakthrough-on-breast-cancer-treatment Thoughts??",
      "MessageIndex": 1856,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 2, 2016 08:02PM nrsteph wrote: Texas- You will rock it! No worries! You ladies are so much more patient than me...I refuse PET where I get chemo drive 3 hours so that I can have PET and results all in same day! Plus it is really the only way to corner my husband into doing paperwork!!! See a silver lining...maybe my dark cloud is passing, I am starting to make myself laugh...Don't worry I am used to it just being me!!;)",
      "MessageIndex": 1861,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 11, 2016 04:03PM nrsteph wrote: Texas- one year on one chemo is amazing, I hope you have Kaay's luck on next line. Thank you for sharing you sound so much better than I did when I got my news...I will try to hhandle the next one with your class! Enjoy the patio...starting to get cold here 50 during day 28 at night! Winter might come...",
      "MessageIndex": 1885,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Dec 22, 2016 02:20PM nrsteph wrote: 4ever- I will be thinking of you. Hopefully it is your mind worrying and not cancer. I wish you just need to sleep with a pillow between your knees when you sleep-HOPE HOPE HOPE, thinking of you!!",
      "MessageIndex": 1932,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Feb 19, 2017 12:08PM nrsteph wrote: Hi ladies! I am sorry to have stayed away for so long but as I have mentioned before I live in denial land and the loss of sister sister was too much.  I had first cycle (day 1 and 2 and 9).  Managed well. Went back and counts were too low so I go back tomorrow as I had my blood tested locally on Friday and were well above where they need to be.  So to MN tomorrow until Tuesday and then Thursday I leave with DH and two oldest kiddos to FL.  My brain keeps trying to get me to move out of denial land but I am digging in my heels.  I like denial land, nothing bad ever happens there.  I will enjoy the trip and seeing my kiddos on a plane for the first time is making me super excited. Then back to reality M - swim lessons, T- Gymnastics, W - swim lessons, TH - gymnastics and tae kwan do, F - grandma's house, S - gymnastics, S- NOTHING!!!!!!!  I wouldn't trade it for the world! ",
      "MessageIndex": 2030,
      "PostDate": "19/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 1, 2016 05:06PM nrsteph wrote: Hello, I am 34 and was diagnosed April 13th with stage lV TNBC metastatic i lymp nodes, liver, and bone. I have three children 6, 4, and 23 months. Everything I have read doesn't lend itself to being hopeful. Oncologists at Mayo says just low dose taxol for now...don't know enough to know if this is the right thing to do. Locol oncologists would have started me on taxol and carb. Just reaching out to other stage lV TNBC lifers for community support.",
      "MessageIndex": 1570,
      "PostDate": "01/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 30, 2016 01:39PM nrsteph wrote: minxie- I am very happy to hear that you are NED! I know of a woman here who documents her journey on Go Fund Me and has raised over 20k. www.gofundme.com/lindsaysjourney. I say go for it! Also, at the hospital I go to for my chemo I was encouraged to fill out a form for assistance...the administrator said they are a non profit hospital so they have to give so much money back to the patients. I would also contact the American Cancer Society I don't know what they have specifically but they offered information on financial assistance when I called for the Reach To Recovery program. I don't know if any of this will help but I wish you the very best and am so haapy to hear about NED!",
      "MessageIndex": 1635,
      "PostDate": "30/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 2, 2016 10:52AM nrsteph wrote: Thank you so much! I need a community at this point... I am starting to lose my hair, not a big deal to me I look good in hats but for my children it is hard.  I called MD Anderson yesterday because I read about their TN moon shot program.  However, I was told by a very rude young man that MD Anderson would not provide a 2nd opinion while undergoing treatment and would only see me if my next PET was showing no response to treatment.  The young man stated that they didn't have any oncologists that specialized or studied TN....so confused because it is one of the first things that comes up on google search.  My most pressing questions now are...have any of you had tumors become resistant to treatment, and have any of you changed your diet? Again, thank you so much for the support!  KAAYBORG - HAPPY BIRTHDAY TO YOU!",
      "MessageIndex": 1577,
      "PostDate": "02/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jul 19, 2016 07:24PM nrsteph wrote: kaayborg got chemo kaayborg got chemo...happy dance happy dance!!!! I am sorry it took so long but glad you got a full dose! Bout Time Lady!!!! Very happy for you!",
      "MessageIndex": 1671,
      "PostDate": "19/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 16, 2016 02:57PM nrsteph wrote: Just chuckling because of the \"creeping\" and \"lurking\" comments! I did the same thing for awhile before I joined in! So a funny story, I am tolerating taxol well. I always tell everyone that I am a perfectly healthy 34 year old woman and minus the hair loss you would never know I am sick. So it has been storming here lately and my garage floor was wet and I was wearing flip flops per my usual wardrobe. I picked up my two year old and BAM!!!!! Legs straight in the air, I curled my upper body to protect my little one which wasn't hurt. So now on a heating pad nursing my sore tail bone...I have a small met in my illiac (sp) bone so small that the bone scan didn't pick it up only showed on the PET...fingers crossed my next scan end of July can detect the cancer vs. my sore tail bone!!! Atleast now I have something to complain about!! Hope all are well if you need a chuckle just think of me and my bruised ego I mean tail bone!",
      "MessageIndex": 1609,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 21, 2016 11:33AM nrsteph wrote:  Well Well Well, I thought everyone disappeared.  I have switched to an aluminum free deodorant and didn't know if everyone was passed out ;)  I am glad to know it was due to Kaay planning a trip to Flordia which I think will do your platelets well!  Have fun and forget about the cancer!!!!!  I entered my \"I refuse to die\" comment in the settings section next to the line labeled signature...just push edit and add a way!  I put \"I refuse to die\" so everyone would automatically know that I am a very Irish/German stubborn redhead, well when I had hair, I can't wait to see what you sign! Again, have fun in Flordia and watch out for the crocs, the horrible shoes of course! Barb, I have been on weekly taxol for 6 weeks and my onc says it is working great. My primary tumor, which won't be removed due to my Stage 4 out of the gate diagnosis has shrunk from 7.1 to 5.4 in just 6 weeks so I am hoping that my small liver mets, and one bone met are shrinking too, well really I hope they go away and never come back!  Good Luck Friday, I hope you will check back in to let me know how it goes! As for lurkers and regular posters, please don't stay away too long, this whole 1/2 a week with no posts is just more than my heart can handle.  You are my people and I check in regularly, like daily, to see what you are doing and feeling.  I need you all, so please join in.  My local hospital put me in touch with a stage 1 Triple Negative gal but it is really hard for me to talk with her because I don't want to burst her \"this will just be a long year\" bubble.  Everything I read says the recurrence rate of Triple Negative in five years is huge so I mostly let her tell me about everything she is doing and I cheer her on!  The hospital also connected me with a stage 4 gal with hormone receptor positive and she is great but she gets to take a pill for treatment until a recurrence happens.  Even if it isn't about cancer I would like to hear from you all!  And, if it is my deodorant let me know and I will switch!  Hope to hear from you soon...I feel like Meg Ryan in You've Got Mail! ",
      "MessageIndex": 1613,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 21, 2016 06:33PM nrsteph wrote: I knew we would get along Kaay! I watch you've got mail every chance I get. My husband thinks I am crazy I put in DVD s to clean the house instead of radio! I am sorry about your reaction...but glad you weren't able to panic. I hope your 7 year old wasn't frightened! Glad you were able to sleep it all off...if it is any consolation I have had hives everyday since my 6 year old was born...no rhyme no reason but they stop itching a lot onceI got used to them. Motherhood aint it great!!!!!! Enjoy your trip!!!",
      "MessageIndex": 1615,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 28, 2016 01:53PM nrsteph wrote: texasrose - congratulations on your plunge into retirement! You will be so happy sleeping in and eventually waking up whenever you want. I hope you live some extra for me too so that I can live vicariously through you and your joy. You are now my spirit animal and I DEMAND you share all the fun you have on your travels! I have three small children and my husband and I run two companies so I need to hear stories of how others live because other than being a chauffeur, cook, housecleaner, accountant, scheduler, potty trainer, ect., ect., ect., I of course mean loving wife and mother;) I don't get out much!!!! So share away lady! I am also glad to hear you feel just as good as you did when you were diagnosed. I am only a few months in but I keep telling everyone that I am perfectly healthy and minus the hair loss and very few joint pain days you would never know I was sick...that is my mantra! I am so happy for you and wish you the very best! As for PDL1 Mayo had like 24 spots available for first line immunotherapy treatment trial. I was the 8th person they tested and only had 3 at that time that qualified and only two were still in trial. I would like to know more about the immunotherapy option Kaayborg has mentioned as secondline traetment so I can ask my primary onc in July! It just seems like I hear more PDL1 negatives vs positives.....what do our tumors have? So in general I do not take medicine...I just never think \"oh, I have some snot running down the back of my throat, I will just take some allergy meds to dry myself up.\" But now, I take zoloft so I don't cry as easily in front of my kiddos, vitamin C, D, calcium, curcumin, probiotic, zantax for my slight allergic reaction to Taxol it is a rash on my forearms that seems to get worse in the sun. I also was told by the oncology dietitian that since I have switched to a mostly plant based diet I need 100 grams of protien a day which is HARD. I drink a daily kombucha and cook my quionoa and other grains on bone broth. AND I juice some stuff a few times a week Carrot juice and Beet juice are so gross but now that I have lost my ability to taste most things those should get easier to swallow! Always looking for the bright side! I am just spewing this out here to fish for anything anyone else is doing. I want to drink essiac tea but primary onc said not to but couldn't remember what exactly she had just read about it. I found a study that said essiac tea could spread breast cancet but I thinkthat was for estrogen positive breast cancer. ..but I don't have estrogen receptors so again considering essiac tea, anyone have any thoughts. I have also got frankincense, I have been told to rub on skin where tumors are and to take orally with leadum three times daily. They are doing a lot of reasearch in the middle east with resin of frankincense and having seeming luck but essential oil does not contain the resin from what I understand, any thoughts? Ok, are your eyes tired from reading this exccessively long post? Sorry typing diarrhea ;) Enjoy the day!!!",
      "MessageIndex": 1632,
      "PostDate": "28/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Sep 4, 2016 02:12PM nrsteph wrote: donna- I can understand your reluctance to tell others. I was amazed by the support my family and I have received since telling. It is clear that not everyone understands what this means sinve they say things like \"you're strong you will beat this.\" I just say that I am going to do my best...my close friends understand as they have gone to appts with me. We have received one meal a week since I let others know in May and have had three benefits since then. The support has been humbling and amazing. I credit my last scan to the kindness I have received. Don't under estimate the power of support! I can't imagine how hard it has been for you to keep this all inside...whatever and however you choose to share know you are not alone, we understand and are here for you!",
      "MessageIndex": 1756,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 4, 2016 06:06PM nrsteph wrote: so I have the name, number, and email address of the researcher from university of northern Texas. ...I thought I would email some questions...I live mostly in denial and refuse to think about what having this means intelligently so I have a few questions but if you all have any I will gladly include them in my email. I posted the link a few posts ago if anyone wants to review. Let me know!!!!! Waiting to hear from donnadd about her meeting with this researchers counterparts in Israel. ..HOPE",
      "MessageIndex": 1797,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 9, 2016 07:46PM nrsteph wrote: kaayborg I am so happy for you! Way you go, you tell those counts to stay up! You are doing it...I think you can I think you can!!!  Texas- I am so glad you had a great time and really happy to hear that you booked the next one! Donna- so glad thE money was worth it let us know how it goes. This week has been rough I have my next scan end of oct. And all I can think is that my lump feels fuller my breast feels like someone hit me and I feel like my nipple looks swollen...I hope this is my mind playing tricks on me....fingers crossed !!   ",
      "MessageIndex": 1810,
      "PostDate": "09/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 11, 2016 10:19AM nrsteph wrote: whew...radiologist says all is well! She says she doesn't know why breast is swelling or sore because everything looks good...I will feel so much better after PET in two weeks! Thank you for the well wishes! Kaay- so smart to have labs the day before! Has anyone eelse gone off steroids and benodryl?",
      "MessageIndex": 1814,
      "PostDate": "11/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 28, 2016 10:11AM nrsteph wrote: Broken...recurrence...only got 4 months out of taxol... After 10 taxol infusions my PET was clear. A month ago on my week off from chemo my right breast (the culprit) began to swell, the lump got fuller, my areola was swollen. The next week I had my regular appt. onc. Ordered mammo and ultrasound. ..onc and radiologist said mass compressed and tumors don't compress...I felt better so I opted to wait two weeks for my scheduled PET..the PET was yesterday...taxol stopped working for me after 4 months...I am so upset bbecause I tolerated taxol sooooo well. I am going to go on doxil next. I feel broken and don't know what to do...anyone know anything about doxil? Boards to point me to? Anything? Broken...I feel like my life is too good to be true. I have a wonderful husband who loves me despite myself, three beautiful children, and a wonderful community. ..I am lucky in so many ways but this just feels really unfair (to quote my 6 year old). I hate this but I just keep thinking, having been a social worker and seeing first hand the sadness and damage some people can inflict upon their children and they get to live...my children and husband are everything to me and everything I do is for them and they get cheated...I know that sounds horrible but it is how I feel in this moment. I try to stay positive but I just can't right now with hot tears streaming down my face I feel so alone and broken. I hate that there is no one to talk to here instead I have to type this and hope someone somewhere will respond with something other than...\"I'm sorry.\" I apologize for the rant I just don't know what to do...thanks for reading.",
      "MessageIndex": 1841,
      "PostDate": "28/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 31, 2016 03:08PM nrsteph wrote: donnadd- how was the scan?",
      "MessageIndex": 1846,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 1, 2016 02:54PM nrsteph wrote: Donna- it is so hard when you know what your body is telling you but you have to wait for medical confirmation. I am thinking of you! Kaay- thank you for your kind words. I hope to get more mileage out of the next drug doxil...I don't see it listed on other profiles so I don't know what to think about it or what to ask. I was crying when she gave me the news so I only remember bits and pieces. I think she said she is giving me doxil so that I will qualify for a trial when it stops working... Anyone have thoughts or info regarding vitamin d3, metformin, and the copper depletion drug which I won't attempt to spell. I am going to email my onc tomorrow but just wondering if you ladies know anything about these therapies?",
      "MessageIndex": 1848,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Sep 28, 2016 09:45AM nrsteph wrote: barb I am so sorry...I don't know what to say but I am here for you. With a break will liver regenerate?",
      "MessageIndex": 1784,
      "PostDate": "28/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 3, 2016 05:04PM nrsteph wrote: Amber- Iit amazes me to no end how \"smart\" cancer is and that all the really smart folks can't get a grip on it. I was reading last night about how early detection has a 100 percent survival rate. I was floored because it just isn't true and some of us don't have the luxury of early detection. ..I was still nursing my youngest and had no idea. Quite the blindside to start at stage four...grrr. I understand recurrence is hard, I have been hiding from everyone since mine last week. I am glad you found this thread, it is my favorite. ..everyone is very supportive! Hope to hear from you soon!",
      "MessageIndex": 1863,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 6, 2016 11:04AM nrsteph wrote: kaay- I think you captured our reality so eloquently. We cannot control our disease and our future or how that will impact our children; we can however, help high blood pressure by assisting withh lifestyle changes. What I wouldn't give up in order to reverse TNBC with less salt intake. I think it is hard for others to understand the desperate primal need to leave our children with atleast one able parent so that they will never have to endure another untimely loss. I take perhaps her lack of compassion or understanding of the true gravity of the situation as a credit to your grace in handling of this disease. You must handle it in a way that allows her to forget the reality we all face. I hope not to offend you with this comment, I really don't know what to say except I am on your side. You have always responded so kindly to my posts that I wanted to support you in kind!",
      "MessageIndex": 1878,
      "PostDate": "06/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 10, 2016 06:20PM nrsteph wrote: Thank you today was rough...ultra sound and mammo tomorrow 7:30 am. Fingers crossed!!",
      "MessageIndex": 1812,
      "PostDate": "10/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 16, 2016 05:11PM nrsteph wrote: I am so willing to meet anyone at the top of the empire state building (I watch too many old movies) anytime for an annual stage IV TN meeting of minds aka girls day or two!!! Doesn't have to be empire state building;)",
      "MessageIndex": 1897,
      "PostDate": "16/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 29, 2016 01:01PM nrsteph wrote: Donna- five children, you are an amazing woman.  I have three and am a crazy person most of the time!  I hate that you feel so alone but am so glad that you can express everything here.  I have read the fight in your posts and know that you are a strong and determined person who will not go gently into the night.  You have been a fierce poster and I know you will continue to fight.  Like you told me when I was typing and crying...we just have to hold on until they find something for us, it will happen in our lifetime!  I clung to those words and now that I know you have five children I appreciate the comfort all the more.  I know I have said this before but I signed up for a google alert for TNBC and almost everyday I read an article about the progress someone is making somewhere.  Doctors and really smart scientists are working on this around the world and making all sorts of progress.  The article I posted above, says they are looking for a trial to begin in late 2017 just a year away!!!!  I know that this may not be the magic TN bullet but it is progress and that is reason enough to hold on longer.  Donna, I can't even imagine how you must feel.  I know I look at my three babies and stroke their faces and it gives me strength to fight.  I know you don't like to talk about yourself to your friends and family but maybe a professional or a very trusted friend, someone you can physically reach out to may help take some stress off of you.  Stress is no good when you are trying to fight.  However you choose to handle this I will be with you 100%.  I am sorry for the delay in responding I took a break from checking in every 30 minutes over the Thanksgiving holiday.  Keep venting here, we are with you!",
      "MessageIndex": 1913,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 2, 2016 02:18PM nrsteph wrote: http://www.nature.com/nm/journal/vaop/ncurrent/full/nm.4213.html Thoughts???  sorry for the onslaught just researching alone is no fun!  What's new TN's?",
      "MessageIndex": 1857,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 5, 2016 03:46PM nrsteph wrote: So confused...onc is putting me on doxil because I have to have two failed lines before qualifying for a study (sounds like above) I will post link later... So odd how treatments for everyone are so different...same cancer but unique behavior and responses...oh the inconvenience!!! Watched Bad Mom's last night with neighborhood gals and tonight going to local bar to watch the Hawkeyes play Penn State. While the guys watch the game I will be defending my spoons title with the wives...wish me luck...there are more important things than cancer like AL WAYS being the spoons champion!!!!",
      "MessageIndex": 1873,
      "PostDate": "05/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 6, 2016 11:07AM nrsteph wrote: peacock- I hate that you are here but glad you reached out. I am hoping you will post often to let us know how the trial goes! ",
      "MessageIndex": 1879,
      "PostDate": "06/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Dec 1, 2016 02:35PM nrsteph wrote: DONNA- http://jewishbusinessnews.com/2016/11/30/israeli-research-reveals-new-combination-therapy-for-aggressive-triple-negative-breast-cancer/",
      "MessageIndex": 1915,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 4, 2017 11:39AM nrsteph wrote: Homehelp  - Thank you very much for the response.  I agree with getting confused especially because TNBC doesn't have any targeted treatment YET!  I hope your wife is tolerating the new treatment well!  Thank you for ALWAYS being so available, kind, and responsive. Josie - LOVE the dorry toss...they are good but breath is so yucky...however, the sentiment of a goooooey kiss is always welcome! Kaay - Thank you for the run down, knowing what to expect is half the battle for me and knowing that you had changes but are still seeing results is WONDERFUL to know. Texas - I am living vicariously through you so travel away and tell me all about it!  I have a friend who is very spontaneous and I AM NOT.  I AM A HUGE PLANNER and usually say \"no\" to anything I cannot see in my head as working out.  However, she said \"hey do you want to go to Flordia in Feburary.\"  My first instinct was to say no because just thinking about packing for me, my husband, and three children made me panic a little.  BUT, I said \"yes let me know when we are leaving.\"  Woo Hoo I am really living life by the seat of my pants...so Flordia here we come! Sister- I hope you are doing well and that the pain has subsided. Donna - Listen Lady!  Don't stay away too long, I think of you often and wonder how you are holding up! I met with GI and Derm yesterday at Mayo.  Had an endoscopy (sp?) and they found two ulcers at the base of my esophagus and the GI doctor said \"they look like they hurt and they are probably better than they were last week.\"  Yes, I can at least eat this week!  Did you know that when food feels like it is stuck in your throat it is actually stuck at the base of the esophagus?  See you learn something new everyday.  Derm said that I have hand and foot which is a common side effect of doxil however, they don't call it that anymore because chemo comes out of the skin everywhere hence MY ENTIRE BODY!  So I get to apply two strengths of steroid cream...I hope I develop some muscles:)  Give me two weeks and I will be challenging everyone to an arm wrestling contest!!!  To anyone I missed, I am putting off filing quarterlies and year end business tax forms to type this and am sad I cannot think of anything else to write.  Back to work with A&E Pride and Prejudice in the backround!",
      "MessageIndex": 1957,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Dec 16, 2016 11:54AM nrsteph wrote: Kaay- Great news!  You are so great an deserve more than 1.5 years more on carb!!!!  SHRINK SHRINK SHRINK!!!!",
      "MessageIndex": 1927,
      "PostDate": "16/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Dec 23, 2016 10:42PM nrsteph wrote: Happy Holidays! I am grateful for each and every one of you!!!",
      "MessageIndex": 1937,
      "PostDate": "23/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 1, 2017 05:33PM - edited Jan 1, 2017 05:37PM by nrsteph Homehelp- I was on doxil for two months and recent scan showed progression. Side effects of doxil are lingering just wondering if your wife had similar effects and if so how long to heal. My skin is very sensitive and is peeling anywhere there is friction underarms, between fingers, ect. Also issues with mouth and throat no sores almost like a sunburn in mouth and down throat...lost 10lbs in 12 days. I am going to have a scope put in my throat Tuesday because base of esophagus lit up on pet scan. Onc. said it is a wierd place for breast cancer to settle. She insisted that I return to mayo for the scope (3 hours from home). Anyway moving to gem/carbo on the 9th. I hope gem/carbo give me a little lasting response...fingers crossed!!! My mother (I am only 35) is encouraging/nagging in a loving way to visit the cancer treatment center in Chicago. ...anyone have any thoughts about this??? Love to hear your opinions. Also mother in law printed papers from johns hopkins. I hope we all make it through 2017 and continue to be suppotive of each other! Happy New Year! Last night my kiddos came home from New Years neighborhood party with my husband, so picture me tired mama in bed watching the discovery channel at 2 am...in comes my six year old to snuggle and breathing dorito breath in my face (yucky)...next my four year old climbs on top of me to snuggle...he is not very coordinated so he is stepping all over and falling he gives me a kiss and smells like Doritos too and he leaves wet Dorito dust on my lips (yucky)...finally with a fresh diaper my two year old piles on he wiggles between the other two as he always does he is kinda a brute. So he snuggles nose to nose with me and his face is COVERED in Dorito dust. He falls asleep breathing in to my face...he is a very particular person so I don't dare move until he is asleep. Amid the stench of their breath I just smiled because I will do everything I can to survive as long as I can so that I can continue to collect Dorito kisses.",
      "MessageIndex": 1949,
      "PostDate": "01/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 7, 2017 06:03PM nrsteph wrote: woo hoo! I am glad that you will be able to see her, I think she is great. Best of luck stilts let me know how it goes!",
      "MessageIndex": 1960,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jun 27, 2016 04:44PM nrsteph wrote: Ksmatthews- I agree 100% that 18-24 months is unacceptable. I am glad to hear that you want to live...that attitude helps! I was hoping to qualify for an immunotherapy trial but am PDL1 negative. My onc said that immunotherapy is the cutting edge for new drug options for breast cancer. I really feel a second opinion is important and that the onc does research for breast specific cancers. My first opinion was from a onc who treats all types of cancer and my second was at Mayo where my onc is involved in nationwide drug trials, publishes research often. She also teaches and travels the country learning about and educating medical students and onc about TNBC. I gained a much more positive attitude after obtaining my second opinion. I live about 3 1/2 hours from Mayo so I feel lucky that my Mayo onc and local onc are willing to work together. I am able to get my weekly Taxol in my home town and I just go to Mayo for testing and to meet with primary onc. Best of luck on your upcoming scans please let us know how they go! HopeFaith- I personally belive that slowly weening off heavy duty pain meds is a good idea, they are not good for lots of reasons but nither is extreme pain. Do what your body tells you. Pain is your bodies way of getting your attention and narcs blurr that message. Let me know how it goes! Just got home from a camping trip! Family is good for the spirit but I am happy to be back in my own bed...if only I could sleep;) Got genetic tests back...BRCA 1/2 negative. I have perfect genes no mutations or inconsistencies... I hope everyone has a great week!",
      "MessageIndex": 1630,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jul 11, 2016 06:12PM nrsteph wrote: thank you kaayborg! I will ask about this at my next appt. @ Mayo in two weeks!!! I am glad to hear you enjoyed your vacation, I hope the kiddos did too! My fingers are crossed for your high platelet count tomorrow. I am in tomorrow myself at 9:40 best of luck...I will be thinking of you until the benodryl kicks in and then I think I won't even know my name!",
      "MessageIndex": 1648,
      "PostDate": "11/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jul 14, 2016 07:04PM nrsteph wrote: Sherriw-I am glad you are getting started. For me, once I started my emotions were much more stable as I adapted to my new normal. I wish you the very best! I hope the bad taste doesn't last!",
      "MessageIndex": 1658,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Aug 26, 2016 06:33PM nrsteph wrote: Phgrahm- Welcome. Thank you for posting here. I hope you will post more. Hello ladies! I have been away for a little while....The hospital social worker has put a stage II gal in touch with me. I called and she didn't seem very interested in talking and I didn't want to throw myself at her. She said she is just worried about going through chemo (red devil?), surgery, radiation and having it come back. I didn't want to rain on her so I recommend this sight and perhaps another stage II can help her. I just remember meeting with the surgeon when first diagnosed before they did the staging PET...He said \"you won't die from this it is curable...you have an agressive form but we will treat it aggressively. ..this will be a tough year but you will live.\" I just feel bad the more I research the more it is clear thar triple negative comes back. Furthermore, it seems that cancer in general is not curable because people go a few years evenany years in some cases and it comes back. GRRRR. Any who...My daughter who is six started first grade this week and she asked her daddy to take off her training wheels...BIG WEEK! Going to an all day concert tomorrow woo hoo!!! Have a great weekend ladies!",
      "MessageIndex": 1737,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 25, 2016 01:06PM nrsteph wrote: minxie- I hope they get a plan of action for you soon. I find the stress less painful with a plan. Let us know, wee are here for you! Stressed put myself due to recent scare. Onc says the mass compressed in mammo machine and tumors don't compress. So now just waiting for PET on Thursday and meeting with primary onc. If memory serves me right I think most of us have scans coming up! Hopefully all are well this is the board I depend on!",
      "MessageIndex": 1837,
      "PostDate": "25/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Oct 26, 2016 02:17PM nrsteph wrote: Minxie I uunderstand completely. I am a visual thinker and I called my nodes my moldy fan...I just kept asking why don't we remove the fan...I got the same answer that it didn't matter...",
      "MessageIndex": 1840,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 1, 2016 06:47PM nrsteph wrote: Where did Purple Minion go?",
      "MessageIndex": 1849,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 2, 2016 11:30AM nrsteph wrote: This makes my heart sad.  I am with you Kaay...it amazes me the blinders I have put on myself so that I don't see what I know to be there.  Thank you Geeper for letting us know.",
      "MessageIndex": 1853,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 4, 2016 12:02AM nrsteph wrote: kaay- do you know the name of the immunotherapy you would go on next...I think you were PDL1-, like me?! Thanks!",
      "MessageIndex": 1867,
      "PostDate": "04/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 4, 2016 09:18AM nrsteph wrote: Thanks Kaay! Although I wish you continued luck with current line!",
      "MessageIndex": 1869,
      "PostDate": "04/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 14, 2016 03:10PM nrsteph wrote: So...can't stop crying. My local MO doesn't agree with Mayo onc. who specializes in breast cancer. Local mo says doxil is what she puts people on when there isn't anything else to do. I like them both very much but I don't know what I don't know so I have no idea what is going on...I know I need to ask more questions but which ones??? Just deflated...I have to see my babies grow... I know that no one wants to die but I really refuse to allow my 2,4, and 6 year old to grow up without me...in a dark place right now and could use some support...I signed up for google alert for TNBC so it is nice to read hopeful articles almost everyday...just don't know what to think, do, be. I was tired this weekend in couch for two days...feel like a horrible mom.",
      "MessageIndex": 1890,
      "PostDate": "14/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 16, 2016 08:55PM nrsteph wrote: Right back at ya Kaay! I think I could get anywhere for a couple hundred!",
      "MessageIndex": 1899,
      "PostDate": "16/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Nov 29, 2016 12:43PM nrsteph wrote: http://www.prnewswire.com/news-releases/immage-biotherapeutics-announces-positive-results-from-animal-studies-300368891.html ",
      "MessageIndex": 1912,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 6, 2017 02:27PM nrsteph wrote: Ok my people---- I just got a call from my onc. at Mayo.  She offered a study that is going to start perhaps on Monday at Mayo and I know the decision is mine and I have done a little research (although haven't found anything yet in ley terms)....I just want to pick your brains and see if you have heard about his if so, what have your heard, read, understood?  This is a phase 1 expansion cohort for cisplatin and ATR.  This would be in place of carbo/gem I was going to start on Monday.  I have agreed to be tested for this study (2 weeks no treatment), I have to be confirmed as BRACA - and positive for basal type (which TN usually is from what I understand), so we think I will qualify.  The study is enrolling 50 TN and already has 27.  Not to complain but this is one thing about cancer treatment that I really do not like.  I am the \"driver\" but I know nothing.  Who knows what the right choice is, NOT ME!  I feel like my six and two year olds, stomping my feet and saying \"I don't wanna.\"  My onc. is very nice and tells me the facts I feel.  She said I can switch to gem/carbo if the study doesn't slow progression or gem/narablem (not spelling correctly) but who knows.  I think I will try the study because it gives me one more line of treatment to try...my local onc. voice is in my head saying \"we are not being aggressive enough.\"  I don't know if I shared earlier but my local onc. is not too happy with Mayo onc. choices and expressed those to me...I really wish she hadn't done that but I understand that she wants what she feels is best for me too!  Local onc. is a general medical onc. not a breast specific onc. like my gal at Mayo so I say the Mayo onc is driving the bus.  Arg, what to do?!?!?!?! Oh, also I called Weill Cornell in New York this morning about the Copper Depletion trial they have been running for years.  They are going to open to new participants in the spring so the lady said to call her back in late April.  At which point we will know my current status.  She said much to my shock that they have TN women who are being treated with this daily oral pill that depletes excess copper from the body which may prevent mets from forming so in April to qualify I will need to have stable disease, among other things, and not be on chemo....Does this sound weird to anyone else.  I asked to clarify and said \"so you have women taking this pill who have stage 4 stable mets/tumors and ARE NOT on chemo.\"  She said \"yes, we are testing the copper depletion drug without combination chemo.\"  WHATTTTT?  So I asked Mayo onc. to look into the research so that if this becomes an option we know everything we need to know.  Again, WHO KNOWS...but it is an adrenalin rush to feel like we have options to consider!!!! Thank you for reading this adrenalin filled rant, my husband is in meetings all day and my mom is at work and no way I am calling my mother in law until I have all the facts so I just had to talk about this and I guess madly typing on a computer counts.  Also, I have a problem with run on sentences, thanks for reading anyway!  Funny story, I am a type A person and ALWAYS follow the rules, I will sit at a broken red light forever because I just can't bring myself to run it...you get the point.  Anyway, I had and AP History teacher in high school, he didn't like me and I did not like him...he was kinda a jerk to me.  He accused me of plagiarizing part of my midterm paper on The Battle of Midway, which as we know is against the rules and I DO NOT BREAK RULES.  So he gave me a C which made me cry because I did not get C's on ANYTHING...anyway my AP English teacher whom I LOVED came to my rescue and went to him and asked to read my paper.  She concluded that there were too many run on sentences for me to have plagiarized.  So he bumped my C to a B-  JERK!  And he called me Nickel which I hated....Awe I digress, if you can laugh at anything I hope you can laugh at this!!!!   ",
      "MessageIndex": 1958,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 12, 2017 04:56PM nrsteph wrote: rgc- I hope all goes well!  Let us know the plan and how it works! Josie- I apologize if I am wrong but I think you are from Canada (or someone is)!!!!  I just found this today and thought about you so I hope you are from Canada... http://www.cbc.ca/news/canada/saskatoon/u-of-s-researchers-treatment-breast-cancer-1.3930868 Also please excuse my lack of Canadian geography....YIKES I am edumacated I promise!!!! Hope everyone is doing well!  I got word Day 1 (Cisplatian) and Day 2 (trial drug) will begin on the 24th!!!!!  Also, found this https://knowridge.com/2017/01/double-whammy-for-triple-negative-breast-cancer/ GO SCIENTISTS GO!!!!  I had to explain to my mom that there is a race to market for a TN drug so some CEO's can cash in on this \"new\" market so that is good for all of us...I think!  I don't care on one hand who gets rich I just want to watch my babies grow up! ",
      "MessageIndex": 1974,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 26, 2017 12:26PM nrsteph wrote: DONNA- I am so sorry to hear about the pain but am glad you have a game plan.... PLEASE don't stay away for so long.  Whew!",
      "MessageIndex": 1982,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 26, 2017 07:04PM nrsteph wrote: I was so excited to hear from Donna earlier that I forgot a personal update.  I went to Mayo on Monday for study tests, Tuesday got first dose of cisplatian, Wednesday got first infusion of study drug.  Doing well, just cannot keep my eyes open.  You know when you are fully awake but your eyes just won't open...I am sure I will be back to perky in no time.  I did make onc. gut laugh when she told me my tumors were stable since my last doxil infusion 12/5 to Monday...I said \"holla\" (kinda my signature woo hoo) and she doubled over and laughed for a good couple of minutes.  Good to see her so relaxed gives me great comfort that this will work!!!!!! This thread has been really quiet lately so I hope everyone will start back up again.  I read other ones but this is \"my home.\"  Post away ladies even if it is about dinner. ",
      "MessageIndex": 1985,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "nrsteph",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234022/profile",
      "Content": "Jan 6, 2017 03:16PM nrsteph wrote: 34",
      "MessageIndex": 677,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    }
  ]
}