{
  "AuthorID": "numbersinge…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
  "Posts": [
    {
      "AuthorID": "numbersinge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
      "Content": "Apr 4, 2013 06:46PM numbersinger wrote: Skin is a little better today (6 days after last treatment) but just barely.  It is funny what things we have to try to get comfortable.  About three days ago the skin under my breast is starting to peel. I discovered that it helps to turn my cami inside out. I have to wear a full length cami as I work and can't go without a bra.  Wearing it inside out puts the elastic on the outside and makes it much  more comfortable.  Right now a bra is just out of the question. I did find that using cocoa butter is helping relieve the itch and dryness much better than the Aquaphor.  I hate that greasy heavy feel so have been experimenting with other creams.  The cocoa butter is just what is working for me right now. I don't think I used the creams enough during my first treatments as I was not seeing any differences in my skin.  Let this be a caution to those of you who are just starting radiation.  Use those creams even if you are not seeing a change. And....I was never told to use cream in the armpit area and that area is by far the worst as far as burns and peeling.  so don't forget the armpit ladies.   You will be glad later. Anyway, the peeling seems to be getting a little better.  Hoping I am on the downhill slide and starting to heal. Have a good day out there, warriors.",
      "MessageIndex": 278,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "numbersinge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
      "Content": "Apr 1, 2013 01:51AM numbersinger wrote: I just finished rads on Friday.  I did not have any skin issues to speak of until week three.  The first issue was radiation rash.  The last week I have had swollen underarm, missing skin under my arm and now missing skin and raw area around the nipple.  I have not found much at all that is helping.  I hate the heavy greasy Aquaphor.  I have aloe that I keep in the fridge and that is the only thing that gives any relief at all.   The Cancer Boutique at Duke had a small heart shaped pillow that they gave me that has helped more than anything for the underarm issue.  Fits under the armpit and keeps skin from touching skin.  Really good for helping me get some sleep.  I have also been using nursing pads for the nipples.  I put aquaphor on them and wear them inside my bra or cami.   Kind of disappointed as my radiation oncologist assured me before starting rads that I would only experience a mild sunburn type of burn.  I never expected the effects that I am experiencing.  ",
      "MessageIndex": 263,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "numbersinge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
      "Content": "Mar 11, 2013 03:39AM numbersinger wrote: I will be doing treatment #10/25 tomorrow.  No side effects so far except for a very itchy rash that I developed since Friday.  It seemed to center around tattoo and sticker between my breasts.  I had to finally remove the sticker last night as it was driving me crazy and applied some cortizone cream.  I will be my oncologist tomorrow and hopefully she will give me something for this.   Wanted to ask about bras. I have spent a good deal of money on camis, bras, etc. but none of them are doing the job.  I wear a C cup and my breasts want to squish together causing me to sweat and it is uncomfortable.  Since I can't wear an underwire bra, has anyone else had this problem and what is the solution?  I need \"the girls\" separated, if not lifted.   I read here where several of you were emotional the first day - when they applied the markers. I thought I was ready for treatment, had been cheerful and just ready to get started, but the day that the markers were applied I just could not hold back the tears.  I was just not prepared to be half naked with a man in the room....I know he has seen a zillion breasts but that didn't seem to matter.  I can't explain the feeling but I know what some of you are going through.  The therapist at Duke told me this week that there is nothing wrong with crying and I shouldn't care what people think....cry if you want to.  I think that is good advice. Looking forward to having this over.  I am staying in NC in the motel room during the week and coming home on weekends.  Three weeks to go.....Good Friday is my last treatment!!!",
      "MessageIndex": 15,
      "PostDate": "11/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/801206",
      "Title": "Radiation side effects cooper1988 LibraryLynn"
    },
    {
      "AuthorID": "numbersinge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
      "Content": "Feb 24, 2013 04:05PM numbersinger wrote: I start my radiation on Tuesday, Feb.26. The hard part now is not knowing what to expect. I just want this to be over as I have to be away from home for 5-6 weeks. How do they decide the Length of radiation that is needed?",
      "MessageIndex": 48,
      "PostDate": "24/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "numbersinge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
      "Content": "Jan 19, 2013 11:44AM numbersinger wrote: I am 57 years old and was just diagnosed.  I really was shocked as my excision biopsy was done by a trusted surgeon. I was told on Thursday that I would have results on Tuesday the following week.  After not hearing from his office, I called repeatedly and was told he was on vacation, out of the country, etc.  My follow-up appointment was three weeks later and I was expecting good news since I had not heard from my doctor.  When I went for my follow-up, I was devastated to be told that I have breast cancer.   I was so stunned that I could not think of questions to ask and was trying not to cry.  I did go back the next day and got a copy of my pathology report.  Diagnosis is DCIS, 1.7 cm mass, 2mm margins, high grade.  He wanted to refer me to a local oncologist but I have opted to go to Duke Med Center as they have a breast cancer center.   My path report has markers as follows and I am confused.  ER 0%, PR 0%, HER2 IHC 3+ positive.  Does this mean that I am estrogen negative?    My appointment at Duke is Jan. 28th and I am looking forward to having an explanation and a game plan.    All I can do is cry.  My mom has had breast cancer and her mother died from cancer which had metastasized. Thanks for listening.  My husband is in shock and my mom only tells me the bad things so I have no one to talk to. Barbara",
      "MessageIndex": 1620,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "numbersinge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
      "Content": "Jan 20, 2013 01:33PM numbersinger wrote: I had melanoma removed 17 years ago but it did not affect me like this has. I know I will feel better after I can see an oncologist and form a plan. My work usually starts to get busy in early spring and then I can keep my mind occupied. This downtime is killing me.",
      "MessageIndex": 1648,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "numbersinge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
      "Content": "Jan 19, 2013 05:51PM numbersinger wrote: Thank you for the responses. I get depressed when I Google but keep catching myself going back there for information or to try to make sense of my reports. I am counting the days until my appointment with the oncologist. I am worried about being able to work as I am self employed. Prayers to all of you. Barbara",
      "MessageIndex": 1627,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "numbersinge…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168009/profile",
      "Content": "Jan 20, 2013 01:07PM numbersinger wrote: Yes. I had lumpectomy and my margins are 2mm. Waiting to see oncologist on Jan. 28. Every ache and pain I have now I attribute to cancer. Stomach cancer, colon cancer.....does everybody go thru that?",
      "MessageIndex": 1646,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    }
  ]
}