{
  "AuthorID": "nurlaw",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
  "Posts": [
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Apr 8, 2009 02:42PM nurlaw wrote: Hi Stacy;  Just checking in on you. Have you started radiation? How are you doing with it?  I'm undergoing inflation of expanders. Should be done in 2 weeks, then will start radiation. My policy dates are April 1 of each year, so will have to pay new deductibles anyway starting last week.But I know what you mean.My diagnosis and treatment are spanning two policy years unfortunately. My PS says he will wait for at least 3 months after radiation to see how skin does before he does exchange. Still having concerns about doing radiation but I know my cancer was so extensive that I need it. Like you, I'd give a lot to avoid it, but don't want to find myself with a recurrence and possible mets in a year or two ( or more).   Hope you're doing well.   Dee ",
      "MessageIndex": 10,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729440",
      "Title": "Decision Criteria for Radiation;Risks;Reconstruction Issues nurlaw LynnVA"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Apr 21, 2009 03:36PM nurlaw wrote: Hi Puppers: No sense being cute about it. The chemo was bad. And the side effects of the Neulasta shot given after every chemo treatment was even worse.The chemo leaves you with the worst possible metallic taste in your mouth. Hence nothing tastes good, your appetite goes to heck and you have to push yourself to eat and keep nutrition up for immune system. The only thing that tasted OK were sweet foods/liquids like chocolate milk or shakes. I took Booster Protein Plus to get protein in daily.Bad taste lasts about 10 days. I had my last rx on 3/10 and I can still occasionally taste it at every meal. Worst part came on days 4 through 7. My onc had me on steroids day before, day of and 2 days after chemo. On those days I was feeling great- ready to take on the world. Had company, ran around shopping, visiting with friends etc./Day 4 brought the steroid crash and chemo side effects onset. Felt like worst flu ever had so just curled up in bed like a \"chemo queen\". Week two was better. Week three felt great. Then started all over again. But after first rx had 6mg of Neulasta to keep WBC up. On day 5 somebody woke me up at 5:00 AM screaming. I quickly realized it was me. I had a sharp twisting pain in my back so horrific that I was crying and screaming. ( I had natural childbirth times 2 without a peep- I don't cry.)It lasted all day then went away the next day. It seems the doctor forgot to tell me that 1 in 5 to 10 women have this terrible bone pain and need pain meds. They dropped the dosage down to 4 mg after that and the terrible bone pain did not occur.  I lost my hair on day 21. Very suddenly. Fortunately I had a wig ready, called my daughter and she came and cut what was left of my hair to about 2 inches.I'm not the type to shave my head. It was all gone in days.It still has not started growing back in. My eyebrows have thinned considerably, but I still have enough to fill in with pencil. My lashes have thinned on the bottom.My fingernails(all of them)  are showing a line of bluish/whiteness growing out of the nailbeds, consistent with the timeframe growth wise with my first and last chemo rx.. I am concerned I may lose them. Will ask med onc tomorrow what he thinks. I met a woman at his office who had Taxol( stronger than Taxotere) who did lose her nails. I'm hopeful mine are only showing signs of the chemo, but I'll hang onto them. If they give you Neulasta 6 mg- ask for a prescription for a pain med. Tylenol did not even touch the pain.  I have neuropathy in the toes of both feet. I'm told it should resolve in time. The need to be hyper paranoid about infections is another unpleasant side effect of sorts.No dentist, no vaccines, no manicures or pedicures, wash hands 25 times a day, use Clorox wipes on all surfaces everyday etc., etc. etc.. Hardest part was staying away from family, friends during times when white count dropped, although I did pretty well. My chemo was during the long, gray winter, so I was lonely a lot.I spent a lot of time emailing friends and writing letters(something I hadn't done in years)and reading to pass the time.My son got me the first 2 seasons of LOST, which I had never seen, and I had fun watching thaat on \"bed\" days.  The good news is though that it was only 4 treatments, so tolerable. I'm now looking at 5 weeks of radiation. 5 days a week. Makes the chemo suddenly look like a walk in the park to me- although it certainly wasn't. I wish you a speedy set of chemo treatments with none of the side effects I had. Keep in touch!  And many years of good health!  Nurlaw    ",
      "MessageIndex": 14,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729440",
      "Title": "Decision Criteria for Radiation;Risks;Reconstruction Issues nurlaw LynnVA"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Feb 20, 2009 11:33PM - edited Feb 20, 2009 11:34PM by nurlaw DEAR TENDERISOURMIGHT: Thank you so much for your encouraging reply.7 years,successful reconstruction and no toxic side effects is wonderful.I wish you many years of continued health too.  NURLAW",
      "MessageIndex": 2,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729440",
      "Title": "Decision Criteria for Radiation;Risks;Reconstruction Issues nurlaw LynnVA"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Mar 13, 2009 09:27PM nurlaw wrote: Dear TENDERISOURMIGHT: Finally met with rad onc and made decision to have the radiation.Thanks for support. Clear I need it to avoid local recurrence and possible distant mets. Will hope for the best on implants.Your response helped a lot.  nurlaw ",
      "MessageIndex": 3,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729440",
      "Title": "Decision Criteria for Radiation;Risks;Reconstruction Issues nurlaw LynnVA"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Mar 14, 2009 12:22PM nurlaw wrote: Dear Caligrlof68, Thanks for your reply and info. Like you I did hours of research and went to tumor board. Had 2 rad oncs on tumor board plus my med onc and now my rad onc all tell me I need it. Was told have 15 to 30% chance of local recurrence, which in turn research now indicates can lead to distant metastases.Radiation should reduce my chance of local recurrence by 2/3s. Rad onc ( and my research) says should add 5% to my chance of 15 year cure rate.Rad onc said chances of secondary cancers of all kinds less than 1%. My risk of lymphedema to dominant arm (which I am concerned about0 is only 1 to 2%. He agreed though that the risk of a failed recon is 20%. I will get 25 treatments in 5 weeks after expansion, wait 2 to 3 months then hopefully skin will allow implants. Doctor is going to use a special shot 2 times a week to try and prevent fibrosis and hardening of skin.Sounds like you have really been through the chemo mill. I just had my 4th and final treatment 3/10-Taxotere and Cytoxan. My doc says the biggest temporary side effect is fatigue. So I'm going to get on treadmill 6 days a week to try and keep energy levels up. I won't start until about mid May. Let me know how you do and good luck. Sounds like your decision is the right one.Take care of yourself!  nurlaw",
      "MessageIndex": 5,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729440",
      "Title": "Decision Criteria for Radiation;Risks;Reconstruction Issues nurlaw LynnVA"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Mar 15, 2009 01:52PM nurlaw wrote: Dear Caligrlof68 The injection is amifostine (Ethyol).Doc says will give Tuesdays and Thursdays. Tells me a bit of a pain because causes nausea and I must take Zofran 2 hours ahead of shot, come to treatment 2 hours early, get shot, wait 2 hours then get radiation.He has used it on 40 to 50 patients in past few years and had good results in terms of keeping skin softer for implants in patients like me who had infections after surgery etc.. He is also going to prescribe a cream called Biafine to use before treatments. I am a nurse like you and a lawyer who has been defending medical malpractice lawsuits for 24 years- so read just enough medicine to scare myself silly.The decision to do rads was the toughest- but I think we're both doing the right thing. I too want more years with my 2 little grandsons.I'll keep in touch too.          nurlaw",
      "MessageIndex": 7,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729440",
      "Title": "Decision Criteria for Radiation;Risks;Reconstruction Issues nurlaw LynnVA"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "nurlaw wrote: Hello All; I am a new member. Diagnosed 9/12/08 after many years of\"normal\" mammos. IDC, bilateral, 1.9 cm tumor plus 3 smaller ones on right, 1.5 cm tumor on left with 2 smaller ones. Ducts loaded with DCIS on both sides. SNLB negative times one on left .1 out of 2 on right. Ultimately had 14 nodes examined. Total of 2 plus one with microscopic cells on left. Technically 3 out of 14. Oncotype 11 on right and 22 on left.ER +, PR +, HER-2 _.Grade I Had bilateral mastectomies on 10/17/08. Right axillary node dissection to level II on right.Had tissue expanders done at mastectomy.Developed right sided infection of TTE. Refused to remove and was able to clear infection with high powered antibiotics over 6 weeks. Started chemo on 1/8/09.Taxotere and Cytoxan. Just had 3rd of 4 treatments on 2/17.Last one scheduled for 3/10. Am researching radiation and reconstruction issues. Need input.Am waiting on call from rad. onc. group to give me appointment. My OS said at first I did not need rad.Then she took my case to tumor board at cancer center ( U of Cinti). Both rad oncs said I need rad due to tumor burden and close margins at chest wall..But I had my slides overread bya pathologist/breast cancer specialist at another university who said the pathologist here in Cincinnati had flipped the margins and that the close margins  at issue are at the skin, not the chest wall.My PS says most recurrences occur at skin and are easily treated, as did my OS.The Cincinnati path reread my slides and agreed and amended his path report. My MO says I need radiation .   I want to avoid untimely death as do we all.The research I have done ( dozens of medical journal articles) on the criteria indicate they are changing almost daily.And long term survivability now being looked at as much better than previously with radiation. A new study on gene expression is expected this summer but too late for me to wait for. Articles say delaying rad after chemo dangerous.  I also do not want to undergo flap procedures due to their extensive complications, and likelihood of failure  . I want to go forward with implants and hope for the best. I am worried about risks of secondary cancer etc.Has anyone suffered secondary cancer or heart disease or any of the other multiple toxic effects of radiating one's entire right chest wall? Has anyone done the new 3 week treatments instead of 6? New studies out from England and Canada showing promise? Has anyone had radiation after silicone implants and done OK?My PS now wants to wait until I am done with rad. if I have it. If not he will begin expansion 4/1 and do implants soon thereafter. If I have radiation he will hurry the expansion, but wait on the implants. Anyone out there who had bilateral, multicentric disease?Did you radiate? Any input would be appreciated. And take care!   Nurlaw. Dx 10/12/2008, IDC, 1cm, Stage IIA, Grade 1, 3/14 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729440",
      "Title": "Decision Criteria for Radiation;Risks;Reconstruction Issues nurlaw LynnVA"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Apr 17, 2009 12:29PM nurlaw wrote: Hi janno: Don't know what area of country you're in but in mine (Cincinnati area) it is common to have expanders placed at time of mastectomy, do chemo, then inflate expanders ( or do inflation before chemo),then do radiation, wait to see how skin tolerates rads, then exchange implants. I am finished with chemo and going through inflation now. Will be done in 2 weeks then anticipate starting radiation first  week of May. Am told I have 20% chance of failure of reconstruction.My PS does not believe the rads will affect the expanders. Says they are tough.Question is whether skin will fibrose to extent can't place implants. I'm going to get special injections 2 times a week to prevent fibrosis (we hope).  Not sure why they would want to take your expanders out.Some docs even go ahead with implants, then do radiation.(Sloan Kettering just published a paper on their good results.) Personally, I wanted my chest wall expanded before the radiation, but I did not want implants  then for fear of injury to the implants. I did a lot of research and everyone is indeed recommending rads if have any positive nodes.Even under the \"old\" regimen, you would have been told you need radiation because you had 4 positive nodes.It is frustrating and scary.I would give a lot to skip radiation. But my very extensive research and review of numerous medical journals(as well as discussing it with many docs) has convinced me that, despite the possible SE's, I need it to avoid later local recurrence and possible distant metastases.  The decision making is the hard part. Hopefully they won't need to take your expanders out.  And Peace to you as well!    ",
      "MessageIndex": 12,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729440",
      "Title": "Decision Criteria for Radiation;Risks;Reconstruction Issues nurlaw LynnVA"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Mar 11, 2009 05:32AM - edited Mar 11, 2009 05:34AM by nurlaw I'm still wrestling with whether or not to have radiation.Frightened by possible secondary cancers lung issues,heart disease and most importantly lymphedema. But also worried about possibility of having radiatiion destroy skin so badly that I won't be able to even have an implant. Have been told by my med onc that it will dessicate skin so badly may be impossible.I also had necrosis of both incisions that had to be excised 10 days after bilateral mastectomy, which of course caused loss of skin and more scarring. My PS wants to do expansion of my expanders first. Then wait 2 to 3 months after radiation completed to do exchange.I have read the articles from both Sloan Kettering and MD Anderson and Sloan reports very good results doing the implant exchange first.So Proudafwife it sounds like you should do fine. Could anyone comment a bit more about the effect on their skin after the 61/2 week 30 to 33 treatment regimen? I am assuming that is what my rad onc, whom I am seeing Thursday, will recommend to entire right chest wall.Has anyone had just the chest wall done but not the axilla? ( Again, I am afraid of lymphedema and only had 2 plus nodes out of 13 on right. None on left. ) Finally, has anyone had the 15 day shortened course that is just now being done at some centers in US? Been doing in UK and Canada with good results I have read, although dosage actually ends up being just a little bir more? Thanks for any thoughts and good luck/health to all!   Nurlaw ",
      "MessageIndex": 5,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730438",
      "Title": "Exchange before Radiation? Scrappygrl nurlaw"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Mar 11, 2009 06:42AM nurlaw wrote: Dear everyminute: Thanks so much fo your reply. What kind of radiation did you have? Old fashioned linear accelerator EBT or IMRT or something even newer?  Not sure what I'll be offered here in Cincinnati, but sounds like whatever you had worked well for you.Did they do 3d conformational radiotherapy/Thanks!",
      "MessageIndex": 7,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730438",
      "Title": "Exchange before Radiation? Scrappygrl nurlaw"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Mar 14, 2009 01:49PM nurlaw wrote: Dear proudafwife00: I know how hard the decision is. I am going to have it- after many consults and research. I had multifocal cancer in both breasts,some short margins and positive nodes that my rad onc said put me at risk of local recurrence  and possible distant metastases. I'm glad you've made your decision- nice to gave it made one way or the other huh? I'm finally at peace with my decison to go through with it. I'll keep you in my thoughts for  benign outcomes on those PET scans! Sincerely,  nurlaw     ",
      "MessageIndex": 10,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730438",
      "Title": "Exchange before Radiation? Scrappygrl nurlaw"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Mar 15, 2009 03:14PM nurlaw wrote: Dear Proudafwife00: The \"margins\" means how much tissue around a tumor is clear of cancer. For instance, I had short margins around tumors in my right breast- the cancer margin was up to within less than a millimeter of the clear margin. But on the left side I had wide margins- the tissue was clear of cancer for 1.5 centimeters.  The pathology report that is created after the pathologist microscopically reviews your tumor tissue slides after either a lumpectomy or mastectomy determines the size of the margins.Your doctors receive a copy of the report.",
      "MessageIndex": 14,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730438",
      "Title": "Exchange before Radiation? Scrappygrl nurlaw"
    },
    {
      "AuthorID": "nurlaw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79532/profile",
      "Content": "Mar 14, 2009 01:54PM nurlaw wrote: Dear everyminute: Thanks for the reply!. My rad onc says will use special shot (ethoyl) twice a week to keep skin soft as possible for recon.Am being expanded first, then radiation, then implants. So happy to hear your implants doing well!  Sincerely,  nurlaw",
      "MessageIndex": 11,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730438",
      "Title": "Exchange before Radiation? Scrappygrl nurlaw"
    }
  ]
}