{
  "AuthorID": "nurseronda1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
  "Posts": [
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Feb 18, 2013 07:20PM nurseronda10 wrote: I, too was told I had dense and fibrocystic breasts and had been getting mammograms every year since the age of 27. Even had two mammograms in 2009.  Did self breast exams religiously.  My maternal grandmother passed away at the age of 48 in 1960.  She battled breast cancer for 10 years.  I have sisters, cousins, aunts, and great aunts and no one else has had breast cancer but me and my grandmother.  I exercised, ate healthy, never took birth control pills and only used a hormone cream for one year.  I showed the lump to my gynecologist 3-4 years before it became painful and she said it was normal breast tissue.  Never really thought it could be cancer because mammograms were negative.  In March of 2010, I started to have sharp pains in my left breast, but waited until August when my annual mammogram was due and then it finally showed up.  I was angry for a long time that it wasn't caught sooner, so I know exactly how you are feeling right now.  I was so scared, but as time has passed things have gotten better and I don't think about it as often.  My daughter was only 15 when I was diagnosed and I wondered if I would be around to see her graduate.  My how time flies......she will be 18 in 2 months and graduate in 3 months.  I sure don't feel as energetic as I used to, but I attribute part of it to my age and the rest to chemo.  I guess the neuropathy has been the worst part, but thank God for Neurontin.  It has worked wonders.  Chemo went by fast and was tolerable.  You have come to a great place for support and info.  God bless. ",
      "MessageIndex": 6,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800666",
      "Title": "Frozen with Fear LKSHER Ariom"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "May 13, 2011 08:02AM nurseronda10 wrote: PJB, I was also on Taxotere and had edema of feet and ankles and ended up having to take Lasix 60 mg on three different occasions, the first being after 5th round and twice after 6th round.  I actually started swelling with #3 but it got worse with each round.  I would suggest you try it.  It helped me tremendously.  Edema was gone by the next day.  ",
      "MessageIndex": 1,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768919",
      "Title": "Anyone have to take diuretic while on chemo? PJB PJB"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Sep 5, 2012 06:20AM nurseronda10 wrote: Thirty-five references and I did not see one that mentions LE. :/ ",
      "MessageIndex": 1,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/793038",
      "Title": "Komen: Effects of treatment--No LE kira Binney4"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Dec 4, 2011 07:19AM nurseronda10 wrote: Outfield, I also having a thick cord that is very visible in my armpit and makes shaving so hard.  Cording and LE developed not long after surgery for wound debridement with wound vac placement.  I had several weeks of physical therapy to loosen it but still do not have full extension of my arm when raising it straight up over my head trying to reach for the sky so to speak.  I am having latissimus flap breast reconstruction next month and PS said he was going to release this cord during surgery so I would have full range of motion again.  He also said this should improve my lymphedema.  I would think that surgery would tend to make LE worse.  I hope he knows what he's talking about.",
      "MessageIndex": 6,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/778987",
      "Title": "Different Kind of Cord Question Outfield 16Christine"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Nov 26, 2011 02:37PM nurseronda10 wrote: Needtobestrong, I used baby shampoo also and once I finished chemo, started using Avalon Biotin B complex thickening shampoo.  My hair is about 3 inches long in some places and 2 inches in others and it has come back thick.  I was so afraid it would come back thin and so where other ladies recommended the thickening shampoo.  I had it evened up about 12 weeks ago, but not sure why it is growing faster in the back.  Seems like my bangs are growing the slowest.   Has anyone's hair straightened up over time if it initially came back wavy or curly?  Before BC, I had super straight hair and now it is fuzzy and wavy with curls here and there.  Really miss my straight hair. My ONC said it would \"relax some\" after it grows out more.",
      "MessageIndex": 12635,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Aug 21, 2011 02:06PM nurseronda10 wrote: I am 6 months PFC today and my hair varies in length from 1\" to 1 1/4\".  Getting my first trim tomorrow just to even it out.  My daughter said it feels like \"rabbit fur.\"  My hair prior to chemo was straight as a stick and coarse.  Now it is wavy on top and straighter on the sides with cow licks everywhere.  Still wearing the wig most days.  Go topless at home, but wear a baseball cap.  I have tried to style it with gel, but so far, very unmanageable. ",
      "MessageIndex": 10924,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Aug 25, 2011 11:54AM nurseronda10 wrote: Margie, your hair looks great!! I am 6 month PFC and had my first trim or should I say, a snip here and there on Monday.  My hair is very thick and curly on top, straight and thinner on the sides with cow licks everywhere.   I have attempted to style it using the blow dryer and letting it air dry with gel in it.  If I blow it dry, it stands straight up on top and looks like a mullet.  Gel makes it even more curlier (on top) which looks funny with hair on the side of my head being stick straight.  Glad I like my wig because it looks like I will be wearing it for a while.  Before BC, I had very straight hair with no cow licks.  Very thankful that I have no bald spots.  A co-worker who is 3 years out has a large bald spot with very fine thin hair.",
      "MessageIndex": 11018,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "May 13, 2012 06:27PM nurseronda10 wrote: Sounds just like what I had after the mastectomy and again after breast reconstruction (LD flap).  Be sure and go to a physical therapist that is lymphedema certified.  The first one I went to did not know a lot about it and the stretching caused my wrist to swell up.  Only physical therapy can stretch the cording out.  I tried to do it myself having known all the exercises to do but it is truly impossible.  Mine was axillary web syndrome both times.  I had one cord that ran all the way down to my wrist that even made it difficult to drive.  Very few doctors know anything about cording or lymphedema.  So, so sad. ",
      "MessageIndex": 2,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/787415",
      "Title": "shortened tendon after mascectomy and lymphectomy archer rosiegeorge"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Nov 7, 2010 08:21AM nurseronda10 wrote: I had a PET scan prior to starting chemotherapy.  A friend of mine did not get a PET scan because her insurance would not pay for it.  I had lymph node involvement and she did not, so wondering if that as anything to do with whether or not insurances will pay.  Her insurance did pay for CTs of chest, abdomen, and pelvis.",
      "MessageIndex": 21,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760366",
      "Title": "did all of u had pet/ct/bone scan the first time? melania lmc1970"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Aug 29, 2010 02:31PM nurseronda10 wrote: Thanks so much, Deirdre and mnmom for the information.  It was helpful.  Also spoke with a friend tonight whose grandmother was diagnosed with breast cancer earlier this year and her PET scan came back showing mets to the hip that turned out to be arthritis.  Now I am wondering how they came to the decision that it was arthritis and not mets.  Her doctor told her PET scans frequently showed false positives.  Deirdre, so happy for you and I hope and pray mine turns out clean also.",
      "MessageIndex": 3,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757351",
      "Title": "PET Scan nurseronda10 in_cognito"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Dec 17, 2011 11:11PM nurseronda10 wrote: Can't believe I have never seen this thread, but glad I found it.  I graduated in 1986 with an associates degree in nursing.  I have been working night shift all these years, but know I would feel better mentally and physically if I were on dayshift. I was unable to work during chemo due to being neutropenic starting with 2nd round of Taxotere and Carboplatin and low H/H with 4th, 5th, and 6th rounds.  I had a lot of nausea also.  Just finished Herceptin in October.  Will begin the reconstruction process soon. :o)",
      "MessageIndex": 642,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Jan 13, 2012 09:11AM nurseronda10 wrote: Fredntan- I work 7P-7A as a floor nurse.  My LE is mainly in my thumb and wrist.  Bicep area measures 1/4  inch larger than unaffected arm.  I always wear my sleeve.  Wear glove while getting ready for work and when I get to work, I take it off and leave it off until I get 9 p.m. meds passed, then I put glove back on.  I have it on and off so many times during my shift.  I try not to wear it when I go in a patient's room.  I would like to go to dayshift, but at night we usually have down time so I can keep my glove on for longer periods of time.  If I have my glove off too long I feel lymph fluid getting in my hand because it starts hurting.  So far, no one has said anything to me at work regarding the glove.  The radiology tech at work has to wear a gauntlet and she had to get a statement from her doctor saying it was medically necessary.  ",
      "MessageIndex": 662,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Apr 21, 2011 10:44PM nurseronda10 wrote: It has been exactly two months since my final chemo of Taxotere and Carboplatin and my longest hairs are only about 1/4 inch long.  My scalp has been extremely sore for a couple of weeks.  I can already tell this is going to be a long, long process to have shoulder length hair again.  Wishing all of you speedy hair growth!! :o)",
      "MessageIndex": 23,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/767471",
      "Title": "My Hair-Ok This is Stupid but I am Lost Pure Luan"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Jul 21, 2011 01:10PM nurseronda10 wrote: Lavender250, with your family history, you might want to follow up with a breast specialist.  I started going to one after my mastectomy.  He does breast exams different from anyone I have ever been to before.  Does them with the patient sittiing, lying flat,and also lying on both sides.   Very, very thorough.  My breasts were dense, so I should have gotten an MRI at some point, especially with my grandmother dying at an early age from breast cancer, but where I live they are not ordered much.  This physician is in Nashville, TN.  I go for my annual mammogram on remaining breast next month and then in 6 months will get an MRI and 6 months later another mammogram.  My mother was scheduled for a lumpectomy by a general surgeon in our hometown and I was able to talk her into canceling her surgery and going to see the breast specialist in Nashville.  He does his own ultrasounds in the office and was able to tell her right then and there, she had nothing but scar tissue from a previous lumpectomy.   He said nothing was 100%, so does want to see her again in 3 months from repeat ultrasound.  I feel that if I had been going to him all along may be my breast cancer would have been caught sooner. ",
      "MessageIndex": 33,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771660",
      "Title": "Breast lump @ 27, strong family history Lavender250 del4"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Mar 14, 2013 02:37PM nurseronda10 wrote: quiltrunner - Ask your oncologist for Neurontin.  It has worked wonders for my sore feet and stiff ankles.  The pain didn't hit me until 6 months PFC.  I ran a 5K and could hardly walk for a week.  My feet felt like I was walking barefoot on rocks.  Neurontin has made a world of difference.  The only bad thing, it makes me drowsy so I can only take it at night but it seems to work most of the day.  ",
      "MessageIndex": 5,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/801649",
      "Title": "Finished taxotere 3 wks ago & foot pain just started - related? quiltrunner Moderators"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Apr 14, 2012 05:02PM nurseronda10 wrote: Strong -I was off 6 months too and was very nervous going back.  I work 12 hour night shifts and was afraid I would be too weak to do it.  It took several weeks to get all my strength back.  I went back to work with a hemoglobin of 7.7 (refused a blood transfusion, I know, I'm stubborn).  The people I work with are great and would jump up and answer the call lights and tell me to sit.  I did fine and you will too!  I did wear my wig.  It looked so much like my real hair but shorter.  The previous year, a coworker went through the same thing, so I felt this helped matters.  I don't know why.  I guess I didn't feel so much like the lone ranger.  Best of Luck!!",
      "MessageIndex": 5,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785814",
      "Title": "My last weekend before going back to work. NeedtobeSTRONG LaurenM730"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Apr 3, 2013 05:35PM nurseronda10 wrote: I thought my LE therapist was nuts when she started placing Kinesio tape across my chest and back, but it DOES work.  Glad something does.  She said it works for back pain also.",
      "MessageIndex": 1,
      "PostDate": "03/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/802734",
      "Title": "Kinesio tape Tamiami Estel"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Jan 13, 2012 09:12AM - edited Jan 14, 2012 07:54AM by nurseronda10",
      "MessageIndex": 663,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "nurseronda1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107816/profile",
      "Content": "Nov 9, 2011 08:01PM nurseronda10 wrote: I can't stress enough the importance of going to a breast specialist.  I had to fiind out the hard way.  So glad you found this site.  Just wished I had sooner.  I agree with getting a mammogram or ultrasound or even a needle biopsy before jumping into an exicisional biopsy.",
      "MessageIndex": 5,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777840",
      "Title": "Found a hard lump on my left breast acousy31 dlb823"
    }
  ]
}