{
  "AuthorID": "NurseBeth",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
  "Posts": [
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Apr 1, 2011 07:26AM NurseBeth wrote: bkj66....I am in the waiting for results club (same time frame as you), and have (fortunately) had no experience with BC....but I do have experience with my husband who fought brain ca for 7 years, and the one thing I learned is, regardless of feeling not ready, if it is, you are soooooo much stronger than you feel and you will deal with it. You kicked it's a$$ before, and if you have to again, it is so darn unfair, but you will do it again. In my experience, the waiting is torture, and until you have hard facts and a plan, it's so hard to feel settled. I pray that your results are B9 and that this was just some cruel torture. Yes, you have been through enough, but if some awful reason if happens to you again, clearly you are a strong woman (even though it just sucks that you have to exercise that again), and you will kick it in the backside one more time. If I've learned anything, like I said, as a wife in my husband's journey, it is that none of it is fair, and none of it makes sense, and you deserve to feel however you are feeling. Please do something nice for yourself while your waiting. You deserve it. Fingers crossed for you!!",
      "MessageIndex": 12,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/766863",
      "Title": "Biopsy today-scared! bak94 Lisa1962"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Mar 31, 2011 02:37PM NurseBeth wrote: Stephanie! Congratulations!!! :) Great news. Beth",
      "MessageIndex": 2,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766876",
      "Title": "Great news StephB debbie6122"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "NurseBeth wrote: Can anyone tell me what makes the determination on whether cancer is removed as a lumpectomy or a mastectomy (in the earlier stages, when a lumpectomy is still an option). I guess, my thought is that when my husband had brain cancer, they took what the could each surgery until there was nothing more they could do.....not that I would be in favor of it, but does every breast cancer have a risk of reoccurance and if so, can you choose to remove your breast to avoid that possibility. Beth (not to be Debbie downer and hopefull I get b9 news after my biopsy this week, but I also have two young kids who watched their dad fight for 7 years and ultimately lose the battle) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766704",
      "Title": "A question...thinking WAY ahead NurseBeth 2much"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Mar 27, 2011 04:35PM NurseBeth wrote: Thank you everyone for the support. I managed to celebrate my birthday this weekend and just focus on friends and family. Now back to the worrying.....Ugh.....Hoping to be in the 80% nothing crowd.....Can't stand the wait. Thank you again.",
      "MessageIndex": 5,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766598",
      "Title": "Probably hypersensitive NurseBeth janet58"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Mar 28, 2011 08:51AM NurseBeth wrote: Thank you Kim for that advice. I'm taking my  Mom with me. I picked up the radiologist report today. It says Bi-Rads 4B Low-moderate suspician for malignancy. Also \"low density nodule in the upper outer posterior left breast measuring approximately 9mm maximally\" and \"we see a solid well circumscribed oval nodule.\" The funny thing is, where they found it, is exactly where I am having pain, and it is not palpable. They told me it was coindidence. Any one else have pain? Thanks. I hope I'm not making everyone crazy with my questions. It's difficult being a patient when I'm a nurse. Beth",
      "MessageIndex": 7,
      "PostDate": "28/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766598",
      "Title": "Probably hypersensitive NurseBeth janet58"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Mar 29, 2011 03:49PM NurseBeth wrote: Thank you to everyone. The support here has been invaluable during this horendous waiting game. Biopsy Thurs and results Mon or Tues.....ugh,,,,,I'm planning on spending time tomorrow creating a list of things I need to change when and if this is B9....it's been a real eye opener and I could do some things in my life differently.  Thank you to everyone.",
      "MessageIndex": 11,
      "PostDate": "29/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766598",
      "Title": "Probably hypersensitive NurseBeth janet58"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Apr 4, 2011 12:03PM NurseBeth wrote: Djsbaby, Do they think you have a cellulitis?? That's what that sounds like in my experience, if there was no underlying cause. Beth",
      "MessageIndex": 4,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767060",
      "Title": "Was admitted to the hospital. djsbaby djsbaby"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Apr 4, 2011 12:06PM NurseBeth wrote: and to add to that, a nasty cellulitis can be very dangerous if left untreated. Glad you went, regardless what it ended up being. Scary stuff. Beth",
      "MessageIndex": 5,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767060",
      "Title": "Was admitted to the hospital. djsbaby djsbaby"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "NurseBeth wrote: Hi everyone. I am a 38 year old widowed mother of 2....I am a nurse, so I am trying to keep some perspective during the \"waiting\" but I also lost my husband to brain cancer two years ago, so the thought that this is potentially something has kept me up at night. I was having pain in my left breast (come to find out, completely unrelated), so I mentioned it to my gyno a week ago. I had a diagnostic mamogram on Monday, followed by an ultrasound. They found a solid \"lesion.\" It is not palpable, it was strictly seen on both methods of imaging. I have an ultrasound guided needle biopsy next Thursday.   My question is, did anyone have lumps found, not palpable, that were solid, but benign. If this is the case, are they removed. I've tried to stay off the internet, but I can't, and I think I'm scaring myself. Best wishes and luck to all!! Beth  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766598",
      "Title": "Probably hypersensitive NurseBeth janet58"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Mar 31, 2011 05:36PM NurseBeth wrote: That's terrible. I could stand to lose 40 lbs and I'd be pissed if someone said \"have you gained a lot of weight?\" That's really rude. My fingers crossed that you get B9 results....and congrats on your weightloss!! ",
      "MessageIndex": 9,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766832",
      "Title": "Had my biopsy today StephB NurseBeth"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "NurseBeth wrote: But it was a pain in my breast which brought me to my gyno, and which in turn made her send me for a diagnostic mamo and u/s, which they found the solid nodule, which they biopsied today.....all found...EXACTLY where I was having the pain....and I was told it was just coincidence I was having pain there....and it is not related....Really?  Not buying it!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/766893",
      "Title": "Not for anything.... NurseBeth Lisa1962"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Apr 1, 2011 09:19AM NurseBeth wrote: It will be back Monday or Tuesday. God willing it's a fibroadenoma, but even at that, it doesn't belong there, and I had pain.",
      "MessageIndex": 3,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/766893",
      "Title": "Not for anything.... NurseBeth Lisa1962"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "NurseBeth wrote: Hello. Had my core needle/US biopsy this morning. Sore now, but not horrible. Thank goodness for ice packs. No one mentioned having a mamo on that side right after...that wasn't super pleasant :/ So, the surgeon believes it will be a fibroadenoma, so I am hopeful, but until the final result, won't be able to relax. Anyone have it look like it would be a fibroadenoma, and then surprised that it wasn't? I just am trying to be prepared either way. I hope everyone else is hanging in there. I will say, the breast care center I have been going to is really a wonderful, nurturing place. I always said I'd never be able to work (I'm a nurse) with cancer, because my husband passed away from brain ca, but if everything turns out ok, I would totally consider working in a place like that, where they really try to offer what little comfort and support they can during such an uncertain time for the patients. Beth Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/766874",
      "Title": "Biopsy this morning...waiting until Mon or Tues NurseBeth NurseBeth"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "Mar 31, 2011 03:44PM NurseBeth wrote: Oh bkj66....I'll cross my fingers for you and hope that you do have your results late Friday so you don't have to wait the whole weekend. I hope your radiologist is wrong! Beth",
      "MessageIndex": 3,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/766874",
      "Title": "Biopsy this morning...waiting until Mon or Tues NurseBeth NurseBeth"
    },
    {
      "AuthorID": "NurseBeth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126609/profile",
      "Content": "NurseBeth wrote: Can anyone tell me what the recovery time is like for a lumpectomy. I have a fibroadenoma which will most likely need to be removed. I am a nurse, so my job is quite physical. I was wondering how long lifting restrictions were in place. Thank you so much. Beth Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767066",
      "Title": "lumpectomy NurseBeth cantgarden"
    }
  ]
}