{
  "AuthorID": "Nurse_Lizzi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154303/profile",
  "Posts": [
    {
      "AuthorID": "Nurse_Lizzi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154303/profile",
      "Content": "Feb 5, 2013 12:50PM Nurse_Lizzie wrote: We Vermonters don't say much. Ayup.",
      "MessageIndex": 55,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799912",
      "Title": "OT - Regional Ways of Speaking redwolf8812 HLB"
    },
    {
      "AuthorID": "Nurse_Lizzi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154303/profile",
      "Content": "Dec 8, 2012 08:29PM Nurse_Lizzie wrote: Vanilla patch Lymph nodes can swell for lots of reasons. The physical trauma of surgery is indeed enough to make them swell. I wouldn't worry too much about it. Nurse Lizzie",
      "MessageIndex": 1,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797414",
      "Title": "Swollen lymph node(s) after mastectomy with reconstruction? vanillapatch Aridni"
    },
    {
      "AuthorID": "Nurse_Lizzi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154303/profile",
      "Content": "Dec 8, 2012 01:11PM Nurse_Lizzie wrote: Butterfly lady I had the same feelings about my second surgery, which was my exchange. I went with BMX initially, and seven months later did the exchange. I was a bundle of nerves, and worried so much more. I think that with the initial surgery, all I could think of was how to get this cancer out of me. The second time around, it was truly an elective surgery. Of course, despite all my worrying, all went well, and I'm certain it will for you too. Have a drink, revel in your good health, and acknowledge your worries. It won't make them go away, but it will make them better. Lizzie",
      "MessageIndex": 3,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797400",
      "Title": "Mentally Preparing for Second Surgery Butterflylady2012 Butterflylady2012"
    },
    {
      "AuthorID": "Nurse_Lizzi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154303/profile",
      "Content": "Dec 20, 2012 07:59PM Nurse_Lizzie wrote: Hello all Just found this thread and would love to introduce myself. I've been a nurse since 1979 (seems like a long time). In January I will \"celebrate\" my one year diagnosis. I had BMX on Feb 24, immediate reconstruction with TEs. Had my exchange in September. I've been doing very well. Have my next PS appointment soon after Jan 1, and we'll be discussing nipples. I may be looking at some more reconstruction because one breast isn't quite perfect. Overall, though, I'm very pleased with my outcome, and would stop here if I needed to. However, now that I've come this far, I might as well finish! Work: I'm a manager at a Home Health agency, so fortunately I have been able to work without losing much time, as they can accommodate any restrictions I've had. They've been awesome. Hope all of you are well. Happy Holidays to each and every one! Lizzie",
      "MessageIndex": 707,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    }
  ]
}