{
  "AuthorID": "Nurzrobin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264463/profile",
  "Posts": [
    {
      "AuthorID": "Nurzrobin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264463/profile",
      "Content": "Dec 10, 2017 12:01PM Nurzrobin wrote: thank you all for the insight! You have put my mind at ease. I let you know if it hurts.",
      "MessageIndex": 6,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860757",
      "Title": "Scared about radioactive injections for SX Nurzrobin DownNotOut"
    },
    {
      "AuthorID": "Nurzrobin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264463/profile",
      "Content": "Dec 14, 2017 07:37AM Nurzrobin wrote: Well I had my injections, wire placement and surgery yesterday. All went well! I asked for something to ease the pain for that particular procedure and my pre-op nurse tracked down anesthesia md and got the order. It took the edge off only because cream only had about 20 minutes to work. But I have to say my nuclear med nurse was very gentle and it was very tolerable. I felt the wire placement procedure was much more uncomfortable. The approach had to be from the bottom so I was laying on my side, leaning into mammo machine while breast is squished and M.D. has to lean over you and place wire. There is lidocaine used and that helps but each new progression was an ouch. About a 5 on pain scale. Good news is it is quick! Surgery lasts a couple of hours. And news flash, my arm pit hurts much more today than my breast. Go figure! Now we wait for that final pathology. My appt is Tuesday. For me the waiting has been the worse part. Thanks to all for your suggestions and support. I am so happy I found the site!!!",
      "MessageIndex": 10,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860757",
      "Title": "Scared about radioactive injections for SX Nurzrobin DownNotOut"
    },
    {
      "AuthorID": "Nurzrobin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264463/profile",
      "Content": "Nurzrobin wrote: New diagnosis idc, surgery Wednesday terrified about the radioactive injections and wire placement, heard they were very painful. Suggestions?? Dx 11/30/2017, IDC/IDC: Tubular, Right, 1cm, Stage IB, Grade 1, 0/1 nodes, ER+/PR+, HER2- (IHC) Surgery 12/13/2017 Lumpectomy: Right Radiation Therapy 1/15/2018 Whole-breast: Breast, Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860757",
      "Title": "Scared about radioactive injections for SX Nurzrobin DownNotOut"
    }
  ]
}