{
  "AuthorID": "nyama",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
  "Posts": [
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jan 1, 2014 01:11AM - edited Jan 1, 2014 01:31AM by nyama I'm someone who has an Oncotype score of 0 which, according to the test results, puts my average rate of  distant recurrence at 3%, provided I complete 5 years of hormonal therapy.  Even though there's not a huge difference in that percentage if I were to opt out of taking my little white pill each day, I'm not willing to take that chance.    I also completed almost seven weeks of radiation.  I do NOT want this thing to return and any little bit I can throw at it, I will.  Every single percentage point counts to me, and if somehow I do have a recurrence down the road I don't want to think, \"If only I'd .... \"  While I'm very happy to not have to go through chemo, sometimes I wonder if I'm doing enough prevention-wise, but am really pretty much limited to the hormonals at this point.  Well, that and the life-style changes--have gotten below a 25 bmi and am exercising, no alcohol, eating well, taking some supplements, etc. and those things are important too . . . but still there's a kind of comfort in taking something tangible, like my daily Arimidex.  Luckily, I've had very few SEs with that, and radiation was pretty easy for me, too, so I feel blessed.  Anyway, I'm so very happy the test was available and spared me the chemo.  (Now I just hope it's trustworthy!!  There's always that little doubt.)  Good luck to everyone waiting for their results. And Happy New Year!  ",
      "MessageIndex": 78,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 10, 2013 06:27PM - edited Jun 10, 2013 07:04PM by nyama Cute buttons! So, started the rads today.  I didn't realize how nervous I was until it came time to hold my breath, since my lt breast is the one being irradiated.  My lips were trembling and my heart was doing flip-flops (I get atrial fib sometimes) and I was so nervous that I wouldn't be able to hold my breath long enough.  But it worked out OK.   Tomorrow: no more caffeine before treatment!   One down!",
      "MessageIndex": 350,
      "PostDate": "10/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 14, 2013 10:00PM - edited Jun 14, 2013 10:06PM by nyama Whoo-hoo, my first week of rads completed!  So now 5 down, 25 to go!  So far so good, no redness or side-effects yet.  Just in case, I've been lathering on the 99% aloe gelly after treatment and twice  later for a total of 3x day.  Once that's absorbed, I'm applying plain  sweet almond oil (also 3x day).  I'm actually applying the oil to both breasts since it seems to be helping my incisions feel less tight and painful.  My RO is a pretty laissez-faire kind of guy when it comes to any skin treatments (though I'm sure he'd prescribe something if I really started having problems).  He gave me a sample tube of aquaphor when I asked about it, but basically said that I can use whatever I want to--whatever seems to work if and when I need it.  The only thing he cares about is that it's washed off before treatment.   I might try to buy a bottle of the emu oil if my current concoction seems to stop working.  And I think I'll also get some neosporin to mix with that aquaphor if I start itching. Anyway, it's all going well so far.  The biggest issue is actually getting there every day  What a pain! Gentle hugs to everyone who are later in this phase and having skin and/or fatigue issues.  I hope I can skip that part, but we'll see.  ",
      "MessageIndex": 417,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 18, 2013 12:33AM - edited Jul 18, 2013 12:34AM by nyama ItIsWhatItIs - I'm pretty fair skinned with auburn hair and have done OK with rads (relatively speaking) so like AnnieLane said, it isn't like sunburn where you'd expect those with fairer skin to react the worst. GWTF - I don't know if they're considering the electrons they're giving you a boost or not (I'd ask them--it just might be what they need to do to get that particular angle and be safe) but the picture you posted looks pretty much like the little thing they have on the end of the rads machine for me now for my boosts.   LW0919 - I gradually went from a regular bra to a cami or stretchy bra (around treatments #14-15) to now going braless--about treatment #22 or so was when I started to get too itchy to have anything rub against the bosoms.  But the itchiness seems to have subsided somewhat, now that I stopped using the aquaphor, and I'm going back to the stretchy bra tomorrow.   27/34 ",
      "MessageIndex": 1017,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 22, 2013 06:35PM - edited Jul 22, 2013 06:36PM by nyama Congratulations LeeLee!!!  There are a few of us finishing up this week.  We CAN do this! Now that it's been almost a week since my last full breast treatment, the annoying itchiness has subsided almost completely and my breast now just looks like it has a very mild rash across the top.  No skin breakdown and I made it through almost the whole day without even noticing my boob.  (On the other hand I was busy having an endometrial biopsy without any kind of anesthetic so have a good excuse. Not fun!) Anyway, in the home stretch now.  RO says things should keep getting better from this point on, so feel  happy and blessed to say I'm pretty sure I've made it through rads without any severe skin issues.   Four more! 30/34",
      "MessageIndex": 1091,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 23, 2013 11:28PM - edited Jul 23, 2013 11:35PM by nyama SophiaAnne-Marie -- Welcome to the community. :-)    As you'll see as you read the threads, there are all kinds of different experiences that we each have with treatments.  Some women have an awful time with radiation and have pain and severe skin breakdown, and some women have barely any effects at all....and there's everything in-between, too.  Unfortunately, there is no way to predict, really, and you don't know till you get there, but wherever \"there\" is, someone here has probably experienced something similar so there's lots of info and support for you. I've used aloe more than anything else (99% aloe gelly but some use 100%) and that's all I'm using now as I finish up.  Sometimes you just have to try different things to see what works when you need it and change it for something else when it no longer seems useful.  I switched to different things (sweet almond oil, aquaphor+hydrocortisone) as my treatment wore on, but always kept the aloe to use right after treatment and to cool and soothe. One of the things my RO told me is that with rads the skin (and the other cells) are affected from the inside out, so your nutrition really matters in terms of healing and helping your healthy cells regenerate.  I've been really conscientious about eating 70-80 gms of protein a day, lots and lots of fresh vegetables, whole grains, no junk food or sugar, no alcohol, etc.  I have also been supplementing with curcumin (turmeric), omega-3 (fish oil), resveretrol, a multivitamin, and my calcium + D3 (you'd need to ask your RO about supplements, though--mine is OK with all that but yours might not be and some, like turmeric, might interact with the tamoxifen in ways you don't want).  Anyway, while I can't be sure how much my diet helped me through this, I know it didn't hurt me at all and I do feel pretty good, all things considered. That's very convenient that you will be getting a close-by apartment for the duration of rads!   It will be over before you know it and hopefully soon you can hop back on that  motorcycle and head home to Equador! 31/34",
      "MessageIndex": 1111,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 25, 2013 09:07PM - edited Jul 25, 2013 09:07PM by nyama Yep, had xrays done every week to make sure they were still aiming at the right spot, I guess.  I think it's pretty standard. 33/34",
      "MessageIndex": 1149,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 5, 2013 10:12PM - edited Jun 5, 2013 10:14PM by nyama I had my tattoos and CT scan right before leaving town on the 31st, and will be flying home and finally starting rads on Monday.  Cannot WAIT to get this next chapter over with!  I'm a little concerned because I still have a little scabbiness on my lt. nipple.  It might be finally off and healed by Monday, but if it's not, does anyone know if it will matter?  I sort of thought that the doc wanted me to be all healed up before we start.  It's already been 7 weeks, though (8 by Monday). LeeLeeLynn - My RO hasn't said anything about diet beyond eating healthy and not trying to diet during treatment.",
      "MessageIndex": 290,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 8, 2013 01:21PM - edited Jun 8, 2013 01:44PM by nyama Hi pattithenurse -- I'm in Canby, which is between Portland and Salem, but basically a rural suburb of Portland.  I went to graduate school in Eugene, though (go ducks!) so lived there for about 8 years and know and love it well!! Getting ready to get on the plane and come home and then get ready for rads starting Monday  Yippee?  I'll just be so happy to have it behind me.  Starting to lube up the girl daily in preparation!  ",
      "MessageIndex": 317,
      "PostDate": "08/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 3, 2013 10:12AM - edited Jul 3, 2013 10:18AM by nyama So happy for everyone who's finished and finally got to ring that bell!   AND so sorry to hear about the skin issues so many are still having.  {{{Gentle hugs}}}   That has to be miserable.  I hope you're finished healing quickly!    Robin3, I also just finished #18.  My skin is also OK so far--maybe just a little pinking and a teeny-tiny rash like a mild sunburn across the top (On the other hand it really COULD be a sunburn....spent two days by a river over the weekend in this heat wave and used plenty of spf50 and tried to cover-up, but.....hard to tell).  Anyway, so far my RO says it looks good and he doesn't think I'll have any major issues.  Hope he's right.   btdemo - You asked about nausea.  This might not be the same as what you're feeling, but a  few times I had some weird feelings in my stomach after rads, close to nausea but not quite?   I found what made it better was a light protein snack so I now carry a peanut protein-bar with me to eat after rads and have been fine with that.   I know it sounds a bit strange but maybe my body was just signaling me that it needed some extra fuel after rads for healing or ? Don't know.   The biggest issue I have now after spending a weekend by the river in the heat is the allergies.  I have to hold my breath for my zaps because it's a left-sided cancer and I'm so afraid I'll sneeze in the middle!! LOL!  (Yikes!)",
      "MessageIndex": 735,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 5, 2013 03:48PM - edited Jul 5, 2013 03:54PM by nyama AnnieLane, I was going to post but you basically said everything I was going to. :-)  The advice I was given is pretty much along the line of that article.  My RO  said I don't need to use anything, but I could if it made me feel better, as long as its off before treatments, with aloe being the best.  So, I use that plus the sweet almond oil.  If my skin starts to get bad, though, I'll add emu or calendula anyway.   19/34",
      "MessageIndex": 788,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 26, 2013 07:55PM - edited Jul 26, 2013 07:56PM by nyama Thanks for the congrats everyone.  I rang that bell so dang loud I was deaf in one ear for about a minute. LOL!!! I'm done I'M DONE I'M DONE!!!!!!!!!!!!!  Whoopeee!!!! 34/34",
      "MessageIndex": 1174,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Apr 26, 2013 03:06PM - edited Apr 26, 2013 03:07PM by nyama And here's another newbie!  I've been reading the thread for a few days, but just thought I'd peep out of lurkerdom and say hi!  I just had my lx plus oncoplasty last week and am now \"officially\" a stage 1.  ",
      "MessageIndex": 14692,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "May 27, 2013 06:41AM - edited May 27, 2013 07:33AM by nyama Thanks everyone for sharing your experiences.  I still have a couple of weeks to wait, but it's nice to be prepared by reading what everyone else is going through.  It's a good thing, I guess, that I had to delay the start of my rads because I'm really not completely healed up yet from the oncoplasty.  My nipples are still scabs and a couple of the incisions are still slightly crusty (TMI, sorry...) so I probably would've had to wait another week or two even if I weren't going away.  Anyway, going for the CT and mapping/planning on Thursday and then get to go out of town for a week before I start on the next leg of this journey.  I think I really need it based on what the last 2 months have been like!",
      "MessageIndex": 169,
      "PostDate": "27/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 7, 2013 05:37PM - edited Jul 7, 2013 05:38PM by nyama So sorry you're having problems, LeeLeeLynn.  Hope you heal quickly.  Like sciencegal says, mixing the hydrocortisone with aquafor seems to help a lot.  I finally developed one small itchy patch near the top of my breast--there are only a couple of tiny red bumps in that spot but I'm sure it would worsen if I scratched it at all.  I started to use the mixed aquafor and cortisone there and it has been really soothing.  I also have found that anything that rubs that spot--like a bra or the top of a shirt or camisole--even a piece of jewelry--irritates it and makes it feel a little itchy again, so have taken to going topless around the house whenever I can and that seems to help.  (I live alone so can get away with it.)   19/34",
      "MessageIndex": 817,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 14, 2013 07:30PM - edited Jul 14, 2013 07:32PM by nyama OK, I have a question.  About three times now (once near the beginning, once a couple of weeks ago, and once on Friday) as I've gotten my rads treatment, I swear that I've felt a vibration in my breast tissue during the zap.  Not painful but weird, sort of like a wide jolt of electricity without the pain, if that makes any sense.  It's mild, but strange.   Has anyone else ever felt this? I wonder if it somehow all in my head, for whatever reason...like maybe that is what I expect rads would feel like?   24/34",
      "MessageIndex": 946,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 11, 2013 11:07PM - edited Jul 11, 2013 11:22PM by nyama McKatherine, yes some make it through without many SE. I'm one who's been lucky enough to be in that position.  Maybe the fact that I was also lucky enough to not have to have chemo helps.  I don't know.  We're just all so different.   I have an occasional, very small, slightly itchy, mild rash-like spot near the top (not as itchy or as red today for some reason -- have only used aloe today, no hydrocortisone-aquaphor mix yet and I'm fine).  It's barely noticeable.   Sometimes I have a bit of fatigue in the late afternooon, but I can usually force myself through it and am then OK.  And I'm honestly not sure if the fatigue is schedule-related or radiation-related.  Probably a little of both (plus I just joined a dragonboat racing team and am trying to also work out a bit, which contributes).   Day before yesterday was pretty bad, but I take public transit about an hour and a half each way to rads, plus that day I had two other appointments--a dentist appt. at 7 am and a PS follow-up in the afternoon, with rads squeezed in-between and me taking transit to all, scattered all over town. Ugh. Up at 5 am and didn't get home till 6 pm.  No wonder I was fatigued! (Note to self: next time drive when multiple appts in same day!) I just finished rad #23 -- only 3 more whole-breast zaps and then I start my 8 boosts so....getting there.  I think if my skin were going to do something awful it would have started by now.  My breast just looks a little bit pinker and the skin is fine.   Wishing rapid healing to everyone who is having issues!  It will be over soon.  Sending gentle hugs and good wishes. Now that I'm nearing the end of this active phase of treatment, I'm actually getting a little anxious in the \"now what?\" sense.  Once rads is done, for the first time since March, I'm not going to have continual Dr appointments of one sort or another.  In fact, it will be almost a month after rads till I see my PS again for another follow-up, and I don't see my MO until September.  It's almost like imminent separation-anxiety or something.  I haven't been on the journey as long as some people have, and still....it's going to feel very very strange to not have to organize my days/weeks around Dr visits. 23/34",
      "MessageIndex": 888,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 12, 2013 01:33AM - edited Jul 12, 2013 01:37AM by nyama CassDugan, I'm using a 99% aloe gelly that I found in the health food section of the grocery store (I figured that was close enough to 100%, lol).  It's by Lily of the Desert (and only costs about $3.95 when on sale, $4.29 normally).  It doesn't have any alcohol it it, but does have a teeny-tiny bit of moisturizing oils in that remaining 1%, so it doesn't dry out the skin.   Others might have something else they prefer. You could use \"home-made\" 100% aloe, however, if you simply buy a plant and cut open the leaves to use the gel.  Some people do that and I hear it's pretty easy.  I'm too lazy, though. For what it's worth, I also take supplements of omega-3s, turmeric (curcumin), calcium + D3, and resveretrol and try to eat at least 70-80 gms of protein a day (& lots of fresh veggies and fruits).  No idea if it's made a difference or if I would've done OK anyway, but it makes me feel better (psychologically) to do it anyway.  RO is OK with it.  I'm also trying to get the old body in shape to deal with the next 5 years of anastrazole with as few SEs as possible. Ugh.  And to think....just six months ago I was so proud of myself for turning 60 and being healthy and not on any medications. Ha.        ",
      "MessageIndex": 896,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 17, 2013 10:32AM - edited Jul 17, 2013 10:32AM by nyama Congratulations to mfml and Lenn13ka!   On to my first boost today!  Wonder how it will compare to the old treatments.  Wonder if I'll still need to hold my breath  Guess I'll soon see! Have a good day everyone.",
      "MessageIndex": 984,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 17, 2013 07:46PM - edited Jul 17, 2013 07:51PM by nyama Sorry to hear about the cough, Heart.  Hope it's nothing worrisome and that it gets better quickly. Had my first boost today.  Well, that was different!  First the new rads machine they put me on was amazing--only a couple of months old, very silent and sleek. Second, the treatment was very fast.  The machine stayed in one position (straight down!) and no breath holding for me anymore.  Apparently they're using electrons for the boost, which don't penetrate the tissue as deeply so won't reach the heart, rather than photons, which do penetrate and which they use for the whole breast rads. I had a moment of \"eek!\" when I saw the machine aiming straight down at about a 1.5 inch diameter circle right over my heart and then just had to take a deep breath and trust that the RO and dosimetrist knows what he/she is doing. 27/34  ",
      "MessageIndex": 995,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 18, 2013 09:28PM - edited Jul 18, 2013 09:31PM by nyama Oh my.  They had massage-therapy students waiting around in the rads waiting room today to give massages to everyone who wanted one.  Ahhhhhh....  Wish they'd started doing this sooner, but happy for what I got!  They'll be doing it every Thursday for a while, but I only have one more Thursday.  I couldn't believe how tight my neck and shoulders were.  Much better now.   So I discovered it's still too soon to wear a bra.  I wasn't miserable but it just itched and  made me want to scratch my boob and I know that would be a horrible thing to do right now, so back to braless for a bit longer.  I'm grateful I'm able to get away with it at the moment. How did everyone's day go?  GWTF, how is the nausea?  I sure hope you were able to find something that worked to lessen that.  It sounds miserable.  And your cough, Heart? 28/34",
      "MessageIndex": 1025,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 19, 2013 10:46AM - edited Jul 19, 2013 10:51AM by nyama Welcome Aviatrix!  Glad you found us--lots to learn on this site and a goup of wonderful women to learn it with.  I'm also a teacher, so can relate to your \"if there's a good time....\" feelings.  Although I moved recently, so wasn't teaching this last semester, I did pick up some online courses for the college I was recently teaching at...but not now, for which I'm grateful.  Don't know if I could concentrate enough to grade, advise, lecture, etc.  I also will be starting the estrogen inhibitors soon--one week after I finish rads so something new to look forward to. Blech.  (But so grateful they now know enough about our cancers to focus our treatments specifically for our own biology.) Good luck with the turmeric, Heart.  I don't have asthma, but I've been taking it for a while now since it's also supposed to help with radiation.  But I know sciencegal has had some really positive results for her asthma in taking it.  Her advice has been to make sure you get the brand that also has piperine in it because it helps with the absorption.  There are a few threads on it here on the board.  The most recent active one is here: http://community.breastcancer.org/forum/58/topic/806914?page=1#idx_17 Thanks for the encouraging words, corky.  Only one more week left for me.  Yes!!!!",
      "MessageIndex": 1037,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 25, 2013 02:17PM - edited Jul 25, 2013 02:18PM by nyama Congratulations, GWTF and encyclias!!!!  You did it!!!!  Now time to breathe, relax, and heal.  And go on a wonderful vacation!! Tomorrow is my time to ring the bell!!  The massage-therapy students were waiting around to give us massages again today.  What a wonderful way to spend the second-to-last day of rads!  Taking my camera tomorrow to chronicle the last journey.  I've gotten to know all the drivers on the buses and streetcars so it's been like a journey with friends--strange to get a little sentimental about it but I am. 33/34",
      "MessageIndex": 1143,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Apr 26, 2013 09:45PM - edited Apr 26, 2013 09:54PM by nyama Hi everyone.  I'll be starting rads probably the second week of June (would've started it a couple of weeks earlier, but I have to go out of town for a job the first week of June, so that's pushing it back.)   I haven't even begun to explore this part of the journey yet, at least not much beyond the basics, but will be meeting my RO in about a week to get things started so I'm ready-to-go in June as soon as I get back. One caveat:  I haven't gotten my oncotype score back yet, so might end up having chemo first, which will push it back till later but thinking positively.  Hopefully I'll have a low score, so I can forego chemo and get started soon.",
      "MessageIndex": 42,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "May 10, 2013 08:00PM nyama wrote: Well, met with my RO for the first time yesterday.  He was very kind and very thorough.  Spent about an hour with me explaining exactly what we'll be doing, drawing pictures for me, etc.  I had some of the same worries as you, sophie786, since I, too, had a left-sided cancer plus I also have a history of some heart issues (atrial fibrillation).  In the diagrams that he drew for me he showed me how they can actually bend the radiation beam so that it avoids the heart tissue, which was pretty reassuring.  I wish I could remember enough to explain it well, but it has to do with these little \"leaves\" (I think that's the term he used?) they can open and close or adjust at the point where the radiation leaves the machine.  Plus when they do my CT scan and 3-d diagraming, they will have me hold my breath for some of the imaging to see if that helps lift the chest area even further from the heart.  If so, I'll need to hold my breath during certain parts of the radiation treatments.   He did say that it was pretty unavoidable that they'll be nicking a teeny-tiny portion of the lung, but said it's really, really rare for it to cause complications.  He's been doing it for about 30 years and has not yet had anyone have lung issues but needed to tell me it was a possibility.   I'll probably be having the rads for 6 weeks, but depending on what they see when they do the CT scan, I might not be getting the final few days of boost directed at the lumpectomy site.  Because of the fact that I also had oncoplasty, a lot of my breast tissue was rearranged so it might not be really clear where exactly that site is anymore, so waiting to hear about that.   I was hoping to do the shorter protocol, with two zaps a day, but unfortunately am not a candidate for that.  Oh well. So on the 30th I get my scan and tattoos. Yippee? ",
      "MessageIndex": 65,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 23, 2013 07:30PM - edited Jun 23, 2013 07:47PM by nyama Completed #10  this last Friday. Yay! Only 16 regular + 8 boosts to go!   I was busy all day yesterday, but it sure is nice to take a break and stay home today.  I've been a bit tired at the end of the day but I'm not sure if that's because of the rads or because of the schedule.  It's such a pain to get there every day for a 10 minute appointment, but oh well.   A couple of days last week I was just drop-down tired around 4 pm, but managed to work through it and got to bed only slightly earlier than my regular time.  I've decided to take the bus (and street-car) into town each day for my radiation.  I'm in a rural/suburban area and would have to travel into the city, about 20 miles each way, during rush hour, and who needs that stress?  It's also a lot cheaper, given the price of gas these days.  Plus I can catch up on my reading.  BUT, I have to leave earlier and it's a bit more effort so I'm thinking that may be why I'm so tired in the afternoons.   As for my skin, I feel blessed to be able to say so far so good.  I put on my aloe gelly right after treatment.  Found this 99% aloe gelly in the health food section of the store from \"Lily of the Desert,\" and it's only $3.95 a tube so I just slather it on.  Later I put the sweet almond oil on both breasts (and lately my face, too--am loving the stuff!)  Although I'm only a bit less than 1/3 of the way through, so far my skin looks great.  Maybe a tiny bit of pinking, but not much so far.  I'm sure it'll probably get worse but doing well so far. As for pain, honestly I can't tell.  I still have pain and weird sensations from the surgery so really it's not much different.  I don't think I'd necessarily recognize a new pain at this point.  My nipple is a bit pinker, but it has no feeling at all since my nipples were completely removed and reattached as skin grafts, so maybe that's a blessing at this point. Anyway...getting through this one step at a time! ",
      "MessageIndex": 557,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 16, 2013 10:15AM - edited Jul 16, 2013 10:21AM by nyama Thanks, everyone, for the feedback on my \"electric boob\" feeling.  Now I know I'm not totally crazy!  My last whole-boob zap today and then tomorrow start the 8 boosts.  I get to switch over to the brand new machine my facility recently bought for the boosts, as they finally get rid of the one I've been using.  The one I'm on now works fine (I hope!) but is about 12 years old and they like to have the newest equipment they can.  This new one apparently is very fancy and has lots of features the other didn't so it'll be interesting. When I asked the tech what happens to the old one she said they sometimes get sold to facilities in more impoverished developing countries.  She told me that in some of those places the way they have to administer radiation therapy is that there's actually a live radioactive source (like a tube of uranium or something like that) encased in lead with a little door-like thing they raise and shut to expose the patient's cancer to the necessary radiation.  Yikes.  So old Big Bertha the Zapper will soon be a huge improvement for someone.  I'm amost the last patient on this machine since it's her final week. Skin is still not bad.  Gets very itchy sometimes but ibuprofen helps somehow.  I've also noticed lately that too much of that aquaphor-hydrocortisone mix aggravates it, like it was clogging the pores or something.  I was itching pretty badly last evening and what made it better was washin it all that stuff off and just applying a little aloe before sleep, and taking my curcumin and a couple of ibuprofen.  I might just stick with the aloe from now on.  We'll see.  When I woke up this morning it was much less pink and barely itchy.  I'm sure it'll get worse, though, as the day goes on.  I've graduated to going almost completely braless since anything rubbing against it will make it itch more--maybe that will help.  No skin breakdown, though, and only a couple of teeny blisters so I'm really doing OK, especially compared to the misery some of you are going through, and so shouldn't even complain.  Just looks like a mild rash.  The fatigue sometimes hits hard.  Not every day, but most days in the afternoon.  Cozzoli, if I force myself to work/exercise through it, it does get better.  It's just getting myself to that point where I actually do it when all I want to do is nap.  The last weeks are definitely slump weeks for me!  I did get out with the dragonboat crew three times last week and did sort of OK (though it was a bit difficult energy-wise).    And will be walking around the zoo all afternoon with the grandbabies (two boys, 2 & 3 1/2) so better get over it! Keep on keeping on, everyone.  We all will get through this phase.   26/34",
      "MessageIndex": 967,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jul 23, 2013 05:12PM - edited Jul 23, 2013 05:12PM by nyama Congratulations to you, DiZZyMom!!!  Enjoy your well-deserved vacation!! 31/34",
      "MessageIndex": 1103,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "nyama wrote: I'm starting this thread because I thought it might be useful for those of us undergoing this procedure. (I surely can't be the only one that did it!) I did find a thread that was a couple of years old, but it really didn't address what I hope to here, which is a description of the process, experiences of the procedure, and what to expect afterwards.  While I've gotten some good information from the lumpectomy threads and some from the reconstruction threads, hopefully this is a way to put it all together.  What follows is a combination of what I've experienced and what I've read about oncoplasty as I researched it pre-op.  Hope it helps. What is it? Essentially, it's a lumpectomy combined with a bilateral reduction mammaplasty (bilateral lift and reduction) Why do it? Margins: This technique allows the surgeon to get large margins without fear of leaving the breast deformed or having the two breasts be lopsided after surgery. Good margins, as many of us know, are critical. My tumor was fairly shallow, so that is my closest margin, the one to the skin, and that one is 6mm. The rest are 14mm +. My lumpectomy specimen, as delivered to pathology, was 7 cm x 7 cm x 4 cm for a 1.7 cm tumor, so pretty large. In addition to that even more tissue was removed from my breast(s) by the plastic surgeon. If future breastfeeding isn't a concern, they try to remove a lot of the parenchymal tissue from both breasts (the ducts and lobules) so theoretically that might also reduce some recurrences (studies still underway). Radiation: From what my Dr. said and from what I've read, oncoplasty actually makes it easier for the follow-up radiation, which is an essential part of the treatment plan for oncoplastic lumpectomy, just like with regular lumpectomy. Easier positioning, easier to accurately dose, fewer complications. Edited to add follow-up 6 months after radiation: Radiation was very easy for me with no skin breakdown or major problems. I have no idea if the reduction surgery helped in that regard or if it would have been that way anyway, but just weighing in on my experience. Tumor location: Sometimes a tumor is located in a position that will make it more difficult for a breast surgeon to remove it all with good margins and still leave the breast looking fairly normal. In my case, my tumor was situated at about the 11:30 position, but much of it was actually under the areola-nipple complex. My surgical breast  oncologist immediately offered this procedure to me as the way to get the best oncological and cosmetic results from the surgery. It can also be used to allow the lumpectomy option for some women who might have tumors larger than what is usually considered optimal for breast conserving surgery. Physical/cosmetic: First, I should say that cosmetic results were almost the last thing on my mind when I started to go through this a couple of months ago. Having said that, I'm very satisfied with what my breasts look like/feel like now compared to my \"BC\" (Before Cancer) days. Not something I could have predicted as an outcome. While only a size D \"BC,\" my breasts were uncomfortable -- saggy (ptosis), heavy (bra-strap indentations), cumbersome. I never would have sought out any surgery like a lift and reduction, but now having had it I just feel much better, aside from the post-surgical pain. The main reason for doing it, for me, was not the cosmetics but for the oncological benefits...however, if I have to go through having cancer, it's a nice, unexpected consolation prize. Some plastic surgeons will only do one breast initially and then do the other after radiation is completed and they can match it up better to the treated breast. The other option, which mine did, was to do them both at once and leave the cancerous breast slightly larger, anticipating it'll shrink down a little bit after radiation, with the plan of evening them out later only if necessary.  Edited to add follow-up 6 months after radiation: My PS's calculations were pretty correct and the radiated breast has shrunk down a little bit so they're pretty close to equal.  It's still a tiny bit bigger, but I still feel occasional tightening going on so wouldn't be surprised if it shrinks down a tiny bit more.  I'm pretty happy with the result. The scars have also faded considerably and I suspect that eventually they'll barely be noticeable. Contraindications: Multi-focal cancers, certain kinds of aggressive cancers, any condition that would make a MX the best treatment of choice, not having access to an experienced team to perform the surgery (SO/BS + PS), small breasts. And probably more that I haven't run across yet. Complications/negatives: Like with any surgery, they happen. Sometimes margins are still compromised. Sometimes there are issues with healing. Sometimes there is a loss of sensation in parts of the breast (more on that in next post). Sometimes there is a loss of the ability to breastfeed. There is a longer recovery time as compared to regular lumpectomy. The next post will just focus on what I've learned in terms of preparation for surgery and recovering from the surgery, in case it might help someone else. There's a lot of information about oncoplasty online, but here are a couple of sites that seem credible that I've run across. http://www.hindawi.com/journals/ijso/2012/907576/#... http://www.ncbi.nlm.nih.gov/pmc/articles/PMC288471... Oncotype Score: 0; 4/15/13, lumpectomy with bilateral oncoplasty (reduction mammaplasty) \"I am not what happened to me, I am what I choose to become.\" - Carl Jung Dx 3/19/2013, IDC, 1cm, Stage IA, Grade 2, 0/2 nodes, ER+/PR+, HER2- Dx 4/15/2013, DCIS, 2cm, Stage 0, Grade 2, ER+/PR+, HER2- Surgery 4/15/2013 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 6/10/2013 Hormonal Therapy 8/2/2013 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 25, 2013 10:02PM - edited Jun 25, 2013 10:54PM by nyama momoschki --- I felt the same way after my surgery (I had about 400 grams removed).  My PS said they routinely get some really wide margins with this operation, which is one of the plusses. (But, yes, if for some reason there were poor margins, it would be hard/impossible to re-excise)   And yes, I think a lot of surgeons really aren't familiar with it, although more and more breast centers seem to be offering it, especially overseas.   It does take coordination with the PS.  All I know is that I'm very happy I went with this choice for my particular cancer. Mermaidia --- re: radiation....I'm actually in my third week right now.  My experience has been so far so good.  I have a very minimal rash starting now, but no biggie.  I'm sure it'll get a bit more intense (and some women do have more severe issues) but the biggest problem I've had with rads so far is getting there every day, which is kind of a pain.  I decided to save gas and wear and tear on my car, so I take the tri-met into downtown every day for my 10 minute appointment, about a minute of which is the actual radiation, and then turn around and head home. ",
      "MessageIndex": 14,
      "PostDate": "25/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 26, 2013 11:41PM - edited Jun 26, 2013 11:43PM by nyama Mermaidia, I'm going to Compass Oncology's Rose Quarter facility for the radiation.   (And I live in Canby!  .....which is why I decided to let tri-met do the driving, lol).   I kind of like that most of my treatment (except PS) is going through the same group--more communication.   The good news is that during those 6 weeks of radiation you get weekends off!  But, yeah, it's really a pain getting there everyday.  On the other hand I'm almost half done already!  Yay!  Anyway, radiation is definitely a part of going this route.  I would definitely ask your MO about the possible impact of radiation on your diabetes.  And certainly the RO, if you go with the lumpectomy/rads.  ",
      "MessageIndex": 17,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "May 29, 2013 08:47PM - edited Jun 28, 2013 09:29PM by nyama OK, so this is what I discovered in having this surgery. I didn't actually make all of the preparations I'm mentioning....but wish I had!!! Which is why I'm making the list for anyone else who might be interested. As I said in the last post, the surgery requires a joint team of BS and PS. My PS has been the one responsible for most of my physical follow-up (post-op visits, etc.) except for one follow-up with the BS. For the actual surgery, the PS made the initial incisions, based on our planning visit when I got to \"choose\" my ultimate breast shape, and then the BS stepped in to remove the cancer and do the sentinel node dissection/biopsy. It was a long surgery--about 3-4 hours. (Side-note: I just realized as I wrote this that that planning visit finally gave me a sense of control over a situation that, so far, had seemed so far OUT of my control. Never thought of it like that before, but it's definitely true. A plus.) Recovery from this surgery is a little different than from a regular lumpectomy. Some things are the same and some are different, so I'll just speak to my experiences even though some overlaps with that of a lumpectomy and some with some kinds of reconstruction and you'll find references to a lot of these things in one thread or another. When I woke up after surgery, I had a large compression bandage over my chest -- looked like a big, gauze, bra--and two drains, one on each side. I've read that some doctors use either ace wraps over a dressing or a surgical bra with dressings, but this was what I had. I wasn't draining much, so had the drains out and got to leave the hospital the next day, and kept that initial bandage on for a week, after which it was removed at the PS's office. I then had to wear a bra night and day for the next 2 weeks. Try to buy a good, COMFORTABLE, supportive bra (no underwires). I've had a terrible time finding one that works for me, mostly because of the way it rubs my incisions under my breasts. I'd recommend one with a wide band. I know they're out there, but I just haven't been able to get one that works for me. Should've done it from the beginning or used the hospital breast center for that! Plan on at least one week of doing almost nothing. Or, as my PS said, being a couch potato. That means no trips to the store, no going out to dinner, nothing. Technically, I was told not to drive for 3 weeks (!!!) since it pulls too much on the incisions, but I simply couldn't last that long and drove after a little over 2 weeks. Just a little (emergency trip to the store 1 mile away). I could see why I wasn't supposed to earlier, though. I basically set myself up a little nest with laptop and books in my bed and stayed there most of the time. So be prepared with plenty of food, including pet food, pre-prepared meals, and friends and family willing to help and act as chauffeurs. You will also be unable to raise your hands above your head for about 3 weeks, other than bending at the elbows to brush teeth, hair, etc., so prepare the house accordingly. I live alone, so took a supply of dishes & non- perishable food down from the higher cabinets and placed them on the countertops so I could reach them (who cares if the house looks like a mess, right?). The biggest unprepared-for problem for me was how to use the microwave, which is above my oven. I actually ended up using a step-stool so I could still reach the microwave without lifting my arms so I could zap my tea-water and some of the meals I'd prepared and frozen ahead of time. Wash your hair the night before/morning of surgery, since no showers for a week post-op, until the big bandage/dressing is removed. It's still difficult for a couple of weeks after that since you basically have to keep the operated area dry as you can in the shower and only bend your arms at the elbow to reach your head. And baths. I--finally--got the OK to take my first bath this week (6 weeks post-op) as long as I don't soak the breast area yet, since I'm still healing. So a half-bath, really, but it felt SO good! You won't be able to lift much for a while. Almost nothing the first week, and then up to around the weight of a milk container for the next couple of weeks. This presented a problem for me in a couple of unexpected ways. For instance, pouring the cat-food out of the ten lb. bag. (Solution - measuring cup inside the bag.) Also, things like opening/closing car doors or trying to open a lid from a jar or a child-proof medicine bottle cap presented unanticipated difficulties. The first week is especially rough. Needless to say, no laundry, no housework, no vacuuming for about 3 weeks (good excuse, right? ) And front-closing bras and tops are a big help in the first weeks. The hardest part for me was not being able to babysit my two, rambunctous little grand-baby boys. Can't lift them plus they have too many elbows and knees. But I suppose if I had to it could be done, with some planning, and there are some moms out there for whom this might be an issue, too. Something to plan ahead for and figure out a way to make it work. Pain and healing. I actually haven't had too much pain, nothing unbearable anyway. I stopped the pain pills the day I left the hospital and just used tylenol for a week, and then ibuprofen. However, it's now 6 weeks post-op and I'm still sore and tender. Some parts of the surface area of my breasts are actually numb due to the cut nerves, which is a weird feeling. Others are hypersensitive. Sometimes I feel sharp, shooting pains or a feeling like chills as nerves regenerate (or that's what it feels like they're doing). Sometimes the incision lines under my breasts feel like they're pulling...all part of the healing process I guess. I still have a little bit of scabbiness on a couple of the incisions. And I still have scabs on my nipples, which is not typical but a result of my particular procedure. As I mentioned in the last post, my tumor was right under the nipple, so the decision was made, because of the location and since I'm past my childbearing years (so no need to breastfeed) to actually remove my nipples during surgery as full-thickness skin grafts and then re-attach them after the tumor was out. (Ewwwww, right? I stopped reading the op report about the time it said they were \"properly labeled and placed on a moist sponge....\"). This is NOT the typical procedure, though, but specific to my case. However, it's not too bad, in case someone who is reading this will have to go through it. They will look nicer, eventually, as the PS made the areolar areas smaller. ( Mine were too big to start with and would've looked even worse on smaller breasts.) He was also able to place them higher on my reduced breast so they look nicer in that way, too. The first set of stitches around the nipples, holding on the pressure bandage, were removed after the first week. The second set, holding the nipple on (talk about Franken-boobs!) at about three weeks post-op. The drawback is that, as of now, they have no sensation and it's likely they never will, although I do notice some response to cold. Not that I can feel it, but I can see it. And it takes a while to heal.  So. Like I said, it's kind of a mix of procedure and recovery issues to have this done. Hopefully listing some of the particulars will help someone contemplating/preparing for  this surgery, not that I'm any authority or anything but I just didn't see another place where it was all combined so as to pertain specifically to oncoplasty. Despite some of the added difficulties compared to a lumpectomy only, I'm happy with my decision. Everyone is different, though. Feel free to ask any questions, or if anyone else has gone through this and has a diffierent or similar experience, please chime in and add your two-cents. Whew, this is a long post!",
      "MessageIndex": 1,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 23, 2013 03:49PM - edited Jun 23, 2013 03:51PM by nyama Hi Raven.  Well, I'm in Oregon (near Portland) but I know they do the surgery in other parts of the country.  I'd google \"oncoplasty doctor,\" or something similar, to see who is closer to you.  I'd imagine it would be larger cities with teaching hospitals, but probably not exclusively.  There seem to be a few procedures performed on the east coast and upper midwest.  Or maybe Texas would be an option, since it's much closer to you and I know they have some fine facilities down there. ETA:  I just googled \"oncoplasty doctor texas\" and came up with a few, although of course I don't know anything about them so you'd need to research them.   I'd try to go with a reputable cancer center. I do know the procedure is not right for everyone, but it wouldn't hurt to be evaluated to see.  I know I'm happy with my decision. Nancyinct, if you're still reading this thread, how did your surgery go?  ",
      "MessageIndex": 7,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "nyama wrote: I'm starting this thread because I thought it might be useful for those of us undergoing this procedure. (I surely can't be the only one that did it!) I did find a thread that was a couple of years old, but it really didn't address what I hope to here, which is a description of the process, experiences of the procedure, and what to expect afterwards.  While I've gotten some good information from the lumpectomy threads and some from the reconstruction threads, hopefully this is a way to put it all together.  What follows is a combination of what I've experienced and what I've read about oncoplasty as I researched it pre-op.  Hope it helps. What is it? Essentially, it's a lumpectomy combined with a bilateral reduction mammaplasty (bilateral lift and reduction) Why do it? Margins: This technique allows the surgeon to get large margins without fear of leaving the breast deformed or having the two breasts be lopsided after surgery. Good margins, as many of us know, are critical. My tumor was fairly shallow, so that is my closest margin, the one to the skin, and that one is 6mm. The rest are 14mm +. My lumpectomy specimen, as delivered to pathology, was 7 cm x 7 cm x 4 cm for a 1.7 cm tumor, so pretty large. In addition to that even more tissue was removed from my breast(s) by the plastic surgeon. If future breastfeeding isn't a concern, they try to remove a lot of the parenchymal tissue from both breasts (the ducts and lobules) so theoretically that might also reduce some recurrences (studies still underway). Radiation: From what my Dr. said and from what I've read, oncoplasty actually makes it easier for the follow-up radiation, which is an essential part of the treatment plan for oncoplastic lumpectomy, just like with regular lumpectomy. Easier positioning, easier to accurately dose, fewer complications. Edited to add follow-up 6 months after radiation: Radiation was very easy for me with no skin breakdown or major problems. I have no idea if the reduction surgery helped in that regard or if it would have been that way anyway, but just weighing in on my experience. Tumor location: Sometimes a tumor is located in a position that will make it more difficult for a breast surgeon to remove it all with good margins and still leave the breast looking fairly normal. In my case, my tumor was situated at about the 11:30 position, but much of it was actually under the areola-nipple complex. My surgical breast  oncologist immediately offered this procedure to me as the way to get the best oncological and cosmetic results from the surgery. It can also be used to allow the lumpectomy option for some women who might have tumors larger than what is usually considered optimal for breast conserving surgery. Physical/cosmetic: First, I should say that cosmetic results were almost the last thing on my mind when I started to go through this a couple of months ago. Having said that, I'm very satisfied with what my breasts look like/feel like now compared to my \"BC\" (Before Cancer) days. Not something I could have predicted as an outcome. While only a size D \"BC,\" my breasts were uncomfortable -- saggy (ptosis), heavy (bra-strap indentations), cumbersome. I never would have sought out any surgery like a lift and reduction, but now having had it I just feel much better, aside from the post-surgical pain. The main reason for doing it, for me, was not the cosmetics but for the oncological benefits...however, if I have to go through having cancer, it's a nice, unexpected consolation prize. Some plastic surgeons will only do one breast initially and then do the other after radiation is completed and they can match it up better to the treated breast. The other option, which mine did, was to do them both at once and leave the cancerous breast slightly larger, anticipating it'll shrink down a little bit after radiation, with the plan of evening them out later only if necessary.  Edited to add follow-up 6 months after radiation: My PS's calculations were pretty correct and the radiated breast has shrunk down a little bit so they're pretty close to equal.  It's still a tiny bit bigger, but I still feel occasional tightening going on so wouldn't be surprised if it shrinks down a tiny bit more.  I'm pretty happy with the result. The scars have also faded considerably and I suspect that eventually they'll barely be noticeable. Contraindications: Multi-focal cancers, certain kinds of aggressive cancers, any condition that would make a MX the best treatment of choice, not having access to an experienced team to perform the surgery (SO/BS + PS), small breasts. And probably more that I haven't run across yet. Complications/negatives: Like with any surgery, they happen. Sometimes margins are still compromised. Sometimes there are issues with healing. Sometimes there is a loss of sensation in parts of the breast (more on that in next post). Sometimes there is a loss of the ability to breastfeed. There is a longer recovery time as compared to regular lumpectomy. The next post will just focus on what I've learned in terms of preparation for surgery and recovering from the surgery, in case it might help someone else. There's a lot of information about oncoplasty online, but here are a couple of sites that seem credible that I've run across. http://www.hindawi.com/journals/ijso/2012/907576/#... http://www.ncbi.nlm.nih.gov/pmc/articles/PMC288471... Oncotype Score: 0; 4/15/13, lumpectomy with bilateral oncoplasty (reduction mammaplasty) \"I am not what happened to me, I am what I choose to become.\" - Carl Jung Dx 3/19/2013, IDC, 1cm, Stage IA, Grade 2, 0/2 nodes, ER+/PR+, HER2- Dx 4/15/2013, DCIS, 2cm, Stage 0, Grade 2, ER+/PR+, HER2- Surgery 4/15/2013 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 6/10/2013 Hormonal Therapy 8/2/2013 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Jun 1, 2013 07:26PM - edited Jun 28, 2013 09:27PM by nyama Hi Nancyinct - Sounds like your PS is giving you some of the same medications as I had.  I had the keflex and percocet and WISH I'd known to take something like colace because, yeow!  I've never needed a stool softener before but those pain meds are horribly constipating, which I didn't know.  I only needed percocet the day I came home and stopped the next day (thank goodness because I still was constipated for days afterwards.)  While I, personally, wasn't nauseated, I know some people get that way after surgery.   I'll also have to look into those tagaderm patches (thanks for the links)  My incisions still  bother me, especially the ones under the breast where my bra rubs me.  They alternately itch and burn.  The rest of the my breasts are just tender, overall, but support really helps. I bet you'll be so happy to have that surgery over with!  I know I was.  I just wanted the cancer o.u.t. and have it be behind me. And I also had issues sleeping (and eating).  It seemed to get better over time, though, as by putting one foot in front of the other I've walked my way through this.  I was afraid of how much this surgery would hurt and tried to imagine it but, honestly, it hasn't been too bad (at least compared to what I anticipated).   It's no fun being sore and scabby but it's not intolerable by any means.  Hopefully they'll be able to successfully get all of your DCIS with good margins.  That's the beauty of this technique in that the PS can basically work around whatever the BS needs to do.   Thinking positive thoughts for you that they'll be able to get it all.   Will they be doing a wire guided lumpectomy?  (I'm not sure if it is the same for DCIS as IDC. )  Another good thing is it sounds like your Drs are being really communicative with you about what to expect.    So sounds like you're very lucky!",
      "MessageIndex": 4,
      "PostDate": "01/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "nyama wrote: I'm starting this thread because I thought it might be useful for those of us undergoing this procedure. (I surely can't be the only one that did it!) I did find a thread that was a couple of years old, but it really didn't address what I hope to here, which is a description of the process, experiences of the procedure, and what to expect afterwards.  While I've gotten some good information from the lumpectomy threads and some from the reconstruction threads, hopefully this is a way to put it all together.  What follows is a combination of what I've experienced and what I've read about oncoplasty as I researched it pre-op.  Hope it helps. What is it? Essentially, it's a lumpectomy combined with a bilateral reduction mammaplasty (bilateral lift and reduction) Why do it? Margins: This technique allows the surgeon to get large margins without fear of leaving the breast deformed or having the two breasts be lopsided after surgery. Good margins, as many of us know, are critical. My tumor was fairly shallow, so that is my closest margin, the one to the skin, and that one is 6mm. The rest are 14mm +. My lumpectomy specimen, as delivered to pathology, was 7 cm x 7 cm x 4 cm for a 1.7 cm tumor, so pretty large. In addition to that even more tissue was removed from my breast(s) by the plastic surgeon. If future breastfeeding isn't a concern, they try to remove a lot of the parenchymal tissue from both breasts (the ducts and lobules) so theoretically that might also reduce some recurrences (studies still underway). Radiation: From what my Dr. said and from what I've read, oncoplasty actually makes it easier for the follow-up radiation, which is an essential part of the treatment plan for oncoplastic lumpectomy, just like with regular lumpectomy. Easier positioning, easier to accurately dose, fewer complications. Edited to add follow-up 6 months after radiation: Radiation was very easy for me with no skin breakdown or major problems. I have no idea if the reduction surgery helped in that regard or if it would have been that way anyway, but just weighing in on my experience. Tumor location: Sometimes a tumor is located in a position that will make it more difficult for a breast surgeon to remove it all with good margins and still leave the breast looking fairly normal. In my case, my tumor was situated at about the 11:30 position, but much of it was actually under the areola-nipple complex. My surgical breast  oncologist immediately offered this procedure to me as the way to get the best oncological and cosmetic results from the surgery. It can also be used to allow the lumpectomy option for some women who might have tumors larger than what is usually considered optimal for breast conserving surgery. Physical/cosmetic: First, I should say that cosmetic results were almost the last thing on my mind when I started to go through this a couple of months ago. Having said that, I'm very satisfied with what my breasts look like/feel like now compared to my \"BC\" (Before Cancer) days. Not something I could have predicted as an outcome. While only a size D \"BC,\" my breasts were uncomfortable -- saggy (ptosis), heavy (bra-strap indentations), cumbersome. I never would have sought out any surgery like a lift and reduction, but now having had it I just feel much better, aside from the post-surgical pain. The main reason for doing it, for me, was not the cosmetics but for the oncological benefits...however, if I have to go through having cancer, it's a nice, unexpected consolation prize. Some plastic surgeons will only do one breast initially and then do the other after radiation is completed and they can match it up better to the treated breast. The other option, which mine did, was to do them both at once and leave the cancerous breast slightly larger, anticipating it'll shrink down a little bit after radiation, with the plan of evening them out later only if necessary.  Edited to add follow-up 6 months after radiation: My PS's calculations were pretty correct and the radiated breast has shrunk down a little bit so they're pretty close to equal.  It's still a tiny bit bigger, but I still feel occasional tightening going on so wouldn't be surprised if it shrinks down a tiny bit more.  I'm pretty happy with the result. The scars have also faded considerably and I suspect that eventually they'll barely be noticeable. Contraindications: Multi-focal cancers, certain kinds of aggressive cancers, any condition that would make a MX the best treatment of choice, not having access to an experienced team to perform the surgery (SO/BS + PS), small breasts. And probably more that I haven't run across yet. Complications/negatives: Like with any surgery, they happen. Sometimes margins are still compromised. Sometimes there are issues with healing. Sometimes there is a loss of sensation in parts of the breast (more on that in next post). Sometimes there is a loss of the ability to breastfeed. There is a longer recovery time as compared to regular lumpectomy. The next post will just focus on what I've learned in terms of preparation for surgery and recovering from the surgery, in case it might help someone else. There's a lot of information about oncoplasty online, but here are a couple of sites that seem credible that I've run across. http://www.hindawi.com/journals/ijso/2012/907576/#... http://www.ncbi.nlm.nih.gov/pmc/articles/PMC288471... Oncotype Score: 0; 4/15/13, lumpectomy with bilateral oncoplasty (reduction mammaplasty) \"I am not what happened to me, I am what I choose to become.\" - Carl Jung Dx 3/19/2013, IDC, 1cm, Stage IA, Grade 2, 0/2 nodes, ER+/PR+, HER2- Dx 4/15/2013, DCIS, 2cm, Stage 0, Grade 2, ER+/PR+, HER2- Surgery 4/15/2013 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 6/10/2013 Hormonal Therapy 8/2/2013 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "Mar 3, 2014 12:28AM - edited Mar 3, 2014 12:31AM by nyama In my post-op pathology report, the ductal/lobular tissue they took out was referred to as \"parenchymal\" tissue, so maybe there's some reference to that in the report. I know they took out a LOT of mine, along with the fibrous and fatty stuff.  ",
      "MessageIndex": 78,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "nyama wrote: I'm starting this thread because I thought it might be useful for those of us undergoing this procedure. (I surely can't be the only one that did it!) I did find a thread that was a couple of years old, but it really didn't address what I hope to here, which is a description of the process, experiences of the procedure, and what to expect afterwards.  While I've gotten some good information from the lumpectomy threads and some from the reconstruction threads, hopefully this is a way to put it all together.  What follows is a combination of what I've experienced and what I've read about oncoplasty as I researched it pre-op.  Hope it helps. What is it? Essentially, it's a lumpectomy combined with a bilateral reduction mammaplasty (bilateral lift and reduction) Why do it? Margins: This technique allows the surgeon to get large margins without fear of leaving the breast deformed or having the two breasts be lopsided after surgery. Good margins, as many of us know, are critical. My tumor was fairly shallow, so that is my closest margin, the one to the skin, and that one is 6mm. The rest are 14mm +. My lumpectomy specimen, as delivered to pathology, was 7 cm x 7 cm x 4 cm for a 1.7 cm tumor, so pretty large. In addition to that even more tissue was removed from my breast(s) by the plastic surgeon. If future breastfeeding isn't a concern, they try to remove a lot of the parenchymal tissue from both breasts (the ducts and lobules) so theoretically that might also reduce some recurrences (studies still underway). Radiation: From what my Dr. said and from what I've read, oncoplasty actually makes it easier for the follow-up radiation, which is an essential part of the treatment plan for oncoplastic lumpectomy, just like with regular lumpectomy. Easier positioning, easier to accurately dose, fewer complications. Edited to add follow-up 6 months after radiation: Radiation was very easy for me with no skin breakdown or major problems. I have no idea if the reduction surgery helped in that regard or if it would have been that way anyway, but just weighing in on my experience. Tumor location: Sometimes a tumor is located in a position that will make it more difficult for a breast surgeon to remove it all with good margins and still leave the breast looking fairly normal. In my case, my tumor was situated at about the 11:30 position, but much of it was actually under the areola-nipple complex. My surgical breast  oncologist immediately offered this procedure to me as the way to get the best oncological and cosmetic results from the surgery. It can also be used to allow the lumpectomy option for some women who might have tumors larger than what is usually considered optimal for breast conserving surgery. Physical/cosmetic: First, I should say that cosmetic results were almost the last thing on my mind when I started to go through this a couple of months ago. Having said that, I'm very satisfied with what my breasts look like/feel like now compared to my \"BC\" (Before Cancer) days. Not something I could have predicted as an outcome. While only a size D \"BC,\" my breasts were uncomfortable -- saggy (ptosis), heavy (bra-strap indentations), cumbersome. I never would have sought out any surgery like a lift and reduction, but now having had it I just feel much better, aside from the post-surgical pain. The main reason for doing it, for me, was not the cosmetics but for the oncological benefits...however, if I have to go through having cancer, it's a nice, unexpected consolation prize. Some plastic surgeons will only do one breast initially and then do the other after radiation is completed and they can match it up better to the treated breast. The other option, which mine did, was to do them both at once and leave the cancerous breast slightly larger, anticipating it'll shrink down a little bit after radiation, with the plan of evening them out later only if necessary.  Edited to add follow-up 6 months after radiation: My PS's calculations were pretty correct and the radiated breast has shrunk down a little bit so they're pretty close to equal.  It's still a tiny bit bigger, but I still feel occasional tightening going on so wouldn't be surprised if it shrinks down a tiny bit more.  I'm pretty happy with the result. The scars have also faded considerably and I suspect that eventually they'll barely be noticeable. Contraindications: Multi-focal cancers, certain kinds of aggressive cancers, any condition that would make a MX the best treatment of choice, not having access to an experienced team to perform the surgery (SO/BS + PS), small breasts. And probably more that I haven't run across yet. Complications/negatives: Like with any surgery, they happen. Sometimes margins are still compromised. Sometimes there are issues with healing. Sometimes there is a loss of sensation in parts of the breast (more on that in next post). Sometimes there is a loss of the ability to breastfeed. There is a longer recovery time as compared to regular lumpectomy. The next post will just focus on what I've learned in terms of preparation for surgery and recovering from the surgery, in case it might help someone else. There's a lot of information about oncoplasty online, but here are a couple of sites that seem credible that I've run across. http://www.hindawi.com/journals/ijso/2012/907576/#... http://www.ncbi.nlm.nih.gov/pmc/articles/PMC288471... Oncotype Score: 0; 4/15/13, lumpectomy with bilateral oncoplasty (reduction mammaplasty) \"I am not what happened to me, I am what I choose to become.\" - Carl Jung Dx 3/19/2013, IDC, 1cm, Stage IA, Grade 2, 0/2 nodes, ER+/PR+, HER2- Dx 4/15/2013, DCIS, 2cm, Stage 0, Grade 2, ER+/PR+, HER2- Surgery 4/15/2013 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 6/10/2013 Hormonal Therapy 8/2/2013 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 124,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    },
    {
      "AuthorID": "nyama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173264/profile",
      "Content": "nyama wrote: I'm starting this thread because I thought it might be useful for those of us undergoing this procedure. (I surely can't be the only one that did it!) I did find a thread that was a couple of years old, but it really didn't address what I hope to here, which is a description of the process, experiences of the procedure, and what to expect afterwards.  While I've gotten some good information from the lumpectomy threads and some from the reconstruction threads, hopefully this is a way to put it all together.  What follows is a combination of what I've experienced and what I've read about oncoplasty as I researched it pre-op.  Hope it helps. What is it? Essentially, it's a lumpectomy combined with a bilateral reduction mammaplasty (bilateral lift and reduction) Why do it? Margins: This technique allows the surgeon to get large margins without fear of leaving the breast deformed or having the two breasts be lopsided after surgery. Good margins, as many of us know, are critical. My tumor was fairly shallow, so that is my closest margin, the one to the skin, and that one is 6mm. The rest are 14mm +. My lumpectomy specimen, as delivered to pathology, was 7 cm x 7 cm x 4 cm for a 1.7 cm tumor, so pretty large. In addition to that even more tissue was removed from my breast(s) by the plastic surgeon. If future breastfeeding isn't a concern, they try to remove a lot of the parenchymal tissue from both breasts (the ducts and lobules) so theoretically that might also reduce some recurrences (studies still underway). Radiation: From what my Dr. said and from what I've read, oncoplasty actually makes it easier for the follow-up radiation, which is an essential part of the treatment plan for oncoplastic lumpectomy, just like with regular lumpectomy. Easier positioning, easier to accurately dose, fewer complications. Edited to add follow-up 6 months after radiation: Radiation was very easy for me with no skin breakdown or major problems. I have no idea if the reduction surgery helped in that regard or if it would have been that way anyway, but just weighing in on my experience. Tumor location: Sometimes a tumor is located in a position that will make it more difficult for a breast surgeon to remove it all with good margins and still leave the breast looking fairly normal. In my case, my tumor was situated at about the 11:30 position, but much of it was actually under the areola-nipple complex. My surgical breast  oncologist immediately offered this procedure to me as the way to get the best oncological and cosmetic results from the surgery. It can also be used to allow the lumpectomy option for some women who might have tumors larger than what is usually considered optimal for breast conserving surgery. Physical/cosmetic: First, I should say that cosmetic results were almost the last thing on my mind when I started to go through this a couple of months ago. Having said that, I'm very satisfied with what my breasts look like/feel like now compared to my \"BC\" (Before Cancer) days. Not something I could have predicted as an outcome. While only a size D \"BC,\" my breasts were uncomfortable -- saggy (ptosis), heavy (bra-strap indentations), cumbersome. I never would have sought out any surgery like a lift and reduction, but now having had it I just feel much better, aside from the post-surgical pain. The main reason for doing it, for me, was not the cosmetics but for the oncological benefits...however, if I have to go through having cancer, it's a nice, unexpected consolation prize. Some plastic surgeons will only do one breast initially and then do the other after radiation is completed and they can match it up better to the treated breast. The other option, which mine did, was to do them both at once and leave the cancerous breast slightly larger, anticipating it'll shrink down a little bit after radiation, with the plan of evening them out later only if necessary.  Edited to add follow-up 6 months after radiation: My PS's calculations were pretty correct and the radiated breast has shrunk down a little bit so they're pretty close to equal.  It's still a tiny bit bigger, but I still feel occasional tightening going on so wouldn't be surprised if it shrinks down a tiny bit more.  I'm pretty happy with the result. The scars have also faded considerably and I suspect that eventually they'll barely be noticeable. Contraindications: Multi-focal cancers, certain kinds of aggressive cancers, any condition that would make a MX the best treatment of choice, not having access to an experienced team to perform the surgery (SO/BS + PS), small breasts. And probably more that I haven't run across yet. Complications/negatives: Like with any surgery, they happen. Sometimes margins are still compromised. Sometimes there are issues with healing. Sometimes there is a loss of sensation in parts of the breast (more on that in next post). Sometimes there is a loss of the ability to breastfeed. There is a longer recovery time as compared to regular lumpectomy. The next post will just focus on what I've learned in terms of preparation for surgery and recovering from the surgery, in case it might help someone else. There's a lot of information about oncoplasty online, but here are a couple of sites that seem credible that I've run across. http://www.hindawi.com/journals/ijso/2012/907576/#... http://www.ncbi.nlm.nih.gov/pmc/articles/PMC288471... Oncotype Score: 0; 4/15/13, lumpectomy with bilateral oncoplasty (reduction mammaplasty) \"I am not what happened to me, I am what I choose to become.\" - Carl Jung Dx 3/19/2013, IDC, 1cm, Stage IA, Grade 2, 0/2 nodes, ER+/PR+, HER2- Dx 4/15/2013, DCIS, 2cm, Stage 0, Grade 2, ER+/PR+, HER2- Surgery 4/15/2013 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 6/10/2013 Hormonal Therapy 8/2/2013 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805399",
      "Title": "Lumpectomy with oncoplasty (bilateral reduction mammaplasty) nyama cev20"
    }
  ]
}