{
  "AuthorID": "NYCMOM3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
  "Posts": [
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Dec 14, 2012 12:24PM NYCMOM3 wrote: Hi, Ladies. I met with the oncologist today, who said I don't need chemo (YAY!) but I do need to take Tamoxifen for 5 years. 5 years? I've already gained 10 lbs from inactivity and depression, and when I asked if it would put weight on, she said it's \"not a diet pill\". Is anyone else taking Tamoxifen? How is your body reacting? She said to start very soon, but if I did want to wait until after the holidays she'd understand. I also know that I may experience hot flashes. I guess at least it's winter. Maybe I'll save on heating bills. Sigh. As for the weight, I gain on EVERYTHING. I can't take birth control pills, even the ones that people swear they lose weight on - I gain within 2 weeks so I gave up a long time ago. I guess it's just how I'm wired. Still don't know about radiation. Margins were close so we have to meet with the radiologist soon to discuss. I can't take any more icky news. I just want my exchange surgery asap. The Tamoxifen threw me through a loop though. Didn't see that one coming for some reason. http://breastcancernycmom.blogspot.com",
      "MessageIndex": 834,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Jan 4, 2013 04:41AM NYCMOM3 wrote: I actually feel deeper in the hole now. Surgery has passed, but I'm starting radiation Monday, supposedly. They've changed my start date a few times. I also am being told that I need to take tamoxifen and am NOT thrilled about that at all. Side effects look awful, and while the docs seem to think they don't exist, or that \"not everyone has problems\", from where I'm looking, it seems EVERYONE does. I'm going to ask them if I can stop and start as it seems the receptors will not automatically spring back if I stop taking the pills for a while. Anyone else have experience with that?",
      "MessageIndex": 885,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Sep 30, 2012 11:10AM NYCMOM3 wrote: Hi, all. I am having a mastectomy with reconstruction on my left side on Oct 24. Not only am I freaked out, but my ex husband is being worse than usual -  Like I need more stress right now! I guess that's what ex-husbands are for.  Luckily, my husband is wonderful - we just got married in July. We haven't told my daughter yet (she's 11). I don't know how. Every time I think about it I start bawling uncontrollably and I know she doesn't need to see that. How did anyone here handle that?   My mom was diagnosed at 39 and passed right after her 50th. My aunt and cousin on her side had it in their mid 20's, aunt passed but cousin survived. I'm 41. And my gene test came back negative. That was a relief. That will certainly help in our discussions with my little girl. Any advice?   breastcancernycmom.blogspot.com ",
      "MessageIndex": 26,
      "PostDate": "30/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Oct 28, 2012 02:32PM NYCMOM3 wrote: Hi all. I had my mastectomy Wednesday. Left side. Expander was put in.  I really was not prepared for how horrible it would look. I mean, I knew. But still. Otherwise, I've been feeling well. The meds made me really sick so I have been taking pain meds when absolutely necessary. In fact, I feel more tightness than anything. Been eating, husband is a doll - he bathes me, washed my hair (and I have a LOT - it's a real process!).   They took 6 nodes and they came out clean!!!  I'm really thrilled. So far my wardrobe has been of course the surgical bra (not so pretty, huh?), and either a sexy nightie (I can step into them so they've been really great to wear!) or dresses. Just home, so you can see the bra but it's nice to feel as pretty as I can. I've been wearing makeup too, and my man has been brushing my hair.  My armpit looks like hell though - I can't wait for the bruising to go away and the cuts, ugh. It's so hard to use that arm but gets easier every day. I'm looking forward to this nightmare being done. But am thrilled to be alive. I cry a lot, still. Everything reminds me of my mom who I lost when I was 18 to BC. Even my scar, but she didn't have reconstruction so it was really caved in. But I know she would be proud of how strong I have been, and thrilled that I have a good husband to take care of me. She was on her own, and I did what I could. Oh, and no gene. So my daughter (11) was thrilled to hear that. Me too, of course. Good luck to everyone out there. I am amazed at how much I have kept myself together through this ordeal. I love that there is a strong community of us out there.   Here's my little blog that helps keep my sanity in check.  http://breastcancernycmom.blogspot.com",
      "MessageIndex": 353,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Dec 10, 2012 10:10AM NYCMOM3 wrote: Hey Politico! I've been massaging the crap out of it, and found that if hubby does, it's more effective. Apparently, it's tough to inflict that much self pain. Agh. I've had ridiculous insomnia, and once I wake up in the morning, I never go back to sleep. I hate the thought of having to get up twice in one day - it's weird but true. I hate the feeling of getting up with this stupid expander in my body. Even when it's not so bad. And now I'm almost a week past my last fill (woohoo!) but still, it creeps me out. I have been using melatonin, but find it's just not enough. I've also been using Advil PM - I hate meds but this works better for me, so occasionally I will. Other things that help - a glass of wine or a shot of Bailey's. I was never much of a drinker and still am not, and by a glass of wine, it's a miracle if I actually drink a glass. The Bailey's helps when I'm craving sweets at night. I'm hoping that with time, things will get back to normal - the cording and the sleeplessness and the creepy feeling of getting up after sleeping.  But if the cording could just go away, I could forgive the other two for a while. Back to stretching and massaging! http://breastcancernycmom.blogspot.com",
      "MessageIndex": 818,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Jan 12, 2013 08:37AM NYCMOM3 wrote: I have 3 tats for radiation and they're just little freckles. I've completed a week (5 treatments) and feel tired and was a little queasy at the beginning, but I don't know if that was the stress. Glad to have the weekend off. My skin looks a bit red already but nothing too bad. Good luck!",
      "MessageIndex": 904,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Jun 16, 2013 06:41PM NYCMOM3 wrote: These are implants too. My body doesn't do well with surgery or meds usually, so I'm not shocked - but am hoping for a quicker fix than \"patience\"!!!",
      "MessageIndex": 1002,
      "PostDate": "16/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Jun 28, 2013 08:01PM NYCMOM3 wrote: I'm in Chelsea. You?",
      "MessageIndex": 1009,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Oct 29, 2012 08:00AM NYCMOM3 wrote: Does anyone else feel a sort of vibration in the surgical site? Is it the muscle spasming? Is it the expander? Is it my head? Is there an alternative OTC pain medication? I HATE the stuff I have now. It helps but there is always a price to pay. I showed my daughter part of the scar today, she was curious. She said it wasn't as bad as she thought. I'm glad she didn't see the whole thing. The armpit scares her more though. I'm trying my best to act like it's all ok. It's the toughest acting job, ever.",
      "MessageIndex": 362,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Nov 3, 2012 06:11AM - edited Nov 3, 2012 06:13AM by NYCMOM3 I did a photo shoot pre-surgery, with a wonderful photographer who did our wedding photos (which was right before my diagnosis!)  She came over last night for dinner, and we got the disc. How surreal to look at photos of my now missing breast. I'm crying now thinking of it. I never thought much of \"it\", but now I think, it's gone. My nipple is gone. I have this damn expander in, and while with a sports bra I look fairly normal now that I've had a fill, I can peek in and see that it's a huge cut, my skin is wrinkled like a shar-pei, my nipple is gone, and I always feel the pressure and loss of ROM and know why. I'm very emotional at night and in the morning. I'm sure it's partly because it's uncomfortable getting into a laying position, and more uncomfortable getting out of it. So once I get up to use the bathroom, I'm UP.  Nevertheless, I'm glad I did the shoot. Nobody will ever see them, but we have proof that I once had a real breast on my left side! I'm glad I didn't chicken out, which was really, really close to happening. I never did pregnancy pictures (in fact, I have almost NO pictures of me pregnant!) and I regret that.  Enough of my Saturday morning pity-party. I'm going to attempt to wash my own hair now. Glad I'm approved for real showers since drain removal, but I'm still super scared to do too much on my own. The last thing I need is to tear something and end up in the hospital, especially since that whole scene is a real disaster since the storm. Have a beautiful weekend, ladies! Here is the Very good news - we're all alive.  <3 http://breastcancernycmom.blogspot.com",
      "MessageIndex": 445,
      "PostDate": "03/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Dec 10, 2012 06:21AM NYCMOM3 wrote: Hi girls. I've been MIA for a while, but wanted to ask about scar tissue cording. I've been massaging and stretchig the crap out of it, but this thing won't go away. It will temporarily and seems to come back just as bad or worse. Any idea what I can do? Is it just something that will go away with time? Is there some sort of product I can use on it?  Also, I hate yawning and stretching in the morning. I know it's silly, but I'm so afraid of something awful happening to my expander! It just feels creepy. Last week was my last fill, thank goodness! I'm meeing the oncologist Friday to see if I need radiation or chemo. Apparently the cells were very close to the surface and I had little fat between the breast tissue and skin (the one time my fitness didn't help me!) So, fingers crossed that I'm going to be radiation and chemo free - I'm so ready to move on with my life. And this \"barbie boob\" is driving me crazy! Since I only had one side done, it's hard to dress in a way that masks it. But, as always, I'm glad to be alive!  If this cording would go away, I'd be so much happier, but in a strange way I'm used to it. http://breastcancernycmom.blogspot.com",
      "MessageIndex": 816,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Jun 16, 2013 03:31PM NYCMOM3 wrote: Hi, all!  I finally had my exchange surgery on Thursday. That was a long wait, but with the radiation, we had to. Any tips on reducing overall swelling? Like in my abdomen mostly? I'm drinking water, eating fruit, not much salt, and I look like a beach ball. That on top of the insult of recovering from surgery sucks. Post op on Wednesday, so hopefully I'll be back to me, but I hate feeling puffy! Thanks!",
      "MessageIndex": 1000,
      "PostDate": "16/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Jun 18, 2013 04:40PM NYCMOM3 wrote: Thanks all. Doc said no ice - I think because I'm so numb there that I wouldn't feel if it started to burn! I've been walking as much as I can and drinking tons of water and fruit infused water that i make at home (orange, lime, cucumber and mint leaves) and thankfully it's come down quite a bit. Hubby noticed this morning and said I looked better than ever - I can't imagine with the ace bandage wrapped around me that this is the case, but definitely better in this entire process! Gads, that expander looked crazy. Anyway, post-op visit tomorrow afternoon, looking forward to progress! ",
      "MessageIndex": 1007,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Oct 29, 2012 08:55AM NYCMOM3 wrote: YES! Very similar to the milk coming in. I think I described that also as a vibration.   How are people washing the chopped up armpit? We're just running clear water over it but I really hate feeling grimy. I suppose I can't do much else until it heals up, right? The last thing I want to do is cause problems with the site, but at the same time, it doesn't help my nausuea!!!   My daughter has had 3 major surgeries, 2 were before a year old but her last was when she was 8. She remembers and she was SO strong, she refused any pain meds because she reacted like I did and got really sick. She's been really good to me. Except the homework, but some things never change, and maybe a bit of normalcy is good.  ;)",
      "MessageIndex": 364,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Nov 14, 2012 08:31AM NYCMOM3 wrote: 600????  Well, 300 each side, but still - WOW! I've had two so far (I only have one side that needs reconstruction), the first was 100 and second was 60. And I was sore as heck - back, neck, shoulders. Holy moly! I have a fill tomorrow. Last time they told me maybe 5 more. It IS surreal though, I remember coming home from surgery and looking at that deflated *thing*, and two fills later I have something that resembles an actual breast! Congrats, Connie! How soon will the exchange be for you? http://breastcancernycmom.blogspot.com",
      "MessageIndex": 611,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Nov 2, 2012 05:30AM NYCMOM3 wrote: I had my post -op visit yesterday which was a miracle, considering both my surgeons have no electricity yet (NYC) - the ps borrowed medical space to see as many patients as he could! I had the drain taken out (he said we may need to aspirate next week but I don't care - the drain was driving me nuts!) and they filled my expander a bit. It's REALLY tight but my husband noticed how much happier I seemed last night. I could finally ditch the surgical bra (it was so tight! OWCH!) and borrow one from my 11 year old, go figure. She likes the very stretchy ones that look like a sports top. Now I know why! Plus it seems I don't need support (I went home braless) at least on the cancer side, but I feel too exposed, as if this thin material will protect me from being bumped or something!?!?!?  Anyway, I have been rubbing arnica cream on the armpit bruises and it's doing wonders.  It all still sucks, I hate all of it, but am starting to see the light at the end of the tunnel. I hope everyone is well and safe after the hurricane. We luckily kept power in our building, but were surrounded by darkness. Many friends are still without, and while we will let folks come here and hang out, shower, eat, I think it's probably feeling like an imposition given my \"condition\". Right now, I just feel lucky to be alive. http://breastcancernycmom.blogspot.com",
      "MessageIndex": 439,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Aug 14, 2010 09:07PM NYCMOM3 wrote: Thanks so much, it really means a lot.  I know it must be hard for him on the outside, but not respecting my own way of dealing (and this worked so much better than non-stop crying like in the past!) is so painful to me.  Now I wait, I hope it's not too long.  Thank you for being there for me.  My mom didn't tell me about her initial diagnosis but I was old enough when it came back (and of course I knew she was sick when she went away and had all of those treatments, the hair etc...) I remember feeling so scared but she didn't talk about it with me.  Your boys are so very young, do they know anything? My daughter is 9 and so sensitive.  Of course I won't say a word until I get my diagnosis, and only if it's BC, but I am not sure how to handle it. I guess that will come when it does.  Thanks again, so much.  I really appreciate it.  xo ",
      "MessageIndex": 4,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/756747",
      "Title": "Partner not supporting me while waiting! NYCMOM3 DesignerMom"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Aug 14, 2010 07:53PM NYCMOM3 wrote: Thanks so much, Cowgirl.  The thing is that he's yelling at me, hanging up on the phone because I won't say that I'm sorry for dealing the way I need to deal.  I'm feeling like he needs to \"man up\" or I don't need him at all, it's only making me more upset that he's being a jerk about my fears.  I'm not so sure that I can count on him in the future if he's acting like this now.  I remember my last little scare with an abnormal mammogram followed by sonogram that they wanted to monitor (it was 6 months ago) and I was so scared that all I did was cry about it - and he was fine. Now that I was prepared a bit more, knowing that I have just had issues, I need to deal with it in a way that makes me stronger.  I don't want to go back to crying all the time just to make him feel more comfortable.  This is really difficult for me, waiting is so hard and I really don't have any support because I don't want anyone else involved unless it becomes something more.    Thanks again, I really appreciate your words and thoughts.  :) ",
      "MessageIndex": 2,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/756747",
      "Title": "Partner not supporting me while waiting! NYCMOM3 DesignerMom"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Aug 14, 2010 10:36PM NYCMOM3 wrote: Our relationship has been like many are, worth the work, but not always easy.  However, he tends to \"freak out\" if he can't fix something. I'm his first partner that is independent and he says he's ok with it, but then things happen and he tries to fix it when all I need is support while I take care of what I need to take care of.  This is out of our control, both of us, and I just need to be able to vent and deal however I can to get to the next step, the next day, hour... whatever it is. It's like he's uncomfortable with the fact that this is totally out of his realm of fixing. And somehow I get the feeling that he wants to turn it into a situation that brings pity - does that make sense? Like it turns it into HIS problem instead of mine. Maybe subconsciously to try and lift the burden from me, but it only makes me feel worse.  This is just a follow up sonogram, though the lump is new (and so different than the cysts I always seem to have). I know they're on high alert due to my family history so hopefully I will have that result soon.   As of now I'm still in my doc's medical center for testing.  I know there are great hospitals in NYC and I may be asking for names/places.  I know once it's confirmed it's lightening fast.  My friend went through this a month ago and ended up with double mastectomy and is doing reconstruction (expanders are working now). I often wonder if I should go ahead and get the double prophylactic mastectomy given my history and lumpiness.  I know it's an awful surgery, but does it really decrease your odds enough for what you go through?  Ugh, so much to think about even when I don't have any answers.    Thanks again, you girls are wonderful.  xo ",
      "MessageIndex": 7,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/756747",
      "Title": "Partner not supporting me while waiting! NYCMOM3 DesignerMom"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Aug 15, 2010 10:34PM NYCMOM3 wrote: Thanks again!  I've been without insurance for so long, and am grateful to have it again.  I've always made sure my daughter was covered and have lived in a bit of fear - finally took a low paying job to supplement my freelance work and they have a great insurance plan - worth the low pay for now!  I think I will start bugging the doc's office mid week for an answer on the sono and will ask if I can get a second opinion elsewhere - they're pretty nice about stuff like this and hopefully they'll help me navigate a bit (of course I'll make sure all the pre-approvals and what not are in place too!) I have yet to meet my new, new doctor but have spoken on the phone with her.  She seems very nice and I think will be easy to work with on all of this.  I am hoping that they will order maybe a biopsy, the lump is very palpable.   Thanks again! As for the BF, he's very stubborn, as am I.  But he does care. Sometimes too much, to the point where I don't want to talk because he will not just listen, but want to solve something for me.  I'm hoping he'll get the hint that I only need support right now.  If I need help looking into hospitals and docs, I know he'll be thrilled to help, but for now, I just need an ear. xo ",
      "MessageIndex": 12,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/756747",
      "Title": "Partner not supporting me while waiting! NYCMOM3 DesignerMom"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "NYCMOM3 wrote: Hi! I'm brand new here and beside myself.  I come from a high risk background - mom was 38 when first diagnosed with breast cancer and finally lost the battle right after her 50th bday when it spread virtually everywhere.  Her sister passed away from bc in her mid 20's, and my cousin recovered after having it in her early 20s but we're not in touch.  There are other forms of cancer in our family too - prostate, lung, and I believe liver.  6 months ago I had an abnormal mammo followed by a sono that they said looked ok but that I had to come back in 6 months. Right before my follow up I developed a small hard lump and that's where they focused for my follow up.  I'm awaiting the results (this was just yesterday) but my partner has been hard to deal with.  I'm one of those people who likes to joke about something to keep it light, otherwise I'll bawl like a baby and won't be able to stop, and he thought it was \"inappropriate\" and didn't want to talk to me about it at all.  I'm so crushed, we've been together over a year and I feel like this is MY situation and that I need him to support me in a way that I feel comfortable.  Am I being selfish or am I right? I am so busy in life and being a single mom that I don't have a lot of friends to call on, and I'm feeling very alone.   No matter what the result is, I feel abandoned by the person who is supposed to be there for me, and I don't know if I should just walk away.    Meanwhile, HOW long is this going to take? It's so frustrating not knowing.  Thanks all. By the way, I am almost 39. breastcancernycmom.blogspot.com Dx 8/30/2012, IDC, ER+ Surgery 10/24/2012 Mastectomy: Left; Reconstruction (left): Tissue expander placement Radiation Therapy 1/7/2013 Breast, Lymph nodes Surgery 6/13/2013 Reconstruction (left) Hormonal Therapy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/756747",
      "Title": "Partner not supporting me while waiting! NYCMOM3 DesignerMom"
    },
    {
      "AuthorID": "NYCMOM3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107016/profile",
      "Content": "Aug 15, 2010 03:47PM NYCMOM3 wrote: Thanks so much.  I feel much better knowing that I'm NOT going crazy!!!  We talked today and he insists it is not because he can't control the situation, but he says he just can't laugh about it with me.  My mom got through her toughest moments in the 10 year battle by laughing.  He insists that he wants me to talk about it but I tell him I feel uncomfortable dealing with it the way that makes me happy - and i don't feel like crying about it. The only way I can really grasp a little happiness through this ordeal is by talking about it in a lighter way. I swear, I hear dramatic movie music sometimes when he talks about Serious Things.  He's a bit dramatic and seems to thrive on bad stuff, but also really good stuff.  There seems to be no combination with anything.  So I don't know where I stand other than to be true to my nature.  I don't have much family other than my daughter.  It's really tough when things happen. I have some friends but not a lot that I call close - and those are the ones that live far away. I love my life but sometimes it feels like by nature I'm so isolated.  I know lots of people but I don't know them enough to share in such sadness.  I'm always known as the optimist, the one that can find good in everything. And I'm doing that with this but he can't grasp that. Right now I am in my medical practice, they do the mammo and sono there.  I recently got insurance (just in time it seems!) so I'm going through their channels and am due for a checkup soon with my doc.  Unfortunately I have a new doctor now (old one left, and I really liked her!  Nature of healthcare in the US I suppose)  so I will talk to her when these results come in and if it's negative, see about a second opinion elsewhere. I will look into St. Lukes and Dr. R, thanks so much for that.   Interestingly enough, a friend just emailed me today saying that she found a lump this morning. It seems that one of my acquaintances may turn into a resource or at least a sister in this. She's new to the country but I believe has insurance which is good of course. She has no clue where to start to get this checked, and I'm not much better at the moment, just going where they tell me to go. I started looking at photos last night of mastectomies.  My mother never had hers reconstructed and was proud that she beat it. This was in the very early 80s. I'm not sure how I feel about it all, but I feel for all of the women who have gone through this. And all of us women who sit on pins and needles, making decisions to alter our bodies and our lives, when we're really not sure it will help at all.  And now I'm just rambling, not sure what to say or think about anything, but I'm glad to have wonderful women like you around!    xo ",
      "MessageIndex": 10,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/756747",
      "Title": "Partner not supporting me while waiting! NYCMOM3 DesignerMom"
    }
  ]
}