{
  "AuthorID": "NYCntryGirl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104756/profile",
  "Posts": [
    {
      "AuthorID": "NYCntryGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104756/profile",
      "Content": "Jul 9, 2010 04:18AM NYCntryGirl wrote: Cathy, I can't even imagine having to wait and wait and wait and... I never realized how lucky I was that I could push things as much as I did. I guess with us paying (sometimes through the nose) for our own medical coverage here in the US, we take for granted all of our options and ability to choose. As far as your BG, are you able to stay in touch with your endocrinologist or whoever you normally work with to take care of your diabetes? Maybe they might have some suggestions instead of you simply increasing your insulin every day... I hope work gives you the distraction that it sounds like you desperately need, Cathy. And, I hope that you get some resolution SOON. ~Carey",
      "MessageIndex": 3,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755047",
      "Title": "diabetic concerns tryn2staycalm tryn2staycalm"
    },
    {
      "AuthorID": "NYCntryGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104756/profile",
      "Content": "Jul 8, 2010 03:05PM NYCntryGirl wrote: Hi, Cathy! I'm a Type 1 diabetic, too. I'm on an insulin pump. I was just diagnosed on June 10 with breast cancer and I'm recovering from my lumpectomy with axillary node dissection done on June 28. My primary worked out a sliding scale for me while I was under for the surgery and I programmed my pump with a temporary basal. If/When I needed insulin based on a BG, I got a shot; however, my BG were excellent and I only needed a bolus of glucose because one of my BGs was like 53. I'm not looking forward to how the different medications and side effects, as well as the stress, etc is going to play havoc with my BG, but as long as you surround yourself with a great team who know about the diabetes and are willing to work with you to take care of ALL aspects of your care, then you'll be fine. I doubt it will be easy - not that treating breast cancer withOUT diabetes is easy - but I have to believe that maintaining a positive outlook and working hard to be your own best advocate will serve you best in the long run. I'm here if I can help in any way. I know how difficult it is to find other T1 diabetics to talk to in conjunction with breast cancer. (You're the first so far for me...) ~Carey",
      "MessageIndex": 1,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755047",
      "Title": "diabetic concerns tryn2staycalm tryn2staycalm"
    },
    {
      "AuthorID": "NYCntryGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104756/profile",
      "Content": "Jul 9, 2010 04:36PM NYCntryGirl wrote: Cathy, I wish you the VERY best of luck with everything. Just stay positive and we're all here for you if you need to chat. I'll be thinking of you and waiting to hear how you are... ~Carey",
      "MessageIndex": 5,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755047",
      "Title": "diabetic concerns tryn2staycalm tryn2staycalm"
    },
    {
      "AuthorID": "NYCntryGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104756/profile",
      "Content": "Jul 11, 2010 07:42AM NYCntryGirl wrote: I had my lumpectomy and axillary node dissection on June 28. How long do the steri strips normally stay on? Some of mine on the incision on my breast were coming loose so I thought I'd \"help\" them a bit, but I got to a point along my areole (most of the incision follows its contour) and it looked like it was still a flap and not stitched down. Needless to say, I freaked out and broke out the paper tape and taped everything back down. Should I call my surgeon on Monday? I don't know what to do now... ~Carey",
      "MessageIndex": 14,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731949",
      "Title": "Normally how long can I recover from lumpectomy？ angelaju NYCntryGirl"
    }
  ]
}