{
  "AuthorID": "nyelene",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82841/profile",
  "Posts": [
    {
      "AuthorID": "nyelene",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82841/profile",
      "Content": "Apr 25, 2009 01:06PM nyelene wrote: Hi!  I am new to this site so if I don't know all the terms bear with me.  I started my chemotherapy two weeks ago.  My first round of chemo is hercptin once per week and tykerb daily, plus femara daily.  My DX was on March 24th, IDC, 2.6 cm, Stage 2, Grade 2, ER+/PR+, HER2+ and have three additional lesions that are around stage 1 - 2.  I should be finished with this round of chemo July 7th and then will have a mastectomy.  Then I will start with what my oncologist likes to refer to as the \"real chemotherapy\".  Gosh for the most part I don't even feel like I have cancer.  I don't have too many side effects from the herceptin or tykerb.  Sometimes I dont even feel like I have cancer and the way some of the people I work with act, you would think it was completely unallowable to be away from work for feeling like crud after I have the chemo. Ah, I guess I am just a bit exasperated from the whole ordeal.  It all happened so fast and it's been hard keeping up with it all.  Plus I have a twenty one month old son who is like a force of nature to deal with, so you can about imagine eveything.  I am glad to find a place to vent and share.  Thanks so much for this and anyone who is taking herceptin or tykerb let me know how your reactions have been to it.  Much love~~Nyelene ",
      "MessageIndex": 466,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "nyelene",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82841/profile",
      "Content": "Apr 25, 2009 03:27PM - edited Apr 25, 2009 03:28PM by nyelene",
      "MessageIndex": 468,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    }
  ]
}