{
  "AuthorID": "NYmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157346/profile",
  "Posts": [
    {
      "AuthorID": "NYmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157346/profile",
      "Content": "NYmom wrote: Hi, I'm scheduled for a mastectomy with sentinel node biopsy on 8/16 and would like to have arm measurements done pre surgery as part of lymphadema prevention. I know the risk is low with SNB, but I watched my grandmother suffer with it and figure an ounce of prevention can go a long way. My surgeon said they don't usually do that , but gave me the name of a private lmt. I'm wondering if it is better to go to a pt for this or does it not matter? Is there anything else I should be doing pre surgery as part of lymphadema prevention? Thanks so much! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/791687",
      "Title": "Pre surgery measurements NYmom carol57"
    },
    {
      "AuthorID": "NYmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157346/profile",
      "Content": "Aug 9, 2012 03:45PM NYmom wrote: Thank you both for your replies. I am so sorry that you both have had to deal with lymphadema. Carol 57, thank you for the great write up about Lymphadema prevention and detection-- it is an awesome quick resource that all women should have access to. The info regarding the post operative exercises is very helpful. I went to see the LMT who is a LE specialist today. He took all kinds of measurements and went over a lot of basic information with me. He also suggested that I get compression garments to use preventatively, especially for air travel.",
      "MessageIndex": 5,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/791687",
      "Title": "Pre surgery measurements NYmom carol57"
    }
  ]
}