{
  "AuthorID": "NYruralrider",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131475/profile",
  "Posts": [
    {
      "AuthorID": "NYruralrider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131475/profile",
      "Content": "NYruralrider wrote: Hi,   I am scared. I have a 1/4 of my breast removed this coming Friday 7/1. Cancer is 3 CM as far as they can tell. I opted for the 1/4 breast removal vs. a masectomy. Surgeon saw no benefit to a total. Will go for radiation as far as I know. Tissue will be sent to pathology to see if margins clear. Nodes will be checked some how. Surgeon felt an enlarged node but said it could have been from my 2 biopsies. Nothing can be felt by the surgeon. I feel fine, strong healthy not sick!! I had both my hips repalced last summer and was so looking forward to this summer..I guess not.  Onocologist said my cancer is not estrogen positive and that is not in my favor...can someone expalin to me what this may mean?? Leave Thurs. for hospital. Second guessing if I should have opted for a masectomy!!!!! Surgeon said it still could come back in the small amout of tissue left or in the scar.....I am new to all this horror!! My mother lost her breasts at age 73. She passed away at 76 cancer free 13 yrs. ago. Her mother passed of uterine cancer in 1960 at age 72. I am 50 and NOT menapausal. NYruralrider Dx 5/16/2011, DCIS, 5cm, Stage I, Grade 3, 0/2 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770909",
      "Title": "DCIS High Grade Non Estrogen NYruralrider nanadeb"
    },
    {
      "AuthorID": "NYruralrider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131475/profile",
      "Content": "NYruralrider wrote: I have had 8 radiation treatments and am experiencing the most horrible shooting/stabbing pains that go through to my back...it is horrible I cannot do another 4.5 weeks of this!!!! I go daily..Mon.-Fri. I am not talking about skin pain put this is inside and unbearable...what the heck is going on?   I  told the onc 2 days ago and he did not say much. Tonight was the absolute worst stabbing/shooting pain yet..... CAN ANYONE tell me if this is not unusual to have this pain?  NYruralrider Dx 5/16/2011, DCIS, 5cm, Stage I, Grade 3, 0/2 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774964",
      "Title": "Terrible Pain W/ My Radiation! NYruralrider unlimited"
    }
  ]
}