{
  "AuthorID": "oaklandish1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106564/profile",
  "Posts": [
    {
      "AuthorID": "oaklandish1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106564/profile",
      "Content": "oaklandish1 wrote: This is for anyone in the California bay area region. Just wanted to let you know of a fantastic surgeon at Kaiser Oakland. Her name is Dr. Veronica Chanso Shim and she is the head of the breast surgury dept. During my pre surgury appointments,all of her collegues were touting her skills - she has a full fellowship in her field. I feel so lucky to have been assigned to her and actually am impressed with the whole Kaiser system - very efficient and great people. Everything was done in one day, radiologist ran wire to tumor in mammograpy dept, then dye was injected in the nuclear medicine dept, then surgury and went home. I'm up early next day and only a little sore at scar, not taking the vicodin or any pain meds. Dx 8/5/2010, IDC, 1cm, Stage I, Grade 2, 0/0 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/757623",
      "Title": "Posting sugeon recc for Oakland CA. oaklandish1 ---"
    },
    {
      "AuthorID": "oaklandish1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106564/profile",
      "Content": "Sep 14, 2010 10:49PM - edited Sep 14, 2010 10:56PM by oaklandish1 I have had this after my lumpectomy on 9/3.Very raised red bumps under my arm inbetween breasts and down my right side rib cage. Showed my surgeon on the post op visit, but she was not concerned and I am used to skin problems as I have chronic skin sensitivites (excema). It must have been an irritation from anestesia or the dye from the lymph node biopsy. It sounds like it will continue when I get my radiation.",
      "MessageIndex": 3,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757984",
      "Title": "Red bumps 18 months post rads JacquelineG oaklandish1"
    },
    {
      "AuthorID": "oaklandish1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106564/profile",
      "Content": "Sep 4, 2010 11:04AM oaklandish1 wrote: Hi there, just had my surgury yesterday 9/3. Hope you are feeling well. I can't believe how good I feel! Had my lumpectomy and my doctor took just a biopsy of the sentinal node and it came out clear, so no nodes were totally removed.  Had morphine in recovery and they gave me vicodin, but I don't need it. Just my scar is a little sore. I feeel very fortunate and wish you all the best!  ",
      "MessageIndex": 10,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/756963",
      "Title": "Sentinal Node Biopy Questions PinkSurvivor TifJ"
    },
    {
      "AuthorID": "oaklandish1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106564/profile",
      "Content": "Sep 4, 2010 09:45AM - edited Sep 4, 2010 09:46AM by oaklandish1 Yikes, just had my lumpectomy yesterday and thought I was in the clear because sentinal node was clear. Guess I need rein in my happiness a bit till the post op visit next Friday. Just shows how each case is unique and you can't generalize. Keep positive and all the best to you!",
      "MessageIndex": 9,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757199",
      "Title": "Lumpectomy now need mastectomy, need your support gutsy oaklandish1"
    }
  ]
}