{
  "AuthorID": "Ocalagal",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
  "Posts": [
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Dec 20, 2011 10:26PM Ocalagal wrote: Lilibell...I am going through the same thing.  Had a mammo on December 9th...doctor called me yesterday and said he needed me to come in for a consult.  Was going on Wed. but my sweet husband got me an appt. for today.  While waiting for the time to go, the imaging place where I had my mammo called and wanted to know if my doctor had contacted me...I said yes...she then answered the one question I had...how bad is it?  She told me that it was just to get a clearer picture, etc. and my doctor later today told me the same thing.  But, I am scared also...or maybe anxious would best describe it.  My follow up appt. for a second mammo and an ultra sound is scheduled for 12/29...unless they have a cancelation..and I really wish they would...the waiting is awful!  Prayers going up for you...and me...take care...will check back to see how things are going with you.  Let's both try to have a Merry Christmas!  Judy",
      "MessageIndex": 11,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779807",
      "Title": "Lord help me, I am so afraid! LilliBell liveit56"
    },
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Jan 7, 2012 08:58PM Ocalagal wrote: Suejr...just read your post...have not been on the site for a few days and since my mammo and ultra sound indicated just coming back in six months for a recheck...I have only been on here once or twice since then...that was on Dec. 29th...will certainly be your waiting buddy...and will check on here in a few days to see how you are doing.  I am a believer in prayer, so will add you to my list - along with the others on here for whom I pray for on a daily basis...God bless.. Judy",
      "MessageIndex": 105,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Dec 24, 2011 12:52PM Ocalagal wrote: Hello,all...I said I wasn't going to go to this site on this beautiful Florida Christmas Eve...but here I am..a few minutes to relax on the computer and what do I do - go here!  I am waiting for December 29h to come so I can go for a 2nd mammo...as the first one had \"some changes\"...so vague, I don't know what kind of changes they are talking about, but enough for a 2nd one.  The waiting is awful no matter how busy I am.  I have been on other threads, but think I am going to stick to this one...I love Marie already -- she is so knowledgeable and so helpful in her posts.   So, I will just wait - thankful there is more company coming to distract me this coming week...but it is family and I am not sharing this with anyone but my sweet husband - and this site - for now.  Hugs to all...let's all determine to have a wonderful Christmas! Judy",
      "MessageIndex": 36,
      "PostDate": "24/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779526",
      "Title": "So who is waiting for test results/ or having test Tenmom Kimberly5307"
    },
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Dec 22, 2011 10:47AM Ocalagal wrote: Hi all...I need a waiting buddy also!  Had a mammo on 12/9...did not hear anything so thought everything was o.k. until this past Monday when my doctor's office called and said he wanted me to come in to \"review the results\".  I had never had a call back before so you can imagine my anxiety.  Rigtn now, I am going for a diagnostic mammo and ultra sound on 12/29....which is way too far away for my satisfaction!  Anyway, I have not let anyone know of my situation - don't want family and friends to even think about this over the holidays - just my sweet husband and now all of you.  I am, by nature, a very optimistic person, so I am trying to be just that in this case.  Let's all make a determined effor to enjoy the Christmas season with our families - things have a way of working out.   Judy  ",
      "MessageIndex": 65,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Dec 29, 2011 01:40PM - edited Dec 29, 2011 01:41PM by Ocalagal Well, the 29th is finally here and I go at 3:00 for a 2nd mammogram and a possible ultrasound.  I went by my doctor's office yesterday and requested a copy of the results from the first mammogram on November 30.  It stated:  \"There  is a density in the uppper mid right breast which has become apparent; otherwise, there is no evidence of dominant mass, suspicious cster of mcrocalcifications, areas of archtectrual distortion or skin thickening. There are scattered fibroglandular densities. Benign appearing calcifications are seen bilaterally.\"  SO VAGUE...do I have anything to really worry about?  Who knows?  Maybe today's exam will be more explicit...I hate waiting and more than that, hate the unknown.  Whatever it is, I am ready to deal with it.  Has anyone had this type of exam information before?  And, if so, is this good or bad?  I know everyone on this site has felt like I do and it is good to know there is a forum such as this for us all to just plain \"vent\".  Hugs to all....I will write more tonight after my appointment.  Judy",
      "MessageIndex": 38,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779526",
      "Title": "So who is waiting for test results/ or having test Tenmom Kimberly5307"
    },
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Dec 30, 2011 12:16PM Ocalagal wrote: Carolen...so much of a habit to go to this site that I am still doing it!  Read your post about getting some results on Tuesday - can fully appreciate the \"angst' of waiting.  Praying that the result will be good for you.  I guess I will be coming back here...too many wonderful ladies going through too many things.  We are all in this together!  Judy",
      "MessageIndex": 52,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779526",
      "Title": "So who is waiting for test results/ or having test Tenmom Kimberly5307"
    },
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Dec 29, 2011 05:36PM Ocalagal wrote: Well, we are back home after getting the 2nd mammogram and an ultra-sound.  According to the doctor, (thank goodness he gave me the results right afterwards!) I have 2 suspicious looking  densities which he said by their shape and size looked benign (love that word!) and he mentioned a biopsy but then said he would recommend coming in again in six months to see if there was any change in size, etc.  If there is, at that time we can decide on a biopsy.  So, he told me to go home have a good six months and not worry about it right now.  So....that is what I am going to do. I probably will not write anymore on this site until sometime in June, but I will be checking in on everyone to see how things are going.  I really, really from the bottom of my heart am thankful for each and everyone of you - especially Marie - for giving us a place to share thoughts, anxieties and in general, being able to talk about our fears since I am sure most of us (at the wating stage anyway) do not share a whole lot with family.  I am still not going to share this with other family members as my husband is my best friend and he is the only one right now that I am sharing with.  As I have said before in my posts, I am a woman who firmly believes in prayer and will make it my mission to pray for all of you - those who are waiting and those who have already been diagnosed...God bless you all! Judy",
      "MessageIndex": 45,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779526",
      "Title": "So who is waiting for test results/ or having test Tenmom Kimberly5307"
    },
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Dec 29, 2011 05:41PM Ocalagal wrote: Marie...thank you so much - you are truly a wise lady and seem to know so much about breast cancer.  I wish you and your family a healthy, happy and worry free New Year.  I felt - after reading my report from the doctor - that there proably was not a lot to worry about and after today's 2nd mammo and ultra sound, we were right.  Am truly thankful and grateful.  Judy",
      "MessageIndex": 46,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779526",
      "Title": "So who is waiting for test results/ or having test Tenmom Kimberly5307"
    },
    {
      "AuthorID": "Ocalagal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141505/profile",
      "Content": "Dec 22, 2011 11:07AM Ocalagal wrote: You sound just like me!  I am waiting also and reading way more than I probably should but I am the curious type!  Hope everything goes well for you, but the waiting is agonizing.  I have only shared what is going on with me with my husband - who is very supportive and even more loving...for which I am grateful.  Let's keep in touch - you and everyone else who has posted on here - us gals have to stick together as we look after our \"girls\".  Merry Christmas!",
      "MessageIndex": 67,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    }
  ]
}