{
  "AuthorID": "Oceanblues3…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276270/profile",
  "Posts": [
    {
      "AuthorID": "Oceanblues3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276270/profile",
      "Content": "Jun 30, 2018 06:44AM Oceanblues30 wrote: Hello so Monday I am going for a Bilateral diagnostic mammogram and a breast ultrasound. Will they do a biopsy right away if they feel it may be something? About 3 weeks ago I got a tinging pain in my breast soon after that it started to get red and a bit itchy thought maybe I was getting a boil. Then started a mass the size of my hand. I did go right to the dr he did not say anything just gave the prescription for the tests. Now the mass has shrunk considerably very small but the skin is now peeling where it is.",
      "MessageIndex": 4,
      "PostDate": "30/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858192",
      "Title": "How much time the Rad spends with you djmammo MelissaDallas"
    },
    {
      "AuthorID": "Oceanblues3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276270/profile",
      "Content": "Jun 30, 2018 09:56AM - edited Jun 30, 2018 09:58AM by Oceanblues30 Hello and I have experienced something similar. About 3 weeks ago I got a pain in my breast and then it got pinkish. In a few days I ended up with a massive mass the size of my hand. I went to the Dr a few days later. It was tender and painful if i touched it. The dr had me schedule a bilateral Diagnostic Mammogram because he said he also found a lump in my other breast but my breast are very lumpy. Fibroids run in the family. I am also getting a breast Ultrasound on Monday. The issue now is the mass shrunk to ver small now and the skin is peeling where it is. The worry is killing me. Monday can not come quick enough. I also wanted to include my age 50.",
      "MessageIndex": 7,
      "PostDate": "30/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865399",
      "Title": "Red area on breast Lara19 Lara19"
    }
  ]
}