{
  "AuthorID": "octogirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
  "Posts": [
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 3, 2015 05:53AM octogirl wrote: cjafarm: my experience was similar to yours. i could tell that radiologist believed it was cancer. for that matter, I could tell that my PCP, who I went to originally for the referral, thought it was cancer. All I was told, however, is that the lump (which I could feel, so I knew there was a lump) was a concern, and that I needed to return for a biopsy. They did tell me that they hadn't seen anything concerning in the u/s of my lymph nodes, however. After the biopsy (the same radiologist did the biopsy a few days later and called me with the bad news from that) I was immediately referred to bs, who scheduled me for a MRI before our first apt. That helped guide my decisions on surgery options.",
      "MessageIndex": 12,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836380",
      "Title": "Will I get results from my mammo & US at appt? Amybeth68 LisaAlissa"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Oct 8, 2015 05:20AM octogirl wrote: Hi Caprivalda....my (cancerous) lump was just under my nipple. It was easily felt, but then it had probably been there a while, and I did have issues with nipple inversion (though not discharge) for a while before I felt the lump. I should have gone to a doc about it sooner than I did, so good for you for wanting answers. You deserve those answers, and the not knowing is worse than figuring it out! With your family history you should stay on top of it. Keep pushing for a consultation with a surgeon, or at the least a biopsy. The imaging center that did the ultrasound may be able to do a biopsy also; I'd follow up with the OB/GYN and ask for either or both (if and when you do confer with a surgeon, they would probably need to do a biopsy to have a definite answer to your questions and concerns, so if the imaging center can do it, that would be a good intermediate step, it seems to me.). I had the biopsy and a confirmed diagnosis before I saw a surgeon. Good luck to you and please keep us posted. Octogirl",
      "MessageIndex": 5,
      "PostDate": "08/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835556",
      "Title": "lump under nipple on left breast caprivaida caprivaida"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 24, 2016 06:52AM - edited Aug 24, 2016 06:53AM by octogirl for mydogspot: I don't think most TC patients lose their nails, though a few do and others have problems short of losing them, so I wouldn't assume you will lose them if you don't ice. OTOH, if you really want to cold cap and your doc says it defeats the purpose, it might be worth getting a second opinion. My MO wasn't enthusiastic about cold capping because he didn't think it worked all that well, but I went with him anyway because the closest MO who did support cold capping was quite a drive away (I live in a rural area) and otherwise he's been a good choice for me. To be honest, I tend to be a minimalist about taking care of myself and I did worry I'd find the icing and cold capping to be too much trouble in any case..... for tanyam, I agree that discussing your concerns is a good idea. Your MO may suggest alternatives, but at the least they should hear and address your concerns. Losing one's hair is no small thing. For me, it was the worst part of chemo. My hair is back now (a lot curlier, and in my case, somewhat thinner), but it was still tough. The hardest part was the waiting AFTER chemo for it to grow back: that seemed to take forever!! I do regret not buying a wig. I thought I would hate wearing one, and maybe I would have. However, not wearing one (I used hats and scarves) meant that all my co-workers figured out what was going on, and I would have preferred to keep it more private from some of them. The best advice I ever got during chemo was actually from my MO, who told me he wanted me to live as normal a life as possible including exercising. I walked a lot and was in better shape than I am right now, and it helped a lot. Also, there are threads on this board about exercise during chemo, which helped me, and threads for those going through chemo. I recommend joining one or both for support, it does help! Sending hugs. Octogirl",
      "MessageIndex": 5,
      "PostDate": "24/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/847247",
      "Title": "Very nervous about TC tanyam Seashells9701"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 9, 2018 11:44PM octogirl wrote: Dear HH; Your wife is lucky to have a caring husband....I just wanted to encourage her to join in on a thread of women undergoing chemo in January: https://community.breastcancer.org/forum/69/topics... Lots of support and help to be had from women undergoing the same experiences... My thoughts about chemo: it wasn't fun, but it was bearable and doable. I didn't have much nausea (honestly, the meds these days are pretty darn good!) and I worked all through it, just taking off a few days when I was at my worst each cycle. I even took two business trips during chemo! For me, losing my hair was the worst part, and it did seem to take FOREVER to come back, but come back it has, and it looks good now. As I think others have mentioned, food did start to taste cruddy: there were some days when the only thing I wanted to eat was mashed potatoes and gravy, because the texture was nice and it didn't taste awful...oh, and ice cream. ice cream never tasted bad. Best of luck to you both. Hugs. Octogirl",
      "MessageIndex": 9,
      "PostDate": "09/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/861320",
      "Title": "Worried- wife to start chemo 1/11/18 Hopeful_Husband scaligirl"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jul 4, 2018 11:33AM - edited Jul 4, 2018 11:37AM by octogirl hang in there. Most of us felt this way at the beginning; I know I did. The beginning really is the worst for many of us. It will get better once you have a complete plan. As for the co-workers, my advice is to tell them as little as necessary (I didn't even tell most of them that I had cancer, much less that I needed chemo. I let them draw their own conclusions from the hats and scarves, but most never asked me about it)...anyway, it may be too late if they've already been told, but just start smiling and saying 'everything is fine' when they ask. Over and over again if necessary. It may help fend off the inappropriate questions. Other than HR if you will be taking time off work, and perhaps your supervisor, no one needs to know at work. I'd make exceptions ONLY for co-workers you are close to and/or those you believe will be supportive (but you should know that some people react in unpredictable ways to someone else's cancer diagnosis, so you may find that some folks are either more or less supportive than you would have expected). For similar reasons, I'd be careful about which family members you tell: talk with those who you think will be supportive or feel close to. You can decide who to share the news with, and when. Avoid google, at least until you have more information and a treatment plan. Much of the information you will find there is outdated. These boards are a better source of information. Find some threads that apply to you (folks having surgery around the same time as you, for example) and join in. Also, tell your doc about your anxiety and lack of appetite. S/he can prescribe Ativan or something similar for you to take when the anxiety is too much. And, the best thing I did: keep moving and exercising. It helps, even if you just walk around the block. There is a thread where we post daily exercise; you'd be most welcome there. Please keep us posted once you have a treatment plan. We care. Hugs! Octogirl",
      "MessageIndex": 3,
      "PostDate": "04/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865638",
      "Title": "I cant do this. Careninnj Laurenrw"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 16, 2018 10:58AM octogirl wrote: Hi Anne Irene: Hopefully this will indeed all just be a distant memory soon, but in the meantime, you are not nuts to be concerned, and your OB is right: you need the actual U/S results and a written report, not just a tech's verbal interpretation. While it is certainly true that the odds are more in your favor if you are younger, the fact that you are young, IMO, should be irrelevant in reporting U/S reports: the results are either clear or they aren't (if the U/S doesn't rule out bc, next step would likely be a biopsy), and if/when someone refers to your age when interpreting results, that (to me) is a possible red flag that they either haven't really looked at the results themselves, or aren't sure what they are looking at (and thus mention your age as a likely factor in the still not-fully-read results). I'd get the written results to your OB ASAP, and then follow his advice not to worry until/unless he worries... Gentle hugs and best wishes!",
      "MessageIndex": 4,
      "PostDate": "16/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861672",
      "Title": "First post here and i feel like I am going insane.. Ann_Irene momto3sons"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 30, 2015 08:15PM octogirl wrote: Ashley, I know you are scared (we all were when diagnosed) but waiting until the 5th of January (just Tuesday next week) doesn't seem long. Waiting is the hardest part, but in this instance I think it will be worth it, in order to have more information, and to have a breast specialist evaluate your situation. Take deep breaths. Tuesday will be here before you know it. One thing you could do: call the breast surgeon's office and ask if a MRI is recommended and if it is possible to schedule that between now and your appointment (honestly, it may not be given that Friday is a holiday). Having the MRI done while you wait would be helpful if possible. Hugs and best to you. Octogirl",
      "MessageIndex": 34,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/839079",
      "Title": "I am scared Ashley46 msphil"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "May 23, 2018 06:30PM octogirl wrote: I am still using deodorant, perhaps just out of an abundance of caution, but have noticed that I need it much less. I recently went out of town for a few days, forgot to pack the deodorant, and realized I was fine without it. To be honest, until I saw this post, it didn't occur to me that it could be bc related. Rather, I wondered if it was a function of getting older....",
      "MessageIndex": 4,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864789",
      "Title": "No need for deodorant? angeleyes67 Spookiesmom"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 22, 2015 12:15AM octogirl wrote: I posted on the other thread, and as I mentioned on that thread, I did have some oncoplasty along with lx (and rads to come) but it was on the bad breast, not the 'good' breast, and was because they removed the nipple also...and while I didn't say 'run' I did say that I really didn't get, and still don't get, why you would do work on the 'good' breast in anticipation of radiation SEs, since the SE in question, shrinkage, doesn't always happen, and when it does happen, can be unpredictable. Do you really care enough that you would risk increasing the lack of symmetry in order to assure that insurance will cover it? What if your doc is wrong about shrinkage from rads (which was the main issue I read in your original post, for the good breast). I also would be hesitant about lifting and reduction on the bad breast in the same surgery as the lx, because, (as is also pointed out here and was pointed out in the other post), until you have the pathology post surgery, they can't be sure they won't need to do more surgery to get clean margins. One question you haven't addressed that I saw, however, that I think might make a difference in your decision: where on the breast is the tumor? A golf ball size area is going to show up a lot more in some locations than in others. As I believe I said on the other post, I am large chested (40DD bra size), and my tumor was twice the size of yours, and they also had to remove the nipple. Obviously you can tell that the nipple is gone (the oncoplasty made it look better but it still isn't a nipple), but even without clothes I can't see much if any difference because most of what they took out is on the bottom below the saggy part (the scar is underneath the curve of the breast for the most part.) And no, I don't give a damn if my breasts sag. I'd rather have sag than any more surgery than necessary any day of the week. Now, if lx had no been an option (and I was originally told that it might not be an option because of the nipple issue, until my bs made the oncoplasty suggestion) I would have taken mx with no reconstruction. I went for lx not for looks but because it was less invasive surgery and my surgeon, who I had confidence in, was confident about doing it (and it all turned out great). Could a plastic surgeon who knew what they were looking for tell the difference? Probably, but I frankly don't care. And it sounds like you don't care either. So, my advice, FWIW, stands: If you are confused you should get a second opinion. If you don't want a second opinion I think at the least you should ask your surgeon: \"I really don't care about higher or lifted breasts. Does that change your opinion as to what I need?\" \"Why or why not?\" I think you need to keep asking questions until you aren't confused, whether you ask them of this doc or another via a second opinion (or perhaps both). And frankly, I personally would be reluctant to put my surgical care in the hands of any doc who thinks they know what I'd like want cosmetically unless they first asked you what you would hope for and then explained the options. Just my two cents and continued best wishes! Octogirl",
      "MessageIndex": 4,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/836923",
      "Title": "Now I'm REALLY confused! Help please?! etnasgrl etnasgrl"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 7, 2015 05:13PM octogirl wrote: Tryler: How long was it PFC when you started seeing some growth on top? (looking for some reassurance or just plain old hope here)?",
      "MessageIndex": 22772,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 19, 2015 04:55PM octogirl wrote: Dee, are you glad you buzzed off the white chemo fluff because it helped the growth, or because you didn't like it, or some other reason? I have yet to see anything I would describe as 'fluff'. I have hairs that are my regular color, but sparse, as in an inch or two at least between each hair. So more like scraggly, than fluff. I am getting discouraged not to see darker scalp, fuzz or any such (Monday I will be six weeks PFC). any encouragement or suggestions would be very, very welcome at this point... Octogirl",
      "MessageIndex": 22849,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 12, 2016 10:51PM octogirl wrote: OMG, that is so funny Peachy! I was watching thinking I wished I already had that much hair! :-)",
      "MessageIndex": 23006,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 29, 2016 03:22AM octogirl wrote: and here is the top, taken today also... ",
      "MessageIndex": 23245,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 1, 2016 10:02PM octogirl wrote: well, confession time: I am 16 weeks PFC and I had said I was going to go hatless on March 1...but I didn't feel ready this am. I will post pics later, but I feel like my growth is slowing down...So, wore a hat to work....I was out hiking yesterday, and the hat was hot, and I took it off, and wasn't bothered when folks passed us on the trail...but somehow work, where everyone knows me, is different. Maybe two more weeks? It is hard to be brave... Octogirl",
      "MessageIndex": 23546,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 12, 2016 06:47PM - edited Mar 12, 2016 06:54PM by octogirl I've been mostly going hatless at work and around town, and am getting used to the idea...for the most part I've only getting positive comments, along the lines of 'oh, your hair looks really cute', or no comments at all (which is also fine). I did have one co-worker say, \"I like your hair style...is it intentional?\" which I found a little bit intrusive not to mention odd, since she works on the same floor as I do and certainly has seen me in hats and scarves for several months (though we don't work together closely). Maybe she was just feeling nervous, because when I answered, 'unfortunately, no' she said something about how she was about to undergo something similar...I have always liked the woman, so going to reach out to her (the moment in which she said all this didn't feel like the right time to talk, since there were lots of other people around at the time). Sort of long story to follow: For some reason, though, I STILL have an aversion to going into my favorite grocery store hatless....the aversion was so bad during active chemo that I had hubby do all the grocery shopping even though I really like to grocery shop. Mostly, I worried that I couldn't avoid my favorite checker, and I didn't want to tell her I had bc or for her to realize it: she is the sort who would make a fuss and look at me with pity and tears in her eyes. It just seemed like an effort to have to deal with that. So, I started doing the shopping (in my hat) again about a month ago, but I would actually go into the store and figure out if she was working before starting my shopping. (I fully admit that this is weird). Anyway, last week I did the shopping, didn't see her, but sure enough she started checking just as I went up to check out. However, it was pouring rain out, so wearing a rain hat was perfectly natural. She commented that she hadn't seen me in a while; told her I'd been busy...had a nice chat. Come back this week in same hat, but the rain isn't coming until tomorrow and it felt a bit weird to wear it. I wore it anyway. So, at the door, there are two women talking, one clearly had lost her hair to chemo: I'd say she was probably no more than 4 or 5 weeks PFC,and going hatless and seemed perfectly comfortable. I didn't say anything, but did think to myself that she was a lot braver than me! Anyway, I do the shopping, ready to check out, sure enough, favorite checker is the only one without a line. She starts checking me out, we are having a pleasant chat (as we often do/did before chemo, and by the way, one of the things that makes her a favorite is that she can check faster than anyone else there while still carrying on a happy conversation in which she remembers details about stuff we talked about months ago!). But then, she asks me if I know XX, a woman who works for my employer..and then starts talking about how she saw XX earlier in the day and she is 'fighting breast cancer' (I hate those words, btw. It isn't a fair fight!) and was wearing a wig, and hadn't been in the store in a while and she knew something must have been wrong when she didn't see her and.. etc etc... Was she trying to tell me she knew what was up with me while being polite? Or just completely clueless? and frankly, did the Universe really have to put a damper on what had been a lovely day up until that point, by reminding me that bc is all around us: not once, but twice in one shopping trip? Sigh. Either way, I am happy that I am leaving town Saturday of next week for various work and fun trips and hubby will have to do his own shopping for a while. Perhaps by the time I get back my hair 'cut' really will look intentional. Octogirl",
      "MessageIndex": 23658,
      "PostDate": "12/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 31, 2016 10:11AM octogirl wrote: I thought about posting a pic last night to show my progress, but decided not to because I had a moment of feeling vain (Hah!) when I realized that while the hair is getting thicker and longer, the ends are starting to look a bit scraggly...in other words, it is almost time for my first post-chemo cut! (During the whole s(*)(*() storm I never shaved it, never trimmed, never did anything because I couldn't bear to cut even a little bit of what little I had...so a trim will be a big step for me. Woohoo!) Octogirl ",
      "MessageIndex": 23780,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 31, 2016 10:36AM octogirl wrote: justmaxi: you have absolutely gorgeous eyes! I would stick with the short cut to emphasize them! Octogirl",
      "MessageIndex": 23782,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Apr 2, 2016 10:37AM octogirl wrote: So funny ShopGal (except that it is not): yesterday one of my friends was commenting on how 'soft' my hair looked...and I got the impression she wanted to touch it! Heck No!!! Right now, that feels like a very intimate move. My husband can touch my hair (and of course I touch it obsessively all the time to try and figure out if it is getting longer)...but everyone else: just no.",
      "MessageIndex": 23792,
      "PostDate": "02/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Apr 10, 2016 09:37AM octogirl wrote: my eyebrows are still sparser than pre-chemo, but I've never been into makeup so just pretend to the contrary.....hopefully they will be fully back some day. Meanwhile, my hair has just reached the point where it looks like it could be intentional, and I am getting lots of compliments (though admittedly, most of them are from folks who know the reason for the short hair). Pic soon, but I just wanted to pop into say that I am finding that having the hair back and feeling comfortable going out with out a hat is making a HUGE difference in my sense of well-being. I knew losing my hair would be hard, but I would never have guessed just how hard. Starting to feel like myself again, and that is SO nice! Octogirl",
      "MessageIndex": 23819,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "May 18, 2016 10:00AM octogirl wrote: Young, you look great! I think you will see it take off and grow really nicely and quickly in the next few weeks, based on my experience..... Can't answer the color question, as I've never colored my hair.... Ran into a long time work colleague at a conference I am attending, who I hadn't seen in several years. Although we live on opposite coasts he does know me pretty well because he is good friends with a woman who is a close friend of mine, and we've hung out together at many other meetings, but still, he didn't recognize me with the short curly hair!!! Such a weird feeling to see the awkwardness when I said 'hi sweetie' and went to give him a hug and he didn't know who the hell I was...then to have him ask when I cut my hair....sigh...his wife has had bc and went through chemo, so you'd think he would get it, but he didn't (I did tell him), which perhaps I should take as a good sign that my hair is past the 'cancer girl' stage! Hugs to all Octogirl",
      "MessageIndex": 23989,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 9, 2017 07:38PM octogirl wrote: Hi concerned...you did post a new topic, which is fine (and welcome to these forums, though I am sorry you have to be here), and in the right place, I think. I honestly can't remember steri-strips after my biopsy, even though it did bleed more than usual afterwards, so there must have been something on it. Whatever it was, it didn't last more than a day or two. You probably don't need to be concerned or worried, unless it starts bleeding a lot or becomes red or inflamed. I just had steri-strips on my knee after staples were removed following a total knee replacement, which is a much bigger scar than a biopsy. I asked doc when to take them off or what to do if they fell off, and he shrugged and said, 'they will fall off when ready, and if they don't, you can just pull them off in few days'. So, I wouldn't worry too much. Deep breaths, and you can check with your doc on Monday. Hugs! Octogirl",
      "MessageIndex": 1,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860749",
      "Title": "Help? Steri-strips from yesterday's biopsy came off Concerned2018 octogirl"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 9, 2017 07:55PM octogirl wrote: I see you got a reply from another poster on the other thread you posted, who is a radiologist (which I am certainly not); sounds like he showed you how you can replace them, so sounds like you can do that to avoid further worry...though he did point out that it wouldn't open up without the steri-strip, though they could reduce scarring... ",
      "MessageIndex": 2,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860749",
      "Title": "Help? Steri-strips from yesterday's biopsy came off Concerned2018 octogirl"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 30, 2016 10:45PM octogirl wrote: thanks! I just had to share this pic to show the contrast, to give those of you who aren't so far along hope. This was probably three months PFC. ",
      "MessageIndex": 24401,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 18, 2015 05:31PM octogirl wrote: Dee, I can only hope that my hair will look like that at eight weeks! Will take a lot of growing between now and then to get there (5.5 weeks PFC now...) Octogirl",
      "MessageIndex": 22837,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 15, 2016 09:51PM octogirl wrote: Valstim, honestly, I find that the comments come no matter what you do. (though granted, I always used hats and scarves, not a wig.). Even now, more than a year PFC, people comment on my curls: \"oh your hair is so cute, did you have a new perm?\" that type of thing. Objectively, it is cute. Personally, I hate it anyway, because of what it reminds me of... so, my take these days is to just smile and say 'thanks' or 'yes, thanks', or even \"oh, glad you like it'. If they ask multiple questions I try and change the subject. Only once have a felt a need to explain, but even then I only gave the minimum facts/story. I've come to the conclusion that I owe no one explanations.",
      "MessageIndex": 24725,
      "PostDate": "15/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 8, 2016 06:55PM octogirl wrote: Seriously beautiful Sloan! I can't imagine having that much hair at 14 wks PFC given how little I have at almost nine weeks PFC, but one can always hope! Octogirl",
      "MessageIndex": 22957,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 17, 2016 09:26PM octogirl wrote: beautiful CatsRus.... Rain, I bought shampoo today also! I don't really need it, but actually I read somewhere that it is good for the scalp also. Sloan who posts on this thread swears by baby shampoo. Octogirl",
      "MessageIndex": 23061,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 18, 2016 05:02PM octogirl wrote: Melclarity, I never did get a wig...which mostly is a decision I am happy with but now and then I regret. Hats and scarves are more obvious, especially in the workplace where people see you every day, and especially of course in summer. Very glad that at least it is winter here! Octogirl",
      "MessageIndex": 23081,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 29, 2016 02:59AM octogirl wrote: great hair Rain!! and it looks like you have real eyebrows! I can't wait to get to that point. I really understand not wanting freelance clients to know about the bc (I work for a large employer and didn't need to worry about that, but I *still* didn't want people to know..but now that I've been wearing hats and scarves to work every day for month, I think people have figured it out...) and I am more ok with that than I used to be, but damn! I am SOOOO sick of hats! and scarves! when I get to the stage you are at, I have a feeling I will ditch the hat... ok, working on my pics now. Will post soon. Hugs to all Octogirl",
      "MessageIndex": 23243,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 29, 2016 03:21AM octogirl wrote: Here you go...first of two shy views, of back, taken a few minutes ago at between 11 and 12 post weeks PFC.... ",
      "MessageIndex": 23244,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 18, 2016 03:01PM octogirl wrote: Welcome Cjf0313, I was in the same boat as you at 7 to 8 weeks, was sure I was never going to get it back. But the hair is back (Pics if you scroll back a bit) and it is growing more each day. I also had Taxotere. It takes patience, and patience is really hard, but as Kate says, it does get better! Sending hugs. Octogirl",
      "MessageIndex": 23443,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 1, 2016 11:26PM octogirl wrote: Thanks molliefish, I appreciate the support! Anyway, here are photos, taken today, as I said, 16 weeks PFC. While I think it has slowed down, it is growing...a bit more grey than it was before (I had almost none before dx). I don't mind the grey.... but I do wish it was a little longer! ",
      "MessageIndex": 23548,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 8, 2016 10:06AM octogirl wrote: you really do look beautiful, one bad boob. I concur with the others, ditch the hat! as for me...I had another dream last night that my hair was long. I was at the salon, and I was telling the woman styling my hair what a good job she was doing with so little, and then I realized she had a lot of hair to work with! so, realized that these dreams are telling me that I should ditch my hats. I think it is time. Going to go to work hatless today....will see how it is. If I manage to keep it off, I will take a pic! Hugs to all Octogirl",
      "MessageIndex": 23598,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 8, 2016 08:40PM octogirl wrote: Kimmer, you look so cute! You too Leigh and Vickie! With encouragement from all you beautiful ladies I did it! Hatless at work today! Everyone was very nice about it. Here are pics. My hair is lighter in color than previously, and definitely more grey (I had almost no grey before)...but it is hair!! WooHoo Today is 17 weeks PFC for those looking for a little encouragement. It has been slow, but it is coming back! Hugs and thanks!  Octogirl",
      "MessageIndex": 23607,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 8, 2016 08:40PM octogirl wrote: one more.... ",
      "MessageIndex": 23608,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 22, 2016 09:50PM octogirl wrote: Hi all...I've been at the work conference I mentioned so many posts ago...I mentioned elsewhere and can't remember if I mentioned here: presenting with very, very short hair was fine. Actually, I am almost starting to like how it is starting to look: it is a LOT lighter than before and I am sort of enjoying it being different...but I did find it awkward and strange when I saw colleagues at the conference who I hadn't seen in a while (and who, for the most part, didn't know I'd had bc): I said hello to several people who didn't recognize me! One guy came up to me later and said he didn't realize who I was until I asked a question at a session (guess my voice hasn't changed). I think all of you are looking great! Octogirl",
      "MessageIndex": 23733,
      "PostDate": "22/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "May 13, 2016 09:57PM octogirl wrote:  Hi all...Just checking in: six months PFC and my hair is finally at the stage where I think it looks cute....the curls help. (not sure if they will stick around, however). I haven't yet done a trim, but I probably should soon.... Hugs to all. ",
      "MessageIndex": 23964,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 30, 2015 10:00AM octogirl wrote: HazelFrances, I am still bald on top 3 weeks PFC, but I do have hair that matches your description around my ears and nape of my neck. It is dark and as far as I can tell is similar to what I had before (hard to tell when it is so sparse though). I never did shave or buzz, just couldn't bring myself to do it, and am not inclined to do so now....it makes me feel better to have little bits sticking out from under my hats and scarves. I'd probably feel differently if I were wearing a wig. I agree with Cloesmom: not sure it makes a difference in the long run, so do whatever feels good to you.",
      "MessageIndex": 22735,
      "PostDate": "30/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 7, 2016 09:55AM octogirl wrote: Angtee, it is hard. You are in my thoughts. I didn't shave or buzz mine, just a short cut before I started chemo and let it come out on its own....just to have an extra few days with it. and I've only cried a few times during and after chemo, and just about all of those tears involved sadness over losing my hair. It has been much slower to come back than I'd like, and slower than I see in some of the pics on this thread. But, 8.5 weeks PFC I am finally feeling what really does feel like stubble on the top, and it looks darker on the sides. A few stray hairs on the side and nape of my neck that never left are still there. There is a bit of light at the end of this long tunnel. And no, family members don't really get it. One of the most insensitive remarks I got was from a family member. But we will be here for you. Feel free to PM me anytime if you need extra support. Sending BIG HUGS!! Octogirl",
      "MessageIndex": 22934,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 12, 2016 02:30PM octogirl wrote: Sloan I go back and forth on a minute by minute basis on the whole hat thing and feeling hot and cold :-) Just wanted to report that I am finally seeing stubble. WooHoo! Octogirl",
      "MessageIndex": 22992,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 15, 2016 09:56AM octogirl wrote: Queen Celeste, those are two very cute wigs, but I like your gray pixie best! I am finally getting some hair. Not just fuzz but actual real stubble. Taking a long time, but I can see the difference daily. Such a relief to see something! Hugs to all Octogirl",
      "MessageIndex": 23034,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 18, 2016 04:10PM octogirl wrote: I don't know...I am now 10 weeks PFC and while I am FINALLY starting to see progress, it is still at the stubble stage, not any where near the one to two inches that the video says to expect in that timeframe (this BCO website also says something similar)....moreover, it is not growing at its normal rate. If it was I probably would have one to two inches as my hair was some of the fastest growing anywhere (per every hairdresser I ever had; hairdressers have always commented on how thick and fast growing my hair was :-( ). I think it is important to remember that there is a lot of variance depending upon regimen and individuals....otherwise, hard to be patient! actually, it is hard to be patient regardless! Octogirl",
      "MessageIndex": 23079,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 1, 2016 10:13AM octogirl wrote: Rain, it is an affectionate nickname for the historic (built in Victorian era) Hotel Del Coronado, on the beach on Coronado Island, in San Diego. It's a California thing. We are probably the ones being provincial. But we'd love to meet you there.... Octogirl ",
      "MessageIndex": 23284,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 3, 2016 08:57AM octogirl wrote: I agree with Shopgal, you look great, Valerie... I am seeing more hair every day. Wish it were growing faster....but the day of No More Hats is coming soon. I plan to have a virtual party. You all will be invited! Octogirl ",
      "MessageIndex": 23320,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 10, 2016 09:39AM octogirl wrote: KateB: I am joining you...my spring break is end of March and I just don't want to wait that long. Or maybe even for my birthday the end of February. I am taking a few days off work to celebrate my birthday, so I like the idea of coming back March 1 hatless and scarf-less. I've already taken the step of going hatless in the car, something I wouldn't have dreamed of doing a month ago. You heard it here too. Paxton. ((((hugs)))). I agree, join one of the online chemo groups. You will get through this. I never cut my hair at all, for what it is worth, just let it fall out. But, while my husband is very supportive, I am not sure I trust him with scissors or a razor :-) And I know that just letting it come out on its own is hard for most women. Hell, it was hard for me. Yesterday, walking across campus I saw a young man with hair at almost exactly the same length as mine....made me feel a bit as though I am a slave to gender norms... Hugs to all Octogirl",
      "MessageIndex": 23385,
      "PostDate": "10/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 13, 2016 09:30PM octogirl wrote: So here are two pics from today, almost 14 weeks PFC.....back is definitely further along than the front...   ",
      "MessageIndex": 23410,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 8, 2016 10:34PM octogirl wrote: hear, hear, my sunshine! Peachy, so funny that you say it is nice and straight. Besides being darker and less grey, my hair before was somewhere in between wavy and curly, and I liked that. It will be a bit strange if it stays straight as it grows, but I am *not* complaining....",
      "MessageIndex": 23611,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 14, 2016 10:13AM octogirl wrote: welcome gakristi! You are at the stage where I found patience to be very difficult...it does come back, but it did take me longer than I thought it should! Hugs Octogirl",
      "MessageIndex": 23664,
      "PostDate": "14/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 19, 2015 06:44PM octogirl wrote: Thanks Sloan and Italy....but to clarify: for the most part, other than a few hairs at the nape of my neck and below my ear, these aren't stragglers. This is new growth. but even if these hairs grew out to be ten or twelve inches long, I'd have bare scalp, that is how far apart they are...it certainly doesn't look like the pics you all post, in any way. I know, I can hear some of you say, ' wait a minute: you have new hair? Then why so impatient?' The problem is, I've not heard anyone describe it coming in the way mine is, and it scares the hell out of me that this is all that will come in: hairs here and there, but not a head of hair, if that makes sense. I am afraid to buzz the only hair I have, but I am worried it is preventing more from coming in, though I don't see how it could be. I have some hairs that are as long as 1.5 or even 2 inches, but there are still lots of smooth, shiny bald spots, where hair is not growing at all. Thanks for your encouragement. Octogirl",
      "MessageIndex": 22852,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 19, 2015 06:58PM octogirl wrote: no, no dark spots. I do see a few red spots, at the end of little bumps. will try to get up the nerve to post pics later today or tomorrow.... Octogirl",
      "MessageIndex": 22854,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 24, 2016 12:32AM octogirl wrote: Sloan, you look absolutely wonderful! ",
      "MessageIndex": 23741,
      "PostDate": "24/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Apr 3, 2016 10:23AM octogirl wrote: rain, I admit that even in the best of times i don't pay much attention to leg hair growth...but mine (no Herceptin) is back to its normal too-fast-to-bother-really-keeping-up-with-unless-I am-going swimming growth. I almost never wear dresses so that isn't an issue..No hair growth at all on my underarms (on either side, not just the radiated side)...and oh yeah, too much on my chin and side of my face. I have had to resort to shaving it several times :-( I do wish the hair on my head would grow faster. While it is softer than it was pre-chemo it is definitely thinner and doesn't grow as fast... Octogirl",
      "MessageIndex": 23798,
      "PostDate": "03/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Apr 13, 2016 10:16AM octogirl wrote: Here is my pic five months PFC. It is starting to get thick again, woohoo! One of my eyebrows is fine, the other is almost totally non-existent. But I hate makeup (and have allergies and sensitivities to many brands) so I just pretend I look 'normal'. Sending hugs to all; Octogirl ",
      "MessageIndex": 23840,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 21, 2016 10:18PM octogirl wrote: Rain, I cut my hair short for the first time in a long time right after dx...just in the hopes i could get used to it. But I may take a while to finally ditch the hats and scarves nonetheless... Looks great Jabe! Octogirl",
      "MessageIndex": 23141,
      "PostDate": "21/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 29, 2016 03:48PM octogirl wrote: thanks Rain and Shopgal...yep, it is real...but I am still obsessed! Octogirl",
      "MessageIndex": 23248,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 29, 2016 09:36PM octogirl wrote: ok, I know I am obsessed....but I am sure you all can understand so I'd appreciate hearing your thoughts on my latest obsession: when I touch my lovely new, soft hair (which of course I want to do every minute or two, although I usually only do so in the evening, not at work.. :-)) I can now feel a lot of bumps, which I didn't notice before...like a bunch of tiny raised dots or pimples...are those the follicles? Hoping someone will reassure me that isn't a bad thing! Love all the pics! Octogirl",
      "MessageIndex": 23263,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 30, 2016 11:15AM octogirl wrote: Thanks for the reply Shopgal! The bumps are less noticeable already this am...maybe just because of your reassuring post! I also go bareheaded at home...I usually can barely wait to get that hat off! Molliefish, looks good to me! Octogirl",
      "MessageIndex": 23267,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 1, 2016 09:16AM - edited Feb 1, 2016 09:18AM by octogirl Me too Tyler! Though it does look great! Wouldn't a girls getaway at the Hotel Del be great right about now?  Octogirl",
      "MessageIndex": 23282,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 18, 2016 05:30PM octogirl wrote: PMR, please don't apologize or feel bad. Actually, as I should have said, I agree that the video itself looks fairly close to my experience. It's the text..and the text and video don't match, on what to expect two months out (IMO). Hey, I am happy to have the stubble, just don't want others to think that it will never come back just because it is slow! I am taking Biotin. Who knows if it helps but it feels like I am doing something proactive. And yeah, I just started Arimidex (hormone blocking AI). Too soon to tell if it will cause hair thinning. Only been on it a week and haven't really noticed much if any additional aches and pains (I already have arthritis in both knees...) Hugs! Octogirl",
      "MessageIndex": 23084,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 14, 2016 04:17AM - edited Feb 14, 2016 06:43AM by octogirl Thanks all for the kind words about how much my hair is growing. In truth, when I compared the two pics I was amazed how much it has grown...partially because the back is growing fastest, and I don't see that in the mirror each day...but yeah, I was worried, and yeah, Sloan, I deserve all the 'I told you sos' everyone gives me :-) As for grey vs dark, I had *NO* grey hair before chemo (and never colored it. I will admit to a bit of false pride about it)...so it is all relative. It does look like its old color in back, but I am still convinced the front will grow in grey. But, even if it does, PARTY TIME!!! I have hair!!! Woohoo! :-) Duzy, I am still wearing hats and scarves (mostly hats). I never did get a wig, which I sort of regret. Didn't realize how sick I'd be of hats and how wearing them all the time, even in winter, makes me feel like 'cancer girl'. However, my plan is to go hatless as of March 1...not long now! Octogirl",
      "MessageIndex": 23420,
      "PostDate": "14/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 27, 2016 09:41AM octogirl wrote: Sloan and Pennsy, you both look really great! At 11 weeks PFC, I am starting to see the brows come back, and the hair looks a bit better every day. Hubby calls it my 'Sinead O'Connor' stage. I figure another week or two and I will be brave enough to post a pic....I probably won't know for sure for a few weeks, but it is apparently mostly the dark brown it was before. I am interested to see if I have any new grey hairs but can't tell yet. I never thought I'd even get to this stage. Such a relief. Going earring shopping with you as inspiration Sloan! Thanks so much for posting the pics. Octogirl",
      "MessageIndex": 23199,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 21, 2016 11:42AM - edited Feb 21, 2016 11:43AM by octogirl well, I am sticking with my March 1 hatless date...even though I can't see any difference this week compared to last in terms of hair growth...other than on the side of my face: I have fuzz and need a shave!! Can't tell you how annoying that is....still, I am grateful to look in the mirror and see someone who has really short hair, but definitely looks less cancer-y... my nail ridges are vertical, not horizontal, but pale, so I think I will be able to cover them with some type of light nail polish when it gets warm enough for sandals. or take to flats of some type as you all suggest. Rain, consulting a salon person might help you get more used to the idea of shorter hair....I am thinking it is time for me to go back to the woman who cut my hair, even though it was already short...maybe a trim will make it look more like something I did on purpose... This just takes so long! Hugs to all; Octogirl",
      "MessageIndex": 23483,
      "PostDate": "21/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 27, 2016 03:55PM octogirl wrote: Kate, YES! You are just a bit behind me.... Octogirl",
      "MessageIndex": 23205,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 28, 2016 02:57PM octogirl wrote: Rain, I go around comparing my hair status to everyone I see....though not necessarily to my son, since he is blonde (and I am definitely not). However it comes out, pretty sure I will never be a blonde. The other day a co-worker who is out on maternity leave brought in her baby girl so we could all ohh and ahh over her. Ok, this kid is not yet two months old and already has more hair than I do! (She was born with a full head of gorgeous brown hair). Everyone else was saying how cute she was; all I could say was that I would consider killing to have hair that looked like that baby's! Octogirl",
      "MessageIndex": 23220,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 6, 2016 03:39PM - edited Mar 6, 2016 03:40PM by octogirl Peachy, you look great! I had a vivid dream last night that I was late to meet my husband somewhere, and my shower seemed to be taking longer than usual...it was not until I got out of the shower and saw my reflection in the mirror that I realized why: my hair was full and down below my shoulders!!! So, it was taking longer to shampoo, etc., than it does now...I was so, so happy! AND, I kept pinching myself and asking myself, 'please tell me this isn't a dream.' After three pinches, I decided it couldn't be a dream since I didn't wake up. But I decided I should pinch myself one more time to be absolutely sure. Then, after the fourth pinch, I did wake up. Boo! Sigh; Octogirl",
      "MessageIndex": 23589,
      "PostDate": "06/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 9, 2016 10:18AM - edited Mar 9, 2016 10:29AM by octogirl Shopgal, I am so sorry that the B-Lady (this is my hubby's favorite nickname for people like that) was so mean to you....I am hoping that she just felt awkward and blurted out the wrong thing, but still, it is no excuse. How awful! Sending lots of hugs!! I know exactly how you feel about the conference: I am going to one in two weeks, and while a few of the folks who will be there have seen me in the hats, they haven't seen me hatless or scarf-less. To add to my anxiety about it, I am giving two presentations. Ackkk!! I am not normally nervous about public speaking (I probably do more than my share of conference presentations) but I am starting to get really nervous about standing up in front of 100 or so people with such short hair! Fortunately, one of best friends in my profession is co-presenting with me, and she has been wonderfully supportive, and she does hate public speaking...so we can support each other and get through the presentation...My advice is to hold your beautiful head high and ignore anyone who acts like a jerk. I will try to take my own advice as well. It is hard, I know. I remember when MO and I were first discussing chemo: I told him I had a big scuba vacation to Cozumel planned in May, and asked if I'd be well enough by then to travel and dive...he told me he saw no reason why I could not keep my plans (Yay, Mexico here I come, in less than two months!) and then he said, 'and by then, you should even have your hair back, to help you enjoy your vacation'. At the time (back in early September) I thought, 'really? It can't possibly take that long. He must be exaggerating how long it takes..' Well, he was right, of course. It is a very slow process. I feel so much better now that I can finally see it for myself. I hope none of us ever have to go through this again! xoxox to all Octogirl",
      "MessageIndex": 23619,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 9, 2016 09:50AM octogirl wrote: Every silver lining has its cloud....hair has really made progress the past week (will try and post an updated pic this weekend) and now that it has, I can see that, alas, I am coming back more grey than before, especially on the sides. I used to pride myself on being over 60 with virtually no grey hair (and never a need to die it)...which just goes to show, that what they say about pride and falling (or losing the hair in this case) is true.... Not that I am really complaining. It is a fair trade for getting the hair back finally. Indeed, I was even happy this am to discover that the hair on my chin that annoyed me so much has come back. and my legs need to be shaved! yay for hair and hugs to all, Octogirl",
      "MessageIndex": 23364,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 13, 2016 09:31PM octogirl wrote: and for comparison, one from almost two weeks ago, 12 weeks PFC.... ",
      "MessageIndex": 23411,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 31, 2016 10:10PM - edited Mar 31, 2016 10:12PM by octogirl ShopGal, you really are beautiful, and your new 'style' (can we call them that?) is very becoming....but I get it. It is hard to get used to the new me, even when others tell me I am looking good. So, two weird and uncomfortable hair related events for me today, that didn't help: First one: a woman who works on my floor who I have never met, came to my office today to introduce herself. Ok, at first I thought she was just being friendly, but then she said, \"I wanted to introduce myself because I love your hair. It is so cute. I've been following your progress as a cancer survivor, and you seem to be doing so well,\". and of course, this was said from the doorway in a loud voice, so anyone in the vicinity could hear her... First of all, thanks a lot for the suggestion that maybe I still look like 'cancer girl' and not like a woman with a cute pixie cut. Second, I really think it is rude to assume that the hair loss was due to cancer and to state that out loud. None of her business, and she shouldn't make that assumption. Indeed, there is another woman on my floor who had to shave all of her hair last year before brain surgery for a neurological disorder that had NOTHING to do with cancer (I only know this because that woman is a friend of mine...I certainly heard no gossip about it around the office, even though she wore a hat for several months while it was growing back)....And then there was the saying it so loudly. Like I wanted to discuss my health with this total stranger and everyone in a cube near me. GRRR...I thought it was very rude and it made me feel self conscious. Second, the wife of a co-worker stopped by the office and said, \"Oh your hair is so short...are you going to keep it that way or grow it back again?' This woman is a sensible person and I even wondered if she had no clue as to why my hair was so short....which would be a little weird since her husband knows what is going on...I just shrugged and said I hadn't decided what length I wanted it and then changed the subject...but it was very uncomfortable. What makes people think that commenting in this way is ok? (In this instance, I suspect her husband, who was present at the time, may have had a conversation with her later: I know him much better than I know her but she and I do sometimes socialize together....so I'd hate to think he didn't clue her in. But who knows...) It all sort of reminds me a bit of being pregnant: that time when people think you are public property of some type and it is ok to touch your belly and ask you personal questions. Only worse. People really are rude and a bit strange. I am glad to have this forum to vent. Hugs, Octogirl",
      "MessageIndex": 23787,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 1, 2016 11:27PM octogirl wrote: One more.... ",
      "MessageIndex": 23549,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "May 27, 2016 09:36AM octogirl wrote: So, my hair is now at the 'pixie cut' stage and it is also quite curly...I get a lot of compliments, but I still don't like it, because it is a reminder! Yes, needing to get used to the new normal is difficult: we put all of our energy into just getting through chemo, but afterwards....well, it sucks. and the worry about taxotere makes it worse. No words of wisdom from the other side here, just hugs for all struggling with this! I have yet to do any trimming or cutting, just can't bring myself to remove any hair whether it is real growth or not..... Octogirl",
      "MessageIndex": 24020,
      "PostDate": "27/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 30, 2016 11:55PM octogirl wrote: Beautiful Shopgal!",
      "MessageIndex": 23778,
      "PostDate": "30/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 30, 2016 10:14PM octogirl wrote: one more shot... ",
      "MessageIndex": 24399,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 31, 2016 10:05AM octogirl wrote: Thanks for the kind compliments, and I am glad it helped you Cathytoo...the funny thing is, I don't like the curls that much. Objectively, I know they are cute, but they are different, and I think maybe all of us may feel sometimes that we want what we had before back again. At least I do. I did have wavy, thick hair before, but never curls like this. Well, actually, I did: when I was three to five years old. I think of my current hair as 'baby hair' (It is a LOT thinner and finer than it was before, which my hairdresser also commented on). This is why my gut tells me it will eventually revert and that the curls might go away: I just have to get through the baby hair first. I will say, on a positive note, that it was never grey, and it started to come in with touches of grey (see the 4.5 month pic) but as it gets longer, the grey is also going way, or is less noticeable. At sixty two years old, I will take it. Actually, I will take the curls too. Just grateful to have them! Hugs to all; Octogirl",
      "MessageIndex": 24408,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jun 28, 2016 03:52PM octogirl wrote: sorry to be late to the party but I agree that you look really cute and rock the look, kellychameleon! I feel lucky that my chemo was in fall (if one can feel lucky about such a thing). I can't imagine having to wear a hat or wig in the triple digits we are having now. Fortunately, my hair has gotten back to the perfect for summer short look... Hugs to all Octogirl",
      "MessageIndex": 24161,
      "PostDate": "28/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 30, 2016 10:10PM octogirl wrote: Got my first hair cut in a year today. Just a trim. Felt good. About nine months PFC. It was never this curly pre-chemo. My gut tells me it will become less curly over time. ",
      "MessageIndex": 24398,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 30, 2016 10:56PM octogirl wrote: and this one was about 4.5 months PFC. Big growth between three and four months! ",
      "MessageIndex": 24402,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 23, 2016 10:22AM - edited Nov 23, 2016 10:23AM by octogirl Serenity, what a difference. Mine was not nearly that thick at 15 weeks PFC (I do have pics back a ways on this thread). Hang in there all. I just came across a pic of me taken just before I lost my hair, and it is so very different now: it had wave and thickness before, it isn't as thick now but is so much curlier. The curls are a bit out of control: I really need a trim, just so busy that I've let it go a little too long. As soon as Thanksgiving is over, heading in for what will be only my second cut post chemo.... I get a lot of compliments on the curls. Saw a relative I hadn't told about the bc, and hadn't seen in several years, she said she loved my new perm and hair do. Didn't feel like getting into it, so I just smiled and said thanks. The truth is, at first I hated the curls, for no reason other than that they were a symbol of chemo. However, over time, I've realized that they actually are nice, and that a lot of women pay a lot of money to get this type of result (from a perm). They may eventually flatten out, but for now, I am starting to embrace them...... Octogirl",
      "MessageIndex": 24677,
      "PostDate": "23/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 6, 2016 10:07AM octogirl wrote: Groucho, I had the same happen with TC, and had the same anxiety you feel! Now I have lots of curls on top and the sides...(more than a year PFC). It took what seemed FOREVER but it did come back, and yes, I had less on top than the sides. Hang in there. Octogirl",
      "MessageIndex": 24702,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jun 1, 2016 03:16AM - edited Jun 1, 2016 03:16AM by octogirl I also took weekly if not daily photo shots, and really worried that it wouldn't come back. But it has, though curlier and a bit thinner than before (and still short). now it is getting thick enough on top that I am giving thought to actually getting a trim! Octogirl",
      "MessageIndex": 24053,
      "PostDate": "01/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jun 19, 2016 03:45PM octogirl wrote: Cathytoo: I felt exactly the way you do at that stage. It really is too early, but the waiting is really, really hard. Hang in there! Octogirl",
      "MessageIndex": 24138,
      "PostDate": "19/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 27, 2016 04:28AM - edited Aug 27, 2016 04:28AM by octogirl Smurfette, just wanted to say that I have chemo curls too, AND that my hair is also a lot longer on top than on sides (I actually have a few baldish spots on sides, but hair around them hides them), AND I look in the mirror and think I look a lot older! I share your pain... I am going to get my first trim/cut since chemo next week. Will report back and post pics if I get brave. Hugs to all Octogirl",
      "MessageIndex": 24374,
      "PostDate": "27/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 29, 2016 04:32AM octogirl wrote: Thanks MJS...yes, for some reason I have the gut feeling that my curls are not permanent. I've always had wavy hair, but it hasn't been really curly like it is now since I was five years old. I keep thinking this is the 'baby' hair and eventually it will grow out and look more like it used to pre-bc. We'll see. I am grateful to have it, even if I think it makes me look older (it seems like an old fashioned 'style'. As I mentioned earlier, I will see what my stylist can do when I see her Tuesday!) Hugs; Octogirl",
      "MessageIndex": 24381,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Sep 26, 2016 02:49PM octogirl wrote: Probably a question you should ask your RO, but in my case when I had to make a short trip, they assured me it wasn't a problem. I had fairly bad peeling and such but travel didn't seem to make it any worse (or any better). However, note that in all likelihood you will NOT skip the two treatments. Rather, they will tack them on to the end, so your rads will last two days longer. Best of luck;  Octogirl",
      "MessageIndex": 1,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848389",
      "Title": "A trip during radiation - need thoughts pls ayr1016 jctreehugger"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 16, 2016 01:04AM - edited Jan 16, 2016 01:35AM by octogirl Good Morning all: I just wanted to report in a week post final RADS treatment, that it is definitely true that it gets worse before it gets better after treatment. As I think I've mentioned, my skin problems didn't really start till last day or two of treatment. Definitely got worse. I now have two raw patches. One is on the bottom of the breast which is tough since I am large chested, and it rubs against the chest constantly. I am folding up a cool cloth and inserting it under my breast to avoid skin on skin. that helps, and of course since I am large chested the cloth stays in place. The area around the snb incision is also very dark and raw in one spot. looks about the same as yesterday though I've been told it could continue to get worse for another week. The good news is that it hardly hurts at all, not even enough to need OTC pain medication. I use aloe and Aquaphor. Have been debating whether to call RO, but since I am not in pain and it doesn't look inflamed, I don't think I will unless it doesn't seem any better by Tuesday. Honestly, I just want a quiet three day weekend, starting early, without any docs! (my attitude that it isn't worth calling about may be an indication that it is getting better?) I have cabbage in the fridge and going to try that tonight! Certainly couldn't hurt. I have heard from a few other women that the skin issues can be quite painful so am glad I don't have bad pain, at least. I am still hitting a wall in the evening. Hubby cooked dinner last night and the night before. He isn't much of a cook but last night he made chili using my recipe, and it was very good. The only difference between his and mine is that it showed up about 8 pm, instead of 6:30 or 7 as I prefer (he gets home from work later than I do, and is slower in the kitchen.) So I napped, woke up and ate, and then fell asleep. But I am NOT complaining. Yay for the small things! Thr_y: feel free to PM me if you ever need a virtual hug or more suggestions. Wishing you good luck and easy sailing! Re: supplements: I am taking Biotin in the hopes that it helps with hair re-growth (and either it is working or it is all in the timing, as the hair is starting to come back. Slowly, FINALLY.) It is also supposed to help with nails which chemo messes up. I am also taking rx strength Vitamin D, prescribed by MO. That's it for me. Hugs to all! Octogirl ",
      "MessageIndex": 645,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 1, 2016 09:25AM octogirl wrote: Twinki, that does sound like dehydration to me, hope drinking more water helps. I am having sharp intermittent stabbing pain in radiated breast, about three weeks post end of rads. Anyone else experience this? Hugs Octogirl ",
      "MessageIndex": 994,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 12, 2016 01:29PM octogirl wrote: Sailorgirl: I am really glad to read your account of your RO visit; yay for being assertive about your symptoms. Kate: I'd be willing to bet the techs would be happy to show you inner workings. My techs would have appreciated the geekiness... Octogirl",
      "MessageIndex": 1256,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 21, 2016 11:48AM octogirl wrote: Shopgal, hang in there...my skin opened up also, both under the arm and under the breast, and once it started healing it healed very quickly! Aquaphor really helped for me... Hugs to all, Octogirl",
      "MessageIndex": 1529,
      "PostDate": "21/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 18, 2015 09:40AM octogirl wrote: Cubbie, I have been offered a blanket, but I've said no, because I have these weird touch issues where it bothers me to have one side covered up and the other side not...(because I don't like the feel of where the blanket or gown falls on my body when they do that, and it bothers me enough that it makes me feel like jumping off the table. I am just weird that way). I have had to be fairly insistent to convince the (mostly male) techs that I actually prefer to be naked from the waist up. (on both sides). But they get it now. Besides, if they are going to see the 'bad' one, they might as well see the 'good' one, right? Anyway, I imagine they'd bring you a blanket if you let them know how cold you are. The other thing I've done is wear my favorite and very warm knit hat all through treatment. It is totally outside of range, and no one has told me to take it off, and remember that you lose a lot of heat through your head (especially those of us without hair :-( ). I think the hat makes a big difference, maybe you should ask if that is ok for you. The only time I had issues with numbness in my hands or fingers was during sim, perhaps because of the longer time frame, but I do have issues with my shoulder hurting and even feeling slightly frozen and difficult to move after treatment. It happens to be on the treatment side, but fairly sure that is just coincidence: it is the remnant of an old rotator cuff injury and just doesn't like being in that above-the-head position even for a short time. I've been doing stretching, which doesn't seem to help too much but yesterday I took an OTC NSAID an hour or so before treatment and that did help...or perhaps my muscles are getting in shape. Indeed, one of the techs commented how quickly and easily I sat up after treatment: she said I must have strong ab muscles. Hah!! That's a joke and I told her she probably says that to all the girls :-) : but maybe they will be a bit stronger before this is over. One can only hope, right? Hugs, Octogirl ",
      "MessageIndex": 237,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 22, 2015 07:59AM - edited Dec 22, 2015 08:02AM by octogirl Number five of 16 was today...Monday is also check in day with RO, he is very happy with how it looks so far (though granted it is still early days). They were playing some cool Spanish guitar music today. My experience has been that each time goes a bit faster as they get the hang of exactly where to place me...but it could be that I am just used to the process so it seems to go faster. And, I've been lucky on the weather during the drive back and forth so far. justmaximom, I had the same feelings about RO staff vs MO staff that you did. And i did feel quite anxious during the sim. However, things are improving all the way around, and really, I haven't had any complaints or problems other than organizational/administrative issues. I will keep my fingers crossed with you that you don't either...Have hope: I hope I am not jinxing everything by saying this, but as I said to hubby when I got home from my apt today: 'so far, compared to chemo, it has been a piece of cake. Knock on wood!' (Hubby's response: 'you'd better go find some wood to knock on!' :-)) Hugs! Octogirl",
      "MessageIndex": 257,
      "PostDate": "22/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 26, 2015 01:38AM octogirl wrote: 2mnykds, I am almost certain they mean 15 minute appointment times. The machines are quick on the actual 'zap'. Getting you into just the right position takes at least as long as the radiation itself. I am working full time during rads. However, because of the type of work I do, the workplace is shut down for ten days at the end of December for the holidays. This is great timing as the hardest part for me has been carving out time when I am at work to drive the 40 mins to rads, have the treatment and drive back: now that I am off work and enjoying the holiday until after the New Year I feel much more relaxed. However, if I lived or worked closer to the rads center, that wouldn't be an issue for me. We are all different, so you will have to see, but my experience thus far has been that only the distance I have to travel to treatment and the varying treatment schedules, with last minute changes, have been an issue with work (not the actual treatment).",
      "MessageIndex": 286,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 11, 2015 08:23PM - edited Nov 11, 2015 08:23PM by octogirl yay Tresjolie!! Congratulations!!! Octogirl",
      "MessageIndex": 1508,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 7, 2015 06:53PM octogirl wrote: QMC: Yes to the ocean! Hey, the MO only said no pool, he didn't say anything about the ocean...(I haven't asked RO yet and don't intend to until after New Year's)... I REALLY miss the pool though... Octogirl",
      "MessageIndex": 1940,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 15, 2015 11:21PM octogirl wrote: Hugs and good thoughts for you, Kbeee! Octogirl",
      "MessageIndex": 2055,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 4, 2015 09:34PM octogirl wrote: Hello all: Looks like I will start rads the week after Thanksgiving, On December 2bd..so just checking in. I guess that is still Fall and not Winter, right? Looking forward to the tips and the support. Best to all Octogirl",
      "MessageIndex": 1340,
      "PostDate": "04/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 7, 2015 05:18PM octogirl wrote: Sim done, actual treatment starts Monday. Decision on three vs six week pending review...will know by Monday. Hope those of you who are finished or almost done will pop into the winter group now and then to encourage us! Octogirl",
      "MessageIndex": 1937,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 8, 2015 08:51AM octogirl wrote: Queenmomcat: actually, I have a drysuit, so even better: the ocean won't even touch my skin, other than on my face (and that is a good thing: the Pacific is COLD in California!). HapperHammer: actually I might submerge (I am a scuba diver, and it is a dive location I know very well)...probably not, though, unless I am feeling very energetic by then. Will take it easy, but can't wait. And QMC: you are welcome to join me and stand sentry! :-) Molly: CONGRATULATIONS on being done! Hugs! Octogirl",
      "MessageIndex": 1954,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 16, 2015 03:06PM octogirl wrote: happy dance for you kbeee! I know youmust be so relieved as are we!",
      "MessageIndex": 2069,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 8, 2015 10:05AM octogirl wrote: Hi QMC: the difference is just what it sounds like: in a wetsuit you get wet, in a drysuit you don't (unless, of course it leaks, never a good thing when that happens...) Basically, a wet suit works by holding the water next to your skin until it warms up, and that keeps you warm. In theory and in already warmish water: the water in the California Pacific can be as cold as 45 degrees (brr...) and when it is that cold, most divers, especially older, wimpy diver like me, go to drysuits: which work by keeping all of the water OUT...and then have a mechanism for pumping air in as insulation (along with thermal underwear worn under the drysuit...). So, unless my drysuit leaks a bit, I will technically be following doc's orders to stay out of the 'pool' (as we divers sometimes like to refer to the ocean :-)) Octogirl",
      "MessageIndex": 1959,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 27, 2016 01:03AM octogirl wrote: Shopgal, my experience was that once the skin starting healing, it healed very quickly (and mine was pretty bad). Wishing for a similar experience for you! Octogirl",
      "MessageIndex": 1673,
      "PostDate": "27/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Apr 10, 2016 11:02PM - edited Apr 10, 2016 11:03PM by octogirl yay for being done Moondust!! Congratulations! My skin got worse for almost two weeks before it got better; I had peeling and some oozing, especially on the underside of my breast. But now it is fine (three months out). The area under my arm looks to be permanently tanned, and I noticed yesterday that it does look a bit odd in a bathing suit since that area shows a bit. However, since I am not much into sun bathing at all and usually put on some sort of beach coverup when I am not actually in the water, I doubt if anyone will notice. In any case, I am heading on vacation in three weeks, and bathing suits will be in order. I have at least four (as a scuba diver, bathing suits are an essential piece of clothing :-)) So, once I land in Mexico, a trip to the market to find a new cute coverup for those times in the hammock will be on the itinerary! :-) Sending good thoughts and gentle hugs to all. Edwsmom: I wanted to mention that I didn't not find rads as emotionally difficult as chemo, but I can tell you that now that I am several months out from either, I am starting to feel much more whole. Hang in there. Octogirl",
      "MessageIndex": 2461,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 17, 2015 09:06PM octogirl wrote: treatment three today went fine, other than the fact that they called this morning to reschedule it to be an hour earlier than planned...which was doable today but not really convenient since it meant rescheduling a meeting and leaving work early. This is the third (or is it fourth? I've lost track) time I've been rescheduled on short notice. At least this time they gave a reason: they said they had some 'special case' that was going to take a while they had to do in the afternoon, and they wanted to get me in and out before that as they were afraid otherwise I'd have been there quite late. And fortunately, I have the next two weeks off of work so after tomorrow I have much more flexibility with scheduling. They did give me apt times through NYE Day... (4 per week since they are closed for Christmas and NYD); we will see how those times hold up in their schedule book..... and then, they came looking for me to give me: 100% aloe, a personal robe, AND written instructions on what to expect, what to do and not to do, what I could wear and not wear, etc. !!! The staff member who gave them to me said she looked for me yesterday to give it to me 'so you could have it before you started' but just missed me... (? Ok, but I am thinking to myself... yesterday was treatment number two! ). I am with you, Linda: I don't get why it is a big secret until the day before...why not give it to me at the sim? oh well, I do like and trust the RO...and the staff seem to know what they are doing on the technical side. They could use a good office manager though. Still, so far no SEs, so I can't complain too much! linda, hope you get more info from the surgeon, and good luck to all! Hugs Octogirl",
      "MessageIndex": 229,
      "PostDate": "17/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 8, 2016 01:22PM - edited Jan 8, 2016 01:43PM by octogirl HappyHammer: Having a hard time keeping up with this thread, just busy at work and such, so apologies if someone answered this...regarding the area under my breast: they sort of shrugged and said it was normal and to keep applying 100% aloe. It doesn't hurt much, FWIW, so maybe the shrugging is appropriate. Someone gifted me my 'cool cloth' but my understanding is that you can find them in sporting good stores (supposed to be to cool off your face and such after a workout, I think?). There is something soothing, cool and soft about the material, and it is thin, so doesn't create bulges under my bra. I wore it all day today at work... Hugs to all Octogirl",
      "MessageIndex": 468,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 11, 2016 02:50AM octogirl wrote: 1957...I got X-rays once per week. Every day does seem like a lot. The tattoos and markings are supposed to help with the table positioning, I thought. Maybe ask the RO? I have been putting my cool cloth under my bra, and washing it every day. A light cami under the bra would make sense. Hugs to all Octogirl",
      "MessageIndex": 506,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 12, 2016 10:52AM octogirl wrote: Fearless: I did the Canadian protocol (16 days)...didn't think it was all that new actually. I was very, very glad to do it, as the rads location is quite a distance from both work and home. The only issue I had is that, now that I am done, skin issues sort of 'snuck up' on me, I have had a bit of peeling yesterday and today, three days after last tx. I didn't notice any changes in my skin until the last few days of treatment. I think the higher doses make things happen faster, so my only advice would be to keep an eye on your skin. Kimmer: my RO recommended pure aloe, and that is what I've used. That is a totally natural product. Octogirl",
      "MessageIndex": 539,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 19, 2016 09:54PM octogirl wrote: Shopgal, are you allowed to share the way you are losing weight? Congratulations! Octogirl",
      "MessageIndex": 742,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 20, 2016 09:56PM octogirl wrote: Yay Jabe!!!! Happy Dance!!! Congrats on finishing. Octogirl",
      "MessageIndex": 774,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 15, 2016 01:55AM - edited Feb 15, 2016 01:56AM by octogirl Looks like my buddy Rain and I posted at about the same time and with similar thoughts :-)....Hope you have a happy Valentine's Day, motherofboys..",
      "MessageIndex": 3,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841278",
      "Title": "losing my hair  motherofboys Moderators"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 27, 2016 09:06PM octogirl wrote: I like my RO quite a bit...(of course, I am done with Rads, so easier to say that in hindsight, I suspect). My consultations with him were as follows: met with him for an initial consultation where we discussed the treatment plan. Then, during sim, he came in, said hello, looked at what they were doing, asked if I had any questions, and confirmed the number of treatments I'd be having and that he'd see me weekly during treatments. Then, on Monday (the day I saw him each week), they took me into an exam room, took vitals and updated my medical history, and then he came in, looked at the breast/treatment area, told me about my weekly X-rays, reminded me to keep putting aloe on it, and asked if I had questions. Honestly, everything went well and there wasn't much to ask him, but he did say hello, goodbye, made sure I had no questions, and even said 'Happy New Year' on New Year's eve.. :-) I will see him one more time, in a little over a week, for a one month follow up. Honestly, though there were occasional scheduling hassles, the techs were so nice and helpful and rads so uneventful for me that it probably wouldn't have bothered me if he hadn't been approachable, but he was (I did have some fairly significant skin issues/burning and peeling, but they didn't start till after Rads were done....I never bothered to call RO's office about the issues however, since I am healing quickly. Will probably be mostly healed by the time of follow up apt. That said, I think it is worth speaking up if you do have questions.  ",
      "MessageIndex": 917,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 5, 2016 01:49AM - edited Feb 5, 2016 02:01AM by octogirl I had the Canadian version and while I am definitely over 50, I did have chemo prior. I had specifically requested the Canadian protocol (wanted fewer visits, wanted to be done sooner!), and when my MO referred me to the RO, he said I should go with RO's recommendation but that he wasn't sure I was a candidate because of potential skin issues and the size of my breasts (apparently, it is more indicated with small chested women because overall area dosed would be less, thus reducing skin risk). Neither MO nor RO said anything about chemo as a factor but RO also said that he was worried about increased skin issues with shortened version due to the higher doses. So, RO did a sim based on 16 treatments and than ran it by the full Stanford radiation board before starting, which ok'd it (He is Stanford faculty/affiliated). Given the Stanford rads board expertise, I am confident that it was appropriate to my circumstances. As it turned out, I did have some skin problems, but I'd still have chosen it over longer version, especially given the distance I live from the rads facility in a semi-rural area. (The skin issues were manageable, and once I started healing, I have healed quickly). Duzy, I did use the cooling towel before I had symptoms, particularly to prevent skin-on-skin contact on the underside of my breast. I didn't use it religiously, however, and that is where I had the worst skin issues. Probably should have rolled up the cooling towel and worn it there every day. (As I said, I am large chested). Octogirl",
      "MessageIndex": 1075,
      "PostDate": "05/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 19, 2016 08:45AM octogirl wrote: Neen, your trip to Europe sounds absolutely lovely and I think by six weeks post rads you will be fine. I am almost six weeks post right now and while I am sleeping a bit more than previously, my energy level is close to 'normal'. My advice would be to start walking now if you don't already...even short walks will help you build stamina. And have fun! Octogirl ",
      "MessageIndex": 1485,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Mar 2, 2016 05:53PM octogirl wrote: Kate, so sorry about the nasty flu bug...hope you fight it off soon. Androxo, yes, the henna is amazing. Peabrain, ShopGal and Jersey: Yay for finishing!! WoooHooo! Hugs to all Octogirl",
      "MessageIndex": 1788,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 27, 2016 11:28PM octogirl wrote: yay for finishing Cubbie! Happy Dance.... Octogirl",
      "MessageIndex": 922,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 5, 2016 01:51AM octogirl wrote: Yay for finishing, Keep Walking! Hope you get your energy back soon! Hugs, Octogirl",
      "MessageIndex": 1076,
      "PostDate": "05/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 18, 2016 08:12PM octogirl wrote: kate...regarding the stiffness: have you started Tamoxifen? It can also cause that, in fact is a common SE I think, as is the case with Arimidex. Or it could be the rads: in the Fall Rads group it was an on going joke that all the ROs would say \"It's not Rads\". Not that funny I guess. Lindy and others finishing, YAY! and Congrats! Octogirl",
      "MessageIndex": 1469,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 7, 2015 05:15PM octogirl wrote: Had the sim today. It went reasonably well. RO is going to run the computer sim and models by the Stanford board (he is affiliate faculty) to make his final recommendation for three or six weeks (he knows i want the shorter version if possible)..I will go with his rec. First treatment Monday either way... Octogirl",
      "MessageIndex": 157,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 13, 2015 12:23PM - edited Dec 13, 2015 12:24PM by octogirl rain, I have never had schedule or appointment changes during chemo or in MOs office at all, or for that matter during surgery follow up even though I had wound healing issues and for a while there was seeing bs once a week. Of course, bs had the BEST STAFF EVER (seriously, even the hospital techs talked about her staff and how wonderful they were...)...so maybe I just got lucky until now? (sweet staff definitely make all the difference, don't they?). Anyway, thanks for the post back. It does make me feel better to see the mental image of you as a cranky NY Jew pushing back: maybe I should channel that part of my inner heritage a bit more? :-) I do have a lot of flexibility in my own schedule even though I am not self employed, and can lug a laptop and get a lot done: the problem is that if and until I know what the schedule is, I can't schedule any meetings without risk of all the hassle of trying to reschedule, and, unfortunately for this situation most of my work is done in teams with others (necessitating those meetings I then have to reschedule... :-( ) Hugs Octogirl",
      "MessageIndex": 199,
      "PostDate": "13/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 30, 2015 10:33AM octogirl wrote: Ivy2: one of the hardest parts of this whole process, for me, has been staying out of water! I am an octo(pus) girl, water is where I live! :-) Alas, BS, MO and RO all agreed: no pools or hot tubs during chemo or rads. I am going to cheat just a bit this weekend (shhh....don't tell). In honor of the New Year's I am going to jump into the Pacific with some dive friends. However, as a concession to both bc and the water temps, I will be wearing a drysuit. A drysuit does just what it sounds like: keeps you dry. The only part of me that will get wet is my head and face (will have a hood, but it doesn't keep the head dry). So, not too much of a cheat. Can't wait! (won't be diving; just swimming around with a mask or snorkel to get the feel of the water...) I did want to mention one strange thing that happened yesterday: I started to feel a high level of anxiety right in the middle of the tx. My heart started pounding, and it took every bit of my self control not to jump off the table. For some reason, I didn't feel 'right' in terms of placement. Haven't had that problem at all before, hope it isn't an issue today. Going to try visualization also. Hugs to all; Octogirl",
      "MessageIndex": 321,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 30, 2015 02:15PM - edited Dec 30, 2015 02:16PM by octogirl on the question of correlation of skin color/tone and SEs: I had actually read somewhere (I think it was on one of these boards) that the opposite of what you'd expect from sunburn is true, and that dark skinned women tend to do *worse* than those who are very pale. I have no idea which is actually the case (if either) but I can tell you all that I have relatively dark skin (for a white girl :-)) that doesn't easily burn, and before rads started my RO was very concerned about SEs, and told me I was at high risk. He didn't really fully explain why, but I did have healing issues after the Lx surgery which was a factor. and so far, so good. RO said my skin looked 'wonderful' when he did his exam on Monday.... My guess is that it could be like everything else we experience: very individual. Tiffany, good luck! Just remember how nervous you were before chemo, and how that turned out relatively well. Octogirl",
      "MessageIndex": 330,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 30, 2015 07:32PM octogirl wrote: Hi Jabe: No, not in chemopause....I am almost 62 and that ship sailed for me a long time ago, before chemo....but today i had no problem, other than that my arm got a bit more sore being above my head than it usually does. but otherwise, I was fine, no panicky feeling like I had yesterday. Go figure. For some reason it all felt a bit, or more than a bit 'off' yesterday.....But with only five left after today, I feel like I can do this! (Honestly, compared to chemo, it feels like a piece of cake...but again, we are all different.) Hugs to all; Octogirl",
      "MessageIndex": 335,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 30, 2015 08:52PM octogirl wrote: Hi Sos...I had CT scans at time of sim, which I think is common...apparently it is part of the planning process to figure out the correct dosage, how to aim it, etc. I think looking over prior images is also part of that process (my RO did ask for and review all my records). But a mammogram, I didn't have, and I suspect that isn't what was meant......let us know though.... Hugs; Octogirl",
      "MessageIndex": 337,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 11, 2016 12:47PM octogirl wrote: Meant to add that my RO tech had mentioned maxi pads...but dumb question maybe: don't they have adhesive? (I am several years into menopause and can't remember...) I guess you just leave the adhesive strip cover on (?) , since they aren't supposed to absorb, just soften (I'm sensitive to adhesive so pretty sure my skin wouldn't be able to handle any). Hugs; Octogirl",
      "MessageIndex": 519,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 20, 2016 01:21AM octogirl wrote: Yay for finishing Cardinal!!! Congrats!!! Peabrain, I think my attitude was a bit poorer as well. Fatigue, probably, just wanted to be done. Hugs to all, Octogirl",
      "MessageIndex": 712,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 2, 2015 02:17PM octogirl wrote: Sloan, thanks for the post and the positive (more or less) report...it helps! I am frustrated today: was supposed to have my sim tomorrow...at five tonight the ROs office called to say all sims were cancelled for tomorrow (no explanation as to why) and the soonest they could reschedule me is Monday am. Could be worse I guess, but still very frustrating to have to wait more when I feel like it is all about hurrying up and waiting. I want to get this over with! Sigh. The only good news is that I am not expected at work tomorrow am. I might just sleep in. Octogirl",
      "MessageIndex": 88,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 7, 2015 12:49AM - edited Dec 7, 2015 12:51AM by octogirl Hi all...good to see some of my chemo sisters joining this group! Sandy, I was actually told something somewhat different about the three vs six week: My RO said that it was overall (large: I am also DD) breast size that was the concern, not tumor size, because more radiation would be needed to cover a larger area (though I suppose that could also refer to tumor location and area since my tumor was located just below the nipple at six o clock and was just over 2cm...I wonder if I missed part of what he said or misunderstood?) and his concern was primarily with increased change of infection/skin irritation with the larger dose of the shorter protocol. He also mentioned the fact that I had skin problems post surgery as a concern, and noted that he might put me on a prophylactic antibiotic partway through rads. However, after measurements and sim (now scheduled for Monday) he will run it by the Stanford rads board since he is on the faculty and affiliated and will give me the overall board's opinion, since I had told him I really hoped for the shorter option......I am comfortable following their recommendation as a board, especially given that Stanford (and this RO) are big proponents of the Canadian protocol when appropriate. Either way, I am glad to be FINALLY starting (with Sim) Monday! I will be working full time. However, my work pretty much shuts down between mid December and the first of January, so will have about ten days off in the middle of it. January will be busy, however, so hope I am able to continue full time. I pretty much worked full time during chemo except for fusion day and the day I crashed from steroids each round (day after chemo was always a great work day thanks to steroids :-)) As I have mentioned, I think, it is 45 mins drive each way, no public transportation available, but no snow either. Rain and fog can be an issue here, though rain hasn't been a big issue the past few Decembers thanks to our on-going drought; we'd all be thrilled to have that problem, fingers crossed for rain, actually. And I will be doing the drive in a brand new car I decided I deserved and bought with rads as an excuse... :-) Right now, I just want to get started. I am much more anxious about my hair (when WILL it come back?...) than rads. I hope it goes well for all of us! Octogirl",
      "MessageIndex": 145,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 13, 2015 11:50AM - edited Dec 13, 2015 12:09PM by octogirl rain: I hear you that schedule changes are unavoidable; I get that. However, you seem to have been informed as to the *reasons* for schedule changes and delays... I have had two even just during the sim and initial starting phases, and in both cases they either wouldn't or couldn't tell me why: even though in one instance they called me at 5:15 pm to cancel an appointment scheduled at 8:30 the next morning! Under those circumstances, it would have been nice to at least gotten an apology for the inconvenience, if not a reason, but all I got was \"we need to change the appointment\"...not even an \" we are sorry\" . In the most recent instance, they did call on Thursday to change a Monday appointment, but no reason was given other than 'Doctor asked us to change it' (talk about crazy making, and I think it is fairly obvious that, while no one told me why I was being changed, it wasn't a machine breaking down if they were calling me on Thursday for a Monday change). Again, not even an acknowledgement of inconvenience when I pointed out that, given that it is a minimum of 40 minutes drive each way to my appointment, that changing an appointment from 4:45 pm on Monday to noon on Tuesday makes a huge difference in terms of whether I can work during rads. If they had just cancelled and kept my expected appointment at 4:45 pm Tuesday it wouldn't have been any big deal, but they told me that 'wasn't possible' without explaining why (I had been previously told that while my schedule would be finalized for the next few weeks at the Monday apt. that I could expect the appointments to all be late afternoon since that was my preference and the late afternoon time frame was their least popular....). I only missed a few days of work all during chemo, and already it appears that I am more likely to miss work during rads than during chemo, even though it is supposed to be easier physically. Thanks for letting me rant about this. Frankly, when I mentioned it to the person who called me about the changes, she just didn't seem to understand. Seemed downright confused about the concept that it is hard to work FT and have last minute changes to a schedule..How could I possibly be the first person who has to work for a living during rads in this practice? If it happened again, I'd be tempted to switch ROs...but that is the other problem: they have you over a barrel in terms of service: once started, switching really isn't an option, especially meaning how much of a delay there would be to find another RO in my area where they are rare, get consultation apt, sim done, and all the rest, even assuming insurance would pay for another sim at this point. Stuff happens. I totally get that. But the response to 'stuff' happening is what makes all the difference in terms of one's patience and one's confidence in the provider. Edited to add: when I read this it sounds harsh. Maybe I am being a bit harsh. But damn it, no one ever even said they were sorry for the inconvenience, much less gave a reason for the changes. Sigh. Octogirl",
      "MessageIndex": 197,
      "PostDate": "13/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 15, 2015 10:39PM - edited Dec 15, 2015 10:41PM by octogirl Hi all: first treatment today...it went well. I still didn't get much info about what to do and what not to do (no one has said ANYTHING about gels, or aloe or any such, so I figure I will just listen to what others recommend on this board unless i have problems...the techs did show me a board that they project my information on for each rad, and there is a place there where I am supposed to rate my pain level each day...ok...but what if I have itching?..) But I am NOT complaining, because the RO gave me the great news that the Stanford radiation Board reviewed my sim stuff and models, and recommended that he go with the 16 day version, so he is! So happy! He did point out that if I do have problems he can always scale back, but I am hoping all will go well, in which case, 1 of 16 done! Woohoo! They did give me my appointments for the next three days, and they are late in the day as I prefer. Easier to blend with my work schedule. Of course starting next week I am on vacation for two weeks. Heck of a way to spend one's holiday break, right? Hugs to all Octogirl",
      "MessageIndex": 214,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 16, 2015 02:59PM octogirl wrote: rain...at my treatment yesterday they played Xmas music over loudspeakers....mixed feelings about that....it is distracting in s good way.... But the Grinch in me would rather listen to classical...",
      "MessageIndex": 221,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 25, 2015 01:42AM - edited Dec 25, 2015 01:45AM by octogirl My understanding is that the Canadian protocol refers to the shorter (and more dose dense, I believe) approximately three week version of rads, as opposed to about six weeks. That is what I am getting: 16 sessions altogether. so far it is going well. There is research showing it is effective (and it is certainly more convenient), but unfortunately, I couldn't find a quick link on the BCO website to share with you. Octogirl",
      "MessageIndex": 282,
      "PostDate": "25/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 7, 2016 02:31AM octogirl wrote: Only three treatments to go for me! Party on Friday night! :-)...but after sailing through, I did notice a small patch of iffy skin last night, and it is in a bad area: on the underside of my breast, right where it rubs against my chest (I am large breasted). It isn't visible when I am standing or sitting, though it is presumably visible when I am lying on the table. I slept with a cool cloth tucked under the breast, and will show it to techs today. RO saw me yesterday, but I didn't mention it because I didn't know about it: I didn't notice it till last night, because of the location, and because of the fact that it doesn't hurt or itch, just looks like skin is breaking down there. RO didn't notice either, but he didn't do a very complete exam. This is probably partially my fault for telling him that all was great and that I've been having no pain, no itching and no skin problems. Lesson learned for others: check the hidden areas (for large chested women), and be sure to put plenty of the cream there too.....and the cool cloth is something helpful to buy (for Lindy and others wondering about preparation: I didn't find I needed it after each treatment, but I find it helpful to prevent skin on skin contact now.... Still no pain or itching though, so I am cautiously optimistic that I will be done with minimal SEs... Octogirl",
      "MessageIndex": 432,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 19, 2016 10:43PM octogirl wrote: Welcome Y0tis, we are glad you found us. This whole process is a scary one, but most find the rads to be quite doable. Let us know how the sim goes and please do post any questions. Hugs! Octogirl",
      "MessageIndex": 745,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 20, 2016 09:46AM - edited Jan 20, 2016 09:47AM by octogirl Thanks Shopgal...so, in other words, no magic bullet, just reduce calories, eat food that is good for you and exercise. Maybe I was a victim of magical thinking and was hoping there is something new out there! :-) I am exercising (and posting on the 'exercise during chemo and radiation' thread)...and have cut back on calories post chemo and post holidays, but not losing. Altogether I gained over ten pounds during and just after chemo. The fact that vegetables tasted bad but mashed potatoes and ice cream tasted good (or at least decent) probably had something to do with it. Working on it though, and good for you for being disciplined, Shopgal! On a different topic: I am now 11 days post final rads and I am seeing signs of healing although I do have two large open spots on my skin and peeling. The open spots don't hurt, though I am having some itching, and I am less tired. I will admit that I came home from work yesterday and collapsed on the couch and let hubby cook dinner for me, but that was mostly because of a brutal work day.... Hugs to all; Octogirl",
      "MessageIndex": 752,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 24, 2015 09:56AM octogirl wrote: Yay and congrats OneBB... and sorry it has been so tough for you, Rain! :-( Hugs! Octogirl",
      "MessageIndex": 2147,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "May 26, 2018 09:29AM - edited May 26, 2018 09:33AM by octogirl no regrets at all. At the time, i was really worried about my hair coming back, but eventually it did come back, and with more curl than before. It looks good, though it did take me a while to admit that to myself....chemo itself was no fun, but it was definitely doable. I worked all through the process. And the best advice I got was to keep exercising during chemo: it helped tremendously even though some days I didn't feel like doing more than walking around the block! I've had more permanent side effects from the AIs than I did from chemo for sure. AIs probably hastened the inevitable knee replacements I've had due to osteoarthritis (have had both knees replaced). I had a full cardio workup before my knee surgery and know that my heart is fine, which I worried about... As others have said, you might want an oncotype or mammaprint test before making a final decision, given your profile. Also, I noticed you are supposed to start rads right away: just fyi, most MOs want to do the chemo before the rads, I believe. Best wishes to you. Octogirl",
      "MessageIndex": 10,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864856",
      "Title": "Do you regret doing Chemo? GreenEyes81 Zenmushroom"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jul 24, 2018 02:57PM octogirl wrote: I had TKR on each knee in two separate surgeries (not both at same time) this past year. I only had one IV line (other than epidural stick in my back/spine area, more on that in a minute) and one blood pressure monitor, both on same side which was not my lx side, so not quite the same situation as yours, but still, not sure why multiple IV lines are needed....They put a medical bracelet on me before surgery that remained during hospital stay, to remind care givers no bp or pricks on right arm. The only other thing I had was a machine they put on your legs after surgery to massage and stimulate them to avoid DVT (which is a significant risk after TKR). Sorry, can't remember what it is called. I can tell you that I asked to have it removed early because it was annoying and noisy and kept me awake (which they did do per my request). One tip I can give you since you are discussing IVs etc with your doc: I urge you to consider an epidural for your anesthesia. I had it with both surgeries and it was GREAT! I believe it is lower risk than a general (they also sedated me heavily and I was not conscious during the surgery) but most importantly: when surgery is done and you come out of sedation, you are still numb, and the numbness lasts for about a day. That made recovery SOOOO much less painful, especially in those first few hours. Best of luck. Getting my knees replaced has made a tremendous difference in my QOL; for me it was more than worth it. and do your PT! Octogirl",
      "MessageIndex": 9,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/866027",
      "Title": "Total Knee Replacement Surgery Issues - Left Arm Lymphedema Sher Sher"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 27, 2018 10:46PM octogirl wrote: Was the surgeon a surgeon who specializes in breast surgery? I'd consider seeing someone who is...if you post your general location (state, whatever) perhaps others in that area can send you a DM with recommendations. If you are in that much pain, something is wrong. That doesn't mean you have bc (odds are you don't), but you shouldn't have to live with that type of pain... I'd go for another opinion. Best of luck and keep us posted.",
      "MessageIndex": 1,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866872",
      "Title": "Should I get a second opinion? Dancing_on_the_moon Erinashley19"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 4, 2015 10:01PM octogirl wrote: oh yes, definitely glad...though I still have one chemo to go Monday! After that, I get a few weeks of rest, just in time for Thanksgiving. Maybe my taste buds will have returned by then. One can only hope.... Octogirl",
      "MessageIndex": 1342,
      "PostDate": "04/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 21, 2015 06:33PM octogirl wrote: Sending very gentle hugs, Rain! That sucks. Octogirl",
      "MessageIndex": 2118,
      "PostDate": "21/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 5, 2016 10:15AM octogirl wrote: Rain, so glad to hear you've turned the corner! Octogirl",
      "MessageIndex": 2220,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Oct 20, 2016 10:55AM octogirl wrote: I live in a semi-rural area and the closest radiation center/location is a 45 minute drive from me. For this reason, I wanted the Canadian shorter protocol, as I planned to (and did) work through radiation, and doing all of that driving back and forth especially in winter (heavy, dangerous fog is an issue around here in winter) just did not appeal..I just don't drive that much (my work commute is 4 miles, I could even walk it if I were ambitious). When I asked my MO and RO about it they expressed doubt as to whether I would be an appropriate candidate. However, my RO, while still in a small town, had an affiliation with a large center (Stanford) and said he would run it by the entire Stanford Rads Board after doing the sim, getting x-rays, sharing my charts with them. End result: the board gave their ok to the shorter protocol and we did it. I did reasonably well, but I did have rather bad skin peeling and burning. I was amazed at how quickly it healed once rads stopped, however. And, even with only three weeks of awful driving, I decided that it was as good an excuse as any to treat myself to a new car...:) So, I agree with those that recommend you seek a second opinion at a NCI Center if at all possible. Knowing that the experts at Stanford were on board with the decision gave me peace of mind. Octogirl",
      "MessageIndex": 15,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 15, 2016 01:52AM octogirl wrote: Big hugs, motherofboys! I am so sorry. losing my hair was the hardest part of this ()*%()* for me also. and I am also not a girly girl but hair is important to our self-identity. I told my MO that I think I would have rather lost my breast than my hair and he told me he heard that surprisingly often... but keep the faith. It does get better. There is a thread here: https://community.breastcancer.org/forum/69/topics... that might help.... Octogirl",
      "MessageIndex": 2,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841278",
      "Title": "losing my hair  motherofboys Moderators"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 24, 2015 04:22AM - edited Dec 24, 2015 04:22AM by octogirl gooseberry, I am also on my back (for about ten minutes all told, as others have said, or even a bit less)...but I have a sense of what you are talking about because I did a MRI in the prone position. When they first lined me up for it, I had excruciating pain. I told them I just couldn't do it, and they made some adjustments, and while it wasn't great, it wasn't nearly as bad. So even though the sim is the worst, if you are still bothered, I'd speak up. It might mean having to do the sim over but I just don't think you should need to endure that much pain. Perhaps talk to your RO? Hugs! Octogirl",
      "MessageIndex": 271,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 29, 2015 10:16PM octogirl wrote: I've just finished number ten of 16....seems like the time is flying by. Just four this week, and just four next week as well as they are closed for New Year's and I have to skip Monday as well due to a work commitment. I've also had some scheduling issues....but since I am not working this week it is easier to go with the flow. I did ask for an early appointment on New Year's eve as we are going out of town for the weekend: got 7:45 am. Sigh. Be careful what you ask for.... So far, skin problems have been minimal, just a little pink for me as well. I had to have chemo delayed for healing of my lx incision, so I know the feeling mapagail...it is best to be healed first, but frustrating not to get it just started and then over with... Hugs; Octogirl",
      "MessageIndex": 315,
      "PostDate": "29/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 30, 2015 10:58AM octogirl wrote: Rina, while I have never been to Jerusalem, I was once in Amman, Jordan when it snowed about two or three inches. A magical day. I like the idea of coming anytime between 7 and noon. Given how messed up scheduling has been, I wonder if that wouldn't work better for other offices: just come, get a number, wait your turn....I bet it is actually just as efficient though I suppose it could mean a longer wait time if everyone decides to come at the same time one day. OTOH, while I didn't have a wait yesterday, the day before they got behind and I ended up waiting an hour and a half past my scheduled time! Was very glad to have my e-reader....can't imagine the system that your office uses being any worse, but will be interested to hear your experience. Octogirl",
      "MessageIndex": 323,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 31, 2015 02:50PM octogirl wrote: sos, calling for clarification seems like a good idea. I had chemo in between surgery and rads, so was more healed than you are, (at least as far as the breast goes) but I'd still not have been happy to have been asked to do a mammogram before rads started.",
      "MessageIndex": 342,
      "PostDate": "31/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 9, 2016 11:11AM octogirl wrote: I'm done!!! Woohoo!!! My report back on side effects: skin doesn't look great and is peeling just a little in one spot under my breast, where the breast rubs against chest (being large chested). Area under my arm near SNB looks quite tan, but not peeling. Neither spot hurts other than occasional twinges. I am not feeling too much fatigue, but am definitely glad I had the 16 day protocol, much less driving (which I think would really add to the fatigue given that it is 45 minutes each way)... They did a little congrats song for me and gave me a balloon when I finished. Here it is... ",
      "MessageIndex": 486,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 13, 2016 12:59AM octogirl wrote: keepwallking, yay that you are doing ok so far! Good to hear from you! Four days post final treatment, I am having a bit more swelling and my skin is dark and peeling under my breast in one fairly small spot. I've read it gets worse for five to seven days before it starts to get better...it isn't painful enough that I've needed any medication, but it feels tight, especially in the morning. Going to try cabbage.... Octogirl",
      "MessageIndex": 546,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 14, 2016 11:21PM octogirl wrote: Thry, that is more or less my story on chemo: really wasn't expecting it, and then wham, have to do it based on being high risk from the test. Good for you re: cold caps. No, it doesn't mean you are vain. Hair is important and losing mine has been one of the toughest parts of this whole thing. I thought cold caps would be too much trouble but a big part of me now wishes I had given them a try. Definitely join the Jan chemo group and good luck to you! You can do this. Hugs Octogirl",
      "MessageIndex": 607,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 30, 2016 01:59AM - edited Jan 30, 2016 01:59AM by octogirl I agree...just wow. It doesn't speak well for the supervisor that he or she let someone else's complaints change their mind/permission to work at home. I supervise a small unit, and if someone complained about that to me, I'd tell them to concentrate on how they do their own job and that as the boss, it was my job, not theirs, to balance work loads and schedules with staff needs. I had one staff member who worked from home for a month when her husband became ill. It worked out fine. sorry you have to deal with that Linda. Ice cream would help me too, but I hope the pain goes away soon! I did have lots of peeling but not a lot of pain, the good news is that it healed quickly once rads finished. Hugs! Octogirl",
      "MessageIndex": 947,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 12, 2015 05:24AM octogirl wrote: I am on the Fall Rads group but will straddle winter, with a likely start date of December 7th (sim is on December 2nd) with six weeks....So will join this group as well. Looking forward to sharing tips and support. Octogirl",
      "MessageIndex": 3,
      "PostDate": "12/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 2, 2015 10:06AM octogirl wrote: Morning all! I slept till 6:30...which for me is sleeping in..... It is about 35 to 45 minutes drive each way to my rads location, depending on traffic....I live in a semi-rural area, and that is the second closest location to me. The closest is only a mile and a half....which would have been fabulous. Unfortunately, I was not completely comfortable with the RO, and my MO and his staff weren't at all enthusiastic....and encouraged me to go to the one I chose. I was happy with my choice until the last minute cancellation, but I guess stuff happens. Would have been nice to get some reason: I mean, if everyone of staff got the flu, that would be a good reason to cancel apts., but it is a little annoying to be cancelled with no apology and no reason.....all right, I am done whining. Will let you all know how the sim Monday goes. Fortunately, we don't get snow here, which is a good thing given it isn't a short drive... Octogirl",
      "MessageIndex": 101,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 15, 2015 09:56AM octogirl wrote: Love the aloe plant! Such a thoughtful gift.... heading in today finally for what is supposed to be first session. But changed at Doc's request from yesterday, as I think I mentioned, so we will see, perhaps, why.....I didn't have a big day at work today so I decided to take the day off and maybe get a bit of shopping and eating done before or after. My grandson's third birthday is next week and he will be visiting, so need to order a cake and buy presents! DD says he is into 'Paws Patrol'. Of course, I had to google it, but now that I know what I am looking for, a visit to Target is in order.... Hope everyone has a good day today! Hugs Octogirl",
      "MessageIndex": 205,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Dec 15, 2015 12:58PM octogirl wrote: Lindab: I haven't been told anything about preparation either. It seems like this big mystery. Unlike during chemo, where they sat me down and held my hand (so maybe I was crying a bit) right after telling me I needed it, and took lots of time to explain it all...very strange contrast. I haven't figured out why it is such a different climate in the ROs office but it would make for an interesting study some day.... Octogirl",
      "MessageIndex": 207,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jul 31, 2017 09:27PM - edited Jul 31, 2017 09:29PM by octogirl Good luck Autumn, and do keep us posted as Ruth says. I think this suggestion might have been made earlier, but if you haven't, you might want to join a chemo thread. I think there is one for August. It was very helpful for me to talk with others going through it, and it helped me with preparation as well.... Edited to add: I went looking for the August thread to link it here, and I see you have already found it and just posted there! Hope it helps and good luck! Hugs Octogirl",
      "MessageIndex": 41,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856900",
      "Title": "Did you work through chemo? Autum1031 sweetp6217"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jul 24, 2017 10:51PM octogirl wrote: I also worked through chemo...and would do so again under the same circumstances. I had a day job with great sick leave and a very flexible boss and co-workers (I've since retired). My infusion days were Wednesday, every three weeks. I generally took Wednesday as a sick day and worked from home Thursday of infusion week, back in the office on Friday, and while I didn't take any calls I will admit that yes, I answered work email during infusion....I didn't worry about catching 'bugs' (though I washed my hands frequently and had nuepogen shots, and my counts stayed in normal range), but then, my chemo was really before cold and flu season (it was in the fall). I even traveled for work twice during chemo; once was just a short day trip; when I had an important three day conference three hours drive away that would have been hard to miss, the day after an infusion, I went, but had hubby drive me and come along just in case, after making sure that the conference hotel had a fridge for my nuepogen shots (taken for five days after each infusion; that is the other reason I brought hubby along: he did a great job of giving me the shots, I couldn't have done it myself. It wasn't hardship duty for him, the conference was at a lovely locale by the ocean). I did fine at the meeting, including making several presentations, just got tired at night and skipped the networking around the bar. When I started chemo, my MO told me he wanted me to live 'as normally as possible', and encouraged me to keep working if I felt up to it. He also encouraged me to exercise through chemo; best advice I got. Staying active really helped. A note about the steroids: yeah, they gave me energy, but for me at least I found that while I thought I got a lot accomplished while on them, when I checked my work the following week I usually redid it. Also, co-workers told me I talked a whole lot :-) So, in truth, I wasn't very productive on them. I had a real love/hate relationship with those steroids. (Never got nauseated except one time when I ate a large serving of very, very spicy dan dan noodles after an infusion. probably a mistake though they tasted good going down.)",
      "MessageIndex": 21,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856900",
      "Title": "Did you work through chemo? Autum1031 sweetp6217"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jul 25, 2017 11:15AM octogirl wrote: yeah, the one thing I'd probably do differently in regards to working and chemo would be to get a wig, and/or to try cold capping (though finding an infusion center that would support cold capping would have been difficult in my semi-rural area). I wore caps and scarves, but I really didn't want to be treated differently by co-workers. It was particularly difficult at the conference I mentioned, because it was a health related conference, and several of the participants were from NIH/NCI. So they took one look at my scarves and knew what was going on, which kept it from being totally private. Love the shopping story Ruth!",
      "MessageIndex": 30,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856900",
      "Title": "Did you work through chemo? Autum1031 sweetp6217"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Nov 9, 2017 12:24AM - edited Nov 9, 2017 12:24AM by octogirl I had the Canadian method...I told my RO I was interested due to distance between my home town and radiation center (didn't want to do that commute any more than necessary), but he wasn't sure I was a candidate, NOT because of the chemo, but because of size/location of tumor and breast size (apparently side effects can be greater with that method in larger chested women). However, while he isn't physically located at Stanford, he has a Stanford affiliation, so he ran my case by the entire Stanford radiation Board and they said sure. I didn't research it at all but figured if it was ok with the Radiation Dept/Rad Board at Stanford that was good enough for me... by the way, I did have a fair amount of redness and skin peeling. However, once I was done it healed very quickly.",
      "MessageIndex": 10,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859951",
      "Title": "Canadian method (16 treatments) even after chemo Brightness456 runor"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Oct 8, 2017 02:09AM - edited Oct 8, 2017 03:02AM by octogirl I had difficult taste issues also...but mashed potatoes and gravy tasted good even when nothing else did. as did ice cream, and chicken, but other types of protein, I didn't want to eat. I didn't worry about good nutrition, just about getting calories. Spicy foods tasted good but I did find they upset my digestive track more than usual.",
      "MessageIndex": 69,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856900",
      "Title": "Did you work through chemo? Autum1031 sweetp6217"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 29, 2016 02:36PM octogirl wrote: I had four rounds of chemo, T/C, and when I asked MO about port he said I didn't need it. He was right (for me). The nurses at the Center where his practice is located did a great job of finding veins, all in my 'good' arm, with no misses (tips: be sure they warm up your arm before trying, and hydrate well) and I was happy not to have the additional, albeit minor, surgery or the port scar. I'd have felt differently on a longer regimen but I am of the opinion that sometimes less is indeed more. I didn't feel sick, though I did have pain in my tumor area for about a month or two before dx. The only thing I'd probably do differently if I had to do it over (and here's hoping I never do) would be to get a wig, and/or try cold capping. Hats and scarves get old, and to me they screamed 'cancer girl' which I found hard to deal with. I also became obsessed for a while that my hair would never come back. Thankfully, now it is. The best advice my MO gave me before chemo was to 'live your life as normally as possible. Exercise, work when you feel up to it, go out, try to have fun. You will get through this better that way.' Octogirl",
      "MessageIndex": 13,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/840818",
      "Title": "But I Don't Feel Sick! NY30 NY30"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Aug 13, 2015 08:16AM octogirl wrote: Hi: It sounds like you need more information...is there some condition causing that many lumps? Are you feeling them as lumps but doc sees something else (and apparently something not concerning to doc?). And I can't imagine not checking out new lumps (at least and unless there is some explanation as to an underlining condition causing them). For what it is worth, my opinion is that since doc doesn't want to see you but your questions haven't been answered, it is time to get a new doctor! I can't imagine staying with one who 'didn't want to see you' and didn't answer your questions. A second medical opinion is definitely warranted. If it turns out to be nothing, you will have peace of mind, and if it is something, you don't want to wait. Listen to your body. Since you have no family history, you might ask about genetic counseling as well. Good luck to you! Octogirl",
      "MessageIndex": 1,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834205",
      "Title": "help. I dont know what to do with \"okay\" but no info dannielynn Moderators"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jul 23, 2015 11:26AM - edited Jul 23, 2015 11:26AM by octogirl based on what I had read on these boards, the part of the Lx that I was dreading the most was the wire insertion, dye insertion, etc. My worry wasn't lessened by the fact that while the tumor biopsy went ok in terms of pain, I bled from it A LOT and bruised quite a bit. My tumor was right under my nipple (which was removed during the Lx) so it was in a particularly sensitive area. I mentioned my concern to bs at pre-op and was assured that lots of lidocaine would be used. I mentioned again in the radiology room before radiologist started the procedure for wire insertion. He again assured me that he'd use lots of lidocaine and said bleeding from this procedure tended to be much less than from biopsy, but that he appreciated that additional information. And, as it turned out, they were right and I wondered why I had worried so much. The mammogram guided wire insertion went just fine. No pain or discomfort at all other than the initial prick when they shot me full of lidocaine. In fact, the radiologist kept saying 'you might feel some tugging or pressure now'...but honestly, I didn't even feel that. All I could feel was the nurse holding my hand :-) The worst part was that the same nurse who held my hand was the chatty type, bless her, and I just wanted to tell her to shut up so I could just breathe (but I didn't, she was sweet and meant really well, and her chatting was quite annoying but didn't hurt, and pain was my fear!_ As for the dye, the bs did that herself after I was out on the operating table, so that wasn't an issue either. I still don't know what EMLA is, but whatever it is, I didn't need it. Honestly, my advice would be to TALK to your Treatment providers and tell them what you need to be comfortable! Once I was told that there would be lots of lidocaine, I had no intention of letting them do ANYTHING before that lidocaine took effect, and that worked for me. It could save you a lot of anxiety and worry to talk with them and ask directly what to expect and what they will do about pain.",
      "MessageIndex": 22,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/833592",
      "Title": "Sentinel node biopsy - do I need Emla cream? rleepac Aug242007"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jul 23, 2015 12:55PM octogirl wrote: Thanks for explaining what EMLA is exbrnxgrl. Same purpose as a lidocaine shot, although sounds like it works a bit differently? In any case, my recommendation based on my own very limited experience, regardless of whether EMLA or a shot is used is to let the provider know the concern up front and be sure it is addressed. Dont get me wrong: I feel strongly that we should be actively involved in our own treatment, but I don't think we should have to always take the lead either. I suspect we are all on different parts of that spectrum. Gentle hugs to all!",
      "MessageIndex": 25,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/833592",
      "Title": "Sentinel node biopsy - do I need Emla cream? rleepac Aug242007"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Feb 22, 2019 07:23PM octogirl wrote: I just wanted to echo others who suggest continuing to exercise (which really helped me), and as someone mentioned, I always tried to schedule it late afternoon, which meant I could go home and collapse on the couch afterwards. In my case I had a 40 minute commute each way to the radiation clinic, as I lived in a small town at the time, and I am sure that driving back and forth didn't help my fatigue! (I did convince hubby I needed a new car if I was going to make that drive every week day :-)) I continued to work full time. I wouldn't cut back on work unless you feel the need after starting rads: everyone is different.",
      "MessageIndex": 18,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869684",
      "Title": "How Fatigued were you during rads treatment? kec1972 Carol2018"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 27, 2016 09:30PM octogirl wrote: I can't see my radiation tattoos. I'd probably need reading glasses or a magnifying glass to see them with my vision. Octogirl",
      "MessageIndex": 13,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/840725",
      "Title": "Permanent tattoo markings for radiation LM070917 LM070917"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Oct 14, 2018 08:16AM octogirl wrote: I agree that you can try and see how it goes. I was one of those without huge issues (I did have some, but nothing I couldn't handle.), and I worked full time during chemo. That said, you don't need to feel alone without a support system. The best support I got was from these boards. I encourage you to join a thread of women going through chemo in the same time frame as you...or even start one yourself! All the best, and keep us posted. Gentle hugs! Octogirl",
      "MessageIndex": 5,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Sep 21, 2017 10:24PM octogirl wrote: I was 61 at diagnosis, post menopausal. My hair was thick and wavy, and no thinning at all...also no gray. After taxotere it took what seemed like forever to come back (almost five months before I had enough that I felt comfortable going hatless); it took so long that I was certain it wasn't coming back. Now, two years later it is slightly thinner than before, but still thicker than many if not most women my age...and quite curly rather than just wavy. just a few strands of grey, otherwise basically same dark brown as before tx. It looks and feels soft and healthy. Objectively, I have come to realize that it actually is probably the most flattering hair I've ever had (I get a lot of compliments) but it has taken me a long time to come to terms with the fact that it is different. Now that I am finally happy about it, I am starting to see some indications that the curls may be loosening and going back to my former waves....",
      "MessageIndex": 12,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858813",
      "Title": "Questions for those who completed taxotere treatment. JadeShiva SueRobbo"
    },
    {
      "AuthorID": "octogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217299/profile",
      "Content": "Jan 12, 2016 11:18PM octogirl wrote: Here is some recent research: http://www.breastcancer.org/research-news/research... Personally, while I had moments of forgetfulness, I found tiredness, anxiety and sadness/depression to be much bigger factors in not feeling like myself than the typical 'chemo brain' complaints. I did work all through chemo, only missed about four days of work, in an intellectually challenging job. Some of my most productive days were the three or four days after each treatment, thanks of the steroids... But speaking of steroids, my doc tells me that the steroids are actually what causes most post-chemo vision problems, such as cataracts, rather than the chemo itself. Chemo can provide temporary vision issues (blurriness etc) that resolves after chemo. I did and still do use artificial tears frequently, which helps. Good luck in your decision; Octogirl",
      "MessageIndex": 12,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/839890",
      "Title": "How bad is chemo brain and does it last? Eye problems? sos1125 momand2kids"
    }
  ]
}