{
  "AuthorID": "Odette130672",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269363/profile",
  "Posts": [{
    "AuthorID": "Odette130672",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269363/profile",
    "Content": "Odette130672 wrote: Dear Metastatic Breast Cancer Members, The most important decision of my life needs to be made within the next week and I seek your thoughts and honest opinions please. Just before my 37th birthday 8 years ago I was diagnosed with invasive lobular cancer to my right breast. Unfortunately from misdiagnosis over a 6 month period by the time I was properly diagnosed I had a 5 centimetre in diameter breast tumour with 5 smaller tumours in the right breast that had also spread to my lymph nodes. Based on this misdiagnosis I was informed that I had a high chance of reoccurrence and so two and a half years ago my cancer did unfortunately return. Fast forward to today, after 12 cancer related surgeries and numerous treatments I find myself in a position where I need to make the most important decision of my life and I need your honest raw opinions please. My breast cancer is in my bones, gallbladder (which had to be removed) liver and is now metastasising in my skin very quickly. At today's count I have 28 small breast cancer lumps that are on my body. A new one is coming up each day. I have been informed by my oncologist today that there is one remaining treatment available to me, which is again going through IV chemo therapy through a port in my chest. Upon questioning my beautiful oncologist at lendemanding the most honest answers he can provide I established the following: With or without treatment it is highly likely that I will only have 12 months left. There is no evidence to guide or compare that if I have IV chemo therapy that it will give me more time. My husband who I have been with for 28 years has left me and in order for me to enjoy life to the full I must sell our home within the next 3 months. There are a lot of things I still want to tick off the bucket list and I want to have quality of life for the rest of my time. I want to experience another man, I want to dance until the sun comes up, I want to look and feel sexy and not feel and look like a sick cancer patient. I want to live like I'm dying tomorrow. A decision needs to be made, so I ask my cancer friends, WHAT WOULD YOU DO? Surgery 5/10/2009 Lymph node removal: Sentinel; Mastectomy: Right; Reconstruction (right): Free TRAM flap Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "21/02/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/862687",
    "Title": "To HAVE treatment or NOT Odette130672 Cloudygarden"
  }]
}