{
  "AuthorID": "Odie7suzie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273485/profile",
  "Posts": [{
    "AuthorID": "Odie7suzie",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273485/profile",
    "Content": "Odie7suzie wrote: Hi. I am almost 32 weeks pregnant.  I had redness, swelling and pain in my left breast that left a hard area of my breast that decreased to a lump.  Went to OB who sent me for u/s of left breast.  They ended up aspirating the complex cyst and I got more redness, swelling and pain after this procedure.  This has all resolved.  Been to breast surgeon-no cyst is seen on U/S at this time.  Cultures were negative. Cytology not done (not sure why not) I don't understand what the area of increased echogenity means? Thanks in advance.  Targeted ultrasound of the palpable finding 11:00 position 11 cm from the nipple demonstrates an area of increased echogenicity measuring approximately 2 cm. There is an irregular tubular hypoechoic area within this region measuring 11 mm in greatest dimension. There is no blood flow within the hypoechoic area. The appearance suggests the possibility of fluid. Ultrasound of the left axilla was also completed and demonstrates prominent lymph nodes. Overall findings with clinical history suggest the possibility of infection. Ultrasound-guided aspiration was recommended. Permission to proceed with aspiration is included on the patient's prescription. The patient elected same-day ultrasound-guided aspiration. Following the discussion of risks, benefits, and alternatives to the procedure informed consent was obtained. Final verification was performed. Using aseptic technique, 5 cc 1% lidocaine for local anesthesia, an 18-gauge needle less than 1 cc of hemorrhagic fluid was aspirated. Additional fluid could not be aspirated and there was residual hypoechoic area following aspiration. Fluid was sent for aerobic and anaerobic culture. Surgical consultation and clinical evaluation is recommended. The patient was referred to the breast care center. Follow-up ultrasound in 2 weeks is recommended. If the palpable finding persists at that time mammogram would also be recommended. IMPRESSION: Complex mass in the region of clinical concern with prominent left axillary lymph nodes; given clinical history possible infection is considered. Fluid sent for aerobic and anaerobic culture. Surgical consultation and clinical evaluation is recommended. Follow-up ultrasound in 2 weeks is recommended. If there is a persistent mass at that time mammogram and biopsy would be recommended. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "04/05/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864386",
    "Title": "My Ultrasound Report Odie7suzie Georgia1"
  }]
}