{
  "AuthorID": "ODPmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274206/profile",
  "Posts": [
    {
      "AuthorID": "ODPmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274206/profile",
      "Content": "ODPmom wrote: Hello. Diagnosed last week with DCIS and supposedly small IDC. Hormone + waiting on fish results. I’ve been followed closely for the last 10 years by dr Rosenbaum-smith in NYC (mt Sinai). The last few years I switched to screenings locally at a Breast center (Monmouth medical) Nj. After receiving initial labs immediately saw a local dr (kohli)who was actually trained by my NYC dr! She is fellowshiped trained, numerous accolades and certified in skin nipple sparing and hidden scar. Nothing but good reviews but only has only 5 years in practice. My ny doc obviously has 20 years More experience. However she and her ps shy away from direct to implant and are not advocates for pectoral nerve block. Any advice on how to choose? Should I get a 3rd opinion from MSK or Cornell? Thank you for any input. Trying not to decide on convenience alone. I have 3 small children and I need to get to the other side of this quickly hopefully! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864874",
      "Title": "Choosing surgeon ODPmom ODPmom"
    },
    {
      "AuthorID": "ODPmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274206/profile",
      "Content": "May 29, 2018 01:35PM ODPmom wrote: Hi! Yes please send me your recs - thank you! I was kind of waiting to see if I needed any further treatments after surgery as right now still looks possible I may not. I used to work for a hospital in the city and have heard mix reviews on MSK for surgery.... crazy that some people love it and others so unhappy. Although not ruling out getting an opinion. I’m definitely sending my pathology after surgery for them to review and would absolutely consider having adjuvant treatments at their satellites. Thanks again",
      "MessageIndex": 12,
      "PostDate": "29/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864874",
      "Title": "Choosing surgeon ODPmom ODPmom"
    },
    {
      "AuthorID": "ODPmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274206/profile",
      "Content": "May 28, 2018 10:18AM ODPmom wrote: Thank you! My NY doc definitely has more experience so that’s where I’m having trouble deciding.....",
      "MessageIndex": 3,
      "PostDate": "28/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864874",
      "Title": "Choosing surgeon ODPmom ODPmom"
    },
    {
      "AuthorID": "ODPmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274206/profile",
      "Content": "May 30, 2018 09:25PM ODPmom wrote: Thanks everyone! This is all so overwhelming and I’m so afraid to make a wrong decision. In the end I think I have to accept I’ve done my due dilligence and as all the candidates are exceptional surgeons have to go with my gut and pray for the best. Right now my preference is for a prepectoral direct to implant. I’m really athletic and cutting into my pec muscle does not sound ideal. Although I realize things found out during surgery may throw that plan out the window. I guess my only concern with prepectoral placement is future monitoring but ps says there is no imcreased risk. My BS say that I’ll have to fall into a very specific category for her to agree to pre vs post pectoral. All at once I’m feeling I just want this surgery over and also scared of what I will wake up to ...",
      "MessageIndex": 17,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864874",
      "Title": "Choosing surgeon ODPmom ODPmom"
    }
  ]
}