{
  "AuthorID": "ohiomama1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120826/profile",
  "Posts": [
    {
      "AuthorID": "ohiomama1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120826/profile",
      "Content": "Feb 16, 2011 06:49AM ohiomama1 wrote: Update:  Oral antibiotics did nothing for my staph infection.  I have been on IV vancomycin for 8 days now with 6 more to go. I have good days and then bad.  Got a picc line inserted Monday which feels so much better.  Does anyone know how long it takes to feel better after a staph infection? I'm so sick of this. This morning woke up with low grade fever again.  Seems this thing just keeps rearing it's ugly head. Anyone else been through something similar?",
      "MessageIndex": 7,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764281",
      "Title": "Should I be concerned? ohiomama1 ohiomama1"
    },
    {
      "AuthorID": "ohiomama1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120826/profile",
      "Content": "ohiomama1 wrote: I am a 39 year old mother of two teenagers.  10 days ago I came down with what I thought was the flu.  Stayed home for two days with fever, nausea and body aches. A few days later I woke up with a golf ball sized mass in my right breast with heat and redness.  I called my ob/gyn and they were wonderful enough to get me in to see the nurse practictioner on a Friday afternoon.  She sent me directly downstairs for a momogram which lead to an ultra sound, which lead to biopsy and asperation of the site.  I was given an anitibiotic and sent home with a diagnosis of mastitis. Over the weekend I have now started having an achiness in my right arm pit.  The dr office called today and said the biopsy showed a staph infection and started a different antibiotic. Now I'm worried.  Why and what causes this?  I worry about IBC.  I have a very high family history of cancer period. Should I be ok with this diagnosis? The np wants to see me back on Friday and I thought I would talk to her about it but was wondering in the meantime what your thoughts are.  I should add that I had a breast reduction in July 2005 and have had absolutely no complications.  I also have never breastfed.  Just worried :) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764281",
      "Title": "Should I be concerned? ohiomama1 ohiomama1"
    },
    {
      "AuthorID": "ohiomama1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120826/profile",
      "Content": "Feb 1, 2011 07:26PM ohiomama1 wrote: Thanks lago.  I appreciate the imput.  I'm sure it's the proper diagnosis, just enough to make me worry.  I just don't understand the breastfeeding thing.  I have never breastfed and even if I had, my kids are 18 and 16.  Glad I have a great dr!",
      "MessageIndex": 2,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764281",
      "Title": "Should I be concerned? ohiomama1 ohiomama1"
    },
    {
      "AuthorID": "ohiomama1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120826/profile",
      "Content": "Feb 2, 2011 06:04AM ohiomama1 wrote: Shellyj43, I do not belong to a gym and kids aren't playing any sport this winter. I do work in a school though so who knows.  Thanks so much to everyone for all of your support.  What a fabulous place to come with your worries.  Praying that this anitibiotic kicks in very quickly.  Have a great day everyone!",
      "MessageIndex": 5,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764281",
      "Title": "Should I be concerned? ohiomama1 ohiomama1"
    },
    {
      "AuthorID": "ohiomama1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120826/profile",
      "Content": "Feb 16, 2011 01:38PM ohiomama1 wrote: Thanks so much for posting Patty. Hate the fact that you are going through something like this too but so glad I am not alone.  This has been so frustrating going from an active, healthy woman to feeling like someone knocked my feet out from under me. I have no energy at all.  I will be sending lots of prayers for you for Tuesday. I hope you get great news! God Bless and keep us updated :)",
      "MessageIndex": 9,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764281",
      "Title": "Should I be concerned? ohiomama1 ohiomama1"
    }
  ]
}