{
  "AuthorID": "okbecca",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
  "Posts": [
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Apr 3, 2016 07:12AM okbecca wrote: Nothing about my initial biopsy stayed the same. I had a lot more cancer, of a more advanced type, than the biopsy had shown.",
      "MessageIndex": 3,
      "PostDate": "03/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/842735",
      "Title": "Was anyone's tumor grade different after final pathology? Betsy918 kcat2013"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Feb 15, 2016 09:13PM - edited Feb 15, 2016 10:53PM by okbecca Muska, I'm not having second thoughts about the decision I've made. But that doesn't make it an easy decision. Breast cancer is a wonderful world of tough choices. I'm just wondering if there's anything I can do now to make it easier for myself later. I find these replies very uplifting and helpful, btw.",
      "MessageIndex": 5,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841286",
      "Title": "Double Mastectomy Grief and Emotions: What Can I Expect? okbecca barbe1958"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "okbecca wrote: What does it do to you emotionally to lost both your breasts? I'm facing this and to prepare myself for what's coming at me. Dx 12/16/2015, DCIS, Right, Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841286",
      "Title": "Double Mastectomy Grief and Emotions: What Can I Expect? okbecca barbe1958"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Feb 16, 2016 06:04AM okbecca wrote: I like the idea of a good-bye ceremony, even making a bust that I throw out later. I think it's important to mark passages, and this is certainly a passage. I just can't quite get a handle on what it's a passage to.",
      "MessageIndex": 8,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841286",
      "Title": "Double Mastectomy Grief and Emotions: What Can I Expect? okbecca barbe1958"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Feb 11, 2016 08:18AM okbecca wrote: I had a surgical biopsy with wire in 1992. It was a horrible experience. A roomful of men doctors, used numbing agent on my skin but nothing else, then, when I said it hurt, told me they'd never had any other patient say that. I had to go to the waiting room, wait for my files, then go down to the parking lot, get my car and drive to the hospital (with wire in breast) and wait in another waiting room. Then, when they were taking me into surgery, a woman came at me and demanded I give the hospital another $500.00 (my co-pay, I guess). I mean, I was going into surgery right then. Terrible experience all around, except it was benign. Fast forward to last November. Same hospital, biopsy in the same location, different doc, this time, a woman. She numbed my breast entirely and was actually nice to me. I still had to drive to the other hospital (who designed this process????) with a wire in my breast, but the rest was done with kindness and efficiency; no one hammering me about $ as I was going into surgery. Much better experience all around, except this time it was cancer. (Bummer. Major bummer. :-) ) There is no reason for this process to be so barbaric. None. I just fired a whole group of docs for treating me like a cancer instead of a person. I am sooooo glad I did.",
      "MessageIndex": 11,
      "PostDate": "11/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841038",
      "Title": "Important things to ask your doctor Seagod Sunnyone22"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Mar 4, 2016 08:06PM okbecca wrote: Thanks for the ideas. I decided to toss them. If I want a bra later, I'll buy something without memories.",
      "MessageIndex": 8,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841846",
      "Title": "Bras After BMX, no Recon okbecca TB90"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Mar 5, 2016 08:55AM okbecca wrote: I would love to know the name of that line of clothing. I've searched for post mastectomy designs for going flat, and finally decided that I'm going to start making my own clothes again, like I did in high school.",
      "MessageIndex": 10,
      "PostDate": "05/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841846",
      "Title": "Bras After BMX, no Recon okbecca TB90"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "okbecca wrote: Is there any reason why I would need my bras after my BMX next week? I'm not having reconstruction. If not, I think I'll throw them away now, so that I won't have to look at/deal with them later. Dx 12/16/2015, DCIS, Right, Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841846",
      "Title": "Bras After BMX, no Recon okbecca TB90"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Mar 12, 2016 05:45AM okbecca wrote: McKaylaleigh, I was told to strip my drains twice each day and record how much fluid they produced each time. The doc gave me a chart to write this down. She also arranged for a home health nurse to come by, check my vitals and strip the drains each morning. I have a girlfriend who comes over and helps me with then in the pm. I am going to have a physical therapist when I heal to that point. Here's how they have me do the drains: 1. My drains are on a belt that I was wearing when I woke from surgery. I slide the bulbs off the belt and put them, in one-two-three-four order on the dressing table in my bathroom. 2. Put on disposable gloves. Pick up drain #1. grip it as tightly as you can between your thumb and forefinger where it comes out from your body. 3. Then take an alcohol strip and use it to grip the drain with the thumb and forefinger of your other hand. 4. Slide your fingers down the drain a few inches, gripping it so that you flatten the drain and push all the fluid down the tube. 5. Move your back hand forward until it's next to the hand with the alcohol swab and then 6. slide the hand with the alcohol swab down a few inches. Repeat this until you get to the bulb. 7. If there is still fluid in the tube, repeat the process as many times as you need in order to get all the fluid into the tube. 8. open the top of the bulb and empty the contents into the measuring cup. 9. Record how much fluid the drain produced. 10. Squeeze the bulb flat to create a vacuum and seal it shut again. 11. Put the drains back on the belt and adjust for comfort. As for restrictions, i was told not to lift anything (I've probably lifted more than I should,) or to use my arms. I was told that I needed to walk around the house every hour or so, but only for a short distance. I am not supposed to drive, play the piano or do much else until I see the doc next week. I am supposed to keep a pressure bandage on during the first week. I've been encouraged to keep myself pain free by setting an alarm and waking myself to take pain meds during the night and to not miss a dose of pain pills or try to take less than prescribed. Also, to take stool softeners and eat high fiber foods. My doc and the nurses have all told me repeatedly to rest and get well and not do anything for a few weeks. Not only have the home health nurses been visiting me every day, but the nurses at the hospital and the doc's office have called to check on me each day. Hope this helps.",
      "MessageIndex": 6,
      "PostDate": "12/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/842041",
      "Title": "Post BMX Questions Mckaylaleigh Mckaylaleigh"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Mar 3, 2016 07:47AM okbecca wrote: My surgeon is referring me for PT after my mastectomy next week. I also have talked to the people at a local women's gym. They said they've done this for a lot of people.",
      "MessageIndex": 8,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841814",
      "Title": "Physical Therapy after BMX Mckaylaleigh katykids"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Mar 17, 2016 11:27PM okbecca wrote: THANK YOU for bringing this topic. I'm 10 days post bmx, and the exhaustion is unlike anything I've ever felt before. It helps a lot to know that this is part of the ride.",
      "MessageIndex": 9,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/839802",
      "Title": "Is fatigue normal Kiks1 JCS28"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "okbecca wrote: Next Monday, my bmx will take me from a D to a double divot in four hours. I've decided to try my hand at making clothes for myself. I've been looking at patterns, but I'm a bit flummoxed. How does the loss of the girls affect sizing? I mean, everything else is staying the same but there's going to be a six-inch drop in my bust measurement. What does bmx do to your blouse/dress size? Dx 12/16/2015, DCIS, Right, Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/841929",
      "Title": "Going from D to a Double Divot. What Size Will I be? okbecca cupcaker"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Apr 8, 2016 05:22PM okbecca wrote: I used a home-made muslin for fitting back when I sewed before. I could do a bodice sloper -- with measuring help from a girlfriend -- or I might try making a personal dress form using this technique. https://youtu.be/cok5VtSurEk. Of course, that would require a girlfriend(s) too. Too bad I'm cutting waaayyyy back on wine due to cancer. This has the makings of a hilarious evening. Any other ideas? I'm thinking I need to steer clear of certain knits and opt more for woven fabrics. What do you think of my under-structure idea with lining and interfacing? I'd rather build the form into the garment, if possible.",
      "MessageIndex": 3,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/842948",
      "Title": "Going Back to Sewing okbecca Bearhitch"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "okbecca wrote: Once upon a long time ago, I made all my own clothes. That was high school/college days. I haven't even owned a sewing machine in 40 years. Until now. I've decided to start making my own clothes so that I can alter them to be more flattering for my new flat look. At 80 pounds overweight (I'm working on that, was 100 pounds overweight 16 weeks ago.) I'm flat on top, fluffy down below. That's not exactly an off-the-rack girl. Add to that the concavity and tire-track scars, and my clothes will need a bit of fixing to look right. I already know that I'm going to line the chest areas and add interfacing as well. Fabrics in the clothes I have now (a lot of knits) tend to drape over the scars, revealing that sexy tire-track for all the world to see. I think lining and interfacing should stop that. Does anyone else sew? If you do, what adjustments do you make in patterns to flatter your flatness? Dx 12/16/2015, DCIS, Right, Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/842948",
      "Title": "Going Back to Sewing okbecca Bearhitch"
    },
    {
      "AuthorID": "okbecca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226469/profile",
      "Content": "Apr 9, 2016 12:13PM - edited Apr 9, 2016 12:15PM by okbecca cb123, your pinterest page was great! I bookmarked a couple of the \"how to\" pages. floaton, I'm thinking of using a muslin lining, from the shoulder to just down to below the scars, and interfacing that on the side that would fall away from my chest. I wouldn't interface the fabric of the top itself unless it was needed as part of the design. I'm also thinking of adding slim shoulder pads in tops with set-in sleeves, to lift the fabric away from my chest. If I use woven fabric, do you think this would be enough to keep the scars hidden? I could also use graduated layers of muslin instead of interfacing, with all the layers hitting together at the area where the breasts used to be. I agree about prints, especially smallish geometric prints, confusing the eye and disguising things. What about the horizontal seaming of many designs today? Do you think that would do some of the same effect, or would it emphasize things? Should I avoid deep necklines? I'm thinking of the comments on the blog linked to in cb123's pinterest that deep necklines reveal way too much when you bend over. I'm not doing a big all-at-once closet thing. When I try something on for the first time after the bmx, I study it in the mirror and even take photos of it with my phone. Then, if I don't like what I see, I toss it. So far, all my knit tops, including those with turtle necks, have ended up in the trash. I threw away all my bras the weekend before my bmx. Decided I'd rather start new after. Even the keepers -- so far, just traditional, button-down shirts and tunics -- need altering to fit properly. I'm not going to bother. I'll just wear them until I get the right tops to replace, and then toss them, too. It's a new day and I'm not looking back.",
      "MessageIndex": 6,
      "PostDate": "09/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/842948",
      "Title": "Going Back to Sewing okbecca Bearhitch"
    }
  ]
}