{
  "AuthorID": "Okiemomof4",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
  "Posts": [
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Mar 10, 2014 05:34PM - edited Mar 10, 2014 05:35PM by Okiemomof4 Jesskap, I am so sorry that you are going through this. I promise you will feel better after your appointment tomorrow because you will be given answers and a plan. I will be thinking and praying for you tomorrow.  Hugs!",
      "MessageIndex": 5,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818976",
      "Title": "What does it mean. Jess1146 juneping"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Mar 12, 2014 02:16PM Okiemomof4 wrote: So sorry, Jesskap, You should check out the IBC forum. Those ladies will be able to answer your questions. Keep us informed, too. We care! ",
      "MessageIndex": 10,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818976",
      "Title": "What does it mean. Jess1146 juneping"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Jan 27, 2015 07:16AM Okiemomof4 wrote: CKC, just curious how you were? Hope you have gotten your biopsies and scans done.",
      "MessageIndex": 36,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827210",
      "Title": "Just diagnosed and am very worried that it has already spread CKC1969 Okiemomof4"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Mar 1, 2014 04:26PM Okiemomof4 wrote: Bella, So glad you liked together surgeon! I certainly understand your feelings about the mastectomy. Before BC, I always said with much bravado that if I ever got BC, I would get those babies taken off and get some new, perky ones. Stupid! Stupid! Stupid! When I got my diagnosis, my surgeon told me that I could have a mastectomy, but I was an excellent candidate for lumpectomy. She would do want I whatever I wanted, but it had to be my decision. I really wanted her to tell me what to do, but she wouldn't. The more I thought about mastectomy, the more anxious I got. When I decided for the lumpectomy, I felt peace about it. You and DH will come to the best decision for you. I will be praying for you as you go through these next procedures and make your decisions. Hugs!",
      "MessageIndex": 28,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818459",
      "Title": "1st Meltdown BellasKids AZ85048"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Mar 18, 2014 12:47PM Okiemomof4 wrote: You can do it, Terri 001. I will be praying that you'll find relief from your port site tonight, and I will especially be praying for you tomorrow. As we say here, \"We'll all be in your pocket.\" Take care.",
      "MessageIndex": 6,
      "PostDate": "18/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819047",
      "Title": "Whirlwind... Terri001 Rmanmom"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Sep 2, 2012 06:27PM - edited Sep 2, 2012 06:27PM by Okiemomof4 So sorry to hear your news. I was diagnosed in April, and I, too, did not want to be a member of this group. But this site is wonderful, and the forums are helpful. The people on here are kind and caring. My advice to you would be to take it one day at a time. Sounds cliche but it is true. Stay off the Internet! This is the only site I would allow myself to be on because the others scared me. Don't panic until you talk to your team of doctors. They will help get you through this. And be good to yourself. Hugs and prayers.",
      "MessageIndex": 74,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Feb 25, 2014 02:29AM Okiemomof4 wrote: Bella, From one Oklahoma girl to another, I will be praying all goes well on Wednesday. You can do this!",
      "MessageIndex": 4,
      "PostDate": "25/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818459",
      "Title": "1st Meltdown BellasKids AZ85048"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Feb 26, 2014 03:51PM Okiemomof4 wrote: Bella, I go to Mercy, also. Dr. Keefer is my oncologist there. Dr. Morrison is my rad onc. I would highly recommend that you request your BS to refer you to Dr. Keefer or Dr. Reitz. I have heard good things about him, also. The reason I say that is when I was diagnosed, I had no idea who to use as my oncologist. Dr. Talbert, my BS( used to be Dr. Boggs's partner but Farmerlucy just told me yesterday that she is now at OU Medical. I had no idea.) referred me to Mercy Oncology. I was referred to a doctor who graduated from OU medical in the 1950's. That's way before I was born. After meeting with him once, I knew there was no way I could continue with him. I liked his nurse a lot, but I couldn't relate to him at all. He didn't talk to me. He would just say what he thought and his nurse would then explain everything to me. Plus, he wanted me to do chemo because my tumor was over 1 centimeter, without doing an on oncotype test first. I had to ask for it, even though I was the poster child for it: early stage, node negative. I called Dr. Talbert and asked her to refer me to Dr.  Keefer for a second opinion. He told me that an oncotype test would have been his first step. I kind of think that when you don't have an oncologist in mind, then Mercy gives you this doctor because I doubt his patient load is heavy. I'll PM you his name if you want. Thinking of you today. I get all of my imaging done at the Mercy women's clinic, too. I have had diagnostic mammograms, ultrasounds, and a MRI there. You are in good hands.",
      "MessageIndex": 10,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818459",
      "Title": "1st Meltdown BellasKids AZ85048"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Feb 26, 2014 06:28PM - edited Feb 26, 2014 06:43PM by Okiemomof4 Hi Bellaskids, Just sent you the PM(private message). Should show up on your toolbar at the top as a notification. Kind of like facebook.  Glad you made it through the MR!. Guess those potty seat practice sessions did the trick. lol. I don't think you will be a candidate for the oncotype test because you have lymph node involvement, unfortunately. The oncotype is a test that looks at the profile of your tumor and the genes in it to see if it is likely to recurr and it can show how effective chemotherapy will be as a means of treatment.",
      "MessageIndex": 14,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818459",
      "Title": "1st Meltdown BellasKids AZ85048"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Feb 12, 2014 09:49AM Okiemomof4 wrote: Gina2014, Sorry about your dx but you are in the right place. This is the only forum I allowed myself to go on after my diagnosis. Stay away from Dr. Google. He will just scare you. Knowledge is power. Once you meet your team of doctors(surgeon, MO, RO) and get a plan in place to fight, you will feel better! Hang in there! Prayers and hugs!",
      "MessageIndex": 18,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/817775",
      "Title": "Waiting and scared... pagemans Nettie1964"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Feb 28, 2014 05:53PM Okiemomof4 wrote: Me, too, Bella!",
      "MessageIndex": 21,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818459",
      "Title": "1st Meltdown BellasKids AZ85048"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Feb 27, 2014 06:50PM - edited Feb 27, 2014 06:54PM by Okiemomof4 Hi Swoosieque, Good to find another Oklahoma gal.  Thanks for giving Bella more info.  When I was first diagnosed, my gyno here in Stillwater recommended Dr. Talbert and Mercy to me. I didn't know much, but I did know I did not want to be treated locally. She recommended Mercy to me because of their whole team approach, which I really like. But I had no idea who to use as an oncologist, and I think I got the one I got because I didn't have a preference if you know what I mean... I am really sad about Dr. Talbert. Do you know if she still seeing patients at all? I told her when she discharged me from her care that I hoped I would never have to see her again..lol. But, heaven forbid that I do, I would really like to use her again. She did a fantastic job on my surgery!",
      "MessageIndex": 19,
      "PostDate": "27/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818459",
      "Title": "1st Meltdown BellasKids AZ85048"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Apr 3, 2015 03:47PM Okiemomof4 wrote: Hi, Try not to worry although I know it is easier said than done. I was in your shoes almost 3 years ago. I was called back for a diagnostic mammogram and ultrasound. While the radiologist didn't come out and say what he was seeing was cancer, he did tell me, \"If you were someone I loved, I would want that biopsied.\" I had my biopsy the Thursday before Easter that year and got the call that it was indeed cancer the day after Easter.  I think radiologists can tell with a great deal of certainity if a lump is highly suspicious to be malignant, but a biopsy is the only way to be 100% sure. My lump was very small and subtle so I will be forever grateful to the eagle eyes of my radiologist. Hang in there! Let us know when your biopsy will be. We will be in your pocket.",
      "MessageIndex": 6,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830129",
      "Title": "Can a malignant mass could be determined by ultra sound? Misst34 Misst34"
    },
    {
      "AuthorID": "Okiemomof4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152984/profile",
      "Content": "Mar 4, 2014 01:23PM Okiemomof4 wrote: Woot! That is awesome news! Be kind to yourself and go out and celebrate.",
      "MessageIndex": 45,
      "PostDate": "04/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817419",
      "Title": "scared silly teaspoon teaspoon"
    }
  ]
}