{
  "AuthorID": "onesickboob…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86704/profile",
  "Posts": [
    {
      "AuthorID": "onesickboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86704/profile",
      "Content": "Jul 24, 2009 02:28AM onesickboob wrote: Hi Everyone!  I have not posted, but have reading all of your encouraging stories.  My first treatment was 6/12 and I just had my 3rd yesterday.  I am on a clinical trial and have 4x taxotere every 3 weeks and then 4x A/C every 3 weeks.  I am also on Avastin for the trial.  I also get Nuelasta every treatment, so I get to look forward to that this morning!  After chemo, I'll have surgery and then rads and more Avastin (every 3 weeks, 10x...30 more weeks!), so I feel like I am still at the very beginning of this journey.  Anyone else familiar with this trial?  It is aggressive, but I am triple negative and have a very aggressive tumor.  My oncologist measured and says it is definitely shrinking, 2cm already and she can no longer feel the swollen lymph nodes. Congrats to those of you who have the end in sight!  Awake at 4:15 this morning!  I should be able to have a relatively normal day today; usually I am down for the count on Saturday for a Thursday treatment.  I have been planning about a week's recovery time for each.  It seems excessive and it isn't that I'm not functional; just need more rest and help with my 19 month old.  I am hoping to shorten that time this round as my Nuelasta is the day after treatment.  Good luck to you all and thank you for sharing your stories!",
      "MessageIndex": 709,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734424",
      "Title": "Starting Chemo June 2009 zuzeee zuzeee"
    },
    {
      "AuthorID": "onesickboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86704/profile",
      "Content": "Sep 18, 2009 08:24AM onesickboob wrote: Hi Everyone!  I don't post much, but read often.  I am almost 2/3 of the way finished with chemo.  Had 4 taxotere first and have had 1 A/C so far.  I was terrified about the A/C and it ended up not being as bad as I had feared.  I just felt nauseated and tired.....I get worn out really easily now.  I am not sure if it wasn't that bad or I have just lowered my expectations about what it feels like to feel good!  But I also had Nuelasta after each of my taxotere treatments, so I had a lot of pain along with everything else.  My oncologist said that I got a heavy dose of taxotere, but she told me that after I was finished with my taxotere treatments.  I am losing my mind as well.  I can't keep track of simple things like what day it is....forget stuff all the time.  I have started keeping lists, but I have a bad habit of writing things down on the nearest available piece of paper, so my reminders are all over the place.  I should be finished (if all goes well) with chemo on November 5th.  Sorry to hear about your new SEs, Deborah.  I have a script for the Marinol, too.  It seems to help with the nausea, but I won't take it in the evenings because every time I have, I've had CRAZY dreams!  I got laid off months before my diagnoses, so have been a stay at home mom to my 21 month old for almost a year now.  I have 2 sisters and one or the other has been here to visit after every treatment to help with my daughter.  My mother in law is about 45 minutes away and has been a great help too.  Some days I feel like I am doing the minimum as far as mothering goes...watching tv and eating instant oatmeal or microwave mac & cheese, but I'm so happy to be home with my baby.  She is the goods!  Thanks to all of you for sharing.  It helps tons to know that there are other women out there who are (unfortunately) going through the same thing! ",
      "MessageIndex": 1064,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734424",
      "Title": "Starting Chemo June 2009 zuzeee zuzeee"
    },
    {
      "AuthorID": "onesickboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86704/profile",
      "Content": "Oct 6, 2009 01:09PM onesickboob wrote: I had a consultation with my plastic surgeon regarding reconstruction after my surgery (planned for Dec).  I have to have radiation as well and he suggested putting in the TEs during my surgery.  He assured me that you can keep them in indefinitely and said that with radiation, it is a good idea to leave them in longer so that your skin can heal and soften up for the implants.  I am on a clinical trial and will have 10 treatments of Avastin (every 3 weeks...30 weeks total) starting concurrently with radiation.  I can't have surgery while on Avastin and my PS didn't seem concerned about having the TEs for that period of time.  Other than the consultation, I haven't given much thought to my surgery/reconstruction, so I probably haven't asked all the questions that I need to ask.  I am just trying to get through chemo!  I hope that helps and makes sense! Katherine",
      "MessageIndex": 1152,
      "PostDate": "06/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734424",
      "Title": "Starting Chemo June 2009 zuzeee zuzeee"
    },
    {
      "AuthorID": "onesickboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86704/profile",
      "Content": "Jan 25, 2010 03:31PM onesickboob wrote: Thank you for sharing this information!  I am on the trial and was supposed to start back on Avastin today.  Luckily, there was an unexpected delay which has bought me some time to think about it.  This article is at the forefront of my mind because I am still healing from my bmx and have had a setback the last few days with a possible pulled muscle.  I am really worried about getting back on the Avastin and exacerbating \"minor\" issues and/or possibly counting myself out of reconstruction or limiting my options.  I have until Wednesday (also the day I start radiation) to decide and have discussed with my oncologist and my trial nurse, but I'm still on the fence because there is a chance that this would not cause any problems and can possibly keep the cancer at bay. ",
      "MessageIndex": 6,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746957",
      "Title": "Abraxane/Avastin Side Effects jneumann pee"
    },
    {
      "AuthorID": "onesickboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86704/profile",
      "Content": "Dec 3, 2009 10:14AM onesickboob wrote: Thank you all for sharing.  I am scheduled for a bilateral mast. on December 14th, so I am anxious to hear about the surgery and recovery.  It is certainly nice to have the holiday distractions leading up to surgery day.  My daughter's 2nd birthday is the day before my surgery and I am nervous about the recovery even though I'll have lots of help.  I am trying to keep things in perspective and remind myself that each stage of my cancer \"journey\" so far has been really scary, but that the anticipation is usually worse than the reality.   ",
      "MessageIndex": 20,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743855",
      "Title": "having bilateral mx December 4th klml4 Issymom"
    },
    {
      "AuthorID": "onesickboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86704/profile",
      "Content": "Dec 17, 2009 02:56PM onesickboob wrote: Hi everyone!  I had my bilateral mastectomy on Monday the 14th and left the hospital the next day.  I would have stayed, but they wouldn't take my IV out as long as I was there and I was done with the fluids.  I am still puffy.  I have 4 drains and a \"pain ball\" in a fanny pack that feeds Novocaine or something to my incisions.  I have a question about the drains...when you strip the line, are you able to get all the fluid out?  I have not been able to yet.  I think I made my husband nervous because the first time he did it, it pulled a little on my chest, so now we have been extra careful.   I got a prescription for a Softee, but forgot to go and get one before surgery.  I did get a tank top from Old Navy and it works really well.  It is mostly cotton and soft and stretchy enough that I can get it on and off with help.  My husband went back and bought more in other colors because I like it so much!  The top is high, so no non-existent cleavage shows and the straps are thin.  It is called the Perfect Tank and they are on sale for $5 right now.   It feels good to be on the other side of surgery!  I had a tough time before surgery worrying about what it would feel like/look like, etc.  The anticipation was horrible, but I have been comfortable at home.  My husband is taking good care of me.  Our daughter is with his parents and we miss her lots, but I feel like it would be harder for her to be here and not be able to touch/snuggle than to be with her grandparents where I know she is having fun. Thanks for sharing your stories.  It has helped me to know what to expect from people who have actually been through it.  Hope you are all healing well!",
      "MessageIndex": 42,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743855",
      "Title": "having bilateral mx December 4th klml4 Issymom"
    },
    {
      "AuthorID": "onesickboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86704/profile",
      "Content": "Dec 18, 2009 01:41PM onesickboob wrote: Thank you, Kim! I had a follow-up appointment with my PS this morning and he removed the pain pump, stripped my drains and gave me a fill.  I would say that I am usually a good patient, but I nearly passed out.  It was embarrassing!  I waited too long to take medicine before my appointment, so it hadn't had a chance to kick in while I was there.  I will definitely make sure I do it right next time.  He didn't clear me for a shower yet, but I am going to see him again on Wednesday for another fill and he will take a few drains out then if he thinks it's the right time.  I have been keeping track of the output.  Thanks for the tip on the ribbon/string.  I will try that when I get the go-ahead for a shower.  Hope you all are doing well!",
      "MessageIndex": 44,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743855",
      "Title": "having bilateral mx December 4th klml4 Issymom"
    }
  ]
}