{
  "AuthorID": "openorclosed",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230971/profile",
  "Posts": [
    {
      "AuthorID": "openorclosed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230971/profile",
      "Content": "openorclosed wrote: Hello everyone. I found this forum community around the time my wife was diagnosed but until today I didn't really look around and see everything it has to offer... wow, what an amazing resource! I can't believe I haven't been starting here with all of my questions. Well, better late than never... My wife has been very happy with her caregivers but now it's the \"moment of truth\" where she needs to decide which surgeon to use for the mastectomy and which surgeon to use for reconstruction. She hasn't made a final decision on procedure yet but it's very likely she will have a bilateral skin-sparing mastectomy (not nipple-sparing or areola-sparing). She also hasn't made a final decision on reconstruction but she is leaning strongly towards tissue expander and silicone. We have already met with two of the general surgeons and one plastic surgeon (meeting with a second one tomorrow). We have also asked others in the community and we hear lots of \"they're both great\"-type answers. I agree that we have several options that are very good, but hey, we don't want very good, we want the best! :) I'm going to list what I think are all of the options for both categories; if there's another option, please let us know. We would really appreciate hearing any experience/opinion/information on these doctors - personal or hearsay, positive or negative. Mastectomy Dr. Susan Beck, Katzmann/Mercy Dr. Scott Hamling, Iowa Clinic (also UnityPoint/Stoddard/Methodist) Others at Katzmann: Torstenson, Franko, Goldman, Whitmer Others at Iowa Clinic: Kollmorgen, Baker, Dietzenbach, Mohan Reconstruction Dr. Samuel Maurice, Katzmann/Mercy Dr. Michael Carlisle, Katzmann/Mercy Dr. Lester Yen, Iowa Clinic Dr. Konstantinos Lekkas, Iowa Clinic Dr. Timothy Schurman, Iowa Clinic Dr. Mark Reece, Iowa Clinic The various cosmetic surgeons in the Des Moines area (Bergman, Folkers, Franks, Cherny, etc.) Thanks for all your help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/845341",
      "Title": "Des Moines, Iowa surgeons - mastectomy and reconstruction openorclosed openorclosed"
    },
    {
      "AuthorID": "openorclosed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230971/profile",
      "Content": "openorclosed wrote: On Tuesday morning, my wife had a bilateral skin-sparing mastectomy, placement of tissue expanders, and axial dissection on the left side. Today (Sunday) her condition is just about the same as it was four days ago - just barely able to get up out of the recliner by herself, overwhelming pain occasionally, can just barely move her elbows out of the way for me to empty the drains. Is this normal? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846061",
      "Title": "Feels like no improvement 5 days after BMX&TEs - is this normal? openorclosed openorclosed"
    },
    {
      "AuthorID": "openorclosed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230971/profile",
      "Content": "openorclosed wrote: My wife has breast cancer. Biopsy results phone call today. 35 year old female. Biopsy results today reveal breast cancer, DCIS in one spot and IDC in another spot. No staging information. Don't know when we will get staging information. Very, very, very, hard to have to wait to find out. My coping mechanism is research and trying to find answers. So here I am. I posted this in the IDC forum also. Hope it's okay to \"double post.\" Is there anything that can give a clue to what stage the IDC cancer is before getting all the tests scheduled and then waiting for results? For example, \"If a woman is stage IV, she's going to be noticing ____\" or \"If you know that this lump wasn't palpable six months ago, then it probably hasn't progressed to stage ____\" Basically looking for any way to know if I need to be worried about stage IV or not. Or just any clue or any correlating symptom or anything. I know that no one can answer with certainty, I know that it depends on a lot of variables, I know that it is different for every patient. I know. But can I get SOME kind of idea? Even if it's just a very rough idea or any small amount of information would be better than just \"it's different for everyone.\" Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/842612",
      "Title": "Any clues or correlations for staging (while waiting for tests)? openorclosed openorclosed"
    }
  ]
}