{
  "AuthorID": "Opt4Life",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
  "Posts": [
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Jan 20, 2016 06:11PM Opt4Life wrote: Yep, right there with you on the weight gain after only 8 weeks of Taxol and steroids. Looks like I about 12-15 lbs gained.I have been doing some comfort and holiday eating since diagnosis though so that's partly to blame; and instead of 6 days a week of hard workouts, I am doing 4 days of light to moderate workouts since starting chemo. But I have noticed that my face, hands, ankles and legs are puffier so its good to hear that this water retention will begin to lessen once chemo is done.",
      "MessageIndex": 2,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/840525",
      "Title": "Water retention after steroids and chemo husker Binney4"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Jan 8, 2017 10:33AM Opt4Life wrote: You are not seeing things. The puffy face and stomach can indeed be a side effect of chemo and especially the steroids used to combat nausea. I indeed had a double chin at the end of chemo and have worked hard at the gym to sweat it and my belly fat off to only partial results. It has only been five months since my last treatment and I fully expect to get back to my pre-chemo face and you will too. ",
      "MessageIndex": 2,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851701",
      "Title": "Double chin from chemo tamspitler tamspitler"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Dec 15, 2015 12:05PM Opt4Life wrote: Hi blainejennifer, very interesting question about more rather than less chemo especially for ER+\\PR+\\HER2- types like yours and mine. I also have at least one node positive and am currently doing Taxol that will be followed by AC. I just posted about that and the fact that I wonder if if AC or even Taxol will be beneficial especially for Luminal A and low KI-67 scores.However, your post seems to be indicating that it may be beneficial to have more rather than less chemo. I'm so new to this still that I don't know but would love to hear thoughts and opinions.",
      "MessageIndex": 1,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838532",
      "Title": "Full Dose Chemotherapy for Metastatic Breast Cancer blainejennifer ABeautifulSunset"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Oct 6, 2016 03:53PM Opt4Life wrote: Mom 2 Twins, thanks for the recurrence risk info. I honestly never thought to ask about risks-needing all my focus just getting through treatment. Now the hard part is trying not to let 'worry' be my new best friend. Was hoping to get some further treatment from the PALLAS Trial but like you and reflect mentioned the AIs are definitely the next line of defense for us ER+ gals. Meg, I was given the choice of Tamoxifen, Arimidex, Aromasin, and something else I can't recall. My MO said her patients so far have had less complaints on Aromasin. But she said I could switch at anytime too. That was enough for me at least to give it a try. I take my pill religiously same time every night. I recently got down to my last 10 or so pills and I was hounding my MO's office as if I needed my next hit. Thankfully, they understood and were happy to send in another scrip to my pharmacy.",
      "MessageIndex": 75,
      "PostDate": "06/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Oct 5, 2016 09:21PM - edited Oct 5, 2016 09:24PM by Opt4Life Mom of Twins, being that we have similar stage/diagnosis, I certainly wouldn't mind hearing the risk percentage you were given. I just got good/bad news today. I was randomized on the PALLAS trial to the B group so i'll get nothing but Aromasin. Its good news because I'm tolerating Aromasin well but bad news cause I was hoping to get the xtra protection that Pablociclibmay offer. My MO never talked risk percentages so now I'm curious.",
      "MessageIndex": 67,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Dec 18, 2016 09:32PM - edited Dec 18, 2016 09:33PM by Opt4Life Hi ladies, hope you are all having a great holiday season. I love the season--the music, the treats, and yes even shopping for gifts. However, this time last year, I was only amonth into chemo and certainly not feeling theholiday spirit. What a difference a year makes. Mom_of_twins, the PALLAS trial is going okay so far. I was being seen every 30 days for bloodwork, to review any new issues or concerns, and turn in my tracking sheet to confirm I'm taking my aromasin daily. They are now switching me from 30 day check-ups to 60-day check-ups which is fine by me.",
      "MessageIndex": 223,
      "PostDate": "18/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Jan 4, 2017 05:43PM Opt4Life wrote: Happy New Year ladies, I hope you all had a great holiday. I did little, thought about little, and ate lots. Mom and Meg, I see you are joining me on the No Palbo ride. I was disheartened to not receive further treatment but it also means I'm not receiving further treatment. I'm on the daily aromasin, 60-day check-up, and 6 month mammo plan. Aromasin has me flashing once daily and knees take a beating when walking down or upstairs. Coincidentally they don't hurt when exercising--weird. I have a breat reduction and lift scheduled for my non-cancer breast in February. Not really feeling up to going back under the knife or anesthesia but I'm currently lopsided and its noticeable. Hope to see my 50th b'day in2017!",
      "MessageIndex": 242,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Nov 30, 2015 04:58PM Opt4Life wrote: A big and hearty CONGRATS to you Momof2. I am just starting my treatment and stories like yours make me feel stronger each and every day.",
      "MessageIndex": 36,
      "PostDate": "30/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792750",
      "Title": "Finally found myself...... Momof2inME ck55"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Apr 4, 2019 04:17PM Opt4Life wrote: Hello ladies, stopping in because I just started Faslodex and Ibrance as part of my regular treatment after a recurrence on Aromasin. I was wondering for those of you who have been on Ibrance for quite some time (over six months) if you had hair thinning or loss. When I was first diagnosed I could have cared less about hair. I just wanted to be 'cured'. But now that I have lost my hair and grown it back even thicker and more luxurious than before, I'm like \"hold up, is this medicine gonna make me lose my hair again\". I know itt's ultimately silly to be worried about balding when you are trying to beat the beast, but nothing about cancer makes sense right? Anyway, would love to know if anyone has had any significant hair loss on Ibrance.",
      "MessageIndex": 144,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/861781",
      "Title": "Ibrance/Palbociclib/Pallas trial... experiences? Anna-33 Christene502"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Sep 14, 2016 12:47PM Opt4Life wrote: No PCR for me either. My lump flattened out and two nodes were markedly reduced in size. But I still had 4.2 IDC/DCIS plus 3 pos nodes (with one having a few circulating cells only but still considered positive). KI-67 was 5 on one test and 18 on another. I had chemo, surgery, rads in that order and am taking Aromasin for two months now. My MO is recommending me for an Ibrance trial as she is very pleased with her Stage IV patients'response and would like to get some earlier stage patients on it.",
      "MessageIndex": 12,
      "PostDate": "14/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Sep 16, 2016 11:25PM - edited Sep 17, 2016 09:27AM by Opt4Life Yes, Mom of Twin, its the PALLAS trial and I signed papers today and will get randomized in next 2 weeks. My MO has 14 patients in trial so far and half have gotten the drug but of course all are followed for 2 years. I'm a bit nervous but I'm heartened that if I am in the drug group that I can or MO will request I stop if SEs are unmanageable.",
      "MessageIndex": 16,
      "PostDate": "16/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Dec 24, 2016 03:49PM - edited Dec 24, 2016 03:50PM by Opt4Life Just stopping in to say hello while I've got a big smile on my face. I stopped through my pharmacy because my MO called in a prescription for a year's worth of aromasin. When I pulled out my wallet, the pharmacist goes 'don't bother, Merry Christmas'. Apparently I've met my catastrophic limit againthis year. God bless and Happy Holidays everyone!   ",
      "MessageIndex": 232,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847977",
      "Title": "Response to neoadjuvant chemo? Mom_of_twins beauz"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Apr 4, 2019 04:52PM Opt4Life wrote: Thanks Anna! I'll take that luck. Glad you are doing relatively well on Ibrance",
      "MessageIndex": 146,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/861781",
      "Title": "Ibrance/Palbociclib/Pallas trial... experiences? Anna-33 Christene502"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Nov 10, 2016 12:24AM Opt4Life wrote: I also checked with my MO about tumor markers as my lab results indicate every other test but these. She said she doesn't use them for early stage as they are not reliable. She does however track closely any new pain or symptoms and blood work. Therefore, it seems I have to trust her and pay close attention to any body signals too.",
      "MessageIndex": 26,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/847001",
      "Title": "How often are we getting tumor markers checked? shelly56 SSInUK"
    },
    {
      "AuthorID": "Opt4Life",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224971/profile",
      "Content": "Jan 19, 2016 10:43PM Opt4Life wrote: Really sorry that you have to be here....but there is great support here. I'm doing chemo first. My oncologist left it up to me but she and my BS got their heads together and highly recommended neoadjuvant chemo for my node positive 2.5 cm mucinous breast cancer but ultimately left it up to me. I figure two people with medical degrees who have between them 40 years working with breast cancer might know a little something. Things they considered besides my positive node was that I was pre-menopausal, was in relatively good health (so chemo was likely not going to exacerbate any health problems), and that chemo would get to any cancer cells that may have escaped my nodes. Chemo isn't fun but it really hasn't been bad and I actually look forward to my treatment each week as it puts me closer to being rid of this beast.",
      "MessageIndex": 15,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/839865",
      "Title": "Chemo first. Anyone else? Myraknits"
    }
  ]
}