{
  "AuthorID": "OptimisticWorrier",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8009/profile",
  "Posts": [{
    "AuthorID": "OptimisticWorrier",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8009/profile",
    "Content": "OptimisticWorrier wrote: I found a prominent lump on May 17th that seemed to pop up overnight.  I figured it was a cyst or fibroadenoma, but being a cautious person (and having a mother w/bc and grandmother died at early age of ovarian cancer) I called my ob/gyn first thing monday the 19th and got an appt same day.  Doctor agreed it was probably nothing, but referred me for mammo and ultrasound to be safe.  So I spent the week very calm waiting for my appt scheduled for next (this) week... I've been thru this before due to fibroadenoma so I was not over-worried.  Then on Saturday, exactly one week from when I originally found it, my lump markedly enlarged and became tender.  On Sunday it was even bigger and about 1/4 of my breast was now RED and a dimple was apparent when I raised my right arm.  I've never experienced this type of cyst before so I spent the rest of memorial weekend anxious and eagerly anticipating my visit today. Today was a whirlwind... once they saw my breast they took just two pictures via mammo and went straight to ultrasound.  After ultrasound the dr came in and told me that they are recommending something unusual... they want to do a FNA and possibly a biopsy immediately.  But at same time he assured me that the lump is a cyst (5.5 cm which they all thought was very large) and probably I have a breast infection.  I asked him, looking him square in the eyes, have you ever seen a breast infection like this before?  He said, no, he had not, and later he stated he had never seen anything like this before at all, i.e. breast infection or otherwise.  So they tracked down my doctor (who was home sick) and got okay to proceed while I sat there waiting. So they did FNA and extracted lots of fluid which will be tested and then he decided to do biopsy as well.  They also called my dr. office to get me on an antibiotic in case it's just a breast infection.  (I haven't breastfed in 7 years & wondering what the heck I could have done to get a breast infection?!?)  So now I'm waiting and trying to gain information in preparation for next steps.  Of course the chances are good there is nothing wrong with me other than a strange breast infection.  But I can't help but worry that this is IBC... and IF it is... I know that it's not easy to diagnos.  If my tests come back negative, should I push for further tests and what type?  MRI?  I know the people on this site are very knowledgeable (although not medical experts!) and thought someone might have some advice... maybe been down this road before and have advice?  Or if nothing else, thanks for taking the time to read.  thanks! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "27/05/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/706286",
    "Title": "MRI? OptimisticWorrier OptimisticWorrier"
  }]
}