{
  "AuthorID": "Optimist52",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
  "Posts": [
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Aug 28, 2016 09:37PM Optimist52 wrote: cjoy, can you add your details under My Profile. You would probably be eligible for Oncotype DX test which will determine the need for chemo. There are many threads here about this and info on the main site. Hope you are doing ok.",
      "MessageIndex": 8,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/846584",
      "Title": "Questions about chemo cjoysims777 Jennyannk73"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Nov 17, 2015 09:26PM Optimist52 wrote: I agree that you need better medical attention than you've had. Is there another breast centre or medical clinic you could go to? ",
      "MessageIndex": 2,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836843",
      "Title": "Lump in breast, 29 yrs old, had a ultasound, showed nothing? Naychristine2011 Saviorlives17"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Dec 5, 2016 05:18PM Optimist52 wrote: I am so sorry to tell you all that KT passed away Monday 5th (New Zealand time). She left behind her husband, son and daughter. She was a key part of our Kiwi ladies thread on here and we will all miss her compassion and kind heart. Best wishes to all of you here.",
      "MessageIndex": 90,
      "PostDate": "05/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832779",
      "Title": "Lepromenngeal smiley47 Hernie"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Jan 17, 2017 08:36PM Optimist52 wrote: This doesn't sound like proper investigation. Do you have any dedicated breast centres near you? Or a teaching hospital? It's important to get to the bottom of what's causing the inverted nipple and your other symptoms. It's so hard to have to fight for proper treatment when you're already stressed by pain etc. Do you have a trusted friend or family member who can support you and also get another opinion?",
      "MessageIndex": 9,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851887",
      "Title": "Advice please Emcginty247 Claudia30"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Jan 15, 2017 06:20PM Optimist52 wrote: Emcginty, so sorry that you aren't getting answers. Hopefully on Tuesday you can find out more. Have you had the biopsy result yet?",
      "MessageIndex": 3,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851887",
      "Title": "Advice please Emcginty247 Claudia30"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Jul 25, 2017 04:47PM Optimist52 wrote: Artista, you claim that breast MRIs are harmless. Unfortunately this is not the case. I was on a six monthly MRI/mammo-US schedule until my BS told me that the latest research on breast MRIs shows that the contrast dye used (gadolinium) has been shown to be potentially harmful to the brain and kidneys. She has now stopped my MRIs which on the one hand is concerning because they are the best tool for diagnosing ILC (which I have), but on the other this is a real worry in terms of the risks to the brain and kidneys. Here's a link to the latest information on it. https://gadoliniumtoxicity.com Ultrasound certainly does seem to be harmless and is definitely worth getting as an adjunct to mammogram. I have raised this issue about gadolinium used in breast MRIs previously on this site but it hasn't received much attention. It's particularly an issue for anyone with ILC because of its ability to 'hide' on mammogram and sometimes US.",
      "MessageIndex": 15,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/857303",
      "Title": "Monitoring for recurrence - what do your doctors suggest? mellee gb2115"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Jan 12, 2016 07:03AM Optimist52 wrote: scrunchthecat I have just been playing Station to Station. It's my favourite David Bowie album and that's not an easy choice to make! Word on a Wing so beautiful, TVC15 great to dance to, every song superb. ",
      "MessageIndex": 20,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839838",
      "Title": "Inspiration from David Bowie ABeautifulSunset Longtermsurvivor"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Jan 12, 2016 03:05AM Optimist52 wrote: A musical genius, I have most of his albums and saw him in concert in 1983. Best concert ever. We were all lucky to have him in our world.",
      "MessageIndex": 12,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839838",
      "Title": "Inspiration from David Bowie ABeautifulSunset Longtermsurvivor"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Jan 26, 2016 05:04PM Optimist52 wrote: I'm also considering this surgery for this year. Thanks DizzParkMom for very encouraging info. I've already had a mastectomy last year so the other side will be nipple and skin sparing. My husband and I are not getting on well at all so I worry about how helpful he will be for my recovery. I have two young adult sons who are not particularly good around the house! I'm usually the chief cook, cleaner, shopper, organiser, you know the drill. I am concerned about infections, complications etc post surgery. Alternatives of no breasts at all (I find that hard to imagine) or the 6 month MRI/mammo & US is super stressful too! So hard to make these decisions.",
      "MessageIndex": 3,
      "PostDate": "26/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/840694",
      "Title": "Bilateral Masectomy with Diep Flap Wings2Fly Optimist52"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Jan 8, 2016 01:57AM Optimist52 wrote: My second cancer occurred nearly 12 years after the first, in the same breast. If I had chosen mastectomy the first time, I probably wouldn't be dealing with this one now (see my details below). Sadly that isn't even certain as some women recur in scar tissue. The decision making process is one of the hardest parts with breast cancer. I wish you well in your decision.",
      "MessageIndex": 9,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/839680",
      "Title": "Met with Surgeon - very confused now on what choice to make ayr1016 TwoHobbies"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Apr 18, 2016 11:48PM Optimist52 wrote: Something you may not be aware of, chemo doesn't always work so well with ILC. Oncotype DX test really worthwhile.",
      "MessageIndex": 3,
      "PostDate": "18/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/843561",
      "Title": "Just diagnosed 04/03/16 MFalabella Bunny1966"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Sep 15, 2015 06:54AM Optimist52 wrote: 40 first time (lobular, found it myself) 52 second time (found it myself again, lobular and didn't show up on mammograms)",
      "MessageIndex": 514,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Feb 16, 2016 09:56AM Optimist52 wrote: Hi Wings2Fly, Sorry I didn't reply earlier, forgot to save this post to Favourites. Have you made a surgery decision yet? Or already had surgery? I agree with DizzParkMom that pain medications are much better nowadays. I'm not so concerned about pain but more concerned about how long I will really be \"out of action\". This is the hardest decision to make. For me elective surgery is a completely different ball game to surgery you have to have to save your life. The DIEP procedure certainly seems to lead to far less infections and complications than implants. It's just such a scary thing to contemplate the lengthy surgery and recovery.",
      "MessageIndex": 13,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/840694",
      "Title": "Bilateral Masectomy with Diep Flap Wings2Fly Optimist52"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Feb 29, 2016 12:56PM Optimist52 wrote: Hi Wings2Fly, thanks for your reply. I'm seeing my BS again in April and she's asked me to come up with a decision by then. Lately I've been thinking that I will do the 6 month surveillance for a while longer and then probably have a prophylactic mastectomy without reconstruction. I've lived with a single mastectomy for nearly 8 months now and I'm coping okay with it. I've read a lot of these threads and although I know many do well with DIEP flap surgery, I'm concerned about the length of recovery and possible complications. Have been reading the Going Flat thread and I see that many women do well with that. As choices, they all have significant downsides. I wish we all didn't have to make them.",
      "MessageIndex": 18,
      "PostDate": "29/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/840694",
      "Title": "Bilateral Masectomy with Diep Flap Wings2Fly Optimist52"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Sep 30, 2015 03:00AM Optimist52 wrote: You sound quite reasonable to me. A biopsy will be guided by ultrasound anyway, not mammogram. When I found my lump in June this year, I was sent straight to ultrasound and wasn't even offered a mammogram.",
      "MessageIndex": 1,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835382",
      "Title": "Afraid of the upcoming mammogram. Do not want to do it. maryzz BRCA1positive"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Nov 9, 2016 07:47PM Optimist52 wrote: Hi DZF, with an Oncotype DX score so low, I believe you can certainly skip chemo this time. I also recurred after 12 years, however had 4cm ILC tumour, and isolated tumour cells in two nodes (technically classed as node negative). My score was 22. My MO told me unequivocably that it wasn't worth the risk of chemo with that low intermediate score; this was backed up by another MO I saw some time later. So a score of 2 seems pretty damn good. Oncotype DX Breast Recurrence Score predicts chemotherapy benefit and the likelihood of distant breast cancer recurrence. In other words you have a very low risk of recurrence and a very low benefit of doing chemo. You would however no doubt gain some benefit from anti-hormone therapy.",
      "MessageIndex": 3,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849866",
      "Title": "Low Onco Score but Node Positive - Chemo? DZF60 coraleliz"
    },
    {
      "AuthorID": "Optimist52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220434/profile",
      "Content": "Mar 14, 2017 07:01PM Optimist52 wrote: I have been on a 6 monthly surveillance with alternate MRI and mammo/US and when I saw my BS in January she told me I should probably stop having MRIs as the gadolinium is now considered risky because it can stay in the brain. Previously it was known that it could damage kidneys. This is of particular concern to anyone with ILC, as mammo/US aren't reliable at seeing it. I've referred to this on the Member of the 6 Month Watchful Waiting Club thread, however it didn't generate much discussion. I am personally in a quandary over this, as I have a remaining breast, and at this stage don't particularly want prophylactic mastectomy. It's an issue for anyone having breast MRIs however, as they need the gadolinium to be able to read the MRI properly.",
      "MessageIndex": 1,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853438",
      "Title": "Breast MRI Amanda702 Amanda702"
    }
  ]
}