{
  "AuthorID": "OTMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
  "Posts": [
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 4, 2019 03:12AM OTMom wrote: Congrats on finishing, salamandra! I’m at the other side of treatment with mapping and setup this morning. In the craziness of the holidays and returning to work I kind of pushed this whole thing to a corner of my mind and am having a weird mental/emotional adjustment to returning to the reality of my diagnosis and treatment. After surgery I was able to just be at home and focus on recovery. A little overwhelmed at the idea of juggling treatment, work, parenting, and all the follow up appointments now. One step at a time...",
      "MessageIndex": 12,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 11, 2019 03:19AM OTMom wrote: FaceForward and Hpfull, I had the same experience. I think I hardly felt anything before surgery- it was all just logistics and planning and things to do. It wasn't until I stepped into the MO office the first time a week after surgery that I got hit by \"OMG. I'm a cancer patient.\" That was the first day I actually cried about any of this. Going in for radiation setup last week was the same sort of experience. I'd put the cancer thoughts away for the holidays and got totally overwhelmed by all the feelings again after I left. Actual treatment starts on Monday. Still have a lot of tenderness around my lumpectomy incision, so hoping radiation doesn't make it too much worse.",
      "MessageIndex": 71,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 25, 2019 03:47PM OTMom wrote: TC73, congrats on being done! DeeDee, I'm so glad you're finally seeing signs of improvement. Salamandra and Parrhesia, trying to make decisions about having children along with all of this is really hard. I'm sorry that there's an extra layer of complication to this for you. Fatigue hit hard today and I ended up taking the day off. I never do that and had to fight the part of me that felt like an enormous slacker for doing so. But I was fighting tears trying to get myself out the door and then as I stood at the end of the driveway talking to our neighbor I realized that the longer I stood there, the more dizzy and nauseous I felt just from the effort of standing. So I let the tired win for today and hopefully after the weekend things will be better. I still felt pretty dizzy and weird driving to and from radiation this afternoon, so it was the right call. I just don't like it. I've been pushing hard to limit the number of hours I have to take off and to try to keep my productivity at an acceptable level, but I'm going to have to let go of that and just get through the next couple of weeks.",
      "MessageIndex": 224,
      "PostDate": "25/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 13, 2019 05:57PM OTMom wrote: I'm doing 4 weeks starting tomorrow. I assume it's the 16+4 boost. There's definitely a boost involved- just not sure of the exact numbers. I also wasn't offered options. This is just what they do for this particular scenario. Boston area, age 41. I'm still having incision pain, so am kind of worried about how this will all go. My cancer was upper inner quadrant, so the incision is kind of front and center. I work with infants and toddlers, so with kids sitting on my lap, climbing on me, etc, it gets bumped a lot over the course of the day. Not looking forward to increased sensitivity when it's already awkward and uncomfortable. Good luck with your return to work, Salamandra!",
      "MessageIndex": 95,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 24, 2019 03:49PM OTMom wrote: Salamandra, mine was 1.3, grade 2, oncotype 13 and they also told me chemo would not be beneficial. I think when there's an oncotype score that does tend to dominate the decision making, though some MOs do tend to add chemo in sooner for younger people. I'm 41, which my doctors have still considered to be on the young side for this. DeeDee, I'm so sorry you're so miserable. That sounds absolutely awful. My chest and shoulder are tightening up, so I guess I need to do more stretching until I get through RADS. Just when I thought I was finally getting normal range of motion back. Thanks for the reminders about hydration. I'm working on it, but it gets complicated in a job that doesn't have easy bathroom access.",
      "MessageIndex": 219,
      "PostDate": "24/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 17, 2019 02:16PM OTMom wrote: Faceforward, I'm so sorry your first day was so rough. I hope today went better. None of this is easy and no reaction is wrong. Don't be too hard on yourself, and do talk with your treatment team. They have seen everything I'm sure, and they might have ideas that can help. Salamandra, I can't believe people comparing it to coming back from summer break! Sure, there's an adjustment after breaks, but this is NOTHING like that. It's not like you've been relaxing and are just getting used to a work schedule again. You've been through cancer treatment! I'm sorry there's not more understanding and I'm sorry it's been so exhausting. Teaching is exhausting enough without any extra challenges. This must be really hard. TC73, I agree about mental health. I have been impressed by my hospital on this front so far though. They had me check in with a social worker post-biopsy before I went home, she is the one that called with my results and coordinated my first appointments, she came and talked to me at my first MO appointment after surgery, and was waiting by the radiation check in desk when I arrived for my first treatment this week. I know that's not the case everywhere and I feel lucky that they're looking out for that here. I really do think some people think once you get to radiation it's all easy from there. You look normal, so you can't possibly be going through anything hard or feeling bad, right? Somebody approached me today about coming to a meeting with her so that I could add another kid to my caseload because his OT left. I've been pretty clear that I'm not picking up new kids right now and have agreed to a few consults but am trying not to overload myself until I know how my body reacts to treatment. She stood there looking at my planner over my shoulder suggesting times and asking if I could rearrange things until I finally just agreed to something to end the conversation before I ended up in tears. Some people really get it and have given me full permission to back out of things, ask for help, etc. Others just don't. I hit a giant wall of exhaustion around noon today. I rallied and made it through the rest of the day and through treatment 3, but it was intense. Hoping that was just a random wave of tired and not fatigue from treatment kicking in already. Seeing color changes already. It happens quickly!",
      "MessageIndex": 138,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 22, 2019 05:22PM OTMom wrote: Got a 3 day weekend because the RO was closed for the holiday yesterday. Back at it today. Day 5 down. Also coming closer to a plan for the hormone treatment. Prior to BC diagnosis I'd spend most of the last year trying to sort out some intensifying pain issues I've been having. Finally had a gyn appointment today that confirmed endometriosis. Best combined approach to BC and endo is ovarian shutdown and AI. So, assuming my dexa scan is OK and there's nothing surprising in my genetic testing, I guess that's where we're headed.",
      "MessageIndex": 196,
      "PostDate": "22/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 26, 2019 06:53AM OTMom wrote: Jen2Mom, I love the idea of a celebration at the end of each week. We've got to find things to celebrate in this. I definitely felt tired in the first week, but it was hard to tell what was from rads, what was from life, and what was the emotional toll of all of this. But it's totally reasonable to feel tired at any time and to take a break and rest when you need it. (saying that out loud so that I can hear it and work on listening to that as well) Egregious, unfortunately my job also involves a lot of driving (I do early intervention, so it's all home/daycare visits and driving all over to get from one to the next) so I need to find a way to be OK for all of it or just decide to take some unpaid time off. I'm hoping resting this weekend will help. I'm also constantly fighting off germs, since everyone I work with is sick at this time of year. Usually my immune system is pretty fierce, but all of the physical stress of surgery and treatment has made it harder to fight stuff off, so I got really sick in late December and feel like I'm constantly fighting a low grade cold right now. Not enough to make me full blown sick. Just enough to add to the fatigue. So sorry to hear about the miserable skin reactions people are having. That's one area where I have been lucky so far. I have some itching and soreness and tightening of muscles, but nothing major. I'm so sorry so many of you are going through that level of misery. Joytxs, I hope that with a break and some new topical treatments you start to feel better. Was your RO checking in with you during treatment? How could they have not known how bad it was? That doesn't sound right to me. I hope you get some relief.",
      "MessageIndex": 231,
      "PostDate": "26/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 4, 2019 03:50PM OTMom wrote: Thanks, Salamandra. I was a teacher for 15 years, so I completely understand the intensity and how hard it is both to be out and to work through things. I'm glad you were able to take the time you needed. Good luck with the return. I can imagine going back feels pretty daunting. I left teaching a few years ago to go back to school and am less than a year into my first job as an occupational therapist. I do early intervention, which is wonderfully distracting because working with infants and toddlers requires full engagement and usually makes me laugh. However, the back and forth between \"cancer patient\" and \"totally fine, nothing's wrong\" is pretty hard. Starting the day with a full force return to cancerland and then working for a full day today meant that every moment I wasn't insanely busy I was on the verge of tears. I imagine it gets easier, but it was a rough day and reinforced my plan to do my radiation at the end of my work day. Since I'm new to my job I don't have a ton of time off and used what I could to take 2 weeks off for surgery. I need to preserve what I can for all of the follow up appointments plus snow days and random kid illnesses so am trying to work through treatment but if I can't I'll just have to take unpaid time. I'm all marked up and ready to go. They offered next Wednesday as a start date, but I decided to push it to the following Monday so I have a week of normalcy to work out the scheduling with my supervisor and to see all the kids in my caseload another time since my presence has been a little spotty between surgery and the holidays. I kind of wish it were starting sooner because this in between phase is kind of hard, but I do appreciate the time to get myself organized and make a plan. The extra skin healing time probably doesn't hurt either. For now, I'm just glad it's the weekend.",
      "MessageIndex": 21,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 23, 2019 04:44PM OTMom wrote: Yay for finishing, Dani! Misha- here's hoping on the few side effects front. I won't be too far ahead of you with starting most likely so we can compare notes. Fatigue is definitely kicking in. Last week I wasn't sure if it was the RADS or from life in general. Today I was trying to get a sleepy little guy to stay awake with some jumping and moving and had to quickly hand him off to his ABA therapist and sit down because my body suddenly hit NOPE. So tired I'm dizzy and nauseous at times. I need the distraction of working, but this could get hard. Ugh.",
      "MessageIndex": 204,
      "PostDate": "23/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Jan 16, 2019 03:03PM OTMom wrote: Two sessions in. I was surprised by how fast it was. I was pretty emotional early in the week. Better today. It comes and goes. I suppose that's pretty normal. I also get sick of \"you look great!\" First of all, I'm sure that's a lie a good bit of the time. Plus I'm tired, overwhelmed with trying to balance life, work, and treatment, and am still trying to sort through the medical issues that I was dealing with before the cancer diagnosis. I am trying to pretend that everything is OK while working with my clients, but am scrambling to make things work because I don't work a normal week until sometime in March between radiation and all the other appointments, and am going to run out of time off at some point. I am having to adjust how I work with kids because any pressure on my incision area still hurts, and it's pretty front and center where it gets bumped constantly (anytime I pick up a baby, have a kid on my lap, let them pull up on me while working on gross motor skills, give them squeezes for sensory input, etc. It's constant). And that's before any pain from radiation kicks in. My back, which has always been an issue, is acting up just for kicks. But hey, if I look great everything must be fine, right? I asked for a gift certificate to AnaOno for Christmas, so at least have a few super soft things I can wear as my skin gets more sensitive. But then last weekend I tried to wear the tank and the pressure across some of the still swollen areas hurt and then made my arm start to tingle. Surgery was 6 weeks ago today. I really thought I'd be past more of that by now. I have tattoos for treatment. There was no option. But they're so teeny they're barely visible and they use a marker to make them darker when they're lining me up for treatment. I've got so many scars already between surgery and two biopsies that I don't really care. At some point when things are less painful maybe I'll turn it all into a tattoo. I've never gotten one, but this seems like a good reason to do it. Reclaiming my body, etc. At the same time the thought of more pain in that area may keep me from actually doing it.",
      "MessageIndex": 127,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Feb 4, 2019 05:00AM OTMom wrote: My surgery was 12/5, CT mapping for rads 1/4, actually started rads 1/14. They don't like to wait super long, but they also want to give time to heal. My RO wasn't super stressed about a precise timeline.",
      "MessageIndex": 2,
      "PostDate": "04/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869670",
      "Title": "How Long After Surgery Should Rads Start? kec1972 AliceBastable"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "May 7, 2019 05:53PM OTMom wrote: I thought I was reacting to the tape after my biopsy but after surgery it became clear that it was whatever they prepped the area with. Itchy nastiness all across my chest and armpit. Just another possibility to keep in mind if tape starts to look like a less likely culprit.",
      "MessageIndex": 9,
      "PostDate": "07/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/871392",
      "Title": "Sudden allergy to surgical tape? Jerz_0035 MelissaDallas"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Mar 9, 2019 07:54AM OTMom wrote: My RO said people with fattier breasts experience more shrinkage. Less common with denser breasts. She felt like I'd be fine because I have small dense breasts. It's certainly worth talking with the RO about your concerns. A good doc will be upfront about the possibilities. Mine was also left side and she explained to me all the things they do to protect the heart and lungs. I had to do breath holds during treatment because that reduced risk and moved things so that it was easier to miss the heart with the beam. It was pretty easy- not long holds, they gave me glasses that helped me monitor how deep of a breath to take, etc. I'm not that far out, so I can't say much about long term effects, but my experience during was not fun but manageable. As far as appearance, I'm pretty small to begin with. As things are settling out I can see a slight size difference, but I think I'm far more aware of it than other people. I've asked two people that I'm close to. One doesn't see it, one can see it but only because I asked her to look. So the average person is not going to notice. I also noticed the size difference after surgery, so I think there might have been minor swelling during rads and now that is going down, so it's hard to say if rads had any impact on size or if it was just the surgery. Once things have settled a little more I plan to figure out what bras fit, explore whether a small lumpectomy form or extra padding or something would help to even out size if it's still bothering me, etc. There is a shop here where I can make an appointment for a fitting if I decide I want to address the size difference. It's frustrating and I don't love having new things to be self conscious about but it also feels workable and manageable. Make the decision that feels right to you, but know that appearance-wise there are things that can be done, even in a bathing suit, and you might not see any change at all. Hang in there. You can do this.",
      "MessageIndex": 3,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870225",
      "Title": "Lumpectomy last Friday sagelady sagelady"
    },
    {
      "AuthorID": "OTMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284041/profile",
      "Content": "Mar 2, 2019 10:47AM OTMom wrote: I had it too. I found it kind of fascinating, especially when they had to check to make sure it had gone in and wasn't still in the needle. They swiped the geiger counter by the needle- nothing. Then they held it close to me and it started making noise. So weird. I also had the signature sheet that followed me around until it was removed during surgery. From what hospital staff said (mostly the nurses in pre-op who have seen many people go through this), it's much more comfortable than the wire localization.",
      "MessageIndex": 2,
      "PostDate": "02/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870055",
      "Title": "Radioactive Seed Localization Before Breast Surgery Karmic108 OTMom"
    }
  ]
}