{
  "AuthorID": "Otterlike",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184667/profile",
  "Posts": [
    {
      "AuthorID": "Otterlike",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184667/profile",
      "Content": "Oct 3, 2013 11:01AM Otterlike wrote: Gosh, didn't even think about removal when I was getting them put on (and then my radiation has been pushed out by a month, possibly month and a half from when I got my CAT scans!!).  I guess I kind of view them as warrior \"paint\".  But I already have tats, so maybe it's less of an issue.  I did consider possibly getting other things put over them when I am done but then I thought of one poster's point, that well, they might be needed again.  So, they get to stay.  I hope you find a workable method for you!",
      "MessageIndex": 15,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/806982",
      "Title": "Getting rid of radiation tattoos? DLL66 macb04"
    },
    {
      "AuthorID": "Otterlike",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184667/profile",
      "Content": "Oct 2, 2013 11:49PM Otterlike wrote: I understand that if you have positive nodes, you are out of the running as a candidate for prone (I looked into this extenstively myself).  They need to be able to get to the clavicular area, the chest wall, the armpit, etc.  I do not have positive nodes and I would be able to do prone however the only facility that does it (for Kaiser), is across the bay in Oakland.  It would make my life a living hell far more than just down to south of San Francisco every day so I had to weigh my quality of life against a likely only 0.5% reduction in possible side effects, plus, and this kind of made my mind up as well, my chest wall would NOT be getting scatter and I want full coverage thank you very much!  Sucker be gone, damnit!  It should also be noted that I have left side cancer, so I do understand the risks are a little higher for me.  But I really like and trust my radiation oncologist and he was very open and clear about the statistics and I felt far less anxious about it than I had before going in to talk to him.  Also, I think you need to have, uhm, how was it put \"large, pendulous breasts\", or at least that makes prone (or as I affectionally called \"Boob-In-A-Board\".  Which I \"did\" also have.  Well, still have on one side!",
      "MessageIndex": 3,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/812046",
      "Title": "prone versus supine mtnchick yoga_girl"
    }
  ]
}