{
  "AuthorID": "pabbie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67081/profile",
  "Posts": [
    {
      "AuthorID": "pabbie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67081/profile",
      "Content": "Sep 5, 2008 12:23PM pabbie wrote: Yes, I have a couple of arse mole drs. I'm sorry you had to go thru that. Take care.",
      "MessageIndex": 4,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/720666",
      "Title": "Rude Doctors!!!!! nobleanna007 nobleanna007"
    },
    {
      "AuthorID": "pabbie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67081/profile",
      "Content": "Jun 4, 2008 06:05PM pabbie wrote: I'm in week 5 of radiation. I've been using Aquaphor. I apply a generous amount after every treatment when I get home. I also wash the area gently every day with Dove Unscented soap & water. And keeping the area dry helped me with a rash I got under my breast. My radiation techs told me if my skin breaks down they would send me to the nurse in which there was something else I could use. I didn't get the name; but I would ask to see the radiation nurse or onc. Good luck, it's almost over with for you and me.",
      "MessageIndex": 3,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/706770",
      "Title": "Raw peeling skin what to put on? SusanB12 pabbie"
    },
    {
      "AuthorID": "pabbie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67081/profile",
      "Content": "pabbie wrote: Hi, I saw a lymphadema physical therapist last year after my radiation. She said I had stage 1 Lymphadema in my right arm. I was given compression garments for my arm and hand and leg (from another surgery). I would use my garments to the gym to ride the bike and lift light weights throughout the year. I tried to wear my garments to work but they made me more hot. (sweat was pouring off my face) Menopause time plus tamoxifen. The job was to scan 300-500 credit-card like cards through a machine. A cashier cafeteria position. My p/t said I need to wear my glove if I'm to continue with this repetitious work. Any suggestions on how you keep cool when wearing your garments at work? And what kind of work do people do with this problem? I actually thought my lymphadema would be better in the right arm. Now I'm up a notch to stage 1-moderate. Thanks and take care May 2017 Recurrent 1.1 centimeter IDC with multiple foci, treated with surgery & Aromasin. Dx 2/6/2008, IDC, 2cm, Stage II, Grade 2, 2/19 nodes, ER+/PR+, HER2- Dx 1/23/2014, IDC, Stage I, Grade 1, 0/0 nodes, ER+/PR+, HER2- Surgery 1/23/2014 Mastectomy: Right Dx 5/4/2017, IDC, Right, 1cm, 0/0 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/735335",
      "Title": "Lymphadema worsens in a year's time pabbie inspiewriter"
    },
    {
      "AuthorID": "pabbie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67081/profile",
      "Content": "Sep 2, 2008 01:04PM pabbie wrote: Hi-I take Celexa daily and Klonopin (Clonazapem) before bed to sleep. The klonopin works well as an anti-anxiety/anti-insomnia drug. Before BC, I'de take 1/2 of a .5 mg pill, now I take the entire .5 mg nightly. The tamoxifen makes me anxious. Take care. It helps to have a little help to calm us during this BC journey. Good luck.",
      "MessageIndex": 4,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/720447",
      "Title": "Anyone out there taking anti-anxiety meds? Wink PugMum"
    },
    {
      "AuthorID": "pabbie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67081/profile",
      "Content": "Jul 2, 2008 12:30PM pabbie wrote: Thanks Binney, I have an appt with a lymphadema clinic the end of July. I haven't seen a therapist yet but am looking forward to it. My rad onc diagnosed me with lymphadema of the arm (she measured both arms). The only thing I noticed as far as the radiation to my tumor site was I got breast edema (right breast) and it is still there. My rad onc says 2-3 months perhaps until it goes down. I take ibuprofen for the pain and swelling. My arm is still numb under the arm pit. I had 2/19 nodes positive (one was the sentinel lymph node). Sometimes I think I had alot of lymph nodes taken out as opposed to others I have read. Thanks for the kind thoughts. I'm trying to put one foot in front of the other as far as getting motivated to walk. And my goal this summer is to do some water exercises in the pool. I hope you are well also. Thanks for caring. Pabbie",
      "MessageIndex": 2,
      "PostDate": "02/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/708359",
      "Title": "Shoulder Pain in my back area where I was radiated pabbie sekali2"
    },
    {
      "AuthorID": "pabbie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67081/profile",
      "Content": "pabbie wrote: I'm over 1 week post-radiation treatments and am experiencing shoulder pain in my back area where I was radiated. I'm starting to get more active in which I'm walking and stretching/exercising my lymphadema arm and back to try and stretch it out. I'm also taking ibuprofen for the pain and my right breast is still swollen (breast edema). But the good news is that my redness is gone and my breast color is looking more light. Is there anyone else experiences this type of pain after radiation treatments? May 2017 Recurrent 1.1 centimeter IDC with multiple foci, treated with surgery & Aromasin. Dx 2/6/2008, IDC, 2cm, Stage II, Grade 2, 2/19 nodes, ER+/PR+, HER2- Dx 1/23/2014, IDC, Stage I, Grade 1, 0/0 nodes, ER+/PR+, HER2- Surgery 1/23/2014 Mastectomy: Right Dx 5/4/2017, IDC, Right, 1cm, 0/0 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/708359",
      "Title": "Shoulder Pain in my back area where I was radiated pabbie sekali2"
    },
    {
      "AuthorID": "pabbie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67081/profile",
      "Content": "Sep 13, 2008 04:44AM pabbie wrote:",
      "MessageIndex": 22,
      "PostDate": "13/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721045",
      "Title": "My doggie passed away from cancer on Monday mason204 chipdog3"
    }
  ]
}