{
  "AuthorID": "pam53",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128190/profile",
  "Posts": [
    {
      "AuthorID": "pam53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128190/profile",
      "Content": "pam53 wrote: I have my initial consulataion with RO tomorrow.  I was wondering if there were any particular questions worth asking.  I see my MO for the first time next week. One of my dilemmas is--I have a two week cycling vacation planned to leave 9/10.  My breast surgeon advised me to go and have radiation when I return.  If I wait, my treatments will run into when I start my final online course for my doctorate degree.  It is tough because I also work full-time.  How bad is the fatigue?  I work ten hour days, four days a week as a physical therapist so I am on my feet all day.  Does the fatigue only happen toward the end of the treatment and if so how long after treatment was over did you still deal with it? Thanks for your help! Dx 7/7/2011, IDC, <1cm, Stage IA, Grade 1, 0/1 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772181",
      "Title": "RO Consultation--Questions for those who have had Radiation. pam53 stage1"
    },
    {
      "AuthorID": "pam53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128190/profile",
      "Content": "Jul 26, 2011 03:23PM pam53 wrote: Thanks for your input--Shirlann and stage I--I appreciate it.  Hopefully, the RO and the MO will agree it is okay to delay the radiation about a month so I can get my trip in.  Sounds like the best option from what you say.  I may have to see if I can go down to 8 hour days a work, 5 days a week, although keeping my 10 hour days gives me Tues off which might also be good.  Will see what RO says in the morning. I am not looking forward to this but am thankfully, that radiation and hormones will probably be my only treatment.  They are many others who go through much more and my heart goes out to them.",
      "MessageIndex": 3,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772181",
      "Title": "RO Consultation--Questions for those who have had Radiation. pam53 stage1"
    },
    {
      "AuthorID": "pam53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128190/profile",
      "Content": "Jul 4, 2011 05:46AM pam53 wrote: Hi Gracieface, I am in a similar situation.  Microcalcifications resulted in sterotactic core biopsy on 4/19, showed ADH and AHL, had excisional biopsy on 6/29.  Waiting for pahology report.  Have post op appointment on 7/7.  BS not very cooperative with giving results prior to that.  Her PA had said I could call her and she would give me the results via phone earlier if they were available but I called Fri and she is on vacation for a week.  SO--looks like it will be 7/7.  Let me know if you get your results--sending you vibes for benign results.",
      "MessageIndex": 2,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/771053",
      "Title": "Waiting for Excisional Bx results Gracieface Gracieface"
    },
    {
      "AuthorID": "pam53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128190/profile",
      "Content": "Mar 22, 2012 04:50AM pam53 wrote: I had to wait until post op appointment, 8 days later. It was a rough wait.",
      "MessageIndex": 1,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/784443",
      "Title": "Excisional Biopsy - How long before results were in? pf1968 loriio"
    },
    {
      "AuthorID": "pam53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128190/profile",
      "Content": "Nov 2, 2011 09:56PM pam53 wrote: I have 9 more rad treatments to go, but have been on tamoxifen for 6 weeks now.  Didn't have one hot flash.  Do have minor off and on leg soreness but they are not bad and don't last too long.  Congrats on saying goodbye to rads and good luck with the tamoxifen.",
      "MessageIndex": 4,
      "PostDate": "02/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777334",
      "Title": "Finished with Rads today!! tacichon pam53"
    },
    {
      "AuthorID": "pam53",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128190/profile",
      "Content": "Jul 23, 2011 09:48AM pam53 wrote: I was diagnosed on 7/7 following surgical excision on 6/29.  Sentinel node biopsy was on 7/13 and got the results on 7/21.  I am scheduled to see RO on 7/27 and MO on 8/2.  Breast surgeon says I will need radiation and probably hormonal treatments.  I am concerned with having radiation over the left breast.  Has anyone had the prone (lying on your stomach) radiation as I saw mentioned that this might be less harmful to the heart and lungs?  My tumor was deep at the 11:00 axis.",
      "MessageIndex": 9036,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}