{
  "AuthorID": "pamalot",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183440/profile",
  "Posts": [
    {
      "AuthorID": "pamalot",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183440/profile",
      "Content": "Jul 20, 2013 06:57PM pamalot wrote: I live in Orange County, CA",
      "MessageIndex": 18,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "pamalot",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183440/profile",
      "Content": "Jul 20, 2013 01:00PM pamalot wrote: I am scheduled for a single nipple sparing mastectomy with immediate reconstruction on the 29th of July. I am hoping for a double because I have a strong family history of cancer. My sister died of BC 12 years ago and my father died of pAncreatic cancer when he was 68. I am having trouble getting the right authorization from the the doctors. When I told the receptionist in the surgeon's office that this was what I wanted, she told me I would have go ask the plastic surgeon. The plastic surgeon told me it was up to the surgeon. NOW THE SURGEON says I will have to ask the oncologist. For this I must wait for an authorization before I can even make an appointment! I am stressed out and running out of time.",
      "MessageIndex": 16,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "pamalot",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183440/profile",
      "Content": "Jul 25, 2013 07:20PM pamalot wrote: Just a few days left before my mastectomy. I was not able to see the oncologist for at least a month. I've decided to go ahead with the single. Perhaps I can have the 2nd one done when they take out the ad pacer and put in the implant. I will be very fortunate to get this cancer out of me! I need to count my blessings instead of complaining about insurance authorizations. I'm very nervous about this whole thing. Tomorrow will be my last day at work before surrender my breast to surgery. I don't mean to be a drama queen.",
      "MessageIndex": 25,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "pamalot",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183440/profile",
      "Content": "pamalot wrote: 17 days ago I had a mastectomy with immediate reconstruction using an expander. I am still in pain. I am taking hydrocodone which works, but makes me sleep a lot. I am also taking lorazepam for the muscle spasms which helps, but also leaves me drowsy and out of it. My new breast looks good, but it is still very warm and the swelling has still not gone down all the way. I want to drive my car again and get my life back. I am very grateful to have the cancer gone...I just don't know how long I will be in pain. What is normal... I want my brain back! the Dx 6/13/2013, DCIS, <1cm, Stage 0, Grade 3, 0/1 nodes Dx 6/13/2013, DCIS, <1cm, Stage 0, Grade 3 Surgery 7/29/2013 Mastectomy: Left; Reconstruction (left): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809415",
      "Title": "how long will i be in pain? pamalot Cinchud"
    },
    {
      "AuthorID": "pamalot",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183440/profile",
      "Content": "Sep 11, 2013 03:07PM - edited Sep 11, 2013 03:10PM by pamalot Thank you for responding. I saw my PE yesterday and he prescribed gabapentin for the nerve pain. He also said my TE could be causing the arm pain. I chose not to have more saline added this week. I also had a lymph node removed. The gabapentin seems to help so far. At least it did last night. You mentioned nerve damage. Could this be permanent from the mastectomy?",
      "MessageIndex": 3,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/810595",
      "Title": "burning arm pain with expanders wont let up. pamalot cinnamonsmiles"
    },
    {
      "AuthorID": "pamalot",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183440/profile",
      "Content": "pamalot wrote: It has been almost 6 wks since my mastectomy with expanders. I am STILL in pain! Nobody told me how painful this was going to be. My PS refuses to give me more lorazepam...\"Advil should be enough.\" Why does my arm have burning pain and what can I do to make it go away? Dx 6/13/2013, DCIS, <1cm, Stage 0, Grade 3, 0/1 nodes Dx 6/13/2013, DCIS, <1cm, Stage 0, Grade 3 Surgery 7/29/2013 Mastectomy: Left; Reconstruction (left): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/810595",
      "Title": "burning arm pain with expanders wont let up. pamalot cinnamonsmiles"
    }
  ]
}