{
  "AuthorID": "PamB_in_GA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79132/profile",
  "Posts": [
    {
      "AuthorID": "PamB_in_GA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79132/profile",
      "Content": "Feb 10, 2009 06:57PM PamB_in_GA wrote: Hello to all my rad buddies!  I had my first treatment today of 33.  Yeah, 32 to go!  I was on the  table about 20 minutes today.  They told me that it would be a lot shorter tomorrow.  Something about taking pictures (or x-rays) as they were going today. I wish they had turned up the music so that I could have listened to something besides that machine humming. I will take my MP3 player tomorrow and listen to some good praise and worship songs.  That should make everything go by faster!  My breast feels hot tonight like I went to a tanning bed.  Hope that doesn't mean that I am going to blister!  I am very fair-skinned but was told that didn't really matter.  Does anyone know anything about skin types and how this affects everyone? I am so thankful that I found this website and could read all this information!  I have gotten more from this discussion board than all the material they gave me. Thanks, ladies, and I pray that each one does well as we journey along on this trip!",
      "MessageIndex": 136,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "PamB_in_GA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79132/profile",
      "Content": "Feb 8, 2009 05:32PM PamB_in_GA wrote: Thanks, Lories!  I will check out Jean's radiation cream on line and will ask rad. onc. Tuesday about it also! Talk with you soon!",
      "MessageIndex": 103,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "PamB_in_GA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79132/profile",
      "Content": "Feb 8, 2009 05:04PM PamB_in_GA wrote: Hi, Lories! I was diagnosed on Jan. 4th, 2009; had lumpectomy on Jan. 22nd; and had simulation done Feb. 3rd.  I go for my first rad treatment on Feb. 10th.  I have 33 treatments scheduled and I am very nervous about the first treatment! I have been reading through the breastcancer.org site for months but just came across the discussion boards and chat rooms.  I really want to discuss this with someone who  is going through it now.   Family and friends have been great but no one has ever had breast cancer before and they can't really understand all my anxieties or questions. I have read through all the posts and have gained so much info.  Thanks for all the great ideas! I was told not to use creams or lotions also but it looks like that would be a preventative measure to use and not blister so much.  Any suggestions as to the best cream to use??? Hope to hear from you soon.",
      "MessageIndex": 100,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    }
  ]
}