{
  "AuthorID": "pamchapdela…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206147/profile",
  "Posts": [{
    "AuthorID": "pamchapdela…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206147/profile",
    "Content": "Oct 8, 2014 07:14AM pamchapdelaine wrote: I had a bi-lateral mastectomy on Sept. 2, 2014 and the PS put in breast expanders at the same time and in addition, I had both breasts reduced.  On the left side they removed 2 layers of lymph nodes (27 total)  I am extremely swollen and it feels like I have a baseball under my left arm.  I have been very worried about it but the PS and the BS both say I am looking really good.  I also have had tons of pain in my back and under my left breast in the ribs. (I have been doing my stretches, but last night I had a meltdown.)  I just am tired of the pain, swelling and lack of energy (Yes I am type A) I just want to wake up in the morning without literally dragging myself out of bed and feel good again.  Yesterday my left arm hurt so bad if felt like I was having a heart attack.  BTW I did have drains on both sides.  The one with the lymphs removed I had 2 drains.  All of them were removed about 10 days after surgery but again I still have a lot of swelling.  My left breast looks like a D size and my right breast looks like a B.  I called my niece last night who also had a bilateral mastectomy (while she was pregnant) and she did say that she was very surprised at the amount of pain and swelling she had and there were days where she had meltdowns but She said it does go away but can take months. (eeeeks, not looking forward to months of this swelling and pain)  Maybe it's like having a baby and after this is over we won't remember the pain. She also told me that if I felt like there was something that was not right, I am probably right and to not be embarrassed by talking to the doc about it.  Wishing you the very best and a quick recovery.",
    "MessageIndex": 1,
    "PostDate": "08/10/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/825058",
    "Title": "swelling hzzr pamchapdelaine"
  }]
}