{
  "AuthorID": "pameliza",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
  "Posts": [
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "pameliza wrote: I have had 5 surgeries since Nov 2007 and feel like this last one in January really knocked the wind out of me.  I had a TRAM revision and a mastoplexy on the other side at a outpatient clinic. After the 2 1/2 hour surgery I couldn't get my oxygen levels up during recovery and my blood pressure was very high.  After a few hours they let me go home and 4 hours later I was in the emergency room because it was hard to breathe and my voice just disappeared. My PS met me at the hospital and kept evading the fact that it might have something to do with the anesthesia.  It so happens that his wife was the Nurse anestheiologist.  I still feel very foggy in the head and unsure of myself.  My blood pressure won't regulate and my right eye keeps twitching.  One of the recovery nurses mentioned that during the surgery I kept showing signs of pain and distress so they kept giving more pain medicine.  My oncologist thought that I wasn't in a deep enough sleep.  Anybody had a similar experience?  I have to have a TUG flap in 2 months to fix what this PS did and didn't do in addition to it all.  Now I am scared of going under - especially for the 8 hour surgery that the TUG involves.  Any suggestions?? Pam Dx 10/30/2007, IDC, 1cm, Stage IB, Grade 3, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730683",
      "Title": "Anyone had anesthesia complications? pameliza pameliza"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "Mar 16, 2009 10:11PM pameliza wrote: Thank you all for sharing your experiences. You have all endured some difficult situations - how scary! The anesthesia part of this journey was something that I never paid much attention to and just assumed it was never anything to be concerned about.  Now I know it is!  I will have my new PS who will be doing the TUG flap obtain all the previous surgery records so he knows what they gave me. Thank you again for your stories.  God bless! Pam",
      "MessageIndex": 6,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730683",
      "Title": "Anyone had anesthesia complications? pameliza pameliza"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "Mar 29, 2009 12:58AM pameliza wrote: Hi Sandy, I had a unilateral pedicle tram in January 2008.  I don't remember having any swelling in my abdomen that long after the surgery.  In fact, my stomach seemed very flat because of the \"tummy tuck\" we get as a benefit of the tram.  I remember having to stay bent over for a week or so afterward so the mesh that was put in didn't stretch.  That was a major surgery so it isn't unusual for you to feel exhausted.  It can takeat least a few months to start feeling somewhat energetic again.  Make sure that you do the arm excercises they should have given you to do so your muscles don't stiffen.  If that happens it's hard to be reversed.  My biggest disappointment with my tram was the tissue necrosis (tissue death) that I developed. Nearly 50% of that breast failed.  I have since had a revision that was to try and remove some of it but that failed as well.  I now will have to have a TUG flap (thigh tissue transfer) if I want to keep a tissue breast to match my other. My situation supposedly doesn't happen very often. Like you, I haven't had the best communication with my PS.  After this last surgery I decided to get a different one and now feel more confident with this guy. I understand how you feel about the on going worry of the cancer coming back and then to have the added confusion and worry about the reconstruction part.  After all the treatments for the cancer I guess I thought this reconstruction phase would be the \"easier\" part.  I am 53 and also very active.  As soon as I could I would try and walk everyday to build up my stamina. I kayak alot and was able to paddle as before 5 months after the surgery and didn't notice a big difference in my strength.  I tired a little easier but I was also still receiving Herceptin every 3 weeks.  Try to keep a positive attitude and continue doing the things you love to do.  As far hernia bulges, it is my understanding that you should always be careful lifting real heavy objects, just to be safe. If your PS isn't giving you the answers you need and don't feel that you are healing as you should I would definately seek the opion of someone else.  You need that peace of mind.   Take care of yourself and don't push too hard.  It does get better over time.  Wishing you well - Pam",
      "MessageIndex": 1,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731542",
      "Title": "Pedicle Tram Flap Recovery - Help! sandy2009 Nissi"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "Jan 9, 2010 02:59AM pameliza wrote: Thanks for your reply.  I have a breast surgeon that isnt very responsive to my concerns which is why I wanted to get advice at this forum before approaching him if I need to.  He has already told me that there was no way I could ever get cancer in the reconstructed breast because there isn't any breast tissue there now.  He also said I was basically \"cured\" since it didn't get in to my nodes and I had Taxol and Herceptin. I appreciate your advice so I can feel confident that IBC is a possiblility and if anything I need that peace of mind that it isn't that.  Thanks again!  Pam",
      "MessageIndex": 2,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746436",
      "Title": "Worried this could be IBC pameliza pameliza"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "pameliza wrote: Hi, I am hoping someone could offer any info they have about IBC. I had a TRAM flap failure after my mastectomy in 2008.  Last Spring I had a TUG reconstruction to replace it.  Two days ago a rash appeared in the center of my breast. In one day the breast has swollen and flattened my new nipple. Some of the red areas have the dimpling appearance I have read about with IBC. It is strange that the skin grafted area from the reconstruction isn't red, just the original breast skin. My PS is putting me on Keflex for 7 days to see if it clears up. I am really scared that this is inflammatory breast cancer. In 2007 I was diagnosed with IDC stage 1b -  ER/PR Positive and HER2 positive. The 1cm. tumor was close to my chest wall.   Any information would be greatly appreciated. Thank you! Pameliza Dx 10/30/2007, IDC, 1cm, Stage IB, Grade 3, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746436",
      "Title": "Worried this could be IBC pameliza pameliza"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "Apr 2, 2009 03:02AM pameliza wrote: Hi Linda, I also had a re-excision to get clean margins.  Unfortunately, they still weren't good enough so I had a mastectomy rather than go for a third attempt.  Like you, I also had a Grade 3 tumor so wanted to be sure there wasn't anything left behind. Peace of mind is extremely important - I think you made a good decision!   Pam",
      "MessageIndex": 3,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731783",
      "Title": "Re-excision LRM216 cw89134"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "Apr 3, 2009 02:10AM pameliza wrote: I wanted to add that after having the second re-excision and not getting clean margins I opted for the mastectomy even though my breast surgeon felt very comfortable that the third surgery would clean it up.  I am glad I went with the mastectomy because the biopsy of my breast tissue showed DCIS in three quadrants.  So, you never know.  It's good you're asking questions so you can make a confident decision that feels right for you. I wish you the best.  Take care - Pam",
      "MessageIndex": 15,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731783",
      "Title": "Re-excision LRM216 cw89134"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "Oct 6, 2010 10:35AM pameliza wrote: I am 55 and thought to be post menopausal until I started producing estrogen again a year ago. I just had my tubes and ovaries removed September 1 due to family history and symptoms.  It was done laproscopically since my uterus had been removed in 1996.  I had an ultrasound that showed suspicious areas and like you, I was very scared. During the surgery it was discovered that one of the ovaries had twisted around and attached itself to the small intestine.  That complicated things, however, it all turned out good. No cancer. I do have light night sweats and sometimes have trouble sleeping.  Hopefully, that will change soon.  Prior to the surgery I had alot of bloating and breast tenderness and that is now gone.   I feel good now and I am really glad I made the decision to have the surgery..  No more hormone issues and alot of peace of mind.  I hope all goes well for you.  ",
      "MessageIndex": 5,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758771",
      "Title": "Oophroectomy (sp) Tabatha00 Alyad"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "pameliza wrote: Hi! I had surgery 2 1/2 weeks ago to remove fat necrosis in my TRAM reconstructed breast along with nipple revisions and a lift on the \"good\" breast.  I've had alot of complications and hoped that someone might have some advice for me. It started out that I lost alot of blood during the 3 hour surgery so that was a concern. I had a hard time coming to in the recovery room and my oxygen levels wouldn't stay up. The surgery was done as outpatient so I was home the same evening.  After being home a few hours I completely lost my voice - nothing!  I could breathe in (which made me cough) but didn't have enough air to talk.  It was scary.  My husband called my PS and he met us in the Emergency room.  They did some tests and said they didn't know why this happened. It was like a vocal paralysis.  It took nearly 3 days for my voice to come back. Then, on the second day I developed an infection in the reconcstructed breast.  It was VERY swollen and VERY red.  The PS didn't use drains for some reason.  I took Penicillin for 3 days and it seemed to fix it.  However, the swelling continued.  Then, after 2 weeks my breast literally burst!  Blood and clots poured out of my nipple for about an hour.  I called my PS and he said to let it \"drain\" and it should be okay as long as I don't run a fever.  He said I probably had a hematoma or a seratoma?  This heavy bleeding with clots continued for 3 days and now it is still bleeding lightly.  I saw the PS yesterday and he said it should stop soon and come see him in 3 weeks.  Is this normal??  I am so upset!  He doesn't seem to care how this bothers me! Dx 10/30/2007, IDC, 1cm, Stage IB, Grade 3, 0/4 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728212",
      "Title": "Complications after TRAM revision - Help! pameliza Kathy_K"
    },
    {
      "AuthorID": "pameliza",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76117/profile",
      "Content": "Jan 31, 2009 01:26AM pameliza wrote: Thanks for the support!  Sometimes I feel alone with all of these unknowns . I found out that I am anemic so that surely isn't helping how I feel.  I had my Herceptin infusion a week after the surgery to add to it all.  Anyway, I am sure all will work out.  The bleeding is less today.  D - I had the TRAM a year ago and everything went great with the exception of the necrosis.  It developed on the outer side of the breast and spread underneath.  I would say it comprised 25% of the breast.  He removed most of the dead tissue but did have to leave some that was attached to the skin.  The pathology report said it was \"inflamed\" so I guess it's a good thing it was removed. I can't tell yet how it's going to turn out but I'll keep you posted! Thanks to all for the replies! Pam",
      "MessageIndex": 4,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728212",
      "Title": "Complications after TRAM revision - Help! pameliza Kathy_K"
    }
  ]
}