{
  "AuthorID": "Pangie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245147/profile",
  "Posts": [
    {
      "AuthorID": "Pangie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245147/profile",
      "Content": "Pangie wrote: I have a large lump in my right breast. Friday, I had an mri and sonogram. I consulted with doctor, who feelscertain it's cancer. Lump is huge and jagged, and it looks evil. I had a lump biopsy and a biopsy on a swollen lymph gland. Biopsy results should be in tomorrow or Wednesday. I'm scared, and have had panic attacks. I've probably slept 4 hours since Friday. With every ache or twinge, I imagine it is spreading cancer. My stomach is in knots and I can barely eat. My husband means well, but he is treating me like I'm dying. How do you cope? Do you take anything for anxiety? I just don't see how I can make it through this. BTW, I have learned so much from this website, it's been a true blessing. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/851725",
      "Title": "waiting on biopsy results, Dr. is sure it's cancer Pangie JadB2016"
    },
    {
      "AuthorID": "Pangie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245147/profile",
      "Content": "Jan 9, 2017 02:59PM Pangie wrote: Doctor office called and said the biopsy results should be in tomorrow. I have an appointment with the doctor on Wednesday. The office scheduled me for baseline scans at that time also. At least, they move fast. Reading all of your stories, it's amazing all the crap that is thrown our way. Your perseverance is inspiring. I will call tomorrow and ask for some meds for anxiety.",
      "MessageIndex": 6,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/851725",
      "Title": "waiting on biopsy results, Dr. is sure it's cancer Pangie JadB2016"
    },
    {
      "AuthorID": "Pangie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245147/profile",
      "Content": "Jan 9, 2017 07:19AM Pangie wrote: Thanks for your kind and wise replies. I'm keeping busy at work today, so that helps somewhat. Nights are the worst.",
      "MessageIndex": 3,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/851725",
      "Title": "waiting on biopsy results, Dr. is sure it's cancer Pangie JadB2016"
    },
    {
      "AuthorID": "Pangie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245147/profile",
      "Content": "Jan 14, 2017 03:33PM - edited Jan 14, 2017 03:39PM by Pangie Hi everyone, I was diagnosed on Tuesday and had ct scan on Wednesday. I'm having chemo first, followed by a lumpectomy or mastectomy. I will have my bone scan and an electrocardiogram on Monday. Then, meet with the oncologist. They want me to begin chemo the following week. So, I think I will begin chemo in January. Honestly, I am scared to death. I'm triple negative also. I'm not researching too much on triple negative. I know enough to realize it's bad. My sweet husband is being my advocate, which I truly need right now. I wish each of you a successful, painless as possible journey and may we all live to be 100. Oh Div, I'm so sorry for the ordeal you are going through.",
      "MessageIndex": 229,
      "PostDate": "14/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    }
  ]
}