{
  "AuthorID": "partyofsix",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133358/profile",
  "Posts": [
    {
      "AuthorID": "partyofsix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133358/profile",
      "Content": "partyofsix wrote: Hi!  I found this community last night and am hoping that someone out there may have some experience and be able to assist in deciphering my information. I am 41 and found a lump in my right breast.  I went to the dr, they sent me the next day for a mammogram and us. The mammogram didn't show too much other than a mass, but the ultrasound report says \"Color flow, real-time and 3D rendering with interpretation of image post-processing ultrasound were performed on the right breast. Gray scale images of the realtime examination were reviewed. There is a 1.2 cm x 0.7 cm x 2.2 cm oval mass with a lobulated margin in the right breast at 10 o''clock middle depth. This oval mass is hypoechoic with posterior acoustic enhancement. This correlates as palpated.\"  From those results, they sent me to a surgeon two days later (that was yesterday). When the surgeon was feeling it, she said \"OH\" and told me to get dressed. After she came back in the room, she said that the lump is \"very suspecious\" and that she wants to have a 4D MRI done as soon as I start my period. Of course, I just had it last week so now I have to wait about two more weeks. She said that she didn't want to go in to biopsy it until she knows more about it - she said she didn't want to mess with it yet becuase there may be more going on in there. When I orginally made the appointment, they told me that 8 out of 10 times they would aspirate it in the office and then if I wanted, schedule me for removal. Now that she wants a more detailed study (4D MRI), I don't know what to think. Between that, her saying \"OH\" when she was feeling it and then saying it is \"very suspecious\", I just feel like I need to know more and two weeks for the MRI and then a week later for the results is so, so far away. What does all that mean? I am at a loss and don't understand medical terminology enough to decifier it. Also, this past week my breast has felt very warm and I have had an achiness in my right arm for a couple of months now. (It may be totally unrelated, but now I am analyzing everything that has been going on in my body- lol!) What do you think this is? Should I be freaking out like I am? Do you think from reading this you think it may be breast cancer? Or, do you think it may be just a cyst? I don't know where else to turn or who else I can ask. Can anyone offer me any advice? I would totally appreciate it...   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772413",
      "Title": "Help Please - hypoechoic with posterior acoustic enhancement partyofsix nlm"
    },
    {
      "AuthorID": "partyofsix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133358/profile",
      "Content": "Jul 30, 2011 10:31PM partyofsix wrote:",
      "MessageIndex": 3,
      "PostDate": "30/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772413",
      "Title": "Help Please - hypoechoic with posterior acoustic enhancement partyofsix nlm"
    },
    {
      "AuthorID": "partyofsix",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133358/profile",
      "Content": "Aug 1, 2011 12:50AM partyofsix wrote: Thanks everyone!  I am going to call the doctor tomorrow to ask for something for the anxiety while I am waiting.  I don't like not knowing and have spent the week-end either frustrated or crying. ",
      "MessageIndex": 7,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772413",
      "Title": "Help Please - hypoechoic with posterior acoustic enhancement partyofsix nlm"
    }
  ]
}