{
  "AuthorID": "pashari",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76329/profile",
  "Posts": [{
    "AuthorID": "pashari",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76329/profile",
    "Content": "pashari wrote: I had the mamo & u/s last Thursday.  Results should have been ready on Friday per the hospital/tech.  My OB/GYN is just the \"we'll call you when we get them\" type and I can't wait like that so I call directly to medical records.   I call on Friday and they are not ready yet.  I go on Monday and they say that they are still not ready.  I go today, and they say they are still not ready.  So I finally go to the radiology desk and ask what is taking so long.  They say they are waiting on prior films.  I tell them that there are no prior films for comparison so they say they will be read and transcribed and the report will be ready this afternoon.  I go back this afternoon and it's still not ready.  Some lady in the transcription room comes and says they have been read but not transcribed but it would be about 10 minutes.  Then someone in scrubs comes and asks \"do you need these to take to a surgeon?\"  I said \"no\".  She asks what am I going to do with them and I said I will read the reports and then discuss them with my doctor.  She says you've been thru this before and you know that nothing is certain without a biopsy and I said yes, I know and I'm not going to freak on you I just want my report.  I wait another 45 minutes and some guy in a tie comes and says that they can't give them to me.  They will fax them to my doctor in the morning. Those are my records.  I am so pissed that the transcription people and even the receptionist at the radiology dept knows more about my breast than I do right now.  I know there is a lump.  I know that it may be bc.  I know that nothing is certain without a pathology.  But what I want to know is how large is it?  Is there just one?  Are there calcifications?  I'm not an idiot and I hate being treated like I can't handle the news.  Who are they trying to protect???  Just give me my darn records.  ARGGGGGGHHHHH!!!!!!! hugs - lisa Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "23/12/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/726304",
    "Title": "This waiting is insane..... pashari buffy"
  }]
}