{
  "AuthorID": "patchingpeg…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242080/profile",
  "Posts": [
    {
      "AuthorID": "patchingpeg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242080/profile",
      "Content": "Nov 5, 2016 11:50AM patchingpeg wrote: Hi, all - this is my first post. Diagnosed a few weeks ago after 23 years cancer-free. I am still reeling a bit but your comments and support and all the information have been enormously helpful!",
      "MessageIndex": 262,
      "PostDate": "05/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "patchingpeg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242080/profile",
      "Content": "Jan 13, 2017 10:31AM patchingpeg wrote: Hi, all - glad to join! I was really active for the first half of 2016 after years of taking it all for granted. Then July was crazy - back once again to full-time work and cancer diagnosis all if a few short weeks. Then I had thoracic surgery in Sept to remove a hot lymph node under my sternum. I am still recovering from that surgery - sneezing brings tears to my eyes. So, Z and all of you have inspired me. I got really good PET scan results the other day and know that the time is now. That being said, right now, we are getting in the car to go 350+ miles to visit my sister in Baltimore. I hope to work this year of flexibility, weight management, and stamina. Kudo all around! ",
      "MessageIndex": 79,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "patchingpeg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242080/profile",
      "Content": "Nov 14, 2016 01:36PM - edited Nov 14, 2016 04:02PM by patchingpeg Thank you, thank you, thank you! What a resource!! I suggested it to another member on a different thread. What a body of work and how kind of you to share your time and talents in this way! I mentioned on the Ibrance thread that I am comforted and confident with more information. I also mentioned that I am trying to recreate - 23 years later - all that helped me cope well. One of thing that I really relied on was a local support group. So, I found a new one and signed up for a meeting. I didn't go. In the eight weeks since my diagnosis, I have had to counsel several survivors and the friends & family of survivors in regard to how this could happen. I was the poster child (well, old lady) for survivorship! My MO actually said to me - 'what sucks about this Peg is that you are now going to have to support all the people who are falling about because YOU have cancer!' I just couldn't go to that support group and see the fear reflected on the \"young\" survivors. Even though I am really doing well!!! Anyway, this group has already helped so very much! Anne, your document is so valuable and very much appreciated!",
      "MessageIndex": 66,
      "PostDate": "14/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831507",
      "Title": "Request a Free MBC Guide about Treatments, SE's, and more...\" Bestbird SandiBeach57"
    }
  ]
}