{
  "AuthorID": "PatinMN",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
  "Posts": [
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jun 20, 2014 05:58AM PatinMN wrote: Thanks for the links!  Now I understand what a topper is...although I'm still not quite clear on how those clippies attach it to your hair.  ",
      "MessageIndex": 53,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jun 11, 2014 12:06PM PatinMN wrote: Warrior Woman - I would go ahead and cut it if I were you.  Since you are shedding only minimally, I don't see what harm it could do.  I actually colored my hair at about 7 weeks PFC (using a color product without ammonia or peroxide) and had it trimmed at about the same time.  I was not shedding - I think I would have waited had I been shedding.  I think the PCC instructions are overly cautious in some regards.",
      "MessageIndex": 33,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jan 23, 2015 10:43AM PatinMN wrote: Hopeful - so interesting that you are getting treatment with Femara before surgery or chemo.  Is it a trial?  I've never heard of this option before.",
      "MessageIndex": 151,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jul 16, 2015 08:12PM PatinMN wrote: pch - I used Clairol Beautiful Collection at about 7 weeks. I had my regular salon color person apply it and didn't sit under the dryer as the product suggests. I was not shedding at all. If you're not shedding (or not much) I wouldn't worry about using color at 3 months.",
      "MessageIndex": 405,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Apr 20, 2015 02:23PM PatinMN wrote: Kim, no, I have dark brown hair. (Well, I used to before it got gray.). The fade-out from the Clairol Beautiful dark brown color was definitely greenish.",
      "MessageIndex": 291,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jun 17, 2014 06:21PM PatinMN wrote: I can't quite figure out what a topper is, but you look great, One Texas Day.   For color, I used the Clairol Beautiful Collection twice (applied at the salon I usually go to).  I have dark brown hair with very white roots.  The first time I was afraid to use heat as directed, and it didn't do too well on the roots.  But it did help!  Second time we did the heat and it colored much better.  However as it washed out it got a greenish tint, and we had the devil of a time getting my hair back to normal.  I had sort of tri-color hair for a while.  Another problem with the Clairol was that it dripped color when I sweat.  Ruined a few t-shirts at the gym, and discolored nightgowns and pillowcases.  I would definitely go with the Redkin product.",
      "MessageIndex": 48,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jan 24, 2015 04:43AM PatinMN wrote: Hopeful - sounds like you are on the cutting edge. Great results so far!",
      "MessageIndex": 159,
      "PostDate": "24/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Apr 18, 2015 04:10PM PatinMN wrote: Kim, I colored at about 7 weeks PFC with a no ammonia, no peroxide color. Clairol Beautiful - but I don't recommend that particular brand. DaniellaD had a better suggestion I think - maybe send her a message. Anyway, I was not shedding and Colormark was barely making a dent in my gray roots so I went ahead with a color. My regular salon color person applied it. The directions call for heat but I was afraid to sit under the dryer so I didn't that first time. About 4 weeks later i used the same color again but this time sat under the dryer and it turned out better. As it faded it turned greenish. Also, it dripped color when my head sweat at the gym. After using Clairol Beautiful twice I went back to my usual salon color. Are you shedding? I don't recall anyone posting that their shedding had restarted after coloring. Good luck whatever you decide.",
      "MessageIndex": 289,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Nov 7, 2012 04:33AM PatinMN wrote: Kentuckywonderwoman, my diagnosis is similar to yours. I am getting weekly taxol + Herceptin, for 12 weeks. Then continuing on with Herceptin for the balance of a year, as per usual practice. The other possibility was taxotere + cytoxin, every 3 weeks for 4 treatments. My oncologist recommended the weekly taxol, although I am his first to use this treatment regimen. His oncology \"idol\", at Harvard, uses weekly taxol successfully in my situation. I was told that weekly taxol is less harsh although just as effective, and I can say that I have had very few side effects through 7 treatments. I am using cold caps to save my hair, and I'm so happy I found out about cold caps before starting treatment! The cold caps work well with either chemo regimen. Taxotere can cause permanent hair loss in a small percentage of people. Good luck with your decision.",
      "MessageIndex": 6,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795706",
      "Title": "Starting Chemo Nov. 2012 Angel67 michellej1980"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Mar 27, 2019 09:52PM PatinMN wrote: Iloveminnie2, I used Penguin cold caps back in 2012. Penguin recommends not coloring for several months after chemo, and then they suggest a mild color product with no ammonia and no ...well, I forget what else. I had weekly taxol/Herceptin and barely lost any hair; I was not shedding after chemo and I had very long gray roots, so I had my salon color person use a color product on my hair - Clairol Beautiful - at 7 weeks. (I think there are other, better products out there that satisfy Penguin's recommendations, but don't know names.) I saw no ill effects, and used that product again four weeks later. After that my salon person went back to the usual salon color. As for trimming, I think I got a trim at about 10 weeks PFC or so. I think the most important thing for coloring is to wait until your shedding slows down or stops. Here is what the Rapunzel Project website says about coloring: \"Coloring hair is not recommended until 3 months after chemo is finished, because the follicles still need time to recover from the trauma of chemo.\"",
      "MessageIndex": 26578,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jul 30, 2013 11:34PM PatinMN wrote: Beedunn, most lumps turn out to be benign, and hopefully yours will turn out to be an infected milk duct or something. Do you have to wait long for the ultrasound? Wishing you calm while you wait. Please try not to worry too much!",
      "MessageIndex": 1,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808575",
      "Title": "I'm 27 and found a lump in my right breast! I am so SCARED :'( beedunn Beesie"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jun 1, 2013 03:15PM PatinMN wrote: Chattipatti, the new lump where they did the procedure might be a seroma (collection of blood). I had a big one as a result of my biopsy, which they removed during my lumpectomy. time between diagnosis and surgery varies widely. Some do chemo before surgery. I got my diagnosis July 13 and had surgery August 1. You will have multiple doctor appointments coming up where they will discuss your options with you. Bring a friend or family member with you if possible and be prepared to ask lots of questions and take notes. This is such a scary time but you will get through it!",
      "MessageIndex": 18,
      "PostDate": "01/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805513",
      "Title": "just found out today im scared chattipatti chattipatti"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Jul 28, 2013 09:47AM PatinMN wrote: Jenny, I had a hard time deciding whether or not to do chemo, but for very different reasons. My invasive tumor was small (5mm) but I am Her2+. Herceptin is recommended for tumor size 6mm or larger. However, when my oncologist brought up the statistical charts on his computer, I had a 25% chance of recurrence without Herceptin. And you don't get Herceptin without chemo. So I went ahead and am glad I did. I used cold caps to save my hair, and when I found out that was possible it made the decision more palatable. I hope your symphony test results will help you make the decision. I agree it would be a good idea to find a new oncologist who can help you make your decision with the data that's available to doctors - my oncologist was reallyngreat about that. Good luck.",
      "MessageIndex": 1,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/808036",
      "Title": "Young & trying to figure out if I need chemo jennyschu crazyride43"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Feb 6, 2013 07:19PM PatinMN wrote: mermaid, I'm so sorry about the attitude/manner of the new doctor.  Are you stuck with her?  Could you ask the nurses who they like or would recommend?  When I was first starting on this path, I chose my surgeon and oncologist because of what nurses said about them.  They didn't come right out and say \"choose this one\", but I could tell by the way they described them that they favored them, and I have been very happy with my choices.  (Well, except for the fact that my oncologist only tolerates cold caps and refuses to even mention the possibility of using them to his patients!  I found out about them on my own.)  If you stick with this one, I hope you find that today was an aberration and that she really is more caring and patient-friendly.  {{{{hugs}}}} to you.",
      "MessageIndex": 4,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/800025",
      "Title": "Eribulin and ice caps mermaid_1010 dmcloug"
    },
    {
      "AuthorID": "PatinMN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161926/profile",
      "Content": "Feb 5, 2013 11:12PM - edited Feb 5, 2013 11:25PM by PatinMN Mermaid, when I was looking into cold caps, and continuing when I started with them, I read through the entire cold caps thread on these boards. It took me about 3 weeks to read the whole thing. I don't remember anyone using Eribulin who posted on the cold cap board, and in fact I haven't even heard of Eribulin. does it have another name? If it were me, I would continue with the cold caps whatever chemo I was getting. Good luck Edited to say I just did a quick search on Eribulin and it does have another name, but I didn't recognize that name either. !",
      "MessageIndex": 1,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/800025",
      "Title": "Eribulin and ice caps mermaid_1010 dmcloug"
    }
  ]
}