{
  "AuthorID": "patricia_d",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
  "Posts": [
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 11, 2012 05:08PM patricia_d wrote: Congrats on getting the drain tubes out. ",
      "MessageIndex": 691,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 8, 2012 10:02AM patricia_d wrote: Dobie, Thank you so much for your words of encouragement.  It is very helpful to have friends to share your anxieties and fears with.  I have my first post operative oncology appt next week and I guess I will be getting started on my chemo.  Praying I don't suffer with any/all of the side effects I see that one can go through with this type of treatment.  What I wouldn't give for a good night's sleep.  Feels like I am wearing an iron breastplate.  Hope it gets better with time.  Have you been able to drive yet?  I would love to just drive around my neighborhood, no highway driving, just near home.  Maybe I'll start with a walk around the neighborhood.  My hubby is a little anxious about me going out alone yet.",
      "MessageIndex": 626,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 8, 2012 10:18AM patricia_d wrote: 2 FriedEggs, That name is very descriptive of how you feel when you go from a C cup to AA's.  AA's is how I got started with breast development a long time ago, so I guess everything comes full circle going through this thing called life.  Next week will be my first week at home without company full time.  My hubby stayed with me the first two weeks, and my sis has been with me this week.  She is amazed at my mobility and determination not to let this setback get the best of me.  Her encouragement and love have really helped me to get ready for my solo week next week.  I am living for the day when I can flip flop all over the bed like I used to without much discomfort.  I got tired of how far down the drugs make me go, so I take Advil a few times a day, after breakfast in the AM, early evening and before bed.  Usually holds me, although sometimes I need a little extra.  My heating pad helps soothe me too.  I had a bout with pain while in the hospital, and the nurses gave me heat packs, so I figure the heating pad is just as good.  Thank you for responding to my post.  Let's keep in touch.",
      "MessageIndex": 627,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 8, 2012 06:45PM patricia_d wrote: Dobie, When the pain became unbearable right after recovery room, the nurses had some kind of pouch that they just snapped and put them in the area of my drain entries.  It made me feel much better.  I just have a regular heating pad that cuts itself off after 30 minutes, just enough time for my \"nightcap\" of Advil to kick in and lull me to sleep.  I sleep in my bed, but hubby has moved down the hall since I move around so much at night and he does have to get up early for work in the AM.  I prop pillows all around me and sleep in 2-3 hour stretches.  My TE's are very uncomfortable.  It's like wearing a hard under wire bra. Well I' getting ready for bed.  Have a good night and talk to you soon.",
      "MessageIndex": 646,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 20, 2012 04:57AM patricia_d wrote: Hello everyone, Had my first appt with oncologist and am on my way to starting chemo after a battery of blood tests and a plethora of information.  I was overwhelmed by some of the info I received.  Not looking forward to the port that will be put in my chest in order to receive the chemo dosage.  Have 4 sessions of one type of cancer med (don't remember the name of it and too lazy to look at my notes) and 4 additional sessions of another type of med.  Looking forward (ha) to losing my hair and I am a prime candidate for nausea since I threw up almost the whole time I was pregnant 40+ years ago.  I also will have to give myself a shot in my stomach every day to encourage my red blood cells to keep on doing what they are doing.  On my way to get a bone scan today and an echo cardiogram tomorrow.  Had my second injection of saline this week, and PS found excess fluid in my breast that he removed with a minor procedure (small incision and 4 stitches afterward).  Things just keep getting better, don't they :-}.  Well this is my latest update, but believe it or not I am sleeping a bit better - 3-4 hour stretches instead of 1-2 hours.  I am happy for the small improvements and looking forward to some major ones.  God bless us all!",
      "MessageIndex": 771,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 4, 2012 01:26PM patricia_d wrote: Hello everyone.  I am a repeat cancer survivor having had a lumpectomy in Nov 2010, and a recurrence of cancer in the opposite breast April 2012.  I was devastated.  I had done very well with my first cancer bout, so much so that I had to remind myself that I had cancer.  This time around, I feel the full impact of the disease.  Had a bilateral mastectomy May 18th and my recovery is coming along, but this is the hardest road I have ever traveled.  The drainage tubes were the worst.  They came out in 13 days, but during that time I got very little sleep.  I have tissue expanders and I got the first saline injection the same day the tubes came out.  I went from one discomfort to another.  Feels like two bowling balls are resting on my chest and I still have twinges of pain in the sites where the tubes went in.  How long does it take to start feeling like myself again?  I cry at the least little thing.  I am blessed to have lots of support from family, church and friends and I know they all love me and wish me well, but in the middle of the night when I am trying to find a comfortable spot to sleep or when I shower and look at what's left of my breasts I have to concentrate very hard on the blessings that I do have.  Sounds real selfish, huh?  Just need to get some things off my chest with others that can not only sympathize, but empathize as well.",
      "MessageIndex": 580,
      "PostDate": "04/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 8, 2012 10:29AM patricia_d wrote: Hi Hikergal, Thanks for responding to my post.  Looks like we are close to the same stage of recovery, although I still have soreness at the sites where the PS took out the drainage tubes (Thank God! Not for the soreness, but that the tubes are gone.) I am feeling a bit of cabin fever.  Need to get out to more than dr. appts.  Missing my grandson's baseball games.  There's always next season and I pray that I will be kicking high by this time next year.  That my chemo will be over and my implants will be in place.  Speaking of the implants, does the PS use the same incision sights to place the implants as was used to place the TEs.  I know I'm ahead of myself, but just curious.  Whoever thought of this web site was right on.  Talking with \"soulmates IS quite therapeutic.  Looking forward to hearing about your progress.",
      "MessageIndex": 628,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 20, 2012 04:46AM patricia_d wrote: Dear Determined Fighter, You and I live in the same neck of the woods.  I am in Clinton, MD.  I am so sorry to hear of your complications after your surgery.  I had my surgery on May 18, and you make me ashamed of the discomfort I thought I was going through.  It was no where near as devestating as what you have gone through.  I am glad that you are feeling better now.  Hang in there and believe me, it gets better S-L-O-W-L-Y. Patricia_d",
      "MessageIndex": 770,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "patricia_d",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153368/profile",
      "Content": "Jun 8, 2012 10:40AM patricia_d wrote: Hi Markat Thanks for responding to my post.  I want to go outside so badly to something other than dr. appt's.  We had a trip planned pre surgery and I am wondering if I am up for the trip.  Not a long trip just 3-4 hours away.  I don't have to decide until 6/15.  The trip is to the Hampton, VA Jazz festival and I think that if things get to be too much for me I can always go back to the hotel room and lie down.  I'll be sure to take my pain meds and plenty of reading material with me.  What do you think?  MY hubby is looking forward to it, but I'm sure he will understand if I don't feel up to it.  One week can make a difference in the way we feel. I'll let you know how it turns out. ",
      "MessageIndex": 629,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    }
  ]
}