{
  "AuthorID": "PatsyC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8119/profile",
  "Posts": [
    {
      "AuthorID": "PatsyC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8119/profile",
      "Content": "Feb 16, 2011 10:14AM PatsyC wrote: Sorry you are going through this- I'm similar in part but not as severe.  I have been on these boards off and on for quite awhile but mostly with my left breast, microcalc. that keep coming back that they have been watching for a few years now- only thing bx's have shown is ALH.   A few days ago my \"quiet\" rt breast suddenly started hurting, with a large hard lump and becoming swollen and red all around lump, no fever though - started on antibiotics yest. , have an US today and see surgeon on Tues in case they need to drain or bx something they find.  bacteria can be very resistant now days so they do have to be aggressive, I am also far from my breastfeeding days with our youngest 13 yo. Strange it can happen to us when we get older but I have also heard that mastitis can be worse in nonbreastfeeding women??? good luck and hope it's over soon                                         Patsy",
      "MessageIndex": 8,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764281",
      "Title": "Should I be concerned? ohiomama1 ohiomama1"
    },
    {
      "AuthorID": "PatsyC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8119/profile",
      "Content": "Nov 5, 2011 12:19AM PatsyC wrote: Kayce,      sounds like definitely a biopsy is in order, hopefully soon so you don't have to wait long!  Many BI-RADS 4 and lumps turn out benign so hopefully this will be your case but really they won't know til biopsy is done.  Good luck with all.                                 Patsy",
      "MessageIndex": 1,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/777521",
      "Title": "waiting on biopsy Kayce234 dragonfly55"
    },
    {
      "AuthorID": "PatsyC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8119/profile",
      "Content": "Oct 11, 2011 10:23PM PatsyC wrote: Sorry you are stressed.  I have had many problems with cysts over the years. Most have just been aspirated in the Dr. office but did have a cluster with a complex removed and it came back ALH. I have also had the \"let down\" feeling over the last couple of years but figure it is probably due to perimenapause symptoms,   this past year  had mastitis caused from a cyst right  behind the nipple and some drng which my Dr. said was from the location of the cysts behind the nipple by the ducts. Hard to believe that cysts can cause so much trouble!  I think it is pretty normal for them to want to do further testing on complex cysts. I believe most of them are benign but a very small portion can be more serious.  My doctor also said women tend to have more cysts and more problems from them perimenapause due to all the hormone changes. Good luck and hopefully someone else will come by with more info.                                               Patsy",
      "MessageIndex": 1,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776297",
      "Title": "Wondering if I should worry... kylaroy7 PatsyC"
    },
    {
      "AuthorID": "PatsyC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8119/profile",
      "Content": "Sep 11, 2009 02:10AM PatsyC wrote: PattyCakes,   I also have Kaiser and have been on 6 month Mamms for the last 1 and 1/2 years and this is the second time in 5 years that 6 month mamms with additional views were ordered.  They are paying for it but once I came in one day early of the 6 months and they sent me home since they are strict about the 6 month or year policy.  I also asked if I could go outside of kaiser and pay for a digital mamm (all my mamms state that my breasts are extremely dense) since they don't have digitals here at our kaisers and they told me they wouldn't read it and I could no longer get the every 6 months from them.  They can be VERY frustrating at times but check into your plan details and call the represtative to fight it. Good luck                                                       Patsy",
      "MessageIndex": 8,
      "PostDate": "11/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740170",
      "Title": "calcifications/mammogram coverage PattyCakes PattyCakes"
    },
    {
      "AuthorID": "PatsyC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8119/profile",
      "Content": "Sep 9, 2009 01:24PM PatsyC wrote: Superscared,   Ok take a deep breath.... Leaf has very good info.  Luckily most of us women who come here find that we have benign results.  It is very \"scary\" when there are suspicious findings until confirmed that everything is ok. The waiting is the worst. Like many on here some of us have frequent \"findings\" and are here often.  I have had many suspicious lumps and calcifications that have been biopsied and US and have only had one come back ALH.  Some of the harder lumps that concerned Dr's still ended up being only benign cysts behind normal breast tissue that made them feel different than regular cystic lumps.  I seldom go in for a mammogram that I am not called back for more views.  It sounds like you are in good hands getting further exams/tests.  I have had 6 miscarriages and though I have heard that it can increase risks I haven't had a positive  biopsy.  You will find the reassurement and info. here very helpful during your waiting game.  Good luck and prayers                                               Patsy",
      "MessageIndex": 6,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740144",
      "Title": "Scared... pretty sure I have cancer... CrunchyPoodleMama KorynH"
    },
    {
      "AuthorID": "PatsyC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/8119/profile",
      "Content": "Sep 10, 2009 12:19PM PatsyC wrote: Superscared,       Off topic but yes we have 4 Beautiful children from 11-19.  I never thought to give up :)  I pm'd you on that subject.  Take care and good luck with the tests.                                                                  Patsy",
      "MessageIndex": 8,
      "PostDate": "10/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740144",
      "Title": "Scared... pretty sure I have cancer... CrunchyPoodleMama KorynH"
    }
  ]
}