{
  "AuthorID": "Pattysmiles…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
  "Posts": [
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 20, 2013 05:26PM Pattysmiles wrote: Kiki, Sorry you have these decisions to make. Please take the time to check out the various reconstructions offered if you would choose to do masectomy. That might help you in your decision? My MRI did not show all of my cancer, go figure! Mine was ILC, which is in sheets? Or so that is my understanding. I originally had partial masectomy (aka lumpectomy) and they did both sides at time time with a lift to make the breasts match. I forget the name of the procedure. One breast had cancer, the other did not, but they weren't going to leave me lopsided, (and by law insurance must cover this). Anyhow, they found three additional spots of cancer in the margins , which left my margins smaller than they liked, so they wanted to go back in for wider margins. Instead, I am opting for masectomy with DIEP reconstruction. DIEP uses belly fat/tissues/blood vessels to build new breasts. I am finishing chemo in the next month, and then will be setting up my surgery. Not everyone has the same treatment protocols. You are wise to be reading these boards so you can get all your questions lined up. Keep in mind that not all doctors can do the different procedures you might be interested in, so you might have to find another doctor that will be able to do what makes you happy. For example, my original plastic surgeon, that did my reconstruction and lift when the breast surgeon finished her part of the surgery, is unable to do the type of reconstruction I would like. I learned about DIEP from these board. The plastic surgeon never offered it to me as an option! She did offer implants (im not interested) or a reconstruction that involved belly fat and muscle, which I don't want to touch my core muscle as I have a bad back! Continue reading, and I am sure there will be more people here to offer some input. Pat",
      "MessageIndex": 2,
      "PostDate": "20/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806452",
      "Title": "having real trouble w/ mastectomy vs. lumpectomy choice kika2013 slv58"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 25, 2013 07:34AM Pattysmiles wrote: I believe there is an Alaskan woman on the DIEP reconstruction board. Maybe she has some input as well? Also keep in mind if it is something...schedule quick so you can hit that deductible and keep going. I heard insurance companies start January, but some might have a different idea of their 12 month period.....call that insurance company back! Wishing all the best! Pat",
      "MessageIndex": 15,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 27, 2013 01:18PM Pattysmiles wrote: Oh, sounds better! Thank you",
      "MessageIndex": 25,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 24, 2013 08:36PM Pattysmiles wrote: I agree with AlaskaAngel . Was it you that called the insurance company? ....sometimes WE don't know the right things to tell them. If the docotrs office calls they would know the right thing to say to have it covered....assuming it is \"cover able\". If you are not covered for these tests, exams etc you might want to find out if there is a clinic that will do them for free. October is \"pinktober\" so maybe there will be more available? Additionally do a search on these pages for financial assistance. I'm in NY...I saw a doctor that was not in my insurance plan for a consult and it was $425 (DIEP reconstruction specialist). I don't know what they charge in Alaska. All the best, you have a good spirit to deal. Pat",
      "MessageIndex": 10,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 25, 2013 07:50AM Pattysmiles wrote: Ps, forgot to add, I believe they cannot turn away for pre existing IF it is breast cancer. Still thinking positive thoughts for you. Pat",
      "MessageIndex": 17,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Oct 15, 2013 04:44PM Pattysmiles wrote: can't wait til it's over for you!",
      "MessageIndex": 38,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Oct 20, 2013 09:23PM Pattysmiles wrote: I would say to listen to that little voice in your head. See the breast surgeon. Make sure to have copies of everything. And just an FYI, my MRI did not pick up everything that was going on in my breast. It saw 3 very small \"tumors\" but did not see the additional 3 the doctor took out, and then they found more...so MRI is not the answer to breast cancer as it can be a sneaky devil! Pat",
      "MessageIndex": 46,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 23, 2013 08:20PM Pattysmiles wrote: Shoppygirl, I had my thyroid nodule biopsy before I discovered my breast cancer. Doesn't matter which order it happens in, we will only worry until the results are in. My thyroid nodule was benign. That celebration was short lived! (As the breast cancer was right around the corner!)Lol. Anyhow, yes, most thyroid nodules are negative. I was also told itIS one of the \"best cancers\" you can have? I don't know how accurate that statement is, but it sure sounds hopeful either way! Don't sweat the small stuff. Oh, the procedure wasn't too bad. I drove myself. Discomfort...that's a word I recall in describing it. However I have a good pain tolerance. Wishing you all the best. Pat",
      "MessageIndex": 1,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811514",
      "Title": "Thyroid Nodule. shoppygirl shoppygirl"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 25, 2013 07:49AM Pattysmiles wrote: One more thing to consider. Do you have the opportunity to change health plans? I can do that in October every other year, I believe it goes into effect in January...not too sure, I've never taken advantage of it. (I am retired civil servant so that is our union thing) Anyhow, one more thing in a potential arsenal to save you money in the long run. Might cost a little money more per month but save you on the big bills. Pat",
      "MessageIndex": 16,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 27, 2013 11:53AM Pattysmiles wrote: Alaskanabbott, Sounds like it is all coming together. The process is annoying, lots of patience needed. At least you know how to get your reports early...it never occurred to me to do that! A.A. I did not know there were over 200 forms of breast cancer....wow! Now I am embarrassed. I guess my head is still in the sand! Pat",
      "MessageIndex": 23,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Oct 16, 2013 01:06PM Pattysmiles wrote: sorry, I have no idea! But did some google and it appears to look good....I just don't understand the lingo! Still praying for you regardless. Pat",
      "MessageIndex": 41,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 27, 2013 05:44AM Pattysmiles wrote: Sorry they are chaninging you. Here is something else to consider. Make sure there is a doctor that can read the mammos when you are there. I remember once or twice getting a call to come back because there was no one to read them when I was there and they wanted additional views. (More squishing). That SUCKED as I really thought something was wrong. (Luckily Not those times anyhow! , that came later!) If you are going during \"business\" hours odds are someone will be there to read them...I had gone after hours...you know, because they were kind enough to be open late for working people....rally hadn't thought much of that until they called me on a Friday to come back the next week....had to wait the whole dang weekend! Worrying! Pat",
      "MessageIndex": 20,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Oct 8, 2013 08:56AM Pattysmiles wrote: glad to hear things are going well!",
      "MessageIndex": 34,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 24, 2013 05:51AM Pattysmiles wrote: Mammo is usually first, then see the surgeon with the results. I would imagine if you saw the surgeon first, and they don't like what they visually see on the outside MAYBE you would get a surgery date sooner? That is really hard to say. My BS (breast surgeon) had a wait list for \"new patients\"...thankfully I had seen her a few years prior for a scare, so was seen a few months sooner, rather than later. Another way to consider doing it is to book your mammo, then call BS and book them...giving enough time for results to be sent. Thenif your appointment date you \"pre-booked\" can be changed if Maybe they will bump you to front of line if it looks like cancer? Radiologist are not supposed to say anything much. They will definitely tell you to follow up with surgeon. I had one tell me my surgeon does too many biopsies...well it was the biopsy that proved it to be cancer...needless to say I never went there again! I hate to say that the majority of this ordeal is waiting. Or so it seemed to be to me. Wait for mammo Wait to see surgeon Wait for additional mammo with biopsy Wait for MRI wait for mammo,biopsy and placement of marker Wait for surgery date Wait to recover Wait to see oncologist Wait for chemo No one warned me I would need a lot of patience! (I'm not the patient type) I will say this...the \"wait\" was not long...once they suspect something you are pushed to the front of the line for testing....I now will have patience when getting my mammos because maybe they are backed up due to a cancer patient being pushed in front of me! Oh, just read back...how do they know what to biopsy...they will do mammo guided biopsy if necessary (had that), ultrasound guided biopsy (did that) and possible MRI biopsy..(with contrast)did at too! So there are a bunch of tools they can use...we just don't know they exist! Also consider asking WHO is calling you with the results? Or will it be given to you at the office visit? I knew it wasn't good when my doctor called my house at 10:00pm. BUT I was glad she did so I didn't have to wait! (She called that late because she knew I had kids and she didn't want them to overhear results)/reaction) take a look around these boards to see about surgery choices, reconstruction choices, etc...if you are the type that likes to \"know the options before you get there\". . Now it could be for nothing (lets hope so)...but if it is for the worst you will be educated to a course of treatment you would like....especially Important considering you might not be given time to figure it out. To me, this is the \"education phase\"...and if you are fortunate and don't need that education for yourself, you can perhaps one day pass that education onto someone else. Oh, get a notebook, use it. Take notes, everywhere you go. Go back and re-read them. If you aren't a good note taker, take someone along who is. My hubby can't take notes to save his life. When I finally had my sit down with my BS I apologized to her in advance and told her I wouldn't be looking her in the eye because I would be taking notes...and I did. (She didn't mind). Also consider recording the meeting in the event you are not a great note taker. Sorry, this is wordy and long and maybe too much info. I write this for others, not just for you. Wishing you the best. Pat",
      "MessageIndex": 7,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 28, 2013 12:15PM Pattysmiles wrote: Not a stranger, a sister!",
      "MessageIndex": 27,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 7, 2013 06:02PM Pattysmiles wrote: I will be happy of my hair comes back. Dealing with the color will be \"icing on the cake\". :) Pat",
      "MessageIndex": 19357,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 5, 2013 11:16PM Pattysmiles wrote: ForMyGrandaughter, My hair started falling out after first T/C...didn't lose it all, but thinned out a lot. Then it stopped falling out, until final treatment, now it is coming out again, slower. Also started losing my eyelashes...I am almost 8 weeks DONE with chemo and started losing eyelashes! Each person has different reactions. Pat",
      "MessageIndex": 19474,
      "PostDate": "05/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 19, 2013 06:58AM Pattysmiles wrote: You need to check with your doctor on that one. I know mine said no black cohosh and a few others (I don't really use supplements except the standard vitamins) so it is best you ask your oncologist...",
      "MessageIndex": 19498,
      "PostDate": "19/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 27, 2013 09:32AM Pattysmiles wrote: MinusTwo, I LOVE my Buffs too! I had a cousin send me some headbands, I was thinking, what am I supposed to do with them! I decided to wear one under my buff when I went to the gym...it was awesome, it collected the sweat ! I have also worn them under my buff when I am just running errands on hot days and even though it is an added layer it seems to feel cooler. Here is their link http://yogitoes.com/tools-accessories/hband-headbands.",
      "MessageIndex": 19403,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 24, 2013 06:39AM Pattysmiles wrote: Mely19,I am a bit of the opposite. The top is coming in, the sides and back are still thin. I am taking biotin only once a day, thinking of upping to twice a day. I do recall that it was the top of my head that started falling out first....wonder if that has anything to do with re growth order? Pat",
      "MessageIndex": 19510,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Sep 26, 2013 09:58PM Pattysmiles wrote: I am taking a few vitamins on tamoxifen, with the approval of my MO. Biotin, vitamin D, vitamin b12...I have also added vitamin C (feeling a cold coming on)... I was told nothing like black cohosh (sp?) or other remedies for hot flashes without first consulting with her. (Obviously that type of remedy must mess with estrogen) Not all MO are the same so you might want to check with her. Pat",
      "MessageIndex": 19525,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 15, 2013 11:11PM Pattysmiles wrote: The genetic counselor took almost two hours with me. I made it clear I was NOT interested in waiting for the results before having my surgery. She went into excruciating percentages about breast cancer and even suggested I had another genetic issue called Cowden syndrome. She went into detail about that as well, even though my only \"qualifier\" was breast cancer. I had to wonder if she was getting paid to refer people to some testers out in Cincinnati as she mentioned numerous time if I did not qualify through insurance she would end my info to these people. Any one else sit through a Speech about Cowden syndrome? Anyway, she went and told my doctor I wanted to wait to get my BRCA results. I NEVER said that. So my surgery was out off, as I was told, by only a few days. Then I get a call the night of what would have been my surgery, from my dr. Telling me that the genetic testing hasn't even begun at the lab due to a dispute with the insurance company. Turns out this IDIOT. Genetic counselor was too quiet when dealing with the insurance company ...when asked if she gave the insurance company hell she said\"I'm not like that\". What! But you messed with my surgery date so I could get those results, and now I would still have to wait two weeks! Minimum! Anyhow, dr is going ahead with my surgery without BRCA results,I am comfortable with that,I am \"low risk\" in regards to testing positive for this gene. Honestly,I think they should have took my saliva and called me in for a consult nay if I tested positive. THEN I would have paid attention! My notes all say things like \"why am I here!\" \"Shoot me now!\" \"What is she talking about\" and \"shut up already\". Almost two hours of my life I can't get back! Anyhow,if there are \"normal\" geneticists out there, great! And I am sure if i Went in wanting to write down every detail of \"what if\" situations I would have good notes. Unfortunately she had some bizarre agenda selling me another gene problem and droning incessantly. And, to top it off, my surgery will now be Monday, without. bRCA results, and she calls me today to tell me the lab has now started my testing. Well just great, what is that going to get me. I'm dealing with surgery now, not genetic testing that won't be here for two weeks. If someone asks me about this geneticist on a survey they will get an earful. Anyhow, sorry for the rant,it's still a Fresh wound. Genetic testing IS IMPORTANT.. In my case there is such a small percentage of having the BRCA that I felt it would not impact my surgery decision, even if I have the gene. It's been a month since I have been diagnosed with ILC, I would like my partial mastectomy and reconstruction so I can move to my next treatment stage. I have three kids and need to plan my life! Good luck, sorry about the rant! Pat",
      "MessageIndex": 10,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/801871",
      "Title": "BRAC test, initial consultation? Papillon1 Papillon1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 31, 2013 08:28PM Pattysmiles wrote: Deb, I'm sure you will make that wedding one way or another. You can easily plan any surgery around it if necessary. I for one booked a reunion in Florida for June, then got hit with my diagnosis, and thought I was \"safe\" to go. Did not realize surgery recovery time to beginning of rads treatment time and might not be making that reunion now. I guess I will know more When I meet my oncologist for the first time this Thursday. I am also supposed to be godmother to the newest addition to the family and my sister in Law has waited so patiently to work with my treatment....I finally told her to just book the Christening for whenever she needs to as I may need a follow up surgery to get cleaner margins from my initial surgery, OR I might be on chemo, OR I might be on radiation, OR I might be having a masectomy. I am so tired of the \"mights\". If she picks the date before I meet with my oncologist I will see if I can work around it. If I meet with my oncologist before she picks her dates I might have a better idea of where I will be at. Hurry up and wait! Lol. Who would have thought! But I can tell you one thing, having this diagnosis sure will make me appreciate being a Godmother even more, as it has taught me to enjoy all moments. I'm sure you will enjoy that wedding! Wishing you the best for our biopsy. Pat",
      "MessageIndex": 13,
      "PostDate": "31/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802465",
      "Title": "and I'm crying again, sappy self-absorbed vent debmc1958 debmc1958"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jan 21, 2014 10:45AM Pattysmiles wrote: I am sorry you have joined us but this is surely the best place to get info. I was 47 when diagnosed.  I am identical to your personality description. I did not want daily phone calls from numerous people asking about my condition and how I was feeling. I set up a caringbridge site and emailed all my family/friends the link.  Her is the website http://www.caringbridge.org/    I did an intro on the site thanking them for taking the time out to support me by reading the page and included a few sentences about preferring no phone calls...in my case I have3 children, I did not want them getting upset listening to details that I had no intention of sharing with them.    I told very few people about my cancer, my husband did most of the talking.  I did find the few times I spoke about it I would get visibly upset, yet I didn't \"mind\" chemo or my surgeries. I will say that as stoic as I was through the process I have since discovered the \"after treatment is over I'm in \"lala land\"\" phase of worrying.  There are a few threads on this site that discuss that.  Most of the women from my chemo month group are also \"suffering\" the same thoughts.  It IS a process.  You are surely in the right place. Pat",
      "MessageIndex": 20,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/817033",
      "Title": "How to ask for help when going through BC on your own MinaBee msphil"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 8, 2013 02:48AM Pattysmiles wrote: Greetings, I have no experience with wigs. I went wig sopping with 2 of my children yesterday. My daughter was in tears Friday when she found out I was going to lose my hair. I HATED the wigs. I can't stand my hair on my face, I don't wear a part, I just throw my hair back in a headband (very narrow). There is nothing \"like me\". I hate hats. I think this is one of the hardest parts of my journey so far! I am going to go out and try some scarves to see how I look in them. I do not have my chemo set up yet, am debating to do masectomy first as my margins were not good. I'm on the fence each day figuring out which path to go, re-excise for clear margins, or masectomy. Anyhow, anyone have a good link for scarf websites? I had one that showed \"how to\" wrap scarves around your head, a 12w by 72L , and cannot find that link. I've been reading this board all evening looking for alternatives to wigs or hats with hair. It's not easy! Pat",
      "MessageIndex": 3,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802774",
      "Title": "Hair/wigs erinm216"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Feb 22, 2014 12:24AM Pattysmiles wrote: Alyon, I agree with Chrissy, get those sugars checked. Additionally, consider she might be having a mental breakdown.  The good news is that is IS TREATABLE! My mom has suffered a few mental breakdown episodes, and yes, ALL the things you mention fit the bill.  She is now on two types of medication and is \"normal\" (please define that word!) so I guess I should say she is back to her old self!   While you are trying to sort this out, please change her email passwords, if you can.  Remove and hide at jewelry and anything else she is trying to get rid of.  Tell her you took it to someone to be appraised for the better jewelry she will buy.  Seriously sly  though, I don't know the steps in your country to get her help.  For my mom we drove directly to a hospital with a psychiatric ward.  It was difficult to do but it was absolutely 100% necessary.  First they had to clear her medically in the ER, then they transferred her to psychiatric.  It was reaffirming to know she was SAFE, as was my dad...she had paranoia about him, I was afraid she would kill him.    She was there for at least a week, if not two, and they got her on medication that fixed the chemical imbalance and gave her back to herself.     I would recommend you do not wait to get her help.  Wether you believe it is sugar or psychological, or whatever.  Please act now. Wishing you the best. Pat",
      "MessageIndex": 2120,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 5, 2014 08:17AM Pattysmiles wrote: oh AlyonA, I am so sorry to hear that.  My prayers are with you. Pat",
      "MessageIndex": 2157,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 28, 2013 05:48AM Pattysmiles wrote: Rosina, that was awesome! So I guess based on your moms reaction the steroid rage is real! I better make an extra sign for the front door! These past few months when I PMS I am just awful...cry for \"dumb\" reasons, get angrier than a \"normal person\" would etc....I can't picture that on a bigger scale! My poor family! Indenial, I like your power hat....now I know what I will be thinking when I get there, and if I choose to go without I will think of Rosina! Thanks Ladies! Pat",
      "MessageIndex": 634,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 14, 2013 07:04PM Pattysmiles wrote: Lol, no thank you. I would pass, based on the name alone! Mercury! Can you imagine that nowadays!",
      "MessageIndex": 932,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 16, 2013 02:36PM Pattysmiles wrote: 6cats. ..I am so sorry to hear your description. I think I suffered from my own body image prior to this surgery. I had finally worked at removing my excess baby weight (my youngest is 10!). I took off 25 lbs and \"only\" had another 10-15 to go. I was changing my whole negative perception of those \"skinny bitches\" because I finally had figured out the answer, God did not make them that way, they WORK for it! Seems \"dumb\" I never thought of that before! I had started eating right as well. I finally thought. I AM going to be better package. Well, that is now changing. Surgery, 6 weeks no exercising, smaller boobs (but Perkier!) and I still lost weight from eating correctly. Now chemo...but I went and \"bulked up 10 lbs., figuring I would lose it during chemo. I think I am up even more! A shorter haircut. I was NOT happy by the reactions around me. The silence is as mean as if someone said I don't like it! BUT, I always wanted to go shorter! And it is \"growing \" on me...but fate says not for long! Soon to be bald, and facing the next challenges of scarves, wigs, hats. This is some journey! If anything I will try and find more positive in this. It took forever to realize those \"skinny bitches\" don't look skinny by nature. There IS a message in this journey, not only for me and my sisters, but for those watching us, and even for those that don't know us. Each persons message will be different. I'm thinking my inner message is evolving, and right now I am going to fight to get back my sense of who I am. I'm not \"skinny\", probably never will be...but I AM eating healthier than I ever have and I am a role model for my children. My outer message is different, i know my physical appearance isnt what i would like it to be. despite that I hope my outer message is saying to everyone \"despite the ailment I carry on\". \"I am here, ask me questions\". \"I am woman hear me roar!\" And honestly, I have been doing a lot of \"deep\" thinking. Why do I spend so much time worrying about my body image? The lotto is now over $300 million and if I won it tomorrow it won't change the biggest problem I currently face, and it certainly isn't my body image! Sorry, I can't be helpful. Yes, this roller coaster ride is messing with my head! Thank you for scientific experiment info...I will be sure to not mix and match in the bedroom...one more thing I have learned along this journey! Pat",
      "MessageIndex": 955,
      "PostDate": "16/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 17, 2013 04:47PM Pattysmiles wrote: Regarding hair loss....I know I am getting close to the time...first chemo was 5/6 My head feels like little tickles here and there...just started today. Is this the beginning? If anyone had that happen, can you give me an idea of how many more days and what to expect? Thanks! trying to calculate in a visit with my mom who is essentially unaware of what is going on with my life, and give my kids some warning, and figure out if I will shave my head at home or do it out. (I've already gone from shoulder length to pixie cut) Pat",
      "MessageIndex": 975,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 22, 2013 04:22PM Pattysmiles wrote: Katie, Growing up sex was a taboo topic in my house. \"The talk\" lasted 3 minutes, if that. (my children will hear more from me on that topic!) I still do not talk\"sex\" with my friends, and never will, they know enough about me otherwise! It is far eaiser to \"discuss\" this here, anonymous if you will! It is validating to know that we all face these issues. I'm sure the people have a better understanding, having been there, done that, or going through it now. You brought up an important topic, and many will benefit, myself included. Im going out to buy stock in astroglide! Lol Pat",
      "MessageIndex": 1029,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 23, 2013 12:40AM Pattysmiles wrote: Wine, yes, that sound great! Thanks Jen...I love the suggestions on this board to make us feel better! Hope you aren't too sore tomorrow and your car is fixed soon! Pat",
      "MessageIndex": 1037,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 21, 2013 03:06PM Pattysmiles wrote: Helpful hubby, I know you mentioned your wife turned up her nose at dairy. Just a thought,perhaps change the flavor? I am loving McDonald's chocolate shakes. I went to Carvel and had their thin mint dasher, which also tasted good. Then the other night I had their vanilla ice cream and had to throw it out! Eeewwww! Same with drinks...plain water is not appealing to me after day 2...so I have been purchasing different flavors of water/drinks. So far i must say anything in the red family seems okay. Lipton lemon iced tea is great (just tried that yesterday). I tried some kiwi-strawberry thing today and it was awful. I just keep trying... I see your wife likes omlettes. I can definitely taste eggs, even egg whites! But the texture of the cheese is not something I like,so I omit that. Biotene makes a gum. And I have read, but not tried, that sugar free lemon drops or other sour type drops might get the juices flowing? Your wife is fortunate to have you caring for her. I am not a complainer either (well, not about my side effects!) ...so if she is saying something is off it must be really off. My prayers to you, your wife and your family. I'm sure we would all love to hear your Uncles story when you are ready to share it. Pat",
      "MessageIndex": 1356,
      "PostDate": "21/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 12, 2013 03:58PM Pattysmiles wrote: Regarding Neulasta shot and bone pain. It IS possible that the dosage of the Neulasta shot be decreased if you should experience bone pain. After each visit I was asked how I tolerated the shot previously and when I said no problems they gave me the full dosage. They had said if I complained of any bone pain they would have cut the dose in half....which was NOT a guarantee of no bone pain, AND I wouldn't have the full benefit of the shot...though I guess it could be argued SOME benefit of the shot is better than none. Pat",
      "MessageIndex": 254,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 27, 2013 08:23AM Pattysmiles wrote: Jeri, Sorry you have been hit hard with the bone pain. Was it 24 hour Claritan you took? Started it on the day of the Neulasta shot and continued each day? I had heard someone was told to start it two days before and continue ((this was after having bone pain the first go around using the above method) There was another person that took Claritan in conjunction with Aleve (check if you are allowed Aleve) and that worked for her. At my doctors they had told me if I had bad bone pain from Neulasta they would reduce the amount they gave me by half. You MUST be aware if that is their plan and remind the nurse, as the \"reduction of the shot\" is giving you half of what is already in the pre filled needle. When I would go for my shot the nurse told me I am her only patient that can tolerate the full shot, but I was also their only patient to take Claritan 24 hour! In regards to hair, I had cut mine to a pixie length (from shoulder length) and when it started to fall out cut it to what I would call a short cut (mans length). I still have not lost it all, but it sure has thinned A LOT. I wear the buffs www.buffusa.com and love them. My hair seems to be growing fast ...what hair I have!....and it actually will stick out below the back of the head covering, as well as near the ears. There are a few people that were disappointed they cut their hair super short (stubble type cut) as they said it was difficult to sleep , the stubble hurt, they also said it bothered them when wearing a wig. The head thing is such a personal choice, no right or wrong answer for sure! I look in the mirror and see an \"old lady\" looking back wheni am without a head covering. I was shocked wearing my buffs the first few times I looked in the mirror...especially when I had my daughter clothes shopping, but I was shocked because I felt so normal shopping and forgot I was wearing the buff! I guess I am trying to say we adjust. Pat",
      "MessageIndex": 624,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 17, 2013 02:40PM Pattysmiles wrote: Hannarigs, I had read about chemo farts and thought I would finally have the ability to \"blow away\" my hubby and boys....alas it never happened for me. Here is a link to some pretty funny things regarding cancer (well, my warped sense of humor, I found most to be funny) . I learned a lot about side effects by reading here! community.breastcancer.org/top... Pat",
      "MessageIndex": 1068,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 18, 2013 01:22PM Pattysmiles wrote: Momx2, I am sorry your mom cannot be here to take your call, but I am sure she can hear you. My dad passed a year ago. I often wonder what he would say, he was so funny. I look like him with my short hair and now all white! As the blonde seems to have fallen out, but the white stayed! I am sending my prayers to you. Pat",
      "MessageIndex": 1074,
      "PostDate": "18/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 20, 2013 03:14PM Pattysmiles wrote: Marsha, Please let me know how your son liked it. I found that link late, so didnt register my kids. Was this the one in Maryland? Thinking of looking at next year. Thanks, pat",
      "MessageIndex": 1106,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 23, 2013 09:50AM Pattysmiles wrote: Just had my \"chemo teach\" yesterday, and it was not how I expected it. Sat with doctor and she was going over a few meds, she then said I needed to pick a date to start chemo. So I asked when do I do chemo teach, and she said \"this is it\". Lol I saw the room they do chemo in, I guess it is small, there is room for 5, and at times they will bring in an extra chair if needed. Outside that room is a row of about 30 chairs. I was petrified and asked if that is where we go for treatment after our first one. Apparently those seats were for hospital patients! Relief for me, but feel bad those seats look like an assembly line, very freaky. Anyhow, I would have started next Tuesday and squeezed into the April chemo group, but they only had a 2:00 slot, my daughter gets off the bus at 3:00, so that was no good. I am now Monday May 6, but would like to take advantage of all your experience as I have read these boards til my eyes droop, taken notes, and still have not seen an answer (well at least that I wrote down!) 1. Claritin. Is it \"d\", 12 hour or 24 hour? And when do I start and when do I stop. (The oncologist said she heard of people taking Claritin but doesn't think it's necessary as most don't get bone pain and its \"not too bad\"-lol, I don't think so!) 2. Icing- yep, she doesn't go with that idea either. So when exactly do you start it, and when to end it? I am 4 rounds T/C. The other drugs she wrote for are: (I asked for drug sheets and this is what she gave me) Diphenhydramine (Benadryl) Dexamethasone (steroid) Famotidine (heartburn relief) Palonosetron aka Aloxi (nausea). I read here this is a \"good one\" Neulasta (for white blood cells). I know this is why I will take Claritin. So my questions about the above: no sleep aid? I hear a lot of talk about that! The heartburn relief, is anything OTC good? (Have not yet seen if insurance will cover this) Is there anything else I should be asking for? Thank you all in advance, I want to get the shopping out of the way while I can! Wishing you all the best and a successful treatment. Pat",
      "MessageIndex": 513,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 23, 2013 10:21AM Pattysmiles wrote: Thanks indenial, I thought Aloxi was for home! Lol glad I listed and asked! I'm going to hit CVS and see what they have for me. I don't think she understood when I said I want a list of drugs I will be using...she gave me the pharmaceutical print outs of the above listed drugs. I only wanted a \"simple\"list, so I wonder if the nurse got tired of printing (I don't blame her,not here is a lot of pages for these few drugs!) I'm hoping she doesn't think anti nausea meds are unnecessary too. If that's the case I will use this next week to find somewhere else to go. Pat",
      "MessageIndex": 515,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 3, 2013 03:59AM Pattysmiles wrote: Pamela, Thank you for posting about the buffs. I had looked at so many things last month and never made any purchases, except for some regular scarves from Target, and I hit Goodwill yesterday and picked up two scarves. Figured I would learn to tie them around my head. The buff looks way easier. Only down side is I can't see it on me. When I was in Target I took the headscarves to the fitting room and \"wrapped\" my head...well, as best I could. There were so many scarves I liked that the colors just did not look good on me. I was so happy I did that. Hoping the buffs I picked are good colors for me. I made sure to buy some UV buffs so I can wear outside. Also bought one for the gym. If I like them I might have to buy more! Thank you!",
      "MessageIndex": 716,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 3, 2013 07:27PM Pattysmiles wrote: Irene, Did you take Claritin ? It is supposed to ward off the pain in the bones from the Neulasta shot. I have it in my arsenal...I start chemo on Monday. From what I've read take one on the morning of the shot and take one each day for the next 6 days. Someone else posted to take one the day before the shot (which would make it chemo day?) Anyhow, something to consider! Hoping you feel better. Pat",
      "MessageIndex": 725,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 22, 2013 03:14PM Pattysmiles wrote: Pugmom5, Teenagers by nature are self centered (there are books written about it). I got mine alone in the car the other day (coming from him getting braces) and asked him point blank how he was doing with everything and if he had any questions. I have been open about everything, positive about everything and I crack jokes and laugh at myself. He told me he knows there are people that can only complain and he is very happy I'm not one of them and that all I have told him has been very helpful. Maybe try getting your girls alone and chat ? Yes,I think they can be scared, but I also think they are being \"typical\" teenagers...it's all about them! I wish you the best with this. Katie I'm sure the bedroom has changed for a lot of us, if not all of us. Personally my breasts were my biggest \"help\" during sex. So there has been a big change now, and I'm not satisfied (in more ways than one). I did notice there is a \"shop now\" feature at the top of this page and there is a website for \"toys\" that I just might consider. I know it wouldn't disappoint my husband. Never anything I needed in the past personally, wasn't against it, just didn't feel it was necessary. Maybe think of some new things to assist with intimacy! Maybe a nice camisole that is silky, look sexy, feel sexy and hide the scars? You have a lot on your plate. There is no right or wrong with what you choose to do, you need to do what makes you comfortable. Continue to be open with your hubby using phrases like I'm uncomfortable with....or i like it when we.....Im worried about.....always making it anout you. He will want to do his best to help you out. Don't use thinks like \"I don't like when YOU\" , or \"you don't\" etc, it will shut him down and put him on the defensive. Thank you for sharing such intimate details, I know it's not easy. Pat",
      "MessageIndex": 1025,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 24, 2013 03:35AM Pattysmiles wrote: Kerri, You will be fine. You need to do a lot of positive self talk, whatever you would be saying to your patients you should be saying to yourself! You CAN do it. I have no advice on the Ativan, I've never taken it, Here is a link for side effects www.cancer.org/acs/groups/cont... I printed it out, kept it at my armchair table and noted things on it at the end of me day. Side effect meds Kitchen table in a bowl....because I will see it and use it! Stool softener. (Am/pm) Claritan (to take day of, and the next 7days after if you get a Neulasta shot-to ward off bone pain) Prilosec- for heartburn Miralax- constipation Steroids( mine are day before, day of and day after chemo) In a shoebox on my living room table (where I chill out) Nausea meds- as needed Benadryl (didn't need) Anti-diarrhea meds (I didn't need) Biotene gum (to relieve mouth dryness) Bathroom Biotene mouthwash,for after every time you eat the first few days. Biotene toothpaste (I didn't need it) Drink lots of water or other liquids to rid of toxins Have on hand tissues (prefer with lotion) for drippy nose Hand sanitizer wherever you go Ice your mouth during taxotere...to ward off mouth sores (chew on ice chips or being ice cubes /icee/slushee) Ice fingertips and toes to ward off neuropathy. (I used frozen veggies and baggies of ice-kept in my own cooler bag) Please note not all doctors might agree with the above, so please confer with your oncologist. Read the boards and see what is on them I might have missed a few things. Also, consider moving over to the may chemo 2013 group community.breastcancer.org/for... Pat",
      "MessageIndex": 1065,
      "PostDate": "24/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 31, 2013 05:37PM Pattysmiles wrote: I had read on here where someone said their age spots cleared up while on chemo,but they come back. As for the chemo attacking precancerous skin cells....I don't know. I had gone to a dermatologist to check out \"some stuff\" on my face before chemo, I made a point to mention I would be getting chemo. He didn't even ask which drugs, he said its not the same. He gave me a chemo cream to apply to my face for two weeks, to kill the precancerous cells on my face. Maybe this is one of those areas where none of us gets a straight answer, or there are so many variables in the types of skin cancer to be treated? Pat",
      "MessageIndex": 1157,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 2, 2013 05:14PM Pattysmiles wrote: Carol, I would say to not say anything. My husband was called by someone, he knows them, looking to hire him. (As in called hi, he did not apply for a job!). I told him, under NO CIRCUMSTANCES should he mention my \"condition\". First words out of his mouth were, \"my wife has cancer and needs to go for chemo, so I will need time off\". I wish I had a recording of him, he would realize how it sounded...\"hire me, but I won't be there on a regular basis\". Needless to say he hasn't heard a word back. Anyhow, the hiring process can take time, you might be done with treatment by then. If you aren't, and manage to get your foot in the door, they have the opportunity to see a good employee and can possibly work with you....you might not even miss that much, if any,work! That's just my two cents. Pat",
      "MessageIndex": 1171,
      "PostDate": "02/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 9, 2013 10:09PM Pattysmiles wrote: Oh Kerri,I'm so sorry. Isn't it sad if you have to hope it is Lyme and they can put you on an antibiotic to feel good! I pray things ease up for you. Pat",
      "MessageIndex": 1246,
      "PostDate": "09/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 11, 2013 09:55AM Pattysmiles wrote: Here is a sheet from the American Cancer Society regarding chemo side effects. Easy to check off. When I went to my next chemo appointment I would make this check off list into a one page written summary so it would be less annoying to flip through the pages when going over it with the doctor. www.cancer.org/acs/groups/cont... Pat",
      "MessageIndex": 229,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 12, 2013 03:54PM Pattysmiles wrote: Annie, The Claritan 24 hour once a day, beginning the morning of the Neulasta shot and one each morning for the next 7days is a suggestion. There has been a lot of discussion that this prevents the bone pain often associated with the Neulasta shot. My oncologist said she never heard of it, but did not discourage me from trying it. The nurses in the office say I am the only patient that does not complain of bone pain. I find that ironic as the oncologist had said \"so few people get bone pain it's nothing to worry about\". Apparently there are more than a few people complaining at my oncologist office! It is a shame they don't suggest the Claritan 24 as a possible preventative measure. One other bonus of the Claritan is that a number of people have complained of the steroids affecting their sinuses. I think the Claritan has helped me in that area as well. Here is a link to a study underway regarding Claritan (loratadine) and bone pain associated with Neulasta. weinterruptwalbridgesregularly... Pat",
      "MessageIndex": 253,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 12, 2013 08:20PM Pattysmiles wrote: Soriya, Sorry you looked at survival rates, but whatever you read might be outdated, please stay away from that stuff! Your oncologist should be giving you info based on YOUR tumor...they would look at the grade as well. There are other testing that might factor in, but remember, no test is 100% accurate, this is an ever changing disease in regards to treatments. (For example, for ER + Tamoxifen was only recommended for 5 years until a few months ago, now it is recommended for 10 years) Please place your trust in your oncologist. And if you decide you no longer trust him/her go and get another opinion. I also have young children, 10, 12 and 14. Naturally I want to do whatever it takes to be here for as long as possible, just like you. Keep fighting the good fight, and try not to read those websites that scare you! Pat",
      "MessageIndex": 260,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 8, 2013 09:28PM Pattysmiles wrote: Marsha, watch out for the sun! Chemo makes us more prone to burn quicker (at least that's what my MO told me) Glad you are feeling better this time around. Call for magic mouthwash if you need it. Pat",
      "MessageIndex": 919,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 9, 2013 10:38PM Pattysmiles wrote: Sue....Happy Shopping! I happened upon the ebay post because I was trying to see if I could find buffs cheaper than $20 a piece. I sure did! Lol. They aren't my favorite colors, but it does present options for wearing different things....I could always wear them when I work out at the gym, who cares then! I need to order the white buff for a christening (I'm the godmother). I figured it should go with the baby! Lol. I will have to see what is is like though, don't need to be looking like a nun! I would also like red, for Christmas. Though maybe my hair will be growing in by then? Pat",
      "MessageIndex": 939,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 10, 2013 10:28PM Pattysmiles wrote: Lynn, When I am going to work out I like to wear (if I can remember to put it on!) a yogitones headband. Here is a similar item (I can't find the link for the one someone gave me) www.amazon.com/neutral-tone-st... I really use it to absorb sweat, but they are comfortable under the buff....I have worn it when it was just plain hot out under the buff. However, I have not lost all my hair as of yet, it is still coming out...and is probably about one inch long all around. Sorry I can't answer if the buff would work on shorter hair. Pat",
      "MessageIndex": 955,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 13, 2013 09:19PM Pattysmiles wrote: Peace777, I started losing hair around day 13....before that my head was \"tingly\" and \"tickles\", not really that tight pony tail feeling a lot talk about. It was coming out in strands....no noticeable \"clumps of hair\". I had it cut really short and started wearing buffs because I felt my hair was thinned out. I have now finished my 4th and final round of chemo on July 8. My hair has now started coming out more. It seemed to have stopped after the initial falling out, all the way back after round 1! The rate it is coming out now seems quicker, though I wouldn't say I am even close to being bald, still just thinned out a lot. I still wear my buffs. www.buffusa.com My oncologist thinks my hair should start growing back in mid September....which would be about 9 weeks after last chemo. I find that interesting as I still have not lost all my hair! Pat",
      "MessageIndex": 1005,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 24, 2013 11:12AM Pattysmiles wrote: Nocompromise...I thought of you yesterday. I eyeballed my daughters \"stretchy\" book cover and thought it would make a wonderful \"buff\". So I put it on and it worked! The part where the book jacket would go went on over my head and the rest hung flat down the back of my head, so I bunched it to a pony tail...it had \"devils ears\" sticking up soi just tucked them down . Wish I could upload photos! It looked really good, I even went out with it on. Hubby had no clue what is was when I asked him what he thought it could be. My daughter, on the other hand, immediately recognized her book cover. She better watch out or more book covers might disappear! Lol Hope you get over blah quickly. KTLe. There is a girl with a blog in our area, she showed herself wearing a face ask and she had either painted or used markers to put lips on it...her friend was wearing one too. I've seen it where people write \"cancer sucks\" on the mask... Pat",
      "MessageIndex": 1175,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 8, 2013 08:17AM Pattysmiles wrote: Greetings! I am having my final of 4 TC chemo tomorrow. I thought I would drop in here, since I can't sleep, and offer up my experience. Steroids can make you stay awake! They didn't for my first two treatments, I slept like a baby. But for #3 and this final I have been up! I also think I made the mistake of drinking coffee late in the day. Oh well. And yes, you CAN gain weight on chemo, steroids make me hungry! Though taste buds are off! Icing, I saw a few people ask. First I would like to say, ALWAYS check with your oncologist prior to taking any advice on these boards. We are all \"just patients\". I ice my fingers using bags of ice and my toes using bags of veggies (same bags each chemo round, will be throwing them out after my final tomorrow!). I sit with soles of feet together one bag veggies between toes and one on either side of the tops of my toes. This is done when the start the Taxotere drip, and during that entire Taxotere drip. I also get ice chips to suck on and have an icee to drink (to avoid mouth sores). I use a cooler bag to transport my ice, frozen veggies and icee to my treatment. Food, find out if your center provides lunch...you will most likely be there a number of hours. Mine does not, so I throw in some protein (healing powers!) into my cooler bag and maybe some pretzels or other finger food. Water, water , water...hydrate, if you can't tolerate water find something else you can. Drink plenty before getting to the treatment center, helps them to find your veins if yOU are well hydrated. Also the liquid will help to rid your body of the toxins. You CAN. Get up and use the bathroom during treatment. The only time you cannot is when they do your first drip of taxotere (checking for reactions the first 5-10 minutes). Don't know about the other chemo a. Just tell your nurses you need a warning for when you MUST stay in your chip air so you can go use the bathroom accordingly. Continue to drink plenty when you get home and for the following days. Bathroom at home. I start stool softeners day of chemo, and continue them. Next day I add Miralax to my breakfast water, and do that for more days too! When I stop all my nausea meds I stop these meds too. That is just me. I have not gotten constipated. I also have baby wipes on hand to wipe myself after using the bathroom those first 3 -4 days. You are passing toxins, I don't need \"issues\" down there! Food...nothing tastes \"right\" as you would think it should. Coffee...eeeew! I don't drink coffee for the first week....BUT I found a international delight Mocha coffee drink in a half gallon at the supermarket that tastes incredible. I throw it in the blender and add ice. YUM! (Higher calories though, here comes weight gain! I also like the McDonald's chocolate shakes and the McDouble (but NOT a regular cheeseburger from McDonalds!-go figure!). I don't eat those on a normal day! And I LOVE my watermelon, cold, tasty and soothing. Also iced tea! Indigestion...mine started as soon as I got home from chemo...despite the meds given in IV prior to chemo. I went and purchased Prilosec and .tums. Between the two it kept me good. I have my meds to take in a bowl on my kitchen table, and have a check off list on my kitchen cabinet, so I remember what i took. Also helped when I was in bed and didn't want to get up, hubb could figure out what to bring me. Additional, \"back up\" meds are in a shoebox on my coffee table..Benadryl, nausea meds, thermometer...I have only needed the nausea meds. I also advise using an empty medicine bottle or other container to throw some nausea meds and tums into when out running around. Claritin for the Neulasta shot. I have read that it can help to avoid the bone pain associated with the Neulasta shot. My onc never heard of it but did not discourage me trying. The nurse said I am her only patient that can tolerate the full amount of the Neulasta shot (they can decrease the amount given if you get bad bone pain). I think it is because of the Claritan 24 one a day pill. I take it the morning of the Neulasta shot and one a day for the next 7 days. Side effects, I will look for and post a sheet of side effects to record/note when on chemo. It comes in handy and tells you when to call your onc. Also handy to refer to when you go back to next chemo. It is from the American cancer society. Not feeling good! Call your onc! Don't wait, they are getting paid to serve! Weekends, holidays, midnights....call! Don't \"wait it out\" there are so many meds that can be prescribed to help you feel better. Blood pressure, blood draws and IV. These things should not be done on the arm where you had lymph nodes removed. It can increase the risk of lymphedema....look it up on these boards. Be sure to advocate for yourself! IV...if you feel discomfort in your vein, or anywhere, when getting your pre meds or chemo, speak up! They had to use a hand vein during one of my rounds and I had burning and pain during Benadryl drip...I was so happy I spoke up, they did something and made it better. Also had other issues that day and they fixed it. Didn't have any problems my other two times! Tiredness...I was tired on day 4? (Day 1 being chemo day). I napped, and then napped some more. You really need to GET UP AND MOVE...even walking in the house, housework, walk down the street....it actually takes to out of the tired fog! I was back to the gym by day 6....I am NOT a gym rat, just like my one machine. Admittedly I took it slower, I was afraid...then I worked my way back up....it IS doable. They say the effects of chemo are cumulative. I didn't really feel that til chemo #3, but my vitamin d is down and so are my red blood cell counts...so that can be the reason...I am still getting up and going though! Chemo brain..I have NOT had any major issues with this. Thankfully! I apologize for the typos, I'm sure there are many and iPad makes up its own words too, I am too tired to go back and fix. Please remember, you CAN do this. Many have gone before you and are here to talk about it. One step at a time. Pat",
      "MessageIndex": 152,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 9, 2013 05:07AM Pattysmiles wrote: Yes, the Claritan 24 is for itcy eyes etc....and it is also used to prevent the bone pain...you just won't find that on their box! I sent you a PM. Pat",
      "MessageIndex": 172,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 9, 2013 03:28PM Pattysmiles wrote: Encyclias, The Claritan affects the release of histamine somehow. It is my understanding that the Neulasta shot might make the bone marrow release histamine which is what is causing bone pain. I'm not sure that this statement is 100% correct...I had read something in regards and cannot find the link. Claritan does not sound like the pain killer abilities of .sineaid (which I had never heard of!) so don't stock up on it for that purpose. Just found this link, the people responding to the question answer a bit clearer, though they are talking about bone pain and taxotere ... answers.yahoo.com/question/ind... There is a study being conducted regarding Claritan (loratadine) in regards to bone pain. www.druglib.com/trial/36/NCT01... As for Claritan being taken off the shelves because it could make meth I don't recall that. There are many over the counter drugs that have been removed to behind the counter and or have been limited in the amounts that can be sold due to their ability to be changed into meth by the criminal minded people. It would not affect the everyday user if following the recommended dosage. Pat",
      "MessageIndex": 180,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 11, 2013 03:10PM Pattysmiles wrote: Soriya, I had all 4 of my CT chemos through my veins. Hope your port comes through for you, but it IS doable via vein if necessary. Pat",
      "MessageIndex": 236,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 15, 2013 01:27PM Pattysmiles wrote: Soriya, I ordered a monofilament wig from them. It is nice. Human hair is actually better quality wise....but they are over $1,000 I believe! Both need to be maintained (meaning washed). You need special shampoos , conditioner and sprays for the synthetic wig. Did you go to a Look Good Feel Better workshop? Go try them if you haven't. Here is the link to find one in your area. Scroll down on the link and you will see on your left side to enter your zip code. You will then click on the different hospitals or treatment areas to see what dates/times they offer the program. You MUST pre-register so they know you are coming...sometimes they might cancel if no one is coming! Or it could be filled! lookgoodfeelbetter.org/ Anyhow, they will have FREE wigs, and you get to try them on and check them out! If by chance the one you go to does not have wigs there then they will give you a coupon to take to a wig bank to get your free wig. They also give free makeup and bag and instructions on how to apply it. (Good quality makeup too, not dollar store quality!) mine also GAVE ME FOR FREE, the needed shampoos, wig conditioner and spray for the wig along with a wig stand! (Though I did go to another session at another hospital to go over the makeup again and at that hospital they did NOT give the ladies any wig care products!). If you don't get the wig care products I found that the tlc had a good price for the package. Also, you will want a wig comb or brush (I picked those up in a hair care shop by me) Make sure you measure your head (google for directions). If the wig is too little it will give you a headache and keep slipping, if it is too big it will look odd, you want \"just right\", like Goldilocks! :) Pat",
      "MessageIndex": 313,
      "PostDate": "15/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 28, 2013 10:15PM Pattysmiles wrote: Maziel, Sorry you are joining us, but you are in a great place to learn info from others. The wait to see the oncologist is the most difficult (well, for most of us I think!) Your oncologist will go over your pathology with you and discuss a treatment plan based on your specific type of cancer, stage and grade, lymph node involvement, mets, etc. Once you get your treatment plan (chemo?, rads?) you will have a better sense as to what to expect. There are plenty of people here that have gone through treatment and will share what helped them, myself included. Chemo today is not the same as it was years ago, there is so much more known to manage side effects. Try and not worry. It's easy for me to say, I'm not a worrier by nature, I prefer to deal with facts (and keep my wandering mind in check if possible). Please continue to ask questions (sorry, I did not have a port so I cannot answer about that). Pat",
      "MessageIndex": 668,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 1, 2013 08:49PM Pattysmiles wrote: Reality check, I wonder what answer this woman wanted? Or expected? Strange to ask such a thing....was she expecting you to say it DID bother you so she could tell you it shouldn't? I have had only one stranger comment to me,Moshe started with \"are you going through treatment\"? When I answered yes she told me she is a five year survivor of ovarian cancer. We chatted while on line at the store. She was very nice and wished me well. As for \"worrying\" if people stare? Never, not my problem! In fact half the time I am out I forget I am wearing my buff and \"look sick\". Whatever will be will be.... Pat",
      "MessageIndex": 781,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 5, 2013 10:26PM Pattysmiles wrote: HVV, Did you also use a stool softener , morning and night? Maybe prune juice, or someone had said a jar of baby food prunes. Pat",
      "MessageIndex": 870,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 11, 2013 09:39AM Pattysmiles wrote: NC...6 buffs....my hero! I think I started with 4! Then I just added that ebay 6 pack....which for the price was nice, but the styles are \"eh\". Now need to get my shopping finger on and press the \"buy\" button for a few more from buffusa. I like their colors. Cracked me up about the kids room....picturing face mask and gloves to the elbow along with a protective gown! Pat",
      "MessageIndex": 964,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 23, 2013 07:57PM Pattysmiles wrote: 2bluestars, I have not had masectomy yet. I have read about the drains. You might consider taking a pain med if you are that nervous about having the drains pulled. I know I had one removed before I left the hospital from partial masectomy but I didn't feel a thing...perhaps because I had pain meds in me! Some people have to pull their own drains...or have someone pull them. (I think that is rare) You or someone else will have to empty those drains, they will give you a chart to fill out. Once the drains (drainage) are \"low\" for a day or so (maybe 3? Not sure) then they can come out. There are a few reconstructions I was told about from my PS...implants or Tram flap. I learned on this board there is also DIEP flap. Check out the boards to find out more. Pat",
      "MessageIndex": 1165,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 27, 2013 06:01PM Pattysmiles wrote: Greetings! I just had my double partial masectomy (or yes, lumpectomy, but these too were a bit larger). One side was reconstruction only and the other cancer removal, reconstruction , both lifted. Now I am reading I should have waited for radiation! Will try to not panic here. The PS purposely left the cancer breast larger, knowing radiation would shrink it. But reading one of you was a D and went to an A! Dear lord, I was a B before, I'm sure I'm smaller now, are they going to invert! (I say that laughing, somewhat) All might be moot, I had 6 tumors removed, the doctor says I am stage 1, but does not like the number of tumors taken out (we thought there were 3-2 ILC and 1 LCIS). My nodes were tested, , though report seems unclear as it looks like it is reporting on 3 of 4. 3 negative, with one of those three with 18 tumor cells, apparently there needs to be 200 to be considered positive...so I am told this is good? Anyhow, my case is going before a review to determine if I should go back for one better margin(one is at1mm), or if I should have masectomy. No family history, BRCA is negative (just found that out) and someone will be finding out if I am eligible for oncotype dx. Dr. also discussed idea of sending me back for MRI- she will be looking into that. Sheila, I see you are in Westchester, I am too!",
      "MessageIndex": 14617,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 31, 2013 07:24PM Pattysmiles wrote: Thank you seabeal. I appreciate your input!",
      "MessageIndex": 14622,
      "PostDate": "31/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 6, 2013 02:17AM Pattysmiles wrote: Happy mothers Day Anne! (Twice over!)",
      "MessageIndex": 758,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 7, 2013 02:52PM Pattysmiles wrote: Thanks Pamela for the Roller Coaster ride review. I have only been through the Alley of Anxiety and today head to the Nasty Neulasta curve...wishing the roller coaster was as fast as a real one! Pat",
      "MessageIndex": 795,
      "PostDate": "07/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 15, 2013 09:38PM Pattysmiles wrote: I used to get a style all the time as a teenager, cheap makeup, poor washing etc...take a teabag, any kind as far as I know, put in boiling water, wring out and place on the style..be careful it isn't too hot. It will get things moving. You can google to look for other \"cures\". I had my son do this recently and it worked. I had gone to CVS to buy Stye (yes, an eye medicine called Stye) and when I read the two ingredients I remember thinking how one of them sounded like it would block up the clog...now obviously that can't be right! But it sounded like a petroleum type thing and all I could think of was \"clog\" Anyhow, repeat a few times a day, might take a few days. Pat",
      "MessageIndex": 947,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 17, 2013 08:00AM Pattysmiles wrote: Same, Here are the mouth care tips I have noted from the board... To try and avoid mouth sores suck on ice chips, frozen Popsicles, icee, during Taxotere. Biotene mouthwash, use to rinse after every meal. To prevent/treat mouth sores Sugar free gum (biotene also makes a gum) Biotene toothpaste (I think i will buy stock in biotene) Rinse: 1/4 tsp salt, 1/4 tsp baking soda , 1 c. Warm water. Rinse and spit. Make new batch each use. Rinse: 1 tsp EACH Benadryl and Maalox. Mix, rinse , spit Rinse: club soda Rinse: Caphosol- 2 ampules..mix swish, spit. Change toothbrush frequently As I said, these were copied from other chemo patients. Naturally you should call your MO if your problem should persist. Pat",
      "MessageIndex": 968,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 17, 2013 09:07PM Pattysmiles wrote: Ok, thanks for the hair tips ladies. I'm sure it will be sooner rather than later. Oh the joy! I warned my 10 year old Daughter that this might be the \"last Friday\" I have my own hair. She is not happy I will be losing it, I wanted to give her some notice. I'm sure she will be fine. I think we will all need a little time to adjust. Pat",
      "MessageIndex": 979,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 23, 2013 08:18PM Pattysmiles wrote: Pamelakay- well put! I attended the Look Good Feel Better workshop. (LGFB) lookgoodfeelbetter.org/ They give a free makeup kit and show you now to use it. They also offer free wigs (or send you to the \"wig bank\" for a free wig). I am now committing myself to wear makeup. I am an \"all natural\" kind of girl, but, what the hell, breast cancer isn't me, so why not try and make myself up to go with the new head wraps, wigs, etc! I am also committing to get my nails done. Once a week, I AM worth it. As for the chocolate thing...I decided to eat Girl .scout cookies prior to chemo to \"treat myself\". I should have applied the boxes directly to my hips! Lol. But I DID enjoy them. During chemo, fornthe first week I went for chocolate shakes at McDonalds...a big no no in my book, but I TOTALLY ENJOYED them, and the weight I gained from that AND the carvel thn mint avalanche (or whatever that sundae is) was worth it at the time. Find the thing that will bring you joy and do it. We all need to feel good about SOMETHING. Though I am thinking I am giving up the food aspect as I will likely be pissed I'm putting on weight! Lol. So NAILS it is! Pat",
      "MessageIndex": 1050,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 3, 2013 04:45PM Pattysmiles wrote: Jen and Katie, Congrats on your last treatment. Our place doesn't have a bell! It was a bit sad when the \"old man\" there had no special way to mark his final treatment. Pat",
      "MessageIndex": 1183,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 6, 2013 12:56AM Pattysmiles wrote: Carol, do you have an allergy to latex? I recall something about the needle having a latex thing...if allergic alert your doctor....I remember because my mom is allergic to latex, so when i read that I thought of her. Pat",
      "MessageIndex": 1211,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 13, 2013 11:00AM Pattysmiles wrote: Regarding wigs...and haircuts... First the most important...hair. Please consider NOT shaving all your hair off. I went from should length hair to pixie cut...was shocked and then discovered I actually liked it. Then I attempted to go even shorter and the stylist (different one)wouldn't do it, she only trimmed so i wasted my money. When my hair started coming out i took the barber clippers i own and clipped mynhair, using a number 6., and on the top i chopped away using scissors...what the heck, i wasnt paying for ANOTHER haircut (this was two days after sylist refused to cut me shorter) and i figured not too many people would be seeing it! despite my hair falling out I have not lost all my hair! It cqme out for anout a week (started 12 days after first treatment) and then stopped. almost none came out again until 3rd treatment, and it isnt significant as first time around. Yes, it IS thinned out, but it isn't all gone. I have 3 kids, youngest is 10 yr girl...she has been fighting my hair changes, with tears, but then is quickly accepting, as I think she realizes I am still ME, just with a different look. A number of women on the other chemo threads have shaved their heads and complained of \"stubbies\" that hurt, are rough, and are annoying. They have said they wish they didn't shave it. It IS a personal choice, yes it IS taking control too, but not allof us loose all of our hair. The first thing I do when I am home is whip off my head covering and maybe slip on a yoga band...which pushes up my hair to look like \"Bart Simpson\" hair . I'm fine with that, my kids are good with that and I even let the neighbor kids in like that. (It's so darn hot who really wants to keep their head covered!) Wigs.... Check with your insurance company to see if they are covered. (Mine wasn't). The oncologist had written me a prescription (and darn ifi can remember the technical name for wig! Lol)...some sort of prosthetic. Also check your local Look Good Feel Better program, it is run by the American Cancer Society. They provide free makeup and instructions and provide a wig of your choice (well, based on what they have, which is a pretty decent selection) and if they don't have wigs on site they set you up with a wig bank for your free wig. Here is their link, scroll down in the left side you will see to enter your info. lookgoodfeelbetter.org/ Also, when buying wigs they come in sizes! Petite, Average and large...my noggin is large, so I am not comfortable in the \"average\" size wig I chose, my mistake! Here is a link to reasonably priced accessories and wigs and I believe they get into the description of the different types of wigs too...not sure about that. www.tlcdirect.org/default.aspx... I did go to a professional wig shop, and did not like the idea of a wig for me. Personally I just couldn't see me wearing one. I didn't like anything I tried on, I was miserable and then I found out the insurance didn't cover the $400 wig I \"sorta\" liked....for $400 I BETTER like it! I DID like what I learned from the wig people though...I think a monofilament wig is good, hand tied better...that's for the \"fake\" stuff...obviously real wigs were even better, but a heck of a lot more money. My preference is the buff. I have purchased 4. One for working out in....the others for \"everyday\". What I really like is that I found some shirts that almost match them, so I am practically coordinated! Lol (I'm a t-shirt sort of girl, so this is a step up for me!) Here is their website. Www.buffusa.com. They also have them with UV protection! (Not all though) With my sporty buff and my makeup done (I'm usually a no-makeup girl) I feel really good about myself. There are many ways to wear the buff, I just pull it on and pull the extra material into a high ponytail in the back...which comes in handy when my daughter wants a hair tie when we are out (so now I am sure to put two pony tail holders on my buff) Here is a link to get the idea of a buff pulled into a pony tail...just ignore the hair in the photo! www.itssimplyzen.com/Buff-Head... I have not gotten \"into\" tying scarves. I LOVE the look, but it is so much easier for me to whip a buff on and off. I have also purchased the cotton head coverings and gone to the dollar stores to buy hair bands to layer with. Ive used that look once or twice, and liked it. Even found a black turban in a dollar store and accessorize it with a headband, or a scarf. Yoga bands...my cousin sent me some headbands. These are them. yogitoes.com/tools-accessories... At first I thought, \"what the heck am I going to do with that!\" But then I relized I could use them under my buff to catch sweat when working out, or for everyday to add a layer of coolness...they are stretchy and comfy...these are what I use for my indoor Bart Simpson look. I imagine it could also be used as the hatband \"liner\" when wearing a hat, to hide baldness.... So there are alternatives out there...keep looking! Pat",
      "MessageIndex": 282,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 17, 2013 01:44PM Pattysmiles wrote: Good luck Soriya and Lynn. Soriya, don't worry the meds they give you during chemo sometimes make you sleepy...if you didn't get enough sleep you will sleep in the chair. Good luck, don't over think this. You will be fine! Pat",
      "MessageIndex": 356,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 9, 2013 09:17PM Pattysmiles wrote: Sue, Did you see the buff set on ebay? www.ebay.com/itm/Bundle-Monste... I ordered them, needed something new! Also check out www.buffusa.com. They are a lot cheaper than CBS Survivor...and only has the buff logo showing on 2 sides (not too noticeable, but I still wish it weren't there!) I have a few different ones, some have UV protection. Love to try and match them to my clothes if possible (and I am not a \"matchy\" type. Pat",
      "MessageIndex": 935,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 10, 2013 08:39AM Pattysmiles wrote: HVV I put on my buff like it is a kerchief, all the excess in the back,then I use a ponytail holder and make myself a pony tail with the extra material! I like that better than just letting it drape (I used to hate my hair on my neck! You could also tuck the excess under the back near your neck, I haven't done that. I agree with Sue, look at the video,not here are a few ways to wear them. I usually just I'd the \"pony tail\". For those who missed the link.... www.buffusa.com/sports/ If it is still on the cover page I have the one that is half \"pink and half blue with the flower...it is my absolute favorite. Depending on the color of my shirt I just turn it around on my head. I also have a blue print shirt that sort of matches the blue part of that buff so I look coordinated! Pat",
      "MessageIndex": 944,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Aug 10, 2013 11:10PM Pattysmiles wrote: Gma, if you haven't read about the Claritan it is .claritan 24 hour. Take one morning of Neulasta shot and one each morning for the next 7-9 days. Some have taken it the day before Neulasta and all the rest of those days above. Some take an Aleve along with the Claritan. Please remember to check with your oncologist prior to following \"our advice\". My MO had never heard of it, but didnt deny me taking it. The nurse who gave me Neulasta said I was the only patient they had that did not complain of bone pain and could tolerate the full dose of the shot. I credit the Claritan. Pat",
      "MessageIndex": 958,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 23, 2013 03:15PM Pattysmiles wrote: Thank you Jen, I will pick up the Claritan 24 Pamela, thank you for your schedule. I am not on the same chemo (mine is TC) but I have noted what you have written and will be questioning the chemo nurse endlessly on my first day. I will be creating a calendar to fill I need to take meds and when they are needed. Also found a link to chemotherapy side effects worksheet. www.cancer.org/acs/groups/cont... However it seems a bit involved, I might just keep it written on a calendar, so I can see at a glance what happens when and will sort of know what to expect each go around (although I know that is subject to change) You all are great information sources. I am so happy that everyone shares so freely and is so welcoming. While its not a club I wanted to join, having this level of support sure does make it easier. Thank you! Pat",
      "MessageIndex": 526,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 26, 2013 04:36PM Pattysmiles wrote: Hi Carol, I have not yet started my CT, it will be May 6 for me. My doctor told me no port,I will be doing 4 rounds. I hope you are feeling better. May I ask how you knew it was infected? I am one of those people \"if it can go wrong it will!\" Lol, just wanted to know what to look for, and did they tell you to look for it or did you just happen to notice. Regarding the hair, my doctor had said two weeks after first infusion. I've already gone from mid length to short pixie...which was a shocker, but I'm sure not as shocking as the \"inevitable\" Keep strong, you are 25% done! Pat",
      "MessageIndex": 606,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 28, 2013 12:47AM Pattysmiles wrote: Thank you for sharing Carol! Now I know one more thing to look for. I hope you get to feel a better for when you are ready to go again. I had spoken to a survivor on the phone and she kept mentioning \"when the pity party comes go with it\"...she must have repeated that 3 different times during our conversation. I finally wrote it down (as I was taking notes) and realized I better be all set for a pity party! (Even though I don't think I am \"that type\"-I'm guessing this is soooo something that will bring me there!). So when I got off the phone I looked up the \"rules\" for a pity party (and yes, I found some!) and made a poster \"Pity party in progress- go away\" and then an \"all better\" poster. Then I sat down and explained the situation to my hubby and kids so they can know what they might expect at some point. (Better to hear the description from a happy mom, then from a desperate hubby!). I also heard about the \"steroid rage\" and made up a poster that said \"RUN\". Lol, told my kids if they see that they BETTER stay away! Lol Also went and got a shorter haircut, not loving it, but not hating it! And I had picked up a wig from the Internet (had gone to a wig store but $450 for something I didn't love!-insurance not covering)...so I am ready for the hair loss (as ready as one can be?). Garden girl, you are right, everyone keeps telling me it doesn't happen to everyone. I'm glad they are in the denial for me! Perhaps they should have placed a bet with me! Then I would have money to go out and buy a REAL hair wig! Lol Anyhow, I share these stories because I know what we are all doing to prepare ourselves, and I don't think I've seen pity party prep (say that 10 times fast!) or hormonal/steroid rage listed! Wishing you all the best! Pat",
      "MessageIndex": 630,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 1, 2013 01:39PM Pattysmiles wrote: Pamela, I am so sorry you have to wait again. I agree, 2013 sucks! Hopefully you can take advantage of the good weather and do something fun during those two weeks. Please turn it around and make it work for you! Pat",
      "MessageIndex": 685,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 6, 2013 06:22AM Pattysmiles wrote: Ok risen, I will see you on the May boards. I was supposed to start in April too, but was pushed to May. These boards ARE wonderful. So much info, way better than a conversation with the oncologist. Real people, real stories. I appreciate every one of them. I start tomorrow. Can't say I am excited, but can say I am informed! I'm sure that is a lot better than patients that stick their head in the sand. See you in May, Pat",
      "MessageIndex": 763,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 8, 2013 02:33PM Pattysmiles wrote: Thank you all for the hair stories. As I was driving to Chemo I saw a mannequin with some pretty white and pink hair. I wanted that wig,so the next day, when going back for Nuelasta shot I went into the store and the woman was able to sell it because she had stocked different wigs and could give me her last pink/white. This was a \"hip\" type (aka, expensive) clothing knock knack shop for kids/teens. I wanted the wig so I could wear it to a big family party Memorial Day weekend. I really don't want to be in pictures with some UGLY wig, and look back and remember my cancer that way. I would prefer to have a little fun. I do have a sense of humor, but the colored wig is so not me. I am looking forward to a little re-invention. I'm grabbing this opportunity to explore! My daughter, age 10, is adamant I cannot wear it near anywhere her friends would see. That's ok. Also picked up two pairs of oversized sunglasses to go with the wig and bandanas. Why not!",
      "MessageIndex": 823,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 11, 2013 03:07AM Pattysmiles wrote: I had read to take the day OF and then for 7days after. That is what I am doing (heck i might even go to 10 days just to be safe?) i have had NO PAIN, I have even been back to the gym. I am taking the Claritan 24 hour. My Nuelasta shot was for 3:00pm the day after my chemo. I took the Claritan at 7:30am, when I was getting breakfast for my kids. And I have been trying to stick to that time every day.....I don't want to add bone pain to my woes! Yesterday I was completely exhausted, but made a point to mumble to my hubby \"bring me my Claritan and Prilosec\". , thankfully he did! Lol. No bone pain, no heartburn, life is good!",
      "MessageIndex": 866,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 23, 2013 09:51PM Pattysmiles wrote: Shortness of Breath None Mild – With exertion Moderate – With normal level of activity** Severe – At rest** **let your doctor know about this right away For those with shortness of breath please see the above. It comes from this side effects worksheet that is from the American Cancer Society. www.cancer.org/acs/groups/cont... Pat",
      "MessageIndex": 1056,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 14, 2013 07:23PM Pattysmiles wrote: Indenial, glad you are done! Soon you will be feeling better! Yeah! I had heard that a lot of people become \"down\" when treatment is done. We've ridden this roller coaster, some for longer than others, and then suddenly it stops. There is an adjustment period to getting your \"land legs\" back. I think of it as planing a wedding (without the joy!). , busy making appointments and doing all the stuff to get there, then it is done and you wonder what you used to do with your \"spare time\". Forewarned is forearmed. 6cats, if my husband turned me down I would be in shock. Seems he is always raring to go...even after funerals! Sorry you were turned down. Anne, I haven't had those treatments, I'm sure someone can answer sooner or later, or go checkout the April Chemo board. Glad your meningitis has cleared up! I am freaking exhausted. Oldest had two regents this week. Middle guy can't get his papers together to study, went through his folders today, as he had no school,and discovered there are no study guides??? So an email into the teacher , awaiting a response. Went to weight watchers today and could not decide to stay or go...i had taken off 25 lbs, then purposely put weight on thinking I would lose with chemo...played the game and i lose! lol. I have gained weight with chemo. so finally decided to re-up and will continue, hoping I'm not throwing my money away, as i will be having surgery in the fall and also have Tamoxifen to start....Have my final Girl Scout meeting tonight and am finding half the girls might not all be there because this lousy weather has pushed softball championship to tonight. And I have the local Relay for Life I am going to go and check out early evening...which brings up a whole other emotional piece. I'm drained. Started taping off sons room to paint and I also wound up priming. Now I ruined the manicure I gave myself last night, still need to finish cupcakes for meeting and get badges, plates, cups etc ready..... This is my Last weekend to \"enjoy\" myself before chemo #3 on Monday and final exams all around for the three kids next week. Uuugggghhhh! And I wonder why I am tired? Time for coffee, while I can still enjoy a cup. Oh, guess I better take my vitamin D as supposedly it will give me energy? LOL Pat",
      "MessageIndex": 1313,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 12, 2013 09:13PM Pattysmiles wrote: Annie, so glad your onc is up on things! I sure wish mine was! Lol I've been doing 7 days of pills, well, actually 8. One the day of and then for the next 7 days. It has worked for me...maybe overkill? I'm not one to take meds unnecessarily either...but in this case I felt it was necessary. Soriya, keep fighting. Sounds like you have a good oncologist if everyone is speaking so highly of them. That is very important. Don't think too hard.... Pat",
      "MessageIndex": 264,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 15, 2013 03:45PM Pattysmiles wrote: I do believe it is...and based on your IM regarding your body type that would make sense. Mine is \"large\"...and I am tall enough and heavy enough to agree with that.! I have an \"average\" size wig and it is NOT comfortable. I have a \"large\" size wig and it fits VERY comfortably. Just make sure whatever you place in your shopping cart is the correct size. On one site I looked at I thought I was looking at \"large\" size wigs due to the search I had used, but some of them were average! And,....I don't even wear the wigs I have...one from TLC, and two from Look Good ?eel Better (long story on why two, you are only supposed to get one). It is ME, I don't like the \"look\" or \"feel\" of a wig. I am way more comfy in my buff. Www.buffusa.com Pat",
      "MessageIndex": 315,
      "PostDate": "15/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 16, 2013 11:21AM Pattysmiles wrote: Michelle, Best of luck on your first to around. N hopefully last weeks fiasco will be your worst \"side effect\" of chemo. Glad you have been reading here, you have probably learned a lot and will be better prepared than those that don't take the initiative. Pat",
      "MessageIndex": 337,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 16, 2013 10:47PM Pattysmiles wrote: Soriya, I have not read specific guidelines as to the amount to drink...there are a lot of ideas on it though. For me, I get up on \"chemo day\" and drink water with breakfast (because my coffe already taste different from my steroids!) ...usually I try and have 2 glasses before I leave the house. (Up at 7:30 and leave by 9:00). On way to chemo I drink more water...usually one bottle, it takes me 45 minutes to drive there. While waiting for chemo I drink about 1/2 bottle of regular size bottled water, and i finish it by the time i get into treatment. during chemo i break open one of those BIG Poland spring bottles (looks like it holds a gallon?) and drink a few cups of it ...maybe about 1/2 the bottle? That is within the 3 1/2 hours I am there. I also drink the icee I bring with me, and eat the food I bring with me (my center doesn't give food). I try and drink another bottle of water on the ride home. When I get home I put the remainder of my BIG Poland spring bottle next to my favorite chair and try and finish it before bed (which for me is around midnight) I try and drink as much the next day, assuming I'm not sick of water! Or it's not tasting \"eeeew\" . I have changed from water to flavored waters, Gatorade, or other liquids on day after (which I call day 2) and the day after that (day 3). Usually on those days water tastes \"bad\" and I am into other liquids, I also eat a lot of watermelon (juicy, cold and tastes good). It is definitely more than the recommended 8 glasses of liquid a day on a regular day for people (and I usually don't drink that recommended 8 glasses when I am \"healthy\"). Do what you can, when you can. Wishing you all the best on your first go around! Pat",
      "MessageIndex": 344,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 25, 2013 06:06PM Pattysmiles wrote: Blue stars...constipation, keep up with the stool softeners and take the Miralax DAILY , start on chemo day, or even day before. Once you stop taking the anti-nausea meds, or slow down taking them, you should be able to stop the Miralax and stool softeners. That is what worked for me, but we are all different. I had read to try puréed prunes, baby food! I did, buy them, in case, but thankfully didn't need them. Best of luck with the next round! Pat",
      "MessageIndex": 587,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jan 8, 2014 09:26AM Pattysmiles wrote: do you have health insurance?  If you do check and see if a wig is covered. (My insurance didnt cover but many do).  There is a technical term, it's not called \"wig\", but the name escapes me.  Reach out to the American cancer society Look Good Feel Better program.  They run classes about doing makeup (and give very nice samples!) and they also give free wigs (at most of their sites, or give a coupon for their wig banks). I had gone to a wig store, tried on wigs (prior to hair loss) and was miserable..I felt none of them was \"me\". But, I did learn A LOT.  So you might want to try that route.  My brain doesn't recall details (never did so I'm not blaming chemo) but ifi recall a monofilament wig is good, hand tied even better and of course a natural hair wig is top of the line but VERY costly.  Also good to go to a wig store to figure out the size of your head a the wigs do come in sizes....and naturally my BIG head has little in the way of brains! Lol Here is a link for a free head covering.  http://www.goodwishesscarves.org/ I wound up not wearing any of the wigs I got....except for a cute pink/white one for a family party and out to dinner with the girls.  I enjoyed wearing my buffs.  I had a number of different ones that seemed to color coordinate with my wardrobe (and I am not a coordinated type) http://www.buffusa.com/sports/ Wishing you all the best. Pat",
      "MessageIndex": 1,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816620",
      "Title": "Wig shopping in Horsham, PA area birdlover23 Donna2012"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 23, 2013 01:31PM Pattysmiles wrote: Indenial, I picked up my prescriptions at CVS. I had to ask the pharmacist what was what. There ARE two nausea meds. Zofran-which the pharmacist said is stronger. (My plan allowed for 13 pills on one fill, have 2 refills-would need to wait 7 days to refill) Compazine-which the pharmacist said would cause drowsiness. (Received 30, with 2 refills) The other was the steroid-dexamethasone 4 mg. take 2 twice a day , day before, day of and day after taxotere. Would still like to hear about the Claritan if anyone can advise. Which one is it, and when to start and end it. Thank you! Pat",
      "MessageIndex": 523,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 24, 2013 04:54AM Pattysmiles wrote: Daffyc, I like to be organized, I like the notebook....I did something like that when I had my babies, wrote down my eating, drinking,their eating , drinking , diapers etc.... I will also need to see side effects on a calendar, I LOVE my month at a glance pocket calendar in general, but for sure there is no room on it for all this! Lol. Definitely don't need to be carrying a desk calendar,I will work on a happy medium. Thank you JC...I definitely will mark down the Claritan regime. For the no memory people, I have the worlds worst memory,and that was prior to 3 kids! I cannot imagine post chemo! Anyhow, I found this link making \"fun\" of having cancer....there are. Lot of jokes referring to \"chemo brain\". .. Take a peek for a few good laughs, ive read the first 50 pages and i dont thinknibe seen a joke repeated! community.breastcancer.org/for... Pat",
      "MessageIndex": 533,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 15, 2013 06:08AM Pattysmiles wrote: Pamela, Personally, I have no problem with hugs...but I do get the Neulasta so maybe I am in a better condition? Generally speaking I am a very aware of germs. (Prior to BC). I carry hand sanitizer and use it. I much prefer a hug, where I can turn my head away from someone's face while holding my breath, to a kiss on the cheek. Maybe a fast double hand grab, good squeeze, get that hello out of the way, then go sanitize those hands! I would be as concerned just being in a crowded room, regardless of the hugs, or should I say a hug is as innocent as a crowded room? Everyone is breathing the same air. I had read somewhere that if someone coughs to hold your breath for 10-15 seconds as the germs \"fall\" prior to and as walking past their \"cough path\". I don't know how true that is, but I do that too! Lol Anyhow hand sanitizer, even the pen shaped spritzer one is good (though it runs out quickly). If all else fails you might consider wearing a shirt with spikes sticking out, I would think it would be a good deterrent, and I am sure it is \"in fashion\" somehow! Lol Pat",
      "MessageIndex": 938,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 17, 2013 01:09PM Pattysmiles wrote: Allie, Call your insurance company and or ask the office manager if you have to do the copay for the shot....it can't hurt. I was a bit out off to be forking over my copay when I started chemo, so I finally asked. \"Is this for EVERY visit, so I know to have a check ready. Response-yes. So the next day I go for Neulasta shot and have my checkbook in my hand and she said \"no copay today\". So, maybe yours can be waived? It might be considered a part of the chemo from the day before? Can't hurt to ask. Good luck. Pat",
      "MessageIndex": 972,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 24, 2013 04:29AM Pattysmiles wrote: Kerri, Go to page 1 of the May board, scroll down, the moderators posted some links that I believe have some good info, in fact I think a lot of what I posted is from there. Pat",
      "MessageIndex": 1067,
      "PostDate": "24/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 31, 2013 11:33PM Pattysmiles wrote: 6cats, did I mention I also saw a podiatrist for ingrown toenail and possible nail fungus prior to chemo! Lol Anyhow, ingrown toe nail was fixed. My other toenail was determined to not be a fungus. He did mention he sees A LOT of chemo patients who lose their nails,,,,I guess he is expecting me back? I am wondering if our skin conditions are getting better because we are hydrating so much? It could in theory, have a part in it all. I do notice that my skin seems softer...especially the face, but it could be from the \"chemo peel\" I had done prior to chemo? Pat",
      "MessageIndex": 1164,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 9, 2013 03:26PM Pattysmiles wrote: Kerri, Sorry you feel so bad. Did you take the Claritan to try and ward of the bone pain from the Nulasta? (One Claritan 24 the morning of Nulasta shot and one each morning for the next 7 days) It does not work for everyone, but worth the try if your MO is not against it. (Mine didn't care one way or the other) Regarding the mouth, was it sores? Try chewing on ice chips during the taxotere drip (my drip is one hour)...I have not had problems with mouth sores. I did have maybe 2-3 days of a strange feeling in my throat, which was \"worse\" the first chemo as I had not iced my mouth the entire hour (was talking too much!) My \"so tired I need to sleep\" phase was about day 5-6 on first round and second round was day 4-5. Take your naps if you can. I felt \"normal\" by day 7 or 8. Definitely felt fine for week 3. Are you eating protein and foods that help your red blood cells? At my second chemo they told me my vitamin D was lower and I needed to take supplements. MO told me it would give me more energy and I wouldn't feel so tired. Funny thing was I wasn't tired at all! (Except those few days) One last thought, try and get up and get moving....I had read on these boards that a lot of women \"pushed through\" the exhausted feeling and felt better for it. I did that first time around, just told the hubby I needed to walk around the cul-de-sac...it was raining, I didn't care. Carried my umbrella and did a few to a rounds, and I DID feel like I had more energy. Keep writing those questions down for the MO. You can even call them and tell them how you are feeling (that's what they get paid for!) and they might offer you some good advice, why wait! Pat",
      "MessageIndex": 1243,
      "PostDate": "09/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 13, 2013 01:56PM Pattysmiles wrote: Kerri, I was checking my calendar,trying to decide \"when is the best time to cut my hair off\". Didn't seem to be a \"good\" day as I had a lot of functions. But I did manage to wait it out despite the tingling/pain. The hair doesn't suddenly all come out. You will notice more in the comb, shower, or your fingers if you run your fingers through your hair. I had cut my hair very short, by myself (after beautician insisted on not going so short so she cut it to where she wanted to). My self haircut was Not a job I want to show people! Lol Anyhow, I had a lot of days I lost a lot of hair, my hair is very fine,but apparently a lot of it. Thankfully I had a sink strainer in the bathtub, which I was cleaning out every shower, with quite a bit of hair in it. I would say the most came out during days 12-19(after first chemo), then it slowed down a lot. In the early stage of hair loss I would see the hair on top of the strainer in the tub, now I don't see it, but I find small amounts when I wipe the strainer clean with a tissue. I start round three of chemo on Monday. I honestly thought I would get that tingling, scalp pain again after round two and go back to losing more hair quicker (as opposed to the \"small amount daily\"), but it hasn't happened like that. I think my hair is definitely thinned out a lot,mid my self inflicted haircut weren't so bad perhaps I would try wearing my faux military cut...but I much prefer to keep my head covered. I think it is easier to let people think I'm losing or lost my hair as opposed to trying to explain my poor haircut, with some thinning spots on my head. Telling you this so 1- you don't go chopping at your own hair! Lol 2-you might not lose ALL your hair, so you need to decide what is best for you. Also look for a look good feel better workshop near you, run by the American cancer society. They will give you a free wig! Pat",
      "MessageIndex": 1292,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 14, 2013 02:12PM Pattysmiles wrote: Onawing, sounds to me like you figured out your own answer!? Definitely bring it up to the doctor, and TELL the doctor you did not get all your fluids. I've been reading a lot of our stories...it is \"funny\" (NOT,) how the nurses decide what is \"best \"at the time...but they aren't seeing the after effects, WE read about them here! The only other thing I could see them saying is the effects are cumulative (get worse) over time. Now I could understand that if nothing had changed during infusion. I wonder how many of us had had \"cumulative\" effects because the nurses change how they do the infusions! Pat",
      "MessageIndex": 1304,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jul 14, 2013 06:56AM Pattysmiles wrote: Pamela, I am sorry you had to suffer the lost of your breast, yet again! Did you ever consider DIEP? There is a thread on it. I found it interesting, and it will be my reconstruction come this fall. Wishing you the best. Feel better. Pat",
      "MessageIndex": 1438,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 1, 2013 10:20AM Pattysmiles wrote: I use the caringsbridge, I never thought of it as morose. I update it as I get information. I wish that everyone would read it as I still get family members that call for updates. I had specifically let everyone know I did not appreciate having to repeat myself, especially as I have young children (ages 10-14) and I don't want them thinking I am \"harping on\" my disease. One \"friend\" , who I don't speak with too much, so more like an acquaintance, had the gall to call and ask me to tell my hubby to call her with an update when I got out of surgery! Lol. People are funny. The amount of phone calls he got while I was in my hospital room recovering was ridiculous, and he had sent text updates. I guess I should be happy so many people care? (Or better yet, he should have ignored the calls) There are a lot of great options out there,I am sure you will find something that suits your needs. Pat",
      "MessageIndex": 11,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/802470",
      "Title": "Updating Loved ones angielee Pattysmiles"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 29, 2013 08:31PM Pattysmiles wrote: Wish I had read this before I started chemo! I purposely packed on the pounds prior to starting! I want to have DIEP flap surgery after masectomy and my belly fat will be my new boobs. Was afraid tmlose the fat I had to chemo, so I started eating. Darn! Now I'm up 12 pounds...doctor for DIEP had said to maintain my weight. Jokes on me! Pat",
      "MessageIndex": 24,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/640264",
      "Title": "weight gain from chemo? Mandy41 GoWithTheFlow"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 12, 2013 09:29PM Pattysmiles wrote: A very disappointing day today. Surgery scheduled for this Thursday only there has been NO COMMUNICATION in regards. I finally call the insurance company to see if they have the approval # for hospitalization...and they don't! I tracked down my nurse navigator, who did NOT answer my email to her from yesterday (she was out sick, so I don't blame her) AND I HAD LEFT HER A VOICEMAIL THIS AM (apparently she couldn't retrieve it as she was in a different office, different town today!) She said my surgery was not this Thursday as I had opted for BRCA testing and they were awaiting results. She also said I had told the geneticist I would wait for the results. I NEVER told that to the geneticist! I had told her I was keeping my surgery and she seemed dismayed and told me I better let the plastic surgeon know when I saw her the next day...and that is exactly what I did! WTH! I hung up on her. Then I gathered my thoughts and started sending her an email. Why would I see the plastic surgeon before getting my BRCA results if I thought it would change my mind? Why would I have complete pre-surgical clearance if I did not have a surgery date? Who is failing to communicate! Why is the geneticist agenda being advanced and not mine. BTW, I COULD NOT STAND LISTENING TO the GENETICIST, I tuned her out in 15 minutes, my notes all say things like \"why am I here\" , \"this is dull\", \"get me out of here\"! Why , because I had told her regardless of the outcome I would NOT opt for mastectomy at this time, so why would I listen to her! Ugggh, so now they think they MIGHT have my BRCA results by this Friday, and if negative can reschedule me , to \"fit me in\" at some point next week. \"\"Fit me in\"? I'm a surgery, don't \"fit me in\". , I don't want anyone rushing through because I was \"fit in\"! If the results are positive then my surgery will be in April as I will need to meet with the PS again to discuss options, and I told them I would want to meet with an oncologist to discuss options. Okay, maybe I should not have agreed to do a surgery without all the info? But then TELL ME I'm off the calendar. I had sitters lined up,I let people know what was going on, and I was MENTALLY READY, I know all things happen for a reason, keeping my fingers crossed that the \"reason\" is something small. Pat",
      "MessageIndex": 335,
      "PostDate": "12/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 22, 2013 02:47PM Pattysmiles wrote: Went to the PS this am. Last night my reconstructed left breast (no bc) was more red and enlarged. So naturally it was \"almost fine\" today. I felt a bit of a fool being there. I'm convinced it is the post surgical bra that caused my problems. One of them is a size smaller than the other. When I wore the smaller one (in order to wash out the other) I became red and larger in the left breast. then naturally, next day wash out the smaller bra, wear the larger bra, and \"leftie\" looked a bit better. When I wore the smaller bra again leftie looked way worse. Last night I wore a regular sports bra after washing out my \"large\" bra and woke up looking way better. Doctor was unsure if it could be the bra. Um, I don't think i will try and find out again, smaller bra is now off my list of options to wear! Glad it is not necessary to drain or whatever else they would consider to make smaller. Time will heal it. I'm exhausted from this little battle over my \"good\" breast. My initial surgery did not get to me like this did! I'm emotionally drained. On a more important note. The ex-lax has worked. I think I will go to weight watchers and weigh in, I must have dropped a few pounds! Lol Praying for all my sisters awaiting surgery that you have great success. Praying for my sisters recovering that each day finds you closer to feeling better. Pat",
      "MessageIndex": 503,
      "PostDate": "22/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 29, 2013 09:21PM Pattysmiles wrote: Good luck Maureen!",
      "MessageIndex": 787,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 11, 2013 11:56PM Pattysmiles wrote: I am scheduled for partial mastectomy this Thursday the 14th, immediately followed by reconstruction. I was diagnosed with ILC on Feb 19, after further biopsies for marker placement from a diagnosis of LCIS. I believe my follow up will be radiation and tamoxifen, but is subject to change. So far I'm not stressing, too busy with 3 kids, ages 10,12,13. Can't worry til after all the results are in, them I will deal with that. Praying for all facing surgery, and for those who have already had theirs. Pat",
      "MessageIndex": 320,
      "PostDate": "11/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 15, 2013 02:06PM Pattysmiles wrote: I am back on the roller coaster heading uphill. I am now slated for surgery this Monday. I think they need a new geneticist in this office. Apparently she is a lap dog. They need a good fighting Doberman to fight for the patient. The nurse navigator asked the geneticist if she was giving the insurance company hell regarding getting the approvals to the lab, and her response was \"I'm not like that\". I think she is in the wrong job. Ugh, Anyhow, going in Monday for my partial mastectomy and reconstruction. Husband and kids are participating in a St. Baldricks head shaving event Monday night, unrelated to my diagnosis as it was planned prior. I will be missing an exciting night, as my one son is not the type to shave his head! Hopefully there will be video for me.",
      "MessageIndex": 398,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 21, 2013 09:15AM Pattysmiles wrote: Gardengirl33, thank you for the well wishes (and everyone else's too!). I understand the bathroom thing, who would have thought it would be a concern! Lol. Popping stool softeners on a schedule with my pain pills! Another hurry up and wait situation! The sleeping with the dogs sounds nice. Right about now I would love to have a dog, but don't tell that to my husband or kids, I am the only thing standing in the way if that happening. As much as I would love a little one I know exactly who would be taking care and doing all the work. Called the doctors line this am to see about an appointment. My left breast (reconstruction only) is now larger than my right breast. She had left the right larger factoring in rads, and I know \"leftie\" was smaller because I had seen it. Now looks larger and has red area around nipple about 2 inches out all around. Want to get it checked before the weekend and I am sitting in some ER all panicked! Dr. Leaves on vacation for spring break soon. Sigh. Surrealist: you are so right, this is a great place to speak your mind and get much needed sympathy and understanding, and great advice! I had a relative Facebook me how I was doing, commented back \"well, except I think I have an infection\" and received a flip off (or essentially a flip off in my book!). My own twin called and left me a nasty message to not speak to her about my treatments until they were done. She actually did me a favor by being nasty as she is so self centered the few calls I had prior to surgery were all about her. Only reason I had called her was to verify a diagnosis she had YEARS ago, she called cancer and my BS had said was never referred to cancer (atypical ductal hyperplasia). I only wanted to be sure when I met with geneticist that I had the correct info. Anyhow we had not spoken prior to that in a dispute over scattering my dads ashes. This twin of mine is a \"cancer\" in my mind and cutting her out has lessened my stress. Told hubby if I got hit by a truck tomorrow to not invite her to the funeral! (I'm not like that but my eyes have been opened to her ways and I don't think her dribble would be good near my kids). Ok, waaaay to much drama about someone who isn't supposed to be named., lol. Moving on to my happy thoughts! Love to all my sisters, thank you all for sharing. It is so nice to see I am not alone. I am the first person in my area that I know of to have cancer and you are the only ones I can talk to. Pat",
      "MessageIndex": 487,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 26, 2013 08:41PM Pattysmiles wrote: Received some of my pathology. Seems to be a mixed bag, and more waiting. I am still considered stage 1. The \"bad\"news: there were multiple tumors, all very small, the largest being 1.8 mm and the smallest .5 mm. 6 total. Multiple tumors are not good. Of 4 SNB nodes tested it looks like there are three reported on...3 negative (one of which has 18 tumor cells, but it takes 200 to be \"bad\". I keep looking at the report to figure the wording on how they missed number 4? Margins: mostly good, except for one small part is At 1mm. My doctor doesn't like that. Good news: it is classic invasive lobular cancer (not aggressive) Questions to be looked at according to my surgeon: Will I benefit from chemo? (Oncologist to determine) Will oncologist order oncotype test? (Means additional waiting, ok by me) Should my doctor go back in for wider margins? Or expect radiation to deal? Should I consider masectomy? (Still waiting on BRCA results) Will I get another MRI to see if there is anything they can read on it? My surgeon will be presenting my case to a panel of her peers next Wednesday. In the interim she is trying to get me into oncologist so this can all move forward. (I called the Oncologist office from the parking lot and she is not booking til april22 so I went back into BS office and they will try to expedite) So, I am now back in the waiting mode. I was so hoping to move forward so whatever is in store for me could be over with before my kids start summer vacation. Patience, Please come find me! Pat",
      "MessageIndex": 550,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "May 11, 2013 08:25PM Pattysmiles wrote: Carrie, welcome! Or is it welcome back! Yes, the new study results say 10 years for Tamoxifen. I see you are in NY, where is your new PS that does DIEP? Pat",
      "MessageIndex": 725,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 20, 2013 05:47PM - edited Mar 20, 2013 06:57PM by Pattysmiles Greetings All! Garden girl and Horu I am so glad to see you had successful surgeries. I was going to post from the hospital, but was VERY nauseous after surgery. Was at the hospital at 6:30am and surgery began at a little after 10:00. I was out by 4:00? Finally ordered room service at 7:00 just before the kitchen closed. The nurse kept telling me I could have crackers for my nausea, it turns out I REALLY needed a meal, felt sooooo much better after eating. ILC in right breast removed, left side also reduced and reconstructed to match. right node sentinel node removal, no results yet. Spent the night in a pediatric ward for recovery, excellent nurse to patient ratio. No waiting for anything. Unfortunately heard a two month old crying on and off all night \"right behind my head\". Felt so bad for the little guy and the parents (able to stay there). Hubby would have stayed over in the hospital but he and my two boys were shaving their heads for St. .Baldricks event and we had icy snowy roads. Last thing I needed was him in the hospital too, he is NOT getting out of housework that easily! All the dr.s and nurses were impressed with my breasts, I joked and said even the custodian was impressed as it seemed everyone wanted to see them! LOVED the leg massager thingies. (Used to avoid blood clots). If there was a way to take them home I would have. Nurse told me I would have to take the bed to use the leg massagers, I told her I could arrange that! I came home yesterday. Felt like it was a whirlwind. In the car, driving past all this fresh snow, Made me think of what I pray is a fresh start, nice and clean! Had a \"fever\" of 96.3 last night, with teeth chattering, no idea what that was all about. Tired today. Taking only one Percocet (can have two), taking my antibiotic and also stool softener (thanks to reading that here, but still waiting for some action there!). My drain was removed prior to leaving the hospital. The \"steri strips\" under my right breast are gone, husband said they were gone yesterday. I don't know if they should be. It is also hard to tell if the area is red and swollen on my left breast around the nipple, so I might be making a phone call to the plastic surgeon tomorrow. Next week I see the breast surgeon Tuesday, the plastic surgeon will be on vacation (spring break here) so I will see her the following week.(if I don't see her about potential swelling/redness this week) My breast surgeon called last night to ask after me, she is very nice. No pathology, she says it \"might\" be back by mid week next week. I think she was trying to reassure me. I told her regardless of the day the results come in it won't change anything so I will not stress, concentrating on feeling good right now. Next step is talk of rads...still have not met any oncologist or whatever these next group of doctors would be. Had a much needed shower today. Eating lots of protein for healing, drinking lots of water. Trying to ignore the mess my husband and three kids are leaving everywhere. I honestly can't understand how they can sit at a table with yesterday's crumbs all over the place, and walk on filthy floors, I am sickened. I think the inability to do housework Is going to drive me insane. Might have to go out and invest in blinders. Sending my love to all my sisters for a positive journey. Pat",
      "MessageIndex": 474,
      "PostDate": "20/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 9, 2013 02:12PM Pattysmiles wrote: Waving from tha balcony as I await more appointments. Met with oncologist who recommends Chemo due to mulitiple tumors. Will also have radiation and 10 years tamoxifen. Breast surgeon says needs to go back and get better margins. I seriously started thinking over the weekend to do masectomy, of at least the \"bad breast\". Will be meeting plastic surgeon to discuss. Have been reading DIEP board, will also need to find the other boards so I can \"pre-read\" my alternatives before getting to the doctor. That way I will have my questions ready. Will need the chemo regardless of surgery choice. Will not need rads if I do masectomy (not in my case anyway). Will also need the tamoxifen regardless of surgery choice. Looks like the summer off with the kids is shot! I'm disappointed. This too shall pass though. Life is full of surprises. We just don't always like them! Pat",
      "MessageIndex": 643,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Apr 13, 2013 10:38PM Pattysmiles wrote: I met the two different plastic surgeons regarding masectomy. 1st does either. TRAM flap or implants 2nd does DIEP flap. I have decided DIEP flap, both breasts as it is a major surgery. Implants seem like too much maintenance, TRAM involves taking a piece of abdominal core muscle and I have a bad back, I need my core strong! If she takes the abdominal stuff for a single masectomy , as i was considering, if I should ever need another rebuild for my second breast she would have to go elsewhere on my body. And if that second breast needed surgery how old would i be? would i be in good shape? i know, a lot of \"what if\" questions. this surgeon is out of network for insurance purposes, (in fact any surgeon that does this surgery is out of network to me). so I need to see what that will mean. (I'm picturing someone hitting me over the head with a sledge hammer). I am meeting with another DIEP flap surgeon in Manhattan on Tuesday, I want to make sure we are on the same page as far as my fat! I recently lost 25lbs, who would have thought I should have kept it! Lol. Thankfully I still have a good bit of belly fat left. I was told from PS#1 I did not have enough fat for two breasts. I was told by PS#2 that I had enough for two smaller breasts, but to make sure not to lose more weight. (So much for my weight watchers membership!). I'm thinking fatten up this chicken! Lol. Still have chemo to face! PS also wants me to resume my cardio , as she was very happy I had been going to the gym 4-5 times a week, doing 45 minutes of cardio. I think she doesn't realize if she is thinking surgery after chemo I won't exactly be in my best shape as I have not worked out since first surgery on March 18! Lol. She will be getting a fat couch potato! I guess I will see what happens when I finish chemo. I still have 12 weeks (plus some) to figure out what's going on for masectomy. I ordered a bunch of chemo hats , wig etc from tlcdirect.org last night. Also picked up some scarves from Target. Gearing up for the next battle. I think a part of my summer has been saved...as soon as I know for sure I will plan a nice vacation with the family before the masectomy, by then I imagine school will be back in session! Stay strong sisters! Pat",
      "MessageIndex": 669,
      "PostDate": "13/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jan 18, 2014 09:41AM Pattysmiles wrote: 2girls...maybe check out the lymphedema board and see if is any symptoms of that? Have you started working out recently?  Could be you are stretching things that haven't been moved in a while, but again,I have seen some \"lymphedema symptoms\" appear in women that are exercising and there is a whole process about it. I only had 4 nodes removed and know that if I get any strange feelings in that side I will be reading those lymphedema threads ASAP.  Also, please remember no needles in that arm and no blood pressure readings from that arm. Not trying to scare you, just throwing it out there, I am wishing you the best. Pat",
      "MessageIndex": 801,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 1, 2014 06:31PM Pattysmiles wrote: yes, God Bless us all!  Thank you Maureen!",
      "MessageIndex": 803,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 14, 2013 11:34PM Pattysmiles wrote: This has been a roller coaster for me. My surgery was originally scheduled for today 3/14. However I believe the nurse navigator and geneticist \"played games\" and had me removed from the surgery schedule, saying I said I wanted to await my BRCA results. I NEVER said any such thing,in fact, the geneticist said I should make a point to tell the plastic surgeon I refused to await the BRCA results, so I do, and she didn't seem to have a problem with that. Both the nurse navigator and the geneticist seemed to be pushing me to await genetic results. Anyhow, my surgery was put off, pending BRCA results. After getting over my dismay at their \"miscommunication\" I accepted that. This evening I got a call from the breast surgeon. Apparently my BRCA testing results won't be in by this .friday as there is an issue between the insurance company and the lab. She has no idea when this issue might be resolved, and when it is, it will take at least 10 days to get my results. So, my surgery is back On for this Monday 3/18. The surgeon feels I am at \"low risk\" of testing positive for the BRCA gene as there is no family history. I agree. She did not push me into the surgery at this time, she left it up to me. The surgery seems to make the most sense to me at this time. How long am I supposed to wait for insurance and lab to work it out.! Maybe one day I will regret it? Anyhow, now hoping that when the phone call comes to tell me the time of my surgery it is actually not another cancellation! Pat",
      "MessageIndex": 385,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Mar 23, 2013 09:32AM - edited Mar 23, 2013 09:34AM by Pattysmiles Greetings, Forever changed: I am so sorry your son ran into you. I can't even begin to image your pain. You must have really needed that sleep. Keep ahead of your pain. I found with all the extra water I am drinking I automatically wake up in the middle of the night, so i can re-medicate easily. I found an interesting website, not cancer, but plastic surgeon info which applies to most of us. Has a lot of things I knew, from reading these boards, and a few things I didn't learn yet. Thought I would share. Gardengirl there is a bathroom related solution in there too. www.scottsdalecenterforplastic... ***please don't follow the exercise part as they patients have not had lymph node removal, I would just look at it as a guide to how easy we need to take it when getting back into daily activity and fitness. Hugs to all my recovering sisters, and special hugs to those still waiting. Pat",
      "MessageIndex": 512,
      "PostDate": "23/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    },
    {
      "AuthorID": "Pattysmiles…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173478/profile",
      "Content": "Jun 28, 2013 11:15PM Pattysmiles wrote: Maureen, call your MO and ask for referral now. Sometimes getting appointments for PT can be a pain....why wait?! Also be sure to check out the lymphedema boards here. Lots of info (which I only read periodically so I can't quote to you!). I do know there are specialists in the field, you don't want \"just any PT\". Pat",
      "MessageIndex": 784,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/800130",
      "Title": "March 2013 Surgeries kap Maureen1"
    }
  ]
}