{
  "AuthorID": "Patti228",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/26283/profile",
  "Posts": [
    {
      "AuthorID": "Patti228",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/26283/profile",
      "Content": "Sep 4, 2008 09:35AM - edited Sep 4, 2008 09:37AM by Patti228 Scorpio--you say \"are we bc patients really the only people who thought of this?\"  I'm beginning to think we are.  Seriously.  For example, I've tried doing a medical literature search on lower dosing of tamoxifen...and unless I'm not looking in the right places, there isn't much current stuff out there.  It's like the medical attitude toward tamoxifen is -- why would you ever want a lower dose -- it's saving your life, yada, yada, yada.  (Then why would you give the same dose to a 100 pound patient as a 400 pound patient?--maybe there's a bc survivor reading this who is a pharmacist and can comment...)  Well, I'll tell you, saying \"why would you ever want a lower dose?\" --that's not good enough anymore.  Quality of that life is just as important.  The medical attitudes toward reconstruction have aligned with the times.  Meaning, it's not just enough to look good in clothing, but it's just as important to look good naked.  I think the medical attitudes toward long term estrogen suppression/depletion need to look at how much depletion is enough without making it all go away.  I think the medical attitudes toward post bc fatigue need to look beyond the sudden menopause, the surgeries, the radiation treatments, and acknowledge that THE FATIGUE IS REAL, AND UNIQUE TO BC. <now I'll get off my soapbox> Patti",
      "MessageIndex": 59,
      "PostDate": "04/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719657",
      "Title": "Still have the fatigue after 2 years. Mary-Lou Molly2013"
    },
    {
      "AuthorID": "Patti228",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/26283/profile",
      "Content": "Sep 2, 2008 07:57PM Patti228 wrote: Yessss!  Finally someone gets it!  I also am 2 years out and the fatigue has been unrelenting!  Will the breast cancer medical community finally listen to us?   Yes, I'll accept we've been through the mill with chemo, radiation, surgeries. Yeah, could be post traumatic stress. But these are cop outs.  This fatigue is deeper.  Doesn't go away and doesn't get better.  Lack of estrogen?  Sure.  I'll accept that.  To a point.  Chemo slams us into menopause, and then tamoxifen does the rest. Unlike those who don't have BC, and lose their estrogen gradually, ours gets sucked away in a heartbeat.   I'll be mightily peeved if 10 years from now, all the studies show that sudden total depletion of estrogen is hugely damaging, and that tiny bits are protective. ",
      "MessageIndex": 56,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719657",
      "Title": "Still have the fatigue after 2 years. Mary-Lou Molly2013"
    }
  ]
}