{
  "AuthorID": "PattyP",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
  "Posts": [
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "May 2, 2009 07:55PM PattyP wrote:   Hey Reneepals, I finished chemo for the first time in June 2007, by July of 2008 my cancer was back, regionally(in one node close to original bad node.)  I was on Tamoxifen the entire time and only got 1 clean year.  After treatment the 2nd time(radiation+ ovaries removed) I went on arimidex in Dec. of 2008 and by March 2009 it was in my spine and lungs and maybe my liver now.  So I am talking more about progression.  I don't respond well to hormone treatment, I guess!! PattyP ",
      "MessageIndex": 24,
      "PostDate": "02/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733239",
      "Title": "Yes, I'm Joining the Group PattyP pee"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "Apr 28, 2009 04:01AM PattyP wrote: Thanks,  I'll get through it.  As we all will.  It's the \"getting through\" part that is our life!  And I plan to live it to the fullest...still.",
      "MessageIndex": 2,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733239",
      "Title": "Yes, I'm Joining the Group PattyP pee"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "May 1, 2009 05:07AM PattyP wrote: Thanks everyone for your support.  Meeting with 3 different teams this week.  Looking at clinical trials.  How has anyone done on Xeloda and Zometa?  Or I could start on Faslodex but my history with homones therapy has been less than stellar.  He might be thinking of it as a quality of life issue.  Fewer side effects?  Love and hugs to all my new sisters ",
      "MessageIndex": 21,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733239",
      "Title": "Yes, I'm Joining the Group PattyP pee"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "May 1, 2009 05:06AM PattyP wrote: Thanks everyone for your support.  Meeting with 3 different teams this week.  Looking at clinical trials.  How has anyone done on Xeloda and Zometa?  Or I could start on Faslodex but my history with homones therapy has been less than stellar.  He might be thinking of it as a quality of life issue.  Fewer side effects?  Love and hugs to all my new sisters ",
      "MessageIndex": 20,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733239",
      "Title": "Yes, I'm Joining the Group PattyP pee"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "PattyP wrote: So the scans came back with mets to my spine almost all T-5 to L1 and also in my right lung lobe.  I didn't respond well to tamoxifen or arimidex. So I suppose it's chemo again.  I'll get a better idea when I meet with my onc on Thursday.  Does anyone know any good clinical trials out there?  Told the kids and my Mom.  The rest of the loved ones find out today.  That's the hardest part. I am hoping this group can help me navigate these choppy waters.  Just to know there is a group of women out there doing the same thing reminds me that I am not an \"other\" but part of a community. PattyP Dx 1/2007, IDC, Stage IV, Grade 3, 2/8 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733239",
      "Title": "Yes, I'm Joining the Group PattyP pee"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "May 11, 2009 07:17AM PattyP wrote: 46th Birthday diagnosis!",
      "MessageIndex": 231,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "May 27, 2009 09:07PM PattyP wrote: Amazing news.  A new little human being setting foot on the earth.  You must be overjoyed to be a Grandmom and to get hold the lovely little beauty.  Congratulations.",
      "MessageIndex": 20,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734816",
      "Title": "Topic: Good news We Have been at the hospital Post a reply heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "Aug 12, 2009 01:58AM PattyP wrote: Heidi, I hate this disease.  I am so sorry that you are doing this.  Is there no end to the ways this fXXXing cancer messes with our lives and bodies.  I don't have experience with lepto but I'm a Mom like you.  I have a journal for each of my 4 kids and one that  my that my husband gets.  I've been thinking of making DVD's for the kids on our MAC.  Also, I've been thinking of getting one of those hand held tape recorders to record my thoughts for the kids.  Could be just random stuff, could be things you want them to know, in your voice or words. As I get more tired, I think the recordings will be easier to make than the writing.  Oh Heidi, this is so hard.  I am keeping you close in my heart.  I pray you have the grace to live the life you have been given.  I don't know what that means in terms of time.  And I wish I could tell you why this is happening.  I can only hope that, at some point in our being, maybe not in this life, this will make sense and our struggles  will but a blip on  the timeline of our existence.  Our children will be extraordinary because of their experience with us.  And our time on this earth will not be lost.  Who we are and at some point,who we where will continue to shine on.  With all my heart PattyP",
      "MessageIndex": 46,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "Sep 14, 2009 09:50PM PattyP wrote: Dear Heidi and Little Bro and family, The struggle was so hard, she can rest now.  She will always be with you.  I am praying for her comfort and for the family to receive the grace that will allow them to accept this terrible situation.  It seems to me that you have a wonderfully close family and you will draw on that love to get you through.  My love to Heidi and the entire family.   I keep you all in my thoughts and prayers. PattyP ",
      "MessageIndex": 373,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "Sep 8, 2009 10:34AM PattyP wrote: Oh, he is beautiful.  You are so blessed to have that experience.  Enjoy him, enjoy him, enjoy him. All the best, PattyP ",
      "MessageIndex": 22,
      "PostDate": "08/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740082",
      "Title": "My First Grandchild Reneepals EGAL"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "May 24, 2009 10:14AM PattyP wrote: Thanks guys.  I'm still working on not being angry and sad but I feel like I'm coming out of it a little.  I know I just have to pull it together.  In a months time I've been re-diagnosed, had surgery, collasped lung, chemo and a trip to the ER , my Dr. fearing a pulmonary embolism.  People want me to be positive and I WANT TO BE POSITIVE.  It's just been a lot to digest in a months time.  I can do this and I will keep planning for the future.  I will also enjoy these beautiful days ahead.  I am trying not to let this disease rob from me anymore than it has to.",
      "MessageIndex": 3,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734349",
      "Title": "Started chemo, is this it from now on? PattyP bmdaley"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "Jul 6, 2009 08:52AM PattyP wrote: Cindoe, I'm on the same morphine and they are scheduling me for radiation this week. I am hoping that will help with the spine pain I have.  I have heard that the rad has brought so many of us relief, Chris might feel much better after it starts.  As far as surgery, I would ask her surgeon.  Like DJ64 said, they all have their specialties.  Or start by asking why or why not? But get an answer that you are satisfied with. They do make stick on cups, they also make this tape that people use to tape clothes to skin.  Maybe you could use the tape to lift some of the weight up and off the area that causes pain.  You can find that stuff at a fabrics store in the notions section.  I am keeping you two in my thoughts and sending you good energy and big hugs. PattyP ",
      "MessageIndex": 4,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737005",
      "Title": "I just don't FRICKIN understand cindoe cindoe"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "Aug 23, 2009 06:33PM PattyP wrote: I have not taken Ixempra because two of the women I chat with during chemo are getting it.  Both of them have had tough times.  One with bone pain that has had her in the hospital 2 times, after the first 2 doses.  The other I know was dehydrated and very sick after taking it.  I asked the nurses about what they see and they said that only the Stage IV folks get it and the nurses think that we are so beaten down by the time we get it that our bodies can't handle the side effects.  I am sorry that this is what I can offer but I backed away from it because of these two women and what I saw them go through. I hope you find something that works for you. PattyP ",
      "MessageIndex": 4,
      "PostDate": "23/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739318",
      "Title": "Anyone on Ixempra - esp. TN? Duffymom kenzie57"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "PattyP wrote: I started treatment on Thursday.  Taxotere, zometa and faslodex.  They will add avastin on the next treatment.  Because of the different schedules for each drug, it looks like I will go every week getting off every 4th or 5th week.  I am still trying to stay on top of the pain without being too loopy.  Will I just feel like half of myself for the rest of my life?  Does your body accomodate at least a little?  I am scared that this will be it.  I have not been angry or felt sorry for myself since this all began.  I feel that strength slipping away.  I'm angry that at 48 I am fighting this fight for my life.  And more than a little disappointed that all of the \"STRIDES\" that have been made on behalf of breast cancer will not save my life. I feel like it is all some big marketing gimmick to make the general public feel happier about all the poor folks with cancer. My best treatment option is to feel sick, tired, weak and have the added bonus of being bald.  That, of course, doesn't guarantee that I will see even one of my four children's weddings or hold even one of my grandchildren.  Now I'm angry and I don't know what to do with it.  Some words from the more experienced in the group, please? PattyP Dx 1/2007, IDC, Stage IV, Grade 3, 2/8 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734349",
      "Title": "Started chemo, is this it from now on? PattyP bmdaley"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "May 15, 2009 08:24PM PattyP wrote: I am so sorry to hear of your friend's situation.  I does seems terribly unfair but she will endure this as she has not other choice.  She should know that there is a whole community out here for her.  My love and prayers are with her.",
      "MessageIndex": 19,
      "PostDate": "15/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734215",
      "Title": "Her Husband Passed Away Tonight lovemyfriend PattyP"
    },
    {
      "AuthorID": "PattyP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69347/profile",
      "Content": "May 15, 2009 08:24PM PattyP wrote: I am so sorry to hear of your friend's situation.  I does seems terribly unfair but she will endure this as she has not other choice.  She should know that there is a whole community out here for her.  My love and prayers are with her.",
      "MessageIndex": 20,
      "PostDate": "15/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734215",
      "Title": "Her Husband Passed Away Tonight lovemyfriend PattyP"
    }
  ]
}