{
  "AuthorID": "patty9999",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104178/profile",
  "Posts": [
    {
      "AuthorID": "patty9999",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104178/profile",
      "Content": "Dec 11, 2011 05:15PM patty9999 wrote: Jen - I'm glad to hear all went well.  I had heard about the cold caps just before starting chemo.  But, decided not to do it.  Couldn't imagine having such a cold head with everything else going on.  I did lose all my hair.  And, can still remember the days as I realized it was for real.  Was heartbroken as I have always had beautiful just right curly hair.  Complemented all the time, etc.  My hair has now grown back and I get complemented every day on how everyone loves my new style.  When people who don't know me ask where I got my perm, I tell them Dana Farber did it!  They just chuckle when they realize what I'm saying.  Anyway, I hated not having hair, but now I'm loving my new style.  Hope I don't lose the curls. I am sorry to hear you are having a bad day.  That can't be easy.  Make sure to take time for yourself to do what you need to do - heal!  Stress cannot help that.  Even to this day I do everything possible to keep any bit of stress out of my life.  Where a year ago I would just keep taking on things.  Take care of yourself. Will be watching to see your results later this week.  You can do this! Patty",
      "MessageIndex": 39,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779124",
      "Title": "New... Jennt28 patty9999"
    },
    {
      "AuthorID": "patty9999",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104178/profile",
      "Content": "Dec 11, 2011 02:32PM patty9999 wrote: So much good news!  Spend your energy healing now until you hear the results.  I know easier said than done. I did want to state that on the CaringBridge journals you only send the link to those you want to read it.  They get a signon and password and are e-mailed any time you post anything.  They can also write messages back to you.  I still have mine open.  I've had a few other things going on that I still report on periodically.  Almost done now. Anyway, hugs to all.  Glad to hear this weeks surgeries have been going well.  You may be sore now, but the nasty thing is not in your body any more.  I know the relief I felt after my surgeries after having known about the tumor for almost three months by the time it was taken out. Patty",
      "MessageIndex": 351,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "patty9999",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104178/profile",
      "Content": "Dec 10, 2011 09:45PM patty9999 wrote: First of all, I want to wish you all with December surgeries past and future to know that I'll be thinking of you and praying that all works out well.  I am now 1 1/2 years past my surgeries and sometimes forget that I even went through all this.  It does get better. To Denise - my advice of how I got through it was to just take it one day at a time.  I learned to meditate and after all this time, still do it every day.  It helps to calm me.  I learned there was no need to waste energy worrying about things.  Whatever was going to happen was going to happen.  I thought thoroughly through all my decisions, did my research and felt comfortable with every one I made before I said okay, \"Let's do it!\".  Another thing I found was I set up a page on Caring Bridge   http://caringbridge.org/  that I was originally going to use to keep my family and friends up to date on my situation.  But, I found that by my journaling I was able to \"process\" what all was happening much easier.  My husband got tired of talking things out over and over again.  By my writing it in my journal, I sort of gave myself approval to have the scary feelings I was having at times.  Anyway, I had never journaled in my life and didn't think I was the type.  But, I think between that and my meditation, besides having full faith in my doctor's it helped me to get through it all.  I'll be praying for you all throughout the month. You can do this! Patty",
      "MessageIndex": 336,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    }
  ]
}