{
  "AuthorID": "pattimay",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
  "Posts": [
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Apr 27, 2010 01:21PM pattimay wrote: Lisamg, is it really true that ALH is more active then the ADH.  My pathology report said ADH as well as ALH but my surgeon only seemed to concentrate on the ADH.  At least that is what he said was taken out at excisional biopsy because he said it was severe.  I guess I just had a little atypical cells in the lobes as compared to how many I had in the ducts?  Does it mean that even the less amount of ALH is more likely to turn into something worse(DLIS or invasive) then the ADH or do the cells of ALH have more inclination to turn to cancer cells more?  Hope I'm making sense.",
      "MessageIndex": 7,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/751485",
      "Title": "ALH is NOT cancer, right? keiko tgood02"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: I had my followup with my surgeon after my excisional biopsy for atypical cells. Pathology shows ADH but very large area.  My surgery was two weeks ago and I have what feels like because of pain a swollen lymph node under my arm.  Surgeon felt it and said it was a swollen lymph node and said this was normal after surgery.  Anyone else experience this? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/745592",
      "Title": "swollen lymph node after excisional? pattimay mawhinney"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: I just saw my surgeon with the results of my second surgery in a year.  With much relief it is B9 but it was more ADH.  My surgeon would not feel comfortable with a less then six month Mri since my ADH is so severe.  I have made the decision to take the Tamoxifen.  At least give it a fair try.  I smoke and of course have to stop NOW.  I've been wanting to for years so this gives me the best reason ever.  I don't want to worry about getting a blood clot for the next five years while I'm on this.  And of course all the other things to worry about because I smoke.  Just would like to know if anyone has tried the Ecig to stop smoking.  It doesn't have any carcinogens in it but it does have nicotine.  From what I'm reading you can slowly lower the nicotine until your just smoking without it.  I have read many good things about the success rate using the ecig.  I researching the best one.  I am excited about this and feel I can stop smoking using this method.  Any please have experience or know someone who is trying to quit using ecigs?  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/761480",
      "Title": "Tamoxifen pattimay DocBabs"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: Just saw my breast surgeon.  Mri showed an inch area of abnormality on mri. He said being that I had severe adh which bordered on dcis I'll need this biopsy.  Also he was mad that I didn't go on the Tamofen.  I'm going through perimenopause at 52 and still gettting periods with hot flashes, night sweats and was afraid the tamofen would make things worse.  I was hoping for a clean mri and mammo this time.  He said if I need surgery again I should think about double masectomy, nipple sparing.  He said he'll speak fully about this after the biopsy.  I also am a light smoker.  I know of course how bad this is but I've failed to quit so many times.  He said if I continue on smoking with the tamofen I could get blood clots.  I'm just so afraid of the side effects of this med.  He even said hair loss. If I had the masectomy he said it would bring my odds of getting cancer down very low.  I'm a wreck.  I will pray that biopsy shows benign and I don't have to think about this now.  He took over 2/3 breast tissue with reconstruction for the adh already and I might not be a candidate for more surgery. I'm small breasted.  Any advice or experience with Tamofen ladies I would appreciate it greatly. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/760023",
      "Title": "yup..another biopsy pattimay pattimay"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Oct 30, 2010 04:03PM pattimay wrote: Thank you for writing .  I forgot to ask the surgeon if this is the same area I had the benign biopsy for 6 months ago.  I had to go to a radiology center for the Mri this time.  Last time it was at the hospital surgeon is affiliated with.  The cost was $10,000 for the Mri and another $10,000 for mri assisted biopsy.  My insurance company accepted $5000 for each and I paid 20% of that.  It was still alot out of the pocket.  Couldn't do this every 6 months.  The radiology center was only $2000 for mri.  But now I have to transfer records to the hospital because I trust the Dr. who did the biopsy from last time and the one before surgery in Dec.  But wondering if he compared the last mri that came back benign findings after biopsy or this is a different area.  Just found out through the web that Tamoxofen is useless if taken with an SSRI.  I'm on Paxil just 10mg for over 15 years .  So now I'd have to quit the Paxil and smoking. ALso just wondering the difference between the ADH severe that I had the surgery for and the followup biopsy that showed Atypia.  ON the paper it said Atypia NOT adh.  So what is the difference.  I'm always so upset when I see the surgeon that I forget to ask these things. ",
      "MessageIndex": 2,
      "PostDate": "30/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/760023",
      "Title": "yup..another biopsy pattimay pattimay"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: I am so confused right now.  Everytime I forget for awhile that I'm high risk I get my MRI and I'm reminded about my chances of getting breast cancer and the anxiety starts again.  Wondering if someone can give me the most resent and accurate odds of my ADH turning into cancer and how much would Tamoxifen reduce my chances.  First my history.  I am 53 and still having periods.  Less then two years ago my mammo came back with microcalcifications which led to biopsy and then surgery.  Two papillomas were removed and an area of ADH.  Three month followup led to more surgery for the Adh left behind.  Just had my six month mri and my surgeon called that area was still lighting up but it is smaller.  Radiologist suggested biopsy but surgeon explained my history to him .  I originally went to the hospital to have the mri done but it was very costly so switched to radiology medical arts center in my area.  So my surgeon did not feel I needed biopsy againso soon  since he feels it is the same ADH.  He said Adh does not have clean margins and he would never get all of it.  He received results of mri the same day I had it done and I spoke with him on the phone but will see him again next in his office.  I imagine if it shows again in another 6 months he would suggest another biopsy.  I don't know.  But he said it's good that area is smaller and it's good I'm taking the tamox.  I nearly started crying in fear because my bottle sits on my dresser and I did not take it.  He laughed and said he didn't want to cause that anxiety in anyone but by me not taking it I am opting to get cancer.  I am just so afraid of a blood clot.  I have restless leg syndrome and spinal stenosis with a bulging disc.  I get all sorts of strange leg sensations and I know that if I took this I would think each time I was getting a stroke from a blood clot.  I wouldn't be able to distinguish between the tingling from the sciatica/spinal stenosis and something dangerous.  I think anxiety could cause so many health problems also and I feel I would have nothing but anxiety from being on this.  But my surgeon makes me feel that I will get cancer for sure with ADH if I don't take it.  I have no family history of cancer .  My mom is 80 and never had an abnormal mammo.  Also I have been on Paxil 10mg for over 15 years.  I had bad anxiety attacks and the paxil was a life saver.  I have read that Paxil takes away all the benifits of the Tamoxifen.  So what now I have to wean off Paxil?  I feel so quilty for not helping myself.  Please I'm sorry about writing a book but can someone put things in perpective for me.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/768614",
      "Title": "Tamoxifen for ADH?? pattimay momoschki"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: I am 51 and for several years had microcalcifications which have now \"changed\" to microcalcifications.  Had a spot compression and then stereotactic biopsy in two areas of left breast.  Since my gyno was on vacation the Dr. who did my stereo called me on my cell phone with results.  I was shopping and was so shocked that I didn't ask any questions and just dotted down the name of surgeon she suggested to see.  I picked up my films and the pathology report to give to the surgeon who I will see next week.  Short version of report is Benign papilloma and it also says both sites have columnar lesions of calcification with atypia..  Can anyone please give me some insite into what this means.  Hoping that all the atypical tissue was removed with the stereo .  Would most likely the surgeon do an excisional to check if there is anything else going on and also get out anymore atypical cells.  I'm just very scared that they will find cancer . Thank you all for being there.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744154",
      "Title": "columnar atypia lesions??? pattimay bugdm"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: Well I was praying that the reason I was called by the surgeons office for an appt. today was because he was going on vacation.  I had an appt. for April three months after my surgery for ADH.  I had my MRI with contrast on Monday.  My prayers weren't answered.  He said there was something that showed up on the MRI and I would need another Biopsy, MRI guided core or stereo.  Don't understand how something could show up bad again after just having the ADH and papillomas surgery in December.  It's in the same breast.  He said because of the severe ADH I had that he cannot in good practice wait a few months and take another MRI.  I only good thing is that he's giving it odds in my favor that it will be a benign finding and I won't need surgery again.  But that's what he said after the microcalcifications were found also.  So another stressul wait until biopsy and results.  I really can't believe that I'm starting all over again after only three months.  But then I should be glad it's caught early.  My surgeon told me that in alot of women the suspicious microcalcifications don't show up early on and when something does show on mammo it's sometimes already IDC.  So in that respect I'm lucky.  Say a prayer please for me ladies.  Thank you . Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/750025",
      "Title": "another biopsy for me pattimay AnacortesGirl"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Sep 16, 2017 12:10PM - edited Sep 16, 2017 12:12PM by pattimay I came upon the forum searching also for current thinking on risk factors for parenchymal enhancement on mri. I'm 59 and about 7 years ago had excision surgery for severe ADH. My surgeon sent tissue sample out for another opinion whether it was borderline DCIS. Relieved when diagnosed with just the ADH and to a lesser extent LDH. My surgeon wanted another MRI three months later which led to another biopsy. This turned out to be more ADH. My surgeon said he can't keep taking such large areas of breast tissue out for the biopsies since I have small breasts. So one more time and he'll recommend a mastectomy. Even though I have no family history or gene for breast cancer surgeon said I'm high risk. This leads to alternating breast exam and mammo's with mri every six months. My surgeon gets annoyed every time I mention at 6 month appt. that maybe it would be okay to stop the MRI's since it's been 7 years and all clear. Well last MRI I got the copy and it said THAT TERM..MODERATE PARENCHYMAL ENHANCEMENT. Surgeon always said I have dense breast and I believed that was the reason for the yearly mri's. But according to some of the things I have been reading about having parenchymal enhancement on mri it gives an even higher risk of developing breast cancer then even my ADH. Now do I combine the risks and now have a MUCH higher risk. I have my six month appt. for the feeling my breasts thingy next week. I'm going to ask him about this and let you know what he says. Thanks for writing.",
      "MessageIndex": 1,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/855184",
      "Title": "Background Parenchymal Enhancement on MRI Nettles Kerri_Oz"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Jan 16, 2010 09:01AM pattimay wrote: Thank you Beesie for your reply with this information.  I'm concerned that the MRI will show something new.  Does this happen very often that after excisional Mri shows missed atypia or new suspicious calcifications and I would need more surgery so soon after the last?  Thank you again. I guess from now on I will always be anxious before mammo and mri's before I get results.  ",
      "MessageIndex": 2,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/746815",
      "Title": "Why have these tests please pattimay mawhinney"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Nov 2, 2010 07:45PM pattimay wrote: I spoke to surgeon today by phone.  He explained that he did not get ALL the adh with the surgery.  He said it was too extensive and adh does not have clear margins.  So with the 3 month biopsy it showed atypia but NOT enough to remove surgically and he wanted to wait and see what this 6 month mri showed.  So it's in the same area and a larger area.  I only got the mri done this time at a different facility because the cost was less.  They can also do the biopsy but I'm opting to have my records transferred over to the radiologist at the hospital who did the last two biopsies.  He said she didn't think she would request another mri but she'll look at the cd . He feels that if this is again adh he cannot do surgery again because this can just happen again and again with the biopsies leading to more surgery for the adh.  So he said we'll speak about my options after the biopsy.  I keep reading about ladies who had adh and come back with a clean mri and mammo after surgery.  Just wondering if anyone else is in my situation.",
      "MessageIndex": 6,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/760169",
      "Title": "surgeon didn't get all adh? pattimay SJW1"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Nov 1, 2010 09:04PM pattimay wrote: Yes Leaf.  Mammo in Dec led me to have a sterotactic biopsy which lead to surgery.  Findings were ADH and two papillomas (benign) removed.  Report also said ALH but to lesser extent.  Surgeon said he got all the adh which took 2/3 of breast and he did the best to recontruct moving tissue.  I have a small indentation.  So then I go to 3 month followup mammo and mri with contrast my surgeon said to have.  It came back and that's when report said atypia but NOT ADH. No more surgery needed.  Just said to see a onc about Tamoxofen . Surgeon said see you in 6 months for checkup and get mammo and mri before appt.  JUst had that done last week and called in my surgeon that mammo was normal but mri showed that I need biopsy again.  It reads like it's the same area but larger now that was seen 6 months ago and surgeon said just atypia on the paper.  This is what it reads exactly from mri the other week... In the left breast, there remains an abnormal region of enhacement in the upper outer quadrant measurings appr. 3.2 x 1.4 x 2.3 cm.  Exhibits type 1 persistent kinetics.  This lesion has clumped enhancement and mass-like features Although this may be related to reactive enhancing breast parenchyma/benign fibrocystic disease, additional excision is recommended as the majority of this lesion appears to remain present post-excision for diagnosis of of aypia.  This enhancing lesion in the upper outer quadrant left breast is largely unchanged post excision.  Considering this as well as prior diagnosis of adh, repeat excision is recommended.  So is radiologist saying I will need another surgery? Right now surgeon is just saying biopsy guided mri. ",
      "MessageIndex": 4,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/760169",
      "Title": "surgeon didn't get all adh? pattimay SJW1"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Nov 1, 2010 07:23PM pattimay wrote: Thanks for writing Leaf.  The thing I'm upset about is that AFTER the surgery 3 months later I had a birad 4 mri .  But after biopsy surgeon called me into office and said good news it's benign.  I read the report and it did confuse me because it said in ink (maybe surgeon wrote this in ) Atypia and in big letter NOT ADH.  So it lead me to believe and I didn't look up or question that atypia was different then the adh and alh(lesser extent) that I had before surgery.  So I have to ask surgeon why wasn't something done 6 months ago and why did you say it was benign when it was still atypia there that I needed surgery for in the first place.  I just picked up the paper report from mri at office.  Forgot to ask for it when I saw him last week. I'm calling him tomorrow and asking him my questions.  The wording on the report from says it's the same area that showed on the last mri.  I know that without mri before surgery he might have missed areas but then it did show suspicious area three months later which he said wasn't a problem. because it just showed atypia.  My husband wants me to take all my records and go to another hospital and surgeon.  But maybe I'm just not understanding everything.",
      "MessageIndex": 2,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/760169",
      "Title": "surgeon didn't get all adh? pattimay SJW1"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Jan 29, 2010 01:38PM pattimay wrote: I had changed microcalcifications which led to core biopsy.  This resulted in excisional biopsy to take out the benign papillary lesions and severe ductal hyperplasia was found in three areas which the surgeon also took out.  Biopsy was sent out to make sure it wasn't DCIS but it came back as just the atypical hyperplasia ductal and lobal.  My followups will be alernating MRI and ultrasound and it was recommended I see an onc for Tamoxifen.  I had this all done in Dec. so I'm giving myself a break before making a decision about the Tamoxifen. ",
      "MessageIndex": 5,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/747510",
      "Title": "somebody can help me please cami7899 cami7899"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: I just compared my results from the biopsy I had 3 months after surgery.  The mri resulted in another biopsy but it came back as benign according to surgeon.  But the paper work says atypia not ADH.  So nothing was done.  Now 6 months later with my followup mri it shows enchancing 2.3 cm etc lesion mass like and wording says excision recommended that adh still present.  So now I'm facing another biopsy and probably another surgery.  Why wasn't this taken care of 6 months ago?  Also it all would have been taken care of at surgery if I had an mri BEFORE surgery I feel.  Did the surgeon not get all the ADH and isn't Atypia Adh ? I'm confused, depressed, scared and maybe mad at surgeon.  I think he just didn't want to do surgery again only 3 months later and didn't tell me that he didn't get all of it according to the 3 month mri followup.  I have to ask him the difference between atypia and adh.  NOw it's much larger then 6 months ago and he can't even take it out surgically because he can't reconstruct anymore with my small breasts.  I can't believe I'll need a masectomy for only adh.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/760169",
      "Title": "surgeon didn't get all adh? pattimay SJW1"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: Just picked up my MRI report.  Surgeon is on vacation and forgot to ask him for it last week when I saw him.  NOw I just had surgery for the ADH and papillomas in December.  NOw MRI read:  1.7 x 1.2 cm irregular heterogeneous clumped enchancement posterior and slightly superior to the biopsy cavity in the left uper outer quadrant.  Suspicious for carcinoma. But not only that.  My surgeon last week said only in my left breast in the area I had the ADH he took out three months ago.  Report says heterogeneously enchaning nodule the right breast also.  Probably just focal fibrocystic change.  However given history of atypia MRI guided biopsy of right breast recommendated.  So how is this all possible that in three months I'm starting all over again???? If MRI with the contrast is so much more sensitive then why right before my surgery didn't I have one so this could have all been taken care of then?  Why after the first stereo-tactic biopsy showed the atypical cells did my surgeon not say to get an MRI to see if anything else was going on?  I'm confused and scared and depressed. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/750145",
      "Title": "Bi-rads 4 mad at surgeon pattimay pattimay"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: I was diagnosed with ADH and ALH after having an excisional biopsy in December.  Surgeon said it was severe atypia but it was in the middle and he got all of it.  They were on the fence about it being DCIS but after sending it out to Beth Israel in Mass. it came back just the atypical cells.  I am scheduled for an MRI with contrast bilateral and ultrasound next month.  I know that I'm under close observation now but wondering what radiologist or surgeon would be looking for only three months after the surgery??  This all started with suspicious microcalcifications on spot mammo.  Thank you ladies for all the information you've already given me. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/746815",
      "Title": "Why have these tests please pattimay mawhinney"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "Sep 16, 2017 04:13PM pattimay wrote: Thank's for the quick reply. I'm confused by what I read about the parenchymal enhancement findings. I'm not sure if it means a higher risk just because of this finding or that it makes finding cancer harder even with mri? Thank you for sharing what you onc tells you regarding this and I hope your results are good news.I'll ask my surgeon about this also next week and share what he says. Pat",
      "MessageIndex": 3,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/855184",
      "Title": "Background Parenchymal Enhancement on MRI Nettles Kerri_Oz"
    },
    {
      "AuthorID": "pattimay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92747/profile",
      "Content": "pattimay wrote: My surgeon called me a few weeks ago with my 6 month followup mri results.  I had two surgerys in less than two years for extensive Adh and alh to a lesser degree.  He said although the radiologist suggested another biopsy he explained my history to him and it was downgraded to birad 3.  With my first two mri's I had went to the hospital but this time went to the radiology center which was much less costly.  My surgeon explained that my adh is so extensive that he would never get a clean margin and took all he could take without losing too much of my small breasts.  The area was slightly smaller from last mri but of course that was from the second surgery I had in December.  I'm a little concerned that this adh is still sitting there.  Surgeon yelled at me that I still didn't take the Tamoxifen.  I had the bottle sitting there and was going to start on my birthday last week and again became fearful.  I asked my surgeon if any of his patients with adh did not take the Tamoxifen and still had B9 results a few years later.  He scared me by saying he has never ever had a patient with as much adh as me.  I started thinking only when I got home that if it's that extensive shouldn't it be called DCIS?  I'm very confused about this.  Also I complained some about the pain I have constantlynow under my armpit .  My adh is is at 12 o'clock but the pain is closer to side of breast more under the arm.  Feels always like a swollen node.  He gave me a thorough breast exam and said the scar and everything looks great.  Has anyone else have extensive adh in one breast and also anyone with pain 6 months after excisional biopsies.  The surgeries were only three months apart.  Would scar tissue produce pain.  But it wasn't put in the mri report that I had any scar tissue.  So greatful for this forum.. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/769162",
      "Title": "ADH questions please pattimay lightning"
    }
  ]
}