{
  "AuthorID": "payheav",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146688/profile",
  "Posts": [
    {
      "AuthorID": "payheav",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146688/profile",
      "Content": "Mar 12, 2012 05:58AM payheav wrote: I too was diagnosed with the same cancer in 2009, The cancer was in the right breast but i choose to have both of them removed. I did 6 rounds of chemo and 20 radiation treatments. Just last week I was diagnosed with Mets breast cancer, it is in my lung right now.  Research your treatment opions before you go ahead with anything.",
      "MessageIndex": 22,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/783887",
      "Title": "I tried, but I don't get it.. lostinmo lago"
    },
    {
      "AuthorID": "payheav",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/146688/profile",
      "Content": "payheav wrote: I was 28 years old when I found out i I had stage 3 breast cancer in the right breast. I had both breast removed (my choice).  \\It was followed by 6 chemo and 20 radiation. March 4 this year would have been 2 years remision but March 4 I was told I have mets. It is in my right lung right now, 5 tumors.  I also broke a rib 14 weeks ago and it is not healing, even tho there is no toumor showing the doctors feeling it is cacner and want to do radiation for the pain.  I am now 31 years old, told I would never have children but guess what she is 3 months old. I have a step daughter as well who is 9 and my heart is aching  for them. I was told \\i had 2-3 years to live with chemo's help.  I want to live as long as I can so if anyone out there has been in my shoes and has any advice to give me Please do so.  I have some people telling me to avoid chemo-- and do things natural changing my diet and stuff.  Anyways thought this would be a good place to get help thanks everyone Dx 3/2/2012, 3cm, Stage IV, mets Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/783989",
      "Title": "Mets breast cancer payheav CoolBreeze"
    }
  ]
}