{
  "AuthorID": "peaches1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233305/profile",
  "Posts": [
    {
      "AuthorID": "peaches1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233305/profile",
      "Content": "Jul 19, 2017 01:55PM peaches1 wrote: I just had to post here, even though I do not visit the site as much as I used to. I was diagnosed 14 months ago with stage 2 IDC cancer. I have lots of various cancer on my fathers side of the family. My mother also had breast cancer twice, and one of my sisters got diagnosed in her 50's 4 years ago. I do eat healthy, and I do try to exercise although I don't exercise as much as you. I never had any children either, and my sister did not either. I also did not go through menopause until I was 57. A BMI of 24 is not overweight. Anything below 25 is supposed to be normal. I have been attending a weight loss group at the Cancer Wellness center in Northbrook outside Chicago. I have lost 15 pounds so far, but the class just ended a month ago, and there is a maintenance group that meets once a month that I am involved in, but you don't get weighed in the maintenance class, and I haven't lost any more weight since the weigh ins ended. I haven't gained any weight though either. I need to start exercising more like I was when I took the class My BMI is approximately 25.7. I would like to lose at least another five pounds so I can finally fit in my size 10 clothes that I used to be able to fit in. 20 pounds would be even better. There were a few people in the class that had way more weight to lose than I did though, and we started out with 18 people, and at the end of 5 months we only had 7 participants. I have been through chemo and radiation, but I had a mammogram and saw the surgeon last month, and no cancer showed up, and so the surgeon was really happy for me. I don't think about the cancer all the time like I did when I was diagnosed and going through treatment. I hope it does not come back, but if it does I will deal with it then. I am eating healthy, exercising and taking my femera in hopes that it does not return. I also only consume wine once a month tops. I don't think you have to give up wine. You just don't want to consume it every day. Eating lots of fruit is not going to cause cancer either. If you consume mostly low fat dairy you should be okay. I consume some cheese, but I often only add 2 tablespoons of Parmesan to a dish. I do sometimes go through a half a pound of lower fat mozzarella or cheddar. in a week. I do not eat much red meat because I have a really strong family history of colon cancer, but I do have salmon several times a week, and I will buy a rotisserie chicken occasionally at Whole Foods. On Tuesdays they have it for $7, and I love their rotisserie chicken. They have a curry flavored one right now that is delish.",
      "MessageIndex": 7,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/857105",
      "Title": "Childless athlete from a healthy family got BC at 65 bigsky2 Racy"
    },
    {
      "AuthorID": "peaches1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233305/profile",
      "Content": "May 18, 2016 08:05AM peaches1 wrote: Thanks for all the advice. My Mother had BC, and my youngest Sister was diagnosed with BC three years ago. It was in the beginning stages when she was diagnosed by a routine mammogram at the age of 51, and she had a lumpectomy and radiation and is in remission now. She has also given me a lot of advice the last few days, and she said that I needed to be followed by an oncologist too. The doctor called me up last Friday with the biopsy results, and asked me if I could come into his office that afternoon and have the test for the breast cancer gene. He also ordered an ekg and a chest xray. I then saw him on Monday and he scheduled me for surgery on 5/27, assuming that the genetic test came back in time. He also told me that my ekg was abnormal, and I would have to go to my PCP to get a repeat one. I told him that I had an ekg, echo, stress test and cardiac cath two years ago, and there were no blockages. During my visit with him Monday, he never mentioned anything about seeing an oncologist, and just told me that I would have radiation unless he found a positive lymph node, in which case I would have to have chemo. I think I am at least going to postpone the surgery until I get a second opinion at Kellogg. This has been going on too long though, and I kind of want the surgery over with.",
      "MessageIndex": 2,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844368",
      "Title": "Just diagnosed on 5/13/16. I live in Evanston and have questions peaches1 peaches1"
    },
    {
      "AuthorID": "peaches1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233305/profile",
      "Content": "peaches1 wrote: Hi- This is my first post here. I live in the Northern suburbs of Chicago in Evanston. I was diagnosed with infiltrating ductal carcinoma on 5/13. I am currently being treated by Dr. Hyser at St. Francis in Evanston. Has anybody here seen Dr. Hyser? I originally went for a mammogram on 3/21 at St. Francis, and when they found out that I had a lump, they said I would need a referral for a diagnostic mammogram. They called up my PCP, and she told them that I would have to come in to see her. I told them that I was seeing Dr. Hyser a general surgeon at St. Francis for another matter in three days, and I would ask him for a referral. I showed the lump in my R breast to him, and he immediately ordered a diagnostic mammogram and an ultrasound. They could not fit me in for 12 days. I was notified two days after the mammogram that they found something. When I saw Dr. Hyser on 4/14 again, he scheduled me for a breast biopsy in two weeks. He does all of his own breast. biopsies. He can to postpone it, and I finally had the biopsy on 5/11. I just saw him again on 5/16, and got a copy of the biopsy. I have infiltrating ductal carcinoma grade 2, which is positive for ER, PR, and negative for HER2. My concern right now though is that Dr. Hyser wants to do a lumpectomy on me on 5/27. He has a really good bedside manner, and he does most of the breast cancer surgeries at St. Francis, and he appears to be qualified, but he is not sending me to an oncologist before he does the surgery. He told me that I will need radiation after the surgery, or chemo if he finds a positive node. I get the impression that he decides your treatment plan himself, instead of sending you to an oncologist, which makes me nervous. I don't know if I want a jack of all trades doctor. One of my sisters is an endocrinologist in New Orleans, and she agrees with me that I should also be treated by an oncologist. She is going to call him up tomorrow, and ask him if he refers you out for radiation and chemo, or orders it himself. I just called up Kellogg Cancer center today, and I was able to make an appointment with Dr. Merkel an oncologist there for a second opinion there on 5/26. I might postpone my surgery, or have it done by wither Dr. Winchester, or Dr. Yao at Evanston Hospital instead. One of the advantages of going to Kellogg is that I would have a patient advocate there, whereas at St. Francis I would be on my own. My Sister has a good friend in New Orleans who is a hematologist at the cancer center at Tulane, and her friend is going to ask if anybody knows anything about Dr. Winchester or Dr. Yao. I am sorry this is so long. I might have Dr. Hyser do the surgery, and go and see an oncologist at Kellogg, or I might just switch entirely to Kellogg. I would appreciate hearing from anybody that has experience with St. Francis and Dr. Hyser. Thanks Dx 5/13/2016, IDC, Right, 2cm, Stage IIA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Surgery 5/26/2016 Lumpectomy Chemotherapy 7/17/2016 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 10/24/2016 Whole-breast: Breast Hormonal Therapy 12/15/2016 Femara (letrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844368",
      "Title": "Just diagnosed on 5/13/16. I live in Evanston and have questions peaches1 peaches1"
    },
    {
      "AuthorID": "peaches1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233305/profile",
      "Content": "May 21, 2016 09:33AM peaches1 wrote: Thanks for everyone's suggestions> Well I went to see my PCP today, and she told me that the surgeon had called her up, and he had me lined up to see an oncologist in Skokie who I was not familiar with. This oncologist went to med school at Northwestern and did his residency and fellowship at Beth Isreal. Apparently Presence Health has a new cancer treatment center on Skokie Blvd. across the street from Old Orchard. I wished he would have told me this when I saw him Monday. He says in his profile that he is hands on, and works with you from the beginning to the end, and I just assumed that he was going to supervise the radiation. My PCP told me that she would never send me to a surgeon that would do something like that. I also found out today that he has a patient advocate. I have decided that I am going to have Dr. Hyser at St. Francis do the surgery on 5/27, instead of going to Kellogg. My Sister the endocrinologist has a good friend who is a hematologist at the cancer center at Tulane in New Orleans, and her friend Cindy said that based on what I have told her so far, that my lumpectomy is going to be straightforward, and a good general surgeon should have no problems doing the surgery. She said I should be more concerned about the medical oncologist I pick, and she suggested that maybe I should see an oncologist at Kellogg. My PCP said that she did not know a lot about the oncologists at Kellogg's. When I mentioned that I was supposed to have an appointment with Dr. Merkel next Thursday, and she said that several of her patients had gone to him, and he was wonderful. My Sister talked to my surgeon today, and he told her that he had an oncologist lined up, but if I wanted to go to see Dr. Merkel, he was fine with that. My Sister said that she is flying in from New Orleans on Wednesday, and she is going to go with me to the visit with the oncologist, on Thursday, and drive me home after I have surgery next Friday. At least I won't have to ask one of my friends to give me a ride home after I have surgery. That is a big relief. I feel much better now. Thanks everyone.",
      "MessageIndex": 7,
      "PostDate": "21/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844368",
      "Title": "Just diagnosed on 5/13/16. I live in Evanston and have questions peaches1 peaches1"
    }
  ]
}