{
  "AuthorID": "peacejen",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205271/profile",
  "Posts": [
    {
      "AuthorID": "peacejen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205271/profile",
      "Content": "peacejen wrote: Hello everyone, I have been to this board several times and am always amazed at the women on this board and the wonderful advice and reassurance they offer others. I have always worried about breast cancer, don't know why but it is particularly worrisome for me. I have had several cysts in both breasts and have had many ultrasounds in the past, once I had a biopsy that was a fibroadenoma. I have a different concern this time, and I am looking to see if what the doctor has proposed seems appropriate. I had a diagnostic mammogram last week because I felt a new spot/lump in my right breast. Turns out that spot is a cluster of cysts they are not worried about. However on the left breast an area that had a complex cyst on prior mammograms had gotten bigger so they aspirated it. After aspiration they did a low pressure mammogram to ensure full drainage, and the radiologist found another spot of he wanted to double check. So he did so by ultrasound and said all looked good and I should return in 1 year. Today the nurse navigator called me to tell me the aspirated fluid was completely normal and that the radiologist wanted me to return in 6 months to check for stability.  Is this normal protocol after a cyst aspiration? I guess I want to know if this sounds like something I should be worried about or if it is common to follow up in 6 months rather than 12 months. I have never been asked to return in 6 months before so I am stressing about this. Sorry this is a long post, and if you read this far, thank you! Jen Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/824617",
      "Title": "Follow up in 6 months? Worried. peacejen usnerlr"
    },
    {
      "AuthorID": "peacejen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205271/profile",
      "Content": "Sep 16, 2014 04:05PM peacejen wrote: Thank you Wrenn. I know there are not guarantees but I wanted to see what others thought about the 6 month follow up. I don't want to worry the next 6 months, or regret in 6 months that I didn't push for more to be done at this time.  Thanks for taking a moment to respond, Jen",
      "MessageIndex": 2,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/824617",
      "Title": "Follow up in 6 months? Worried. peacejen usnerlr"
    }
  ]
}