{
  "AuthorID": "Peanut323",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205171/profile",
  "Posts": [{
    "AuthorID": "Peanut323",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205171/profile",
    "Content": "Nov 29, 2014 04:16PM Peanut323 wrote: I know that this is an old thread, but just in case anyone else finds it in search of help I thought I would add to it! :-) I had my second TC on 11/11 with Neulasta on 11/12. When I went in to the MO on 11/18 for a checkup, I had developed folliculitis on my scalp. They prescribed me Cephalexin (antibiotic). By 11/19 by face was very red and swollen with swollen lips and a slightly swollen eyelid. I didn't do anything because I have eczema and am used to things like that happening sometimes so I just ride it out. The night of 11/20 though it developed into hives all over my body. MO gave me a prescription for Prednisone but wanted me to try just doing Benadryl until 11/23, then do the Prednisone if necessary. Well, the Benadryl essentially did nothing. Hives continued to get worse for two more days - it was hell. HERE'S WHAT HAS HELPED: Take a Zyrtec (long-acting H1 inhibitor) with a Pepcid (H2 inhibitor) every twelve hours. I got relief almost immediately. I also used ice packs during the hellish phase to cool down my skin and that helped more than anything else topically. I'm writing this a week later and I did do the course of Prednisone and the hives are not entirely gone, but they are tolerable. They are nowhere near as intensely firey and itchy, nor are they as widespread on my body. I go for hours without noticing them. It's mostly around that twelve hour point when I need to take the Zyrtec / Pepcid again that they start flaring up (but again, it's totally tolerable). The MO felt certain it was an allergy to the Cephalexin, but I'm not so sure. I had Cephalexin twice prior to starting chemo/neulasta and had no reaction. Part of what the Neulasta does is releasing histamines when the new WBCs are produced, and isn't it doing a lot of that in that timeframe? I don't know, I'm not a doctor but I'm just not convinced it's the Cephalexin on it's own... ",
    "MessageIndex": 16,
    "PostDate": "29/11/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769465",
    "Title": "Itchy rash/hives from Taxotere??? mdg doxie"
  }]
}