{
  "AuthorID": "peculiargirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219102/profile",
  "Posts": [{
    "AuthorID": "peculiargirl",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219102/profile",
    "Content": "peculiargirl wrote: 2 days after my 2-year cancer free anniversary, a CT scan revealed tumors in my rib cage. RO ordered 10 fractions - then discovered another tumor on the other side of my rib cage and one in my spine - so I'll do 10 more fractions after these. Last week a head MRI found some cancer in the skull bone, but none in my brain. Insurance denied a PET scan, so Friday I'll have 2 CTs and a total body Nuclear scan. RO told me today that MO will use those results to determine where to biopsy, which will help him determine next step/chemo. Wow. Really?? I feel terrific. Some nagging pain in my sides because the tumors have cracked some ribs. The diagnosis has totally blown me out of the water........I thought I was healthy. My previous experience with Chemo and Rads wasn't horrible - not pleasant by any means, but not horrible. I had to have a couple of blood transfusions, but wasn't ever hospitalized. Lost my hair but not my nails, and my hair grew back. My eyebrows never did, so I had them tattoo'd. I got busy and started working out and eating right and lost a ton of weight - I really thought I was the poster child for beating breast cancer. Now this. I know a positive attitude will go a long way in helping me live with stage IV metastatic breast cancer. I'm just really struggling to find that positive attitude. Still doing a couple miles on the treadmill every morning, still eating reasonably sensibly, but struggling to see the point anymore. Any suggestions? Thanks, Kathy Dx 7/23/2015, ILC, Left, 5cm, Stage IIIC, 10/11 nodes, ER+/PR+ Surgery 8/13/2015 Lumpectomy: Left; Lymph node removal: Sentinel Chemotherapy 10/15/2015 AC + T (Taxol) Radiation Therapy 4/5/2016 Breast Hormonal Therapy 6/1/2016 Arimidex (anastrozole) Dx 3/23/2018, Stage IV, metastasized to bone Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "10/04/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863872",
    "Title": "POSITIVE attitude?? peculiargirl DivineMrsM"
  }]
}