{
  "AuthorID": "peetie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130263/profile",
  "Posts": [
    {
      "AuthorID": "peetie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130263/profile",
      "Content": "Jun 7, 2011 08:05PM peetie wrote: how long did they let you recover after your IDC surgery before starting radiation? this is what i was diagnosed with on may 31st and am totally freaked.  did they do just a lumpectomy? i have a choice to make since the lump is 2inches and i am very small 40A. of having the lumpectomy tkae out too much and if thats the case they want to be ready with a insert to slip in right after so i dont have to have 2 surgeries.  all these decisions seems like immediatley while youre still in denial and shock! thanks for listening",
      "MessageIndex": 75,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "peetie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130263/profile",
      "Content": "Jun 7, 2011 10:34PM peetie wrote: i noticed youre diagnosted with the same thing as i am. did they put you on big doses of vit d?  did you have a lumpectomy or a total removal so it hasnt a chance of coming back/  thats one of the choices i have to make ahead of tme for a inplant right after the surgery.  let me know if you dont mid what you went with-k?  i go for hopefully my last test tomorrow, my breast mri with dye and then wait for the results and off to surgery the week of the 20th of june, then off to back surgery, where i was headed before i got the bad news.",
      "MessageIndex": 79,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "peetie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130263/profile",
      "Content": "Jun 7, 2011 10:24PM peetie wrote: wow!  wasnt that reallly soar being biopsied a month after surgery?  did you have a lumpectomy or just take it all off so it doesnt come back?  i dont know the codes yet on this site.  did you have the implant immediatley after surgery?  i am not a vaine person, just about to run out of insurance!!!  thanks for responding so fast  i feel i need answers fast--i am scheduled for surgey the week of the 20th of june!",
      "MessageIndex": 77,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "peetie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130263/profile",
      "Content": "Jun 7, 2011 10:28PM peetie wrote: i am hoping youre feeling great after your first radiation--do you get creams...for the burn i hear about?  let me know how it goes ok?  ide love to hear back from ya.  it took me a week to find a chat site and now that i am so happy to find one thats not a hoaks if ya know what i mean--they talk about everything except what you need to hear being in denial and crazy and before ya know it, your surgery is all over and youre still in denial and crazy from the diagnosis.",
      "MessageIndex": 78,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    },
    {
      "AuthorID": "peetie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130263/profile",
      "Content": "Jun 7, 2011 07:42PM peetie wrote: i bet you have hundreds of prayers including mine. i am new at this too and real scared. i found out may 31 i have IDC and am supposed to go for a breast mri with dye to make sure thats all i have and my nodes are ok. its the hurry up and then wait for the call.  my biggest woory after will it come back is i have never been able to tolerate any kind of hormones or estrogens my whole life and now to find out i have to be on them for 5 years or more is awful to me.  i am a small busted woman post menapausal for 9 years now and the doc wants to see if she can just do a lumpectomy and leave enough of me, to not look as she put it, like a big animal took a bite out of me.  in that case she would remove the rest and i would be fitted ahead of time for an implant. i dont know if they spare your nipple or does the inplant come with one?//  lost of questions.  sounds vaine but since we are all going to pull through, we have to look ahead, right?  i like to run around on 95 degree days at home with a t-shirt and no bra or go to a party twice a year witha push up bra on to look like i have at least a B instead of an A.  every try to find a bra size 40 A?  impossible! thanks for letting me in  took me forever!",
      "MessageIndex": 4,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770017",
      "Title": "Ultrasound shows suspicious lymph node. So scared Chrys23 Beeb75"
    },
    {
      "AuthorID": "peetie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130263/profile",
      "Content": "Jun 10, 2011 10:34PM peetie wrote: i am thinking after i gt my tatoos, i hope theyre close enough together to have a little kitty face and eyes put on after to make it cute--a just for me thing when i am done and cured!  ok--now i think i am quite sure i am loosing it--lol! i havent had my surgery yet, probably the week of the 20th? or soner.  getting i hope my last test results back (my breast mamo) with no news other than what i already know!  some of this termanology on this site i dont understand mostly the abbreviatons, but i guess if i dont know them mabey i dont need to know him because mabey they dont pertain to me?  thanks all of you for being you and sharing.",
      "MessageIndex": 757,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "peetie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130263/profile",
      "Content": "Jun 10, 2011 10:44PM peetie wrote: what is a boost?  i am just ready (not for real) to go have the surgery and have heard about the internal cath rads.  is that what boosts are?  if not do you know anyone who had  the cath rads?  thanks for your input and helping the rest of us. did you have nausia?  if so what do i need to have at home in case  emitrol?  thanks again",
      "MessageIndex": 758,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    }
  ]
}