{
  "AuthorID": "peg1212",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
  "Posts": [
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Jan 18, 2008 04:37AM peg1212 wrote: I was wondering the same things also.  I work in a Nursing home as a nursing assisant and will be receiving chemotherpy treatments and im going to try and work full time.  My concern is im not sure how im going to handle it when the flu hits my doctor advised me to wear mask and gloves which i have no problem with i was going to do that anyway.  But i must work because im the sole supporter for my son and myself and i dont want to lose my insurance benifits and im also going to use a FMLA leave as stagard leave as needed so i hope i can hang in there im going to try my best too.",
      "MessageIndex": 4,
      "PostDate": "18/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698740",
      "Title": "anyone worked or gone to school during treatment elsko kagaines"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Mar 22, 2008 06:18PM peg1212 wrote: Hi Jewels, I don't have much to say as I never do,just not a talkative person to begin with.  However I do come and read the posts daily and can relate to just about everything.  I just wanted to wish each and everyone a Happy Easter Holiday.",
      "MessageIndex": 2039,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Mar 23, 2008 07:40PM peg1212 wrote: KathyL I though when i joined here i was in for only four treatments of chemotherpy when i went to my appt with my Onc she informed me im to do 6 I was'nt a very happy camper but im going to do what she wants so 6 it is.  I guess i should'nt complain because so far so good not many problems at all, just alittle tired at times have'nt missed much work just hope the next three go as well as the last three. Determined1-I seen where you   posted that you pass by Hagerstown on your way to get your daughter, you must be proud,I have a 22 yr old who i can't get to do anything.  Tell your daughter to keep up the good work.  Good luck to the jewels having treatments this week I'll be right along with you.",
      "MessageIndex": 2055,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Apr 5, 2008 11:40AM peg1212 wrote: Good Morning Jewels I wanted to stop in and say Hello to everyone.  I feel like I lost a week out of my life, being I fell like myself a little more today. 1lovewolf-Im right with ya on the night sweats only I have them 24-7. Wish there was something I could do about them,they keep me up thru out the night.  Still have two more treatments to go and they seem like they get worse as you get closer to being finished.  Well I wish everyone well and hope u all have a wonderful day.",
      "MessageIndex": 2272,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "May 11, 2008 06:45PM peg1212 wrote:  Hello Jewels I just wanted to drop in a wish everyone a Happy Mothers Day.  Mine turned out to be happy after all, my son called and wished me a Happy Mothers Day it was good to hear from him. ",
      "MessageIndex": 2772,
      "PostDate": "11/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Feb 4, 2008 04:59PM peg1212 wrote: Hello everyone  Its kinda funny that this is the only place i ever been to being new and still have so much in common.  I'll be here for a while draining your support and giving some back as well.  Im going to recieve my next tx on the 15th of Feb which is coming faster then i like.  If it's anything like the last tx i'll be out for about a week i guess, had a rough time with my first tx.  Im here waiting on the hair deal i still have it all, but i know im going to have to part with it soon.  Peg",
      "MessageIndex": 1074,
      "PostDate": "04/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Feb 6, 2008 03:54AM peg1212 wrote: Well Good Morning how is everyone?  Well it's been 12 days now since my first tx and i'm sitting here waiting for the first hair to fall.  Kinda like waiting on a snow storm ya know.  Well anyway around my house we have a bet going on for which day that my hair will star  falling out, hope i win the bet is getting pretty high.                 Vettegal:  I do believe we are on the same schedule and i have one down and 3 to go.  Well of to work for me you Jewels take care and goodluck to anyone who has to for treament today.    ",
      "MessageIndex": 1103,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Feb 16, 2008 11:40AM peg1212 wrote: Thanks for the shot out wv girl yesterday and today have'nt been to bad yet just that the taste buds already are acting up tho, and then what really will get me down will be the nuelasta shot i have to go get on Monday not looking forward to all that again.  Hope you are doing good as well Thanks",
      "MessageIndex": 1369,
      "PostDate": "16/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Mar 17, 2008 06:15PM peg1212 wrote: Hello Jewels          Im glad to hear others are seeing peachfuzz growing as well, mine is growing also, I just hope that it sticks around for the next three treatments.  I know it might sound funny but i've kinda enjoyed getting up in the morning not blowing my hair and stuff, cuts off about 1/2 of getting ready time.",
      "MessageIndex": 1940,
      "PostDate": "17/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Apr 19, 2008 09:23PM peg1212 wrote: Hello Jewles!  I just want everyone to know even tho I don't post often I do read thru the posts every night and I include each      and everyone of you in my prayers. Kimberly,  I hope that the infection trouble that you are having  gets better soon I can't even imangine the frustration you must fell. Im waiting for my chemo treatments to be over with so I can move on to the next step and get these expanders out and inplants in, I can hardly wait.  Im planing on my surgery to take place sometime around the begining of June.  My last chemo treatment to take place on May 9.  I can't believe that Im almost finished with this part and then I have to do the five year maintance drug.   Good Night to all you wonderful Jewels ",
      "MessageIndex": 2476,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "May 9, 2008 02:14PM peg1212 wrote: Thank you SISKimberly,  Its 1:30 and I'm just getting back in glad to be finished with it.  Now all I have to do is set up surgery for my exchange so i can get these expanders out. To everyone here i've been out for a while so I have'nt keep up on the post hope everyone is doing well.  My son who is 22 and who also is bi-polar has been in a manic state and took off on a grayhound bus to Arizona he does'nt know a soul out there and has been gone now for about a week and 1/2 and says he's not coming back so i've been dealing with that and just praying he will stay safe until he gets back to his old self which i hope will be soon.  I just hope he keeps in mind that he left a 3yr old son behind.  So just when u think u have one thing whipped something else comes yur way.    By me having breast cancer and going thru everything i've had to i did learn one thing and that is how strong i am and i know if i can get thur this i can get thur anything. To everyone take care and be strong.",
      "MessageIndex": 2753,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Mar 7, 2008 07:06AM peg1212 wrote: Good Morning Jewels,  I wanted to wish everyone today good luck with treatments.  I'm going for No 3 today,and thought that I had 1 more left after this until I went to see the Doc on the 5th and she said I'm doing 6 instead of four what a bummer.  Guess i'll be bald for a little longer yet, getting use to it now.  It has cut down on get ready time a whole lot.  Can get a shower and dress and be out the door in about 20 minutes.  Have to find some kind of positivity in all this. ",
      "MessageIndex": 1727,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Mar 18, 2008 06:37PM - edited Mar 18, 2008 06:45PM by peg1212",
      "MessageIndex": 1954,
      "PostDate": "18/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Mar 29, 2008 04:06AM peg1212 wrote: Good morning Jewels,  It's about 3:30am can't sleep, when i got back from my tx yesterday at 1:30 i hit the bed so now im off schedule never felt like i had to lay down before i did get up to make dinner and then back to bed i went.  My blood work showed that im a little anemic so i hope that my shot on Monday takes care of that. RNTeach after my last tx which is scheduled in May i have no rads to do i had a total mascetomy with recon which will hopefully be finished at the end of May early June have'nt decided yet. tinalee123- I have a 15yr old who I love to take to breafast on my Chemo day since i work Monday thur Friday, and he looks forward to that. I also have a 22yr old son and a 3 yr old grandson which i love dearly so i have alot to look forward too and to be grateful for and I try to keep all that in mind as I go thur this, and it really keeps me focus on getting well and I plan on being here for a long time to come.",
      "MessageIndex": 2166,
      "PostDate": "29/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Feb 15, 2008 04:07AM peg1212 wrote: Good morning to everyone!  Vettegal looks like im right with you today on this one, have to be there at 800am for round 2.  Good luck to you, and to anyone else needing some good luck today.",
      "MessageIndex": 1327,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Mar 7, 2008 04:28PM peg1212 wrote: Good afternoon Jewels, thanks for all the support that each and everyone of you give.  You all are special Ladies. Chj127  I have'nt heard of Meadowes frozen custard, but then again Im not a sweet eater just never get the craving for it my down fall is starches.  Oh and one more thing i found bandanas to fit me at Walmart and at the craft stores,and at the Family Dollar store I ran across some that were already pre-tied in the back they are very nice and just 1.50.  Just throw a ball cap over it and out the door you go. Has anyone tried MariLax for pooper troubles  It seems to do the trick for me anyway the senna c did'nt do a thing for me.        I hope everyone is felling well this evening Bye",
      "MessageIndex": 1737,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "peg1212",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61099/profile",
      "Content": "Mar 28, 2008 07:13AM peg1212 wrote: Good Morning Jewels, hope everyone has a great day no matter what they may be doing, good luck to WVgirl,Deb102307,RN2Teach, and Vettegal with treatments today.  I go today as well and this is my forth of six, hope it goes as well as the last three.  I hope tonight I get some sleep because those steriods sure keep me up last night I think I got 3 hrs if i was lucky.  Well off I go, have to take my son to breakfast and then off to school.  Take care",
      "MessageIndex": 2145,
      "PostDate": "28/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    }
  ]
}