{
  "AuthorID": "PegC01",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178650/profile",
  "Posts": [
    {
      "AuthorID": "PegC01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178650/profile",
      "Content": "Jul 2, 2013 05:33PM PegC01 wrote: Ladies, I had my first chemo in June.....my advice to you is to make sure you drink LOTS of water, rest, take your SE medication as prescribed (no one should have to go through the SE), and don't worry.   Day 13 I did start to lose my hair, there isn't any shampoo, or treatment that will totally help on losing your hair.   I have been using Nioxin, but it is still coming out.  Cold Caps, if you research it well, I would not recommend it, I don't want to take the 1-2 percent chance of cancer going to my head.   I'm taking the aggressive treatment to prevent this from ever coming back, why would I want to add any percentages to what I'm trying to Conquer?    Good luck ladies, you will all do fine, it's not as bad as you think it is.   We are our worse fear....you will be tired, might be a little nauseaed or have constipation or diarrehea, but it is do-able.   ",
      "MessageIndex": 1764,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "PegC01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178650/profile",
      "Content": "Sep 18, 2013 05:30PM - edited Sep 18, 2013 05:35PM by PegC01 Hello Ladies, Ok, here I am getting ready to start my Rad's.  I was told I will have 33 (including boosts), I won't get done until around the first week of November.  HOWEVER, I made it through Chemo, everything from this point is down hill from here... I got marked this past Monday and it looks like I gave my Grand daughter a magic marker and let her mark all over my Left Breast.  I look like I have a road map of New York, or some sort of spagettii turnpike.  I heard a lot of women gets little dots and so forth, not me, I got  thick solid black lines and Huge \"x's\"...going to be hard to wear certain shirts without a huge black mark showing.   I read a lot of everyone's comments and it looks like fatigue is the worse of it.  Not looking forward to the sun burn feeling on my breast however.  The RO wants me to use Kendal Soothing Ointment....All I know is that it puts a white film on you and stays there....Yippy.  White film with black marks. RO Nurse called me today and told me they want me to come in tomorrow for a simulation run then I start my Rads next Monday.  She also said that they will be doing more xrays, to make sure that the markings are the same on what they did last Monday when they marked me.   Hoping this is a common thing.  Don't know about anybody else, but I get nervous when I have to have extra xrays or tests done, especially since I was dx with BC.  Anyway, congrats to those who have finished, hoping I will get through this good.  I still have tired muscles in my legs and arms since my last chemo which was 4 weeks ago....but I think it is getting better.   Still feel and get out of breath when I do some things, but I think that is from the bronchitis I was trying to get 1 week after chemo....still coughing yuk....",
      "MessageIndex": 1526,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    }
  ]
}