{
  "AuthorID": "PegInTX",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140017/profile",
  "Posts": [
    {
      "AuthorID": "PegInTX",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140017/profile",
      "Content": "Nov 22, 2011 07:02PM PegInTX wrote: I was told by the radiologist (just yesterday) that an ultrasound would not really show anything as far as my microcalcifications were concerned...he just kept pushing biopsies. I'm curious too as to how ultrasounds compare with mammos...",
      "MessageIndex": 5,
      "PostDate": "22/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778386",
      "Title": "Worried and waiting Momma-Scott Momma-Scott"
    },
    {
      "AuthorID": "PegInTX",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140017/profile",
      "Content": "Dec 14, 2011 09:33AM PegInTX wrote: I've never been one for last minute desicions like this, but I decided NOT to have the biopsy done. I called this morning to cancel.  I just did not have a peace about getting it done today. I'll spare you all the details, but long story short, my mom's case was very similar to mine. Something detected only on mammo/ultrasound, could not be felt, very tiny, etc... She had a biopsy and all was fine. 2 weeks later, a 1cm lump developed rapidly in that time in the exact spot as her biopsy. It was cancer. She battled it on and off for the next 8 years until her death.  Right now, the docs are all in agreement and they are 98% sure it is a harmless fobroadenoma. They said I only have a 2% chance of it being cancer.  It is completely contained in a tiny 5mm mass.  Had it not been for my mom's history of breast cancer, they would not even be doing the biopsy. They would simply monitor. After much thought and prayer, I have decided just to monitor the area. I have to be at peace with my desicion. To me, the biopsy carriess with it more risks (not getting the pertinent areas of the mass, bursting the wall of the contained mass, cancer seeding/spreading along biopsy line *as in my mom's case*). I have to monitor the calcification areas anyway, so why not add one more area to monitor. If any atny time, things change or the docs are concerned enough to think something more is going on, I may chose to biopsy (or just completely remove in a lumpectomy). Thank you all so much for your thoughts, well wishes, and prayers.  ",
      "MessageIndex": 10,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779462",
      "Title": "34 years old...biopsy tomorrow...scared PegInTX Tenmom"
    },
    {
      "AuthorID": "PegInTX",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140017/profile",
      "Content": "PegInTX wrote: I have an ultrasound guided needle biopsy tomorrow...fine needle aspiration, I believe. Have any of you ever had this? I have read up on this procedure, but wanted feedback from women who have actually had it.      Was it painful? Did you have a lot of discomfort afterward? Were you able to carry on with your normal activities the next day? I am trying really hard to stay positive, but the closer the procedure has gotten, the more frantic I get. I have been following many stories on here. I am flabergasted by the amount of young women diagnosed with breast cancer. Quite honestly, it terrifies me. Such yound women...in their 20's even! My mom was diagnosed at age 44. Hers was \"caught early\". She battled it strong for the next 8 years until her death.  Sometimes, I second guess my decision to have a biopsy. Like mine, my mom's mass was only detectable by mammogram/ultrasound. She didn't develop a lump until after the biopsy. So... I have this fear of messing with something or spreading something that is contained (at least for now).  Not having a biopsy and not knowing is just as bad though. If something is there - I want it out! I want it all out! Dx Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779462",
      "Title": "34 years old...biopsy tomorrow...scared PegInTX Tenmom"
    },
    {
      "AuthorID": "PegInTX",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140017/profile",
      "Content": "Dec 13, 2011 11:45AM PegInTX wrote: I was just called to go over details of biopsy for tomorrow and was told am having a core needle biopsy. I little more freaked out now :(",
      "MessageIndex": 5,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779462",
      "Title": "34 years old...biopsy tomorrow...scared PegInTX Tenmom"
    }
  ]
}