{
  "AuthorID": "Pelicangirl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140985/profile",
  "Posts": [
    {
      "AuthorID": "Pelicangirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140985/profile",
      "Content": "Mar 6, 2012 08:12PM Pelicangirl wrote: dear Sandy Beaches, So sorry to hear of your rash but in a way relieved to hear I am not the only one fighting skin issues post surgery. I had BMX with immediate recon on feb 1 and second surgery on Feb 29 to remove axillary nodes and revise abdominal incision. For some reason, this second surgery has really wreaked havoc on my skin. I have skin breakdown (like a brush burn or tear) in areas where I have had to put tape to hold down the gauze over incisions and also at the site where the drains go in. Also developed rash and hives where the bra touches the new breasts, and above and below the abdominal incision. Dry itchy skin also along my thighs and buttocks where the compression girdle touches my skin. I finally have started taking breaks from all garments and treating the irritated skin with cortisone cream or calydryl (though not directly on the incisions or sutures of course). Right now I am wearing only a 100 percent cotton button down shirt to sleep in...it doesn't cling and seems to let my skin get air. My PS just shrugged when I showed him my rash and hives..he said some people's skin is overly sensitive and it will just heal in its own time. But I have to say, in addition to the pain from the incisions, these rashes have made the second surgery that much more unpleasant. Do try cortisone cream, caladryl or something similar on the rash (just make sure it doesn't get on incision or sutures) and also stick to 100percent cotton or natural fabrics like linen so your skin can breathe while you heal. These suggestions came from my PS's nurse practitioner by the way! At least she took my discomfort seriously!",
      "MessageIndex": 3,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/783721",
      "Title": "Rash near incision site? SandyBeaches Cats134"
    },
    {
      "AuthorID": "Pelicangirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140985/profile",
      "Content": "May 13, 2012 05:29PM Pelicangirl wrote: Happy Mother's Day Everyone! I made it thru AC#2 this past Thursday.  If nothing else, this ride is becoming \"predictable.\"  Had my infusion from 11am to about 2pm and by 4pm the nausea started same as last time.  I was prepared for it though, and have been managing it well with the nausea meds (compazine and zofran) on a very regimented schedule.  The restlessness and flushing was much worse this time.  I could barely rest that night...finally gave up and slept naked on the recliner with just a cool white sheet pulled over me, and an ice pack behind my neck!  I am super sleepy now though and the more I sleep the better I feel.  I followed another thread about what to do to quench thirst b/c my mouth is so dry and nothing I drink seems to help.  Will try some of those tips...plain water tastes weird and makes me a little queasy and I absolutely can't abide the taste of Diet Coke or any diet soda all of a sudden.  I am drinking ginger ale and regular coke (those taste good to me) but I am trying to avoid all of that sugar.  The threatd recommended Cyrstal Lite lemonade mixes and juices cut with water so I am going to try that (I've developed thrush in my mouth and throat so anything too acidic burns).  I know how important it is to stay hydraded, so this is one problem that has to be solved!  On the bald front....I am starting to lose my little \"hair nubs\" in a pattern of \"male baldness\"....eyelashes and brows still intact.  I did get news before my infusion that my labs were \"excellent.\"  So apparently the nasty Neulasta shot is working.  Also suffering with extreme dry skin especially my lips and inside my nose. Have had some lip cracking and minor nose bleeding. The chemo nurse was a fountain of good tips the other day.  She says Nivea makes a new lip balm that is mentholatum free..to use it on my lips and take a q-tip and dab just a little on inside rim of my nose to keep it moist. I'm also slathering Lubriderm  lotion all over frequently. I am concerned becaused onc warned me Thurs. that although I am doing well now, the results of the AC are cumulative and cycles 3 and 4 will be \"much harder. \" But he promises the following four cycles of Taxotere will be \"not nearly as bad.\"  I hope he is right.  Hope you all are all hanging in there and finding ways around the SEs as they crop up.  Let us continue to be undaunted by the obstacles!! Pelicangirl",
      "MessageIndex": 4032,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "Pelicangirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140985/profile",
      "Content": "Mar 14, 2012 02:37PM - edited Mar 14, 2012 02:39PM by Pelicangirl I was so relieved to find this thread. I have been going mad with itching all over since my BMX wih recon but mostly on the reconstructed breasts, on my abdomen above and below the scar where the tissue was taken to reconstruct the breasts, anywhere where there was surgical tape to cover wounds, etc. I have attributed most of it to allergies to surgical tape but that doesn't explain the bumps and hives I have been getting in places where no tape has touched! I have gotten some minor relief from Benadryl and hydrocortisone cream alternated with Caladryl Clear, but I am willing to try the Pepcid tablets. Neither the BS nor PS has had any explanation.. The PS said it looked like some sort of contact dermatitis but I don't think that is it at all. I think some of the theories you ladies have posed make more sense...phantom pain that manifests as tingling or itching, nerve regeneration, skin stretching and sutures healing causing a sensation of itching...those all make more sense to me. I am surprised physicians don't pay more attention to this problem post-surgically. Oh well, at least we have each other to network with and share possible solutions! I will try the Pepcid along with continuation of he hydrocortisone cream and Calydryl and report back.",
      "MessageIndex": 17,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721562",
      "Title": "Will I ever stop itching? Held Moderators"
    },
    {
      "AuthorID": "Pelicangirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140985/profile",
      "Content": "Mar 18, 2012 08:12PM Pelicangirl wrote: Had to laugh because I thought this could only have happened to me! But all of this..including getting breast cancer in the first place has happened to so many of us..why should getting our period during a MX be any different?. I had been perimenapausal for awhile..went 4 whole months without my period then got it the day after my BMX with reconstruction. Just lovely!! Due to the abdominal incision for DIEP I had to wear a compression girdle with a \"hole\" in the crotch to urinate thru. I asked for a pad but it would have been awkward to place with the girdle so the nurses just put that blue pad under me and I bled onto that. Of course blood got all over the girdle too. It was a heavy period of course (since I had \"missed\" four in a row ) so i felt completely gross for the 6 days I was in the hospital. Truly one of those experiences you look back on later with amusement but at the time just added to the general misery of the situation. Seriously, the hospital staff have dealt with everything under the sun. A period or two isnt likely to rattle them and it shouldn't rattle us as a patient either.",
      "MessageIndex": 28,
      "PostDate": "18/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784096",
      "Title": "Embarassing question.... Emaline jocelynlally"
    },
    {
      "AuthorID": "Pelicangirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140985/profile",
      "Content": "Apr 2, 2012 06:00PM Pelicangirl wrote: I had double trouble with my skin after my BMX with recon ..I am allergic to most of the surgical tapes so my skin was raw and red wherever tape had been. I also had that zinging feeling and sensitivity due to nerves being cut or whatever. I did many of the things previously mentioned...wore the softest cotton loose fitting tops, lightly massaged my skin with Lubriderm lotion and put hydrocortisone cream on raw spots where the tape had been. I wish I had thought about the pillow with the little beads...I have seen them for sale at Bed Bath and Beyond. I found light massage with lotion helped the most... I am still hypersensitive and numb from my second surgery a month after the first to remove axillary nodes...I massage under my arm and my upper arm in hopes that some of that numbness and weird zinging feeling will eventually subside.",
      "MessageIndex": 11,
      "PostDate": "02/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725836",
      "Title": "Post Op Skin Hypersensitivity NikiC Ariom"
    }
  ]
}