{
  "AuthorID": "pennzer",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69681/profile",
  "Posts": [
    {
      "AuthorID": "pennzer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69681/profile",
      "Content": "Jul 24, 2008 11:57PM pennzer wrote: Sheesh, stereotactic needle biopsies aren't much fun, are they? Got my report today, and my little pea-sized mass is invasive ductal carcinoma. There is also an area of microcalcifications in a different quadrant on the same breast, but the radiologist was not able to get a stereo view and therefore was not able to locate it closely enough to put a needle in it. For that reason I will be having a modified radical mastectomy, whereas I could have opted for a lumpectomy if it were only the small tumor. The surgery is scheduled for 8/8, and if the lymph nodes are negative, I probably won't even have to do chemo. I am so thankful that I might have found this early. I am thankful for the pain and itching that led me to do a careful self exam. Campe, are you here? You must get yours checked right away.",
      "MessageIndex": 9,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709119",
      "Title": "Worried campe pennzer"
    },
    {
      "AuthorID": "pennzer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69681/profile",
      "Content": "Jan 28, 2009 01:47PM pennzer wrote: Suz, wondering if you made that appointment with the breast center and wondering how you're doing. Hope and pray that all your news is good. If you check back here, please let us know.",
      "MessageIndex": 18,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709119",
      "Title": "Worried campe pennzer"
    },
    {
      "AuthorID": "pennzer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69681/profile",
      "Content": "Jul 31, 2008 01:48AM pennzer wrote: prayinghands, thank-you for your prayers and please know that you have mine..as well as all of you who are going through the angst of screening and testing. Do you have your test results yet?  campe, please tell us you are going to see about your symptoms right away. Tammychat was right. We must be our own advocates when it comes to breast health. Yes, I will be back to let ya'll know how it goes with my surgery. Please pray that the nodes are negative and that I will be spared the chemo routine. Please pray for all of us that face our mortality every time we do a breast exam!",
      "MessageIndex": 13,
      "PostDate": "31/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709119",
      "Title": "Worried campe pennzer"
    },
    {
      "AuthorID": "pennzer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69681/profile",
      "Content": "Aug 15, 2008 11:11PM pennzer wrote: Hi all, Here I am 1 week post op, and I am so happy! Path report showed a Grade 1 tumor, clear margins and all lymph nodes taken were negative. For all we can tell, I no longer have cancer! Surgery was a breeze. I got to go home the morning after, and the pain was very manageable. I am very active and have been since the day after surgery. I switched from Darvocet to Ibuprofen on Day 3. I thank God for being with me throughout this little journey, and I thank my doctors for being so responsive to my symptoms and concerns. Early detection really is our only hope. Ladies, get screened, be very mindful of any breast changes, and do not be afraid of that diagnosis if you act quickly. Thanks to all for your prayers and concerns.",
      "MessageIndex": 16,
      "PostDate": "15/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709119",
      "Title": "Worried campe pennzer"
    },
    {
      "AuthorID": "pennzer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69681/profile",
      "Content": "Jul 19, 2008 10:02PM pennzer wrote: campe, I have a similar lump--about the size of a pea, close to the skin and there is skin pucker just above it. It does not exactly feel like it is caught between 2 layers, like yours, but it is very close to the skin. I know that any mass that causes a pucker should be checked out, so I have already had a mamo and u/s, and I have a stereotactic needle biopsy scheduled for Monday 7/21. I am 65 and at higher risk than you at your age, but you absolutely must see a breast surgeon for evaluation of your \"bb\". He will most certainly schedule you for another mamo plus u/s. If he doesn't, get another opinion! BTW: I have had quite a bit of pain in this same (right) breast, along with itching. The pain started as a needle-like pain just below the nipple, but now it is more generalized, and I am taking Naproxen round the clock for relief. I have had fibrocystic breast disease all my adult life, but the associated pain was more like a soreness and tenderness and not such an active pain as I am having now. Please let us know that you are seeing about your \"bb\", and I will let you know how my biopsy goes.",
      "MessageIndex": 8,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709119",
      "Title": "Worried campe pennzer"
    }
  ]
}