{
  "AuthorID": "peonyflower…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71894/profile",
  "Posts": [
    {
      "AuthorID": "peonyflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71894/profile",
      "Content": "peonyflower wrote: hi guys-i thought youd be able to give me feedabck-i have been reading about estrogen dominance and how using this helps offset the effects...anyone try it? any thoughts? i have low prog and when i started using the cream in a very low amount i sware i felt better----btw-i am almost 40-3 little ones and a cancer phobic.....i try to read up on everything and get so scared everytime i hear of another woman diag with it. i fear that my history of fertility drugs, removal of implants, older age at pregancies, and low prog puts me at risk. i just had an MRI a year after my removal just to make sure all was ok(i never had implant related problems i just wanted to be natural and i love them now!)   because i thought i felt something but it was neg. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720844",
      "Title": "progesterone cream-new with questions peonyflower survivorsdaughter"
    },
    {
      "AuthorID": "peonyflower…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71894/profile",
      "Content": "Sep 15, 2008 02:14PM peonyflower wrote: hi and thank u for your replies...i guess i read too much -i read dr. Lees book and just finished suzanne somers book-they both take a strong stance on having balanced hormones to ward off many cancers. since it was validated thru b/w that my prog is always low it  was rec. for me to try prog pills or creme. after researching both i chose the creme...i just wanted to talk with real women and their experiences and recommendations with either  thank u. i didnt realize breast cancer is sens to progeaterone as well....its all so confsuing all so scary",
      "MessageIndex": 3,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720844",
      "Title": "progesterone cream-new with questions peonyflower survivorsdaughter"
    }
  ]
}