{
  "AuthorID": "Peppin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229183/profile",
  "Posts": [
    {
      "AuthorID": "Peppin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229183/profile",
      "Content": "Feb 26, 2016 11:18PM - edited Feb 26, 2016 11:20PM by Peppin You are not crazy. There is a symptom that could be worrying. You need to monitor it.  (By the way, also look out for any changes in contour of your breast). If your check-up is due go for it and discuss it there. You will have new results. If all comes out normal, get them to explain what is the cause of the indentation - is there evidence of it in the scans? If you are still not satisfied, get further advice. It is you who has to live with the consequences if they are wrong, so you have every right to get the answers you need to be satisfied that there is nothing of concern. Don't spend energy worrying that they see you as crazy or paranoid, or that you are wasting their time - that is their problem not yours. I am sure they see tonnes of patients who seem that way, so you will just be one more. Focus on getting answers to your questions and concerns. Something else, check-up time is always a worrying time - I am a very logical person but two weeks before check-up time I go completely crazy. My fears take over. If you feel that way just hang on in there till the check-up arrives and is done, try to go out with friends or do things that distract you till that date is over, or if you are capable (and I don't manage to) face your fears. Take care. ",
      "MessageIndex": 3,
      "PostDate": "26/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841690",
      "Title": "Indent/Dimple but no lump Palm_tree_heaven Peppin"
    },
    {
      "AuthorID": "Peppin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229183/profile",
      "Content": "Feb 26, 2016 03:56PM Peppin wrote: You ask if a lump is a requisite for breast cancer. It isin't. I had an indentation that looked like a dimple and no lump at all. When I'd raise my arm, the dimple would become a bit deeper forming like a furrow. On the mammogram there was only a bit of 'distortion'. But the MRI lit up like a Christmas tree - turns out I had several tumours. But in general my breasts were lumpy so you couldn't really feel anything different. The type of tumours I had were not the type that produce a hard lump. Having said that I am not saying that this is your case. You had the MRI, and mammogram and ultrasound - one would expect one of those to pick up something. Would testing for blood tumour markers be an option for you? You could discuss that possibility with your doctor. The other test that showed some of my tumours (not all) was the PET scan - but it does involve taking radioactive substances and radiation - so it should not be used lightly. May be you could discuss if you should pursue it further with your GP? When is your next mammogram or MRI due? Is it soon? Surely they would want to keep an eye on you. Personally throughout my cancer journey I made sure I took all the steps I could, at the cost of being a pain to my doctors and my relatives - but I wanted to make sure I would have no regrets, and I have none. In situations similar to yours I found it useful to decide what would be sufficient to reassure me that all was fine and then I would make sure I would get those steps done. Once I took those steps I would then put it behind me. From the MRI there were doubts on a lymph node on the other side from the breast that had the cancer. I insisted on it being biopsied. Once the biopsy result came normal and I knew that there had been no sign of it being positive on my PET scan, I knew I had done all that was possible. I have not worried about it since. The way I see it since you are worried, you really should discuss it with a medical person until you are reassured that all is fine.        ",
      "MessageIndex": 1,
      "PostDate": "26/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841690",
      "Title": "Indent/Dimple but no lump Palm_tree_heaven Peppin"
    }
  ]
}