{
  "AuthorID": "Peppertree",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83521/profile",
  "Posts": [{
    "AuthorID": "Peppertree",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83521/profile",
    "Content": "Peppertree wrote: Does anyone have advice on dealing with what seems to be a vulnerability in the finger ligaments from Taxol?   I finished bi-weekly double-dose chemo (8 weeks A/C, 8 weeks Taxol) 17 days ago.  I've had some mild neuropathy in my fingers ( tingling and numbness in  pads when touched; no neuropathy in the feet).  Also, after starting Taxol  I noticed an increased tendency to stiffness in my lower thumbs, probably from mild tendinitis--I'm a writer and work on the computer a lot, so I have a tendency to that anyway.  None of this worried me  until about three weeks ago, when I picked up a somewhat heavy object with my left hand--I have a  lymphedema bandage on my right arm, where I had an axillary dissection, so I have to use my left hand and arm for carrying anything heavy--and to my surprise, wrenched the last three fingers, leaving them with a mild sprain.   I iced the sprain right away and continued the icing the next day, but the three fingers continued to feel \"sprainy,\" and because I  have to use that hand for things like computer work and housework and cooking, I'm afraid I'm slowly making the sprained ligaments worse.  Then  yesterday I was carrying some heavy plastic shopping bags with that hand, and even though I finished the Taxol nearly 3 weeks ago, when I got home and put the bags down, I suddenly had fairly severe pins and needles on the outside of the hand and in the three sprained fingers; I haven't had that kind of neuropathy  until now, or that much.  The pins and needles went away after a few minutes, and i've started applying gentle moist heat (towels) to try to reduce the inflammation in the sprained fingers, but I'm getting worried.  I know it may take months for the vulnerability caused by Taxol to go away, and I depend on that hand so much that I'm worried about losing the use of my \"good\" hand, too. I wondered if anyone has had a similar problem and what I can do to deal with it while recovering  from chemo and waiting for the hand to regain its normal strength and agility? Dx 11/21/2008, ILC, 3cm, Stage IIIA, Grade 2, 20/28 nodes, ER+/PR+, HER2- Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "24/05/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734734",
    "Title": "Advice on weakness in finger joints from Taxol? Peppertree Peppertree"
  }]
}