{
  "AuthorID": "PersonalTra…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
  "Posts": [
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Nov 20, 2013 07:43PM PersonalTrainer wrote: I have a small fan I turn on when I begin to feel hot - or just have a hot flash - while using the FlexiTouch. It really helps.",
      "MessageIndex": 3,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/814654",
      "Title": "keeping cool while using pump vlnrph vlnrph"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Aug 22, 2012 07:07PM PersonalTrainer wrote: So glad you won, Tina.  That is encouraging.  I did contact Mr. Weiss and he sent me some good information to use.   Yes - them trying to blame my husband's employer for the denial is nonsence.  Actually trying to tell me that there might be secret provisions to the plan that only the claims processers have access to is really outragious - the funny part is, it's a large company and we have a dedicated 800 number to use for customer service at Aetna.  You'd think these representatives would know the plan if they're giving out information on coverage as part of their job.  That was just a big fib because they really should have covered the claim - at least most of the items - if you look at the \"clinical policy bulletin\" they found to send me AFTER they denied my claim.  I'm working on my appeal letter now - and the provider is going to appeal as well.",
      "MessageIndex": 6,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/792299",
      "Title": "Insurance question PersonalTrainer PersonalTrainer"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Aug 20, 2012 07:19PM PersonalTrainer wrote: Thank you, Binney.  No - I'm not giving up at all - we can't afford for me to give up. I'm going to appeal it and then appeal it at a State govenment level if need be. At this point I'm mostly just spitting angry.  I've called and emailed several times, before the denial, asking if there was anything I could do or send in to help with the processing of the claim - they kept telling me no and don't worry.  From the day I got my cancer diagnosis, I've been totally frustated by the lack of knowledge as to what's covered and what isn't at the insuance company.  I've been asking and asking about these sleeves mostly because I know I'm going to need them again and because I really do need more than two at once.  Because of my job I need to be washing them more often, but I can't get them clean and dry in time.  I kept being told there was no limit on the number of garments I could order; the provider was told the same thing.  Good thing I was waiting until this claim was processed to order anything more.  But, it's not as if both I and the participating provider who supplied me with the garments hasn't asked repeatedly about coverage. Today, the customer service representative actually told me that, while yes they did have a record of the provider calling twice to check my benefits for garments, probably the provider didn't tell them it was for lymphedema.  She seemed to think that garments would be covered, just not if they were for lymphedema.  The next rep told me that probably that was true as this may be excluded under my husband's employer's plan.  I asked where I could find this in the plan documents - no, she told me, we can't give those out - only the people who process the claims have access to that information - you have to wait until you send the claim in to find this information out.   Plus, everytime I ask anything in writing, I get a reply telling me to use the \"Ask Ann\" feature which is a \"virtual assistant\" on the website.  Okay - I've tried, but \"Ann\" tells me I need to ask customer service those questions.   Anyway - thank you for the contact information. I am going to send him an e-mail - and work on my appeal letter.",
      "MessageIndex": 3,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/792299",
      "Title": "Insurance question PersonalTrainer PersonalTrainer"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Nov 20, 2012 02:38AM PersonalTrainer wrote: My side and axilla are my issue also - with my arm now involved as well.  I have to wear a sleeve and hand protection, but my trunk is a challenge.  I have the same issues with the athletic compression shirts - even a boy's small was too big to give any compression underneath my arm.  The Wearease camisole is good.  I also found that a Genie bra works really well - plus they're inexpensive and comfortable.  For working out - I can wear the compression bra/tops I've always worn.  When I try to wear any of my old regular bras - I have swelling in my side after only an hour or so.  At night - I use the swell spot that covers my breast and axilla area.  Over it - I wear a cotton camisole I buy in the Junior department at Kohls.  You really can find them in most stores now as they're very popular for layering.  The point is that I can buy a $5 camisole - you just have to wash them every couple of nights so that they remain compressive and they'll only last for a few months - but the cheap ones work well.  I buy a size smaller than I would normally wear.  With that and my night sleeve - I can control the swelling. You really just need to experiment before you find out exactly what will work for you. ",
      "MessageIndex": 2,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796550",
      "Title": "New Truncal LE--What to Wear to Squeeze It? sbelizabeth PersonalTrainer"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Aug 27, 2012 10:24PM PersonalTrainer wrote: I'm both a personal trainer and a fitness instructor - by definition, my job involves lifting weights all day whether demostrating an exercise for a client, spotting someone while working the floor or teaching class.  I teach a lot of different classes from Pilaties to boot camp.  Most of the classes I teach are strenious and involve heavily using my arm.  I often teach several classes per day - .  I even teach Body Pump during which I Clean and Press about 30 pounds over my head multiple times.  My lymphedema started in my truck and breast during radiation last fall - and yes, I was teaching during radiation.  Did lifting weights cause my lymphedema?  I'll never know for sure - but I don't think so.  I had an infected seroma and cording after surgery - so the signs were there.  But I wasn't willing to give up my job.   While I lift heavy weights - I never lift a lot more than I'm used to.  I bump my weights up gradually.  My arm was bothering me for weeks while I waited for my sleeve order - lifting wasn't helping.  But, since I've had my sleeve, I've noticed that on these hot humid days when my arm is feeling bad it actually feels better after I teach. So, there is hope -  you may be just fine lifting heavy weights if you wear your compression garments.  But - you're going to need to be careful.  You're body is telling you right now that you need to go slower if your arm is bothering you while lifting.  As I tell my clients - we're not in a race here, we'll get there eventually if we go slow. I've been okay so far - hopefully the swelling will stay under control - I'm doing everything I can to be compliant and keep the lympedema from progressing.  I also remind myself daily that I can't worry about the future - I can only enjoy today.",
      "MessageIndex": 5,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/792546",
      "Title": "Lymphedema and work nibbana carol57"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Nov 1, 2013 10:23PM PersonalTrainer wrote: Thank you all. I'm feeling much better about it all. I don't know exactly why - but I am convinced my shoulder mobility problem is from lymph. It's totally back to normal - and feels even better tonight after going for more therapy today. I think some of it may be a tight pec muscle from radiation - but still, it's when the lymph is bad that I have trouble with it. I do think the over-the-shoulder sleeve might help. I may try one. I did try a small boy's compression shirt when I was originally seeing the first therapist to try and combat the lymph she felt in my shoulder and upper arm. It just didn't hit my arm pit enough - mostly it squished my chest, but not my arm as I am small. Anyway - I'm not going to attempt going without the sleeve and night sleeve again. It's really in the summer when I wear short sleeves that I'd like to anyway - and then it's really not a good idea as that's a bad time of year with all the humidity. And thanks, Carol - I do love being a trainer. It's really rewarding to help people.",
      "MessageIndex": 4,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/813861",
      "Title": "shoulder mobility PersonalTrainer PersonalTrainer"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Mar 6, 2014 01:22AM PersonalTrainer wrote: I have to either wear my sleeve, wrap or wear my Tribute night sleeve 24/7.  I can go an hour or so in the winter only without the sleeve, but that's it.  My arm begins to tingle and my shoulder hurts if I go any longer.  It's been two years and the LE is worsening - just a little bit - but it is worse.   I'm always hopeful things will improve - but in the meantime, I try to be accepting of what is. By the way - I was stage 1 and only lost 1 lymph node.",
      "MessageIndex": 25,
      "PostDate": "06/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/818401",
      "Title": "How often do you wear your sleeve/gauntlet? Amoc1973 JWoo"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Dec 2, 2012 10:45AM PersonalTrainer wrote: Sure - send them over when you have a rough draft.  I think it's a great idea and I'd be happy to help",
      "MessageIndex": 9,
      "PostDate": "02/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797036",
      "Title": "What Do You Want Fitness Instructors/Personal Trainers to Know? NatsFan LuvLulu07"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Mar 13, 2014 02:20AM PersonalTrainer wrote: I'm curious - I haven't heard of bike shorts being recommended before by anyone.  Did your therapist say why? But actually - I wear compression shorts pretty much everyday and often for most of the day just because of my job.  I have for years actually.  So, no they haven't helped my lymphedema.  I actually have pain and had some fibrosis in the lymph channels on my lower rib - so, definitely no help from the shorts. ",
      "MessageIndex": 32,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/818401",
      "Title": "How often do you wear your sleeve/gauntlet? Amoc1973 JWoo"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Nov 12, 2013 07:35PM PersonalTrainer wrote: My claim for sleeves was at first denied by Aetna as not being medically necessary. This after being told my many representatives at Aetna that they were covered and there was no problem. The DME company had even called twice to check benefits. It took them months of holding the claim - but they denied both my sleeves and my night sleeve. This after approving a FlexiTouch for me in three days. Anyway - I never could get a good answer as to why they were denied. I do know they asked for clinical notes from my OT. Swelling in my arm has never been my primary problem - my arm will swell, but it's not that big - and when it gets treatment, it's small. It's my shoulder and side that are the issue. I ended up appealing. I sent them a letter - long - detailing my problems with lymphedema, several studies, and a letter of medical necessity from my oncologist. It your doctor has seen you for lymphedema in the past, a call to his/her office should be enough to get a letter for you. I did win. One thing I learned: I no longer deal with the insurance company over the phone. I only ask questions in the form of e-mails through their website. Make sure you get the letter and then if they deny you, appeal. It's wrong - they know it, but they want you to give up and not get treatment.",
      "MessageIndex": 6,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/814413",
      "Title": "Insurance coverage for class 1 (20- 30 mm Hg) compression? KS1 carol57"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Nov 5, 2013 10:38PM PersonalTrainer wrote: Thank you all - I do feel so much better knowing that others have these issues too. Not that I'm happy anyone else has this! But yes - I just can't see how my shoulder mobility issue isn't LE related. My shoulder was broken all those years ago and has never been right - they just couldn't do anything with it to make it totally better - but it really hasn't bothered me much in the last 20 years. That's why I wasn't really worried about the node surgery at all. There really is no other explanation as to why I have so much lost mobility other than the LE. I just don't have much swelling in my arm - it's mostly in the top of the arm and my side if I wear the wrong garment. Thank you Kira for pointing out that you can have an arm be smaller and still have LE. I treat it - so it stays small. That's what I was told to do. That lymph is damaging - so not treating it wasn't smart. So, I've worn the compression and done everything else I was told to do - including the low-salt diet. When I treat it - mostly it's fine and feels good. But not always - and that's the reason I was back in therapy. Because the not feeling good times had become more frequent - despite my doing everything I knew to do. By the way - the therapy is helping. The MLD and the work on my shoulder have made everything feel much better. I think I'm going to have to find someone to go to every so often for MLD and shoulder work - my insurance will only cover this so many times - but it seems to be something I need in addition to the machine. And working on my shoulder isn't something I can do myself.",
      "MessageIndex": 9,
      "PostDate": "05/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/813861",
      "Title": "shoulder mobility PersonalTrainer PersonalTrainer"
    },
    {
      "AuthorID": "PersonalTra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159007/profile",
      "Content": "Dec 1, 2012 03:03PM PersonalTrainer wrote: I'd be happy to help.  I'm both a personal trainer and an exercise instructor.  I teach many types of classes.  Actually - reading this thread, I was thinking a fact sheet on LE would be nice to have to give to my class participants - I spend a lot of time explaining my sleeve and glove every day!  Just this morning in between classes I spend a good five minutes I really didn't have (time is tight between classes) explaining the lymphatic system.  When it's so obvious you're wearing a sleeve - teaching about LE becomes part of the job. First - I wouldn't put \"don't single out the participant\" on the sheet.  You don't want the instructor to be intimidated into not giving you correction during class.  A professional instructor should know how to properly correct your form subtily - without making you feel like a dunce.  Many people who take my classes have a injuries or issues where they can't do some of the moves - it's a bad instructor who would insist on them doing something they aren't supposed to.  We do appriciate when people let us know ahead of time the issues they have - that way we won't try and get you to do something you've told us you can't.  I also make alternative sugestions for people on moves I'm going to do in class when they come to me and tell me they can't do something ahead of time. One of the things I generally say when I'm making my introductions at the beginning of a class is \"Please modify the class as you need to.\"  That said - you can't always expect us to be able to give you individual instuctions all the time.  Things like taking an extra water break to stay hydrated - you just need to do that on your own.  We can't slow the pace of the class to take a long time demonstrating an alternative exercise for you - or by calling extra water breaks.  But a good instructor will understand and not make an issue when you're doing something slightly different from the class - and we often can give you a different exercise - just not always as we're teaching a lot of people.  For example, I have a woman who has Erb palsy who takes my bootcamp class.  When we're doing something overhead - I'll often catch her eye and quickly demonstrate a rep of an alternative for her.  But you have to remember that classes aren't personal training. With LE being such an individual thing - I might focus the fact sheet on what LE is and some general things you might not be able to do, like putting weight on an arm, or using bands.  I'm fortunate - or I'd be out of a job - that my arm likes when I lift heavy weights and do things like pushups or planks.  That said - as an instrutor I have to demonstrate perfect form so, while I do lift heavy, I don't lift so much that I'm over my limit to finish the last rep.  As a personal trainer - when I agree to take on a client with health issues or an injury - I make it my business to learn what to do and not do for that person before I make a program for them.  For example, I had a client with MS who had real problems with heat - I found a spot in our building to work with her that was well air-conditioned and we only scheduled sessions for times that room was avalible.  I've had many clients with issues - in fact most of my clients have something wrong with them  - but as part of our certifications, we know never to take on any client who has issues beyond our scope of practice.  It would be helpful to get a fact sheet from potential clients if they have an issue.  Just because a personal trainer has never worked with someone with LE (or whatever issue) doesn't mean they can't - what they need to be is willing to listen to you and willing to do the research to learn what exercises will help you and what will hurt you.  I wouldn't hire any personal trainer who isn't interested in listening and learning. ",
      "MessageIndex": 6,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797036",
      "Title": "What Do You Want Fitness Instructors/Personal Trainers to Know? NatsFan LuvLulu07"
    }
  ]
}