{
  "AuthorID": "pesky904",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284915/profile",
  "Posts": [
    {
      "AuthorID": "pesky904",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284915/profile",
      "Content": "Feb 19, 2019 12:39AM pesky904 wrote: Any stage 3 large tumors that were triple negative? Mine was 6 cm at diagnosis June 2017. Grew to 10 cm by August 2017 on Taxol. I finished treatment at the end of November 2018. Had a positive bone scan just last Wednesday and am waiting to have an MRI.",
      "MessageIndex": 50,
      "PostDate": "19/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "pesky904",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284915/profile",
      "Content": "Feb 21, 2019 12:31AM pesky904 wrote: Kkmay, sorry to hear about your mother. I had a very similar treatment plan and did pretty well with it. Stage III, triple negative, with a tumor just under 7cm. I started with a plan of 12 Taxol and 4 AC. After 7 cycles of Taxol, we discovered my tumor had grown to over 10cm. So they immediately stopped Taxol and started the 4 AC. I saw the tumor shrink really fast on AC. After 4 cycles, it had shrunk to about 3cm and they were able to get clear margins (although under 1mm) at my mastectomy. ",
      "MessageIndex": 56,
      "PostDate": "21/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "pesky904",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284915/profile",
      "Content": "pesky904 wrote: Just wondering if anyone can tell me about issues with remaining breast tissue after a mastectomy. My understanding is that the surgeon tries to take everything but a tiny bit of breast tissue will still remain. How much should theoretically be left behind? In my non-cancer side, my reconstructed breast feels great, like all that's in there is muscle, implant and then skin. There doesn't even feel like there's anything left in there that could turn into a lump. On my cancer side, it's lumpy as all heck - a lump right where my original cancer was and lumps in the lower corner of my armpit. My question is, if the mastectomy took almost every bit of breast tissue, where are all these lumps coming from? And what are they made out of? I can see having a little scar tissue near the actual mastectomy scar, but I don't have any problems there at all. There shouldn't be any fat or breast tissue in most of the breast and what little there is should be negligible, right? So if all there is in the breast is an implant placed over muscle, what the heck are the lumps formed from? ​dx 6/17 stage III TNBC 6cm tumor Taxol 7-8/17 tumor grew to 10cm AC 9-10/17 tumor shrunk to 3cm DMX 11/17 expanders placed Rads 33 doses + cisplatin 1/18 Cisplatin discontinued due to SEs Xeloda 4-10/2018 Exch surgery 11/18 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869569",
      "Title": "Tissue remaining after double mastectomy pesky904 pesky904"
    }
  ]
}