{
  "AuthorID": "phgraham",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
  "Posts": [
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 10, 2011 01:37PM phgraham wrote: Thanks Tappy,  I will definitely be glad to be rid of this infection.  It hung on through the first round of antibiotics and feels like it's been dragging me down for weeks.  Hopefully this does the trick! Phyllis",
      "MessageIndex": 15,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 10, 2011 09:50AM - edited Dec 10, 2011 09:51AM by phgraham My family doctor just prescribed 750 mg of Levaquin for a lingering sinus infection.  I agree that when you read the warnings it can scare you silly!  Especially the part about not taking it with corticosteroids like Prednisone because of the risk of tendon injury.  Don't most of us get Prednisone with our chemo?  Thanks for your posts on this.  I feel a little better about it but may call the pharmacist later this morning.  If it's not one thing it's 30 others! Phyllis",
      "MessageIndex": 13,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 10, 2011 03:32PM phgraham wrote: AA -  Thanks for the link.  I had a very informative talk with the pharmacist and will proceed with the levaquin while being very watchful.  Thanks!  Phyllis",
      "MessageIndex": 17,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Apr 12, 2014 05:19PM phgraham wrote: repost of a members response to another re:scans and why they choose to do them and not do them I thought it was very good, better than what lots of docs give as an answer. Hope it helps :) sassy Apr 10, 2014 02:36PM ziggypop wrote: Hi all, Hi Ho - I'm really sorry about your friend, it is so particularly hard when someone is young. I'm going to chime in on the scans question because it's one that I had for awhile too (at this point I'm like Cami - I told my doc I really don't want to see any docs at all for anything for at least 2 months, he said okay just get your mammo so I did and I have a callback - he wrote me and said please just do this one more thing and I will leave you alone). Anyway here's what I understand to be the case or have been told to be the case & it could be wrong. As far as getting a PET scan at the 'beginning' - they will do one if there is a significant risk that the cancer has metastasized beyond the local area. And they do this because it will change the treatment protocolif there are distal mets. This is the basic reason for tests of any kind - to determine what treatment you should or should not have. By far the single most predictive factor for Mets in distant locals is lymph node involvement. Fluid from the breast drains into the auxiliary nodes, so if the cancer has lodged in the node it means both that it has traveled and that it has the capacity to live in different environments. If it's not in the nodes, then the risk that it is in distal areas of the body is relatively low. So the 'standard' for pretreatment testing is the degree of lymph node involvement, there may be some other instances when a PET is done - ie. the tumor is close to the chest wall, but otherwise the increased radiation is not considered to be warranted. Exposure to radiation is a serious thing - particularly for a cancer patient because radiation has a cumlative effect and a cancer patient is likely to undergo (over a period of time) more tests that will expose him or her to more radiation than the normal person. The type of scans that one would need to determine location & metabolic activity (what you need if you're looking for mets) are PET/CT & you're talking a lot of radiation with there - a chest CT normally has the same amount of radiation as over a hundred chest X-rays. As to having regular scans following treatment - the 'standard' is not to to do scans unless there are symptoms that suggest mets have occurred. The first reason is to limit exposure to radiation - imagine your doc telling you that he wanted to expose you to the radiation of one hundred X rays every year for the rest of your life - we're not talking Chernobyl - but that's pretty significant. Think about what RADs does to your breast tissue & how changes can occur years after. The second reason given is that it is very very rare that finding mets 'early' has a great deal of benefit. The benefit of detecting BC early is that if BC is contained to the breast, it won't kill you - because your individual breasts are not necessary for your survival. That is why surgery is the primary treatment for BC that has not spread beyond the nodes. This surgery can in fact 'cure' you (you don't know whether you have been cured or not, but there is a good chance that ALL of the cancer can be removed from your body if it has been found before spreading elsewhere). Other treatments (RADS, Chemo, AIs, SERMS) are basically prophylactic in nature - they are done to treat cancer cells that may or may not even be there. When BC metastasized to distal locations, it tends to lodge in a lot of places (although they may not show up on a scan because they are too small). So surgery is generally not the primary treatment. The primary treatment is some combo of those prophylactic treatments & the thing is that the cancer cells eventually find a way around these treatments - so the treatments have a limited time span of effectiveness regardless of when you start them. If you use up the arsenal of treatments earlier all that has really happened is that you've used it up earlier (that's how the argument goes anyway).  ",
      "MessageIndex": 210,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 5, 2011 02:27AM - edited Dec 5, 2011 02:27AM by phgraham Thanks Beesie.",
      "MessageIndex": 18,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 4, 2011 01:39PM phgraham wrote: mrsnjband - We tried all sorts of positions, even upside down.  I wish they had worked!  The surgeon's nurse said the he would try to reposition the catheter and if he couldn't he might move the whole port from the left side to the right side.  I'm glad yours is working and hope mine will too!  Thanks for your message.",
      "MessageIndex": 6,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778950",
      "Title": "Port Options phgraham buttercupwithab"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 4, 2011 09:35AM phgraham wrote: buttercupwithab and shellyj43 - Thank you both for your thoughts.  I suppose I'm just anxious about the whole thing.  This is the first time in my life that I've ever been ill and I'm probably being a big baby!   The thought of the surgeon going back in to the same place and redoing the implant sort of flipped me out.  However, buttercup, if you've had 3 ports, surely I can get this one fixed! shellyj43, when the surgeon implanted the port the first time, it took longer than usual because I had \"an anatomical anomaly\".  My vein had a kink in a funny place.  Maybe repositioning it again will help. Thank you again.  I'll try to stop obsessing over this and go find the shaver to take off the rest of my hair.  That will be much more constructive!",
      "MessageIndex": 3,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778950",
      "Title": "Port Options phgraham buttercupwithab"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 5, 2011 02:11AM phgraham wrote:",
      "MessageIndex": 7,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778950",
      "Title": "Port Options phgraham buttercupwithab"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 6, 2011 10:56AM phgraham wrote: fredntan - Thanks for the info.  If this doesn't work, I will pursue your suggestions!",
      "MessageIndex": 12,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778950",
      "Title": "Port Options phgraham buttercupwithab"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 5, 2011 01:56AM - edited Dec 5, 2011 03:01AM by phgraham",
      "MessageIndex": 16,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 4, 2011 01:26PM - edited Dec 5, 2011 03:02AM by phgraham",
      "MessageIndex": 8,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 5, 2011 01:47AM - edited Dec 5, 2011 03:01AM by phgraham",
      "MessageIndex": 15,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 6, 2011 10:36PM phgraham wrote: LaLa - Wonderful! I am glad for you!  Please keep us posted on the results of the cyst.  I hope you can breathe a little easier now that you have an initial result.",
      "MessageIndex": 34,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Jul 17, 2012 11:29AM phgraham wrote: I have my first rads treatment this afternoon. One of my marks is red with a line of blue dots on either side of it...3/4 of the way across my chest. It's pretty interesting! After my treatment I have my first class in the relaxation study that I'm in. Too bad that it probably won't include refreshing adult beverages. Phyllis",
      "MessageIndex": 193,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789322",
      "Title": "Summer 2012 RADS HANG OUT Stacie rgina"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "phgraham wrote: I had a Bard Power Port implanted after my second chemo treatment.  I just finished my fourth treatment and have not been able to use the port because we have been unable to get a blood draw from it.  I go back next week to have the surgeon see if he can adjust the catheter so that it does not sit on the vein wall. Not a pleasant thought! Are there other and possibly better options for a port?  Should I be shopping for a different brand?  Thanks for any help you can give. Phyllis - \"Be yourself, everyone else is already taken.\" Oscar Wilde...........Mets to sternum ....Radiation Clinical Trial: Aggressive Local Therapy for Limited Bone-only Metastasis to Improve Progression-Free Survival in Breast Cancer Patients Surgery 9/26/2011 Lumpectomy: Right Dx 10/3/2011, IDC, 3cm, Stage IIA, Grade 3, 0/1 nodes, ER-/PR-, HER2- Chemotherapy 11/8/2011 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Fluorouracil (5-fluorouracil, 5-FU, Adrucil), Taxol (paclitaxel) Surgery 5/18/2012 Lumpectomy: Right Radiation Therapy 7/17/2012 Breast, Lymph nodes Dx 3/6/2013, IDC, <1cm, Stage IIA, Grade 3, 1/40 nodes, ER-/PR-, HER2- Surgery 3/19/2013 Lymph node removal: Right, Underarm/Axillary; Mastectomy: Right Chemotherapy 4/22/2013 Ixempra (ixabepilone), Xeloda (capecitabine) Dx 7/7/2014, IDC, Stage IV, Grade 3, mets, ER-/PR-, HER2- Chemotherapy 8/7/2014 Carboplatin (Paraplatin), Gemzar (gemcitabine) Radiation Therapy 1/26/2015 External: Bone Dx 5/3/2016, IDC, Right, <1cm, Stage IV, metastasized to bone/other, Grade 3, 1/1 nodes, PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778950",
      "Title": "Port Options phgraham buttercupwithab"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 6, 2011 10:13AM phgraham wrote: I went today to get the port \"reassessed\".  The surgeon was able to keep it on the left side but replaced the components.  My surgery was delayed due to other surgeries so instead of the port replacement, MO appt and chemo, I was only able to do the port replacement.  I go tomorrow for the MO appt and chemo.  Cross your fingers that this time everything works!",
      "MessageIndex": 9,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778950",
      "Title": "Port Options phgraham buttercupwithab"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Apr 9, 2013 04:42AM phgraham wrote: Hi everyone.  I've been reading this thread for a few weeks.  I am not stage IV, but have been diagnosed with a recurrence within 5 months of finishing treatment.  My MO has recommended a combination of Xeloda and Ixempra to treat it.  He said that he wants to treat it as metastatic, even though right now I am not considered metastatic, due to the quickness of the recurrence. From what he said and what I have read, this combination has been proven to gain a few months before a new recurrence.  If that was \"several years\" instead of \"a few months\" I would probably feel a little better about trying this first.    My question is this:  Do any of you ladies have experience with this combination?  If you just read the fact sheets, it's scary.  The list of SEs is a mile long.  I know my chances of having all of the SEs is very small, but T/FAC kicked my behind and I want to work at least part time during chemo.  Is that possible? Thank you for any input. Phyllis",
      "MessageIndex": 1279,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Apr 10, 2013 05:36AM phgraham wrote: Moiralf and Chickadee, Thanks so much for the information!  I went to both threads and read thru them, but I'm sure I will refer to them often.  The Xeloda list of things you need is great! Chickadee - It sounds like your first week was just horrible!  I'm so glad that your second round went much more smoothly.  I will have a 3 week schedule also.  Ixempra will be given at 40 mg/m2 IV every 3 weeks and Xeloda at 1000 mgm2 PO 2x a day 2 weeks on and 1 week off.  So I may be getting a slightly higher dose of Xeloda, but that's from my notes and not the prescription itself.  I will double-check it when it arrives. I don't really feel like I'm in great condition to start this, since I just finished rads at the end of August, but I guess that's the card that I drew. Will you need neulasta or Neupogen?  My MO warned that I may need that again.  It was definitely not my favorite thing with FAC.  The IV Benadryl is my favorite thing!  I will need to find a painkiller that does not cause hallucinations, low blood pressure, migraine headaches or barfing.  That covers codeine, Vicodin and tramadol for me.   I guess we will have to assess that at the next appt. I finally got the pharmacy that the MO uses for Xeloda and my prescription plan, Medco/ExpressScripts talking to each other.  They resolved the $449 copay per cycle issue.  Medco will cover it if they fill the prescription. Chickadee, good luck and I will be following your posts. Thank you both. Phyllis",
      "MessageIndex": 1284,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Apr 26, 2013 10:23AM phgraham wrote: chickadee and deyla - Just reporting in.  I started Xeloda/Ixempra on Tuesday.  Today I have mild headache, mild nausea, abdominal pain and cramps, muscle pain, joint pain.  It hurts to sit or lie down. Last night I took an oxycodone and it didn't resolve the pain and I also had sweats and shakes.  Fun stuff!  Hopefully only a few more days of this. Phyllis",
      "MessageIndex": 1349,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Dec 7, 2011 02:09PM phgraham wrote: I just want to report that it worked!!  I am so relieved!",
      "MessageIndex": 13,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778950",
      "Title": "Port Options phgraham buttercupwithab"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Apr 10, 2013 09:46AM phgraham wrote: Gorgeous photo! You have a great smile! Phyllis",
      "MessageIndex": 609,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Aug 26, 2016 05:20PM phgraham wrote: Hi ladies, I'm just popping in to say introduce myself. I've read this thread off and on but never posted. You've all posted some good information. Thank you! Right now I'm not on any treatments although I may have surgery in October. Phyllis",
      "MessageIndex": 1735,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Feb 7, 2012 08:29PM phgraham wrote: Ysa, MDA has those forms on-line also.  I just printed them, filled them out and took them with me.",
      "MessageIndex": 25,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782305",
      "Title": "Anxiety venting and MD Anderson question Ysa Ysa"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Aug 29, 2016 05:39PM phgraham wrote: Hi everyone. Welcome satti! Texasrose, they will be doing a a sternectomy. They think they may need to remove only half of my sternum though. They will also remove the abdominal node. Just as an aside, I used to visit my mom when she lived in Glen Rose (years ago). I liked it there. Phyllis",
      "MessageIndex": 1744,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Feb 7, 2012 06:37PM phgraham wrote: Ysa, You should not feel bad about being a pest!  I had almost the same experience with the callbacks from the PSA.  Just know that they WILL get you scheduled.   I think you'll be glad that you chose them. I'll send you a PM with more info.  Minimacsmom will have good info too. Deep breaths and whatever anti-anxiety meds you need.  Venting here is the best place!  The quote in your signature is very astute for our situations! Phyllis",
      "MessageIndex": 10,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782305",
      "Title": "Anxiety venting and MD Anderson question Ysa Ysa"
    },
    {
      "AuthorID": "phgraham",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140440/profile",
      "Content": "Feb 7, 2012 08:13PM phgraham wrote: Ysa, don't forget to check on tax deductions for travel that insurance won't pay. I plan to also check out Rotary House for my surgery stay.  Rotary House is nice because it opens onto the  MDA concourse .  MDA has the nifty airport carts that pick you up and drop you off at Mays and points along the way, including Rotary House.  If Rotary House does not have anything available there are lots of other hotels that have shuttles to and from the Med Center.   My sister and I stayed at the Holiday Inn at Reliant Park for my initial appointments.  No kitchenette, though.",
      "MessageIndex": 18,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782305",
      "Title": "Anxiety venting and MD Anderson question Ysa Ysa"
    }
  ]
}