{
  "AuthorID": "Phoebegal",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234617/profile",
  "Posts": [
    {
      "AuthorID": "Phoebegal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234617/profile",
      "Content": "Aug 8, 2016 08:15PM Phoebegal wrote: Thank you so much for your information and encouragement!!",
      "MessageIndex": 6,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846720",
      "Title": "Iron Infusion and Procrit--what to do?? Phoebegal Phoebegal"
    },
    {
      "AuthorID": "Phoebegal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234617/profile",
      "Content": "Phoebegal wrote: Ladies: Hoping that someone has had a similar experience that can shed some light on what choices I will make. I am anemic (moderate) but enough to cause most of the symptoms of severe anemia. Breathing problems, fatigue (can't even walk across the room) etc. and it is affecting my quality of life to an extent that I am questioning whether I can go on. I was on femara and Ibrance but that stopped working after a year (the Ibrance was the culprit for the anemia) I began to feel much better after being off the Ibrance. Then I tried faslodex which did not work at all. I am now on Afinitor and Exemestane and the fatigue grows worse by the day. My onc wants me to have iron infusions and Procrit. The side effects are frightening and I am not sure what to do. I will have to have iron infusions before my insurance will cover the Procrit (which will then be more effective). However, I have read that the Procrit increases tumor growth and decreases life expectancy. My former onc was vehemently against it for that reason. However, I left her because she would not address quality of life issues and could not recognize progression. It is possible that iron infusions without Procrit might address the anemia symptoms but those side effects are frightening too. I plan to talk to my onc this week about the whole issue. Has anyone had any similar experiences? Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846720",
      "Title": "Iron Infusion and Procrit--what to do?? Phoebegal Phoebegal"
    },
    {
      "AuthorID": "Phoebegal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234617/profile",
      "Content": "Aug 8, 2016 07:25PM - edited Aug 8, 2016 07:29PM by Phoebegal pwilmarth: My onc wants to use the Procrit to treat the anemia (seems like that is not what should be done). I am also on hormone treatment as well as an oral chemo. That is my concern. Seems as though this contradicts what I have learned. I do not think that I will take the procrit, although the iron infusion is still on the table. Assuming of course, that the anemia is from the meds. It is really hard to know who to trust. My onc is also a hematologist. You would think that he would know this.",
      "MessageIndex": 4,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846720",
      "Title": "Iron Infusion and Procrit--what to do?? Phoebegal Phoebegal"
    }
  ]
}