{
  "AuthorID": "phoebe007",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195799/profile",
  "Posts": [
    {
      "AuthorID": "phoebe007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195799/profile",
      "Content": "Feb 16, 2014 12:42PM phoebe007 wrote: \"Journey\",  My Dad gave me a small plaque. I'd like to share with you. Journey \"For I know the plans I have for you; declares the Lord's, \"plans to Prosper you and not to harm you, plans to give Hope and a Future. Journey can be however You choose to see it. I choose to stay strong and Not accept what I've been dealt;  but instead I choose to Prosper and enjoy my Future!  Thanks for letting me share.",
      "MessageIndex": 4,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818107",
      "Title": "MBC is Not a \"Journey\" Bestbird cliff"
    },
    {
      "AuthorID": "phoebe007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195799/profile",
      "Content": "Feb 15, 2014 12:23PM phoebe007 wrote: Hi, I'm sorry about your mom, but I have the Exact same diagnosis, bone mets to hips, spine, neck, right shoulder, and my cancer was also diagnosed in 2005. Her treatment isn't enough! Please check into interventional radiology or chemoembolization. These are minor outpatient procedures with Huge Amazing, Pain Free results. They can kill tumors in bone with heat and fill weakens areas with cement for strength. 3 states are now doing this STAR procedure. My oncologist is amazing. If your calcium pills contain calcium carbonate(eggshells), that is bad and the calcium seeping into her bloodstream will make her sick. I went through that as well. There is a new chemo drug available in July which is aimed toward mets. Please look into these pain treatments for now.",
      "MessageIndex": 24,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816357",
      "Title": "Bone and lung metastas, Help please shaM Lynne"
    },
    {
      "AuthorID": "phoebe007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195799/profile",
      "Content": "Feb 15, 2014 12:34PM phoebe007 wrote: Omg, please have your oncologist do the calcium lab draw. Her symptoms are what I had, extremely tired, weak, trouble breathing, sweats, chills, no appetite, etc. Drink lots of water, calcium will also cause her liver and kidneys to flare up. Please check into this",
      "MessageIndex": 25,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816357",
      "Title": "Bone and lung metastas, Help please shaM Lynne"
    }
  ]
}