{
  "AuthorID": "photobug",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
  "Posts": [
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "May 29, 2010 02:51PM photobug wrote: I just finished my 7th round of chemo out of 8 - I agree with the ladies above - drink plenty of water before you go - it helps!  Also, ask for a tour of the infusion center when you go the first time, before they hook you up.  Between all the water you drink and the saline they give you, it's handy to know where the bathrooms are.  In my infusion center, anyway, they have pretty comfy reclining chairs for the chemo patients.  They also have heated blankets on request.  I do often find that I'm chilly while I'm there, so I take advantage of it.  As for the ride, I have a 2 hour ride to get to treatments, so I feel for you there.  I always bring a bucket in the car for the ride home.  Haven't needed it yet, but it's been close a couple times and I was glad I had it just in case.  I don't like ginger, but I found that peppermint worked pretty well for me on the ride home for settling my stomach a little and getting that chemical taste out of my mouth for a little while.  Wear comfy clothes - it makes a difference.  Hope this helps!",
      "MessageIndex": 5,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753259",
      "Title": "So new to this! Jennypoo photobug"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "photobug wrote: I'm putting together my lists of what to bring, etc. and I've been noticing a lot of people saying they brough such and such, but didn't have the energy to use it.  So that got me wondering about how much energy I'd have for visitors.  I know that my mom is planning on coming, and my husband of course, but I've also had other family members mention that they might make the trip to come see me in the hospital.  My question is, did you have a lot of visitors and was it a good experience, or did it tire you out - or make you feel like you had to be entertaining, etc?  Was it a good distraction?  Just curious...  should I encourage visits, or encourage people to hold off for a while? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754060",
      "Title": "While in the Hospital photobug Diane509"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jun 14, 2010 04:11PM photobug wrote: Well, it sounds like I should probably let folks know that I would love to see them or hear from them after I'm home, but probably won't be up for company in the hospital.  I'm not the biggest social butterfly anyway, so I think it sounds like having anyone but my husband and my mom there will be kind of a strain.  But if they want to come, I'll just deal with it and not feel guilty for spacing out.",
      "MessageIndex": 12,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754060",
      "Title": "While in the Hospital photobug Diane509"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "photobug wrote: Hi - I was just wondering how many times you met with your surgeon and/or plastic surgeon before surgery?  I met with both of them a while ago, before a date was set.  I recall both of them saying they'd see me again before the surgery, but I haven't heard a peep from either of their offices.  Do you think they just meant they'd see me before the surgery, the day of?  I've read in some threads about people getting fitted for surgical bras/camis before the surgery - is that common?  I will give their offices a call, of course, but I'm wondering what questions to ask!  Thanks in advance. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753989",
      "Title": "How many times did you see your surgeon/PS before surgery? photobug photobug"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jun 12, 2010 05:05PM photobug wrote: Thanks for all the replies.  I am getting a unilateral mastectomy - I talked with my oncologist at my last appointment and he agreed I should see the BS again before the day of the surgery - he is having his office coordinate a meeting hopefully while I'm there for my regular appointment.  I have a 2 hour drive each way to get there, so it'd be nice to be able to do them at the same time.  I called the PS office and told his nurse I felt like I had a lot more questions - expecting her to try to answer them over the phone, but she pretty much cut me off and told me that if I have any questions at all, I should make an appointment and come in and see the PS so we are sure to be on the same page as far as what I want, and what to expect.  Hopefully I'll remember everything I want to ask.  I'm off to some of the other forums to gather info and make a list! Interesting how many different options there are and how different everyone's after-care seems to be.  Thanks for sharing! ",
      "MessageIndex": 10,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753989",
      "Title": "How many times did you see your surgeon/PS before surgery? photobug photobug"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jun 13, 2010 04:51PM photobug wrote: Hi - I'm having a right side complete mx with immediate lat flap reconstruction.  I'm not sure of a lot of the details, still have meetings to go with both my BS and PS shortly.  I have primary angiosarcoma, so they will more than likely not spare any skin and will likely have to do a skin graft.  I'm planning on finding out more about that soon.  I'm scheduled for July 6 - not sure if it's a good thing or not the be the first patient after a long holiday weekend.  I guess I'll find out!",
      "MessageIndex": 1,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jul 13, 2010 11:04AM photobug wrote: Back online for a little bit.  I had a bit of a change of plans - I had the Right side mastectomy as planned, but not the lat flap recon.  The PS came in literally 10 minutes before I was going into surgery and told me that since the BS thought he could conserve some of my skin, that we could do a TE instead and that he really thought that it was a better option and that I should change my plan.  Especially since the cancer will likely come back, and that way I will still have my back muscle for the next time, if I need it.  Uh...  Okay.  Not an option I had even looked into or researched at all because it was OUT of the question according to everyone up to 10 minutes before my surgery.  But that's what they ended up doing.  So now I have this alien thing in my body and no idea really what to expect.  I started reading over some of the threads here.  I have no idea what type of TE he put in or what size or projection or anything that he's planning on.  I feel like I have no control over my body anymore.   And I was expecting to be out of work for 6 to 8 weeks for the lat flap recovery, but to be finished at that point.  Now, I understand that with fills and exchange surgery and etc, I won't be done for 6 months to a year?   How am I supposed to arrange that with work?  How long do I stay out of work now?  What if they can't put me back on the schedule before 6 weeks?  That's all my sick time and vacation time, etc I had saved up.  Does anyone know how long your are typically out of work  with a uni-mx plus tissue expander? I'm so lost, and my followup appointment isn't until Thursday.   I feel like a jerk worrying about this stuff when so many other ladies on this board are going through so much more.  I am thinking about you all, and offering up prayers for peace and healing for all of us.",
      "MessageIndex": 231,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jul 4, 2010 10:49AM photobug wrote: Two more days until my surgery.  Getting very antsy.  Trying not to think about it too much.  I've got a cold that my husband brought home from work.  We both feel bleh - I hope it goes away before Tuesday or they may have to reschedule the surgery.  Part of me wants to put it off indefinitely, part of me just wants to get it over with.  I keep thinking things like, this is the last time I will ever get to wear this bra.  The last time I'll go here or there looking like me.  Next time I come here, I'll be different.  Forever.  Argghh!  I'm driving myself insane.  It's hard to have a \"great holiday weekend\" and to \"just forget about it and enjoy myself\" like everyone keeps telling me to do.  I'm trying - but it's hard.  Doesn't help that my mom broke down in tears at church this morning when someone asked her how she was doing.  Ack.  I feel like slime for making her and all the rest of my family go through this.  I know it's not my fault but I can't help but still feel like a complete jerk for ruining everyone else's year.    Ducki - so glad your surgery went well.  I'm amazed you're already posting online!  Thanks for coming and posting to let us know how you are. I wish everyone who is waiting for upcoming surgeries a little peace of mind over this holiday weekend and hope that you are able to enjoy yourselves a little.  I'm off to attempt it, myself.",
      "MessageIndex": 96,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jun 20, 2010 06:57AM photobug wrote: Hi Everyone - welcome to everyone who posted since I was last here. I have an appointment a week from Monday with my new onc. and my surgical onc. to talk about the procedure and what they expect will happen.  I want to be sure that we're all on the same page before I speak with the PS again.  It's getting awfully close!  I've just been pretty much numb at this point,and working a lot so I don't have a ton of time to think about it.  Tuesday is my next day off (and my bday!) so I can make some calls then. Happy Birthday to MaryH! ",
      "MessageIndex": 14,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jul 13, 2010 05:30PM photobug wrote: Thanks for the reassurances.  It's been a crazy time - I had already been told two seperate things about the surgery and then to get a third option at the last minute was dizzying.  I know that the doctor feels it's the best option because it does leave other options open for the future, and is less invasive in the meantime.  Thanks for the info abou the time out of work, etc.  I had everything arranaged for the other options, now I can start thinking about how to move things around for the new reality.  At least, I think, I can say I'm almost done.  Here's hoping the path report comes back with good news.  In the meantime, I'm feeling better just knowing all this positive energy is here and all you wonderful ladies are here making yourselves available to help everyone else out.  It's a wonderful support!",
      "MessageIndex": 236,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jun 16, 2010 06:59AM photobug wrote: Well.  I got a real wake up call, slap to the face moment yesterday.  Went in to talk to my PS with a list of questions about the reconstruction.  Got a couple questions in when he gave me THAT look.  That here-it-comes look.  And then I got the you realize that sarcoma of the breast is not exactly like \"regular\" breast cancer, right?  (This never precedes good news.)  So, the long and short of it is, while I went in expecting to talk about breast reconstruction, and getting me on my way back to normal.  The surgeons all this time thought I somehow just magically knew they meant CHEST WALL reconstruction and not breast reconstruction.  So, as he put it, our main goal is a disfigured chest with a closed wound.  Yep.  That's our GOAL.  Whoopee.  I just feel like I've been hit by a baseball bat.  I have an appoinment next week to see the breast surgeon.  I'm hoping he can explain it to me a little bit more.  The PS did backpedal a little when he saw how shocked I was and said he would talk to the BS and see what they could do, and if at all possible, he would try to reconstruct a \"little something\" there so at least it wouldn't be concave.  Gee.  Thanks.",
      "MessageIndex": 5,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "photobug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102651/profile",
      "Content": "Jul 14, 2010 10:52AM photobug wrote: I have my first follow up with the PS thursday so I will find out about time off, etc then.  I'm also going to find out what TE was used (size, etc.) so I will know what to expect from the fills.  I know he already mentioned that \"most\" women prefer to go smaller and that he expects to have to do some sugery on the natural breast to make them match.  I don't particularly want to go smaller, but I get from the Implants 101 thread (thanks for the links, btw, clarity04) that it seems to be the case, even if you try to get a \"D\" you end up looking smaller anyway, so I guess I'll hear what he says about that.  I'm trying not to think about it too much today.   Good luck MaryH and sunnydaze on your surgeries today - sending out healing thoughts your way.",
      "MessageIndex": 239,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    }
  ]
}