{
  "AuthorID": "PHXKAREN1957",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/190259/profile",
  "Posts": [{
    "AuthorID": "PHXKAREN1957",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/190259/profile",
    "Content": "PHXKAREN1957 wrote: Hi there-I'm new to this and I apologize if this has been addressed before, but I am having trouble navigating all the searches. After agonizing about even having a stereotatic biopsy for micro-calcifications in my right breast, and then being angry that no body would even consider doing one without leaving a marker in my breast, I just had one done on 10-27-2013. The biopsy shows atypical epithelia cells or something like that. (I haven't read the report yet, just got the phone call yesterday and have not talked to the breast surgeon I consulted.) That was all I heard when the radiologist called to tell me what they found, so I'm not sure what, if anything else, he said. My questions are: what can this mean? Is this a potential for cancer or just an overreaction of this doctor? What information is available through the forums on other's experiences with this? I have absolutely NO history in my family, maternal or paternal. Grandmothers lived until their 90's, and believe me, I know I am truly blessed. I have acquaintances who have been through all that goes with a breast cancer diagnosis. The women whose stories I've read here are amazing, courageous, and I respect your knowledge, thoughts, feelings and opinions. I thank you in advance for any information you can pass on to me. I'm not good on the computer, and I'm not good at deciphering most medical jargon, but if there are other places I can check on this, I would appreciate that too. Thank you so much. Karen (PHXKAREN1957) Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "19/10/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/813154",
    "Title": "biopsy result-atypical epithelia PHXKAREN1957 PHXKAREN1957"
  }]
}