{
  "AuthorID": "pickychicky…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
  "Posts": [
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 22, 2011 10:03AM pickychicky wrote: I'd definitely get both the Oncotype test and another opinion, if you can. My Oncotype DX score was 12 and my Dr. said probably no chemo for me. It may change as I had a UMX yesterday and they'll look at the pathology, but I'm hopeful. It seems like it is terribly hard on your body and you should be the one deciding if the risks outweigh the benefits.",
      "MessageIndex": 6,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/779885",
      "Title": "CHEMO??? theBCavenger theBCavenger"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 14, 2011 03:37AM pickychicky wrote: add me to the list please - UMX left side no reconstruction on Dec 21. I'm hoping it won't be a whole lot worse than the lumpectomy with 7cm removed last month. Good luck to everyone with surgeries this month!",
      "MessageIndex": 392,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 21, 2011 11:43PM pickychicky wrote: Hi Ladies  Thanks so much for keeping me in your thoughts today. Seems to have done wonders! I'm home and on my couch, which makes me so happy! Surgery was delayed by almost two hours, so I was super fearful it would put an end to my outpatient hopes - but it didn't. So - UMX started at 12:45, got in car to go home by 4:30. I've got Hydrocodone for pain and an anti-nausea med. (don't remember what it is and can't be bothered to walk into kitchen to get bottle LOL). We stopped on the way home for dinner because I was starving and I wound up with baked ziti and meatballs. Can you believe it? I ate some and feel fine. I'm going to go ahead and take the pain meds this time - I think I'll probably need them. One drain under left arm - already had to empty it once. Here's wishing good luck to all who had surgeries today and prayers and good wishes for those still to go.",
      "MessageIndex": 560,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 22, 2011 11:05PM pickychicky wrote:",
      "MessageIndex": 584,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 27, 2011 01:58PM pickychicky wrote: Wishing you well with your surgeries, evebarry, mybodymydecision and hawaiik. Had a nurse follow up today - staples are out, steri strips are on. I couldn't watch her remove them - it was too much. Didn't feel a thing, though.  I did have pain when she re-dressed the drain. Turns out we had inadvertantly gotten tape attached to a stitch last time and that was causing the pain issues when the tube was moved around. I felt terrible for DH as I couldn't help crying while she was messing with it and he felt so bad. All redone now and feels ok. Next follow up with BS on Friday and I've got my fingers crossed for the drain. I'm at about 40cc daily now, so hoping it is down to 30 by Friday... Hope everyone had a wonderful holiday!",
      "MessageIndex": 642,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 14, 2011 04:36PM pickychicky wrote: Thanks ladies! I've got a call in to my surgeon. I want to make sure he understands that I will not have reconstruction, so want the scar area as flat as possible. I think I'm also going to ask if he'll do it as outpatient surgery since I'm not having the lymph dissection. Can you think of anything else I need to clarify? Was there anything that you wish you'd cleared up?",
      "MessageIndex": 396,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 15, 2011 12:46AM pickychicky wrote: Kite great news - so glad to hear it! Terry71 Thanks so much for the info. Here's hoping mine is as easy as yours sounds like it was. Good luck to those with surgeries tomorrow. Prayers sent your way.",
      "MessageIndex": 409,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 16, 2011 11:19AM pickychicky wrote: Kayce234 and Kaara - congrats to both on your results. Hope everyone else waiting has good news too!  In good news for me, met with surgeon this am - he said outpatient is fine. He's going to do a 23 hour visit, so I will go to a bed, but he'll check on me mid afternoon and send me home. He also said only one drain, so yay.",
      "MessageIndex": 457,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 23, 2011 04:52PM pickychicky wrote: Hope everyone is doing well. Had my first post UMX visit today and was really anxious about looking down at my chest after the Dr removed the dressings. The tape removal hurt a whole lot, but thankfully he said everything looks perfect. I beg to differ as I have a huge row of staples across my chest and a tube hanging out of my side. I've got suture removal scheduled for Tuesday and a re-look at the drain for possible removal. How does that timeline sound? Less than a week for staples? Believe me, I'll be happy for them to be gone, but that seems fast to me. I was able to take a bath today (little water, no dressings got wet) and felt a million times better. For those celebrating this week, Merry Christmas and/or Happy Chanukah!",
      "MessageIndex": 602,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 30, 2011 11:33AM pickychicky wrote: Good news for me too today. Just got back from the MO with the pathology from my MX last week. No cancer in the breast was found. The BS must have gotten it all with the lumpectomy, although he didn't feel good about the margins. So - all clear - two additional nodes taken and clear. Since my Oncotype is a 12, no chemo! I'm also down to less than 30cc for two days, so looks like the drain will come out at my BS follow up appt this afternoon. Such excellent news for the New Year. Now, I've just got to get through radiation and I'll be done. Good luck to everyone still waiting for results and having surgery. Happy New Year!",
      "MessageIndex": 686,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "pickychicky…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140818/profile",
      "Content": "Dec 27, 2011 04:00PM pickychicky wrote:",
      "MessageIndex": 645,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    }
  ]
}