{
  "AuthorID": "pickles26",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93270/profile",
  "Posts": [{
    "AuthorID": "pickles26",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93270/profile",
    "Content": "pickles26 wrote: Hi all! This is my first post, so I'm sorry if I don't get it quite right. I've been doing a lot of research in medical journals (with the help of my 23-year-old medical student daughter), and I have some information that should be encouraging to everyone. The first thing we realized is that treatments have changed SO much in the last 10 years. All the data that predict 10-year survival are from patients who started their treatment more than a decade ago! My daughter tells me that the last 10 years have been the most crucial in breast cancer research. We can have SO much more hope now! The second thing we discovered is about what they call \"micrometastases\" to lymph nodes. They're defined as any mets that are between 0.2 and 2.0 mm. Guess what? They have NO prognostic significance! There's an article from 2009 that did a big study that determined that having a micromet is prognostically the same as having negative lymph nodes. Furthermore, there were even two studies that showed that having a micromet may even improve prognosis because of the immune response the cancer triggers by traveling to nodes I've been worrying a lot because I had one micrometastasis to one node (0.24 mm). Who knows, maybe it's no biggy! I've also been getting dose-dense chemo, which is every 2 weeks instead of the conventional 3-week intervals. This emerged in the last 10 years, too, and apparently it can increase disease-free survival by 27% in women with grade 3 cancer. Is anybody else getting dose-dense? Maybe I should start a thread on that.  <3 Pammy Dx 6/1/2009, IDC, 2cm, Stage IIB, Grade 3, 1/2 nodes, ER+, HER2+ Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "23/11/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/108/topics/744335",
    "Title": "Encouraging information!!! pickles26 Luah"
  }]
}