{
  "AuthorID": "PineHouse",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
  "Posts": [
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jun 2, 2009 04:20PM PineHouse wrote: Hi all, Sorry about leaving you hanging.  Just difficult transition over the last 2 weeks due to declining muscle functions, plus chemo (Cisplatin last Wed) wiped me out for 5 days (yes, that explained the abscence from computer). Prior to signing off last week I did get a peek of a couple of things with some of YOU that didn't sound good.  I hope that didn't continue.  But while I have this opportunity to be online, and I know you collectively pulled off a powerful prayers & healing energy (thanks jeanne,caryn, brenda,vicki,flalady,lori,lisa,janis,katie,darlene...undoubtedly I'm forgetting people...), BUT I'D LIKE TO TURN THE POWERFUL COLLECTIVE PRAYERS BACK TO YOU ALL WHO NEEDS IT. Special thoughts for Susan and Watson.",
      "MessageIndex": 7,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734839",
      "Title": "Heard from Pinehouse and Caryn Analemma heatherpalmerton"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 3, 2009 10:21AM PineHouse wrote: Irina, So sorry about the TM, and so sorry that you find out \"by chance\".  And certainly with the recent passing of your friend, nothing could have been worse. I have no doubt that there are many treatment options your doctor you use for your case.  So, yes, make sure that you get in touch with him.  And you can let him know too that you'd like him to be a little more proactive next time. BIG HUGS!!  Let us know what the next plan is.",
      "MessageIndex": 11,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731841",
      "Title": "I'm going down Irina Crystalady"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 29, 2009 07:54PM PineHouse wrote: Lori, I'm so sorry the mets are behaving badly.  What does your oncologist say about your liver enzyme going up?  My enzyme was slightly elevated too on Doxil+Cytoxan.  I hope it really doesn't mean that your regimen doesn't work and needs to be changed. What were you thinking about looking up in regards to liver mets?  Treatment options?  Liver enzymes?  Alternative options for liver function? Hope you get some answers soon. Warm thoughts and hugs for you... ",
      "MessageIndex": 8,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731526",
      "Title": "how do I look up info on mets to liver Fllorik Reneepals"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 8, 2009 06:41PM PineHouse wrote: Wow, I'm sad for this huge loss. I'm sending prayers for the family...",
      "MessageIndex": 13,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732120",
      "Title": "SloneDeb AusAla heatherpalmerton"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 7, 2009 04:33PM PineHouse wrote: Brenda, Sounds fishy.  Maybe that's their \"standard practice\" in your state.  Or my state too.  Gosh, I haven't kept track in 2007.  But I did put everything in a spreadsheet for 2008.  They'd better watch out.  I'll know by the end of tax season what I paid into my healthcare. I have had difficulties with insurance.  I had to fight Anthem Blue Cross for 2 regimens: Avastin+Taxol in Aug 2006 (reason: investigational/experimental) and Avastin+Ixempra in Apr 2008 (reason: Avastin must be given with Taxol only, so although I have been pre-approved for the Ixempra, they're not going to cover the Ixempra either). Now ex-employer (I'm on COBRA) just switched to Health Net.  I cringed at what I'm going to find out soon. I've had it with them!",
      "MessageIndex": 17,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728479",
      "Title": "Angry!!!! Insurance Issues Analemma Analemma"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 25, 2009 08:25PM PineHouse wrote: thisgirl, From your description, it sounds like your mom is only treated by an oncologist. For brain mets, a multi-modality treatment strategy is usually adopted.  This may involve Radiation Oncologist and Neuro Surgeon and/or others IN ADDITION TO an Oncologist. Renee and Analemma above mentioned whole brain radiation (done by a radiation oncologist), which can be done in conjunction to (but not simultaneous with) intrathecal Methotrexate and DepoCyt (done by an oncologist). Also, do you know why she only got one shot of DepoCyt?  Was it the side effects? Regarding the personality changes, you may mention that to the oncologist, see what he would recommend.  It sounds like your mom needs to see yet another specialist, like may be a neurologist.  Someone who can decide whether the changes are physical or psychological and maybe they have just the right solution. Hope things will get better. And soon. Hugs.",
      "MessageIndex": 9,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731216",
      "Title": "Mets to Lung, Liver, Bones, and Brain thisgirl80 Analemma"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 22, 2009 07:19AM PineHouse wrote: Kathy, Just a one HUGE BIG GIGANTIC HUG!  And lots of prayers. You'll get through WBR and be on your way to recovery!",
      "MessageIndex": 22,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731126",
      "Title": "Brain Mets for me kgrimm SunshineSmiles"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 16, 2007 09:52PM PineHouse wrote: Bimmer and all, I think there are 2 EXTREME ends to the healthcare system.  At one extreme is the free market \"customer always right\" (if you have the money you can buy the best treatments/drugs/services) and at the other extreme is the socialized medicine (everyone is treated the same, according to some published \"guideline\",  regardless of your ability to pay). I don't know which \"end\" seems to be more \"right\".  I grew up in a country where healthcare was a free market, you have money you get to go to a good hospital.  This system seemed to work there, since everything was afordable even if you're lower middle class.  However, you still can not be poor, since no one would take care of you. In the US today, I can see that the healthcare system is actually moving toward socialized medicine.  This is because as a nation, we believe it is to our best interest to take care of everyone regardless of their ability to pay.  However, learning from some friends who have been in a socialized medicine system, we all know that socialized medicine does not always work for everyone. So, if I have my say, here's the scenario that I would like to try: (1) Drug research will not be done by for-profit companies.  Yes, less incentive to come up with \"magic bullets\", but some research will be done. (2) Drugs will be priced according to the ingredients and efforts to produce them. (3) Do away with health insurance companies.  (4) Everyone gets a basic national healthcare.  Sort of Medicare for all.  Doctors and healthcare providers work for the system.  Patients generally can not directly sue for malpractice, bad doctors can only be \"punished\" by their own peers or by the healthcare system. (5) Those who want to purchase extra care, different kind of care, novel drugs, etc. should be able to in the free healthcare market, out of pocket.  Patients can sue for malpractice in the free market. (6) We also somehow need to solve the healthcare provider shortage, as I believe this is a huge problem.  Most doctors are always booked, and when you do see them they don't remember your case and they only spend 5 minutes in the room with you.  We have a shortage of all kinds of providers, not just doctors.  As a result, labor cost has shot up.  If you know anyone working as a skilled labor in the healthcare industry, they're usually overworked and rightfully so get paid big bucks (hence the villa in France). Well, just my 2 cents...",
      "MessageIndex": 9,
      "PostDate": "16/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697035",
      "Title": "Step up, speak up! Bimmer Felicia"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 20, 2008 08:31AM PineHouse wrote: Cal, I was just staring at your words \"I don't have a good feeling about this\" for a long time, and then got chills down my spine. I hate this constant fights, constant roller coaster.  I don't understand, if the pills work for your lungs, why don't they work for liver? Anyway, are you getting your PET results this morning? I'm still hoping for a different explanation for the liver activities, but if you do get kicked out of the trial, there may still be a way to get the drug out of trial.  I think it's best if you use it outside of trial anyway, because then you and your oncologist can be more flexible about adding a chemo agent to it. I also hope that DH is managing ok with all these that are happening.  Also, condolences for your family regarding aunt's passing. Take care, and cross fingers...",
      "MessageIndex": 19,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700213",
      "Title": "PARP Pill Clinical Trial - Scan Results Unclear CalGal zarowny9"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 7, 2009 09:55AM PineHouse wrote: Heather, Adding more prayers!!  I hope whatever concerned onc was a falso alarm!! Just the best thoughts for you! Hugs.",
      "MessageIndex": 36,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731955",
      "Title": "ONC CALLS ME AT WORK TODAY heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 9, 2009 07:33AM PineHouse wrote: Bonnie, So sorry of the progression news.  I know how it feels to be so sick & tired OF chemo (and sometimes sick & tired FROM chemo too), and hoping for a chemo break, but instead you're told to have even more chemo. I don't know whether it's possible for your case or not, but sometimes you can just take a week or two week break (from chemo) and it's enough to get you recharged and ready to take on the next chemo. As far as choiced of drugs, yes, LuAnn listed them above, you have plenty of amunition.  You will feel better once your oncologist has a treatment plan for you. Big hugs...",
      "MessageIndex": 5,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727034",
      "Title": "Gemzar failed BonnieVA luvtotravel"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 29, 2008 07:04PM PineHouse wrote: Robin, Miracles do happen, and more often than you would expect.  I'm praying for a miracle, sooner than later. Big hugs...",
      "MessageIndex": 11,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726511",
      "Title": "I don't plan on going down without a fight freeariesonline LuAnnH"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 30, 2009 08:04PM PineHouse wrote: Don't the MBCN people work out some discounted hotel rooms for the attendee? They did that last time for conference #2 in Houston.",
      "MessageIndex": 3,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728259",
      "Title": "MBCN conference in Boston Fitztwins konakat"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 28, 2009 10:00PM PineHouse wrote: Oh, now I want that anti-HIF1 therapy to happen asap!!!",
      "MessageIndex": 6,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729932",
      "Title": "Reason for Solid Tumor Growth Maryiz Member_of_the_Club"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 7, 2008 09:55AM PineHouse wrote: Liz, I am currently on Navelbine+Xeloda.  I must say that this is the easiest regimen I've been on, and I have sampled plenty over the last 11 years (AC, Taxol, CMF, Taxotere, Avastin, Carboplatin, PARP Inhibitor). But of course, more important than tolerable side effects is whether or not the drug will work.  I'm too new on this regimen, currently on cycle#2.  The next scan is not until early April.  But from other people's posts, this seems promising.  If your mom does get on this drug, hope it works well and eases the discomfort fast.",
      "MessageIndex": 6,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701705",
      "Title": "Navelbine??? liz35 liz35"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 2, 2008 07:22PM PineHouse wrote: I have had Carboplatin by itself, I have had Taxotere by itself, and I have had Doxil by itself. I feel Carboplatin is quite tolerable.  I had it for 9 cycles.  No neuropathy.  No nausea until cycle 7, starting a bit nauseated.  Platelets were ok, but either get low RBC or low HB because I had to get Aranesp.  I had to get Neulasta as well for low WBC. Taxotere to me was a harder drug, no comparison to Taxol.  Causes low WBC.  But that's not what's hard.  My biggest problem was water retention, had breathing problem, couldn't even walk one block without huffing & puffing.  Lasix (diuretic) didn't help.  Gained 15 lbs (must be water), but didn't lose it all for 2 months AFTER treatment ended. Good luck with your decision.",
      "MessageIndex": 2,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725354",
      "Title": "CARBOPLATIN IS TOUGH ON WHAT SIDE EFFECTS? lida TripleNeg"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 9, 2008 09:32PM PineHouse wrote: wats, agree: crappola. Mine didn't work either (I started one day earlier than you). If you're going to MDA, consider seeing dr. Vicente Valero.  He is quite familiar with triple negatives. Hey, how far is Katy from Houston?  My sister is in Austin, also had breast cancer (early stage) and is considering doing adjuvant therapy at MDA. For you, I think the triple combo you mentioned will do wonder.  Anything containing Carboplatin I think will be effective. Best wishes.",
      "MessageIndex": 34,
      "PostDate": "09/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703664",
      "Title": "Xeloda Crappola Watson Watson"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 7, 2008 10:00AM PineHouse wrote: Liz, ps. Has your mom been on a platinum drug?  You may want to inquire about Carboplatin, which is known to have good responses on triple negs.",
      "MessageIndex": 7,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701705",
      "Title": "Navelbine??? liz35 liz35"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Oct 20, 2007 05:32PM PineHouse wrote: Hi all, For those of you going into Xeloda or Fluororacil (5FU), my oncologist told me there's a blood test that could predict your response (NOT the tumor's response!) to Xeloda/5FU.  This means that you're going to know whether you're going to experience bad side effects or not.  This info can be used to adjust your dosage (other than your weight) or to explore different options. The lab that offers this test is Myriad, the same people that does genetic testing (brca1/2). http://www.myriadtests.com/hcp/theraguide_faqs.htm Joanne, I read your other posts.  You're quite an inspiration!  I'm cheering for you.  You are right, you're going the right direction.  Wish you the best. Wish everyone else the best also!",
      "MessageIndex": 12,
      "PostDate": "20/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693940",
      "Title": "CT/PET So Much Progression ccarter48818 ccarter48818"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Aug 25, 2008 08:56PM PineHouse wrote: Hi Kasey, I'm a believer of Carbo for triple negs! I had Carbo last year, tri-weekly cycles. Premeds same as Susan said above. Side effects mainly extreme fatigue for me.  Days #3,4,5 (after steroid wore off), I slept 12-15 hours a day.",
      "MessageIndex": 2,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720094",
      "Title": "Carboplatin Kasey SunshineSmiles"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 6, 2009 09:06PM - edited Jan 6, 2009 09:07PM by PineHouse Hi Kasey, Sorry you're getting a lot of problems with Doxil.  Definitely mention them all to onc, some of them he may be able to help. I still believe your Dex is causing the GI issues.  I did get that \"indigestion\" too on the first few cycles, usually started on day 5 and lasted about 2 weeks.  It was too uncomfortable & too long-lasting they had to put me on Protonix.  The NP told me it was the Dex, so we discontinued it.  Now I don't suffer that indigestion anymore and I was able to take myself off Protonix as well.  In fact, my side effects seem to be easier with each cycle. As far as mouth sores, they say to gargle salt water 3x a day.  I don't have too much problem with it, but I've been really careful on what I eat the first week.  Also watch the fluid intake may help a little bit. Fatigue, I do get too and I don't have a solution for it.  I get knocked out day 1 (after infusion), day 3 & 4.  Basically I don't schedule anything important on the first 4 or 5 days. I'm crossing fingers and wishing for a good scan! Hugs..",
      "MessageIndex": 21,
      "PostDate": "06/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 7, 2009 05:16PM PineHouse wrote: Stormy, re: your nausea.  I am getting Aloxi and Emend, and I don't have any nausea at all.  Maybe you can ask for stronger anti-nausea. I'm getting treated for lung mets.  I'm sure this drug is a catchall drug that's good for anything except for brain/cns. Those of you with heartburn/indigestion, please consider getting on Prilosec or Protonix or Nexium, any proton pump inhibitor OR ask to discontinue/reduce Dexamethosone.  Bear in mind that Dex is used to control nausea too, so if you're very concerned about nausea you probably want to keep the Dex. Joanie, don't count on me with a nice shiny flowing hair.  I'm bald since I'm taking Cytoxan along with Doxil.",
      "MessageIndex": 25,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 11, 2008 02:41PM PineHouse wrote:",
      "MessageIndex": 14,
      "PostDate": "11/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 12, 2008 05:12PM PineHouse wrote: Kasey, I did have dysphagia (difficulty swallowing & painful swallowing) during cycle 2.  It didn't happen like that anymore, but I occasionally do still have this \"lump\" feeling in the throat that's not painful.  A medical consultant did suggest that I take Peptobismol on the next cycle to prevent dysphagia.  I did that and didn't have the painful swallowing, but I don't know whether Pepto did it or not.  I discontinued Pepto because it caused constipation, and haven't had the painful swallowing anymore.  But still have the lumpy feeling on & off. You may want to mention it to the doctor.  Are you getting decadron/dexamethosone in the pre-medication?",
      "MessageIndex": 17,
      "PostDate": "12/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 13, 2008 01:23AM PineHouse wrote: I was told Dex could cause gastritis (wasn't clear to me if throat pain was part of gastritis), and it was given to prevent nausea.  They put me on Protonix for 2 months and discontinued the Dex.  I was glad the other nausea meds were enough for me, so I didn't need the Dex in the first place. Hope yours get resolved one way or another. Hugs back!",
      "MessageIndex": 19,
      "PostDate": "13/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 10, 2009 05:28PM PineHouse wrote: Barb, I'm still on Doxil (plus Cytoxan to be exact), have been for 7 months (7 cycles), will find out this week if I'm still responding. My H/F syndrome is almost non-existent, but I have a bit of neuropathy for a few days each cycle.  My biggest complaint is dehydration and everything gets dried out..skin, eyes, etc.  So paying attention to fluid intake is important for me. Fatigue is common.  Count on being fatigued for about 4-5 days (if you're getting decadron, you'll feel great on day 2 but only for one day). Lots of people complain about nausea.  I don't get much nausea, but that's probably because I get strong anti-nausea Aloxi (IV) and Emend (oral). Like you, I'm also nervous about lifetime max.  I already had a full-on Adriamycin 12 years ago on my first bout of breast cancer.  And then now I've been on Doxil for a while.  My oncologist doesn't seem too concerned about cardiac toxicity and he's following me with MUGA scans.  But I'm still nervous.  I've been taking CoQ10 on the side. Best of luck to you, and please keep us updated.",
      "MessageIndex": 39,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 5, 2008 03:29PM PineHouse wrote: Kelly, Here's a couple of threads that has Doxil info: http://community.breastcancer.org/forum/8/topic/725181 http://community.breastcancer.org/forum/8/topic/725329 Hope this helps. Big hugs!",
      "MessageIndex": 1,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 6, 2008 03:04PM PineHouse wrote: Joanie and Kim, You'll both be fine.  Just get through the first week.  I don't have nausea (I do get Aloxi via IV and Emend via oral but I no longer get Decadron).  Watch your fluid intake.  They also say you could get muscositis (swoosh w/ salt water).  I get fatigued the first week.  Neulasta is a must for me, otherwise I won't survive. Kelly, I have had 4 cycles of Doxil.  The first 2 cycles were Doxil monotherapy.  After the scan showed slight improvement, we decided to get a bit more aggressive and added Cytoxan.  So the last 2 cycles I had Doxil+Cytoxan.  I just had another scan to see if the combo worked or if Doxil still worked, but as of Friday the oncologist still couldn't get a report from radiologist yet. (aagh, a weekend of restlessness...) After being on Doxil for 4 months, most side effects are still pretty much the same.  Except that I developed a rash on the inner upper arm, oncologist said this is from Doxil.  It's manageable since it's not painful or itchy, but have to use lots of cream and watch the skin. Wish the best for all of you...",
      "MessageIndex": 5,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725478",
      "Title": "Are you (Doxil) Experienced? kelly1215 Bmarie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 19, 2009 02:57AM PineHouse wrote: sh - - ,  sh - - , sh - - !!!!! Erika, Not fair!  What a crapy deal!  But I see that the doctors were moving in fast with your treatment.  My guess is you're having a whole brain radiation for the 10 days? There are actually a few of us triple negative who are currently living with brain mets.  Brenda above is one of them.  Myself is another.  There's a bit of conversation in regards to triple negative brain mets in the metastatic section of Triple Negative Foundation forum http://www.tnbcfoundation.org/tnbc/forum/forum_topics.asp?FID=5&PN=1 There are basically 2 types of radiation treatments given for brain mets: (1) gamma-knife or cyberknife or stereotactic - this is a targeted radiation generally done in one day (2) whole brain radiation - generally done in 10-20 treatmments or 2-4 weeks. After the radiation treatment, some of us may be getting some kind of chemo that's known to be effective for brain mets. I personally know of a lady who's had brain AND spinal fluid mets for almost 2 years and still fighting.  Having brain mets like any other mets have challenges, but it's not an automatic death sentence. And a gentle big cyber hug may contribute to your successful treatment!!!!",
      "MessageIndex": 5,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730968",
      "Title": "It hasn't even been a year :( HELP! ekenny315 Makratz"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 9, 2009 03:16PM PineHouse wrote: LuAnn, BIG HUGS!!! I'm praying for your son's quick return, and for continuing time with grandkids, and for cancer to be under control, and for everything to work out. We love you!!",
      "MessageIndex": 35,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727024",
      "Title": "Frustrated and Blue LuAnnH Isabella4"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 15, 2008 04:20PM PineHouse wrote: Wats, cross fingers & toes.  I heard many promising things about mTor Inhibitor. Drug will work, and you have a very easy to tolerate side effects!!!!!!!",
      "MessageIndex": 13,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725936",
      "Title": "Started New Clinical Trial Watson hipchik47"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 2, 2009 01:45PM PineHouse wrote: It absolutely does! I consider myself a living proof too.  I was dx'd with lung mets when there was not yet symptoms.  Imagine if I was diagnosed 6 months later after either chest pain or difficulty breathing.  With triple negative tumors, can you imagine what that would look like? Now 3 years later, yes the lung tumors are bigger than original, and there's ups & downs with chemo, but they're still manageable. But sadly, although a lot of patients share this perspective, a lot more doctors still refuse to perform periodic scans for highly risk patients (post adjuvant chemotherapy).  Heck, a lot of doctors don't even want to do periodic brain MRI (to catch brain mets) for metastatic patients. Hugs.",
      "MessageIndex": 2,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731804",
      "Title": "Early Detection of Mets- Does it Matter? TripleNeg RobinWendy"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 1, 2009 05:50PM PineHouse wrote: Since no one knows the cause of cancer, I don't think we can be sure 100% that none of the above may have a role in tumor development in ONE individual person.  But again, since no one knows the cause of cancer, there is no sense sweating those little things and complicate your life. I think the key is MODERATION, and doing the best you can within your lifestyle.  I don't cut out sugar completely, but try to use more natural sweeteners (agave nectar, honey) whenever I can.  I don't eliminate all plastics in my household, but I try to use non-BPA product whenever I can.  There are a few adjustments that I've made, but not at all fanatic about any of them. Just my two cents.",
      "MessageIndex": 12,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729968",
      "Title": "myths about cancer Fitztwins DaughterMom"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Sep 19, 2008 04:56PM PineHouse wrote: Hi LuAnn and fellow metsters, I totally agree that we get brushed off and whited out of cancer stories. Have any of you go to the Metastatic Breast Cancer Network site?   www.mbcnetwork.org They have tried to put our voice out.  I really think what we need is a little coverage on a national TV or major newspaper.  So, yes, I do support your efforts, LuAnn.  Not knowing how those media people getting their letters/e-mail and what they do with them, I have no clue whether they'd like a short-to-the-point or a clear, personalized story like yours.  But best is not to change too much on what you already poured your heart into.  It IS the right one. I know I don't have much power, just being another metster here, but if I have your permission, I'd like to send your story to a couple of advocates hopefully they can propagate it a bit more.  If you do agree, you can tell me how you'd like to sign it, LuAnn or your full name?",
      "MessageIndex": 11,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721482",
      "Title": "Long, but need your opinion LuAnnH mom2acat"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Oct 9, 2008 05:09PM PineHouse wrote: Maria, One more info besides the 5-FU test you're seeking. If you are interested in molecular profiling (NOT chemo-sensitivity testing), don't have fresh tissue, but DO have UNSTAINED slides or tumor block from a recent biopsy (<4 years), there is a lab that does molecular profiling, currently for free to the patient (they will bill medicare, and what's not paid by medicare they will write off, so no cost to you). http://www.carismpi.com/products/target.cfm Be forewarned that your oncologist will be the one who has to \"order\" this test.  The Caris people generally only talks to you re: cost etc., but not anything scientific. This product/testing is also on a clinical trial, I believe phase II. You can PM me if you have further info regarding this. By the way, did you complain to your oncologist about the heartburn and the nausea?  They may be able to prescribe something.  I hate that feeling and I have my share of GI problems.  And 4-5 weeks is an awfully long time to not get any relief. Hope you nail this down soon.",
      "MessageIndex": 3,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722476",
      "Title": "5-FU/capecitabine toxicity test? jerseymaria jerseymaria"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 22, 2008 03:17PM PineHouse wrote: Joy, You are right.  This is a weekend of Hope and New Beginnings. I'm sure your oncologist has plenty of ammunition against your cancer.  Apparently the previous strategy with Arimidex was not effective.  Now you just simply need to switch to another treatment.  Begin anew... Sending you some prayers, good thoughts, and lots of hugs.",
      "MessageIndex": 14,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702669",
      "Title": "Not good news for me JoyRebecca NYCarol"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "May 7, 2008 12:45AM PineHouse wrote: Chris, Like sofeemay mentioned, the purpose of biopsy is usually to confirm MBC, and also sometimes the mets can have different pathology than the primary BC.  But given your multi-organ mets discovered at the same time, it does sound like MBC. And speaking of multi-organ mets, some oncologists may feel that you'll need to be more aggressive with the treatment.  Have you ever considered getting a 2nd and 3rd opinions?  There's always pros & cons about using monotherapy vs combo.  If you hear arguments from both sides you may get a better feel of what's best for you. Xeloda is actually a good drug that has been used for MBC for a long time and is known to be able to control the tumor for a long time.  So hopefully it works for you.  And if it stops working after a while, you may want to consider Carboplatin (known to be very effective in triple negatives) or Ixempra (also known to be quite effective in triple negatives). sofeemay, I heard good things about Ixempra, and I'm currently taking Avastin+Ixempra.  Just had my 2nd infusion today.  You may check the thread about Ixempra on this board, it may be useful as far as side effects etc. Best wishes for everyone!!!",
      "MessageIndex": 20,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705031",
      "Title": "Yup, It's lung mets and I'm triple neg sofeemay LuAnnH"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Oct 1, 2008 09:03PM PineHouse wrote: I was still working when I got the one you can sleep, shower, go into windtunnel, SWIM/jacuzzi, have s*x in... and more.  It cost $1500..ouch (by the way, should have a doctor write a prescription so you may get something from ins co).  It looked great, but my scalp was always itchy, and preparation to put it on was a big hassle. I'm not wearing that anymore.  I'm happier with a cute $100 version now. ",
      "MessageIndex": 14,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722062",
      "Title": "How much would you pay? Fitztwins LuAnnH"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Oct 9, 2008 11:03AM PineHouse wrote: Maria, I was told by an oncologist (he did a clinical trial that I participated in) that there is a BLOOD TEST that can predict how much toxicity you get from 5-FU or Xeloda.  One lab that was mentioned was Myriad Lab, the BRCA1/2 specialist.  This is the link for 5-FU test: http://www.myriad.com/products/theraguide.php There may be other labs that do this test.  I don't know about Medicare reimbursement, or if there is any financial assistance if you aren't covered by Medicare/insurance.  You can probably call them and see what they say. Maybe your office manager knows another lab that does the entire dna INCLUDING the test for 5-FU toxicity.  I agree with you we have enough problems we don't want to hear that we're prone to alzheimer, diabetes or any other conditions.  However, on the flip side, you never know if some of the info you get (that seems useless at this moment) may or may not help your breast cancer in the future. I really hope you can continue with your Tykerb/Xeloda.  Cross fingers you can continue on Xeloda.",
      "MessageIndex": 1,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722476",
      "Title": "5-FU/capecitabine toxicity test? jerseymaria jerseymaria"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jul 20, 2007 01:46PM PineHouse wrote:",
      "MessageIndex": 2,
      "PostDate": "20/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/658684",
      "Title": "Worrying about my mom ejohn LuAnnH"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 8, 2008 02:45PM PineHouse wrote: Hi, Another Xelodian here.  Started YESTERDAY!  3000mg a day. Is there ANYONE who doesn't get bad hand/foot syndrome? What do you ladies think about taking vitamin B6 to help prevent the syndrome?  This article didn't say about how much to take. http://www.cancercare.on.ca/pdfmedicationinfo/Hand-foot%20Syndrome.pdf",
      "MessageIndex": 7,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699949",
      "Title": "Fellow Xelodians please read Watson sueco"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Nov 18, 2008 07:19PM PineHouse wrote: Kasey, There's a recent Doxil thread: http://community.breastcancer.org/forum/8/topic/724282 There weren't too many Doxil people when I started 3.5 months ago, but we seem to be gaining more and more people now.  Hope this is a good drug that will help a lot of people. Your concern regarding heart toxicity was and still is my concern, especially I already had a full course of adriamycin in adjuvant setting years ago.  Multiple oncologists assured me that the risk of cardiac toxicity is a lot less with Doxil, almost non existent.  If you're still nervous, there are some cardio-protective meds they can give you.  I myself am taking CoQ10.  And yes, preferably you should get a MUGA scan. There is no hair loss.  Fatigue on days 3-5.  Dehydration (have to watch my fluid intake), dry eyes & skin.  Nausea is almost non-existent with antiemetic Aloxi (pre-med) and Emend (oral).  But I do get stomach acid/gastritis in second week, which they said was caused by Decadron and not the chemo.  They do say you could get hand/foot syndrome, which I don't have (yet). Well, wish you two Joanie & Kasey good Thanksgiving and good luck on the new drug. Huge turkey hug..",
      "MessageIndex": 2,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724673",
      "Title": "Doxil anyone? Kasey Fllorik"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 17, 2009 02:02PM PineHouse wrote: Rusty, I know someone else who had WBR and then 2 months later developed a sudden weakness in the legs.  It could be part of the WBR se's, but I absolutely agree with Barbe1958 you need to mention it to your doctor.  They'll probably want to run some tests to figure out the cause. Crossing fingers that your condition can be fixed asap. Hugs.",
      "MessageIndex": 2,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729215",
      "Title": "KIND OF FREAKED OUT HERE!!!! rooni LuAnnH"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 1, 2009 01:03PM PineHouse wrote: Brenda, I hope the MRI reveals nothing in the back.  Are they thinking about radiating if it's just the rib? Crossing fingers!! Hugs",
      "MessageIndex": 12,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731689",
      "Title": "Scans - a mixed bag Analemma Analemma"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 12, 2009 07:11AM PineHouse wrote: LuAnn, BIG HUGS! I'm so sorry things just piled up on top of you like that.  I'm praying hard that things will get easier soon.",
      "MessageIndex": 26,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728865",
      "Title": "Off to surgery again.... LuAnnH heatherpalmerton"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Aug 20, 2008 11:09PM PineHouse wrote: Hi Kasey, If one is looking for an onc, as an MBC patient I would vote for a breast specialist first.  But I think a general oncologist will be VERY VALUABLE if you're running out of options and may have to use novel therapies that haven't been approved for breast cancer.  Chances are these novel therapies are either leukemia, kidney cancer, colon cancer (or something else cancer) drugs that a general oncologist have had experience with (side effects etc.) To me, it's best to find an oncologist you can trust and can work with. By the way, to answer your question, I'm currently seeing a breast oncologist.",
      "MessageIndex": 5,
      "PostDate": "20/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719811",
      "Title": "Breast Onc or General Onc? Kasey pinkpig"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 12, 2009 11:10AM PineHouse wrote: Nicki, You've done so much for the bc community, it IS shocking to find you at the patient end.  But as YOU know and as the other ladies confirmed (and borrowing No Surrender's) you will prevail! Just lots of hugs and love for now..",
      "MessageIndex": 37,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730557",
      "Title": "New stage 4 here"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 2, 2009 12:15AM PineHouse wrote: Dana, I'm a lung metster for 2 1/2 years.  Have been on a lot of chemos, some worked, most didn't.  Unfortunately was diagnosed with brain lesions last month, but hoping to be back as lung-only after the stereotactic procedure. I agree with you to get more aggressive with treatment if you can.  So asking your doctor would be appropriate.  Maybe something can be added to Abraxane, like Avastin. Hugs...",
      "MessageIndex": 8,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726633",
      "Title": "Looking for my \"Lung Mets\" sisters.... WingsofHope grammadebbie"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jul 29, 2007 06:39PM PineHouse wrote:",
      "MessageIndex": 19,
      "PostDate": "29/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/664373",
      "Title": "Claim denied! mom2acat lavperry"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Nov 4, 2008 10:08PM PineHouse wrote: Faith23, I am so sorry that you and your mom are going through this. It seems like you're getting some conflicting reports.  I hope they are able to run more tests and have a more definite diagnoses.  In the meantime, it's good that your mom's liver enzymes are still normal, so the liver is functioning. As far as treatment goes, Doxil seems to be a good option, although I'm surprised that not too many people have been on it.  I am currently on Doxil (along with Cytoxan) and have tolerable side effects.  Mainly fatigue, dehydration.  I have been on Avastin, but have never taken Avastin and Doxil at the same time, so I can't say much about the combo. I really wish the best outcome for your mom.",
      "MessageIndex": 3,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723873",
      "Title": "Doxil and Avastin??? faith23 faith23"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 27, 2009 02:13AM PineHouse wrote: Oh, Susan, I know you WILL see your boys grow up and get married. I'm so sorry that vertigo was not meant to be this time.  But I'm also hoping that this is just a little set back that you will experience.  Like Janis said, it seems like brain mets is usually not fatal (because they're treatable). BIG HUGS!!!",
      "MessageIndex": 39,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731371",
      "Title": "I'm looking at brain mets, also... SunshineSmiles denise1962"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 13, 2009 01:00AM PineHouse wrote: Jeanne, I'm definitely with you.  Nurses giving out free samples of stuff that makes your eyelashes grow back.., of course no one comes to me with the free samples. There was a lady who came up with a brilliant art work, illustrating her battle with brain mets.  I didn't see the artwork myself, but the nurses said it was pretty good.  The lady wanted to donate that artwork to be displayed in the chemo room.  Of course the staff didn't think that was a good idea, since it may \"freak out\" the early stage people.",
      "MessageIndex": 4,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730626",
      "Title": "my onc's office needs a metster's club jeanne46 DianeE"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 22, 2008 12:29PM PineHouse wrote: Nooooo!  Dawn, I was hoping that Sutent worked for you. I'm a fellow triple neg, BRCA1.  My reaction is similar to LittleFlowers: get rid of the cancer asap any way you can.  Maybe you can do rads to get rid of the obvious tumors and then do Carbo/Gemzar to finish off the little cells & for re-assurance? The only thing about head/neck rad is that I heard it could be a little tough.  Unlike rads to breast, armpit, back, pelvis, etc that generally only have skin side effects, rads to head/neck could affect your mouth, salivary glands, etc.  This info is actually from the people who have head/neck rads due to head/neck cancers, so I don't really know if they would aim the radiation to the same area if you have lymph node mets (e.g. from breast like your case).  Hopefully you'll find answers on your next appt. If you do have to get chemo, I'm all for Carbo-containing regimen.  Carboplatin is the big gun for triple negative, and probably more so for triple negative BRCA1. I hope your next treatment will eradicate the cancer for good!",
      "MessageIndex": 21,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702338",
      "Title": "Ladies Please Help Me,I feel Like it's crunch time.. zarowny9 Trevorrolph"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 24, 2009 10:54AM PineHouse wrote: Lisa, So sorry about the progression.  But I'm glad your oncologist has something else in mind. I don't think I've heard of anyone on this particular combo.  But I know a friend who's on Sorafenib (Nexavar) and her main complain is that she has to keep immodium at hand. As far as Gemzar itself, it is believed to have a very mild side effect.  I myself am just starting an Abraxane+Gemzar regimen, and can't really tell if I get anything major from Gemzar. Wish you the best with this regimen.  Please keep us updated. Hugs",
      "MessageIndex": 2,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731278",
      "Title": "Gemzar & Sorafenib ligage LuAnnH"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Nov 21, 2008 08:07AM PineHouse wrote: Kenzie, Forgot to mention something. Generally, if you quit (or \"become disabled\") tomorrow, and qualify for disability as of tomorrow's date, you will not be receiving disability income until 5-6 months later.  And Medicare starts at 24 months after the date you start receiving disability income.  So if you add it up, you will not be on medicare until 29 months after you quit.  Regular COBRA is only an 18-month program, but there is a federally mandated cobra continuation for up to 11 months if you need it.  So you can be on COBRA for the 29 months. If you don't completely quit tomorrow, but scale back your work so that you only make $900/mo or less, you are still qualified for disability (and the 29 month clock starts ticking), but you'll still be covered under the main employer plan and don't have to go on COBRA yet.  I know this doesn't really resolve your fear of hitting the 2mil cap, but who knows the info could be handy for some other purpose. I'm also sending you a PM.",
      "MessageIndex": 15,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724754",
      "Title": "Help: Thinking about disability again kenzie57 kenzie57"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 3, 2009 05:08PM PineHouse wrote: Brenda, When it comes to your life and the quality of your life, there is no such thing as a crybaby wimp. You could have a hairline fracture too on the ribs.  Is there someone you can mention this progressively worsening pain to? A friend of mine (not breast cancer) had a bone mets and had pain like that.  She had a fracture and ended up having a cryoablation (this maybe a wrong spelling) and a kyphoplasty. Hope your pain gets fixed soon. BIG HUGS (gentle...)",
      "MessageIndex": 10,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731821",
      "Title": "1st Zometa today Analemma AusAla"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Sep 9, 2008 04:48PM PineHouse wrote: Hi Shen, I too was started on Doxil (every 4 weeks), first treatment about 3 weeks ago.  The fatigue did go away by the end of 1st week.  The only thing was that I got hit by all kinds of weird symptoms that were hard to tell whether it's from Doxil, or from my previous treatment.  Things such as photosensitivity, dehydration (plus I got a sore throat/cold/virus, so I'm still recovering from it now).  They also say mouth sore is possible on Doxil, but I have not had it.  I also have not had the hand/foot syndrome. My mets are in the lungs, not liver, but I am with you as far as fighting for life. I was told that Doxil is a very promising drug, like LuAnn said, it's actually an adriamycin (the \"A\" of AC that everyone gets), but with less side effects, therefore more potent in the cancer cells.  Did any oncologist ever consider giving you Avastin again (along with Doxil or other chemos you're going to get) since that has a history of putting out fire (along with Taxol, of course) and doesn't seem to add burden in the liver. Keep us posted.  I'm praying for you. Pinkpig, I'm looking up to you.  Hope we all have good results.",
      "MessageIndex": 9,
      "PostDate": "09/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720860",
      "Title": "Anyone on Doxil, need information shend PineHouse"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 8, 2009 08:35PM PineHouse wrote: LuAnn, Would definitely be fun to meet you and others, but not sure where or what I'm going to be in Octobar.  Hope last minute decision is ok. Hugs",
      "MessageIndex": 6,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732152",
      "Title": "Does anyone want to meet in Vegas LuAnnH heatherpalmerton"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jun 27, 2008 11:14PM PineHouse wrote: KariLynn, Quietly hoping... And sending you my prayers.",
      "MessageIndex": 39,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 16, 2009 01:55AM PineHouse wrote: Hopeful, I can't imagine what's happening.  I don't think the cancer is getting a lot worse that fast than it was before.  Make sure when you go in for your appointment, they do diagnose correctly where the swelling is coming from.  They may not be able to tell without sending your mom for a scan.  Insist that the scan is done asap, same day if possible.  Your mom is too uncomfortable to wait too long. As far as chemo, if they do decide it's the cancer that's causing all of the problems and your mom needs to start an aggressive chemo, I agree with LuAnn regarding platinum drugs.  Carboplatin is my favorite drug for triple negatives.  I only heard of one case that didn't respond to Carboplatin.  In addition, it may also pay to get aggresive and add a 2nd chemo instead of just a single drug.  I'm not a doctor, but I'm just giving you some materials to discuss with the doctor. As far as phone calls, yes, I suggest you just unplug the phone.  Or if you have answering machine, just screen the calls.  Change your outgoing message to say that you will call them if there's an update. Hopeful, I'm praying that you and your mom get through this difficult time ok. Big hugs.",
      "MessageIndex": 7,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730625",
      "Title": "Need HELP! Hopeful101 wayover20"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Nov 18, 2008 07:31PM PineHouse wrote: Wow, I really hope it wasn't a doctor telling your friend that nothing can be done just because she has lung mets and just because she had AC->Taxol a few years back. I was diagnosed with lung mets in June 2006 and I already had AC->Taxol in 1997.  There are many treatments besides A, C and Taxol.",
      "MessageIndex": 6,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724671",
      "Title": "Lung Mets DragonladyTina kenzie57"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 2, 2009 11:50AM PineHouse wrote: B, Just promise us that you won't \"vanish\".  We have some other brainers here who are continuously posting. Good luck Monday!  You'll be fixed as good as new. Warm hugs...",
      "MessageIndex": 8,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726659",
      "Title": "My holiday gift - brain mets Analemma badboob67"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 12, 2009 11:19PM PineHouse wrote: Lilac, I am a chemo pro.  Starting with adjuvant therapies AC->Taxol, CMF, and Taxotere.  Then I was dx stage IV in 2006.  I am a triple negative so I my choices are limited to chemo only.  I gobbled up the chemo choices like there is no tomorrow.  The first year was pretty good and I had some initial responses to Avastin+Taxol (1st line) and Carboplatin (2nd line).  But then everything was downhill from there.  NOTHING worked for a period of about a year.  I kept trying new chemo and it would fail right off, so I kept getting progression.  I went through PARP Inhibitor, Navelbine+Xeloda, and Avastin+Ixempra.  Things were looking dark to me, especially when I was on Ixempra and felt like I suffered a lot.  QOL tanked, I didn't even feel like I would make it annother 3 months and I wouldn't want to make it another 3 months. I had the worst progression while on Ixempra, so thank God we had to change chemo.  And you know what, I had Doxil+Cytoxan next and that worked pretty well. You really never know if, what, when, where, how things would work. With a lot of chemo experience under my belt, there are 3 chemo that I would absolutely, definitely, positively, without any doubt refuse to take again even if it's the last chemo on earth: Adriamycin, Taxotere, or Ixempra. I agree with Lisa, work with your doctor.  There's a delicate balancing between quality and quantity of life.  Tell your doctor you need more QOL than this.  See what he would come up with.  Ixempra is probably not your drug. Lilac, I really feel for you.  I know we are all struggling with that question almost on a daily or weekly basis.  And I hope you find your answer. Warm thoughts and big hugs for you!",
      "MessageIndex": 23,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732302",
      "Title": "Thinking about quiting chemo Lilac Godsgal"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Nov 20, 2008 05:20PM PineHouse wrote: Kenzie57, I understand your dilemma.. to quit or not to quit...and WHEN should you quit. I don't think you need an attorney just to help \"time\" your quitting.  You said that you've been on Avastin for 2 years and have \"spent\" 1/4 mil.  Since Avastin is one of the most expensive drugs today, I don't think you'll spend more than 1/4 mil every 2 years.  So there will be many more years before you hit that 2 mil cap.  I don't see that there's an emergency need to switch from your current insurance co. to medicare right away.  You can certainly decide to continue working for another year for example, and in the meantime take your time shopping for attorneys or doing other research related to that. Should you decide to quit working now and file for disability, as others have stated above, you don't really need an attorney for that either. Good luck on your decision..",
      "MessageIndex": 6,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724754",
      "Title": "Help: Thinking about disability again kenzie57 kenzie57"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "PineHouse wrote: Article from Cure magazine: http://www.curetoday.com/currentissue/departments/food/index.html Shocked to learn that they told you NOT to take Tykerb/Lapatinib with food.  Now they found that 250mg of Tykerb taken WITH food is equivalent to 1250mg of Tykerb taken WITHOUT food.  Right now they're not ready to tell you to cut dosages (to save money and to reduce side effects) and add food instead yet, but will they ever be? Numerous in-vivo studies have determined that chocolate-containing \"treat\"ment regimen SIGNIFICANTLY improved quality of life for breast cancer patients. Dx 12/1996, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699011",
      "Title": "The effect of food on drug potency PineHouse PineHouse"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 25, 2009 11:04PM PineHouse wrote: Susan, I'm crossing fingers, toes, eyes tightly. You are NOT going to be part of this epidemic!  Enough is enough! Sending warm thoughts, good thoughts, and basically not cancer thoughts! Hugs",
      "MessageIndex": 15,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731371",
      "Title": "I'm looking at brain mets, also... SunshineSmiles denise1962"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Nov 18, 2007 11:33PM PineHouse wrote: I believe in my breast cancer cases (first onset in 1996, and mets in 2006) stress did play a role. But I also believe that not every occurence of stress cause an occurence of breast cancer.  And not every breast cancer is caused by stress.  I don't think there is one single cause of breast cancer. Similar logic: if your immune system is weak (e.g. low white blood count), you may get an infection.  The fact that your white blood count is low does not ALWAYS mean that you will get an infection.",
      "MessageIndex": 13,
      "PostDate": "18/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695446",
      "Title": "stress and breast cancer shastaw Mizsissy"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Oct 17, 2007 04:42PM PineHouse wrote: Celia, Thanks so much for posting this info!! I'm glad we get the FDA approval for ixabepilone, it sounds very promising.",
      "MessageIndex": 6,
      "PostDate": "17/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693925",
      "Title": "FDA approved new bc chemo for adv. bc celia088 PineHouse"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 2, 2009 09:43AM PineHouse wrote: Caryn, I think when you're eligible for Medicare, Medicare will insert itself as primary insurance anyway. I think the best bet is to get Medicare, and like Carol said, get a Medicare Supplement insurance.  And if you want things to be super sure and it doesn't cost that much more, you can look into adding yourself onto DH's policy.  Then you have triple coverage.  My Medicare eligibility is coming up in July (and it just so happen that my COBRA will run out in June), so I should be looking into that too.",
      "MessageIndex": 11,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731754",
      "Title": "YIKES!! Lifetime insurance limit CarynRose lookingforward4more"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jun 17, 2008 12:02AM PineHouse wrote: Sue, you're my girl!  Anyway, maybe it's a good idea to leave the wedding ring at home.  But it's usually the way they say it that's annoying. Cat, yes, as much as I don't want to have that added chore of checking credit file periodically, but I probably should anyway.  So maybe I should just decide not to worry about giving out that SS#.",
      "MessageIndex": 9,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707394",
      "Title": "Do you give or not give your SS#? PineHouse ICanDoThis"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "May 4, 2009 11:42PM - edited May 4, 2009 11:43PM by PineHouse Brenda, I think the fact that you got some radiation aimed at T9 means that the T9 and its marrow got the treatment.  Marrow is inside the bone itself.  If you imagine a spinal bone is a donut and your spine is a stack of donuts, marrow is part of the donuts, and spinal cord runs through donut holes. I seem to remember you said that the T9 didn't cause you much pain compared to the rib, but yet they suggested to radiate.  So maybe that's the explanation, the fact that they want to \"get\" everything including the marrow. Hope this eases your mind a bit. Hugs",
      "MessageIndex": 13,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733568",
      "Title": "Bone mets vs. bone marrow infiltration Analemma Analemma"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 26, 2009 11:12PM PineHouse wrote: Oh gosh.  I'm so sad.  I miss her already. I'm sending prayers to John, kids & family.  May God bless you.",
      "MessageIndex": 87,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 3, 2009 01:00PM PineHouse wrote: Caryn, I'm wondering if you ARE receiving SSDI (social security disability) right now. They (Social Security Administration) usually tells you exactly when your Medicare coverage begins when they approves your disability.",
      "MessageIndex": 17,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731754",
      "Title": "YIKES!! Lifetime insurance limit CarynRose lookingforward4more"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jul 14, 2008 09:58PM PineHouse wrote: LuAnn, I agree with Kasey.  I SERIOUSLY think you need to be seen by a doctor, preferably by the surgeon who did the surgery.  It may be a simple condition that can be easily fixed, but you don't want to wait too long until it becomes a serious condition. I really feel for your struggle.  Sooo sorry things just don't run smoothly. Big hugs...",
      "MessageIndex": 23,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709056",
      "Title": "Help, having a hard time recovering from surgery LuAnnH ozzie2"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 8, 2009 09:36PM PineHouse wrote: YHong, My deepest condolences for you and your family.. Warmest thoughts for you...",
      "MessageIndex": 28,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732116",
      "Title": "My mom is an angel now YHong luvtotravel"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 4, 2008 05:13PM PineHouse wrote: Kasey, Palliative just means they are right now concentrating on treating your pain, it does not always mean they are giving up on you.  You are still getting chemo, so it's possible that you can get your pain under control in the future and you won't need the hospice team anymore.  The possibility is there! Very big warm hug for you...",
      "MessageIndex": 34,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725446",
      "Title": "Now under Hospice/Palliative care Kasey RobinWendy"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 7, 2009 08:44PM PineHouse wrote: Denise, I had Navelbine+Xeloda, so didn't take Navelbine by itself.  You can always get a 2nd opinion if you have any question whether or not your doctor should be more aggressive. Navelbine was a lot more tolerable than Taxotere in my experience.  Unfortunately that Navelbine+Xeloda combo didn't work for me. Big hugs and good luck to you.",
      "MessageIndex": 3,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730283",
      "Title": "New Game Plan denise1962 denise1962"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Nov 17, 2008 05:57PM PineHouse wrote: Subinthapa, UCLA is vast and has all kinds of phone numbers.  Sometimes if you call the wrong department they don't even bother to call you back.  If you still want to pursue UCLA, I suggest either of 2 ways: (1) Contacting a specific oncologist's office directly. - Dr. Sara Hurvitz (breast specialist), Santa Monica (310) 829-5471 - Dr. John Glaspy, Westwood (310) 794-4955 (2) Multidisciplinary Consultation at the Revlon Breast Center where you get a 3 hour consultation with various experts (usually an oncologist, a surgeon, a social worker, and possibly a radiation oncologist) and they'll give you a recommendation.  For phone number, try (310) 825-2144 The holiday season and the upcoming cancer conferences may slow down some process a bit, but hopefully you could get squeezed in. Best wishes.",
      "MessageIndex": 5,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724049",
      "Title": "Immediate 2nd opinions for nonresponsive metastatic disease? subinthapa Hopeful101"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 11, 2009 01:52AM PineHouse wrote: Jinan, If you know of a facility that does cyberknife, you should try to make an appointment there.  The doctors there then can tell you whether they would recommend the procedure.  And you may want to do this sooner than later because all processes take some time. Bear in mind that cyberknife is more commonly used to treat brain mets, although there may be facilities that does liver mets.  I really don't know if it's done to lung mets.  So again, whether it's going to be beneficial or not, whether it's feasible or not, only doctors who have a chance to evaluate your mom's latest scans can tell. There is also a procedure called Radio Frequency Ablation (or any kind of ablation) that's sometimes used for liver mets and can be used for lung mets.  But not everyone is a candidate for the procedure. Hope this helps a bit.",
      "MessageIndex": 3,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730495",
      "Title": "Do u Think i should take her there?!!!! pls help! jinan22 LuAnnH"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "PineHouse wrote: Given the fact that I see quite a few different doctors for 2nd opinions and different facilities for procedures, my SS# gets all over the place. Would you be concerned about your SS#s (with names, addresses & birthdates, of course) showing up all over? When I read financial articles in magazines & papers, they all say that you DON'T have to give your SS# to your doctor's office.  Is there a law that I can cite so that I can safely refuse to give them my SS# and still be seen? I had an experience once where a clerk was helping me checking in for a surgery.  She assured me that the SS# will not show up on just any employee's computer/printouts once she input it, and basically told me I wound't get my surgery if I refuse to give my SS#. Numerous in-vivo studies have determined that chocolate-containing \"treat\"ment regimen SIGNIFICANTLY improved quality of life for breast cancer patients. Dx 12/1996, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707394",
      "Title": "Do you give or not give your SS#? PineHouse ICanDoThis"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 21, 2008 11:06PM PineHouse wrote: I'm stage IV diagnosed June 06. First line therapy was Avastin+Taxol.  Worked for a few months then stopped.  I'd say it extended my life by 6 months. Second line therapy was Avastin+Carboplatin.  At this time I had the best response ever.  Unfortunately, we have to drop Avastin because of insurance issues.  Oncologist didn't want to keep fighting the insurance for reimbursement. I'd say Avastin worked for me, and I believe it's still in my future. As far as side effects of Avastin, it's one of the easier drugs I've been on.  I did have an increased blood pressure, which was controlled with diuretic/water pill.  There's also nose bleed here and there and blood in stool here and there.",
      "MessageIndex": 8,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/700757",
      "Title": "Avastin for breast cancer? sarika_for_mama sarika_for_mama"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 11, 2009 09:30AM PineHouse wrote: Oz, Jelly, Rose and Member are correct.  Scientists do not know yet what causes breast cancer.  Those with mutated BRCA1 gene (like myself) have 87% CHANCE of developing breast cancer.  Having BRCA1 mutation is NOT a guarantee that you'll get breast cancer because 13% of us never will. And then of course BRCA1 mutation is only found in about 5% of ALL breast cancers diagnosed.  BRCA2 mutation accounts for another 5%.  What caused the remaining 90% of breast cancers?  Scientists are still working on it.  It seems to me there may be thousands and millions of different causes of breast cancer. The fact that your BRCA1 gene is perfect (e.g. like this baby, supposedly the mutated gene is fixed), does not mean that you'll never get breast cancer.  90% of breast cancer patients have perfect BRCA1 and BRCA2 genes.  Again, there are thousands or millions ways you can get breast cancer.  Breast cancer is not just one disease.  We all know that chemos don't work the same way on everyone, suggesting that the underlying \"problem\" is all different.",
      "MessageIndex": 4,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727157",
      "Title": "Can anyone answer this Question? ozzie2 abinneb"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "May 10, 2008 11:12AM PineHouse wrote: oz, Avastin does NOT cause hair loss, but it is an IV.  Personally, I'm a fan of Avastin.  I believe it's effective for all kinds of MBC, and has very tolerable side effects. Hope this helps.",
      "MessageIndex": 10,
      "PostDate": "10/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705282",
      "Title": "CT results... ozzie2 LumiPojo"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 17, 2009 09:49PM PineHouse wrote: Judiiiii, (by the way, not sure I spelled it right, I just added a few i's) Just wanted to say that even if you've used all of the breast cancer chemos, it doesn't mean that you can't repeat any of them.  Those that you've used years ago I believe can be reintroduced.  Of course Etoposide is a valid option too, but I haven't seen anyone who's had it. Let's just hope CM is working for a looooong time so you don't even have to worry about the next tx. Hugs",
      "MessageIndex": 3,
      "PostDate": "17/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730898",
      "Title": "Etoposide? Judiiiii KiminJax"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "May 9, 2008 10:11PM PineHouse wrote: Hi oz, So, so sorry about the progression.  So frustrating. Are you considering adding Navelbine to Xeloda?  I didn't even know that it's that common to do a Navelbine+Xeloda combo.  My oncologist put me on Navelbine+Xeloda combo early Feb 08.  Unfortunately for me, my tumors (yes, I have too many to mention in the lungs) grew through that combo.  I only took 3 cycles.  But I am VERY triple negative (5 biopsies confirmed the triple negativity), so your tumor response is probably going to be different from mine. As far as side effects go, I didn't suffer too much.  There was some cramping-like muscle spasms in the diaphragm area within the first 24 hours.  Maybe some gas and stomach upset.  But everything was tolerable. Yes, 2 cycles of Xeloda seems minimal, so you may want to give it a little more time.  Hope Xeloda (alone or with Navelbine) gets rid of those tumors.  It's been used for metastatic bc for a long time and it's helped many women. Best wishes...",
      "MessageIndex": 7,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705282",
      "Title": "CT results... ozzie2 LumiPojo"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Sep 27, 2008 03:41PM PineHouse wrote: tooyoung and others... I started asking myself that question too a few months ago.  I have not had any response since June 2007, all were progressions.  I'm currently on my 6th line of therapies and basically almost used up all breast cancer drugs (most of them just plain didn't work).  However, (although I do have a huge tumor in the lung & the whole lung mets are pretty serious) I don't seem to have big symptoms from mets, I only get sick from the treatments. I admire both who are fighters until the end and those to take control of their destiny and say \"stop treatment\" before the doctors say do.  But this is definitely the hardest decision someone will ever have to make, as we know, life doesn't usually turn off in just a switch.  Sorry to be this freaky, but this really is my biggest fear... that I have to be a burden to those around me. Well, I just hope that we (everyone, not just we who have cancers) all are equipped with courage, love and faith to live and die.",
      "MessageIndex": 5,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721859",
      "Title": "chemo forever...not for me tooyoungtohavebc PineHouse"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 12, 2009 09:34PM PineHouse wrote: Heather, Sucks you have to go back to chemo.  Why can't they leave us alone?  But if you do have to go back to chemo, I'm with mthomp.  Doxil is much gentler (including much less cardiotoxicity), maybe your oncologist will consider it. I hope the chemo you're getting will kick butt!!! Big hugs in the meantime.",
      "MessageIndex": 16,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732268",
      "Title": "Back on Chemo heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Nov 8, 2008 10:30AM PineHouse wrote: Oh, no, Lisa, not you too!! I'm so sorry of the news, but yet I'm hopeful that the experts will zap those things out with either gamma knife or stereotactic surgery or something like that, and make you as good as new. I also think Bora-bora may bring good things. Bear hugs...",
      "MessageIndex": 6,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724122",
      "Title": "Me, too LisaSDCA EGAL"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 23, 2008 12:49PM PineHouse wrote: I had this done once Jan 2008.  Mine was zero too.",
      "MessageIndex": 3,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726244",
      "Title": "CTC - Circulating Tumor Count (Cell Search) Judiiiii Judiiiii"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 2, 2008 02:08PM PineHouse wrote: I had a port put in inner arm in 1997 for my adjuvant therapy.  This was very helpful, since it's hard to find my veins.  I had it taken out after I'm done with chemo since it was painful when rubbing against clothing or body. I had another port put in the upper breast in 2006 when diagnosed with metastasis.  This one I really like because it doesn't interfere with anything.  I've been using it for 1.5 years now.",
      "MessageIndex": 6,
      "PostDate": "02/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699632",
      "Title": "Decided to get a port Analemma shafali"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 6, 2008 08:14PM PineHouse wrote: Joanie, I could really understand your apprehension.  Everything was new to you.  New chemo, new port, new nurse... A lot of unknowns at the same time. Sounded like nurse #1 might have been a new nurse, just following orders without thinking.  As far as I know, I don't get blood test more than the infusion.  On my Doxil-only regimen, I got the infusion every 4 weeks, and they took my blood every 4 weeks for CBC and chem panel.  The nurse should have asked the \"authority\" to see if last week's blood test will suffice. As far as accessing a newly installed port, I think they do do that, even if the port is less than a week old.  But again, if you are sore and uncomfortable, they should accomodate you and not access the port. Oh well, hopefully next infusion is a lot better.  I'll be thinking of you.",
      "MessageIndex": 5,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725521",
      "Title": "may I rant? Betsey Betsey"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jan 24, 2009 03:23PM PineHouse wrote: I'm keeping Angela, kids & family in my prayers. Bethany, thanks so much for the update. Hugs..",
      "MessageIndex": 6,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727888",
      "Title": "Angela's Update Friday Bany LuAnnH"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jul 14, 2008 08:16PM PineHouse wrote: Jill, I had something similar.  On occasions, I had an \"ocular migraine\" attack.  No pain, just the zigzag flashing light and some \"blank\" area in my vision.  This usually happened when I was out in the sun or have been glaring at the computer screen.  When I closed my eyes (make it as dark as possible), it went away in 15-30 minutes. It started happening quite often in Feb, Mar this year (I was on Navelbine+Xeloda at the time).  You could imagine how panicky I got.  Ophthalmology check was fine.  But brain MRI was also fine.  And actually I rarely get them now. Can you call you doctor, explain the symptoms and just ask for a brain MRI right away to rule out mets? Wish you the best outcome...",
      "MessageIndex": 3,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709072",
      "Title": "Brain mets question magsandmattsmom Member_of_the_Club"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 3, 2008 08:02PM PineHouse wrote: watson, There are oncologists who believe in giving sequential single agent therapies for reasons of (1) less toxicity (2) you won't run out of drugs quickly.  Cancer drugs are known to stop working at some point even if you respond to it initially.  They may work for 3 months and then stop, or they may work for 3 years and then stop.  So oncologists know that you'd be looking for new drug(s) at some point in the future. Generally on combo drugs you get more side effects (more toxicity) and but you are using up the drugs that you can use more quickly.  However, on combo drugs you do tend to respond better than on single agents. ABSTRACT The optimal treatment approach in metastatic breast cancer is controversial. Until recently, the arguments for administering antitumor agents sequentially in the metastatic setting have traditionally outweighed those for administering agents in combination. Older, often empirically designed drug combinations were no more effective and often more toxic than monotherapy, compromising quality of life for little or no clinical benefit.  However, more recent studies show that combination and sequential therapy both have their place in the treatment of metastatic breast cancer, with the heterogeneity of breast cancer demanding flexibility in approach. Newer drug combinations, such as paclitaxel/trastuzumab or capecitabine/docetaxel, show survival advantages over single-agent therapy and have manageable safety profiles. Such combination treatments may be preferable to sequential therapy for patients requiring urgent reduction in their tumor burden.  Sequential therapy allows the optimal delivery of single-drug therapy and potentially reduces the risk of toxicity, which may improve quality of life. Sequential therapy may be especially appropriate in frail or elderly patients, who may be unable to tolerate the toxicity of combination therapy, or in patients with slowly growing tumors. This article expands on these issues by reviewing trials comparing combination regimens with sequential approaches. The Oncologist 2002;7(suppl6):13-19 Yes, if I were you, you may want to ask your oncologist to see if you can take Avastin, Ixempra, or Taxotere (the capecitabine + docetaxel mentioned in the article) with your Xeloda.  These are common combo used on many MBC patients.  I myself am given Navelbine with my Xeloda, but that's based on some insight knowledge regarding my tumor.  I have never seen or heard Navelbine+Xeloda given to anyone before. However, I wouldn't freak out either if you didn't get the combo.  Xeloda is one single agent (beside Herceptin & hormonals) that can keep you alive for years. By the way, regarding hot flashes, I don't think it's specifically Xeloda that's causing it.  Maybe it's just the fact that you got pushed further into menopause (because you're taking chemo, any chemo) that caused it. watson, good luck on all of these.",
      "MessageIndex": 4,
      "PostDate": "03/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701475",
      "Title": "Anyone else do Xeloda by itself? Watson luckywife"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 28, 2008 11:08AM PineHouse wrote: Hi Susan, I also went through similar thing. A new GP who examined me in 8/07 was freaked out (knowing my breast cancer history) when she felt a lump in my thyroid.  Sent me for an ultrasound.  Ultrasound didn't look good, recommend to do biopsy.  They did a biopsy and it was benign.  Just some multinodular goiter.  Since then the goiter was also seen & reported on routine CT scans that I have.  Never changed in size, it's just there. I know at least 2 other breast cancer survivors who have some kind of thyroid-related problem. I hope yours is benign.",
      "MessageIndex": 9,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704614",
      "Title": "Thyroid Nodule? Msklapkin Honeybear"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Mar 8, 2009 09:21PM PineHouse wrote: Ninel, I also was told I had brain mets and I had no symptoms.  I was treated with stereotactic radiosurgery. I would suggest that you just ask the doctor for brain MRI, because I have a feeling your anxiety will continue regardless the information you're getting from us here.  The brain MRI will just put it to rest and if you have never had one, will serve as a \"baseline\". Hope things are going well for you.",
      "MessageIndex": 4,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730353",
      "Title": "Brain Metastis - What are the symptoms? ninel Linda_H"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Feb 1, 2008 11:06PM PineHouse wrote: Hi ladies, I actually bought Ralph Moss' report on \"metastatic breast cancer\" (yep, it's pricey!) and had a phone consultation with him. The report is NOT a \"how to cure\" book.  I think his book is more appropriate for those of you exploring hardcore \"alternative\" treatments (those of you wanting to abandon traditional therapies).  If you're looking into \"complimentary\" treatments instead (such as vitamin D supplement, turmeric, greentea extract, etc.), the book is not it. If you'd like more info on this, you can always PM me.",
      "MessageIndex": 8,
      "PostDate": "01/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699560",
      "Title": "QUESTION REGARDING ALTERNATIVE THERAPIES sisterlove sisterlove"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Dec 12, 2008 06:26PM PineHouse wrote: No more chemo?  Party on!!!",
      "MessageIndex": 38,
      "PostDate": "12/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725786",
      "Title": "I did get some good news.. Fitztwins celia088"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Apr 2, 2009 10:38AM PineHouse wrote: Virginiamom, If you tested negative for BRCA1/2, it means your daughters AND SONS will also test negative for BRCA1/2.  But it DOESN'T mean that your daughter will never get breast cancer.  There are many reasons people get breast cancer.  Most people with breast cancer don't have BRCA1/2 mutation. Should you do test positive for BRCA1/2, you can't \"give\" it to your sister either.  Only a parent can \"give\" it to an offspring.  But should you do test positive, it means you would either get it from mom or dad.  And whichever (mom or dad) who give it to you MAY (50% chance) give it to your sister too. Bear in mind that genetic doesn't pass through only the women in the family.  I tested positive for BRCA1 mutation and I inherited FROM DAD.",
      "MessageIndex": 3,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731776",
      "Title": "So my BRCA1 and 2 test was negative(m) virginiamom virginiamom"
    },
    {
      "AuthorID": "PineHouse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4900/profile",
      "Content": "Jul 8, 2008 09:18PM PineHouse wrote: Stehanie, WELCOME BACK!!!  I'm just so happy to see you back here on the board, back home to your family and back to fighting breast cancer. I'm sending more prayers your way...",
      "MessageIndex": 187,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708563",
      "Title": "Can't Walk.... Headed to ER TripleNeg booklady"
    }
  ]
}