{
  "AuthorID": "pingpong195…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
  "Posts": [
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jun 1, 2019 04:35AM pingpong1953 wrote: I second the Claratin (not Claratin D!) recommendation. I had terrible bone pain the first round, then I tried generic Claritin, and bingo - no pain. I started it a couple of days before the first injection and continued through the 8 days. Worked like a charm.",
      "MessageIndex": 2,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870753",
      "Title": "Neupogen shots? kber pingpong1953"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jun 13, 2018 07:23AM pingpong1953 wrote: I found the injection to be VERY painful - like being stung by the world's biggest, meanest wasp. However, there was no residual pain. I had a lumpectomy and lymph node biopsy the following day and just had the normal post-surgical pain. Sorry I can't be more help.",
      "MessageIndex": 2,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/864273",
      "Title": "Pain after Sentinel Node Injection wlo002 pingpong1953"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "May 9, 2018 05:55AM pingpong1953 wrote: My hot flashes don't cause me to perspire, but I get this horrible feeling of being pricked by needles all over my skin. At first I thought it was an allergic reaction but I never broke out in hives or anything like that. I just want to rip my skin off. I also have a remote-control floor fan at the foot of my bed that I leave on most nights now that the weather's getting warmer.",
      "MessageIndex": 6,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864422",
      "Title": "Hot flushes and letrozole Kanga_Roo Lula73"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "May 4, 2019 12:08PM pingpong1953 wrote: On a positive note, I had rosacea for over 20 years, and about a month into my chemo it cleared up. It's been almost 2 years and it hasn't returned. Go figure.",
      "MessageIndex": 6,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/871370",
      "Title": "Looking for a list of what I can and can't do April0315 Txladybe"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Oct 27, 2017 06:02PM pingpong1953 wrote: I had a PICC line, not a port, and the nurse applied very strong pressure on the vein for 5 minutes and then applied a pressure dressing that stayed on for 24 hours. I think they avoid putting any more holes in the vessel to try to seal it up. ",
      "MessageIndex": 6,
      "PostDate": "27/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859711",
      "Title": "Port removal-local anesthetic or something better? LimnoGal LimnoGal"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Dec 4, 2017 11:45AM - edited Dec 4, 2017 11:54AM by pingpong1953 Hi there! I was on exactly the same chemo regimen as you're going to have. Started on July 5 with the FEC and had my last taxotere in mid-October. As far as side effects are concerned, they were very different for the different drugs. I got a ton of anti-nausea meds for the FEC, and they worked pretty well. I had a bit of nausea a few times but never vomited, which was a huge relief. I've heard such horror stories! I didn't do anything to prevent hair loss, since an ice cap sounds incredibly uncomfortable and keeping my hair wasn't worth the hassle. It started falling out exactly 2 weeks after the first FEC dose and I got my head shaved the next day. When I was doing the taxotere the chemo nurse kept me supplied with gloves with ice packs in them, so I've had little trouble with fingernails.My main side effects with the taxotere were shortness of breath and fatigue. I felt like a 90-year-old woman for a while, but the side effects slowly went away and I'm feeling pretty good now. I'm just curious: where do you live? There seems to be some sort of geographical pattern to what chemo we receive.",
      "MessageIndex": 2,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860622",
      "Title": "chemo: FEC, Taxotere Hope99 stephincanada"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jun 22, 2017 05:06PM pingpong1953 wrote: I started going grey when I was still in my 20's. It's been pretty much all grey (or should I say white) for about 20 years. I haven't coloured it in many, many years. Embrace the grey - life is so much easier when you can stop worrying about your roots showing. I haven't started chemo yet, but I'm really curious about how my hair will look after it grows back in. I actually hope it doesn't come in dark!",
      "MessageIndex": 25462,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Oct 19, 2017 05:21AM pingpong1953 wrote: Had my last chemo today - so glad to be through this step and be able to ring that bell. I'll meet with my MO at the end of November and probably will discuss Tamoxifen. Then I'll have my mastectomy after the holidays. I've had a lumpectomy, but after meeting with the RO we decided that my history of lupus makes me a bad candidate for rads, so mastectomy it is. I'm OK with the surgery, just dreading those evil surgical drains!",
      "MessageIndex": 1323,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Nov 4, 2017 09:18PM pingpong1953 wrote: Not just walking up stairs. It seems that any exertion using my upper body also results in SOB. I had to take a break while folding fitted sheets, for crying out loud. I'm afraid to go for a walk around the block because I may end up stopping in the middle of the sidewalk to catch my breath. Plus I'm on a hill, so I won't get far without some major gasping.",
      "MessageIndex": 1517,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Nov 5, 2017 06:50PM pingpong1953 wrote: Pink, thanks for the encouragement. Patience is not my strong suit, unfortunately!",
      "MessageIndex": 1529,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jul 6, 2017 09:01AM pingpong1953 wrote: Started chemo yesterday. First, had my PICC line put in, took my 3 premeds and had the FEC combo with no problems. I live in northern Ontario, which is pretty sparsely populated, but there are Cancer Centres in the larger cities that serve these communities. The one where my oncologist is located is about 2 hours away, so I've been there quite a few times these past couple of months but I'll be having the rest of my treatments in the city where I live. (The province has grants that help to defray the cost of the trip if you live more than 60 miles away.) There's also a fantastic volunteer group at the Centre, including a groups who knit or crochet great big blankets that are given to all new chemo patients for us to keep. The one I picked has grey, white and yellow stripes and is absolutely beautiful. Speaking of knitting, every table in each waiting area at the Centre has a basket with several types of yarn and a variety of knitting needles. While you're waiting you can start a new square or pick up one that's already been started and add a few rows. (Apparently these same volunteers take the \"nice\" squares and sew them together to make comforters, however not the ones we're given at 1st chemo.) I'm not sure if this is done at other hospitals, but it strikes me as such a great idea. Knitting is a nice way to relax and is much more interesting than 3-year-old magazines!",
      "MessageIndex": 111,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jul 27, 2017 07:34PM pingpong1953 wrote: JenRuns: Don't those things cost like $6000? I hope you (or your insurance company) get a refund! Letherette: I fully expect to fall flat on my face some time in the next 24 hours. I've had lupus for over 30 years and I have some experience with steroids, to be sure!",
      "MessageIndex": 449,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jun 18, 2018 11:57PM pingpong1953 wrote: My scalp got sore about 2 weeks after my first chemo and I noticed my hair falling out when I ran my fingers through it. It felt like your scalp feels when you have a very tight ponytail and you take out the scrunchie. I ended up getting my hair clipped to 1/8\" the following day. It was just too uncomfortable to brush my hair.",
      "MessageIndex": 1,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/865297",
      "Title": "Sensitive scalp pain GrooGruxQueen GrooGruxQueen"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Feb 3, 2019 11:13AM pingpong1953 wrote: OneKT, Filgrastim is the generic name for Neupogen. I took it for 8 days during every chemo cycle, and I stayed pretty healthy. I took Claritin (I bought the generic) and I didn't have any bone pain. (I should say that I took the Claritin starting the second cycle, because I really had bone pain during that first cycle without it!) My neupogen came in pre-filled syringes that had to be refrigerated. I suggest taking the syringe out of the fridge about 30 minutes before the injection - that way it doesn't hurt. It's a bit uncomfortable injecting cold liquid into yourself. As far as the nausea, etc is concerned, take all of the premeds exactly as ordered and you should be pretty good. I did have some nausea a few times but they had prescribed a separate \"just in case\" anti-nausea med that worked. My biggest problem was fatigue and there's no quick fix for that. When it comes to food, I found it best to just eat what was appealing. For some reason I liked cold food best. I even went on a vegetarian sushi binge for a couple of months!",
      "MessageIndex": 3,
      "PostDate": "03/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869662",
      "Title": "Starting TC chemo next week and need advice on meds OneKT OneKT"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "May 1, 2018 10:24AM pingpong1953 wrote: If I'm not mistaken, one of the reasons for having a port or a PICC line is not so much that it's easier if you have small veins, they also protect the veins from the chemicals. You may start out with good veins but then have them damaged during your treatment. Have you considered a PICC line? It's easy to put in and quite comfortable. The only hassle is having to keep it clean and dry. I used Press and Seal plastic wrap to cover mine up when I took a shower and it worked really well. Also, it was easy to remove at the end of my chemo. Just a thought.",
      "MessageIndex": 52,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863991",
      "Title": "Chemo Port-O-Caths: Did you get one? What was is like? buttercup1 exbrnxgrl"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Feb 13, 2018 09:01PM pingpong1953 wrote: I'll be joining the half-flat club on 2/27. I'm not interested in reconstruction at this point, and I'd have to erase the memory of surgical drains from my mind before I'd even consider an elective surgery like that. I' a C-cup, so I'm going to look quite unbalanced without something in the right side of my bra. My sister knitted me a couple of knitted knockers, so I'll start with that and do some experimenting. Thanks to everyone for sharing their ideas!",
      "MessageIndex": 28,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jul 30, 2017 10:13AM pingpong1953 wrote: Well, had my 2nd chemo on Wednesday, and took my last steroid dose yesterday. My biggest problem is eating - I'm so hungry but most stuff just will not go down. I haven't had vomiting, but I'm still feeling that queasiness, even with the anti-nausea meds I have. I'm trying to keep on top of it and not let the nausea take over. I'm also really tired and sleeping is an issue. I may ask for some Ativan or whatever at my next infusion and see if I can get a handle on the sleep part, at least. I am absolutely amazed at those of you who are going through this while working, caring for families and exercising! I'm retired and have no one depending on me, so I can pretty much do what I feel up to doing. I don't know how you do it - hats off to all of you! ",
      "MessageIndex": 493,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Apr 1, 2019 08:57AM pingpong1953 wrote: I had my biopsy done right after my mammogram. I was given the option of coming back the following week but I wanted to get it over with. I had a feeling that it was cancer. Not sure why, but it came out of nowhere and felt so huge (it was just below the surface - not sure how I missed it!)",
      "MessageIndex": 7,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870728",
      "Title": "Why have a consultation , why not biopsy ? Bostonmama Bostonmama"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jul 25, 2017 06:56AM pingpong1953 wrote: Ruthbru: That poor man!",
      "MessageIndex": 28,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856900",
      "Title": "Did you work through chemo? Autum1031 sweetp6217"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Mar 27, 2019 03:27PM pingpong1953 wrote: Sorry about your diagnosis. The others on the board have said that you'll feel better once you have a treatment plan in place, and I found that to be true, too. At least you'll feel like you're doing something! There is so much helpful information on this forum - I'm amazed at how little I knew about breast cancer before I got it!",
      "MessageIndex": 11,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870634",
      "Title": "Today is the day Deb65 pingpong1953"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jul 6, 2017 04:32PM pingpong1953 wrote: My sister used to work in a med-surg department in a small community hospital. One of the surgeons, who was loved by his patients and had a great bedside manner, had a terrible record for post-op complications. My sister privately referred to him as Dr. Butcher, but if anyone looking for a surgeon asked her about him, she'd tell them, \"If I were having surgery, I'd go to Dr. XXX.\" If that person would respond and again ask about Dr. Butcher, Gail would say, \"If I were having surgery, I'd really, really go to Dr. XXX.\" Nurses are a great source of information about doctors, even if you have to read between the lines sometimes.",
      "MessageIndex": 13,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856669",
      "Title": "How to assess a surgeon's expertise/quality MLScott CGG"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Oct 7, 2018 09:52PM pingpong1953 wrote: I had a mastectomy on my right side, and I usually sleep on my right side, so I got one of those U-shaped body pillows to keep me on my back and not interfere with those @#*! drains. The pillow can be rearranged to support various body parts. I still use it on those restless nights when I can't get comfortable.",
      "MessageIndex": 1,
      "PostDate": "07/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867661",
      "Title": "Wedge pillow for sleeping? apatient SimoneRC"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Aug 30, 2017 09:28AM pingpong1953 wrote: JenRuns, I've often had the cracked heel problem (before BC) and I found that using OTC first-aid cream with anesthetic heals them quickly and makes them more comfortable.",
      "MessageIndex": 803,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Nov 4, 2017 05:55PM pingpong1953 wrote: I'm glad to hear I'm not the only one who is struggling with shortness of breath. It's been 2 1/2 weeks since my last Taxotere and it's probably the most troublesome thing I'm dealing with right now. I don't see SOB very high on the list of side effects of Taxotere.",
      "MessageIndex": 1511,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jul 9, 2017 01:59AM pingpong1953 wrote: Benedict Cumberbatch? That's a riot!",
      "MessageIndex": 132,
      "PostDate": "09/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Jul 27, 2017 12:11PM pingpong1953 wrote: Had my 2nd infusion yesterday, and thanks to the steroids I was the energizer bunny this morning. At least my kitchen's nice and clean - on to the laundry! Unlike most of the folks on this forum, I take Neupogen rather than Neulasta. I live in Ontario and Neupogen is covered by our health plan, although people with private prescription insurance (usually employer-based) can probably go for the Neulasta. It means I have to give myself 8 injections for each cycle, but I don't mind at all. It saves the province a bunch of money and it really isn't difficult. If I were to have a problem with the injections then a home health nurse would come to my home every day to give them to me. And I wonder if getting it gradually helps to lessen the bone pain. Last time I had some really impressive pain a few hours after my last shot. It only lasted about 18 hours and Tylenol pretty much took care of it. I'm expecting a few rough days ahead, but hopefully they won't last too long. Sending out positive thoughts to all of you!",
      "MessageIndex": 439,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Aug 10, 2017 11:25AM pingpong1953 wrote: My hair started falling out 2 weeks to the day after my 1st infusion. Luckily I had just gotten a shipment of scarves and hats that morning, so I was pretty well set. I got my head shaved the following day because my scalp was so sore I couldn't stand even putting a comb through it, much less washing and styling it. My hairdresser is a sweetheart - she doesn't charge for chemo head shaves and she schedules them after her last appointment of the day so there's no \"audience.\" I was quite comfortable with the whole thing, since my hair is thick and it was making such a mess - white hair + dark floors = lots of dry-mopping. I did the \"Look Good Feel Better\" workshop on Tuesday (I haven't worn makeup on a regular basis for years) and at the end of the day when I was getting ready to go to bed I took off my hat and immediately thought of the movie \"To Wong Foo Thanks For Everything Julie Newmar.\" Anyone who's seen the movie probably knows what I'm talking about - I looked just like one of the \"ladies\" after full makeup and before adding the wig. Cracked myself up!",
      "MessageIndex": 645,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Nov 1, 2017 04:52AM pingpong1953 wrote: Pink, your SE's sound just like mine. I'm 2 weeks out from my last Taxotere so I'm a bit behind you, but I also have the ridges on my fingernails and the watering eyes, which I didn't realize is a SE. My taste buds are slowly recovering but I'm nowhere near 90 percent - maybe half way there? My toenails are sore but haven't started changing colour or anything like that. Fingernails are not bothering me yet, although my cell phone no longer recognizes my finger print. Perhaps there's some very subtle reshaping going on???",
      "MessageIndex": 1472,
      "PostDate": "01/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856223",
      "Title": "Starting Chemo in July 2017 Teese pink_is_my_colour"
    },
    {
      "AuthorID": "pingpong195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251592/profile",
      "Content": "Mar 15, 2019 08:30AM pingpong1953 wrote: To make a long story short, because of another medical issue I have I am not a great candidate for radiation. I could have gotten away with a lumpectomy if I could have done the rads, but I didn't want to risk it, so I opted for a mastectomy (with lymph node removal) and chemo, which is considered as good as lumpectomy/rads/chemo. I'm very comfortable with what I did. ",
      "MessageIndex": 7,
      "PostDate": "15/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869995",
      "Title": "Having bilateral mastectomy & want to refuse radiation after. Rkelmarie DesertPup"
    }
  ]
}