{
  "AuthorID": "Pink91316",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
  "Posts": [
    {
      "AuthorID": "Pink91316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
      "Content": "Nov 17, 2016 05:51PM Pink91316 wrote: good afternoon ladies!! I hope everyone is well. Second treatment yesterday, fairly uneventful. Side effects seem to be minimal. I do have a question, my face is red and super broke out, is this normal? Or could be an allergic reaction? Any suggestions on how to relieve it? You guys are so awesome at sharing. I appreciate each and everyone of you. I keep saying that cancer is bestowed on the strongest and you ladies are the strongest! Warrior on!!!",
      "MessageIndex": 455,
      "PostDate": "17/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Pink91316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
      "Content": "Nov 13, 2016 01:14PM - edited Nov 13, 2016 01:15PM by Pink91316 welcome BG46TN, this is a great group of ladies, completely supportive and full of great tips and advice. I had my first treatment this past Weds, fairly uneventful beside my mini meltdown, but I got it under control. It was just fear of the unknown and my port was still a little tender. I took a blanket, IPad (although the center provides movies), my lunch (treatment is 3 1/2 hours). Try not to stress, you will do great!! The diagnosis info provided under names is updated in your profile and then you make it public Best of luck!!! You got this!!!    ",
      "MessageIndex": 288,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Pink91316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
      "Content": "Nov 5, 2016 05:28PM Pink91316 wrote: hello everyone, I am starting chemo on 11/9, I am finishing up my Brachytherapy on Monday. A little stressed, super scared. I will be on a cocktail of taxol and Herceptin for 12 weeks, then Herceptin for 9 months. I had my port placement on 10/28 and it is extremely tender and somewhat still painful. Is this normal or maybe it's just me, everything about this diagnosis has been very difficult. Thanks for all the suppor",
      "MessageIndex": 144,
      "PostDate": "05/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Pink91316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
      "Content": "Nov 6, 2016 04:58PM Pink91316 wrote: I keep hearing about cold caps, what are they and where do you order them?",
      "MessageIndex": 160,
      "PostDate": "06/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Pink91316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
      "Content": "Nov 8, 2016 08:23AM Pink91316 wrote: Chemo starts tomorrow, how do I prepare food wise, does it matter? Do side effects happen right away? I am still panicky! Any tips would be greatly appreciated",
      "MessageIndex": 197,
      "PostDate": "08/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Pink91316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
      "Content": "Nov 9, 2016 09:44PM Pink91316 wrote: first treatment today, all went well. I did have a mini meltdown when the nurse went access the port. My port placement was the hardest part so far. It was so painful and I was bruised from necklace to my nipple area, so I kind of freaked out. I finally got my head screwed on straight and everything went smoothly. Now I am anticipating the side effects. I have my nausea meds, so I am ready. Hope everyone had a great day!! 1 down 11 more to go!!!",
      "MessageIndex": 221,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Pink91316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
      "Content": "Nov 15, 2016 09:33AM Pink91316 wrote: Good morning Ladies!!!! I hope we all have a wonderful day. Just want to say you all are amazing!!! Super Heroes!!! Number 2 (10 more to go) for me tomorrow, I am having a little anxiety even though I promised myself I would not. I have a prescription for a wig, should I just go and get one? When should I expect my hair to really start coming out? I also am interested in Medical Marijuana. Is that something you have to ask for or is based on symptoms, that your Dr prescribes it? I leave in AZ, so I know they do dispense. Have a wonderful, chins up!!!!",
      "MessageIndex": 345,
      "PostDate": "15/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Pink91316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239604/profile",
      "Content": "Nov 16, 2016 05:24AM Pink91316 wrote: Ughhhhh, can't sleep. I even took an ambien, slept 4 hours. Maybe I will get some sleep during treatment today! Thinking of getting a flu shot, any opinions? Would it make chemo S/E worse? Nfullbloom- you crack me up, thanks for the smile. You look amazing in your wig. Kind of scared going to look for one. I told my husband I was getting a long blonde wig and changing my name to Bambi 😊 Sleepless-chemo brain is real!!! The forgetfulness, sense of confusion, it's crazy. My family did not believe me when I told them there was such a thing, they are now convinced. Hope everyone has a great day!! Warrior on!!!",
      "MessageIndex": 368,
      "PostDate": "16/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    }
  ]
}