{
  "AuthorID": "pinklemon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63838/profile",
  "Posts": [
    {
      "AuthorID": "pinklemon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63838/profile",
      "Content": "Mar 4, 2008 11:14AM pinklemon wrote: Caaclark gave you some good info. I am a certified fitter. I can tell you that the Amoena contact sticks very well. I know some women wears them in the pool and in the sea, but the adherence can be affected, and it can be different from one women to another (skin type, type of surgery, etc...). It is usually recommended to wear a prosthesis especially for swimming, but some women do keep their contact to swim, with no problem. ",
      "MessageIndex": 5,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/701490",
      "Title": "stick on prothesis berriesnblues jerseymaria"
    },
    {
      "AuthorID": "pinklemon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63838/profile",
      "Content": "Mar 11, 2008 10:51AM pinklemon wrote: Crazydaisy, I'll do my best to answer your questions. I am in Canada, but in Quebec (close to Ontario, but it is a bit far!). But I do know Dianne, from Dianne's mastectomy. She is in Brampton, is it close to you? She is very good, with lots of experience (at least 20 years). Please write to me in private, I will look for her number. If it's not close to you, I know another person in Port Perry. Right after your surgery, you can wear a very light form made of foam in an adapted camisole. To be fitted with a silicone prosthesis (heavier), you have to wait until you heal completely: usually between 6-8 weeks. Your doctor will tell you when you are ready to be fitted. As for the insurances and what is covered by medicare, I think it might be different in Ontario compared to Quebec, but the fitter would be able to tell you. Hope this help!",
      "MessageIndex": 12,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/701490",
      "Title": "stick on prothesis berriesnblues jerseymaria"
    },
    {
      "AuthorID": "pinklemon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63838/profile",
      "Content": "Mar 10, 2008 07:32AM pinklemon wrote: Sedosa, I said swimming form are recommended, but I did not mean it is important... It is more for the look, if it's important for you. But if you want to wear a prosthesis for swimming, the one designed for swimming is recommended because it is more resistant to chlorine. My first language is French, so I don't express myself as well in English.  ;-)",
      "MessageIndex": 10,
      "PostDate": "10/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/701490",
      "Title": "stick on prothesis berriesnblues jerseymaria"
    },
    {
      "AuthorID": "pinklemon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63838/profile",
      "Content": "Aug 12, 2008 09:41AM pinklemon wrote: I would say it is OK if you don't swim too often, and if you rinse your form, it is not a problem. The reason to have a swimming form is too extend the ''life'' of your regular one, which is also more expensive. (Here in Quebec, the regular forms are 3 times more expensive then a swimming form, so why take a chance to damage your regular one?) I prefer to have the two. Also, as erica said, the swimming one is not as heavy and drains the water well. For vacations, you will be in the pool and\\or the sea a lot. Then i think it would be a good investment to have a form especially for that.",
      "MessageIndex": 3,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/719256",
      "Title": "Silicone breast forms okay for swimming? mason204 OLBinNJ"
    }
  ]
}