{
  "AuthorID": "Piscean",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210475/profile",
  "Posts": [
    {
      "AuthorID": "Piscean",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210475/profile",
      "Content": "Jun 3, 2017 10:29AM Piscean wrote: I'm not a Stage IV patient, but I work with them. I can offer this: My best guess is your boyfriend can pick you up after, but he would need a phone call because the hospital won't be able to give an exact time that you're finished and ready to go. You know how it is: your appointment time is at 8 am, but they don't get you into imaging until 10 am and it takes an hour after biopsy to ensure there's no bleeding, etc. so an exact time for discharge from the hospital is anyone's guess! Best of luck and big hugs!",
      "MessageIndex": 1,
      "PostDate": "03/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/855749",
      "Title": "Driver for outpatient procedure: quick question Laurie09 mishka6008"
    },
    {
      "AuthorID": "Piscean",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210475/profile",
      "Content": "Mar 9, 2017 07:45PM Piscean wrote: AnnaK05, So sorry you're going through this. I guess at this point it's easy for me to say that the soreness will go away...the fear likely won't until you get the results. Years ago before BC, I used to think I knew what I would do if I were ever to be diagnosed. All that went out the window when I learned that I had breast cancer. It might be helpful to think about options if you get the news you dread. Keeping yourself busy and reaching out to those who have walked a similar path might help you relax a little. It's also just fine to ask for some meds to help you sleep if you find your mind won't allow the rest needed to catch some zzzzzs. I would offer you this: Do not blame yourself for not getting something checked sooner. That's a torturous game you don't want to play, and if you find you have BC, your brain is going to be occupied figuring out everything else in your life. Hold those you love close, rest when you can, eat well, exercise, talk, laugh, cry. Hugs, Piscean",
      "MessageIndex": 8,
      "PostDate": "09/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853041",
      "Title": "Diagnostic US and mammogram small pebble lump AnnaK05 AnnaK05"
    },
    {
      "AuthorID": "Piscean",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210475/profile",
      "Content": "Mar 11, 2017 11:28PM Piscean wrote: Boubou, you can sign a paper at the hospital where you had your imaging done and they will send you a copy of the radiologist's report. Alternatively, you can request a copy from your physician and they will provide you with one. I would recommend getting copies of all test reports, whether investigative for breast cancer or not.  ",
      "MessageIndex": 10,
      "PostDate": "11/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/853355",
      "Title": "mammogram, ultrasound and biopsy Boubou dAd"
    }
  ]
}