{
  "AuthorID": "pj12",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
  "Posts": [
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 27, 2009 07:58AM pj12 wrote: Hi Admom, I think most small tumors are never felt, just my opinion.  My tumor was 1 cm and deeply placed almost to the chest wall.  So, no I never felt it.  It barely made it on the mammogram film.  Good thing about being large is that an area the size of a golf ball can be removed and everything still looks pretty normal.  At 6 months post lumpectomy I still have some swelling so the op'd breast is fuller than the uninvolved side.  I always say I was prepared for smaller, not larger!   There are a lot of surprises in this journey! Best wishes, Pam ",
      "MessageIndex": 2,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/741043",
      "Title": "for large-busted women... admom thegoodfight"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 27, 2009 10:35AM pj12 wrote: Well, here's the problem:  I am 62 years old and in my whole life I have only examined  one pair of breasts, my own.  They were certainly lumpier during the years that I was having children and/or periods and I did not have breast cancer then.  So dense or fatty, lumpy or not, perky or saggy... what I have is normal to me.  I bet that is true of 99% of women.  Maybe only men are qualified to assess variations in breast tissue!  I guess what we are supposed to look for is change but that is hard to determine too.  We just have to do the mammogram thing, I guess. Pam ",
      "MessageIndex": 5,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/741043",
      "Title": "for large-busted women... admom thegoodfight"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 27, 2010 11:43AM pj12 wrote: Just to touch on a couple of your questions: 1: The oncotype score is based on the given that you are doing radiation. If you did not factor in rads, your risk of recurrence would be statistically much higher. 2. There are radiation programs designed to be shorter. You would  have to seek out a facility that offers that. Not all do. 3. There is a desired window of radiation to begin.  It is usually 4-6 weeks following surgery UNLESS you are having chemo. This time frame balances surgery healing to allow radiation against the time leftover cancer cells might regroup and begin to cause new trouble. At this time radiation after lumpectomy is the standard of care. I know it is scary and we left-siders worry about heart damage. To a lesser extent, lung. Be sure your team follows protocol, if the machine freezes up and goes down, make them start over, expect them to pay attention, question them if things seem sloppy. Be your own advocate. If you feel like a therapist is careless, tell them you don't want to work with them. Good luck pam ",
      "MessageIndex": 4,
      "PostDate": "27/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749013",
      "Title": "Recently Diagnosed and Concerned about Radiation hopie NatureGrrl"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "May 11, 2012 04:40PM pj12 wrote: I had a pretty routine lumpectomy with SNB, left side, in march 2009. It was followed in may thru july with 36 radiation treatments. So I am more than three years post surgical treatment. I am physically active; garden, normal housework, bicycle, etc so I was pretty diligent in working to recover full range of motion and strength in left arm. I should say I have not had any significant \"pain\" associated with breast cancer treatment. I started out using light weights, progressed to 8lbs. That did not seem to have much impact and was not much fun. I walk three miles every morning so about a year ago I added walking or hiking poles to my routine. Living in Florida Everyone has to remark about the lack of snow, where are my skis, or just ask what they are for. They have been great for both my arms as far as toning them up and making them look more muscular. BUT my left arm still has some tightness in the armpit-underarm that was never there before BC. I can reach my right arm over my head to put a hairpin near my left ear, no problem. But it is a strain for me to get my left arm up and over to reach a curler on the right side. (yes, I still use hair curlers). I do not have LE and i have no pain. Just some limitation of range and less strength or power. If I press hard in my armpit I feel a sharp pain, ditto my left breast near the site of the lumpectomy. But no spontaneous pain. I don't mean to discourage you, just say that, for me, there is still some residual restriction that I did not expect. But I feel healthy and strong and looking forward to being five years post treatment so I can stop tamoxifen someday in the future! Good luck to all of us!",
      "MessageIndex": 6,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/787301",
      "Title": "SNB ...underarm movement/pain etc purple32 purple32"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 27, 2009 07:19AM pj12 wrote: Hi SassyCassie, I would not call it a sore throat but I did have a scratchy throat and a tickle like cough during RADs and for about a month afterward.  My Rad Onc said not due to radiation but... no  other explanation, IMHO.  I just waited it out and it resolved on its own. Best wishes. Pam ",
      "MessageIndex": 7,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/740953",
      "Title": "Radiation Question??? Lauren3 desdemona222b"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 25, 2009 01:13PM pj12 wrote: I actually asked my radiologist about this.  He laughed soundly.  I think there is a kind of radiation treatment, not what we breast cancer patients have, where radioactive seeds are implanted for a few days and the patient is isolated during that time.   But this has nothing to do with breast cancer radiation treatment.    Best wishes for getting through this.  It is more mentally stressful than physically challenging.  You will do fine. Pam ",
      "MessageIndex": 4,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/740953",
      "Title": "Radiation Question??? Lauren3 desdemona222b"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 22, 2012 04:06PM pj12 wrote: My ER was 99%, don't remember PR. My oncotype came back 27. :(  Still, I did not do chemo.",
      "MessageIndex": 10,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 9, 2010 11:39AM pj12 wrote: Bless your heart for making lemonade from lemons ... or snow angels from a snowed over driveway. Your positive attitude is an inspiration. pam ",
      "MessageIndex": 1,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748075",
      "Title": "Shoveling, shoveling, and more shoveling! NatsFan tweetybird"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 15, 2009 09:40PM pj12 wrote: Have you started on an aromatase inhibitor?  Leg and foot cramps seem to be common with them. Pam ",
      "MessageIndex": 10,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739518",
      "Title": "CHARLY HORSE IN CALF OF LEG O3132W Sige"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 25, 2010 05:04PM pj12 wrote: Billyna, What an inspiration you have been and are to all of us! Bless you all and hope you are feeling better real quick. How is your little girl doing? pam ",
      "MessageIndex": 24,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747294",
      "Title": "Clint \"Buddy\" Warren Griffith II is here!!!! Billynda lkc"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 26, 2009 12:01PM pj12 wrote: It was freezing in the radiation treatment area!  I wore two pairs of socks. While some folks say their appointment time was always \"on time\" and brief, there was some to a good bit of fluctuation in how fast I was in and out.  Sometimes  it was 20 minutes, sometimes it was an hour, once I was there over 2 hours. The \"machine\" can go down and your treatment may be cancelled or rescheduled. You do not get treatments on holidays. You should not apply ointments or creams within 4 hours of a treatment.  I always showered before treatment to get residues off my skin.   Aquaphor is great and recommended for healing fissures and blisters but it is hard to wash it off so I preferred to just use Aloe (the clear, not the green). You can't use regular deodorant and I found what was recommend (Crystals) useless. A high protein, low fat diet is recommended by the American Cancer Society.  I added yoghurt and cheese and eggs to my light diet. Naps are a good thing.  Go to bed early.  Stay ahead of the fatigue.  Don't take on extra responsibilities.  Take advantage of offers for help. you probably won't be able to wear a bra throughout the whole course of treatment.  Tank tops with shelf bras did not work for me.  I used stretchy camisole type tops and loose button up shirts.   Skin fissures can appear suddenly and heal up almost as quickly.  I had one bad weekend, otherwise not too bad. Radiation skin damage does not scar.   You should do fine.  It was not physically bad but I found it very stressful.  Glad to see it end! Pam ",
      "MessageIndex": 2,
      "PostDate": "26/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/740879",
      "Title": "Looking onward to rads... Niknak0320 pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 25, 2009 08:03AM pj12 wrote: This thread is very helpful.  I had 28 regular tx, 8 boosts. No chemo.  Lumpectomy.  I never felt anything as dramatic as \"fatigue\" but tremendous anxiety the whole time.  Anticipating the treatment made me shake, every time!  I am normally a calm person but found the whole process very stressful.  I took a \"lay-me-down\" every day but could not nap, went to bed early every night but slept fitfully.  I am 4 days post-radiation and feel MUCH better already.  More enthusiasm for everything, sleeping better too.  It's quite hot where I live so have to be careful not to be over-heated... that will make me feel weak and light headed right now.  But I feel much less tense and anxious and like I just might get back to normal.  Make taking care of yourself a priority!!!",
      "MessageIndex": 91,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730002",
      "Title": "RADIATION FATIGUE - POLL bluejay1 Siciliana"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Mar 24, 2010 06:08PM pj12 wrote: I had a total of 36 radiation treatments. After the first 5-7 TX it was as if I had a mild sunburn but no blistering. At about TX #25 I began to blister, mainly in the fold under my breast. By TX #30 the blisters were kind of open oozing sores and I was very tender in my underarm. So I had about 10 pretty uncomfortable days. The skin began to heal really quickly as soon as rads ended and things had healed within a couple weeks. I stayed somewhat swollen for 3 months, with less swelling as time went by. My treated breast is still a little fuller than the other side and was not before at all. I am 9 months post radiation. Wishing you good luck, pam ",
      "MessageIndex": 8,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/750217",
      "Title": "questions about radiation icey Chicago1018"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "May 29, 2011 05:58PM pj12 wrote: Sending chocolate vibes and thinking of you.",
      "MessageIndex": 140,
      "PostDate": "29/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 8, 2011 02:25PM pj12 wrote: What % ER+ is your mother? The higher the better for how well hormonal therapy will work for her so that might help you in the decision process.  Did the surgeon say the margins were good? That is important too. Her tumor was quite small so that is good. How is your mother's general health and her heart? Chemo can be hard on people with other health issues. There is an \"ideal\" time window in which to start radiation if you are not doing chemo so you might ask the radiation onc what they think.  Your mother is fortunate to have you as her advocate. Making these decisions for ourselves is difficult, it is so much harder making them for a loved one. Good luck. ",
      "MessageIndex": 3,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/767242",
      "Title": "Failed oncotype - chemo or no chemo? allmylove NormaJean65"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 6, 2011 06:38PM pj12 wrote: 81, Missing you a TON! ",
      "MessageIndex": 354,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 8, 2011 08:14AM pj12 wrote: I'm having a brownie for breakfast in your honor. I might put some chocolate ice cream on it for the dairy part :) And maybe a little whipped cream too. And some peanuts for fiber. What a healthy breakfast! One hundred twenty and missing your plenty!  (((!)))",
      "MessageIndex": 447,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 4, 2011 01:20PM pj12 wrote: Me EIGHT! (((0)))",
      "MessageIndex": 263,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 19, 2010 02:42PM pj12 wrote: I felt like you do... enough doctors! I saw my rad onc at 6 months, 9 months and 12 months, recently. I told him I did not want to come again and he agreed my oncologist could order my mammograms as needed. All this doubling up of doctors is time consuming, anxiety producing, and expensive! pam ",
      "MessageIndex": 1,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/755575",
      "Title": "Rads Onc Follow Ups: How Many? FCB ruthbru"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 4, 2010 06:23PM pj12 wrote: Also.... while a positive attitude makes us all more likable, many of us have agreed a positive attitude is not the be all - end all in cancer therapy. You are not saboutaging your treatment plan by feeling despondent or sad. Sure, you need to eat right, get exercise, carry on with life but it is okay to be a grump about this stuff. It sucks. Gripe - complain - rail against this disease - get angry. But hang in here with all of us... we are here for each other.",
      "MessageIndex": 11,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753597",
      "Title": "Deciding Against Chemo JudyAnnW Titan"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 16, 2010 12:03PM pj12 wrote: Crossing lines to post in a Stage IV forum because....your posts and personality resonate with so many of us. I love to see you pop up when I open Active Threads. I read all five pages and it is so inspiring to see you get your sea legs and come out swinging (to mix a metaphor or two).  I am visualizing Elizabeth (as in Taylor) floating down de Nial with SO or McDreamy feeding you grapes (aka Femara)  amid a cloud of healing vibes from all your admirers, US! I think the hair style fits too! Big Hugs from your devoted slaves down in the galley. pam ",
      "MessageIndex": 142,
      "PostDate": "16/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 1, 2010 05:06AM pj12 wrote: reported",
      "MessageIndex": 2,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747643",
      "Title": "finalfootwear | tennis shoes| high heel shoes| new balance shoe guest barbe1958"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 27, 2010 12:56AM pj12 wrote: I wonder if you are thinking of blood tests that look for signs of cancer circulating in the blood? My doctor does a CA 15-3 but there is another common one also, Ca 27-29.  Lots of DRS do not do them but lots do. Google Tumor markers for more info. A tumor marker is a substance found in the blood, urine, or body tissues that can be elevated in cancer, among other tissue types. There are many different tumor markers, each indicative of a particular disease process, and they are used in oncology to help detect the presence of cancer. An elevated level of a tumor marker can indicate cancer; however, there can also be other causes of the elevation. ",
      "MessageIndex": 3,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/751818",
      "Title": "Tumor markers mari65 mari65"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 8, 2010 06:40PM pj12 wrote: Hi Lost_Creek, I felt the same way when going through rads a year ago! My facility was in a hospital only 5 miles from home so not so  inconvenient as it was confidence shattering. My first week something went wrong every day. I was undone and when I saw the rad onc on Friday I told him I felt no trust that I was getting good, safe care. He did explain that the machine was super sensitive to power surges/fluctuations which caused them to have to reboot and start over. Also humidity (Florida!) changes made it necessary to reprogram. We were experiencing daily thunderstorms  and tiny power interruptions were the main problem. Sometimes I would be on the table ready for zzapping and they would have to start all over. :-( Technicians were there for several days, then things seemed to improve. ??? Anyway, IF I had it to do over.... I would refuse to be treated immediately AFTER a failure. There was a terrrifying article about patients getting the wrong dose of radiation due to computer glitches. I did not read it until I had finished rads. I came through alright but always felt nervous. Don't be afraid to tell your team it makes you question what is going on. At least they might be more careful. Good luck! pam ",
      "MessageIndex": 1,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/755076",
      "Title": "Rads Machines breakdown? Dilly Celtic_Spirit"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Oct 29, 2011 05:49AM pj12 wrote: I am like ma111. I am 2 1/2 years post lumpectomy and still no sweating on the lumpectomy/SNB side. But seems as if the other side doubles up to make up for it!",
      "MessageIndex": 2,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777211",
      "Title": "Excessive underarm sweating on the lumpectomy side DCS m1970"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 12, 2009 05:01AM pj12 wrote: I've read so much that I can't remember the source... but I read the optimum time to start radiation is 4 to 6 weeks post surgery.  Something about starting treatment before any remaining cancer cells have time to regroup.  My surgeon may have said the same thing.   My lumpectomy was 3-20-09 and I started radiation on 4-27-09.  Having said that, the timing seemed much more important to me than to anyone else :)     I think radiation has been stressful and anxiety producing.  But the physical side effects have not been as bad as I imagined they would be and I have only 7 more treatments to go.  At my center there have been many little glitches and I have learned I have to be flexible in my expectations.  Go with the Flow! ",
      "MessageIndex": 7,
      "PostDate": "12/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/735464",
      "Title": "How soon after surgery? nanabolini carollynn79"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Dec 22, 2009 01:40PM pj12 wrote: Dear Berry, I have not been so unfortunate as to have the breathing side effects from radiation that so many have so it may seem easy for me to ask you to think twice about discontinuing RT.  I'm not suggesting you resume your recent therapy at all.  I was thinking you could look in to IMRT (image modulated radiation therapy) or the technique given with the patient lying on their stomach.  Both apparently target the tumor bed more precisely and spare the heart and lungs better.  I hated radiation and found it very stressful but I surely wanted the reduction in recurrence it provided. Please forgive me for inserting my differing opinion.  I just want you to get good treatment. Best wishes however you decide. pam ",
      "MessageIndex": 32,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744855",
      "Title": "Coughing & Shortness of Breath During or After Rads KAK Chevyboy"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 23, 2011 03:08PM pj12 wrote: I had tape over ink marks early in the radiation process. It was hot summer in Florida and impossible to wear things high necked enough to hide it. So got remarks from EVERYONE, cashiers, clerks, neighbors, mailman, etc. I was so glad when they put the tiny tattoos on but soon discovered the older radiation therapists could not find them in the dimly lit treatment room! So I took to circling the little tattoo spots with a magic marker. I was more concerned with them lining me up right than what strangers thought of all the hieroglyphics on my chest!  Good luck and this too shall pass! Pam ",
      "MessageIndex": 3,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/765293",
      "Title": "Starting Rads tomorrow Questions? LovemyLife12 BrandyB"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Dec 8, 2009 01:07PM pj12 wrote: I think it is more common for doctors to want a personal sit-down to discuss results.  Seems like too often things are not black or white and patients have lots of questions.   Putting the clip in is standard practice... just in case.  Waiting is the worst part of this whole ordeal and it never gets easier.  Bless you for being a support to your wife. pam ",
      "MessageIndex": 2,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/745075",
      "Title": "Metal clip and in-person results? mjfarrell5959 mjfarrell5959"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Dec 22, 2009 01:40PM pj12 wrote: Dear Berry, I have not been so unfortunate as to have the breathing side effects from radiation that so many have so it may seem easy for me to ask you to think twice about discontinuing RT.  I'm not suggesting you resume your recent therapy at all.  I was thinking you could look in to IMRT (image modulated radiation therapy) or the technique given with the patient lying on their stomach.  Both apparently target the tumor bed more precisely and spare the heart and lungs better.  I hated radiation and found it very stressful but I surely wanted the reduction in recurrence it provided. Please forgive me for inserting my differing opinion.  I just want you to get good treatment. Best wishes however you decide. pam ",
      "MessageIndex": 33,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744855",
      "Title": "Coughing & Shortness of Breath During or After Rads KAK Chevyboy"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 16, 2011 11:26AM pj12 wrote: After my biopsy and before my lumpectomy I had CT scans of lungs, abdomen and liver area. Also had a bone scan.  I did not ask for them but my onc surgeon considered them standard. My insurance did not argue about it at all. ",
      "MessageIndex": 9,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/764979",
      "Title": "Stage 1 - did you have any scans? mdg purple32"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 17, 2010 01:28PM pj12 wrote: I did not have this experience myself but was told by someone who did... that the nodes were clustered together so it was impossible to just remove two or three. Talk to your surgeon and ask why. Still, just 6 should be ok especially if they were all in a group. Best best wishes for a good outcome. pam ",
      "MessageIndex": 1,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754259",
      "Title": "Totally confused about sentinel node biopsy results LtotheK LtotheK"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 8, 2012 12:15PM pj12 wrote: I should have added that even though my oncotype score was 28 the report very clearly said I would not benefit from chemotherapy. As my doctor explained it to me, the mitosis rate was very low and chemo does not work well on sluggishly dividing cells. So the \"number\" is not the be all - end all. There is still a lot of nuancing going on and you have to listen to your docotors' advice.",
      "MessageIndex": 14,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/784432",
      "Title": "58 y/o, Oncotype Score of 20, No Chemo Blessed58 shuf"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 11, 2012 03:10PM pj12 wrote: Susanes, I had to look back to find what form it was printed on. On my first post op visit with my surgeon he gave me a copy of his operative report and the final surgical pathology report. On page 1 of 4 toward the bottom the Nottingham Histologic Grade is listed. There are three parts; tubule formation, nuclear grade and mitosis. The combination of these three scores determines the \"grade\" of your cancer. Mitosis indicates cell growth which in my case was 1/3, in other words sluggish. Chemotherapy works best on actively dividing cells, I was told. Pam",
      "MessageIndex": 20,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/784432",
      "Title": "58 y/o, Oncotype Score of 20, No Chemo Blessed58 shuf"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 28, 2010 03:46PM pj12 wrote: I had a similar experience during rads. It was on and off. I finally decided the smell, kind of like burnt sugar, occurred when I did not get whatever lotion I was using thoroughly washed off. Aquaphor seemed to always leave a residue and my skin was too tender and blistered to really scrub hard. I switched to Aloe only and no more smell. BTW, no one else could smell it. Congrats on being near the end! pam ",
      "MessageIndex": 3,
      "PostDate": "28/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/755901",
      "Title": "Strange smell from radiated armpit? LVLinda Staceybee"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Aug 20, 2011 08:01PM pj12 wrote: Law girl, So sorry you are suffering. I found the last week and the couple weeks after rads ended to be the worst. I took to wearing old, soft men's undershirts against my skin. If I needed to wear a bra, I wore it over top of the undershirts. Without a bra, I tucked the undershirts up under my breast as it was the skin on skin friction that was the most irritating. I thought the heavy duty creams caused more trouble than help and only used aloe toward the end. On an encouraging note... It amazed me how suddenly my skin healed and there was not a hint of scarring, even where I had had skin splits and open sores. Hoping things begin to improve for you soon. PJ",
      "MessageIndex": 6,
      "PostDate": "20/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/773346",
      "Title": "help! Skin starting to blister and open... Lawgirl browniefranks"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 24, 2009 03:18PM pj12 wrote: On day 25 my skin became raw with open sores.  Day 28 was a Friday and by Monday morning the open sores had sealed over and no longer hurt, still tender.  I was amazed how fast it healed.  I had one day off while boost calculations were done, then began 8 boost treatments.  The boosts caused a good bit of pigmenting and rippling but no new sores. The boosts did have quite an affect on my nipple though, cosmetic, not sore.   I am now three days after treatment and everything is looking a lot better.  I actually wore a bra today!  It's amazing how fast things can turn around.  Good luck.  It's almost over :)",
      "MessageIndex": 2,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736428",
      "Title": "How long for skin to heal? Linda37 susan13"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 9, 2010 08:10PM pj12 wrote: I totally understand your fears. I have always been a person who took things in stride but radiation therapy undid me. But I was never in doubt I would tough it out. It is the standard of care and gives much better odds improvement than chemo in most cases. When I opted for a lumpectomy radiation became a done-deal. Mine too was to the left breast so the heart issue was a consideration. I did not get off on a good foot with rads. Measurements had to be re-done. The very first day the machine went down. The facility was way off schedule which caused long delays. BUT all the glitches got worked out. I learned to trust my team...it took some time. I did a lot of reading here and felt better about what was happening. My rad onc and the therapists were not good at explaining things to me but the women here filled in the gaps. I learned to speak up and complain if I thought things weren't right. I had 28 regular and 8 boosts. I didn't really blister badly until about # 25. I had one miserable weekend but was surprised how fast things healed. I had mild fatigue, indulged in daily naps but could have managed without them. My treated breast did not shrivel up  and the radiation tan faded gradually. I am now one year post rads and my tissue is pretty normal. My breast was quite firm until 3-4 months ago. Now it feels pretty normal, soft. I have a couple \"cords\" on the underneath side but they are slowly disappearing. The nipple is still paler but not too bad.  The treated breast is actually slightly fuller than the untreated side.  I froze on the table... just too cold! I dressed from the waist down like I was in Alaska instead of Florida! Two pairs of socks, etc. I took Xanax to help with the nerves but I still shook like a leaf. Somehow I could stop the shaking when I heard the machine turn on but otherwise I was a basket case. It helped me to hold something in my hands... I took a fuzzy hair curler and squeezed it. Once a week I took cookies to the therapists. it didn't hurt our relationship.  I learned which ones I preferred and arranged my appt time to get who I wanted.  I apologized for being picky but stuck to my guns. The squeaky wheel gets the grease! This was SO not like me... I always just go with the flow and never want to hurt anyone's feelings. But this was so different and life affecting! The number one thing is to feel like your facility and its staff is modern, careful and detail oriented. Ask how long the rad onc has been on staff, also the physicist and the dosimetrist. Experience matters! Be sure they confirm who the patient is on each and every visit... it is a basic protocol and shows they are being careful.   My best wishes to you.  Let me know if there is anything more I can say. pam ",
      "MessageIndex": 1,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/753895",
      "Title": "Is this the right course? redsoxfan pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 27, 2010 04:32PM pj12 wrote: Hi ....mom, You might get more response by starting a new topic... but here is my limited opinion: I did not have chemo but everyone says radiation is much easier to get through than chemo. It is inconvenient to have to go every day but that is a small price to pay if it helps. I am surprised your doctors aren't willing to make a recommendation. keep reading and  maybe  a new posting might help. Good luck. pam ",
      "MessageIndex": 19,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/753895",
      "Title": "Is this the right course? redsoxfan pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Aug 1, 2011 10:35PM pj12 wrote: k-lo, I'm sending you a private message as I don't want to turn this serious topic in to a bird watching thread. :) Marsha, I agree with everyone. This guy sounds like he could be dangerous. Furthermore, you don't need someone planning how your death is going to make their life better! Everyone should be rooting for you, not against you!",
      "MessageIndex": 16,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772508",
      "Title": "Vent - Hubby's friend mthomp2020 patoo"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 16, 2011 02:20PM pj12 wrote: Since your sister had a mastectomy, obviously the emphasis on looking for BC there will be reduced But she will still have mammograms on the remaining breast and perhaps ultrasounds or other types of screening on the MX side. This is not to prove she is completely recovered from cancer but to catch any new activity early. Unfortunately there is no \"recovered completely\" from breast cancer. Many women have preliminary work ups including cat scans and pet scans to be sure there has been no spread of the BC to other areas, like bone, lung, liver or brain. Some women who are at high  risk for metastasis have followup cat scans periodically. Many doctors do \"tumor markers\" looking for suspicious proteins in the blood. Routine breast exams are done and so is routine lab work. Most women are seen in follow up, at first, every three months, and with the passage  of time, less often. Any time something worrisome, different or mysterious occurs we are encouraged to check with our doctor. Some types of breast cancer have higher recurrence risk within the first couple of years ; other types of breast cancer can show back up 15 or 20 years later. The good news is that most people do not have a recurrence. But there is no way of knowing for sure what your future holds. No magic test that rules in or out recurrence.  There are clues, like grade, and tests like the Oncotype that make statistical predictions. But as is quoted on this site often, your risk is either 0 or 100%, you either do or don't.  Our news media and medical reporting seems to have perpetrated the idea that breast cancer is curable. The truth is that it is treatable and the treatment may or may not cure the patient but we have to remain vigilant for the rest of our lives. Best wishes to your sister and she is fortunate to have a loving and concerned sister. ",
      "MessageIndex": 1,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/771693",
      "Title": "Any test to identify the current body condition after radiation Vandhana hrf"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 15, 2010 12:48AM - edited Jan 15, 2010 12:50AM by pj12 My therapists  were all female.  There  was a lot of shifting me around but not really TOUCHING my breast.  They used a sheet under me to slide me a little one way or the other, sometimes pushed my ribcage or moved my shoulder.  Certainly no one ever touched the nipple area.  It got so I knew how to settle in place and there was less shifting around.  Nothing like as hands on as a mammogram! Biggest problem was that I was freezing cold.  The room was icy.  I wore double socks and long pants or long skirts.  Nude from the waist up.    You can do this!  Just show up and it will happen. :)  I thought it was very stressful but I survived and now it is just a memory.  Good luck. pam ",
      "MessageIndex": 3,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/746776",
      "Title": "Does someone literally have to touch your breast every day?? Raili Sido"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 2, 2012 08:16PM pj12 wrote: My onco score was 28 which was higher than I wished. But three doctors said no chemo and I guess I was glad? Certainly age was a factor, 62 at diagnosis. And 99% ER + so all my eggs are in the anti hormonal basket. Three years out now and doing well. Good luck!",
      "MessageIndex": 7,
      "PostDate": "02/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/784432",
      "Title": "58 y/o, Oncotype Score of 20, No Chemo Blessed58 shuf"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "pj12 wrote: I had radiation. I would do it again. I believe in it. But, honest to goodness, this article scares me to death! Pay attention, ask questions, be your own advocate. No one else is in the treatment room to speak for you. You can not be timid. Ask about the experience of the physicist and the dosimetrist. Ask about the therapists. Complain if you feel they are not paying attention. Refuse treatment if the machine goes down repeatedly. SURVIVE! http://www.msnbc.msn.com/id/35046121/ns/health-more_health_news/page/8/from/ET  \"Nobody told me there'd be days like this ~ Strange days, Indeed. \" John Lennon................... Treatment: Lumpectomy, 36 Radiation, Arimidex, now Tamoxifen Dx 3/3/2009, IDC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/747272",
      "Title": "Frightening NYT article on radiation TX pj12 MAGOB"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 29, 2010 02:45PM pj12 wrote: Mary, Interesting question. I see the risk as so insidious because you don't necessarily know the damage that can show up later, years later. Damage to heart vessels, lung fibrosis, sarcoma... are all known se's of NORMAL radiation dosage. Certainly those risks must be compounded if you are getting a higher dose or radiation to the wrong area. So these articles feature extreme examples of mistakes but how many of us were affected in lesser, long term ways? I'm thinking of asking to see the records of my treatment. What do you think they would say? Think I could learn anything? pam ",
      "MessageIndex": 25,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/747272",
      "Title": "Frightening NYT article on radiation TX pj12 MAGOB"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 21, 2011 04:28PM pj12 wrote: This is so unfair. Breast cancer should be a disease for old people! You have so much to live for and your body is young and strong. I am wishing you great results. My neighbor had a bone marrow transplant about 10 years ago for Stage IV breast cancer, mets everywhere. It has not been a popular treatment but She has done great and nothing slows her down.She is now NED.  She went to M D Anderson in Texas.  (((Hugs)))  ",
      "MessageIndex": 1,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767936",
      "Title": "stage 4 and I'm 29 with a new baby lindyw82 justjudie"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 22, 2010 10:24AM pj12 wrote: What a nice thread to give us all a smile! Thanks.",
      "MessageIndex": 16,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754398",
      "Title": "On a lighter note -this is all true pattih cwrightrn"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 21, 2012 06:18AM pj12 wrote: Please forgive me for posting in a Stage IV topic but I just wanted to say that those of you who have responded to sgupta's question have made a complicated issue clear and understandable.   The  experience and information the women of BC.org share here are invaluable.  Thank you all.",
      "MessageIndex": 21,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786140",
      "Title": "Best Treatment for Stage IV metastatic breast cancer sgupta EnglishMajor"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Aug 18, 2010 08:44AM pj12 wrote: A PET scan is actually kind of relaxing.  A sugar solution is injected in a vein and then you sit quietly and relax for about an hour while the solution moves through your body. If you have anything like Xanax it is good to take that to help you be calm. Finally you are scanned in a machine resembling an MRI but quiet :-) It was all very calm and relaxing... once I got over being nervous. Good luck! ",
      "MessageIndex": 3,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/756872",
      "Title": "PET scan on Friday Basia Basia"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Dec 4, 2010 01:10PM pj12 wrote: Hi Dianem, Which came first? I was dx'd with stage 1 IDC in March 2009. During radiation treatment my left arm shook uncontrollably but only when I was being radiated. ??? Then I started Arimidex and developed a left tremor when nervous or tired. When I switched to the generic anastrazole things got much worse. My walking was compromised and my coordination was terrible. The tremor became constant and my PCP, who had thought it was due to anxiety, began to suspect Parkinsons. I stopped taking Anastrazole and began to feel better right away. But still some tremor so  saw a neurologist who confirmed the diagnosis of Parkinson's. Started me on 25/100 Sinemet. I don't know if my improvement is due to stopping anastrazole or starting Sinemet but I am much better. I switched to Tamoxifen and seem to be tolerating it well. I exercise, walk 3 miles a day, and try to stay active. 2009 was a difficult year, BC surgery and both knees operated, so I wonder if somehow all that triggered the Parkinson's. Or maybe it was totally coincidental. ???   I am too new at this to have any advice :)  Just know that, in my particular case, Arimidex and anastrazole seemed to exacerbate my symptoms.   What is your history?  Wishing you well! Pam ",
      "MessageIndex": 1,
      "PostDate": "04/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/761529",
      "Title": "parkinson with stage 1 dianem dianem"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "May 28, 2010 06:25PM pj12 wrote: James Carville is the one who said it. He is given to outrageous statements,,,, but seems like his over-the-top statement kind of got O'Bama's attention. So his hyperbole worked. :-)",
      "MessageIndex": 9,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753256",
      "Title": "\"We're dying down here\" -- grr -- rant MJLToday konakat"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 29, 2010 02:53AM pj12 wrote: Mary, Thanks for the follow up article. This is just terrible. How do we know we were properly dosed? I wonder if our charts reflect reality. pam ",
      "MessageIndex": 22,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/747272",
      "Title": "Frightening NYT article on radiation TX pj12 MAGOB"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 4, 2010 11:20AM pj12 wrote: It is my impression that the \"standard of care\" following lumpectomy is to follow up with radiation. It would be hard to find a doctor who did not want to follow that protocol. When radiation is not an option, mastectomy would be advised. That still does not guarantee radiation would not be indicated if at all possible. The hormonal drugs are mainly to prevent a metastasis or a new tumor from forming in either breast. ",
      "MessageIndex": 4,
      "PostDate": "04/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/750762",
      "Title": "Why are Tamoxifen and Radiation BOTH necessary (for some women)? Raili idaho"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 16, 2011 02:58PM pj12 wrote: I had already had a stereotactic biopsy when I went to my breast surgeon for the first time. I spent well over an hour with him and  he told me a lot and answered a lot of questions. He wrote orders for CAT scans, blood work, x-rays... I can't remember what all. He set up a tentative surgery date based on the assumption that all my tests would come back negative for mets (and they did). I felt like he was moving fast and that pleased me very much.  I did have to initiate the subject of an oncotype test. I don't think he would have ordered one if I had not asked for it. He arranged for my referral to a radiation oncologist and to a medical oncologist and set up the appointments with them. I realize now that my treatment course was pretty standard so he knew what was going to happen to me and who I needed to see next.  What seemed unique and mysterious to me was routine to him and he and his staff got things rolling very quickly.  You learn so much in the first few weeks and months of this journey. As I look back it all seems a big blur now but at the time every little detail seemed so important. Thank goodness I was in the hands of someone who knew what to do!  Best wishes in your course of treatment. ",
      "MessageIndex": 7,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771698",
      "Title": "Do Breast Surgeons do anything at virst appointment kitty16 IllinoisNative"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Dec 10, 2009 06:15PM pj12 wrote: I just had a PET scan.  Was told to eat a high protein, low carb diet for 24 hrs prior, no caffeine for 8 hours, no sugar for 8 hours, no exercise for 24 hours, plenty of water before and after exam.  Regular meds ok morning of.  pam ",
      "MessageIndex": 3,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745202",
      "Title": "Preparing for a PET Scan chk8 clemson93"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 21, 2011 08:43PM pj12 wrote: tinanalabama, You're right.. NO ONE should get cancer! But, as an older patient (64), I realize how much harder you younger women with young children, jobs, and elderly parents to care for have it. My heart breaks when I read about women who are worried about not being there for their little children.  Where is my magic wand? I want to fix it!",
      "MessageIndex": 15,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767936",
      "Title": "stage 4 and I'm 29 with a new baby lindyw82 justjudie"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Aug 1, 2011 06:28PM pj12 wrote: K-Lo, Is your avatar a night heron? My pictures are so small it is hard for me to see details.",
      "MessageIndex": 11,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772508",
      "Title": "Vent - Hubby's friend mthomp2020 patoo"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 18, 2011 08:54AM pj12 wrote: Bonnie, Blessings on you for being a BC survivor for so long. Sure gives encouragement to all of us! Your DX date says 4-7-11 so does that mean you had a new episode? A recurrence? ",
      "MessageIndex": 629,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 6, 2011 10:46PM pj12 wrote: (((hugs)))) to Christa73",
      "MessageIndex": 683,
      "PostDate": "06/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 4, 2011 05:11PM pj12 wrote: I had lumpectomy (small tumor 1 cm) and 36 radiation treatments almost 2 years ago. My breasts were the same size before but the operated breast is slightly fuller and firmer now. Not apparent with a bra on. The surgical site is still darker and dimpled but it is in the upper outer quadrant so never shows, even in a swimsuit. I had read radiation often caused shrinkage but not in my case. I am just happy to have normal sensation and no lingering discomfort :)",
      "MessageIndex": 6,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/762882",
      "Title": "Breast appearance after lumpectomy Krix ruthbru"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 30, 2010 07:54AM pj12 wrote: Karen, My stats (see my Diagnosis line  below) are similar to yours except I have IDC, not ILC. I do not know if ILC demands a different treatment plan. My onco score was 28, sorry to say. In spite of that my three doctors advised NO chemo. Also page 2 of my onco report indicated I would not benefit from chemo. The reasons: My mitosis score was 1, indicating slow dividing cells that do not get much affect from chemo and I am 99% ER+ which means I would get a lot of benefit from an AI. So you need to talk to your doctors and hear them out. Btw, I am 62 yrs old. Good luck! pam ",
      "MessageIndex": 1,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/756032",
      "Title": "decisions decisions kira1234 kira1234"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 18, 2011 03:46PM pj12 wrote: Hooray !!!  You are an inspiration. Thanks for posting such a happy message.",
      "MessageIndex": 1,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771798",
      "Title": "I am 16 years out from original dx! 16 YEARS!!!!!! susan13 vickilf"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 16, 2009 08:06AM pj12 wrote: Love the T-shirt! Pam ",
      "MessageIndex": 4,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/740437",
      "Title": "Humbling Irishred Texas357"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "May 25, 2009 12:39PM pj12 wrote: My radiation oncologist listed lung issues as a possible but uncommon side effect of radiation. Keep asking for help and my thoughts are with you. Also I copied the following from this website.   Some breast cancer treatments may affect the way you breatheor the way your lungs work. You may notice that you're short of breath at times or have a cough that doesn't seem to go away. Some lung problems can be caused by blood clots that move into the lungs. This condition is called a pulmonary embolism and can be very serious. Breast cancer treatments that can cause lung problems:",
      "MessageIndex": 2,
      "PostDate": "25/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/734587",
      "Title": "lung issues after rads. rasquel Leah_S"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Dec 29, 2010 11:49AM pj12 wrote: Chris93, So sorry you are in this frightening place but I hope you will get lots of support from the women of this site. ((((((HUGS)))))))) Pam ",
      "MessageIndex": 580,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 9, 2011 10:38PM pj12 wrote: Kira, A friend of mine had a bone marrow transplant for breast cancer at MD Anderson something over fifteen years ago. Her sister was being treated at the same time and did not have the transplant. Her sister died and my neighbor survived and is doing very well. Even though bone marrow transplant for BC has fallen from favor, she attributes being alive to the aggressive treatment she had at that time. Who knows, but perhaps in her case it was the answer. She has had lots of complications but remains NED after all these years. And she is the most active, hardest working person I know!",
      "MessageIndex": 211,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 9, 2010 08:59PM pj12 wrote: I should have known you were in Boston by your ID!   You should get the best of care there. And  you will do great. Yes, it is me whining about not feeling strong. I don't think for a moment I have any radiation SEs now. No doubt it is the Arimidex ... one of its SEs is a general weakness. But I feel better after having my on line melt down and am back to fighting the good fight.    Let me know how things go for you. Are you having IMRT? Pam ",
      "MessageIndex": 3,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/753895",
      "Title": "Is this the right course? redsoxfan pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Oct 20, 2009 08:40AM pj12 wrote: Attempts to control the radiation field include IMRT (Intensity Modulated RT), IGRT(Image Guided RT), and Gating (coordinating RT with breathing pattern).  These are SUPPOSED to target the radiation more precisely.  I don't know how prevalent these systems are... it is what I had. About the lead shield for the other breast:  Does the radiation beam scatter as it goes through the air before it enters your body?  Or is it like a laser beam... focused to a point inside your breast, then ricocheting around from the inside?  If it is the latter, a shield would not help :(   As we say, \"the gift that keeps on giving.\" Pam ",
      "MessageIndex": 7,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742143",
      "Title": "Radiation scatter? linn56 jklls"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Apr 4, 2010 06:33PM pj12 wrote: And keep in mind, some women who have a mastectomy still have to have radiation due to close margins and other complications. It's not common but does happpen. pam ",
      "MessageIndex": 6,
      "PostDate": "04/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/750686",
      "Title": "Quitting rads to get mastectomy instead? Raili 1marmalade1"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 5, 2010 05:38PM pj12 wrote: I think they asked you to hum because they thought you did not know the words. :-)",
      "MessageIndex": 4,
      "PostDate": "05/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747887",
      "Title": "Had Me HUM during ultrasound msdmckee horsewing"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Nov 11, 2009 11:59AM pj12 wrote: No one is more anxious for reports than me!  I apologize all over the place but bug them terribly until I hear something.  Be polite but persistent.  Get one person's name and ask for them each time.  Cookies or baked item is a way to say thanks after the fact.   But my ace in the hole is that I always ask, when I go for the test, for reports to be sent to my PCP as well as whoever ordered the test.  His office knows me and will ALWAYS give me the results right away and over the phone.  They don't seem to have any reservations about telling me and I keep their confidence and don't tell the prescribing DR that I might already know.  pam ",
      "MessageIndex": 4,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/743680",
      "Title": "Dr. office check-in etiquette - question Mead31 ElaineD"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 2, 2010 01:32PM pj12 wrote: I an older, 62 at diagnosis. Oncotype 27. Three doctors said no chemo for me. Also my Oncotype report said \"chemo would be of no benefit.\" I was worrried to skip it. Kept asking why not. Finally it was explained to me that my mitosis rate  was a \"1\" which means slow acting cancer cells. Chemo does not work well on them, likes aggressive cancer cells better. So even though it still worries me I am glad to skip chemo for good reasons. I am 99% ER+ so onc says Arimidex is doing plenty for me.  I sure hope so! pam ",
      "MessageIndex": 2,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/747724",
      "Title": "Stage 1, Grade 2, ER+ PR+ HER-, Node-Negative, Onca 20 Chemo???? limegreen Plils"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 24, 2010 09:13AM pj12 wrote: Hope you had a good birthday inspite of medical care. Have you started rads? How's it going? pam ",
      "MessageIndex": 16,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/753895",
      "Title": "Is this the right course? redsoxfan pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "May 28, 2010 07:45PM pj12 wrote: It was explained to me that you only could do rads one time to the same tissue.",
      "MessageIndex": 2,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/753262",
      "Title": "is it possible to go through rads more than once? tovahsmom sweatyspice"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 24, 2012 08:52PM pj12 wrote: My mammogram that discovered BC was in March and six months later, shortly after my radiation tx ended, I had mammograms. For two years i was on an every six months schedule and then switched back to once a year in the third year. That's where I am now. After being watched so closely it has actually made me nervous waiting a full year. I never would have thought I would WANT a mammogram! Best wishes for a good report next month!",
      "MessageIndex": 1,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781578",
      "Title": "Mammograms After Radiation? rn4babies pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Dec 17, 2009 05:03PM pj12 wrote: I think the fear that you will not be there for your child as they grow up is universal and in every mother's heart.  Of course, a breast cancer diagnosis makes it more real.  But, no matter what happens you are there with that child.  Your genes, your DNA, your soul flows through and over them in every thing they say or do.  Distance, disease, even death cannot erase you from their smile or silly laugh, from the way they walk or dance, from the very essence of who they are. Just as you see your mother in little things you do, so will your child carry who you are in his genetic blueprint.   My heart aches for you and my prayers are with you.  What you give this little baby now and in the weeks and months and even years to come NO ONE can erase.  It will be with him even when he does not know it. Every moment is precious.  He will be here so soon.  And you will be with him forever. Pam ",
      "MessageIndex": 10,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745422",
      "Title": "Pregnant with Breast Cancer Pure DCMom"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jun 13, 2010 09:47PM pj12 wrote: redsoxfan, When is your start date? Just thinking of you and wishing you well. pam ",
      "MessageIndex": 13,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/753895",
      "Title": "Is this the right course? redsoxfan pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Sep 18, 2009 07:22PM pj12 wrote: I had lumpectomy and 36 radiation treatments.  I had no blood work during or after radiation.  I had some fatigue but not bad.  I think blood work is more common for women who have had chemo prior to RADS and Drs want to be sure the fatigue is not due to low white cell counts.  The fatigue is predicted and expected.  I napped every day and exercised by walking 1-2 miles a day.  I ate a high protein, low fat diet, supposed to be good for radiation treatment.  I found the process very stressful and mostly needed loving sympathy for the emotional turmoil more than the physical problems.   Your mom can make it through this with your support.  She is lucky to have you as her advocate. Pam ",
      "MessageIndex": 3,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/740570",
      "Title": "Extreme Fatigue And No Bloodwork Assigned For My Mom. prettypink bluedasher"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Mar 22, 2012 08:29PM pj12 wrote: Hi Julia, Is it possible your mother complained about some of the side effects of the AI and her doctor offered tamoxifen as an alternative? I was on arimidex for a little over a year but switched to tamoxifen when I could not tolerate the Arimidex any longer. In the past some women chose tamoxifen because it was cheaper but since most of the AIs are now generic that is not an issue. Bone loss and heart issues secondary to AIs might cause a doctor to change a patient to tamoxifen. Also AIs have been known to raise cholesterol levels. All of these drugs have to be prescribed in light of the general health of the patient. Tamoxifen, too, has its own set of problems. In the US an AI for ER+ women for five years has been the standard. Recently some doctors are starting a patient on tamoxifen for two years,then switching to an AI for three years. Some think this is not as hard on the heart. I haven't heard of doing an AI for two years, followed by tamoxifen for three years but why not? Your mom is fortunate to have you watching out for her.",
      "MessageIndex": 1,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/784542",
      "Title": "Tamox after 2 years with AI? Julebule Julebule"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 25, 2010 01:54AM pj12 wrote: Thanks Trisha. ",
      "MessageIndex": 2,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/747272",
      "Title": "Frightening NYT article on radiation TX pj12 MAGOB"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 25, 2010 02:08PM pj12 wrote: I just want everyone to know that I did not post this to scare anyone. Knowledge is power. I am going to copy the article and take it to my facility and ask them to share it with everyone who works there. I had IMRT on a  Valerian machine with no APPARENT ill effects. But on at least 5 or 6 occasions the machine  had to be rebooted while I was on the table waiting. I would not permit that again! Inconvenient as it might be, I would stop and reschedule. pam ",
      "MessageIndex": 10,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/747272",
      "Title": "Frightening NYT article on radiation TX pj12 MAGOB"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 22, 2010 09:41PM pj12 wrote: Arimidex is a great drug that reduces the risk of recurrence and metastasis AND also is shown to shrink mets tumors. It does not have the dangerous side effects of tamoxifen, like blood clots and uterine thickening.  Every time I take my pill I feel like I am being proactive in my fight against cancer. Yes, I do have some problems, probably due to Arimidex. But none of them trouble me as much as the thought (fear) of cancer coming back. I exercise, get plenty of sleep, take my supplements, eat healthy, watch my weight, and think positive. Good luck! pam ",
      "MessageIndex": 1,
      "PostDate": "22/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748750",
      "Title": "Arimidex LindaHatch Cowgirl13"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jul 3, 2009 05:58PM pj12 wrote: I had 28 regular and 8 boosts following a lumpectomy left breast.  I thought it would never end but it did!  I am 10 days post radiation now.  The radiation treatments never hurt but I found the whole process very stressful.  I was always anxious and tense... and I am never like that.  My friend had similar radiation and went to play tennis every day after her treatment!   I was only mildly red and/or irritated until day 25 then I developed open, gaping sores under my breast. I thought oh no... but over the weekend they healed over FAST.  On day 29 I started the boost which directs the radiation in new ways and tends to irritate the skin less.  I did develop a new \"burn\" on the side of my breast but it too healed fast.  The breast tissue is firmer, warmer (my husband can feel the heat through clothing when we hug!), and almost a red-brown color.  My nipple was normal looking until the boost... now it is splotchy and oddly colored but not sore at all.   The size of my treated breast is the same as before. I still don't know how that is possible as they removed a LOT of tissue to get clean margins.  The \"wire\" turned out to be not anywhere near the actual tumor at time of surgery.   Things I learned about radiation therapy: Don't mark your last treatment on your calendar yet.  There are holidays, days the equipment is down, and days when you are on the table but just for marking up.  All these things move your end date farther out.  Don't expect the radiation therapists to be chatty.  Mine were all business and that was fine with me.  I wanted them to be concentrating on what they were doing.  Find what ointment or cream works for you and use it liberally even if you think you don't need it.  I always showered before radiation to remove ointments.  To me, if there was a lotion residue on my skin, I thought the radiation treatment made my skin have a sweet burnt odor.  Probably my imagination but ???  Write down your questions to ask the radiation oncologist each week.  Too easy to forget what seemed important on Monday by Friday when you get to see the doctor.  Be patient if you have to wait for your treatment.  Sometimes there are reasons patients take longer than expected.  One day it was me that held things up! Get used to having magic marker lines all over your chest.  Eat well.  A good diet with increased protein is recommended by the American Cancer Society.  I added cheese to everything, lean meats and eggs, yogurt for dessert.  Try to not gain or lose weight.   Don't let anyone check BP on the arm on the side of your surgery.  Or draw blood, etc on that side.  I was told it increases chance of lymphedema. Wear loose comfortable clothes.  My facility was always freezing so I learned to at least be warm from the waist down!  I put on thick socks.  Ask for a sheet or blanket over your legs.  Sometimes, if I was shivering, they would lay a towel over my arms.  Take what other people tell you with a grain of salt.  Their experience is not yours.  Be kind to yourself.  Learn to say \"no, I can't do that right now.\"  If you feel tired, rest.  If you feel good, go shopping!  :) Keep the faith.  I thought it would never end and it did!  But don't expect to immediately feel normal.  There are delayed responses to the treatment so residual effects linger.   Good luck and I hope the time flies by for you. ",
      "MessageIndex": 4,
      "PostDate": "03/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736798",
      "Title": "Partial Mas w/Rad final result? karen2009 pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Nov 7, 2011 05:01PM pj12 wrote: Mostly the oncotype DX confirms what your doctors recommend anyway. In my case my oncologists said no chemo but I was nervous to skip any step that might give me a better long term outcome. I heard them but was not convinced. When my oncotype came back my recurrence risk was intermediate (28) which gave me about an 18% recurrence risk, but the report explained that my tumor had a low mitosis rate which makes chemotherapy pretty feeble against it. As my doctor explained, the possible side effects outweighed the less possible benefits of chemo. So the oncotype supported my doctors' opinions and made me feel better about my treatment plan. It's great if you score in the low category (no chemo!) and validating if you fall in the high category (you know you need to do all you can). If you fall in the middle it's not as clear cut and you and your doctors will have to discuss the pros and cons. Two and a half years ago when I had my surgery the company had a very generous policy regarding accepting one's insurance payment as payment in full for the test. I don't know if it is still that way or not. But they are very responsive to patient communication and you can contact them directly by phone or Internet. The company is Genomic Health and they have a very good website. Best wishes in the next few weeks to months. This is such a difficult time with so many unknowns. You have found a great resource here on BC.org.",
      "MessageIndex": 4,
      "PostDate": "07/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/777712",
      "Title": "Should we have the OncotypeDX test done? pupmom WaveWhisperer"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 4, 2012 10:57AM pj12 wrote: Please forgive me for posting in a stage IV forum but I just had to say how wonderful it is that your wife has you as her advocate. You are really a team and I know you will get through this difficult time and come out on the other side with a stronger love and appreciation for each other.",
      "MessageIndex": 3,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780434",
      "Title": "How do you change oncologists this AM? Chemo starts in 3 hours lovehertons lovehertons"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Jan 5, 2010 01:36PM pj12 wrote: MsQueen, I asked my surgeon to order the Oncotype and he did.  That way the results were back when I went to see the oncologist.  Saved time. Good luck. pam ",
      "MessageIndex": 5,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/746190",
      "Title": "doctor appointments zil PT63"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Oct 10, 2009 10:27AM pj12 wrote: I can't help with your question but... you might get more input if you post this question on the chemotherapy thread.  More women going through your situation would see it. Good luck and I hope you get some answers. Pam ",
      "MessageIndex": 1,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741839",
      "Title": "which treatment should I go with? lifeblossom pj12"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Aug 30, 2010 05:00PM pj12 wrote: In my case I only saw the radiologist once a week. I saw the radiation therapists every day so I felt staffing was very important. I asked about how long the dosimetrist and physicist had been on staff. Consumer Reports said they are very important to the process. I asked about equipment - how old or new it was. I, too, had IMRT and felt it was worth the additional time. There was a $200/a day charge not covered by my insurance (BCBS) but the hospital waived it, thank goodness.  I found the whole thing very stressful but survived !!!  You will too :-)  Good luck. pam ",
      "MessageIndex": 4,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757414",
      "Title": "How do you choose a radiation oncologist. JFV JFV"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Feb 25, 2011 08:24PM pj12 wrote: My experience was like Otter's but on the same day. The nuclear material was injected a couple hours before surgery. The female tech massaged my breast (that was weird), then took the pictures and marked the sentinel nodes.  My surgeon used the dye at the time of surgery to trace the drainage to the nodes and also used a small geiger counter to find the nodes affected first by the nuclear material. Yes, my urine was blue for a little while. The blue color was incorporated in my wound so I had a big blue incision for a month or two. Finally went away. Best  wishes. ",
      "MessageIndex": 17,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765445",
      "Title": "Question about timing of injection for SNB GabbyCal GabbyCal"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Dec 21, 2009 04:53PM pj12 wrote: I did not have chemo, just radiation followed by Arimidex.  At 6 months post diagnosis I had mammograms.  I see my medical oncologist now every three months.   She does CA15-3 and other blood work each visit.  That's all that would be routine but a spot was found in one lung during initial workup so I have had lung CT twice and one whole body PET scan... so far normal so won't have to have those again for a while I hope.  But I am really happy to have the tumor markers done even though some doctors don't like them.   Will have mammogram again at 6 month anniversary. But you must be HER - so maybe that makes things different?  I understand your anxiety!   pam ",
      "MessageIndex": 1,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/745699",
      "Title": "Follow up for Stage I's carcharm 1Lizzy"
    },
    {
      "AuthorID": "pj12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83466/profile",
      "Content": "Oct 14, 2009 05:50PM pj12 wrote: Dear Coolbreeze, I enlisted my internist, my PCP, to be my go-to-guy.  His office set up a lot of my appointments, often I would see a specialist the next day after the need arose.  He was great and I have all my reports copied to him and he is always ready to discuss them with me or initiate a new step.  The only time I felt like I was on my own was when I started my radiation therapy.  I had to really push to get my treatment started within the ideal window and once started three days in a row \"things\" went wrong.  I am a timid person but it is my life we are talking about!  So, when I saw the radiologist, I bravely said \"I do not have confidence that I am getting good, even adequate treatment.  And I am afraid these delays and problems could threaten my outcome.\"  Those were magic words!  Everything was different from that moment on.  Coincidence?   I don't think so. Unfortunately no one else takes your situation as seriously as you.  It's a hard lesson to learn, kind of disappointing.  But you have got to speak up.   Good luck... we are all there behind you! Pam ",
      "MessageIndex": 21,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742122",
      "Title": "\"Are you waiting for me to die, or what?\" CoolBreeze lexislove"
    }
  ]
}