{
  "AuthorID": "PJay",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212789/profile",
  "Posts": [
    {
      "AuthorID": "PJay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212789/profile",
      "Content": "Jul 7, 2016 08:35PM PJay wrote: I really enjoyed seeing everyone's pictures when I was going through chemo so I thought I'd share. This is 4 weeks post final chemo. I went back to work about 3 weeks later with no wig or scarf! It was mid July, hot, and I was tired of covering it up. I was real excited to have eyebrows! I was very nervous that it was going to be really gray, but it got darker later. I was 49 during chemo.   This is over 5 months after my last chemo. Still pretty short! I've heard that Herceptin can slow hair regrowth and I was getting it for a year.  This is a selfie from tonight. It's kind of messy--I've been to the gym and the makeup is mostly gone. But the hair is getting quite bushy. I have had it trimmed several times on the bottom to keep the mullet at bay. I am currently 13 months post chemo. ",
      "MessageIndex": 24187,
      "PostDate": "07/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "PJay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212789/profile",
      "Content": "Nov 8, 2015 02:10PM PJay wrote: I have lurked here for months. I had 28 rads with 5 boosts starting in August and ending September 21st. Reading everyone's radiation experience really helped. I also had a lumpectomy with a axillary node dissection in June. Now my treated breast is enlarged and feels heavy. It is slightly tender. I messaged my surgeon's office and the nurse said that this is normal after surgery and radiation. Has anyone else experienced this?",
      "MessageIndex": 1420,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "PJay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212789/profile",
      "Content": "Nov 8, 2015 04:08PM PJay wrote: Thanks Sloan--I will check it out! I really appreciate the advice",
      "MessageIndex": 1423,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "PJay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212789/profile",
      "Content": "Jan 1, 2016 02:42PM PJay wrote: Cardinal, I completed treatment in September and I also had some noticeable enlargement and heaviness. My MO said it was lymphedema that it's very common after a lumpectomy, Axillary dissection, and radiation. She sent me to a lymphedema specialist who has taught me some massage techniques and some kinesio taping. I've been wearing a sleeve for preventive reasons. I was advised to wear a compression bra or a very supportive sports bra. Spanx like garments also work well. Underwire bras may restrict the lymph vessels and make the LE worse. The LE has improved a little. My LE therapist lectured me on the importance of good posture during this time of healing from radiation",
      "MessageIndex": 2209,
      "PostDate": "01/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "PJay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212789/profile",
      "Content": "Jan 2, 2016 10:12PM PJay wrote: Happyhammer- I was completely finished with rads when my MO recommended Spanx to deal with lymphedema in my breast. The LE is hopefully temporary due to the rads, but My MO recommended these type of garments to provide compression. They actually feel pretty good, better than a bra. I don't know if getting the spanx on would be uncomfortable during rad treatment, but if tight feels good then it may work for you. Good luck",
      "MessageIndex": 2215,
      "PostDate": "02/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "PJay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212789/profile",
      "Content": "Nov 11, 2015 04:03PM PJay wrote: Just to follow up to my post about my breast swelling and heaviness-I saw my MO today and she said that it definitely is breast lymphedema. She is referring me to a lymphedema clinic and advised me to wear a very supportive sports bra that puts pressure on my breast and wear a spanx-like camisole to provide even more pressure. Evidently it's not uncommon after radiation and a lumpectomy",
      "MessageIndex": 1492,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    }
  ]
}