{
  "AuthorID": "PLUTZ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
  "Posts": [
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 4, 2009 12:51PM - edited Feb 5, 2009 11:49AM by PLUTZ jrgolomb. I'm with you. My hair hasn't fallin out yet but itches like crazy. I went to this salon that works with cancer patients. A wonderful lady. She couldn't bear to shave my head, so she gave me a pixie cut. Hate it but it will be gone soon. I ordered a wig from my hairdresser and she trimmed it and put it on my head. I love the style (pretty much how I wear my own hair) but I think it looks fake. My husband and daughters like it. I guess I just have to get used to it. I just wear it when I go out. When I'm at home I don't care. My husband still thinks I'm beautiful. My older daughter also had her hair cut really short. It is so cute, but she wears her wig that she ordered. I am also going for #2 Fri. I have been feeling so good and I dread feeling so bad again this weekend. Its the nuesta that i can't stand. I can't move for a couple of days. I have 4 trmts with this chemo, then I have 3 weeks off (yeah!) then 3 treatments of taxotere, then I will have a mastectomy sometime in May. It can't be June. Have too many commitments! After surgery I will have radiation for 5wks, Mon-Fri twice a day. That will not be fun. Had radiation yrs ago. It just zaps your energy. I don't know what will happen after radiation. Hopefully reconstruction. Take care. Sounds like you have a lot of support. I also have people from church and friends, family and GOD to get me through this and I have been keeping my spirits up. Haven't been depressed in days.",
      "MessageIndex": 999,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 13, 2009 09:36AM PLUTZ wrote: Hi everyone. Hope everyones doing well. I wrote yesterday that I was felling better, and wouldn't you know it, by afternoon I had a bad case of diarhea. I could not keep food or water in me. I just took a long nap and was feeling better by the evening. BerkleyKim-I'm glad someone is going to try and help you with your insurance. Thanks for thinking of my sister. I'm glad yours is able to come to town to be with you. My sister had planned on coming up. She had 4 days off but with the house and everything, shes not able to right now. Hopefully next month. Bev56-I was a little nervous about cutting the rest of my hair but yesterday, before i felt ill I took my hair shaver and shaved it off. it looks bad cuz I still have pieces of hair that  won't come out.  I wore a hat all day. My daughters wanted to see it but I was afraid it would scare them. lol. I'm going to try again today. Then I will just wear a scarf or hat cuz my head is cold. Got chores to do and I'm baking a cake for my husband and daughters for Valentines Day. I hope everyone gets to enjoy the weekend. Take care.",
      "MessageIndex": 1140,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 17, 2009 09:48AM PLUTZ wrote: jillyG-Hope you're feeling better. jas-man-I'm with you after the 2nd treatment. I really felt bad most of last week. Nausea, my aching body for 3 days, diareah most of the week, hemorroid problems. 3rd treatment is this Fri. and I am really praying that this one will be much easier. For those of you who have finally shaved the rest of there heads, yeah! It does feel much better when you wear the wig. Its not as uncomfortable, but I only wear it when I'm out. Otherwise when I'm alone I don't care, when my family is home I throw on a cap or knit hat. My husband still hasn't seen me bald. Neither has my younger daughter. She said it will make her sad if she sees me bald. My older daughter saw me only because she shaved her head one night when I was sleeping and showed me the next day. I just wanted to cry. Shes 18 and so supportive of me. She actually said it feels good with or without the wig. She wears a wig to work and school, but at home she doesn't care. Prayers for all of you to get through another week.",
      "MessageIndex": 1187,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 22, 2009 12:38PM PLUTZ wrote: Hi everyone. Thanks for all the feedback on my good news. I have a long way to go but I am staying positive. for all of you talking about teeth,I was told not to floss. I was told to gargle with salt water 4 to5 times a day. Which I don't. Maybe in the morning and evening. It does help. I get a swelling on part of my gum where I had a crown put in last summer. There is a gap between the teeth. It swells up occasionally. I ue Arm&Hammer toothpaste and use Toms mouthwash. It burns alittle but it is quite refreshing. I also use Toms deodorant. They have several fragrances that smell really good. Had my neulasta shot this morning. So far so good. Took a vicodin as soon as I got home and tried to take a nap cuz I had serious insomnia last night. I'm going to take it easy today. Its snowing like crazy here, so I will lay on the sofa next to my hubby and chill out all day. Bless you all and have a great week.",
      "MessageIndex": 1292,
      "PostDate": "22/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 25, 2009 09:27AM PLUTZ wrote: Hi everyone. Hope everyone is having a good week. I'm finally getting back to normal after A/C #3 last Friday. I actually got nausea last night and took a zocor. Slept ok but I am so zapped of energy. I've got to leave in a few minutes for an eye appt. My eyes have really been bothering me. Very itchy and watery. It will be nice to go out and run some errands. Like just about everyone else. my taste buds are all about gone, except if you believe this, I've been craving sweets and I can actually taste that type of food. I told my husband I had a taste for a 3 muskeers bar and he bought me that and a milky way. Good thing we're not supposed to be worrying about our weight! Although I have lost a few pounds. Thats only because nothing tastes good. Has anyone been having trouble swallowing food? The last few days, every time I take a bite of something, it won't go down and it scares me and my family and they always ask if I'm ok. I have to sit a few minutes before continuing eating. Well gotta run. All of you have a great day.",
      "MessageIndex": 1346,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 26, 2009 11:18AM PLUTZ wrote: hi jewels- hope everyone is feeling better this week. shockedat39- I also FLS all week. My stomach has been the culprit. Had a hard time eating. Nothing would go down. I'm feeling a bit better today but very tired. Glad your feeling better too. good luck with everyone  having a treatment this week. I actually can get back to normal till next Fri. yeah!",
      "MessageIndex": 1370,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 8, 2009 12:18PM PLUTZ wrote: Hi everyone. Well I finished #4 A/C. I had a low grade fever and my RBC was a little low but I was able to get my treatment. I got great news from my doctor. She couldn't feel any more lump. She is very happy the way the treatment is working. I didn't even have to get a neulasta shot this time. I was sooo glad. The nurse gave me some shot to get my energy going cuz I have been extremely tired but at least I don't have anemia. I should start getting energy in about 2 weeks. I also got a prescription for nexium because I am still having trouble swallowing food. Hope it works. About the taxotere- my doctor told me the side effects aren't as bad as the A/C, but from what I've heard from some of you, it can cause many ses. I was given a sheet with all the possible ses and my doctor said the serious ones would show up as soon as the chemo is injected. I was also given a prescription for Decadron to take a day before and day of treatment. Hope it works. My 1st treatment is Mar. 27th so I have 3 weeks to actually feel better. Hope everyone has a great week.",
      "MessageIndex": 1476,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 14, 2009 10:54AM PLUTZ wrote: hi ladies. hope all of you are doing well. the neulasta shot really did me in this time. I have never been in this much pain from it.Couldn't sleep last night. I'm achy from my head to my toes. I took vicodin but don't like the s/e. I'm really woozy today. Haven't had any s/e from the taxo yet. Maybe I won't. I need a break here.I'm just taking it easy today and try to take a nap before my DH and girls get home. lisalisa- congratulations! ddlatt- happy to hear your news. hope everything works out.",
      "MessageIndex": 1964,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 19, 2009 10:40AM PLUTZ wrote: hi ladies. I'm still feeling like crap.  I was up all night. Went to go to the bathroom and couldn't get out of bed to walk. My husband had to help me out of bed and I couldn't even walk with his help. I had to crawl.  I had diahrea really bad. My husband went to work for awhile and called my doctor. Told us to come to the office that morning. She was going to admit me and said she would really think about it. Wanted to see how my day would go. I was extremely dehydrated, had low blood pressure. I was fed 3 bags of saline. Had a cat scan cuz my doctor was worried about the pain in my stomach. That came out ok. I was there from 9:30-4pm. Met a couple of ladies that have been thru the ringer. The 1st one had ibc 2 years ago. Had a mastectomy. Cancer spread to her bones and liver. She went to Houston and had stem cell transplant. She is doing well. She goes in every week for something. I forgot what it is. Its for Her2+. Thats what I am and she said I should be on it, but I know nothing about it. She gave me a lot of good info to check out especially about going thru rads, and a double mastectomy. We exchanged emails and hope to stay in touch. I may run into her again. The other lady has had cancer 8yrs. Started with b/cv and spread to her bones and liver also. They are still trying to contain one of them. I didn't want to ask. Shes been thru alot..My doctor decided I was feeling well enough to go home.  YAY!Got a prescription for augmentin. I'm not sleeping. I'm waking up with diahrea.Hopefully thats taking care of any infection I have. I have no appetite. My mouth is horrible. Is that what thrush is? Its very scaly and sore and everything tastes awful. So I'm taking it easy today. Its supposed to be 62. I may get outside. I was out most of the day yesterday. I was feeling ok. It ws 72 and beautiful .My DH and I went to a nursery and bought some bushes and grasses to plant and I sat outside for awhile. My younger daughter and I met with my older daughter when she got her dinner break and got something to eat., but I didn't eat, got a milkshake. Then I dropped her off and went to rent movies. I had to leave my daughter cuz I had to find a bathroom asap. This diarhea sucks. Went home and then I was too tired to watch them, so today will  be good to do that. On the positive side, I swear I'm growing hair. There are a few strands off the nape of my neck that weren't there before, also around my ears. I actually went out with just a baseball cap on yesterday. I felt strange but I am sick of my wig. Anyway, hope you all had a good weekend. I just hope I'm better by tomorrow.",
      "MessageIndex": 2042,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 19, 2009 09:46AM - edited May 19, 2009 09:47AM by PLUTZ ladyjane54-I'm with you. I feel like I'm the last one on this board. My last treatment is June 12th. I haven't even had surgery yet. That will be in July sometime. I won't get to be on the rads boards. looks like i won't get rads till Aug. as for the eyelashes, I have none and it does feel like I'm crying constantly. I dab my eyes constantly and they also itch really bad. My eyebrows are about all gone. A couple of hairs left. I've been able to color mine in pretty well. You can barely tell their not real. I hope all of you have a good week. Fri. is my 3rd treatment, 1 to go!",
      "MessageIndex": 2371,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 13, 2009 09:21AM PLUTZ wrote: Thankyou jewels! I am done with CHEMO! Last day of steroids! 1 more neulast shot! I'm starting to feel like a normal person again. I just need to get thru this next week with little or no s/es. I have to make an appt. in the next week or so for an MRI and mammogram. Hopefully everything will be ok. Phase 1 over, phase 2 soon. How soon does the hair and eyelashes start growing back? ladyjane54 and Patti- you too are ending the home stretch. I never thought this day would get here. Been going at this since Jan. I just have to get thru the surgery and rads which will go on thru Sept. sometime but thats ok. I made it this far. Good luck to both of you. everyone have a great weekend. I'm going to get outside this weekend. Supposed to be nice, maybe a chance of rain. Have lots of things to do.",
      "MessageIndex": 2590,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 25, 2009 09:01PM PLUTZ wrote: Hi ladies! Well its been 6 days since my surgery.I'm feeling good. I had an appt.with my rad dor. on Fri. My pathothology report was good. 3 nodes had very tiny cancer cells which the radiation will take care of and there was a couple of cells found on the skin surface ( which is what inflammatory bc is) so I will have an extra week of radiation just on that area.I am scheduled for 5 weeks, 2 times a day starting  in about 3 weeks. I have an appt Tues with the onc. dr. and my rad dr. and my surgeon to determine when i will start. I'm hoping to get the drain out then. I had to go to the hospital yesterday because my drains were clogged but my doctor took care of that. I hope everyone has a great weekend.",
      "MessageIndex": 2952,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 4, 2009 09:26PM PLUTZ wrote: Hi ladies! Well finally got my drains out today but I still have fluids. Have to go in next Mon. to be drained. Fee pretty good except my arm is really bothering me and my drs. nurse told me I will have to see a physical therapist because the exercises aren't working for me. Its really hard to do. I will be leaving for W.V tomorrow to visit my sister whom I haven't seen since Christmas. I hope all of you have a great weekend and I will catch up when I get back.",
      "MessageIndex": 3008,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Nov 25, 2009 09:30PM PLUTZ wrote: Hi Jewels! Haven't blogged in awhile. I'm glad everything is going well with all of you, Had my 3 month checkup with onc. last week. Went very well. Blood work is fine. All my meds have been working without much side effects. The ony thing I'm concerned about right now is I have been getting dizzy spells. Had my blood pressure checked and it was fine. Does menopause cause this? I'm still geting PT for my shoulder. Its still not right after 3 months. Has anyone else had PT that long after surgery? Anyway, all of you have a great Thanksgiving and we do have alot to be thankful for. God Bless All of you.",
      "MessageIndex": 3330,
      "PostDate": "25/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 3, 2010 11:45AM PLUTZ wrote:   Hi ladies.  Well I had my CT scan this morning. Hopefully its nothing. If I don't hear from my doctor, I should assume everythings ok. Sat. I took my dog for a visit to a kennel. The girls said she can't be boarded. She's too temperamental with the other dogs. She is a Silky Terrier. A little dog and she is so aggressive with dogs. I was given the alternative to have an in home sitter when I go on vacation. I think my dog will be much happier. I have my appt. Thurs. with the plastic surgeon. Can't wait to see what my options are regarding reconstruction.",
      "MessageIndex": 3613,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 9, 2010 02:02PM PLUTZ wrote: hi ladies. Well I got home Sat. Couldn't move around much. I'm doing better but have to limit my activities. I'm not so achy anymore but really stiff. Its very hard to sleep. I've been propping up pillows just to get comfortable. Anyways, the surgery went well. My left arm is so bruised from ivs and blood being taken. One day 3 nurses tried to find a vein and they ended up getting a resident to find one. Then I had a low grade fever for a couple of days. My wbc was low and I almost had to have a transfusion but didn't have to have it. I have this binding wrapped around me and the nurses didn't understand why I had to have it on after the surgery, so they removed it and the doctor told them I had to keep it on. Its very tight. It doesn't help that I'm bloated and constipated. I have 3 drains. 2 are only draining a little bit now so hopefully they will be removed soon. I'm still waiting to hear from the dr. office for a followup appt. A home nurse stopped by today and said everything looked good. I'm glad yu are all doing well. Hang in there Brenda. Take care ad I'll post soon",
      "MessageIndex": 3739,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Sep 8, 2010 01:20PM PLUTZ wrote:   Hi ladies. Happy belated birthday Ladyjane. Well I'm feelling much better but I still end up on the sofa in the middle of the night. My back gets sore and stiff. I had my dr. appt. yesterday and got my  2nd injection. The dr. didn't give me much because I've had this leakage where he put in my implant. But I'm doing good. Still don't have much energy. I was hoping that would pass. I'm doing the Susan G. Komen walk Sat. but I have a feeling I might only be able to do the 1 mile, but thats ok. Its all for a great cause. I'm excited. Have a great week.",
      "MessageIndex": 3775,
      "PostDate": "08/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Dec 1, 2010 02:04PM PLUTZ wrote:   Hi ladies. I hope all of you had a nice Thanksgiving. Mine started out bad. My pumpkin pie burned on the edges, the no bake pie got mixed up wrong. It was more like mousse but still tasty. I was trying to make a grreen bean dish my mom used to make and it didn't turn out the way I wanted so I turned it into a greenbean casserole and last but not least my turkey was still frozen inside but in the end, my dinner was delicious. I'm glad everyone is doing ok. I had t see a dr. about a week and a half ago. My right side was hurting for a few days, so I finally made an appt. She was concerned it was my appendix so I hadto get a CT scan. I had to drink 2 bottle o barium. I thought I was going to be sick. Anyway, everything was ok. It was just a UTI. I see my onc. Dec. 21st for my 3 month. I'm feeling good, I'm still going through my breast expansion. I see the dr. next week. Its just not expanding to the size I want so I may just keep what I have and plan on having my implant in Jan. or Feb. Have a great week and I'll stay in touch.",
      "MessageIndex": 3894,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Dec 7, 2010 01:54PM PLUTZ wrote: Hi ladies! Congrats Patti. What a wonderful new year you will have. Patti and jillyg- Good luck on your exchanges. I just got back from an appt. with my surgeon and going forward with my exchange also. I'm schedeled Jan. 7th. I'm also getting my left breast reduced. He said its an easy procedure. I'll be a little sore in my real breast. Which implant are you getting? I think I'm getting the silicon gel versus the saline. I have to  read my materials. I will stay in touch and let me know how it went.",
      "MessageIndex": 3905,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 18, 2011 12:51PM PLUTZ wrote:   Hi ladies.  Well, the swelling is finally going down but my boob looks really bad.Its saggy and I thought my dr. was going to lift it up. I guess I'll ask him when I see him next week. My implant is ok, but I am so much smaller than I was.The dr. said he put in the largest implant but the radiation scarred alot of the tissue so it couldn't expand any bigger. So right now, I'm lopsided. Good thing I can't wear a bra yet, still wearing the surgical. Well have a good week and I'll keep in touch.",
      "MessageIndex": 3950,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 16, 2012 02:05PM PLUTZ wrote: Hi ladies. Thankyou for all your thoughts. I have not been feeling well. The cough seems worse and it makes my body ache. I sleep ok as long as I take the sleeping pills. I really don't like taking them, but if I don't I lay awake and get panic attacks. Reiki sounds so nice. Someone mentioned me to get a massage, but I have so many scars, I don't want to do that. About the nipple thing. My dr. mentioned it only once, but I decided not to do it. My breasts are uneven and I really don't care at this point. I have a dr. appt. tomorrow.  I hope she has good news for me. I will let all of you know whats going on. Hope your all doing good.",
      "MessageIndex": 4187,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 3, 2012 12:16PM PLUTZ wrote: My back hurts because I have to sleep propped up  because I'm still coughing. I'm starting to feel better but I'm nauseus again. can't keep any food down. I just want to feel normal again. I haven't driven in over 2 wks. I was able to get a handicapped placard because I can't walk very far. Still too weak. I am so thankful for my husband and daughters that have been helping me out. Also a friend brought over some homemade soup. Unfortunately, I couldn't keep it down. I'm just taking it day by day because I know I will get better. I think of all of you and pray everything is good. ",
      "MessageIndex": 4200,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 22, 2012 10:45AM PLUTZ wrote: Hi ladies. Its been a heck of a week. Last Thurs., ended up in the hospital again, but only for 3 hours. was dehydrated again and had a bunch of tests done. All came up normal, but I was not feeling well. Picked up 4 prescriptions for different ailments for nausea, coughing. was given an inhaler. I still have breathing problems. I was feeling alot better over the weekend. Yesterday, i had my checkup with my dr. They did an oxygen test and it was only 85. I could barely walk the hall. So now I have an oxygen tank in my home. Don't know how long I'll need it, but I'm glad I have it. I was given a portable one in case I needed it when I was out doing errands, but I don't think I will need it. I'm scheduled for another CT scan and a Pet scan tomorrow to see if the meds are working on the cancer. I'm praying they are or I'm going to have to have chemo. UGH.",
      "MessageIndex": 4206,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 26, 2012 11:47AM PLUTZ wrote:   hi ladies.  I'm not feeling too bad. Still get the headaches and dizzy spells. I haven't used my oxygen in over a week but i still have shortness of breath when I go up the steps or overdo things. well i woke u this morning and Im losing some hair. I found it first down under if you know wat I mean so I thought I would comb my hair and sure enough, a few strands came out. I was told not all women would lose their hair. Hopefully it won't all fall out. I will let you all know how my treatment goes next week. Have a good week",
      "MessageIndex": 4226,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 29, 2012 01:51PM - edited Aug 29, 2012 01:53PM by PLUTZ Hi Jewels! I'm so sorry i haven't been in touch. it has been a very busy spring and summer. We moved into our new home in April and a day later I was in the hospital. It has been a rough ride. I had really bad side effects from the chemo so I was taken off of them in May. I was in the hospital twice in 3 wks for my heart rate, pulse rate  and I can't remember what else. I was also dehydrated. i was in the hosp. for 3 days the first time and 2 the second time. After the second time, i could barely walk. Was told it was side effects from the chemo.I had a physical therapist come to my home, i had a walker and a transport to get around. I still use the transport if I have to do a lot of walking. My left leg still has not healed. in May when i was starting back up on the chemo, my blood count was off so my Dr. took me off everything and told me to go home and heal for a few weeks.  i was not feeling well the first few weeks, but I started gaining strength and began to walk better and was able to drive. Then came news last week that i did not want to hear. i had a petscan and they found fluid in my lung once again which means either the cancer didn't clear up from the chemo or it came back and they also found a spot on my liver. So I see the dr. next week and I'm only going on the xeloda for the time being and hope it works. I'm starting to  cough and run out of energy again. But i have had good things happen this summer. My baby graduated from high school. We gave her a graduation party. Last Thurs. she left for Kent State. She is studying child psychology. I'm so proud of her. What a zoo moving her in. She had a fun filled weekend with lots of activities and she likes her roommate. Thats a good thing. She'll be coming home this weekend. My older daughter is doing well. She's working 2 jobs but she likes both of them. Well i will stay in touch. I didn't get a chance to read whats going on, but hope all of you are doing well. God Bless.",
      "MessageIndex": 4253,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 19, 2009 01:56PM PLUTZ wrote: ddlatt-is that a prescription drug? After what I went thru last week, I'll try anything. I was in pain the whole week but was told the taxotere also can cause pain. This was the worst so far.",
      "MessageIndex": 2048,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 1, 2009 02:00PM PLUTZ wrote: Hi ladies. Had #2 taxotere this morning. My doctor lowered the dosage because I had such a hard time with it last time. Hoping the s/es  won't be as bad. Feel pretty good today. Tired. On the decadron thing. Was up till 3 in the morning. Managed to get 3 hours of sleep. Was going to take a nap but I don't seem so tired at the moment. I like taking my nap after dinner. Go in for the neulasta shot in the morning, so my weekend is pretty well shot. Oh well, its supposed to be a chilly weekend. Catching up on some shows I taped. Went to an artshow at the mall Thursday evening for the high school students. My older daughter had two of her paintings on display. I am so proud of her. Shes attending college in the fall to study art therapy. I think she will do very well. Well, going to get some rest. Hope all of you have a great weekend.",
      "MessageIndex": 2197,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 10, 2009 07:43AM PLUTZ wrote: Hi  ladies! Yes my last chemo is Friday! I didn't think it would ever get here. Its hard to believe I've been going thru all this since Jan. I'm so glad alot of you are almost done with rads. I won't start those till Aug. sometime. I'm not sure if I told all of you, but my surgery is scheduled for July 17th. The surgeon said I would have to wait 4-6 weeks for rads. Did all of you have to wait that long? I was hoping all this would be over sooner. Anyways, I'm rooting for all of you to get back to normal. I also have not been wearing my wig. I wear a baseball cap everyday, even when I'm out. Don't care anymore. If people want to stare, so be it, but I really don't notice anyone doing that. I swear my hair is growing a bit. I have a couple of hairs in the front that are longer than the rest. the rest of my hair looks gray and dark. It will be interesting to see what it will look like when it grows out. Well gotta run my daoughter to school. 2 days left for her. My older daughter graduated this past Sat and had her party Sun. Had a great time and the weather was beautiful. Take care and I will let you know how my last treatment went.",
      "MessageIndex": 2571,
      "PostDate": "10/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 30, 2009 10:00AM PLUTZ wrote: Holtbolt- So happy for you and MAX. I'lll have to tell my DH. He is a huge fan of Aerosmith. He has everyone of his CDs. I am almost 3 weeks out of chemo and like some of you, I  still get tired very easily. My legs still bother me and my eyes are still very teary. They drive me nuts. I actually have blisters on my eyelids from rubbing them with tissue. I'm going to ask a pharmacist what I  can do about it. I'm getting closer to my surgery date. Getting nervous. Can any of you tell me what to expect when I get a mastectomy?",
      "MessageIndex": 2751,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 28, 2009 09:25AM PLUTZ wrote: JillyG-congratulations on your walk. So proud of you. I manage to walk a mile around my neighborhood but I'm getting there. My energy is getting better. I love your hair. Like BerkleyKim, my hair is growing in gray with black roots and I have dark brown hair. It will be interesting to see what it will look like after it grows a couple of inches. I then will see if I need to color it. Well I'm off to see my onc. and rad doctor. Couldn't see my surgeon today. Made an appt. for Thurs. My drain is still draining after 11 days, so he wants to see me before he goes on vacation. Ladies, have a nice day.",
      "MessageIndex": 2975,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 31, 2009 09:40PM - edited Jul 31, 2009 09:44PM by PLUTZ Hi ladies. Well went to the dr. yesterday hoping to get the drains out, but no luck. I'm still draining too much. I have an appt. Tues. to have it out cuz I'm going to W.V for a few days to see my sister. I will have to go back  and get checked for any fluids left in me. Its such a pain walking around with this and trying to hide it. Also its its setting back  my rad treatments.Anyway, have some good news. I don't have to get genetic testing done because the drs. think my bc was caused by all the rads I had years ago from the Hodgkins that I had. That was a relief. I may have to get tested for the ovaries because my grandmother passed away from ovarian cancer but I don't know when that will happen. I am also a good candidate to enter a clinical study for Bisphosphates for 3yrs. I will let them know next week that I wam interestested. The study is closing for 6 months so the deadline is Aug. I'm hoping it helps.Other than that, I'm feeling good except my arm is still sore. I'm supposed to get a therapist but my home nurse said my insurance has to approve it and hasn't heard anything yet. The exercises I'm doing really hurts but I need to get my arm back to normal. Misty- I will be praying for you and Malcolm and hope everything works out. lisalisa-I will be praying for you as you recover from surgery.Is this something that had to be done or you decided  to just do it? I am so sorry to hear about your friend. I will be praying for her family. jillyg- hope you have a great vacation. I envy you. I won't be going anywhere anytime soon. All of you have a great weekend.",
      "MessageIndex": 2994,
      "PostDate": "31/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Sep 1, 2009 11:54AM PLUTZ wrote: Hi ladies. Sorry I haven't been on an a while. Its been a crazy week again with doctors  appts. Started rads yesterday, twice a day and also physical therapy. I was exhausted. I only have to go to physical therapy once a week and do exercises at home. Other than that I'm doing good. My eylashes are coming in good, my eyebrows are coming in. My hair is another story. Still short, about 1/2 in or so. jrgoglomb- sorry to hear about your dd s test. I couldn't even look when my dd took hers 3 yrs ago. I had my other d watch, She did pass the 1st time. Its funny how we are talking about our kids. My oldest dd started college last week and likes it alot, not the homework so much. She likes the freedom in between classes. She starts anywhere from 8:30 to 10 in the morning and is done at 2:45 everyday but Friday she has no classes. My other dd started 10th grade yesterday and likes it ok. Shes on the quiet side so I'm hoping she makes some friends this year. renrel- its nice to hear your still doing the Reiki. I was just told today after my rads that there is a retired nurse there that does massage and Reiki and that since I'm a patient, that I get 10 free treatments, so Isetup 1 appt. to see how it goes. Was told she is wonderful at it it. Its free, so why not? Well gotta finish housework and then on to my afternoon rads and then my family and I are going out to dinner. Have a great week.",
      "MessageIndex": 3097,
      "PostDate": "01/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Sep 22, 2009 12:53PM PLUTZ wrote: Hi ladies. Well had a checkup with my onc. today and everything is looking good. Asked about a recurrence anytime in the future and she said my treatments went so well, she said it would be a very low percentage in the next ten years. Having had inflammatory cancer, thats a big relief. I have to set up an appt. for a bone density test. I'm doing well on the clinical study. Can't remember what I'm taking, lol. My knees are achy but that was expected. I'm on week 4 of rads. Its going well. No side effects. 2 more weeks after this week and I will be done! Then I will start on Tamoxifen for 2 yrs. Its truly how amazing all of us made it through this year. My cancerversary isn't till Jan. 2, but what a year its been. Sorry to hear about the lymphedema some of you have. I thought I was going to get it cuz my arm was sore for awhile. Mine was because of the surgery and I'm still getting physical therapy. Can't raise my arm up all the way yet. hopefully soon. lisalisa-good to hear from you. I am so glad everything went well. everyone have a great week",
      "MessageIndex": 3174,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Oct 13, 2009 12:13PM PLUTZ wrote:  Oh and Vitamin B-complex in the morning!. whew!",
      "MessageIndex": 3235,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 17, 2010 02:07PM PLUTZ wrote:   Hi ladies. I'm glad your all doing well. My 1yr being cancer free is coming up. It's so hard to believe what we all went through last year. I had peach fuzz  at my daughters graduation. Now I have wild hair that I am planning on having  trimmed this week. My daughter has a friend thats mother had breast cancer a couple of years ago and it came back. It makes me said and I'll be praying for her as she goes through chemo again. Ihave my reconstruction scheduled for Aug. 4th. I can't wait. I didn't realize it takes 6 to 8 weeks. And that doesn't count when I go back to get my breast reduction. Oh well, can't wait. Tired of wearing this prothesis. Its going to be hot wearing it this summer especially when I go on vacation to Albuquerque. Have a great week.",
      "MessageIndex": 3631,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 3, 2010 12:12PM PLUTZ wrote:  Hi. Thankyou for all your  good wishes.Had a sleepless night worrying about tomorrow, but it will be over soon enough. I am having my surgery At University Hospital. Its a wonderful place. The doctors are amazing. So hopefully I won't have to stay 3days. I'm still waitng on a call back from te doctors office on what time to be there. I got a call from the hospital and th nurse thought that I would have to be there between 5am and 6am. Ugh  sure hope not. I will let all of you know  when I get home how everything went.",
      "MessageIndex": 3728,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 16, 2010 12:55PM PLUTZ wrote:                  Hi ladies.  I'm doing ok. I'm really sore from these drains pulling. i have a dr. appt. tomorrow. Hoping they will come out but I still have a lot of drainage from one of them. But I'd be happy having 2 removed. I can barely move around these last couple of days. I'm glad to hear everyone is hanging in there. Thats all we can do. I forgot to mention the last time I was on that my husband signed our family up for the Susan G. Komen race on Sept. 11. He's running the 5k and my DDs and I will do the walk. I can't wait, but I need to get my strength back and start walking a bit more. Its coming soon. Also I am picking  up my new car  Fri. We are having a sunroof installed.  We bought a 2011 Hyundai Tucson. I love it. Can't wait to drive it. Have a great week and I'll stay posted",
      "MessageIndex": 3749,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 5, 2011 01:25PM PLUTZ wrote: HAPPY NEW YEARS  to all of you!   Nothing but good wishes for all of you for a new year. I'm finally getting my exchange this Friday. Can't wait. I'm not even nervous. I did have a scare the other day. I had my 6month CT scan and the dr. found some new nodules on my lungs. The nurse called me and assured me its probably nothing but I have another CT scheduled for April. Also, I'm seeing an orthopedic surgeon for my shoulder. Both my drs said its not right. Its not dislocated but its leaning so I'll find out what has to be done with that. I thought I would start the new year with a clean slate and here I am again, seeing another dr. Oh well. Have a great week and I'll stay in touch.",
      "MessageIndex": 3939,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 28, 2012 10:18PM PLUTZ wrote:  Well got the news from my scans. Some of the tumors have disappeared but now I have new ones. One between my heart and diaphram and one on my right lung which is why I have the shortness of breath and thats where my pneumonia was. Have an appt. Fri. and my dr. says I have to do chemo. I've been on oxygen for a week. Don't know how long I'll be doing that. It just seemed like I was finally getting better and here I go again. I'll find out more Fri. and I'll let you all know whats going on.",
      "MessageIndex": 4210,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 5, 2012 01:49PM PLUTZ wrote:   Hi ladies. no treatment this week. my blood counts were too low. i go tomorrow for blood work because i have a dentist appt. Mon. but if the counts are too low, can't get my teeth cleaned. I'm scheduled for my next treatment next Tues.",
      "MessageIndex": 4228,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 11, 2009 10:13AM PLUTZ wrote:  Good morning ladies. Sorry I didn't blog in to wish all of you a Happy Mothers Day. I was in the ER all day on Mothers Day. I mentioned last week I wasn't feeling well. Very dizzy and shortness of breath. Talked to my onc. Fri. and she said if I didn't feel better Sat. to go to an Urgent Care Center. So I did. They took a bunch of tests and said I had a respiratory and urinary traxct infection, gave me 2 prescriptions and sent me home. I felt like crap all day Managed to take some pics of my daughter and her date for prom. She looked beautiful. Tried to lay down for awhile. I felt terrible when I woke up Sun. Called the answering service (my onc wasn't on call). A doctor called me about 15 min. later and told me to get to the ER. I didn't want to go cuz it was Mothers Day and we planned on cooking on the grill. So I woke my daughters up. They had gifts for me. My older daughter got me a necklace and earrings and a gift card to ULTA (hope I can use it sometime soon, no lashes to work with). My younger daughter painted me a ceramic piece that said mother on it and she hand stitched me a quilted lap blanket. She's only 14! When I read the cards they gave me, I broke down and cried, knowing that I may be admitted to the hospital. I had told them it might happen. That was the first time I cried since finding out about my bc in Jan. I just got so emotional. So I got ready and when they were getting dressed, I was waiting in the dining room with my DH and broke down crying again. I'm just tired of feeling like crap after I have a treatment. I know I only have 2 more to go, but it seems like I get sick after each one.Anyways, went to the ER and had a lot of tests done, blood ,ekg, cat and everything came out normal. My wbc were very high and blood pressure very low but they put me on saline and I was there for 4hrs and guess what? I was dehydrated again! That was all that was wrong with me.I was able to go home. Didn't cook out. I was drained, so we had Mr. Hero for our dinner. LOL . I'm feeling much better today. A little weak, so I'm going to take things slow. As for the nails. my toes hurt alittle. I was taking polish off the other day day and they are very tender. My fingernails are ok so far. Hope all of you have a good week.",
      "MessageIndex": 2293,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 12, 2009 08:23AM PLUTZ wrote: good morning! I am feeling much better today. I'll be able to run some errands. I envy all of you starting rads. I have a ways to go for that. I had radiation treatments years ago when I had Hodgekins disease. Its not bad going through it. The s/e are minimal. Unless its changed over the years. I had a little nausea, the chest area will redden (not like a sunburn), it really doesn't hurt, hairloss ( we don't have to worry about that, do we!), no appetite, and of course, fatigue. Thats about it. Right now, my schedule is to get  25 treatments, 5days, twice per day in low doses, since I went thru rads, they don't want to give me the full amount at one time.Good luck to all of you. you'll do fine. I finally lost the rest of my eyelashes. My eyebrows don't have much left either. A few on the inside. The only makeup I manage to wear is eyeliner. I tried filling in my eyebrows too.I just kind of blend it in with the hairs that are left and then smudge it. It didn't look that bad. All of you have a nice day.",
      "MessageIndex": 2306,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 3, 2009 10:38AM PLUTZ wrote: Hi ladies. I'm hanging in there. Counting the days till my last treatment. 9 days to be exact. I have a consult with the breast surgeon tomorrow. A little anxious. Don't know what to expect.   Getting ready for my daughters' graduation Sat.There's 800 graduating. Can you believe that? They go to the largest school in the state and our citys population is a little over 50,000. Her party is Sunday and I'm getting bummed because the temp is only supposed to be in the 60's. We rented a canopy, table and chairs but no tent. It better not even rain. I have no room in my home for 40 people. I'm praying for nicer weather. I wish I could respond to all your posts but I have no idea what you ladies are talking about. Thats why I feel like the last one left. I wish all of you a good weekend.",
      "MessageIndex": 2520,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 4, 2009 10:25AM PLUTZ wrote: HAPPY 4th of JULY everyone! Holtbolt- I 'm sorry to hear about the concert getting postponed. Hopefully there will be a rescheduled date. I'm glad you had a good time at Kings Island. Never been there and I live in Ohio. Plan on going to Cedar Point next week but my legs have been so sore. I want to do something with my family before my surgery, by the way its Fri. July 17th. I hope everyone else is doing well. The weekend is supposed to be really nice. We're having our cookout tomorrow. Have a great weekend.",
      "MessageIndex": 2781,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 19, 2009 08:56AM PLUTZ wrote: Hi ladies. Well my surgery went well. Came home yesterday afternoon after waiting 2 hours for my paperwork and prescriptions. I feel pretty good. My arm hurts but I guess that was expected. I've just been pinning my drain underneath my shirts. Its noticeable but nothing I can do about that. The hospital is sending me a home health aide starting today and for this week to change my dressings and check the drain. Were any of you depressed after having your surgery? Maybe it hasn't hit me yet. I guess I'm just relieved that I'm almost done with all this. I have an appt. Fri. with my rad dr. I was told by one of the nurses that I have to wait 4-6 weeks to start rads. Is this true? lisalisa-congratulations! LadyJane- My neuropathy seems to be getting worse. Sometimes it feels like my whole feet and hands get numb. i think I'm going to lose one of my big toe nails. Its almost all white. It doesn't help any that its been bumped a few times. I haven't been able to wear closed shoes, so I just wear my sandals. I'm hoping it goes away soon, but my onc. told me it could be weeks or months. UGH. My tear ducts have gotten better. Not so teary anymore.",
      "MessageIndex": 2911,
      "PostDate": "19/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 11, 2009 12:31PM PLUTZ wrote: Hi ladies. Got back from my trip to WV on Sat. Had a great time. Hadn't seen  my sister since Christmas so it was sad to leave but I had to get back to my routine. Saw my surgeons nurse yesterdsay. My drs on vacation so she had to get a resident to check for fluids. I only had 60cc. It wasn't even painful because for some reason, I'm still numb from surgery. My steristrips are still on me. Have no idea when those will fall off. It will be a month Fri, since surgery. I have to see a PT because my arm is not getting better. Have an appt. Aug. 31st to get started. Going in next mon. for my simulation and I start rads Aug.24th. So I'm not nearly done with anything yet. My hair is gray and black and about 1/2 inch. It's slowly growing. I still wear a baseball cap when i'm out. No lashes yet. I've been shaving my legs. At least somethings back to normal. lisalisa- I'm glad you got thru your surgery well and are getting around. Hawaii808- you will go well with your surgery. I didn't have any pain. Just under my arm where some nodes were taken. Thats why my arm aches. I was out of the hospital the next day. My 2 drains were a pain cuz I had a lot of fluid and I didn't have the bulb type that you can fit in a pocket. I had this bottle hanging off me that I could not hide. I would stick it under my shirt. It was pretty obvious. Good luck to you. Well have a lot of laundry to finish. Have a great week.",
      "MessageIndex": 3040,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 17, 2009 08:16PM PLUTZ wrote: hi ladies, I havent been on for a few days cuz my computer is messes up. I'm using my daughters laptop. First time using it. very confusing. Anyway, had my simulation today, my arm hurt like heck cuz I still can't move it very well. I also signed papers to start the clinical trials for bisphophates. Have to go in Wed. for lab work and cat scan which means I have to drink the dreaded barium. UGH! I start rads on Mon. have to go in Mon or Tues. for a pregnancy test. I almost laughed, seeing I'm 52, but it has to be done in order to start the trial. This last week has been horrible. My daughters car kept dying out so AAA came out 3 times. Got it started the first time. Was told the cables were loose. Next day it dyed again. Had it towed. Needed a battery and was told a fuel pump also which cost $700. I told my husband we were not replacing the fuel pump cuz we were trading the car in on Fri. to get another one for my daughter. Well the next day the car didn't start again. I had to take my daughter to work and she wasn't feeling well, but I was supposed to meet a friend for lunch. I drove 40 min. away and was almost there and my daughter called to telll me she was doubling over in pain, so I turned around and drove all the way back and took her to an urgent care. Was there for 2 hrs. She had a urinary tract infection. The next day her car wouldn't start again so I called my DH at work and told him. I had to call AAA again to tow it to a different shop. They kept it overnight so they could put it on a diagnostic macnine and lo and behold, there was nothinbg wrong with it. They started it umteen times. Can you believe that? My DH asked if we could keep it there on the way to get my DDs car and they said yes. It was funny when we went to get it, my DH told my DD to keep the car runningat the dealer till the salesman says to park it. So she got her car and all is good and shes feeling better. I'm just glad I had the energy do do all that running around thoses couple of days. Hawaii808- I'm glad your doing well. Is your arm sore from them taking nodes? I thought I would be upset when I had the mastectomy. I was just glad all the cancer was caught. jillyg-I am planning on reconsruction but I have to wait till spring. Hope yours go well. everyone have a great week.",
      "MessageIndex": 3058,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 21, 2009 10:21PM PLUTZ wrote: kmmd- I still have the neuropathy too. My feet feel worse than my fingers. Lost a big toe nail yesterday. didn't hurt. I know the other one is going to come off soon. no bangs for me either, i have a salt and pepper look right now Its coming out kind of curly also and I only have wavy hair.. I just wish my hair would grow as fast as my leg hair. lol. I am pretty excited though, my lashes are starting to grow, short, but I can see them, no eyebrows yet. My rads got pushed back another week cuz of scheduling problems. its so frustrating. i have another appt. next Wed. for a second simulation. I also have to go back to see my bc surgeon for a follow up because i still have fluid build up. I get to start my clinical study next week. I'm excited about that  and i get to take pills instead of the IV. yeah!",
      "MessageIndex": 3073,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 22, 2009 02:27PM PLUTZ wrote: BerkleyKim- I haven't heard back from the nurse yet about which pill ll be taking. I have all the info about them and the side effects, Can't be any worse than what we've went through, holtbolt-I'm glad everything went well with you. I actually have short lashes! I managed to put a little mascara on them and  I almost feel like a normal person. I just wish my eyebrows would grow. I also had my eyes checked a few months ago because it seemed like my eyes got worse but they hadn't. Its weird though because I can't read with them on and I have bifocals. Have a great weekend!",
      "MessageIndex": 3081,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Sep 15, 2009 11:45AM PLUTZ wrote: hi ladies. Well I'm on week 3 of rads. Its going well. Its a pain going twice a day but nothing I can do. I'm feeling good except I caught a cold. My PT is going well. I've been signed for 4 more sessions and hopefully my arm will be back to normal. I have lab work and an appt. with my onc. next week. Hoping everything is ok. I have no side effects from the clinical study I'm doing, so thats a positive. I am so sorry to hear about breakups. It couldn't have happened at a worse time. You have to stay strong and take care of yourselves. Hugs to both of you. All of you, take care and have a good week.",
      "MessageIndex": 3146,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Oct 6, 2009 12:46PM PLUTZ wrote: Hi ladies! I finished my rads yesterday, on my birthday!. What a gift! I'm feeling good, not too fatigued. Got results back from lab.  My vitamin d level is low, so another prescription to fill. I also start tamoxifen next week. my onc. nurse told me to wait a week after my rads so I can rest. What a year. Now its like, what do I do now. No appts for awhile. I'm actually feeling normal. My hair is growing slowly but I've been brave enough to not wear my baseball caps out. I see alot of women with very short hair, so I don't feel like a freak. Anyway, my DH and I are going to a B&B this weekend for my birthday. The trees should be changed and its beautiful where we're going. Its in Amish country 2 hrs. away and we will go antique shopping. The weather is supposed to be cool and sunny. Can't wait. Hope all of you are doing well. Hugs to all of you.",
      "MessageIndex": 3214,
      "PostDate": "06/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Oct 13, 2009 12:11PM PLUTZ wrote: Hi ladies! I'm glad everyone is doing well.  I had a great weekend with my DH. Stayed at a beautiful B&B. We'e been there before. Sad to say, the owners have it up for sale. The economy has hit them hard this year and they want to move back to their hometown in Michigan. Their kids and grandkids live there. We went to an antique festival and bought a couple of things. The weather was beautiful. As for the hair and bangs, I have none either. My hair seemed to be growing, now its at a standstill. All my lashes are in. I'm so happy. My eyebrows still aren't all grown in yet. I've been feeling good since my last rad. Not too tired. The skin is starting to peel and itch. Its hard to wear a bra.I still see the physical therapist once a week. My arm is still not up to par yet. Just started the tomoxifen yesterday. We'll see what happens. Its hard keeping up with all my meds. Synthroid in the morning, tomoxifen, mid morning, viactiv lunch and dinner, vitamin D(prescription) before dinner, boniva 1hr before bed and zocor at bedtime. I feel like an old lady! lol yearrofthehat-have you tried vitamin Bcomplex for your neuropathy? It works well. Mine is almost gone. Lost a couple of toenails but thats about it. My fingers are slightly tingly. I hope you enjoy your Hyundai. I have a SantaFe and love it. ky-Happy belated B-Day! jillyg-I hope you had a great Thanksgiving. Looking forward to ours. Good luck on everyone having tests done. Have a great week.",
      "MessageIndex": 3234,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Oct 13, 2009 12:14PM - edited Oct 13, 2009 12:15PM by PLUTZ",
      "MessageIndex": 3236,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Dec 23, 2009 02:16PM PLUTZ wrote: HAPPY HOLIDAYS ladies! I'm glad everyone is doing well. I'm doing well. My 1yr is coming up Jan. 2nd when I was diagnosed. It is hard to believe this year is almost over with everything we've been through. I am so blessed that I have family and friends that got me through year. God Bless al of you and I'll be back in the new year. I'm going to W.V next week to visit my sister and nephew. Take care and enjoy your holiday. Phyllis",
      "MessageIndex": 3381,
      "PostDate": "23/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 1, 2010 02:35PM PLUTZ wrote: Hi ladies! Glad everyone is doing well. just had my 1st physical checkup in almost 2 yrs. had a pap. hopefully it comes out ok. My ekg was fine and I had a bone density test done and it was good. Keep putting off my colonoscopy but my dr. says I need to get it done, so I will be getting a cal in the next week or so. ugh! Has anyone had this done? have a great week",
      "MessageIndex": 3513,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 24, 2010 12:48PM PLUTZ wrote: Hi Ladies. I am so thankful just to be healthy after this last year. I have gained 10lbs from the 23 that I lost during chemo. It has been a year since I was in the hospital for a week. I don't ever want to go through that ever again. My neoropathy is gone so there is hope for all of you that still have it. I still have a toenail that is black and hasn't fallen off. My hair looks like bozo the clown after I wash it. Its so wavy but still too short to go in and have it trimmed. I use a straightner. My legs still bother me , especially when i go to bed. They get very achy and my hot flashes are worst at night. Other than that, I'm doing great! lol Take care and have a great week.",
      "MessageIndex": 3544,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 7, 2010 10:22AM PLUTZ wrote:         hi ladies. Well had my consult with the plastic surgeon yesterday. I had 2 options. So I decided to go for the latissimus flap versus the diep flap. Its less surgery. I have enough scars on my body. Has anyone done this one and how did it go and how long is recovery? I really wanted the tummy tuck but the doctor said I would have to go through tests and MRI and whatever else. I don't want to go through all that. Oh and I'm getting a breast reduction at least 2 sizes.         Did  a bunch of you get together?  didn't know about it but I wouldn't have been able to go at this time. Hopefully next time. I have a very busy summer. My family is going to Albuquerque in June and I'm having a 50th birthday party for my DH and   my niece is getting married in July. Reconstruction in Aug., recovery, and I was hoping to walk in the race for the cure in Sept., but I'll have to see how I'm recouping. Have a great weekend. Its supposed to be rainy and cold here. HAPPY MOTHERS DAY!",
      "MessageIndex": 3624,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 16, 2010 09:38PM PLUTZ wrote:   Hi Ladies. Its been a very busy week. Dentist appt which went ok but i have had an impacted wisdom tooth since I was young and now its starting to rub on my molar and could cause problems. my dentist knows what I've been thru the last year and said I can wait a few months to have it extracted. Whew! What else is there to go thru?  I'm very lonely this week. My hubby is in Boston til Sat., my younger dd is out finally with some friends. Shes very quiet and shy and trying to get her to hang out with friends is like pulling teeth and my older dd came over today. Shes having issues. She moved out a few weeks ago and she is so irritable, my younger dd doesnt even want to hang out out with her. I'm sure its a big adgustment, but she made the choice. Oh well, life goes on. Jilly G- I'm having the latissimus flap which is when they take a muscle from my back. The other would have been too much. No tummy tuck for me which I would have loved.  Will also get the expanders done the same day as the surgery, but it will be so nice to finally have a boob on the other side. I would still love to have a get together with everyone, maybe next year for a weekend? It would be so much fun. I've had such a busy summer. Made up for it since last year. Lets still try for next year sometime. Everyone has been such an inspiration for me, I would love to meet everyone that can get together. Have a great weekend.",
      "MessageIndex": 3708,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 30, 2010 11:52AM PLUTZ wrote: Hi Ladies. I'm glad everyone is doing well. HAPPY BIRTHDAY Renrel.  I've been feeling really crappy since I had this 3rd drain out. I'm so sore and part of my arm is numb. Trying to do exercises again. Looks like I might have to go to physical therapy again. I cannot raise my arm more than a few inches. This sucks. Also, I feel like I have neuropathy in my toes. I don't get it. I guess I'll ask the nurse tomorow when I see her. I also get injected for the 1st time since i was in the hospital. Hopefully its not painful. I'm feeling a bit sad today. My youngest DD starts her junior year today. I feel like I'm going through the empty nest syndrome. I don't get to see my oldest DD much, she works 2 jobs. I just need to get better so I can get out and do things. Hope you al have a great day and for you teachers, good luck with your 1st day.",
      "MessageIndex": 3765,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Dec 31, 2011 05:44PM PLUTZ wrote:     Hi Ladies! Happy New Year! Haven't been on here in months. Its going to take me awhile to catch up with everyone. Hope everyone is doing well. As for me. Found out 3 wks ago I have  a recurrance of my breast cancer. Had a biopsy on my neck. They found some cancer cells in my lymph nodes and  on the lining on my left lung. My dr. switched tamoxifen to Armidex and I go Tues for a chest xray and see if this drug is working. So far, no chemo planned. I feel like crap. I've had this terrible cough for 2 months, had many tests done. I'm tired and my body aches. Kinda reminds me of chemo a week later. But I am praying for healing and I will get through this again. Take care and I will check in.",
      "MessageIndex": 4173,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 1, 2012 11:04AM PLUTZ wrote:   Hi ladies. Had my dr. visit yesterday. Everything looks good. The tumor in my neck is shrinking. My pneumonia is gone but I am still weak. Not sleeping well. Got a prescription for morphine for my back pain and it made me nauseus, so I'm not taking it anymore. The Ambien I'm taking to fall asleep makes me feel like crap. I'm so groggy today. I think I'm getting all these reactions cuz I take so many pills. Anyway, I go back in 3 wks and possibly get another CT scan. Jess- hope things turn out ok for you. praying you get good news",
      "MessageIndex": 4196,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 27, 2009 11:00AM - edited Mar 27, 2009 11:01AM by PLUTZ ladyjane54-I certainly hope you will be home soon. I was also on oxygen for a couple of days only because I had this dry hacking cough and couldn't catch my breath. I felt really guily ending up in the hospital. I hadn't been feeling good for a few days until last Wed. when I tried to get out of bed, I could barely walk. I had to call my husband at work and he called the doctor and told him to get me in asap. I just feel like if I would have called the doctor sooner, I wouldn't have been in the hospital. But my wbc count was down to 70 and took 3 days just to get to 400. By the time I got to go home I was over 2000. I'm feeling a little better. I'm sleeping well. I just have no energy. I walk very slow. I'm hoping to fully recover in a couple of days. I will be praying for your recovery. Being home is the best place to be. I'm so happy for all of you that are done. What happens next? I have to wait until Apr. 10th for my first taxotere. I hope everyone has a great weekend.",
      "MessageIndex": 1679,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 30, 2009 11:31AM PLUTZ wrote: I'm so glad some of you are done with chemo. I have a long way to go. I'm starting to feel  a bit better. 5 days home from the hospital and my legs are still weak. I managed to go to the grocery store. I was exhausted when I got home. Ladyjane, I hope you are home recuperating and feeling better. Misty- I have been praying for your son and your family. Hope everyone has a good week.",
      "MessageIndex": 1723,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 3, 2009 11:35AM PLUTZ wrote: good morning ladies. had #2 Fri. Everything is looking good. Had a chat with my ong. about changing my breast surgeon. am not comfortable with her. she has no compassion. I'm getting set up with a male surgeon who is supposed to be really good. I mentioned to my onc about bilateral mastectomy and she doesn't recommend it and she also said the breast surgeon won't recommend it only cuz I have inflammatory bc the chances were slim of it spreading to the other breast, so I don't know what I'm going to do. right now I'm in a daze. the decodron really got me this time. had 2 hours of sleep. tried to lay down again this morning but no luck so I'm going to do some laundry and maybe try to lay down later. I'm in no pain yet from the neulasta. I usually am by now. I also got a lower dosage of the taxotere. Maybe i won't be in so much pain this time. Oh, and by the way, only 2 more chemos for me! yeah! May 22, and June 12th I  will be done! ddlatt-congrats on your last chemo. hope everything else works out well for you with no more problems. everyone have a good week. I'll stay in touch.",
      "MessageIndex": 2218,
      "PostDate": "03/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 22, 2009 02:07PM - edited May 22, 2009 02:09PM by PLUTZ Hi ladies! Had #3 today, 1 more to go!.  My checkup went really well. My onc lowered my dosage again on the taxetere so hopefully no more dehydration. go in for the neulasta tomorrow. Feel pretty good today considering I had only 2 hours of sleep from 3am-5am. Dozed off during chemo. Don't feel to bad. I'm not even tempting to take a nap. I knowI won't sleep, hopefully tonight. got lots to do tomorrow. renrel-I also have very teary eyes and asked my onc about it. She said the tear ducts are blocked. thats why our eyes are watery. She was going to give me a name of a doctor to see, but I don't want anybody messing with my eyes. She said it could last awhile even after all the chemo is done, so I just keep a tissue with me. I noticed I get most teary when I'm out in the sun. I wear glasses but decided to wear sunglasses and see if that helps. brenda- CONGRATULATIONS! Everybody have a great holiday. I'm going to enjoy being outdoors and bbquing.",
      "MessageIndex": 2413,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 26, 2009 10:56AM PLUTZ wrote: hi ladies! finished #3! I had a really good weekend. DH and  I bought some more flowers to plant. We just had a deck put in the front of our home and it was finished last Wed. Its really nice, now we can go from the backyard deck to the front when the sun moves. I didn't feel too good yesterday. Sat outside most of the day. Had a couple of people over for a cookout but I had no sleep this weekend. I'm really feeling like crap today. My body aches and I have a headache that just won't go away. I was going to run some errands but It will have to wait. no energy. Hope all of you have a good week.",
      "MessageIndex": 2455,
      "PostDate": "26/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 27, 2009 09:17AM PLUTZ wrote: renrel- I also have the numbness in my hands and feet. I was just getting it on the tips, but today its the whole thing. I can barely pick up anything. My legs are still achy and of course I'm very tired. I slept fairly well last night but woke up at 3am and  was awake for awhile and managed to get a little more sleep. was planning on running some errands but I really don't want my legs giving out on me so I'll stay home and get some stuff done. Hope your feeling better",
      "MessageIndex": 2462,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 28, 2009 10:53AM PLUTZ wrote: Hi ladies. Thanks for hanging in there for me when I finish. I have 1 more on June 12th. These treatments have been rough on me, but I made it through this week without being dehydrated. I'm just very fatigued and a little weak. Went to the grocery store this morning and was winded when I got home. Had to take a break before I could put the stuff away. But I am feeling better. Going out to dinner tonight. Don't know what I'll eat without the tastebuds. We're going cuz a 14 yr. old student thats in one of my daughters classes has cancer in her spine and has been going through treatments and the restaurant is donating 20% to help with costs. So if all of you could pray for her. Her name is Kelsey. Such a young age to get cancer. I thought all of us were too young to get it. I hope all of you are doing well. I should be back to almost normal by the weekend. Have a good one.",
      "MessageIndex": 2473,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 15, 2009 08:43AM PLUTZ wrote: Good morning ladies! I had a really relaxing weekend sitting on my deck. didn't do much of anything. I was pretty tired from the steroids. My legs are a little sore today and I still feel very tired but I'm going shopping with my daughters. I hope these last s/es aren't so bad this week. It will be nice to get my taste buds back. holtbolt-I'm glad you had a nice vacation. I am so ready to go on one but it won't be this summer. My summer is still tied up with tests and surgery and rads. Some vacation! ladyjane54-I'm rooting for you this week. Its such a relief to finally getting back to normal. lisalisa- I am so happy for you that you are getting eyelashes. I wish mine would start growing. My teary eyes are driving me nuts. BevR- congratulations on your new grandson everyone have a great week. I'll check in the end of the week.",
      "MessageIndex": 2610,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 23, 2009 08:36AM PLUTZ wrote: Good morning ladies. I'm finally feeling better after my last chemo. I was very fatigued this past week and weekend. Yesterday went in for my MRI and mammogram. I just hope everything is clear. I still have neuropathy. Does anyone know how long this will last?  I'm glad to hear some of you are getting hair. I'm getting a couple of wisps in the front and like most of you,my hair is coming in salt and pepper. jrgoglomb-sorry you had that experience with a rude person. I had to laugh at your remark to him. I haven't noticed anybody looking at me oddly lately, except last week I was at Walmart with my daughters eating at Subway and this woman was sitting at a table and kept looking at me. Everytime i looked back at her, she would turn her head. She did that a couple of times. I felt like going up to her and say something but I think she caught on that I knew she was staring at me. People can be so rude. At least people haven't come up to me and ask me whats wrong. If they did, I would ask them what is wrong with you? That would be a face to see! Holtbolt- I will be voting later! Love Aerosmith. My DH is a huge fan and seen them many times.",
      "MessageIndex": 2671,
      "PostDate": "23/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 1, 2009 02:14PM PLUTZ wrote: ddlatt- I do plan on reconstruction but was told I would have to wait  at least 6 months. I did ask my breast surgeon about my healthy breast and told me the chances of getting cancer is very low, so I plan on having breast reduction when I have reconstruction.",
      "MessageIndex": 2767,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 16, 2009 08:55AM PLUTZ wrote: Hi ladies. I hope all are doing well. Well, tomorrow is the day for my surgery. I pray everything goes well and its just an overnighter. Can any of you tell me what I'm supposed to wear home?",
      "MessageIndex": 2879,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 24, 2009 09:02AM PLUTZ wrote: Hi ladies! I'm doing well except my drain is leaking from somewhere. I checked the tubes and my DH checked them and couldn't find any holes. My panties were soaked this morning from the dripping. Thankfully my nurse is coming out today. I also have an appt. with my rad dr. this morning. Another thing to look forward to. lol jillyg-have a great walk today. I'll be thinking of you and wish I was there. Is there anyway I can get one of those t-shirts? Let me know and let me know how much. Everyone else have a great weekend.",
      "MessageIndex": 2947,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 19, 2009 06:37PM PLUTZ wrote:   hi ladies-went and got some labs done and wouldn't you know it, it was supposed to be stat. the nurse forgot to add that in so Ihad to get poked a second time, then the ct scan machine was down. The repairman was there. Had to wait awhile. I was dreading the barium but I did it. Got thru that then I had to go to the main clinic where my surgeon is to get checked for any more fluids and sure enough, there was some. Got drained again. Have to go back next week and get checked again in between me going for rads twice a day. Its going to be a crazy week. My daughter starts college. Thank goodness she can drive there. Its only 30 min. My other daughter starts school on the 31st, same day as I start my physical therapy. I guess I won't be getting much rest for awhile. BerkelyKim- I will be going on Tomoxifen after rads. I haven't been told what I will be taking for the clinical studies. Will find out next week.",
      "MessageIndex": 3062,
      "PostDate": "19/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 14, 2010 12:38PM - edited Apr 14, 2010 12:39PM by PLUTZ Hi ladies. Well I made it through my colonoscopy. Everything went well. The dr. removed two polyps but was not that concerned but is stilll having them biobsied. I'm just really tired and I have some cramping. The prep was the worst. Was up half the night and had to get up at 4am to finish the drink. Good thing I have 2 bathrooms in the house. My husband really made me mad this morning. He's always been there for me on most of my dr. visits and of all days, we were having a tree delivered today and he just HAD to be at home to make sure it was put in the right spot. He left after the iv was inserted and I asked him if he was coming to pick me up and he said I can't , the tree service might be there. I guess a tree is more important than a wife today. My daughter picked me up and she took me to Panera for lunch before she headed for class. My younger daughter just finished up her driving school classes but has to wait on her driving till she gets her temps. She will be 151/2 next week and then she'll go for her temps in the next couple of weeks. We went to the cemetary before Easter and I let her drive around a bit because it wasn't crowded., except for a work truck that kept following us and my daughter ran into a dirt pile. I remember those days with my first daughter. Its kind of funny but also nervewracking. All of you have a great week.",
      "MessageIndex": 3569,
      "PostDate": "14/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 15, 2010 10:15AM PLUTZ wrote:    Hi ladies. I'm glad to hear everyone is doing well.  Had my 2nd consult with my Dr. on Tues. I'm all set for my reconstruction Aug. 4th. I have an appt. next week for pretesting. Did any of you have to have that done? I gues i have to have bloodwork, a stress test and i don't know what else. I'm getting nervous about the surgery. The Dr. said it would be a 4hr surgery and I would be in the hospital for at least 3 days. More drains I'm told. UGH. I won't be able to drive for about 3 weks. Good thing my daughter has her temps. Shes going to have to drive me to run errands. I'm sure shes going to love that! lol  I've got to get ready for adentist appt. and then I have t pick up my precious litle dog from the vet. She had to have surgery on her other leg and she will be wearing a cone on her head for a few days. She went thru that last year and did not like it. Its been very hot here, in the 90's. Took my girls to the movies and out to lunch yesterday. My DH is in Boston with some friends. They go on basebal trips every year and they chose Boston for the 3rd time. They really like it there and they also like Chicago. they will be home Sat. but I won't see my DH for long because our church picnic is that day. I'm also taking my younger daughter to an Artsfest earlier on Sat. Last year I couldn't go cuz I just had surgery. Well gotta run. Have a great week.",
      "MessageIndex": 3704,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 2, 2010 11:27AM PLUTZ wrote:   Hi ladies. I hope everyone is doing well. Well my big day is Wed. A little nervous. Don't like having to spend 3 days in the hospital. I'm glad to get this last phase done with. My DH is buying me a new car. I said I didn't need one but he said I deserve it with what I've been through this past year. What a guy. We're waiting till the end of the month since I'm not going to be able to drive till after the surgery. I've been feeling good but this last week I really felt depressed. I don't have any friends nearby and my sis lives in WV. My oldest dd has been working alot so I don't get to see her much and my younger dd doesn't like to do things. Shes very frugal and won't let me buy her new clothes for school. She doesn't like to go out to eat. She reads and sews,so I guess thats a good thing. She is going to help me color my hair today. Well by the time I get back on this thread, I wil be home from the hospital. Take care and wish me luck.",
      "MessageIndex": 3723,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 15, 2011 12:51PM PLUTZ wrote:    Hi Jewels. Haven't been on here in awhile. Had my 6month checkup last week. I have a new Nurse P. Shes ok. She found a bump under my breast and wanted it checked out. I told her I think its just scar tissue from my reduction but had to go ahead and get a mammogram and imaging. They agreed thats all it seemed to be. whew! Theres also thickness on my neck that was checked a month ago wit a CT scan but was told it was from the radiation. So all good news. My blood work has been good. I'm working on getting some of winter weight off. I joined a gym. Its so hard at my age but I need to do this. I still blame all the meds I'm on. I might get my Tamoxifen changed. Theres a new drug that just came out. can't remember the name  but its getting looked into. It's supposed to be very effective, so hope to hear from the dr. soon. My daughter got her drives license a few weeks ago. Thats a big load off. She just finished up her junior year and working at McDs. My older daughter turned 21 last week. She did some celebrating and shes moving in with her boyfriend the end of the month. I'm not too thrilled about it but she's an adult. Thats about all thats happening. My DH and I are going to NC in July. I'm looking forward to a vacation. Hope you all have a great week andI'll stay in touch.",
      "MessageIndex": 4086,
      "PostDate": "15/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 30, 2012 09:26AM PLUTZ wrote: morning ladies. Well I ended up in the hospital last week for pneumonia and dehydration. Spent 4 days, Had to have fluid drained from my right lung. Just a few days before that, I had fluid removed from my left lung. I know its going to take days to recover but I still feel sick from nausea and vomoting. I have never been so miserable. I just want to get well. I see my dr. tomorrow and see what she says, Hope everyone is doing well.",
      "MessageIndex": 4192,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 22, 2012 11:40AM PLUTZ wrote:  Hi Ladies. Sorry I haven't been in touch. My chemo treatment was Mar. 13th. It wasn't too bad.I was really nauseus the next day.I think I'm on Taxotere again but not sure. I'll find out next treatment. I'm also on chemo pills, called xeloda. I'm on them for 14 days, 1 week off  then start them again when I get my iv chemo. The side effects are terrible. My body aches (reminds me when I had to get the neulasta shots), headaches, dizziness and fatigue. Starting to lose my appetite but not the taste. I have to be careful of mouth sores. My mouth was sore for a couple of days but its gone now. I have to wash my hands after handling the pills and the nurse gave me udder cream that i have to use after. My hands could crack and turn red, but they haven't so far. I have neuropathy again. It never went away in my toes, but its back in my fingers. My next treatment is Apr. 3rd. I'll let you all know how that goes. I hope everyone is doing well.",
      "MessageIndex": 4222,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 11, 2009 11:05AM PLUTZ wrote: Hi everyone. I am dreading  having my 1st taxotere. From what a lot of you are saying about the SEs. I'm not over my last A/C. I am exhausted. I'm so tired of having no energy. I can barely do a  load of laundry without having to sit down. Going to the store is very difficult. I went the other day and almost passed out. I was given some kind of shot to boost my energy, but it hasn't kicked in yet. I'm going on vacation in 3 weeks, but if I feel like I do now, I may just cancel. Theres no way I'm going to be able to walk around to see the sights. I'm praying for all of us as we get through these awful treatments. I know we're getting closer to the end. Can we just all start feeling better instead of all these other complications/",
      "MessageIndex": 1506,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 27, 2009 01:29PM PLUTZ wrote:  I had my first chemo treatment Fri., Jan. 23. It wasn't that bad.The nausea  was bad the first night. The shot really did me in. I was in so much pain for 2 days, I could barely move around. I'm ok now. What I want to know is how long is the fatigue supposed to last? I'm tired all the time. I sleep ok. Also my breast is very swollen. Does anyone else have this symptom? My second chemo is Feb. 6th. I won't be having my surgery till summer. I did order a wig from a place that specializes in women with cancer. She is going to cut my hair. Not sure if I should shave it, makes more sense if I do, cuz its going to fall out anyway. I still get emotional about this whole thing but I am keeping my spirits up and all of you women should too. Take care.",
      "MessageIndex": 800,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 29, 2009 12:05PM - edited Jan 29, 2009 12:13PM by PLUTZ  to rsben70. I believe I have the same stage of bc. Not sure what cm the tumor is though. Like you , I am very tired but I feel pretty good after a few days after my first treatment. My next one is Feb.6th. I actually am doing the hair thing. I also have thick hair. My appt. is Sat. with the hairdresser shaving my head and fitting me with a wig that I ordered from her. I might get emotional when I see my bald head, but not much we can do about that. I don't want to feel my hair coming out. I had Hodgkins disease 25yrs ago, and I still remember when my hair fell out and it was pretty painful. As for food tastes, nothing much yet. As a matter of fact, my appetite seems to be increasing. I don't know whats up with that. My mouth has a nasty taste all the time.I drink a lot of water and bought a natural mouth rinse that I hope helps. Take care",
      "MessageIndex": 855,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 26, 2009 09:57AM - edited Mar 26, 2009 09:58AM by PLUTZ I have a lot of catching up reading all the posts. just spent 6 days in the hospital. Had pneumonia, bladder infection, low blood pressure and high fevers. Had chest xray, cat scan and ekg which alll came out ok. Had so much bloodwork done. Had 4 blood transfusions, antiobiotics were changed constantly because of my fever. It just would not go away. When it did drop some a couple of hours later it would be back up again. I just felt so sick and drained, I honestly felt like I may not get out of the hospital. I came home yesterday afternoon. Very weak. Had to catch up on my sleep because you sure don't get it in the hospital. My taxotere treatment is tomorrow but had to have it postponed. I'm on antibiotics for a week. I'm hoping I'll recoup in a few days. Chemo is nothing compared to what I went through and my family. They were so worried. I will get better. ladyjane54- I feel for you. I hope your feeling better.",
      "MessageIndex": 1665,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 5, 2009 12:24PM PLUTZ wrote:  Lisa810 Like you, I don't like hard candy. I'm an M@Ms kinda person! But I bought some butterscotch and lemon drop candy and it helps alot with the dry throat. As for protein, How about tuna or some other type of fish. Its healthy and good for you. take care. Hope this helps. PLUTZ12",
      "MessageIndex": 1011,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 9, 2009 09:49AM PLUTZ wrote:  Hi everyone. Had  #2 trmt. on Fri. Also got to see my doctor. She is very happy with the treatments I'm getting. My tumor was 10cm (which I didn't know) is down to 6cm. My blood counts have been very good. Got nausea pretty quick. Right after I got home I got something to eat, took a nap and felt lousy for awhile. Slept good, then was nauseus in the morning but got better. I had to have the neulasta shot Sunday morning. I was in pain by that afternoon. My doctor prescribed vicodin, but it doesn'r seem to help that much. I was up all night in agony and I feel like crap today cuz I'm so tired and achy. As for the hair, its finally coming out in strands. I run my fingers through it and a few come out. Found a bunch on my pillow this morning. For some reason, its not bothering me. My older daughter asked me last night if I was going to be sad when it all comes out and I came up with a great answer. I said no cuz its the beginning of our healing process. Our hair will come back.  We must all keep a positive attitude. Its part of our healing and well being. Take care all of you. I'm going to try to get some energy to do laundry. ugh!",
      "MessageIndex": 1074,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 11, 2009 01:07PM - edited Feb 11, 2009 01:14PM by PLUTZ Hi everyone. I'm almost back to normal today. Couldn't sleep worth a darn again. I'm really thinking about shaving the rest of my hair. It hurts when I try to sleep. My wig is not comfortable. I may try to make a couple of scarves. I'm feeling ok otherwise except my hemorroid is bothering me and I'm not even constipated or have diarrea. My doctor said  I can eat pretty much anything. Nothing is tasting good these days.I'm actually giving up my sweets because I made brownies and they tasted awful. My girls said they were delicious, so I know its the taste buds going. Does anyone eat anything that actually tastes decent? Take care and hope everyone is getting through this week. Dx 1/2/2009, IBC, Stage IIIb, Grade 3, ER+/PR+, HER2-",
      "MessageIndex": 1110,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 12, 2009 10:53AM - edited Feb 12, 2009 11:01AM by PLUTZ   Hi everyone. I'm finally feeling a bit better today. A little quesy but ok. Actually slept all night. Berkley Kim- I'm sorry to hear about your insurance being cancelled. I can not imagine having to pay all these outrageous bills. I'm already getting statements and its unreal how much chemo costs. Maybe a social worker or someone can help find some resources to figure out how these bills will get paid. You have enough going on to be worrying about it. Renrel- I actually don't have much of a plan with the scarf thing. My daughter has some remnants and I cut one up and played around with it and just tied it around my head but it looked really dumb, so I'm not sure what I'm going to do. I may stick with hats and caps. I have a hairpiece I was thinking of cutting and making some bangs and sideburns and using velcro to stick onto the hats. Haven't tried it yet. Maybe later. I'm still debating on shaving whats left of my  hair. I have a lot of bald spots. lester63- I'm glad we can have a sense of humor about things. I was talking to my sister the other day and her house had burnt down and she was running around trying to find her phone to call 911 and ended up running out in the street till a car was coming down. She was in her pjs and slippers  outside in freezing temperatures. We had a good laugh even when it was a serious thing, but we all stick together. A pastor and his wife took her and her son in. Shes getting lots of donations and she may have found another home. She has to wait on some details so lets all pray everything will work out. I can't be with her. She lives in W.V but she keeps me in her prayers. Take care all of you.",
      "MessageIndex": 1128,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 19, 2009 11:29AM PLUTZ wrote:  Hi everyone.  shockedat39-I'm with you about some of us with stage111 and 4. There's hope for all of us. I happen to have IDC and IBC.  My doctor is very pleased with my treatments. My blood counts have been excellent. I feel good most of the time. I pray a lot and am keeping a postive attitude. I plan on being around a long time. My oldest daughter graduates from high school this year and I plan on seeing my other daughter graduate in 3yrs, plus I just got married last year and I would like to spend a lot of years with my husband. Everyone just need to stay focused and take care of themselves and we will all get through this. Tomorrow is #3 a/c for me. Hoping I don't feel crappy like the last one. Take care.",
      "MessageIndex": 1232,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 16, 2009 12:55PM PLUTZ wrote: Hi ladies. Well its day 4 and I still feel like crap. I called my nurse yesterday and sure enough the excruciating pain I'm having is from the taxotere, not the neulasta shot. She told me to take 800mg of motrin, but of course I didn't have any and I couldn't even get around much less drive to the store to get some, so I called my DH at work. Got my pills about 3:30. I slept on and off all night. My neck and back are still very sore. I've got the numbness in my feet and mouth sores. I'm going out to dinner with my family tonight, but I have no idea what I'm able to eat. The nurse said it gets easier. HA! Between the decadron, taxotere and neulasta, I think I'd rather have my a/c treatments. I managed to go to the store, but was very winded when I got home. I wanted to get out. It's a beautiful day. Its actually going to be 60 degrees! ddlatt- so glad your getting back on track Jess- sorry to hear about your students theft. Theres enough stuff going on in schools. My daughters just received a letter yesterday regarding a male student that commited suicide last year. There was an article in our newspaper a few weeks ago about it and the parents are sueing the parents because he was bullied by their son. The school started a suicide group. Can't remember what its called. I just hope it spreads to all schools and gets students involved to prevent such tragedys. I think it would be so great if all of us could meet somewhere after everyone is done. I won't be done with rads till Aug. Would any of you consider coming to Cleveland in September for the Race for a Cure? I'm hoping I have the energy to walk it. I'm going to start my short walks around my block when I start feeing better. Hope all of you have a great weekend.",
      "MessageIndex": 2003,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 21, 2009 09:16AM PLUTZ wrote: Hi evervyone. Had #3 yesterday. I got great news from my checkup with my doctor. She said the treatments are working faster than she imagined. She couldn't even feel my large mass that I had. It started at 10cm and she said she felt nothing. Hooray. Not to say their still isnt something still there. It gives me lots of hope. I felt ok when I got home but got  nausea during the night. I'm ok today, just tired from lack of sleep. I'll be praying for those of you that have friends facing their own demons. We just need to pray for some miracles. as for A.Idol. I like Danny also. He's the one who's wife passed away. He has short hair and glasses. Kinda cute. Great voice. I also like Alexis. She's so cute. Would like to see whiny Tatiana go home, although she has a nice voice. Have a great weekend. Hope you all are feeling good. I'm off tomorrow for my nuesta shot. ugh. Another 2 or 3 days laid up. I hope not.",
      "MessageIndex": 1272,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 20, 2009 09:10AM PLUTZ wrote: good morning ladies. I'm almost back to normal. The diahrea is about gone but I still have the stomach cramping. I'm going off the augmentin today and see if thats the problem. It said it was a side effect. Still not sleeping well. Been up since 3 this morning.  I am trying to get the fluids in me, still not much of an appetite. Well, gotta run some errands. All of you have a nice day.",
      "MessageIndex": 2057,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 6, 2009 10:21AM - edited Feb 6, 2009 10:21AM by PLUTZ   Hi everyone! I  hope all of you are having a good day. I'm on my way for #2. I'm really dreading the neulasta shot tomorrow. I'm going to ask my oncologist about the claritan some of you mentioned.I have been feeling so good this week. Back to reality this weekend. I will let everyone know how it went .Take care. This email was sent to me by my sister-in-law. it made me feel better. He arrived this morning. We had prayer. Spent some time talking. He held me for awhile because I was having a bad morning. Then he was on his way to your place. May God Bless all of you.",
      "MessageIndex": 1026,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 27, 2009 09:59AM PLUTZ wrote: ddlatt- your photos are beautiful and aspiring. My last a/c is next Fri. Taxo starts March 6th. Can't wait. ugh.  . I'm actually back to normal after #3 did me in this week. I'm going to run some errands. Its raining here but its quite warm about 50 degrees. I know, some of you have it made where you live but living in northeast Ohio. We take what we can get. everyone have a great weekend.",
      "MessageIndex": 1383,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 10, 2009 11:34AM PLUTZ wrote: Hi everyone. Hope you are all  well. I'm still a little achy and tired today. this 2nd trmt really did me in. I haven't been sleeping well either. I think its mostly cuz my head hurts. Found lots of hair on my pillow again. My hair is very thick, but all I have to do is run my fingers through it and a bunch of strands come out. I ordered some sleep caps. They should be in today or tomorrow. Hopefully it helps with the sleeping. I also agree with those of you about reading the bad stuff. When I found out I had ibc, I went right to the web to read about it. I mentioned it to the nurse that was with me that day and she also said DO NOT READ THAT STUFF! we're going through enough as it is. We must all stay positive and our bodies are different. I have not been depressed in a long while. I haven't cried. I'm feeling good. I have a long road ahead of me. Haven't even had surgery yet, so I am keeping my spirit up and thinking good thoughts. All of you have a good day.",
      "MessageIndex": 1089,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 28, 2009 12:04PM PLUTZ wrote: Good morning  ladies. Had a lot of catching up to do on the blogs. The weekend was so nice, I didn't go on the computer. I've been feeling pretty good, except my legs bother me constantly. Did anyone else have that problem? They are very weak, so I have to take it slow when I go places.  My family wanted to go to the zoo on Sat., and all I could think of is I'm not going to be able to walk thru all that.I thought I would rent a wheelchair. When we got there,I managed to walk from the parking lot to the entrance, which is a good walk . My DH asked if I wanted a wheelchair and I said no, I'm going to try and walk. Well I did it! I was so proud of myself as was my family. We went out to lunch after and I'm actually able to taste some things. By the way, I wore a baseball cap all weekend. Didn't care, didn't notiice anyone looking at me either. I'm getting a little braver. I'm dreading Fri. for #2. Back to the decadron and neulasta. I hope its easier than #1. I'm sorry for all of you going thru some depression. I haven't been there yet. I'm sure I will when the time comes for my surgery which will be in June sometime. As for the hair and lashes, I seem to be growing a bit of hair and losing more lashes, especially the bottom ones. At least I can still wear eyeliner. My eyebrows have really thinned out too. Just hope I don't lose all of that. The good part is I'm glad to not shave for awhile. All of you ladies have a good week. I'll stay posted and let you know how #2 went.",
      "MessageIndex": 2145,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 23, 2009 09:54AM PLUTZ wrote:  Hi everyone. Hope everyones doing well. I feel like I got beaten up. My body started aching yesterday afteroon not long after the shot. My neck all the way down my back is very achy. I'm trying to do laundry but having a hard time bending. Oh well it only lasts for a day or two. Jillyg-love the name for your team. Good luck with that. I read that you really need to train for at least 3 months before doing these 60 mile walks. I know I couldn't do it right now. No energy. I am planning on walking for the Race for the Cure thats coming to Cleveland in September. I should be good and ready by then. The wig thing is driving me nuts too. I feel like people know I'm wearing one when I go into a store or restaurant. I'm really thinking about cutting it  some more or taking it to the salon where I bought it and have the stylist redo it. I can't stand wearing it. Luckily, its so cold here, I just wear a hat  when I go out. I bought a scarf with a brim on it from tlc. Its really cute but I don't know how to tie it. Well, got to get my body moving and get the laundry done. hope all of you have a great week.",
      "MessageIndex": 1307,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 6, 2009 09:01AM PLUTZ wrote: Hi everyone. I'm leaving soon for #4 A/C.  I just hope it doesn't put me under like this last one. I'm so tired of being tired. AllI want to do is sleep. At least I'll be able to recoup for 3 weeks then I start taxotere for 4 treatments. Bevr-loved the joke. It made my day. Its funny how we can laugh about our hair or should I say no hair? I don't worry about mine much. I don't miss washing my hair. It was so thick. I just wonder how it will grow back. I hope everyone has a good weekend. Prayers to all of you. I'm also praying for myself after the neulasta shot I'll get on Sunday.",
      "MessageIndex": 1452,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 13, 2009 10:04AM PLUTZ wrote: I missed reading all your blogs this past weekend. I had my first taxotere Fri. The decodran kept me up the whole weekend. In top if that, I had to go in Easter morning for my neulasta shot. Thank God I made it through church and dinner before I started getting achy. I can barely move today, but I have lots to do. My girls have their last day off from spring vacation so they are helping me.I'm glad everyone had a nice  Easter. Misty-I'm so happy for your son. I will continue to pray for him and I hope your feeling better.            ddlatt-I hope everything comes out ok with your test. I will be praying for you. lisalisa-you have so much energy. I'm so happy your feeling better. The birthday party sounds like fun. My daughter graduates from hs and I have to start planning her party. Thank God my last treatment is June 12th. She graduates June 6th. I'm pretty excited. I will be done and then my surgery will probably be the end of June. We are all getting close to being done with all this. I will still have 5 weeks of rads, then I'm not sure what happens. I don't know if I can get reconstruction right away. Well I got to do chores. Everyone have a great week.",
      "MessageIndex": 1934,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 21, 2009 08:48AM - edited Apr 21, 2009 08:50AM by PLUTZ Renrel-I'm also on taxotere. Can you taste anything you eat? I lost all my taste buds. Nothing tastes good. I was eating a lot of chocolate this last week. Now it tastes terrible. I don't bother eating much. Its a waste of time. I'm just keeping the fluids in me. By the way ladies, I am feeling much better. I took a sleeping pill last night and slept all niight. My stomach cramps are gone. I quit taking my meds. I think that was causing the cramping. I don't have a lot of energy today, but I'm going to clean my house as much as I can do. Hope all of you have a good week.",
      "MessageIndex": 2064,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 1, 2009 01:41PM PLUTZ wrote:  I am with all of you who are trying to get their strength back to start exercising or going for a walk. I love walks but I just have no energy. I make it to my mailbox and feel like I walked a mile. I'm doing a little at a time. I still can't believe I've been out of the hospital for a week and still am weak and tired. I do feel like I'm getting better. I took my 14yr old daughter shopping yesterday, but had to find a chair. I got tired real fast just walking around. My girls will be on spring break staring Fri. and I plan on doing things with them, even if I have to rest. I miss doing normal things. I'm tired of taking naps. I just want to get out in the nice weather and enjoy myself. My 1st taxotere is next Fri. and I hope it goes well. I got my prescription filled for Decadron. What exactly are the s/e with this drug. I hear different things. Also, I have lost most of my lower lashes, but i still have some on top and I still have my eyebrows. Probably cuz their thick and I'm not messing with them. Hope everyone having treatments this week goes well.",
      "MessageIndex": 1752,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 5, 2009 10:00AM PLUTZ wrote: morning ladies. sorry some of you aren't feeling well today. I feel like crap. The bones hurt, my legs hurt, I have a headache. I'm dizzy. Got errands to run but I'll have to wait awhile. I really don't feel like passing out in the store. My onc. called yesterday, but I wasn't home. Left a message this morning. Hope she has some info for me about my surgery. I'll be waiting for her call sometime today. yearofthehat-hope your feeling better. sounds like we we're going thru the same thing. BevR-hope your feeling better too.",
      "MessageIndex": 2229,
      "PostDate": "05/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 15, 2009 08:33AM PLUTZ wrote: hi ladies. It sounds like most of you are having a good week. I am feeling like crap again. could it be the taxotere? My body aches so bad, I'm weak and dizzy. I know the neulasta lasts a couple of days. This is day 4. I have no enerrgy. My feet are numb.  I can barely walk, my legs are weak.Should I call my doctor? lisa and holtbolt- congrats! jilly- I hope you are alright. Like I always say, things can be replaced and fixed. You are more important.",
      "MessageIndex": 1983,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 12, 2009 01:00PM PLUTZ wrote: ran my errands and feel like a normal person today.actually have some energy. going to enjoy the rest of the day. shockedat39- sorry to break the news, but there is hairloss with the rads. Fortunately when I had the treatments, I was 26 and had very thick hair, so I lost just the underneath of it. Do you have hair? Maybe you won't lose much. The only other hair I lost was my underarms, which to this day I only get a couple of hairs. Not much to shave .. Maybe it depends on how many rads you'll get.  Didn't mean to scare you. renral-I'm with you on the eating. I can taste a few things but thats about it. I'm hoping to enjoy my steak on the grill tomorrow that I didn't have on Mothers Day. hopefully I can taste it better. Hope you feel better. I was out of it all last week too.",
      "MessageIndex": 2310,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "May 29, 2009 12:29PM PLUTZ wrote: Holtbolt- HAPPY BIRTHDAY! sorry, don't have any hair or lashes to spare. LOL I have like 3 hairs on my brows. No lashes. I hope you have a great day. BerkleyKim- I'm also sorry to hear about your job loss. Its tough finding employment anywhere. Our employment in Ohio is over 10%. My brother is losing his job in the next couple of months. jrgolomb- I hope your legs are feeling better. My legs actually didn't bother me this time around. I wonder if it was because my dose was lowered. One less thing I had to worry about this week. The fatigue is really getting to me.I'm just not sleeping well. eadsla- I don't know about being a chemo achiever, but thanks for saying that. It made me laugh. The taxoteres been very rough on me. I wish i didn't have to have the 4th one but I will get through it. everyone have a great weekend.",
      "MessageIndex": 2479,
      "PostDate": "29/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 16, 2009 11:15AM PLUTZ wrote: Hi  ladies. I'm so glad alot of you are getting your energy back to exercise. I miss walking in the parks, but  I did manage to walk around the block the other day. Its about a mile. My DH was with me in case he had to hold on to me. I used to love hula hooping. I should try to get back into that when my energy comes back. My daughters have been playing around with a soccer ball and beach ball. I just want to join in with them. My s/es aren't too bad. Almost the same as the last time. Just very fatigued and trying to sleep thru the night. I should be better by the weekend. jrgoglomb- I won't start rads till mid August the earliest. My surgery is scheduled for July 17th. everyone have a good week.",
      "MessageIndex": 2617,
      "PostDate": "16/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 18, 2009 10:15AM PLUTZ wrote: Patti- Good luck with your last chemo! Its such a relief that this phase is done with. My last s/es weren't terribly bad. Tuesday I felt like crap. Very weak and fatigued. My legs are still hurting a bit and the neuropathy was the worst this last time. But I'm starting to feel better and I wish you luck as you finish up and get thru this last chemo.",
      "MessageIndex": 2633,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 6, 2009 10:09AM PLUTZ wrote: Good morning! I'm glad everyone had a great weekend. Had a cookout yesterday with my family and a few friends. Had a great time. Drank some beers and played bocce ball. My legs are still bothering me. I just don't know when the aching will go away. My hair is growing a bit. Its fuzzy but I can tell i'm getting some. Now if my lashes and brows would start growing and my teary eyes stop tearing and my fingers and toes stop numbing. But I am feeling much better. I'm sleeping better and have a bit of energy. I'm happy for all of you that are almost finished with rads. I wish I was that far along. I won't start till Aug. Everyone has been such a great comfort and supporting each other. It would be so fun if all of us could get together in the near future. ddlatt- happy for you going to Paris. You deserve it. We all deserve to do something special when we're done with all this.",
      "MessageIndex": 2803,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 10, 2009 10:31AM PLUTZ wrote: Good morning! One week, I'll be in the hospital having surgery. I'm getting nervous, but all of you made it thru, I know that I will be ok too. LisaLisa- watched your video. Loved it. Very emotional. Family is precious isn't it? I love my family so much, thats why I'm going to get thru this and be a survivor. Went to Cedar Point yesterday with my family. The weather was beautiful. I actually was able to walk thru the whole park and its huge. Only rode a couple of rides. No coasters. I didn't want to take my baseball cap off. I didn't want people staring at me. I still had a good time. I was able to rest while my girls went on rides. My DH and I are going away this weekend to a B&B for our 1st wedding anniversary.  It's been a tough few months and not spending much time alone. I can't believe how fast the year went and finding out a few months into our marriage that I have bc. My husband has been so supportive and plans on spending the whole day at the hospital next week. Told him not to but he insists. Well I'm off to a dentist appt. Had my teeth cleaned on Mon. and they found 1 cracked tooth and a broken one, but my dentist is going to fix the cracked one for now cuz I don't know when I'll be able to get back there with the surgery and rads coming up. All of you have a great weekend.",
      "MessageIndex": 2843,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 16, 2009 10:46AM PLUTZ wrote: holtbolt- I am having a mastectomy  on my right breast. I have camisoles but none that open. I guess i could cut one. I only sleep in them. I will be having drains. Thats the problem I've been thinking about. What the heck do I wear when I'm at home till I heal?",
      "MessageIndex": 2881,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jul 27, 2009 11:08AM PLUTZ wrote: Renrel- I truly hope everything works out for you and your DH. I know its been hard on my DH also but he never shows it. I think he hides it. He is very patient and has been my support all these months. We haven't had much of a love life either but am trying. I just don't feel attractive, now its worse without a boob. I am going to work on it though cuz my DH deserves it for helping me thru this. I will be praying for you. I'm off to see my onc. and rad drs. tomorrow. Was hoping to see the surgeon too but my drain is still draining. Its been 10 days. I'm really tired of dragging this around and my arm is really stifff and its hard to do the exercises I was told to do. I want to get back to driving. My daughter has to take me everywhere. Hope everyone had a good weekend.",
      "MessageIndex": 2961,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Aug 1, 2009 10:05PM PLUTZ wrote: lisalisa- I will have to go on the tomoxifen when my radiation is done and then I will be taking the Armidex sometime. Was told by my onc. dr. that i am going thru menopause although I have no symptoms. No hot flashes or anything so I don't know what I'm supposed to be feeling at this point. I just know that I am feeling almost normal. My legs don't hurt anymore and my teary eyes are gone. Just want some lashes and hair.  I do have hair but its salt and pepper right now. I look like an old man, but my husband says i'm still beautiful. What a guy.",
      "MessageIndex": 2998,
      "PostDate": "01/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Sep 4, 2009 01:26PM PLUTZ wrote: Hi ladies. Well, I made it thru my first week of rads. One this afternoon still. Its going well. Going twice a day isn't bad, a 15 min. drive and I'm not getting side effects. Although, I think I'm finally getting hot flashes. Jess-I'm sorry to hear about your marriage. I will be praying for both of you. This year had to be tough on both of you. My husband has been a blessing. He's been there for me thru everything. Even yesterday, he took half a day off to take me to an appt. downtown and we waited 21/2 hrs to see the doctor. We weren't too happy. I had to rush home to get to my rad appt. anyways, good luck to you. Take care of yourself.  have a great weekend.",
      "MessageIndex": 3107,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 11, 2010 02:18PM PLUTZ wrote:   Hi Ladies! Haven't been on in ages.  Holbolt-so sorry to read about your mom. My prayers are with both of you. I have been doing wonderfully. It has been a year in Jan. that I was diagnosed. Hard to believe a year has gone by. I pray I don't evedr have to go trough this again and also for all of you that have made it.  had a CT scan 3 weeks ago. Everything came out great. My doctor didn't think anything would be found. My hair is very thick and wavy. My 15yr old daughter straightened it and trimmed it for me. I didn't want to spend the money yet to get my hair done. There isn't that much to cut but it looks so much better. It was bushy around my ears. My eyebrows are still very thin. Is anybody elses still that way. Also my legs are very achy. Doctor isn't concerned but I think its from the Boniva. My physical therapy ended this week. My arm is still numb. Probably won't go away. I still can't raise it all the way up but I have exercises to do at home. I'll be setting up my appt. soon with my breast surgeon to get the ok for reconstruction which wil be the end of the summer. Can't wait. this breast form is annoying. It feels like 10lbs of weight. lol Take care and I'll stay in touch. Happy Valentines Day to all of you.",
      "MessageIndex": 3495,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 13, 2010 10:55AM PLUTZ wrote:   Hi ladies. I'm glad everyone is doing well. Renrel- I will be praying for your dad to recover. Today I am fasting for 24 hrs for my colonoscopy tomorrow. I am hungry! Liquids, chicken broth, orange jello and this nasty stuff I have to drink tonight. ugh. Other than that, things are going well. Had a checkup last week. went well. Not getting much sleep. Hot flashes and insomnia just don't mix. I'm about due to get my first haircut. It looks really bad. It sticks out everywhere and it is curly just like some of you said yours is too. I don't like messing with hair but I have to straighten it every time I wash it. Well going to heat up some broth for my lunch. Have a great day and I will let all of you know how my procedure went.",
      "MessageIndex": 3563,
      "PostDate": "13/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 21, 2010 11:15AM PLUTZ wrote:  Hi ladies.  Well my results came back from my colonoscopy and the 2 polyps were benign but the dr. said they were precancerous. All I need is another type of cancer.I'm so glad I made that appt. I also have another CT scan next month. There's still a pin size  something on my lung but  my Dr. isn't too worried. She thinks its from the radiation. Other than that, I feel fine. I'm glad everyone is doing well. Have a great week.",
      "MessageIndex": 3577,
      "PostDate": "21/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Apr 30, 2010 08:53AM PLUTZ wrote:     Hi ladies, Hope everyone is doing good. Next week, have an appt. with plastic surgeon. Can't believe 1yr is coming up. Cancer Free!  I can't wait for my reconstruction.      Happy B-Day kmmd.    JillyG- I'll be praying for you. Don't worry too much. It may be nothing. I have a couple of weeks before my CT scan  to check my lung. I try not to think about it.     mnmom- Glad you joined our thread. Everyone has been a blessing, through our good and bad days.",
      "MessageIndex": 3605,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 7, 2010 10:55AM PLUTZ wrote:         hi ladies! I hope everyone is doing well. I'm doing great. Yesterday my DH ran a 5k and my daughters and I did the 3 mile walk. It felt great. Last year I barely had the energy to walk across a room. I'm a little sore today but thats ok. My oldest daughter has left the nest. I was helping her move things the past couple of days. I'm sad but shes only 20 min. away. She'll be 20 Wed. She got a new job, so shes happy the way things are going. We're cooking out on the grill for her birthday.A week from today we will be on vacation. I'm so excited. Have a great week.",
      "MessageIndex": 3647,
      "PostDate": "07/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jun 20, 2010 08:45PM PLUTZ wrote:   Hi ladies! So glad every ones doing well. I have a regular checkup in 2 weeks. I'm feelling great but I am gaining all my weight back. Lost 23lbs  from everything last year and have gained 14. I don't know how to get it off. I walk alot. I try eating right. I'm thinking its all menopausal  and meds doing this. Other than that, not much going on. Just got back Fri. from vacation in New Mexico. Loved it. It was hot but I love the dry heat. Its so humid where I live. My sister is coming to visit from WV this week. I'm having a surprise 50th birthday party for my DH Sat. My older daughter moved out 2 weeks ago. It was hard but I see her all the time and talk to her every day. My younger daughter got her temps 3 weeks ago so I've been taking her to the mall parking lot to practice cuz our streets are very busy. She would freak out, so I'm hoping sometime this week to take her on our side streets. Well, getting ready for bed. Have a great week.",
      "MessageIndex": 3677,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Sep 13, 2010 01:06PM PLUTZ wrote:   Hi ladies!  I had an amazing day Sat. at the Susan G. Komen race. I met amazing women. There was so many people, it was overwhelming. It still wasn't right to see so many women that had breast cancer. But we are survivors. I ended up just walking the 1 mile cuz it seemed like by the time I walked through the main center and got lots of goodies it felt like I already walked 3 miles. I plan on doing it next year but I plan on walking the 3 miles. I'm feeling much better, still a little sore. I have another appt. tomorrow to get more saline. I'm getting there. Have a great week.",
      "MessageIndex": 3781,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Oct 2, 2010 09:36AM PLUTZ wrote: Hi Ladies!  Had my 3 month checkup and it went well. I also suffer from leg cramps and restless leg syndrome. Mentioned it to my Dr. and she prescribed Xanax. It didn't really work the first night. I guess it has to kick in. Got pumped up again in my breast. Its going to take awhile to get it the size I want. I keep going back and forth about breast reduction because  my left breast is large. Has anyone had it done and how does it look comparing it to the fake one? My Dr. said they will not be the same so I'm confused on what to do. Ladyjane-Good Luck on the walk. I loved it when I went 3wks ago although I could only walk the 1 mile. My husband and I are going away for the weekend for my birthday which is Oct 5th. Its cold and rainy. Oh well. Have a great weekend.",
      "MessageIndex": 3814,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 6, 2011 02:14PM PLUTZ wrote: Hi ladies- well saw the orthopedic dr. yesterday. the good news is that I don't need surgery. The bad- the radiation damaged some nerves in my shoulder and neck so I can't lift my arm up much. It is the same side as my surgery. I had physical therapy after I had  my mastectomy but it didn't help much then. Now I know why. Tomorrows the big day. I'll keep you posted",
      "MessageIndex": 3942,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 9, 2011 12:40PM PLUTZ wrote: Hi ladies!  Had my exchange and breast reduction. It took 2 1/2 hrs and 2 hrs recovery. I was in  lot of pain Fri. Slept alot. The meds make me sleepy. Its all I've been doing ths weekend is napping. Thank God my DH and DD are helping out. I get dizzy and can't stand for long. I see the dr. Tues. My boobs are alotsmaller than I anticipated, but I can live with it. I was huge before so It's actually a relief. I'll be able to wear cute bras! Well its nap time again. Have a good week.",
      "MessageIndex": 3946,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Jan 9, 2012 02:14PM PLUTZ wrote: Hi ladies. I'm doing ok. Still have my coughing episodes. Had a checkup last week. Too soon to tell if the Armidex is working. Have an appt. next week. Had a bone scan last Fri. I was on a clinical trial and was taken off of it when the cancer came back. From my last MRI, is when some nodules were found on my lung. I can't recall why I had the biopsy on my neck. I think  it was from this bump that they thought was scar tissue from the radiation and it seemed to have shifted. All in all I feel ok. I got  a different prescription for my sleeping pills. They seem to be helping. I sleep more but still don't have much energy. I hope your all doing well.",
      "MessageIndex": 4178,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Feb 26, 2012 04:27AM PLUTZ wrote:   Hi ladies. I'm glad your all doing ok.I'm doing ok. Haven't heard back from my scans, I'll call Mon. Renrel- I was on that clinical study ibandronate. Was taken off of it when my recurrence  happened. I hope it works for you. How long have you been on it? I still have the shortness of breath. My resperatory therapist said its still from the pneumonia. My dr. refilled my prednizone. It seems to help a bit. It also gave me my appetite back. I've lost 16lbs since I got sick. I'm hoping it stays off this time around. lol  I have other good news, not related to cancer. We sold our house that has been on the market since Nov. Had to take a deep cut, but the markets so bad. I'm just glad we're finally getting things going. I'm tired of all the home showings, especially when I'm not feeling well and I have to leave for an hour or more. Hopefully this guys financing goes through. He was preapproved. As soon as we find out, we will get our paperwork going. We are already approved. We've had a hold on our new home since last Aug. I'm so ready to move. Well I'm going to try to get back to sleep. It is 4:30am. I have insomnia really bad. Any ideas to get some sleep would be appreciated. Thanks",
      "MessageIndex": 4208,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Mar 12, 2012 01:02PM PLUTZ wrote:    Hi Ladies. Well I start chemo tomorrow. Thankyou all for the hugs and prayers. I'll  keep in touch.",
      "MessageIndex": 4214,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "PLUTZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77356/profile",
      "Content": "Sep 4, 2012 01:56PM PLUTZ wrote: Hi Ladies, Well, I start the xeloda pills tomorrow. Have an appt. in 3 wks. hopefully they'll start working.",
      "MessageIndex": 4256,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    }
  ]
}