{
  "AuthorID": "poeticrevol…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104614/profile",
  "Posts": [
    {
      "AuthorID": "poeticrevol…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104614/profile",
      "Content": "Jun 19, 2013 06:13AM poeticrevolver wrote: I am so very sorry to hear what you are going through Red_R. I was dx in June of 2010 with IDC. I know how you must be feeling right now. Breathe! You will get through this! Please try to take some time to yourself. Relax. Rest. Remember, we are here, and we all have similar experiences. Please vent, talk, etc. I does seem to help just getting the overwhelming feelings out. I will be praying for you. God bless you and sending big hugs your way(((((((((((((Red_R))))))))))))))))).",
      "MessageIndex": 12,
      "PostDate": "19/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/805719",
      "Title": "Biopsy yesterday Red_R poeticrevolver"
    },
    {
      "AuthorID": "poeticrevol…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104614/profile",
      "Content": "May 11, 2013 09:04AM - edited May 11, 2013 09:06AM by poeticrevolver Hey Deb. I sure know what you are feeling right now. I was 32 when I was dx with bc. I am now 35, now waiting on biopsy results from LAVH, and lymph node removal.  I know it is overwhelming right now, not knowing for sure....it's really hard. I too have anxiety issues, and know how much it can worsen things. Try to find things to calm yourself, prayer, meditating, reading, music, etc. I do take ativan, and it def helps!!  One thing I can advise, don't let anxiety mask everything else! When I first went to bc speacialists, they all blamed it on the anxiety, go figure! I too had many calcifications, on both sides, and turned out most of them were just cysts. One did turn out to be cancer, but, it could have been much worse. Thank God it wasn't! I also was dx with chronic late stage lyme disease the same year. I do know that a flare up with lyme can affect all the lymph system. I still deal with it on a daily basis.  If you have any questions Deb, please don't hesitate to ask. I've been dealing with Lyme for what seems a lifetime now. Let's pray that the tick you found was just a normal little tick, no lyme! Try your best to not focus on the suspicious findings, it can   really drive a person mad. Find a doc who will truly take time with you, listen, and is through, and don't be afraid to ask for another opinion, and yet another. It is your life, your body, only you truly know what is the norm for you, and please don't be afraid to vent, share, ask away. We all need eachother's support and encouragement! I will keep you in my prayers! God bless you!",
      "MessageIndex": 3,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804489",
      "Title": "back already :( debmc1958 debmc1958"
    },
    {
      "AuthorID": "poeticrevol…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104614/profile",
      "Content": "May 11, 2013 11:02AM poeticrevolver wrote: I'm sorry you're having a difficult time of it. Just know, you are not alone in this. You will get through this Deb:-) It's been a very rough 4 years. Cancer, lyme , surgeries, chemo, radiation, and yes IV antibiotic therapy for lyme. It was truly insane! Lyme hit me so hard at 31 yrs old, was stuck in wheelchair for 5 months straight. Went from very active mom to totaly disabled. Could'nt feed myself, could'nt dress myself. This is why I fight so hard, why I share my story. If you catch it early, lyme that is, well, cancer too...you have a much better chance of survival.  The treatment I did was IV rocephin, every single day for 21 days. At day 12, I developed a 104 temp and head to toe rash. The doc said I was allergic to the rocephin! Believe it or not, it was actually starting to work, I went itnto a herxheimer reaction, which means your body actually gets much worse as it's getting better. Weird, yes. Painful, yes. I had to stop right away. Because breast cancer was found just about two months after, I put the lyme on hold to fight the cancer. Hodgkin's then hit, and then all the rest...to this day, I am afraid to treat the lyme disease. I am convinced that if I attempt antibiotic treatment, it will cause all the other disease's to flare up and worsen.  I have had to just hand it over to the Lord. I can't deal with all of this. It's just too much. I really don't know if I would even be here if it weren't for the Lord and his love. I daily pray for his strength and patience. Right now I am waiting on more results Deb. I had a total hysterectomy on April 30th , and the gyn. oncologist also removed lymph nodes that were enlarged at the site of surgery. Wow, being thrown into surgical menopause is the pits!! I'm starting to annoy myself!! Moody, irritable, crying a whole lot, hot flashes, cold flashes, swollen lymph nodes popping up everywhere. In places I did'nt even know they were!! The doc believes there may be cervical cancer, or possibly something else in the same area. That's whay I had the surg. in the first place. Anyways, so sorry if I am rambling on here, I've been very chatty lately:-) Maybe the serious lack of hormones??  I sure hope you find a great doctor Deb, and don't give up. You will find answers, and hopefully sooner than later! ~Have a great day!",
      "MessageIndex": 7,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804489",
      "Title": "back already :( debmc1958 debmc1958"
    },
    {
      "AuthorID": "poeticrevol…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104614/profile",
      "Content": "May 11, 2013 09:57AM poeticrevolver wrote: Yes, I sure did. Enlarged lymph nodes in both armpits and groin area, oh and in my neck. It was, in my case, what caused some confusion between the Lyme and cancer. I was also dx that same year with Hodgkin's lymphoma. Literally four months later. Talk about worst year ever!  Lyme disease attacks your lymphatic system, very similar to how cancer attacks. It is a tricky disease Deb. I would def advise you to get a blood test. Not just any blood test though. There is a lab in CA called IGENEX, you can check it out on their website, IGENEX.com. They will send you a lab kit, and paperwork. Most insurance covers it. It is a very specific test, not only can it detect Lyme, but it is able to detect any of the 300 co-infections that you can also get from a Lyme infested insect. Yes, you can get it from not only a tick, but also lice, mosquito, sand flea, and some others. It is a bit scary that a lot of the US is uneducated and misinformed about Lyme Disease.  I tested positive for lyme, and four co-infections. Each one is different in how it affects our bodies.  Again, I pray to God you will not have to deal with this terrible disease.  ~:-)",
      "MessageIndex": 5,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804489",
      "Title": "back already :( debmc1958 debmc1958"
    },
    {
      "AuthorID": "poeticrevol…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104614/profile",
      "Content": "Jul 10, 2010 01:14AM poeticrevolver wrote: Hello  Lisa! I don't have an answer for you either, I have'nt even had my lumpectomy yet. I just wanted you to know that I'm thinking of you and I hope everything is fine. I understand what you're saying. Telling someone to relax is so much easier said than done. I will pray god gives you peace and strength while you are waiting on results. I know waiting is difficult, but just know we are thinking of you.:-) God Bless",
      "MessageIndex": 3,
      "PostDate": "10/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755135",
      "Title": "Mammo Call Back-Ovoid 5 mm nodule AMP47 AMP47"
    },
    {
      "AuthorID": "poeticrevol…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104614/profile",
      "Content": "May 24, 2013 08:43PM poeticrevolver wrote: Hello ladies! God is so great! All was negative for malignancy! So we still have more testing to come regarding the lymphoma and breast cancer, however, this was the biggest scare for me, and now we know it's clear. FYI-the doc suspected cervical cancer, due to previous squamous cell showing up on cervix. Miracles do happen! I'm going to just keep praying for the The Lord to heal the rest of my issues. Oh, btw, this instant menopause I was thrown into after my total hysterectomy, well it was pure hell at first, but now I'm doing just fine! Without any hormones! God is awesome! Thank you all for your prayers and encouragement! XOXO",
      "MessageIndex": 8,
      "PostDate": "24/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804919",
      "Title": "Get pathology results this Wednesday! Please pray! poeticrevolver debmc1958"
    },
    {
      "AuthorID": "poeticrevol…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104614/profile",
      "Content": "May 21, 2013 10:38PM poeticrevolver wrote: So, it's the night before I get my results . Feeling a bit nervous. Please keep me in your prayers. God bless you all!",
      "MessageIndex": 4,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804919",
      "Title": "Get pathology results this Wednesday! Please pray! poeticrevolver debmc1958"
    }
  ]
}