{
  "AuthorID": "poetjanet",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88085/profile",
  "Posts": [
    {
      "AuthorID": "poetjanet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88085/profile",
      "Content": "poetjanet wrote: I've been seeing my chiropractor about every two weeks since I started my surgeries to try to keep my back from going out.  His treatments are rather gentle in that he just uses something called, the activator method, which is llike pressing the button on the end of an ink pen onto your body, as best as I can explain it.  However after 9 radiation treatments,  laying face down on his table was too much for my sore radiated breast.  He had told me when I told him about the breast cancer that he treats some of his breast cancer patients sitting or standing.  I wish I had realized that I couldn't lay on that table any more. My pain level shot up from a 4 to an 8.  I thought it would be better after I got off the table, but continued to hurt quite a bit still that evening and the next day. Glad I have one more day to recoop before I have to go back for more radiation treatments!  Just wanted to put this out there for anyone else who goes to a chiropractor and hasn't laid on the table since rads started.  Some chiropractors have tables with release sections in them, but the one I go to does not. Dx 8/13/2009, DCIS, 2cm, Stage 0, Grade 3 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/743910",
      "Title": "chiropractic table during rads,ouch! poetjanet poetjanet"
    },
    {
      "AuthorID": "poetjanet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88085/profile",
      "Content": "Aug 31, 2010 11:53PM poetjanet wrote: Hello, decided to do a search on radiation and rib pain; and found your thread here.  I finished rads Dec. 21st, 2010; and just now developed this rib pain; and told it was Costochondritis; alias: rib arthritis.  Didn't dawn on me til several hours later; why just this one side, where I had the breast cancer and radiation.  Low and behold, all of you here complaining of the same pain.  I'm putting up a new post saying we should all be able to have a lead apron to protect our ribs! Thank you so much for posting everyone!",
      "MessageIndex": 24,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721487",
      "Title": "Radiation and Rib Pain tomatojuice BarbW"
    },
    {
      "AuthorID": "poetjanet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88085/profile",
      "Content": "poetjanet wrote: Hello fellow sufferers,  both current and past.  I wanted to find out who of you is or has turned pink with your radiation during your first or 2nd week.  I turned pink on day two.  I put lily of the desert aloe vera gel, on and it helped, but would turn pink again after a few hours. My breast feels sore and irritated inside and outside. I am quite concerned, as I am told that it is rare to turn pink this early.  Did anyone else turn pink this early, but not get any worse down the road?  Want to hear your experiences, and what you think did or would have helped to make it better.  I look forward to hearing what you all have to share. Dx 8/13/2009, DCIS, 2cm, Stage 0, Grade 3 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/743738",
      "Title": "pol- turn pink in week one or two? poetjanet LRM216"
    },
    {
      "AuthorID": "poetjanet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88085/profile",
      "Content": "Nov 12, 2009 09:44PM poetjanet wrote: Hi Linn, So sorry to hear about the swelling with 2lbs of fluid! ouch!  I had fluid build uo after my re excision.  That was so painful.  I pray that it subsides quickly! besides the aloe vera gel, I am using the cream they gave me to use.  It is called, \"Bard special care cream.\"  They sell it at CVS.  I had to ask the pharmacist about it though, because they didn't have it on display.  He says it is a special order. They told me that I needed to use that lotion \"because\" of the vitamins in it, that I would need down the road.  It has vitamins A, B5, D, and E.  They told me I could only take a multi vitamin, but apparently they feel getting it from the cream is different.  Today will be treatment #9. What treatment # are you on? Hello Shirlann Thank you for sharing your experience.  I'm glad you did so well! Hi Linda, Hope the aloe and aquaphor mix works well for you. Konakat! So sorry to hear about turning beat red on day 2!  I would have been petrified to go back again! What kind of cream did they give you to use?  Glad to hear it went away after your treatments.How long did it take for the fatigue to go away?",
      "MessageIndex": 5,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/743738",
      "Title": "pol- turn pink in week one or two? poetjanet LRM216"
    }
  ]
}