{
  "AuthorID": "poisedandpink",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281903/profile",
  "Posts": [
    {
      "AuthorID": "poisedandpink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281903/profile",
      "Content": "poisedandpink wrote: This Post was deleted by poisedandpink. Diagnosed at 33 Dx 10/9/2018, LCIS/ILC/IDC, Left, 6cm+, Stage IIIA, Grade 2, 2/6 nodes, ER+/PR+, HER2- Chemotherapy 11/30/2018 AC + T (Taxol) Surgery 4/4/2019 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy Xeloda (capecitabine) Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy Whole-breast: Breast, Lymph nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870686",
      "Title": "Neoadjuvant chemo blood counts before surgery - normal? poisedandpink poisedandpink"
    },
    {
      "AuthorID": "poisedandpink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281903/profile",
      "Content": "poisedandpink wrote: Hi All, I finished eight round of chemo in March. Four of AC and four of Taxol. I previously had a lymph node biopsy that was negative. I had a double mastectomy where during surgery six lymph nodes were removed and also tested negative. However, after further testing my pathology report was returned and two of the lymph nodes testing positive for micrometastasis. My breast surgeon feels confident that the amounts were so small that radiation should take care of anything in my lymph nodes so I do not need additional surgery to remove any more. He did mention that my tumors while they did shrink enough that margins were clear to save my skin and nipples (I had two tumors) still had active cancer cells in them so it was considered residual. He mentioned that my oncologist would put me on an oral chemo. He said the side effects are less harsh and I would not lose my hair again. I\"m freaking out. My oncologist is out of office so I'm unable to meet with her until next Friday. I've never felt like I could die from this more than I have once I received this pathology report. Is residual cancer normal with stage 3 ER/PR+ cancer? I'm terrified at the thought of more chemo. Its been a hard past few months, but I was mentally getting better thinking I only had radiation left to do not more chemo. Does anyone have experience with this? Diagnosed at 33 Dx 10/9/2018, LCIS/ILC/IDC, Left, 6cm+, Stage IIIA, Grade 2, 2/6 nodes, ER+/PR+, HER2- Chemotherapy 11/30/2018 AC + T (Taxol) Surgery 4/4/2019 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy Xeloda (capecitabine) Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy Whole-breast: Breast, Lymph nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/871097",
      "Title": "Residual Cancer after Neoadjuvant Chemo poisedandpink poisedandpink"
    },
    {
      "AuthorID": "poisedandpink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281903/profile",
      "Content": "poisedandpink wrote: I am curious how other oncologist monitor after treatment. I'm seeing an oncologist at MSK who let me know that once I finish my radiation and then six months of oral chemo there is really nothing they do to monitor. I'll see her every six months, but more-so for a check in. They don't do tumor marker blood test or even PET scans. In fact, I've never had a PET scan since they do not have a reason to believe I need one at this point. She mentioned that tumor markers are not effective and that PET scans often lead to false positives and unnecessary biopsies. I'd only get a scan if I develop symptoms that warrant it. I want to trust my oncologist as MSK is supposed to be pretty reputable but is this normal for Stage 3? Diagnosed at 33 Dx 10/9/2018, LCIS/ILC/IDC, Left, 6cm+, Stage IIIA, Grade 2, 2/6 nodes, ER+/PR+, HER2- Chemotherapy 11/30/2018 AC + T (Taxol) Surgery 4/4/2019 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy Xeloda (capecitabine) Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy Whole-breast: Breast, Lymph nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/871260",
      "Title": "Monitoring after treatment? poisedandpink poisedandpink"
    }
  ]
}