{
  "AuthorID": "pokie88",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
  "Posts": [
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Oct 30, 2016 02:02PM - edited Oct 30, 2016 03:12PM by pokie88 Hi. I am new today in posting but been reading. 44 yrs old premenopausal- 4 kids-married 28 years I am wondering if anyone has an opinion on my question on but feel need share last year of mammo/us and a new thing: ok- felt peanut like knot under arm had first screening mammo called back for US said benign dead lymph node under right arm, best to leave it alone and repeat mammo 4-5 months so did that 4 more times over past 1.5 years- mammo called back US said ok swelling in stomach with itchy breast and fuller breast very tender nipples on both- made appointment gyno tuesday 18th- ordered uterine d&c & ablation monday Oct 23,2016 CAUSE UTERUS THICK? had mammo Friday afternoon 10/21 Surgery Monday 23 went fine but called next day from gyno to set up surgeon appt said need biopsy right breast density change? he's out of town so his staff made US appoint 11/1 and consult on Nov 7, 2016 to discuss biopsy I know after all these call backs and weight gain, itching on breast fullness that most likely is early BC- question is- after so many mammo and US i need him not to miss it! what can i do get accurate results?! A NEEDLE WON'T MAKE ME FEEL BETTER NOW! general surgeon- what if he insists Fine needle?????? that will leave me worried oh and prolly nothing but serious chin prickling daily for a month or so?!! annoying! anyone else by slim chance? silly maybe but ???",
      "MessageIndex": 7,
      "PostDate": "30/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 7, 2016 10:23PM pokie88 wrote: thanks but it may be better if I could sleep! Anyone else get a lumpectomy and end up with more coming off than surgeon expected once he got in there ?",
      "MessageIndex": 32,
      "PostDate": "07/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 2, 2016 05:29AM pokie88 wrote: had my US sound yesterday, tech said she sees 2 tumors with 2 nodes definitely enlarged and a 3rd somewhat so she said it is her opinion after 12 years with this surgeon he will not use a needle he will do a lumpectomy she feels quite certain... she also kept saying this area here with the shadow has several layers of increased density??? she explained that both tumors with a shadow are on the outer quadrant that leads to my nodes\".. my question here is now that I have heard it and she showed me the area that would have to be removed for a lumpectomy is has anyone else chose or told to have a lumpectomy for biopsy? second thing here is any similar or info please respond- need support bad as my husband says he don't see the big deal if i need to cut off both of them..i do however feel like they are part of my femininity?",
      "MessageIndex": 17,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 2, 2016 02:33PM pokie88 wrote: i did talk to my husband and he says he is just worried...to which i said as am I! so we will still need to work on this but i appologize that i wasn't clear about my main question which was/is- has anyone else had a lumpectomy with aux node for the first biopsy? and one other response is if he were as scared as I am, I would be as strong and loving and care for him on every level! He is the love of my life still and USUALLY my best friend.... and after 28 years of marriage, divorce is not even a possibility, however, i do not know how to explain how very much i need him without being over dramatic since we are having surgery but for biopsy not yet confirmed BC... i welcome any and all input to both issues as well as one more question- am i supposed to know \"shadowing from tumor in upper outer quadrant involving 2 maybe 3 nodes\" is bad from looking at it?or did i miss something?",
      "MessageIndex": 19,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 5, 2016 07:49AM pokie88 wrote: Thanks Mustlovepoodles and Hopeful for the responses.. He has told me that the comment was intended to indicate he loves me so much that he would much rather lose just my breasts than me..he and I have been together for 30 years( started dating at 14 n he was 18 we married when i was 15 and he was 19 and in the military) married 28 yrs now and have 3 grown married kids (5 grands with a boy gran on the way) and a 10 yr old daughter still at home ( great surprise there yes!). he has always been the kind of person that treats me equally strong which in MOST cases i appreciate- we own a business and work together as well... very little time apart that we enjoy for the most part lol. He had a serious heart attack in 2014 and i was there in icu with him like glue and as strong as robotic mode will take one in a scare like that. (He is now 48 and I am 44 fyi) he has aggressive diabetes so I worry about his sugar and heart a lot. He has lost weight the last 2 months and i am begging him to go to the dr ( more than his pcp) and he does the same thing about his own health- if he don't hear it or see it, it's not there! kills me but i love him for him good and bad parts. we will continue to talk through these things as I do need him NOW! next question for ya though or anyone who reads this and relates- what sent me to the dr was getting very and i mean very swollen abdomen like from a flat stomach to looking 6-7 months pregnant over a week time with ab cramps low, gyn said it was from thick uterus and she insisted surgery to do d&c for biopsy with ablation (burn up my uterus) which \"could be related to breast cancer so I am also ordering a mammogram\". i told her then about my pcp having sent me for screening mammo in early 2015 which radiologist then asked for US of right breast, followed by report to watch \"suspicious area\" every 4-5 months. now if you are still reading this BOOK lol, i know NOW that I should have after the 2nd or definitely the 3rd mammo followed by US asked for another opinion, and my hubby has related frustration that he did say that last year..anyway- I had the uterus surgery 2 weeks ago almost and no biopsy back that i know of since the day after surgery 2 days after mammo- she called asking what surgeon i wanted for breast biopsy- then surgeon staff sent me for this last US in which radiologist tech told me about the \"funky mess\" with the nodes enlarged etc as stated above and she meant well as she was saying this to emphasize not to let it go longer if this surgeon doesn't take this serious.. so finally the question- i didn't lose weight, i am still very bloated- and i feel ill, like so weak and tired with upper back and neck bones hurting, can not eat much at a time..and this is so not like me when i have things to do and i haven't even been to the office but 3 times in a month! my pcp says he don't know what to say except wait for my surgeon to instruct us which i see him Monday- and no i can't just see someone else as my insurance is dropping me dec 31 already and we need $2500 this week in addition to what we paid out already that's not covered. we don't have it without me working full time too. so i am stuck here for now unless i get a biopsy back that is definitive enough to warrant a pre approval for my insurance to send me somewhere to a bigger city/facility.. question being did anyone feel ill as most posts say they felt great when diagnosed?",
      "MessageIndex": 24,
      "PostDate": "05/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 9, 2016 08:16AM pokie88 wrote: that's what i meant is no specializations in any one area- still was hoping if anyone knew if the surgeon can HONESTLY tell by lumpectomy if it LOOKS cancerous or not? to his eyes i mean.. i am in pain- took 2 pain pills ( norco 5) and still feeling like my nipple was ripped off with stab pains in breast and arm...anyone else get that? i wish they would call with results man am i worried and need to know one way or another!",
      "MessageIndex": 36,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Oct 30, 2016 03:16PM pokie88 wrote: ty for the reply- gyno has replied nothing to my calls except see the surgeon- what can i do to get a breast doc as i would have to look about 100+ miles from rural small towns down south!",
      "MessageIndex": 9,
      "PostDate": "30/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Oct 30, 2016 03:18PM pokie88 wrote: oh- and not weight gain as much as sudden ab swelling like 6 month preg and the dx of node was by US",
      "MessageIndex": 10,
      "PostDate": "30/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 1, 2016 05:42AM pokie88 wrote: ty kicks- here i go to US for surgeon- my hubby shocked me this am with a remark that he \"is sick of me\" already which shocked me since the only issue i have mentioned to him is my not able to get comfortable to sleep after uterine surgery last mon... oh well i guess...",
      "MessageIndex": 16,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 5, 2016 07:51AM pokie88 wrote: ranita- anything that grows can press on nerves, obstruct blood flow and many other reasons I can think of why it should come out in my opinion",
      "MessageIndex": 25,
      "PostDate": "05/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 6, 2016 07:13PM pokie88 wrote: no i see the surgeon tomorrow to decide about lumpectomy only dx is from the radiologist confirmed mass of upper outer quadrant of more than 2 cm with 2-3 nodes enlarged so i have a consult with a general surgeon tomorrow afternoon- however his staff already requested pre auth from my ins for lumpectomy after he received US results on wednesday last week.. the ablation has not done anything yet except keep me cramping and i am so bloated and swollen in my belly with sore breast and under arm on the right side like after having a baby but it is also now dimpled and shaped strange with my nipple red and sideways.. i wonder though why after 2 weeks tomorrow after ablation i hurt so much in my breast back and stomach with incredible tiredness and headaches and like the flu really but no fever. praying i get some answers tomorrow. i see the symptoms of ovarian cancer but transvag US showed ovaries look good?",
      "MessageIndex": 28,
      "PostDate": "06/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 7, 2016 07:10PM pokie88 wrote: lumpectomy tomorrow am- surgeon said no needle biopsy would be appropriate because of shadowing and blood flow and nodes greater than 2 cm also auxill mass 8 mm not a node so no choice was given surgery 6 am tomorrow",
      "MessageIndex": 29,
      "PostDate": "07/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 9, 2016 09:51AM - edited Nov 9, 2016 09:54AM by pokie88 sorry, that is the only term i know for it since that's what my surgeon called it- i am not trying to offend anyone- i have been through the mammogram and Us follow up every 5 months since Jan 2015 so now in one two week period i have had an uterus ablation d&c and mass removed from uterus with no biopsy back yet then pushed to surgeon who said surgery tomorrow no options in his professional opinion... my problem with all of this is a whirlwind of emotions but mainly the initial reason for going to gyn is still there..i look 7 months pregnant with pain in my pelvic area and right side.. and now from surgerys. again no intention to offend but the gyn went on vacation this week so i can not get any answers why the bloating hasn't gone away like she was so sure it would in a few days after ablation.. and i feel so not me",
      "MessageIndex": 40,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 10, 2016 06:25AM pokie88 wrote: thanks.. i understand that term better now. i am waiting for results.",
      "MessageIndex": 43,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 10, 2016 08:56PM pokie88 wrote: he said he does think it was causing some pain..what worries me about this diagnosis is i have swollen nodes in my neck among other places and the pain in my pelvic area and a constant pain in my back that is all sudden with onset of extreme fatigue, but mostly, and this may sound silly as it does to even myself, but i feel in my very being i am ill. i am not myself at all. i am a very busy happy person by nature, this all occurred within a few days and i am not depressed! i hate being down with the last two surgeries in 15 days.. but i feel the same as i did when i went to the dr just sore in the surgical spot added. i know it sounds silly, but i am not ok or if i am somehow, my normal of 44 years changed in a 3 day period. i am also like postpartum hormonal suddenly, like pms, yet i am not premenepasual as of a well check with doc a month before this all was normal. call me crazy i guess. something went wrong",
      "MessageIndex": 46,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 9, 2016 08:24AM pokie88 wrote: my surgeon gave me no choice as to what kind of biopsy- he said lx was only way to do this cause my US reports a 2.7 node and 8 mm mass in aux area birad 4 so would he say that to make my husband feel better ? he said\" I feel sure i got IT all out and then some. it will be biopsied and a call either way will come from me in 2 days. I am leaving the nodes alone for now and see if that was causing the agitation of them but i feel like it didn't look cancerous\" what the heck?! to me that's saying we will have another surgery to look at nodes ??",
      "MessageIndex": 38,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 10, 2016 01:43PM - edited Nov 10, 2016 01:46PM by pokie88 surgeon called said fibrocystic why do i feel scared still? i still am sore and way hormonal.. it scares me it may be false negative.... i'm not trying to be selfish here.. i feel in my core that something isn't right..",
      "MessageIndex": 44,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Oct 30, 2016 07:31PM pokie88 wrote: GP sent me to OBGYN surgeon who said the swelling was from uterus way thick and could be bi product of bc so she scheduled mammo and surgery to fry uterus in same week- same gyno called me to say she was setting me up with the surgeon for biopsy as radiologist report said \"increased density and enlargement in suspicious area\" they have been watching with US for about 18 months- so i scheduled the appointment with the only GS we have here but he's out of town this week so his staff had gyn schedule him new set US pics tuesday coming up before i am set to see him monday Nov 7 to \"discuss biopsy options\". so the swelling after surgery on uterus a week ago tomorrow is almost gone but still cramping some.. she sounds right but like I said after 5 US on same \"suspicious\" area i am just worried they not looking hard enough or they are missing something even not much faith in a GS now.. did research on the chin thing... turns up that the chin is usually only cancer or MS related and i was tested for MS in 2010 extensively from joint pain which was/is rheumatoid arthritis so maybe i should have NOT looked up the chin thing, it's just so aggravating i was researching ways to stop it..never dreamed it would be cancer related. my grandmother died of lymphoma and cancer of breast cervix etc runs high in my mom family and some in dads... i smoked for 25 years until this past feb. am i being paranoid or rightfully worried?",
      "MessageIndex": 12,
      "PostDate": "30/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Oct 31, 2016 05:33AM pokie88 wrote: i am not waiting for biopsy any longer than i have to- my question was about what if he insists on just fine needle??? i have read too many that had false negatives with dense breasts.. also wondering bout a better surgeon",
      "MessageIndex": 14,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    },
    {
      "AuthorID": "pokie88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241726/profile",
      "Content": "Nov 8, 2016 06:32PM pokie88 wrote: how long did it take biopsy to come back? had lumpectomy today hurts!!!! dr told my hubby he feels like he got it all but sending it to biopsy- he is a general surgeon- he told my husband it didn't look cancerous cancer looks a certain way?! finally read report birad 4 on mammo n US both.. so 2 questions really- how long for biopsy n can dr tell by looking at removed mass if it looks cancerous?",
      "MessageIndex": 34,
      "PostDate": "08/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    }
  ]
}