{
  "AuthorID": "polamom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
  "Posts": [
    {
      "AuthorID": "polamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
      "Content": "polamom wrote: Dun dun dunnnn!!    Ok, is it really so bad?  I go in for my 3rd Monday (12/20) and the doctor said I'll feel my worst with it.   With my other two treatments, other than the first three days, I feel pretty well.  Especially the 2nd week (I have it every other week) I feel about normal...except the baldness.  I was happy thinking well if the 3rd is worse and now I would say I'm at a 1 or 2 for how I feel than I might hit a 4 or something.  It'll still be good.    Then I talked to my g-aunt.  God love her! lol  She said well my husband stopped taking chemo (I was very young at the time).  I said really?  She said, \"Yeah he was fine until the 3rd treatment\"   LOL    Ahh!  So now I'm a bit concerned, especially since it is Christmas and I have young children.   What do you all think I should expect? Dx 8/18/2010, IDC, 1cm, Grade 2, 5/12 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762199",
      "Title": "A/C \"The Third Treatment\" polamom Wonderland"
    },
    {
      "AuthorID": "polamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
      "Content": "Mar 16, 2011 11:24PM polamom wrote: I have found the same thing as sushanna1.   In the beginning I was washing my hands like a banshee and the bends of my fingers were cracking and splitting and bleeding, I found aquaphor helped heal it, but it still happened repeatedly.  I laid off being such a 'clean freak' and it has helped tremendously.   May be yucky, but oh well.",
      "MessageIndex": 12,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/764256",
      "Title": "Dry Skin Advice Smile_On polamom"
    },
    {
      "AuthorID": "polamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
      "Content": "polamom wrote: This is so odd.  I noticed it first with my nose.  Like usually the sides of my nose are firm.  And lately I noticed they were soft to the touch, but the cartiledge on the tip of my nose is the same.  And then later I thought my stomach seems squishier and saw the pattern.   So I took note and my butt is also squishier and even my new diep boob is softened up.   I wonder if chemo affects fat cells somehow.   How bizarre is that?  lol    Anyone else?   (I just took my 2nd  A/C/Avastin or placebo treatment 12/6) Dx 8/18/2010, IDC, 1cm, Grade 2, 5/12 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/761913",
      "Title": "Chemotherapy making fat squishy? lol polamom lago"
    },
    {
      "AuthorID": "polamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
      "Content": "May 3, 2011 11:05PM polamom wrote: I had my first treatment today.   I had a simulation yesterday.  It was no big deal at all!  I was so worried.   I didn't feel a thing, but then again, my beast is numb from the reconstruction.  They said it'd not feel like anything though.  I just need ed to know for myself before I could calm down.  They drew on me more and put more stickers on me yesterday.  That's what they do here instead of tattooing.   They  give me a sample of miaderm to use.  Honestly pretty uneventful.   I was about 30 minutes in/out. Intwoplaces,  they told me to be very careful with the sun, even after radiation stops (because I have season passes to a water park).  She said they had a woman who wore a v-neck shirt that exposed some radiation area, after her treatment had stopped, got sunburned and it blistered and they had a hard time healing it.  Scared me enough I'm going to look for a rash guard to swim in.   I might be the only dorky mom in a rash guard at the kiddie pool, but that's ok! ;) ",
      "MessageIndex": 69,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "polamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
      "Content": "May 5, 2011 02:49PM - edited May 5, 2011 02:54PM by polamom Tammy,  I lie on my back for my treatment.   When I had my scans they had me lay with my head on a bean bag.  I put my arms above my head on the beanbag as well then they sucked the air out of the beanbag and it makes a hard mold so I stay in the same position every time.   I apologize if I told this already.   Now I just go in, derobe and lay on my back on a table with my head on my flat beanbag.   They move me around until the my marks on my boob are lined up with their laser light levels. ;)    One thing that did 'scare' me during my first treatment is that they move the table i lay on during the treatment once.  When it lurched it really scared me. lol  I just wasn't expecting it.    Kasey,   They gave me the miaderm (sp?) stuff there.  I have been putting that on.  I read something today about patting the stuff on instead of rubbing.  I've been rubbing.    I also broke down and bought some Emu oil that I found at the health food store.   Phew!   I put that on before bed.    I know this sounds gross, but i'm not going to shower daily (I will hit the high spots, as my mom would say, with a wash rag).   I'm going to work to preserve my good layers of skin I have now and not wash/scrub them off.  ",
      "MessageIndex": 87,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "polamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
      "Content": "May 12, 2011 10:38PM polamom wrote: Ducky, you might try putting that hand goop stuff that mechanics use on your gown to get the aquaphor stain out.   My mom used aquaphor on her burns 20 years ago.  It is tried and true.   I always thought it was odd that it was sold as hand cream when it is so good for burns.",
      "MessageIndex": 173,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "polamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
      "Content": "Jun 8, 2011 07:20PM - edited Jun 8, 2011 07:26PM by polamom Hey I have to say I can't complain about rads.  I don't have fatigue like I did with chemo.  The end of taxol about did me in.  I'm just not starting to be burned and I have 6 more rads to go, so hopefully it won't be too bad.  When they took of a wonky sticker today it took my hide off with it, so it is breaking down, but I can't feel anything because of my surgery.   It'll suck later bo be numb, but at this point it is a perk.  I can't wait to be done!!   I've won $2 and 3 tickets. lol slg2130 , I am jealous your armpit is getting radiation.  My doctor said he didn't do that that it seems there is enough radiation that gets to the area that there are rarely reoccurences in the armpit lymph area.    You see in my info that I didn't have many nodes out and almost half were positive, so I would have loved to have had the pit zapped good.   Further under my arm on my side did get radiation though.  Who knows.  You can only put faith in their hands and hope for the best The doctor told me to put hydrocortizone cream on the area.  Has anyone else been told to do that?   I use my emu oil, miaderm, aquaphor, and now hc cream.  ",
      "MessageIndex": 709,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "polamom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108822/profile",
      "Content": "Apr 25, 2011 01:24PM - edited Apr 25, 2011 01:25PM by polamom Hello, I had a mastectomy with immediate DIEP reconstruction.  My SNB was positive so I had A/C and Taxol starting in November and now I will be starting my radiation next week (first week of May). I went this morning and got my mark ups and CT scan.    I didn't get tattoos.   They marked me and put clear stickers over the dots to protect them until I come in next week.   On Monday I go in for my run through and Tuesday the real thing.  I asked my RO about preparation or instructions.  He said he had none.  I asked about deodorants and creams during treatment.  He said don't worry about it, that in the past doctors e use to be really hung up on that stuff and they've learned it isn't enough to be concerned about or affect the treatment.  He said wear whatever deodorant you want.  I said 'non-aluminum?\" he said it doesn't matter, the amount in it is so small it is insignificant.  He said if I had a thick area of lotion on my breast it would create a bolus, but again he wasn't concerned.  I guess his theory is we have enough to worry about already.    He said they'd give me some sample creams/lotions before I start.   If my radiation will be given in the same machine I was in today it won't be bad at all.  The CT tube is so much smaller (as in you pass in and out fast) than an MRI machine, so it didn't make me claustrophobic at all. ",
      "MessageIndex": 19,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    }
  ]
}