{
  "AuthorID": "Pooh6105",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167271/profile",
  "Posts": [
    {
      "AuthorID": "Pooh6105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167271/profile",
      "Content": "Jan 7, 2013 08:27PM Pooh6105 wrote: My initial biopsy was stopped due to striking a blood vessel and they had a hard time getting the bleeding to stop. The three samples were sent in, came back as inconclusive, and am now scheduled for a lumpectomy due to radiologists concerns and inconclusive pathologist's report. The waiting is both freightening and frustrating. I feel for you! Hang in there =)",
      "MessageIndex": 1,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798533",
      "Title": "Stereotactic biopsy GramM GramM"
    },
    {
      "AuthorID": "Pooh6105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167271/profile",
      "Content": "Pooh6105 wrote: Hello, I'm wondering if anyone can tell me what to really expect from my upcoming lumpectomy? I've had limited communication from my surgeon's office since telling me they weren't confident in my biopsy results due to limited tissue samples and inconclusive pathology reports. Brief History - Strong family history of BC and other forms of cancers. Myself, I had pre cancerous cells in my uterus and abnormal cells in my cervix. My first routine mammogram showed a spot which could not be felt. Was sent for a recall mam in which the radiologist asked a bunch of questions, but strongly suggested I see a breast surgeon. Breast surgeon orders additional mams and ultrasounds. 3 1/2 hrs and 5 procedures later, I was scheduled for a stereotactic biopsy which had to be stopped due to striking a blood vessel and having a hard time getting it to stop bleeding. I got a total of 3 samples. My surgeon called and said, good news, no cancer. A week later he calls back and says after reading the pathologist's report, looking at all the images from my 3 1/2 hrs of mams & ultra sounds, and an in depth discussion with my radiologist, he feels the best course of action is to do the lumpectomy. They are not confident in the pathologist's findings due to limited test samples. An inconclusive radial scar was brought up which is known to harbor cancer. There were a bunch of other large words and conditions brough up in the pathologist's report however nothing hard and conclusive which has led me to the lumpectomy. I'm a week away from my lumpectomy and I really have no information on how to prepare, what to do, what type of anesthesia will be used, or what my recovery will be like. Will I be in a full gown, will I have a catheter placed, will he remove the mass plus all tissue around the \"tentacles\" that are growing out of the mass or will he just remove the mass, leave the tentacles there, and just use the tissue outside the actual mass as his margin? I have to be at the radiologists office a couple hours prior to the surgery for the wire placement. When the hospital calls to inform me of my surgery time on Fri, will they also let the radiologist's office know so they know when to expect me or will I have to call them myself to let them know? My thinking is I will be wearing a gown, get to keep my pants on, right? I feel I have all the emotions of a newly diagosed BC patient, but no justification for those emotions since my biopsy came back good, but they don't feel there was enough tissue submitted and the radiologist feels very strongly this is BC. Very frustrated at the lack of information I've been given and frustration at inconclusive test results. Can someone please help me out with any information on what to expect or what will happen with prep and post lumpectomy and what to expect with the wire placement. Is that done with a local like what was used by the radiologist for my biopsy or will it be initiated by the surgical anesthiologist? I appreciate any help you guys can give me. I fell very lost and frustrated right now with lack of information. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798534",
      "Title": "New with questions on upcoming Lumpectomy Pooh6105 Moderators"
    },
    {
      "AuthorID": "Pooh6105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167271/profile",
      "Content": "Jan 8, 2013 12:27PM Pooh6105 wrote: Sarah, coming from a strong family history of BC and going through the uncertainty phases myself right now, as scarey as it is, you really need to see a dr about your lump. My family has a strong history of cysts as well. A cyst is very common  at any age in any reproductive organ (I had many that were observed while going through infertility and IVF) No one can take the place of a dr or radiologist in diagnosing your lump. At any age, any lump should be checked out. There is such a wide variety of reasons for your lump that it could be something as simple as young hormonal changes or it could be serious as in BC or any number of things in between. Unfortunately, BC does not just affect \"older\" women as my 39 yr old cousin recently found out. Honey, as hard as it may seem right now, you should have a dr you feel comfortable with that you should be having routine breast exams. Early detection is the key to good breast health. Your dr may be able to put your fears at rest or refer you to someone with experience and knowledge familiar with breast health to better determine what your lump is. On a positive note, my sister found a lump, went to her dr and the two of them decided on a wait and see approach and her lump disappeared on it's own. Yours could be something or it could be nothing. But without a physical exam by medical personnel, there is no sure way to know. The earlier the detection, the better your treatment options are.",
      "MessageIndex": 6,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798531",
      "Title": "Please read and give me advice... lackofcreativity GramM"
    },
    {
      "AuthorID": "Pooh6105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167271/profile",
      "Content": "Jan 8, 2013 09:37AM Pooh6105 wrote: Hi there. I just thought I would mention my cousin found a lump at age 39. Went in for a mam to have it checked and her dr didn't feel a need to do anything with it for now. She insisted on a biopsy, was ref. to a breast surgeon who also didn't think it was anything and also wanted to wait 6 months. Again, she insisted on a biopsy and was found to have stage 1 BC in the one lump she felt. There were a total of 3 masses but she only knew of two. Would she have been much worse off in 6 months had she taken the wait and see approach, maybe, maybe not. But her insistance is what found her BC. It's your health and as hard as it is to try not to offend your dr, you need to know for you and your peace of mind.",
      "MessageIndex": 8,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798543",
      "Title": "Will I regret 'waiting and seeing'? hbranden9 hbranden9"
    }
  ]
}