{
  "AuthorID": "poojean",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68063/profile",
  "Posts": [
    {
      "AuthorID": "poojean",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68063/profile",
      "Content": "Jun 11, 2008 05:17PM poojean wrote: I agree with \"too young\"  I went completely bald and tried to wear a wig and hated it.  Family members went out and shopped for kerchiefs for me to wear.  One of these was a dew rag that  was bright red with skull and crossbones.  I wore it every time I went for chem treatment because I feel all the treatments are barbaric.  I usually got into the chem very fast because I did get looks being bald with this bright red kerchief.   I wear my pink ball cap and I get a lot of smiles from other survivors every day.  Bald is only temporary but life is forever enjoy your life.",
      "MessageIndex": 22,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706996",
      "Title": "Mourning for my hair Sable MsKarin"
    },
    {
      "AuthorID": "poojean",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68063/profile",
      "Content": "Jun 11, 2008 07:59PM poojean wrote: I was faced with the same choice and of course doctors would not give advice of whether they would just leave the breast or have a complete mas.  I choose a complete Mastectomy because I did not want to have the shoe to drop later in life and have to to go through this again.  I am now 6 months out finished with Chemo and going through reconstruction.  I would suggest you look at your age, and whether you were a person who  can not face yourself in the mirror every morning with no breast (and bald) and not laugh at yourself for not being vain and proud that you made it.",
      "MessageIndex": 16,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706946",
      "Title": "Anyone? Lumpectomy vs. Mastectomy w/No Re-occurance???"
    }
  ]
}