{
  "AuthorID": "portiasproudmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56244/profile",
  "Posts": [
    {
      "AuthorID": "portiasproudmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56244/profile",
      "Content": "portiasproudmom wrote: Hi ladies.  I'm participating in several conversations currently, but I thought I'd open this new thread in case anyone else is having this problem.  I'm a little concerned about my recent weight loss.  I've had my lumpectomy (Sept. 6) and am waiting to start chemo.  I know I should probably be \"beefing up\" a little prior to chemo, but I can't seem to do it.  I dropped about five pounds when I was first diagnosed--no appetite and stressed to the max.  Since then though, I've had a good appetite.  In fact, I've been eating like a horse for the past couple weeks.  The problem is that I've lost another five pounds.  I'm even on antidepressants that have a side effect of weight gain.  Has anyone else experienced this?  I'm a little alarmed, because my radiology oncologist asked me if I'd been losing weight.  At that point, I was only down about seven pounds.  He seemed a tad concerned, but I told him it was probably due to the stress of the diagnosis, so he dropped the subject.  Does stress quicken the metabolism in some people?  I just don't understand.  Could I have mets??  I was node negative!  Here are my specifics:  IDC, Stage Ic, Grade 3, 0/3 nodes, and HR+/PR+. I'd appreciate any input. Hugs, Karen Dx 8/27/2007, IDC, 1cm, Stage I, Grade 3, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/693122",
      "Title": "Losing weight--should I be worried? portiasproudmom NancyD"
    },
    {
      "AuthorID": "portiasproudmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56244/profile",
      "Content": "portiasproudmom wrote: I just dug out my radiation paperwork and noticed that I wasn't supposed to use any lotions on my tx area without consulting my radiology oncologist.  Oops!!!  I'm four weeks into tx and I've used Curel lotion on my tx area every evening after my shower.  Were any of you advised NOT to use lotions such as this during rads?  There isn't a sunscreen in it or anything, so I can't imagine it would hurt anything, but I'm still paranoid.  Help!  I'll be worrying about this all weekend now! Karen Dx 8/27/2007, IDC, 1cm, Stage I, Grade 3, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/703441",
      "Title": "Use of lotions during radiation portiasproudmom gsg"
    }
  ]
}