{
  "AuthorID": "portypup",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63269/profile",
  "Posts": [
    {
      "AuthorID": "portypup",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63269/profile",
      "Content": "Sep 12, 2008 12:58PM portypup wrote: thank you all for sharing your stories. I have sent Millissa copies of your emails. She only wants to hear good news she is so afraid that's she's going to die. I keep telling her that she can't be cured but she can be treated. Randi",
      "MessageIndex": 8,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721047",
      "Title": "please help portypup kgrimm"
    },
    {
      "AuthorID": "portypup",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63269/profile",
      "Content": "portypup wrote: I need some positive stories to share with my friend Millissa who just found out today that the cancer is back. Millissa was diagnosed at 32 er/pr+ with 18 malignant nodes. She went through chemo TAC, lumpectomy and radiation. Fours years later (approx 1 year ago) the cancer came back in her leg. She went through 6 months of chemo and radiation. Her hair is finally growing back and today she learned that her tumor markers are elevated to 70 something she has pain in her tail bone and the doctor ordered a pet scan. Millissa is scared and she asked the doctor if she is going to die and he said he didn't know. BTW I met Millissa when I was going through chemo. Can anyone share stories of women that are surviving and living many years with stage IV breast cancer. I need to find ways to help bring her spirit back and give her hope, she's only 37. Hugs! Randi Dx 5/8/2007, IDC, 3cm, Stage IIB, Grade 3, 2/16 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721047",
      "Title": "please help portypup kgrimm"
    },
    {
      "AuthorID": "portypup",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63269/profile",
      "Content": "Sep 12, 2008 03:01AM portypup wrote: I am so sorry for your loss my dogs (portuguese water dogs are my whole world) your dog was loved very much and you made the right be it hard decision! Randi",
      "MessageIndex": 4,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721045",
      "Title": "My doggie passed away from cancer on Monday mason204 chipdog3"
    },
    {
      "AuthorID": "portypup",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63269/profile",
      "Content": "Jan 30, 2009 03:20PM portypup wrote: I had a spot on my rib, kidney, and lung and it all turned out to be nothing but an artifact.  Hugs! Randi",
      "MessageIndex": 5,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728242",
      "Title": "Just Heard That Dreaded Phrase.. WellWater WellWater"
    }
  ]
}