{
  "AuthorID": "PositiveEnergyNJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207753/profile",
  "Posts": [{
    "AuthorID": "PositiveEnergyNJ",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207753/profile",
    "Content": "PositiveEnergyNJ wrote: Hello everyone, I hope I am posting in the right place. My OBGYN found a lump on my breast and sent me for a diagnostic mammo and an ultrasound. It came back BI-RAD 5, which is highly suggestive of cancer. I am trying to find a breast surgeon, but I am having a hard time because most doctors do not take my insurance. I found the following doctors, can anyone make a recommendation? 1. Dr. Mary Martucci (CentraState Medical Center, Freehold) 2. Dr. Sumy Chang (Monmouth Medical Center, Long Branch) 3. Dr. Janette McDermott (Metuchen) 4. Dr. Michele Blackwood (St. Barnabas, Livingston) I can't find any info on Dr. Martucci or Dr. Chang. I read mixed reviews on Dr. McDermott. Dr. Blackwood is in Livingston, which is far from my home and I am concerned about getting rides up North. I met with Dr. Blackwood earlier this week for a quick consult. She said she was going to order 3 tests for me and said that she was keeping the films I had brought with me. I told her I wanted to hold onto my films because I was considering checking out a doctor closer to my home. She seemed to get annoyed and said she would be canceling my 3 tests. (This was the first time we were speaking - how could any tests already be ordered?) I then asked Dr. Blackwood if I could do the testing by my home and she said no. She said that I needed to choose which doctor I was going to and then that doctor will order the tests. How am I supposed to choose a doctor if I don't even have a biopsy yet? I have no idea what is going on. I wish Dr. Blackwood would've just allowed me to go for a biopsy to see what I was dealing with so I could make an informed choice. I have no idea what to do now. Do I go to an unknown doctor locally or do I choose a known doctor much further from home and where transportation will be an issue? Thank you for any feedback. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "12/11/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826208",
    "Title": "Doctors in Central NJ PositiveEnergyNJ sandcastle"
  }]
}