{
  "AuthorID": "PRB1956",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188773/profile",
  "Posts": [
    {
      "AuthorID": "PRB1956",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188773/profile",
      "Content": "Dec 11, 2013 12:33PM PRB1956 wrote: Allebasi - I have a lot of cording from my lumpectomy. This video on you tube was really helpful. www.youtube.com/watch?v=QoP9zQ... My range of motion was better after just a few days of doing those exercises on the video. However, the best thing I did was go to a physical therapist who specializes in lymphedema. I had one cord that ran down my side and to my waist...it felt like it was 1/4 inch thick! On the first session, the PT took her thumb and pushed into it several times. Each time she pushed, it literally made a popping sound. It didn't hurt all that much and when she was done, the relief was amazing. While the stretches in the video gave me a lot of relief, I'd highly recommend you seek out a physical therapist who is familiar with lymphedema. They will give you different exercises, stretches and just general knowledge about lymphedema / cording and what to do or not do to keep it under control. I guess for me this cancer journey has been very difficult because I like to be in control...and the confusion I feel from all the various treatments and what if's has caused me a lot of extra stress. Going to PT has given me some real 'working' knowledge and tools to keep the lymphedema and cording in check ..and I'm glad I went. Good luck!",
      "MessageIndex": 452,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "PRB1956",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188773/profile",
      "Content": "Jan 24, 2014 03:24PM PRB1956 wrote: For those of you who've had the prone position for rads, did they do a scan before every treatment?  My RO says they have to do that to position it correctly.  Just what I don't want.. more radiation.  He did say it's only 1 rad .. but still, I was really upset that this was never mentioned until today during the simulation.",
      "MessageIndex": 648,
      "PostDate": "24/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    }
  ]
}