{
  "AuthorID": "Pricillamyl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226536/profile",
  "Posts": [
    {
      "AuthorID": "Pricillamyl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226536/profile",
      "Content": "Jan 3, 2016 08:14PM Pricillamylove2211 wrote: I have swelling at night as well ....Just got diagnosed , So need to find a Dr any around my area ?That are good with all my NHL and all other i suffer from ...I dont know how in the heck there going to treat me at all and im in sooooo much pain",
      "MessageIndex": 19,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/788452",
      "Title": "Lymphedema Treatment 101 - Questions from a Newbie guitarhero25 glennie19"
    },
    {
      "AuthorID": "Pricillamyl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226536/profile",
      "Content": "Jan 3, 2016 08:07PM Pricillamylove2211 wrote: I have a complicated ..Very complicated case and I am extremly scared ...I got diagnosed with Non -Hodgkins Lymphoma in 2011 August. The chemo I went thru and the Cancer BOTH attacked my digestive system so badly they ended up removing ALL of my Large Intestine 100 % , My Gallbladder, My Appendix , my Colon & My Anus. Now after two years of healing it took from that. They found a Lump in my Right axillary Region so took ALL of right axillary Lymphnodes out .....I had severe drainage problems for like 6 weeks , They left the drain in going home and had to change it out a few times and painfully manually drain a few times ( very Painfull but fluids kept building up under skin ) So had to. Finally that healed and Ivebeen in Remission since after two years of Rituxan after chemo treatments and after almost dying before big surgury from Renal End Failure so then lived out of hosp by going for hydration treatments twice weekly , But now hydrate myself by drinking 1 & 1/2 gallons of Lemonaide a day. I have to or kidneys will fail again because your large intestine is what gives you fluids from food. But since I dont have one at all and they redirected my small intestine to normal exit I can barely eat anything or Id be in bathroom non stop because list of what I can eat is so small its ridiculous. All other foods will give me diareha .....Im on massive amts of diareha meds daily is all they can do. So Nutrition is almost non existant for me , I am anemic , They have me on energy pills due to malabsorbtion of food. And just got dioagnosed with Lymphedema....Now from what I read so far nutrition is a big part of treatment ....Well that wont / cant work for me because I can only eat such a small list of items as it is Im so scared because then the surgery ussually they go to from what Ive read is moving Lymphnodes from one area to another to replace blockages or blocked ones ....Well since Non Hodgkins Lymphoma is Cancer of The Lymphatic system and Cancer is thruout my entire system ......What are my chances then or options for treating the Lymphedema ????????????",
      "MessageIndex": 18,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/788452",
      "Title": "Lymphedema Treatment 101 - Questions from a Newbie guitarhero25 glennie19"
    },
    {
      "AuthorID": "Pricillamyl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226536/profile",
      "Content": "Jan 3, 2016 09:09PM Pricillamylove2211 wrote: Thank you for reaching out to me yupp thought maybe my NHL spread to Bone Cancer with symptoms Im having but no its lymphedema and I have every single symptom on the board .......I dont even know where to begin and know so little about it. And am scared , Do you live around illinois and do you have one to suggest ...A specialist",
      "MessageIndex": 21,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/788452",
      "Title": "Lymphedema Treatment 101 - Questions from a Newbie guitarhero25 glennie19"
    }
  ]
}