{
  "AuthorID": "PrincessPin…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
  "Posts": [
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 25, 2018 12:15PM PrincessPincushion wrote: Boo 2012 Stage IIB 2017 Stage IV, bone mets to sacrum",
      "MessageIndex": 492,
      "PostDate": "25/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Nov 7, 2012 05:30PM PrincessPincushion wrote: I'm sneaking in over here from the Cancer Sisters 2012 page. I just had my first chemo yesterday. I'll be doing 6 rounds of TC, every 3 weeks for 18 weeks. I got a Neulasta shot today, and I was also told to take Claritin ahead of time. I'm hoping it helps, but my jaw ached about an hour after. It's finally settling down, so hopefully I'll be able to eat my dinner. What are cold caps? I don't think I've heard of those. I'm pretty much resolved to losing my hair. In fact, when my stylist shaves it off for me, I plan to take in some eyeball temporary tattoos and have her put them on the back of my head so when my girlies get home from school I can show them that Mommy really DOES have eyes on the back of her head! My one question is... do the symptoms get worse as the chemo goes on, or can you pretty much judge your reaction by the first dose? So far I've had very little stomach trouble, and it would be nice to know what to expect as I go on. Thanks, BC sisters!",
      "MessageIndex": 108,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Jan 31, 2013 04:45PM PrincessPincushion wrote: I just had #5 of 6 TC treatments this week. I'm almost done! But I've discovered a weird new side effect - my eyelids have started twitching, and now my eyebrows are getting in on the act. Anyone else having weird muscle spasms and twitches in their face, or is it just me?",
      "MessageIndex": 1743,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 1, 2013 04:24PM PrincessPincushion wrote: Boy, am I glad to know I'm not the only one with the eye twitches! At least now I know I'm not going to go mad alone! Jennie, I've also had the watery eyes, though my nose has behaved itself mostly. I think the muscle pain and fatigue are probably worse than anything else. I can't believe how exhausted I am tonight just from getting dinner in the oven! And I'll agree that the hair thing is definitely weird, though it has been nice to not have to shave since November. My husband always tells me that I look sexy bald, though, so I'm just going with it. I cannot wait to be done with this, and get my life back. Most of the time, I do okay, but today has been a real struggle to not become discouraged. We got a bill yesterday from the orthodontist, and I honestly can't remember back to January as to whether I took my daughter or not (apparently, we missed it). My brain is gone, my energy is gone, my house is a mess, dinner is late... again... It's so hard to know what I've always been capable of, and readjust my personal expectations every single morning. I think what's worse is knowing that the fatigue continues through the radiation, which will be for 7 weeks, taking me right up to Memorial Day, and not knowing how long it's going to take to get my energy back. Okay, that's my personal pity party. I think I'm better now for saying that.",
      "MessageIndex": 1753,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 9, 2018 05:14PM PrincessPincushion wrote: Glad it's going well for you Moissy! My insurance is dragging their feet approving the Afinitor. I'm starting to get annoyed! My nurse said she'll start making calls if we don't hear anything by Monday. I got my first Faslodex shots this morning. They weren't nearly as bad as I'd worked myself up to believe. Honestly, it's nothing compared to the Zoladex in the belly every month! I've been sleeping most of the day since getting the injections. Is that normal? Other than that, I just need to be careful how I sit, since my sitter is a bit on the tender side. Fingers crossed and many prayers that this will start working fast. I was measured today, and I've lost 1.5 inches in height this year. I didn't have much to spare to begin with! A year ago I was just about 4'11\". This morning I measured at 4'9.5\"! Ack! I'm melting!!!",
      "MessageIndex": 27,
      "PostDate": "09/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 11, 2018 08:46PM PrincessPincushion wrote: Sunset, I'm so sorry things are so uncertain for you right now. This monster just sucks. That's why I find ways to laugh about as much as I can, like the Princess Pincushion thing. I ugly cry, and laugh lines don't look so bad as frown lines. 😊 That, and I refuse to give the monster the victory over the one thing I can (usually) control! I've been on effexor for the last couple years, which usually helps keep me on an even keel. But new hormone treatments always throw me for a loop. I'm sure I'll level out once I've had some time to adjust. I was able to eat a bit better tonight. My daughter's suggestion of chicken fajitas was apparently just what I needed. As for the fas shots, I was told to expect injection site pain for a few days, so I'm going to do my best to just get through it. I may try icing it before bed tonight to see if that'll help. I'll be praying for you as you wait to find out what happens next! ",
      "MessageIndex": 34,
      "PostDate": "11/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 23, 2018 08:21PM PrincessPincushion wrote: My cancer center is associated with the Fox-Chase cancer hospital in Philadelphia. It's a suburban hospital, but it's a Fox-Chase cancer center. Does that count, Zarovka? We've talked about getting a second opinion, and there are so many teaching hospitals and cancer specialists in the Philadelphia area... It's just hard to find the time to get out there. My husband just started a new job a year ago, and he has very limited PTO. We're hoarding as much of that PTO as possible for a cross-country drive to Colorado this summer. But you're right... a second opinion is a good idea... My onc is a wonderful doctor, and the nursing staff has been incredible over the six years since my initial Stage 2 diagnosis. I guess it's emotionally hard for me to consider seeing another practice when I've become so attached to these people, if that makes any sense. Thank you so much for your input. It's easier hearing these things from women who have lived it or are living it. And it's unspeakably encouraging to see ladies here with the same diagnosis as mine who have been fighting for so long. *deep breath* So I guess next week is asking some questions of my amazing onc, and exploring a center for a second opinion.",
      "MessageIndex": 7606,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 28, 2018 12:06AM PrincessPincushion wrote: My goodness, you're a bunch of world travelers, aren't you? Hawaii and Japan? Makes my upcoming family cross-country drive from PA to CO look like a drive across town! So my funny story for today is that I ended up in tears over some stupid billing confusion at the lab when I went in for my now weekly blood work. I apologized and told them I'm still on edge after finding out about my recent progression, and that I'm terribly anxious about needles in general as I prepare for my first dose of Faslodex next week. Through my tears I wailed, \"I'm getting stuck so much you might as well just call me Princess Pincushion!\" Well, after an unexpected hug from my phlebotomist, she told me that I can expect her to have my Princess Pincushion crown ready and waiting for me next week! It's these little sparks of humor that make the dark moments so bearable. I may not post much, but I'm really enjoying reading about the many stories of success and relief you ladies are posting. Your success gives me hope. Keep hoping, keep fighting, and find something to laugh about!",
      "MessageIndex": 7650,
      "PostDate": "28/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Jul 28, 2018 11:44AM PrincessPincushion wrote: Hi all, just checking in! My last PET showed improvements in my liver met, which was small to begin with, and my lung met (which they'd failed to mention before, so that was a surprise, but explained some things). My liver function numbers have been running just a little high, but my MO is not concerned about it at all. The frustrating thing is that the bone mets are going the opposite direction of the organ mets. So it's wait-and-see until my next PET to find out if they're just flaring, or if we need to change meds again. I've only been on Afinitor/Faslodex since April, so that's frustrating. I don't know about you all, but I'd rather have something definite, good or bad, rather than \"wait-and-see.\" I got the same indefinite answer from my mammo last week, too. They're fairly certain the changes in my left breast are calcification from surgery, but we'll do another one in 6 months to verify. Considering this was a 6 month mammo to verify changes noted at my December mammo, I'm less than comforted. Oh well. I feel good, I look good enough that people are shocked when they learn I'm stage IV metastatic, I kept up with our 10 day cross-country family vacation to Colorado from Pennsylvania, my kids are fabulous, and I'm able to garden this year (we just brought in three 4-lb cabbages!!!), so I'm calling life a win right now. Blessings to all! Pincushion",
      "MessageIndex": 9315,
      "PostDate": "28/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 6, 2018 10:11AM PrincessPincushion wrote: Oh thank you, Sarah and Katty! You give me hope that there may still be treatments for me yet! I'm still going to start moving forward with some of the end-of-life things I feel I want to do while I can, such as letters to my daughters for milestones I may miss, but I'll write them with the hope that not all of them will have to be delivered. I felt utterly lost and bereft yesterday at my appointment. It seemed like the worst nightmare ever, with the added horror of knowing I'd never wake up from it. But you give me hope that another doctor, another pair of eyes, another hospital, might have resources and ideas that my beloved MO does not have. It was so hard to see him heartbroken for me yesterday, but that's one thing I love about him - he truly cares, and he FIGHTS for each of his patients. I count it as a miracle that I was able to get an appointment with the next MO for tomorrow afternoon. Originally, they told the office staff next Friday was the first available, but I heard the receptionist say, \"That's not soon enough!!\" They're all fighting for me, which is oddly comforting. So... On to doing things that bring me joy and fulfillment, taking my eyes off the darkness and fixing them on HOPE. PP",
      "MessageIndex": 9635,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 13, 2018 12:02PM PrincessPincushion wrote: Thank you, ladies, for all your caring support, and all your encouraging words to not give up. My liver enzymes did come back a little higher today, so I'm not sure what to say about that. They did an abdominal MRI this morning to see if there may be some sort of blockage in the liver that may be eased with the insertion of a stent. We'll get those results later today. The MO from whom we got the 2nd opinion did mention Gemzar, but he's aiming towards getting me into a clinical trial, which won't happen with my ASTs at 755. I think I'm going to start getting pushy and say, damn the trials, give me something that will HELP. I'm hoping to get a visit from my MO today while I'm stuck here in this hospital room. We're armed with questions and goals this time, and I refuse to be discouraged!!! I've had the most amazing nursing staff. Even the gentleman who transported me to the MRI building was amazing. It sure does help to be surrounded by staff who are kind and caring. The overnight nurse, Beth, sat with me for about 45 minutes last night while I had a crisis moment. It turns out that we share the same faith, and we were able to pray together. It's incredible how that turned my mindset around. Grannax, I'm so delighted for your good news. Keep up the good work, keep fighting the good fight! Take care of yourselves, each and every one of you. PP",
      "MessageIndex": 9693,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 15, 2018 06:01PM PrincessPincushion wrote: Grannax, I certainly hope they get this figured out for you quickly! I think the waiting and not knowing are the worst things. I'm still here in the hospital. Liver numbers are continuing to climb, including bilirubin. I received a dose of Taxol yesterday with the hope that it would start calming down the liver. What I didn't realized was the timeline for judgment. I figured I'd get a few doses and then they'd decide. No, the MO is looking at today's blood work and tomorrow's. It the numbers are still climbing, then.... well, that's it. Kaput. No more treatments. He and the consulting MO at Fox Chase are out of ideas, and I'm being sent home, probably with information about hospice care. This morning's blood work came up with the liver numbers continuing to climb, particularly bilirubins. So I have one more shot. If they're not down tomorrow, it's lights off, curtains closed, exit stage left. Part of me wants to go elsewhere, get more opinions, try more medicines, fight. Part of me is just tired. Tired of bad news, negative reports, painful procedures, each worse than the last. Is that giving up? Am I giving in too quickly? Or am I just being realistic? I'm really trying to hold on to hope for tomorrow's results, but... I haven't had a positive result in over a year. I had to call my parents and my sister today with the news. I hated hearing them heartbroken. I'm ready to go Home.... they're not ready to let go. I know that's not my responsibility, and I also know they'll be fine. However... I hate being the cause of others' suffering. My goal in life has always been to make people laugh, so being the cause of their grief is really difficult. Anyway, that's where things stand with me. It's all up to that one little number on my blood work. And I'm remarkably okay with this. PP",
      "MessageIndex": 9710,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 23, 2018 11:02PM PrincessPincushion wrote: Lynnwood, I've been going to the Fox Chase center at the hospital in Pottstown, which is very near my home. Zarovka, you're absolutely right. I'm thinking about this way too emotionally! Pretty much my mo, though. I emotionalize everything! Lol Yes, I'm the one who cries at certain Subaru commercials on TV... My hubby works from home 3 days a week, which, I have a feeling, will become very handy in the coming days. As for other companions, I can think of three ladies off the top of my head who would drive me anywhere any time. One is simply a dear friend, one is a b/c sister who has been cancer free for 15 years, and one is a nurse who does in-home care for cancer patients. Any one of them would be a great take-along to an appointment. I looked at the website, and I have my little eyeballs focused on a particular hospital already. My next adventure will be two-fold: 1. Figuring out how one goes about getting a second opinion, and 2. Overcoming my terror of making phone calls to people I don't know! 😁 ",
      "MessageIndex": 7609,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 1, 2018 09:28PM PrincessPincushion wrote: Z I am praying for you as you fight through this treatment. Your posts always sound so strong and brave, and I admire the spirit I sense coming through. You are a true warrior! I hope you can experience rest and relief, and I'm praying that these treatments will be effective! Blessings!",
      "MessageIndex": 7687,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 23, 2018 10:51AM PrincessPincushion wrote: I was diagnosed this morning with liver mets. I was diagnosed Stage IV last February, with bone mets in my spine. 4 months ago my PET was clean. This month, not so much. Bone mets are back in the spine, and now something on the liver. Everyone at the cancer center was giving me hugs, and it felt like OMG, am I going to die in the next 6 months now that it's in my liver?!? But I'm a little reassured reading your posts here that liver mets are also controllable and that it's not an instant death sentence. I'm going to start on Afinitor and Faslodex in addition to my Zoladex. Anyone else on those? Are they as bad as they sound?",
      "MessageIndex": 7594,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 5, 2018 06:51PM - edited Sep 5, 2018 06:52PM by PrincessPincushion Do not go gentle into that good night, Old age should burn and rave at close of day; Rage, rage against the dying of the light. Last Friday I had a PET scan to find out why my liver enzymes have been on the climb. The only thing I heard back right away was that there was fluid on the lungs, some of which I had drained today. *shudder* I'm being referred to an oncologist at Fox Chase Cancer Center in Philadelphia. In June, the tiny little 1/8\" lesion on my liver was looking better. As my doctor put it, my liver now looks like it belongs to a 75 year old man who's been a lifelong chain-smoking alcoholic. It is fully involved. The cancer has \"exploded.\" Spine, both femurs, pelvis, right humerus and scapula, liver, both lungs, abdominal lymph nodes. He said he feels backed into a corner; he's out of ideas. In addition, they removed nearly a liter of fluid from my left lung during the thoracetises this morning; there's nearly as much again around the right lung. I'll find out the cytology report on it tomorrow, but I've yet to get truly good news in the last year and a half, so I'm not holding my breath. My MO is hoping that a doctor at a larger cancer hospital might have more access to trials and other treatments that he doesn't. I'll be getting probably two or three opinions and going from there. I was diagnosed 18 months ago. Everyone said there are so many options, so many treatments... I'm young, strong, otherwise healthy, and so very optimistic... the odds were in my favor. I'm trying to not lose hope, but... Of all the things I was prepared to hear today, \"I'm out of options\" was not one of them.",
      "MessageIndex": 9628,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 20, 2018 04:02PM PrincessPincushion wrote: On September 20th, 2018, at about 3:30 PM, my sweet princess, who was most certainly my queen, went home to Jesus. Tristaan the Ogre",
      "MessageIndex": 9761,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 12, 2018 07:20PM PrincessPincushion wrote: Well, ladies, I'm writing this update from my hospital bed. I came to the ER this morning with very labored breathing and shortness of breath, along with a very high heart rate. That was about 11 hours ago. The CT scan showed only minor increase in disease, but they did remove 1100mL of fluid off my right lung, which helped quite a lot. This is in addition to the 780mL they'd tapped from the left lung last week. Had that been the only issue, I'd be home right now. But they just HAD to do blood work, didn't they? My liver is quickly going downhill. My bilirubins were elevated today, and my AST went from 480 last week to 756 today. So they're keeping me overnight to see if that comes down after the drain. My MO came in to talk with us this afternoon, and we finally got the last piece of the cancer puzzle. I am officially triple negative. He's at a total loss as to what to do for me, because the AST is so ridiculously high. He referred to a \"very narrow window of opportunity for treatment.\" So... He comes in and tells me that I now have the last necessary ingredient for a perfect storm (widespread mets, malignant pleural effusions, ascites in the abdomen, triple negative cancer, and off-the-chart liver enzymes) and then, when I cried in despair, \"Why bother?!?\" told me to not give up hope. That I need to keep fighting. But how? With what? I've just been told there's likely nothing you'll be able to do for me, and then tell me to not give up hope? So that's where this sister is. I hope everyone else is having a better week than I am! PP",
      "MessageIndex": 9675,
      "PostDate": "12/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 15, 2018 09:35PM PrincessPincushion wrote: Sarah, I'll admit I was shocked to find out this morning that the window for success was 48 hours. I thought I'd at least get a couple doses. But maybe the numbers are just so catastrophically high that we're out of time. Yes, they did tests to look for blocked ducts. There are none. So a stent won't help. I think I'm just out of time, friends. PP",
      "MessageIndex": 9715,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 19, 2018 11:05PM PrincessPincushion wrote: Hello, ladies. I don't know protocol here so I'm sorry if I'm breaking some rules. This is PrincessPincushion's husband, Tristaan the Ogre, posting on her behalf. We took her to the ER again today and it was determined at this time, with her white cell count, platlet count, bilirubin, AST, ALT, and all sorts of other combinations of letters are at a point where there is nothing more that human medicine can do at this time. She has been enrolled in hospice care at the hospital and we are leaning heavily on our faith as we wait for when she goes home. We firmly believe it won't be \"good-bye\" but \"see ya later\". I'm so sorry to be the bearer of this news. You ladies have been a wonderful support for her these years. Thank you so much. Blessings to you all. Tristaan",
      "MessageIndex": 9743,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Nov 10, 2012 01:47PM PrincessPincushion wrote: The day of my first TC Chemo wasn't too bad, but ever since my Neulasta shot on Wednesday I've felt like crap! I can't sleep, except it's all I want to do, and I have this constant nasty taste in my mouth. I cried at breakfast today because my kids look at me so funny as I pick at my meals because I just can't eat. This is awful. Everything tastes so weird, and I can't eat anything bread. I don't know how I'm going to do this for four more months. I've already lost 3 pounds this week, and I'm barely over 100 to begin with! I SO do not want to be having to do this!!!",
      "MessageIndex": 194,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Nov 12, 2012 08:47AM PrincessPincushion wrote: Hey, Thankful! Nice to meet you, wish it were under better circumstances. I just had my first round of TC last Tuesday (like you, I'm 6 cycles, every 3 weeks, with a Nuelasta shot the day after). Yes, my bones HURT like nobody's business the next two days. By Saturday, it was just occasional twinges, but not bad. By yesterday, I almost felt like myself again. So it's REALLY BAD the first couple days, but it gets better. Did your doctor say anything about taking Claratin the night before your Neupogen, and for 3 days after? It does help - that, and Aleve. I'm in contact with my doctor... the back of my hand broke out in a huge swollen rash. Called him yesterday (Sunday) and he said it didn't sound like a Chemo reaction, since I don't have it anywhere else. Hoping for some answers - it's hard to type with swollen fingers! Other than that.... Well, I've been amazed to see how quickly my energy came back after the first chemo. Still can't taste much, but I guess I'll get used to that. Thanks for the tips on mouth sores, ladies. I'm sure I'll be using those!",
      "MessageIndex": 225,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 25, 2013 05:06PM PrincessPincushion wrote: I AM DONE!!! I had my last TC on the 19th!!!! The lovely nurses at the cancer center gave me a certificate called the \"Purple Heart Award\", signed by each nurse who works there. I cried so hard when the nurse gave that to me. But I (literally) danced my way to the elevator on my way home. Next up: radiation. BRING IT ON!",
      "MessageIndex": 1888,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 23, 2015 08:30AM PrincessPincushion wrote: It's been a long time since I've visited here, but I'm so glad I did! I'm having a heck of a time with my weight, too. I've been dieting and exercising, (carefully, because I'm still struggling with that blasted lymphedema), and can't lose an OUNCE! And here I thought it was just because I'm \"old\" (just turned 42!)",
      "MessageIndex": 2287,
      "PostDate": "23/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 12, 2013 11:20AM PrincessPincushion wrote: Oh, goodness, thank you for posting your \"chemo brain\" stories. I feel so much better! Twice this week I've made stupid mistakes when cooking - once I grabbed the wrong measuring spoon - I even double checked it! - and put in twice as much seasoning as the recipe called for (my husband said it was the best spaghetti sauce ever!), and then I totally misread another recipe and somehow turned \"1/2 cup butter\" into \"2 sticks\" in my head. Ugh! Then yesterday I had to go for a CT scan to get set up for my radiation. At the hospital registration desk, the woman asked for my script. All I could do was look at her blankly. I honestly couldn't remember if I'd been given a script the week before! I'm looking forward to getting the cotton out of my head so I can think again. The rest of my chemo side effects are starting to go away - although I bumped my fingernail on something yesterday and almost ripped it off. I think that the loosening nails is somehow harder to deal with than the loss of my hair and eyebrows. It's so hard to do things when your fingertips are so sore! I'm loving the new avatar pics. I may need to go figure out how to attach one, too, if everyone else is enjoying seeing faces as much as I am. 5LuvBug, there's a website called TLCdirect.org where they sell hats and scarves for cancer patients. They have a page with pictures and directions for tying square and rectangular scarves in different ways. It's been a life-saver for me! I chose not to get a wig, so I have to get creative with hats and scarves. Keep up the good fight, sisters!",
      "MessageIndex": 1946,
      "PostDate": "12/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 5, 2018 07:43PM PrincessPincushion wrote: hartrish Thank you very much. Lynne I see the new doctor on Friday afternoon. My MO's office had literally everyone behind the desk working on getting me set up with the earliest possible appointment. It was inspiring to watch them jump into action on my behalf. I've not had any traditional chemo, no. Just Ibrance/Letrozole for 10 months, and then a disastrous 4 months on Afinitor/Faslodex. And no, no biopsy since the initial dx last February. That's one thing they're likely to do at Fox Chase, I suppose. I'm trying so hard to hold on to hope, but it's a struggle to keep my mind from the dark places.  PP",
      "MessageIndex": 9631,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 23, 2018 05:10PM PrincessPincushion wrote: I was on the Ibrance/Letrozole for the last year. My last PET 4 months ago was completely clean. I was hoping for more than a year on it, but... it is what it is. I'm so utterly confused about the whole medication thing. My Onc is usually very good about prescribing the best thing for the time. I'll do more research into the Afinitor, and talk with the doc. Sadly, I was alone at my appointment this morning. My hubby forgot I was getting test results, and he wasn't expecting anything major, so he was at work. I really wish he had been there, because I have a feeling there's a lot I just didn't hear after I heard my Onc say the cancer was back. I'm going back in 2 weeks for my first Faslodex injections. I'll ask some questions then, about biopsy and such. There's just too much to know and process and adjust to. The worst thing right now is figuring out how to tell my daughters. My oldest graduates high school in June, my youngest is a freshman. The older will be okay when I go, I'm pretty sure... the younger? I worry about her....",
      "MessageIndex": 7602,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 2, 2018 09:16AM PrincessPincushion wrote: Z, I hope you can get plenty of healing rest today. Praying for quick and clear results. Blessings!",
      "MessageIndex": 7692,
      "PostDate": "02/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 24, 2018 11:42AM PrincessPincushion wrote: So it's been 4 weeks since the PET that showed liver involvement, and I'm still waiting for the Afinitor. So I'm basically untreated, except for the hormone inhibitor. Over the last week, I noticed an... odd... odor to my urine. Not ammonia, just.... weird. Is that something to worry about? Is it normal? There's no pain, I still feel good, everything else seems to be normal. And nobody said anything about my numbers after my blood work, except that my potassium is STILL low. But I never know what's worth worrying over, and what's just... an odd something. Isn't it great to have a TMI-free zone where we just freely share about our bodily functions? LOL Pincushion",
      "MessageIndex": 7958,
      "PostDate": "24/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 24, 2018 09:25PM PrincessPincushion wrote: So.... stinky pee might just be yet another in the long list of indignities in the Cancer Crazy Train? Somehow, that's both comforting and... annoying. It does seem to be worse right after my injections, and it started shortly after my first faslodex treatment. I've had plenty of UTIs so I know pretty much what they're like, and this is nothing like one. I just wanted to make sure that weird smelling urine wasn't maybe from liver problems, because I just have no idea, and I refuse to go to WebMD. After all, it doesn't matter what you look up there, it's sure to make you think you have cancer.  ~P. Pincushion~",
      "MessageIndex": 7964,
      "PostDate": "24/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 7, 2018 10:39PM PrincessPincushion wrote: I don't have much of an update, sadly, despite a 2 1/2 hour oncology visit. At least, nothing with any forward motion. We're still waiting for part of the cytology report from my thoracentisis. The first major thing we did learn is just how insane my liver enzyme numbers are. My AST is either 438 or 483, and my ALT is in the 260s. Apparently, that's at least 3x what they should be. He showed us the PET of the liver, and it was like a little sun in my stomach. Terrifying. The other major thing we learned from the cytology is that the cancer is now ER/PR- when it's always been positive. We're waiting to find out about the HER2 marker. But that would in part explain why the Afinitor/Faslodex did nothing, since that's for hormone positive. He wants me to go on a 2-drug protocol to get the liver enzymes under control, and if we get that down then there are a couple different studies I might be able to get into. I'm not sure I like this doctor. He never even looked at me when he was talking. He directed it all at my husband... But my DH's feeling was that it was from discomfort, like he was trying to not panic us with how bad things really are. We'll find out the rest of the news on Monday or Tuesday, I suppose, and he knows we have another appointment on Friday with yet another oncologist for a third opinion, and we might be calling UPenn for another opinion, since they have different studies available than Fox Chase or LVHN/Sloane-Kettering. I'm not sad, or panicking, or despairing, or... anything, really. I'm just numb. I'll get excited with hope once someone tells me that they might be able to do something to extend my life. In the meantime, I'm just trying to be normal, keep up with the routine, stay busy and focused on things that make me happy. Thanks for all the prayers and support, ladies. PP",
      "MessageIndex": 9653,
      "PostDate": "07/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 23, 2018 05:24PM PrincessPincushion wrote: I was just recommended to start taking Afinitor and Faslodex today, as my cancer is back on my spine, and now also on my liver. I'm hearing things that are making me a little anxious about this treatment. Those who have been on it a while, are you seeing any results? ",
      "MessageIndex": 21,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 11, 2018 03:22PM PrincessPincushion wrote: Sunset, I'm sorry to hear about the odd labs. I think that \"odd\" can be more unsettling than certain, in some ways. Fingers crossed for a good set of labs next time around! I'm still so very very tired, and finding myself pushing my food around on my plate, even though I've been really hungry. I don't know how much of that is just hormonal weirdness from the Faslodex, because I'm feeling particularly moody since the injections. I seem to be very sensitive to hormonal drugs. The other thing is the injection site tenderness. I feel like I have the world's worst bruises on my backside, even though there's no discoloration. Walking seems to help keep the sites from stiffening up, but I'm real tender to the touch. I'm hoping that starts easing soon, because it's hard to find a comfortable position to sleep at night. I'm wondering if icing the areas would be helpful. I've decided to rename the \"event\" on my calendar for when I go back in 2 weeks for the injections, because it'll be the 2 Faslodex, plus the X-Geva and the Zoladex. The new name that shows up now is Princess Pincushion's Prickly Porcupine Pokey Party. Since it's a party, that means I get ice cream. I think that's a win, don't you?",
      "MessageIndex": 32,
      "PostDate": "11/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Jul 28, 2018 11:30AM PrincessPincushion wrote: Sunset, My MO thinks it's in part caused by the blood pressure medicine they put me on last year when my BP went through the roof from a steroid. I'm still on the medicine, and now I'm having trouble with my potassium. But they won't take me off the medicine because my BP is irregular. The last 3 times I went in it was high again. Argh. By the way, if you're not asking to sit on ice packs before you get your Faslodex injections, start asking. Icing the area before the injections has made it SO much more bearable! Pincusion",
      "MessageIndex": 72,
      "PostDate": "28/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Aug 9, 2018 11:36PM PrincessPincushion wrote: Sadly, things are apparently not as positive as we'd thought. I started having pain in my right shoulder, so I was sent for x-rays. The lesion there has continued to grow. I've also begun to have more back pain, where there are lesions, as well as cramping in my hip where... well, I'm sure you can figure it out. They're sending me to the radiation oncologist Monday to determine if the shoulder should be radiated. In addition, my liver numbers have been on the increase, so I've been told to stop the Afinitor for now. They'll check liver functions on Monday and decide then what to do. But I have a dreadful feeling that this treatment has been a dismal failure. Ibrance + tamoxifen lasted only 10 months. Afinitor + Faslodex failed in 4 months. This is starting to cast some uncertainty on my plans to defy the odds and live forever! PP ",
      "MessageIndex": 75,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 4, 2018 10:51PM PrincessPincushion wrote: Tomorrow's the Big Day! It's going to be an 8 hour hospital marathon. I register at 7am for the thoracentesis. With blood work and everything else, I was told I won't be done until close to 10. From there, I go straight down the street for my radiation appointment (which is supposed to be at 8:30, but they told me to just come when I'm done getting drained). I'll have about an hour to go home and choke down some lunch (a very difficult matter these days... I rarely eat more than half of any meal, and even that is forced), before my husband and I go see the MO at 1 PM to get the results from the PET scan and find out what the next step is. I'm both anticipating and dreading that appointment tomorrow afternoon. I'm looking forward to having the suspense lifted and knowing what's going on, but I'm dreading it, because I know things are worse. All that being said... theologian Charles Spurgeon wrote, \"It is not to be imagined that he who has helped us in six troubles will leave us in the seventh. God does nothing by halves, and he will never cease to help us until we cease to need. The manna shall fall every morning until we cross the Jordan.\" Pincushion ~~\"In peace I will lie down and sleep, for you alone, O Lord, will keep me safe.\" - Psalm 4:8~~",
      "MessageIndex": 96,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Aug 31, 2018 11:27PM PrincessPincushion wrote: Thanks, Moissy. I had the PET today and was feeling pretty good about things.... Until my MO called this afternoon. That's never a good sign. I know very few details - he'll go over everything with us Wednesday afternoon when we go it. All he said was, \"It's not what we wanted to see. Things are a little worse.\" And then he asked if I'm having any breathing problems. (Yes, I get short of breath when I walk too fast or go up a flight of stairs... Yes, I cough a lot every morning. My assumption was that it was from the distention I'm experiencing because of the liver mess). The PET showed that there's now fluid in my lung, and he wanted to let me know to go to a different hospital ER if I have a breathing crisis, because the doctor at our normal hospital who drains lung fluids is on vacation until Tuesday. So all I know is.... The liver is going crazy because the cancer is continuing to eat me alive, and there's the chance that I could end up in the ER with a pleural effusion (he's going to set up a time next week to have that drained). God I'm scared. I'm scared that the draining is going to hurt like hell. I'm scared that he might put me on a treatment that keeps me from living my life. And most of all I'm scared that I'm going to die before my college freshman gets her diploma, or before my high school sophomore gets hers. And I'm angry. I'm so sick of bad news. I'm so sick of everyone else getting good news, getting a reprieve, getting years on a treatment that isn't even that bad. I'm sick of always getting the worst of any array of potential outcomes. I'm sick of \"There's a problem with your blood work,\" or \"That's not what we want to see,\" or \"Here's another complication that could land you in the ER or kill you. Have a nice weekend.\" {deep breath} Anyway, that's where we are tonight. I'll get the full set of gruesome details Wednesday. Now, for a good night's sleep so I can enjoy my daughter's weekend visit from University. Pincushion",
      "MessageIndex": 87,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 1, 2018 10:32PM PrincessPincushion wrote: Thank you, ladies, so very much. I needed to hear that it's not going to be as painful as I'm fearing. I'll admit that it will be nice to be able to draw a full breath again, and to not run out of breath just having a lively conversation with my girlfriends! And yes, Moissy, I do know that I'm not alone. I was challenged by a friend of mine (she happens to be an in-home nurse, and has become, to me, a big sister with a medical degree) to start reading a Psalm every night for a week. This week was Psalm 3, and verses 3 and 4 have been so comforting and meaningful to me this week, even before the gut punch yesterday. They say, \"But you, O Lord, are a shield about me, my glory, and the lifter of my head. I cried aloud to the Lord and He answered me from His holy hill.\" It takes me a few days, but I'll get back to being able to focus on my hope rather than my health. I know I don't post here often, but I'm so grateful for this circle of suffering sisters. You never fail to lift my spirits! PP",
      "MessageIndex": 90,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Sep 5, 2018 06:48PM PrincessPincushion wrote: I'm posting my day's update in the \"How Are People With Liver Mets Doing\" thread. It's been a long, dreadful day. PP",
      "MessageIndex": 98,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 1, 2018 05:59PM PrincessPincushion wrote: If nothing else, I'm hoping going on the Faslodex and Afinitor will help to level out the one annoying issue I've had with the Ibrance and Letrozole. 6 months ago I was told that my potassium was low, so I started taking a supplement with dinner. 3 months ago, potassium is still low. So now I take a potassium pill with breakfast and dinner. I got the call today that my freaking potassium is STILL low, so I need to start taking that blasted horse pill 3x a day, and start increasing the amount of potassium-rich foods in my diet. I already eat a lot of broccoli and potatoes and sweet potatoes and black beans and bananas! Arg! If it's not one thing, it's another. Am I right?",
      "MessageIndex": 25,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 15, 2018 09:48PM PrincessPincushion wrote: You know, Moissy, that's not a bad idea! I'm amazed by how many people laugh at the names I call myself, but then I tend to approach chaos with humor, because it keeps me more-or-less sane. So I'm really despising my insurance company. I found out today that they've denied my Afinitor tabs, because it has to be administered along with a hormone inhibitor. You know, kinda like Faslodex. The Faslodex which the insurance company already approved for me. Apparently, now my doctor needs to write a letter (\"Doctor Review\" in insurance speak) proving that it's a valid protocol. No idea how long it's going to take. So in the meantime, I get to go with no treatment other than the fas. Fun times. And I hate insurance. Beyond that, life is good. It's amazing how quickly things become normal, isn't it? One day the recurrence is the end of the world, the next it's just another part of life. Cancer life is one crazy train ride!",
      "MessageIndex": 36,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 24, 2018 11:32AM PrincessPincushion wrote: Thanks, Sunset! The name makes everyone laugh, including me. Laughter usually helps me cope.  I got my second pair of Fas injections yesterday, and oy gevalt! the headache I woke up with again! Looks like that's going to be one of my major SEs. Fun times. I got my other two injections as well yesterday, so my everything hurts. We're still waiting for the insurance to move on the Afinitor. My MO wrote a \"very nice letter\" to them, but it's still a waiting game. Meanwhile, I'm trying to keep my husband from freaking out, as he talks about retaining a lawyer if they deny the medication to sue them for, and I quote, \"killing his wife.\" Last I checked, I'm still alive, and there are still more options, so... he may be overreacting a bit. He's dealing with my diagnosis much worse than I am, and it's exhausting trying to keep his spirits up. It's been a wearying week. Not only am I having to hide my struggles with this diagnosis for the sake of my husband who seems on the verge of a breakdown over it, I found out, just before she left for 10 days in Spain, that my 17yo not only wants to come out as lesbian, but wants to identify as a boy; that two years ago her boyfriend was making her so anxious and depressed that she was cutting; and she wants me to believe that the first things and the second are completely unrelated. And my 15yo is dealing with a toxic work group for a project she's working on for a tech club competition coming up in a month; they exclude her from the work times, then accuse her of being uninvolved; they defy the advisor who insists the work be done at school, claiming it's to avoid the parts being stolen, but then I find out that the parents of 2 of the kids are doing half the work! And on top of that I'm trying to help a friend struggling with crippling anxiety and health issues that the doctors have no idea how to diagnose let alone treat. *sigh* Well, kvetching about things doesn't really help much of anything. The only thing I can really do about any of it is to pray about it and trust God to do what He's going to do. And in the meantime.... I guess it's back to the happy face and helping solve the world's problems! After all, that's what Mom does, right? Princess Pincushion",
      "MessageIndex": 38,
      "PostDate": "24/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 24, 2018 09:19PM PrincessPincushion wrote: Thanks, Sunset. Sometimes just having someone listen is exactly what I need.",
      "MessageIndex": 40,
      "PostDate": "24/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Aug 26, 2018 01:33PM PrincessPincushion wrote: Hey, all! Well, still no answers and no definite plan. I've been off the Afinitor for 2 weeks now, and I feel liked crap. My belly is so distended that I can't eat and I'm so short of breath that a lively conversation with my girlfriends leaves me breathless. It's looking like my liver enzymes are still running high even without the Afinitor. The next step is yet another PET scan. The earliest they could get is this Friday, which is frustrating. If the disease shows no other progression, then the liver damage is from the Afinitor, which means just moving to a different drug on the same level. If the disease has continued to spread, then the liver damage is from the cancer and we start looking at a more traditional chemo regimen. Either way, I'll be moving on from this particular forum in the next couple of weeks. I REFUSE to be discouraged. I refuse to consider the what-ifs. I can't afford to live there, even though my brain likes to peek at the brochures now and then. I'll keep you updated as I get more information. Pincushion",
      "MessageIndex": 83,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Feb 28, 2018 12:17AM - edited Feb 28, 2018 12:17AM by PrincessPincushion",
      "MessageIndex": 23,
      "PostDate": "28/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Mar 26, 2018 11:23PM PrincessPincushion wrote: Just got the news today that the Afinitor has been approved! Yay! Now to figure out why my backside has been itching for the last two days. Surely that's not another Faslodex se, is it? Seriously, do you know how hard it is to be ringing up people's groceries when your backside feels like it's covered in mosquito bites? The best part of my day was when I got home and I could scratch to my heart's content! Lol Princess Pincushion",
      "MessageIndex": 41,
      "PostDate": "26/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Apr 3, 2018 09:36PM PrincessPincushion wrote: Four doses into the Afinitor and I'm realizing that I feel like I'm not really filling my lungs when I breathe. I'm yawning all the time, and the worst part is that I can't sing! I'm hoping this passes. I suppose I should say something when I go in for my Faslodex shots Friday. I looked it up, and, sure enough, shortness of breath is one of the side effects. Specifically, one they want me to inform my doctor of. I hope I don't have to go off this after all we went through to get the blasted drug! Pincushion",
      "MessageIndex": 46,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Apr 12, 2018 07:21AM - edited Apr 12, 2018 07:21AM by PrincessPincushion Sunset and Moissy, I'm so delighted to hear that this protocol is working for you! It makes me feel more confident when I hear it's working for someone else. And thanks so much for thinking of me, Sunset! Things are going well. I'm still trying to figure out this lung thing, and so's my MO. He wants to just keep an eye on it for now. As long as it's not slowing me down and not getting any worse he's not going to do anything. If it gets worse at all, I'm to call right away. I'm figuring it's just another irritating SE, just slightly more irritating than the four days of itchy buttocks after my shots! I agree that LABN needs to become part of the BCO lingo for the Faslodex crew! My nurse has been looking for ways to make it easier, and last week gave me a pair of ice packs to sit on while I waited for my injections. It actually helped! I have to say I just love the nurses at my cancer center.",
      "MessageIndex": 58,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "PrincessPin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161165/profile",
      "Content": "Jul 23, 2018 09:57PM PrincessPincushion wrote: Glad to see so many of you doing well on this combo! I had my first PET after starting on Afinitor + Faslodex two weeks ago. The results were \"mixed\" but my MO is calling it a positive. Basically, the spots on my femur, spine, and shoulder blade were brighter, but only by a bit, but the spots on my liver and lung were smaller and less intense. He said the bone mets can \"flare\" as they fight the treatment, so he's hoping that's all it is. Is anyone else having serious trouble with their potassium? Mine keeps going down, despite a potassium-rich diet and supplements 4x a day. I had to get an infusion the day before we left for vacation because they were worried about heart problems while I was away. Good Lord does that infusion BURN!!! My arm is still sore almost two weeks later! My family and I just returned from a 10 day cross-country drive from Philadelphia to Colorado Springs. Best thing ever. Well, aside from the dumb idea to go all the way to the top of Pike's Peak when I'm having trouble with my breathing and my blood pressure. I was sick for about 24 hours after that. But... I did it! Other than the potassium, and falling in St Louis resulting in a nice scraped knee and some bruising on my hand and hip, and suddenly pain in my shoulder blade where the lesion is (nah, not freaky at all considering my PET), I'm doing okay. I know I don't check in often, but I was working 3 part-time jobs until two weeks ago, and my teenage daughters and my vegetable garden take up a LOT of time. Blessings to you all! Pincushion",
      "MessageIndex": 70,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    }
  ]
}