{
  "AuthorID": "Priscillag",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160433/profile",
  "Posts": [
    {
      "AuthorID": "Priscillag",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160433/profile",
      "Content": "Nov 24, 2012 10:19PM Priscillag wrote: Politicalmama, looks like we're on the same schedule. AC then T started on Nov15th. This is my Mo preference. I am actually in a clinical trial, computer put me in treatment plan she had decided on if I had chosen not to be in the trial. I realized all I did was complain in my first post. I'm 39 years old, had slight pain in breast, found lump on left side end of July myself, scheduled dr. Appt. I've felt pretty good with the exceptions I mentioned above. Thanks for everyone's posts!",
      "MessageIndex": 615,
      "PostDate": "24/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "Priscillag",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160433/profile",
      "Content": "Dec 8, 2012 12:16AM Priscillag wrote: Can't sleep! Just read through several days of posts, as I read I paused prayed God's Will over each post! What a wonderful group of ladies here! Thank you for sharing your stories, your encouragements, and your complaints!! When someone calls to check on me I always say \"I'm fine\". Thank God I have a husband and children that really know how I feel!",
      "MessageIndex": 995,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "Priscillag",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160433/profile",
      "Content": "Dec 12, 2012 02:18AM Priscillag wrote: Keetmom, I shaved my head after my 2nd treatment. Two days after treatment it began to fall out, I was in tears. Shaving it put me in control! My sister is a hairdresser, she shaved my head, my husband's because he wanted to support me, then my sister had her head shaved to support me. It was a glorious experience. It still falls out and the follicles tingle( only way I know how to discribe it). A friend of mine with colon cancer told me to putDuct tape strips on my head and pull off. Believe it or not, it doesn't hurt it relieves the tingling sensation and takes the loose hairs out. I let my kids, my husband and my mom do it. We laughed a lot! I have very little hair left, my 3rd treatment is Thursday. I'm not looking forward to it! I have had a rough two weeks. Sinus infection, sores in mouth and face, fatigue is unbelievable, nausea. I finally got some energy the last couple of days. I took a nap today so I can't sleep tonight!",
      "MessageIndex": 1098,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "Priscillag",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160433/profile",
      "Content": "Dec 7, 2012 11:31PM Priscillag wrote: I hope you are relieved by now but, magnesium citrate is the answer if your constipated due to pain meds. I drank the entire bottle when I got the ok from dr. I thought i was going to die the night before! I'm taking pain meds and Valium for my tissue expanders, never had one stomach cramp just normal bowel movements! I've had two chemo treatments since then; 1st treatment I had to take antibiotic for blisters on my face, horrible. 2nd treatment I am currently taking an antibiotic for sinus infection. So the antibiotics have fixed the problem. This 2 nd treatment really got me down! Sent three days in bed! Fatigue!!!!",
      "MessageIndex": 993,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "Priscillag",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160433/profile",
      "Content": "Dec 7, 2012 11:40PM Priscillag wrote: Soteria205, I highly recommend look good feel good class too. Lots of good stuff and tips. I've just lost my hair but she taught us to properly draw on eyebrows. Great to meet and talk to people going thru the same things too!",
      "MessageIndex": 994,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "Priscillag",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160433/profile",
      "Content": "Dec 21, 2012 02:11PM Priscillag wrote: I love reading all the posts! Helps me feel like I'm not alone. I had chemo AC #3 on the 13th. Spent days 5 and 6 in bed so tired I couldn't get up or stay awake! Call Dr. Day 7 went to hospital blood worked show WBC was 0.07. They gave me some fluids sent me home with preventive antibiotic and told me no company. They have no idea why nuelasta shot didn't work. I have 3 teenage girls that are great! They have been wonderful at taking care of me on their break, while my husbands at work. I feel a little better today, atleast I'm awake. I'm scheduled for AC #4 on the 27th but WBC has to come up. Dr. basically said I'm gonna feel like crap til they do and to not catch anything or it could be life threatening. So, I guess I only get to spend Christmas with my girls and husband. At least I have them, but I'll have to send them to Nanny's for Christmas Dinner. Can't see any other family or people. Thankful I'm alive!",
      "MessageIndex": 1257,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "Priscillag",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160433/profile",
      "Content": "Nov 24, 2012 08:42PM Priscillag wrote: Hello to everyone, I've been reading post for a couple of months but this is my first. I am one chemo treatment down Nov. 15th. Followed by Nuelasta shotkn Friday. My second is scheduled Nov. 29th. After the 1st one I felt great Friday & Saturday while taking the steriods and emend! Sunday I woke up with blisters on my mouth, by midafternoon they were in my nose! Monday I woke up and could barely walk, my hips kept locking up. I called dr. got script for blisters which are almost gone. Hips seemed fine, no other joint bone pain. My mouth is still sore and can not eat anything spicy. My family did all the work for Thanksgiving Day. I was walking around being social all day. I woke up that night at 3am with muscle spasms from my breast to my knees. I have a script (valium 5mg) I take twice a day for expanders. I took a couple waited for spasms to stop, an hour later I took another! The only thing close to this I have ever experienced was labor. I can only assume I was up walking too much Thursday? I workin an office a couple days a week, mostly sitting at a computer. With all that said, does anyone have an opinion on whether this will get worse after each round of the red devil juice? Or stay about the same?",
      "MessageIndex": 607,
      "PostDate": "24/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    }
  ]
}