{
  "AuthorID": "proudmomof3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160290/profile",
  "Posts": [
    {
      "AuthorID": "proudmomof3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160290/profile",
      "Content": "Sep 10, 2012 06:05PM proudmomof3 wrote: Thanks all for the responses. It has just been so very frustrating. Especially since the smear test said it was atypical and could not determine between papillomas and carcinoma. Will the surgeon be able to find the cause if the discharge stops before I see him/her or if it doesn't discharge that day?",
      "MessageIndex": 3,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793310",
      "Title": "Unexplained Nipple Discharge- beyond frustrated proudmomof3 HLB"
    },
    {
      "AuthorID": "proudmomof3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160290/profile",
      "Content": "Nov 7, 2012 09:02PM proudmomof3 wrote: A little update, I decided to go ahead and see the surgeon. I saw him back in the beginning of October. He said his thoughts was that it ws just a result of some kind of trauma, although I dont remember anything happening. He said give it 30 days with no one touching it, squeezing, etc and see what happens. I went back this week, discharge still occuring. Instead of coming and going as it was in the beginning, it is pretty much daily since August. Now, the surgeon has basically put it in my hands. Said what could be done was to make a decision just below the nipple and remove all the ducts. He says he is not worried about because \"cancer doesn't cause any color of discharge except bloody\" and since it isn't bloody he isn't worried. However, if I want the surgery done he will do it. I am conflicted. I want answers. What worries me is the discharge was bloody, on more than on occasion. At the same time, if it is likely nothing major then why go through the surgery. Does anyone have any advice? Any thoughts on the \"can't be cancer if not bloody?\"",
      "MessageIndex": 14,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793310",
      "Title": "Unexplained Nipple Discharge- beyond frustrated proudmomof3 HLB"
    },
    {
      "AuthorID": "proudmomof3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160290/profile",
      "Content": "proudmomof3 wrote: The night of June 5th, I felt something and checked my breast and there was a lot of discharge. One breast, from one spot. It was sticky, clear/golden. It then turned to bloody looking.  Went to the doctor the next day and had a mammo and U/S 2 days later.  The discharge came and went. Tried to do a ductogram, but no discharge that day. The discharge has  came and went, varied from clear to bloody to yellowish. Had a smear and it came back atypical with not being able to tell the difference between papilloma and carcinoma. Finally got my primary to send me to the breast clinic. The discharge has been daily for last month. Went for my appt today, they done another mammo and U/S. After 2 mins of trying couldn't express discharge so gave up on ductogram. Their suggestion is my primary send me to surgeon. I don't understand why a surgeon, what can they do? I am so frustrated I am ready to just let it be and forget about it. Does anyone have any advice? Should I be worried about this? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793310",
      "Title": "Unexplained Nipple Discharge- beyond frustrated proudmomof3 HLB"
    },
    {
      "AuthorID": "proudmomof3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160290/profile",
      "Content": "Nov 23, 2012 10:19PM proudmomof3 wrote: Just wanted to update: I've decided to have my ducts removed. The main reasons is because I've started to have pain the nipple and the discharge is not getting better. It hasn't been bloody in a while, but the frequency and amount have increased. These facts, combined with the \"unknown\" and the fact that my insurance deductible is met for this year and next year it is going to a 70/30 plan on my insurance, I thought it was time to get it done. I will be having my wisdom teeth removed Monday and having my breast ducts removed Thursday. Hopefully, it won't take long to get the results back from sending my ducts off for study.",
      "MessageIndex": 16,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793310",
      "Title": "Unexplained Nipple Discharge- beyond frustrated proudmomof3 HLB"
    },
    {
      "AuthorID": "proudmomof3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160290/profile",
      "Content": "Nov 28, 2012 08:26PM - edited Nov 28, 2012 08:27PM by proudmomof3 Thank you for sharing. Glad yours was all good. I have mine tomorrow. It is called major ductal excision. The discharge that has not been bloody in many months and tonight it turned back bloody. I am glad I have made the decision to move forward with the surgery, no more unanswered questions.",
      "MessageIndex": 18,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793310",
      "Title": "Unexplained Nipple Discharge- beyond frustrated proudmomof3 HLB"
    },
    {
      "AuthorID": "proudmomof3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160290/profile",
      "Content": "Sep 11, 2012 03:42PM proudmomof3 wrote: Thanks for the reply and sharing your experience. The discharge has turned back bloody today. I called my doctor and told them what the clinic said and he is referring me to our local surgeon. I am just worried that the discharge is never going to happen in a large enough quantity at the right time for them to do any testing. Does the discharge have to be present for the surgeon to do anything? Meaning, is there anythign the surgeon can do if a ductogram can't be done?",
      "MessageIndex": 5,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793310",
      "Title": "Unexplained Nipple Discharge- beyond frustrated proudmomof3 HLB"
    }
  ]
}