{
  "AuthorID": "PS73",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
  "Posts": [
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 2, 2009 06:49AM PS73 wrote: ..I heard at time of dx, well at least you can get perfect boobs out of it.  no comment is all I would say.  People try to find the bright side of things to make you feel better when they should just shut it and be supportive. ..meanwhile I have one little boob and one medium sized boob with lots an lots of scars around both.  ..now I find it ammusing what people say to make me feel better - it helps me keep my sanity.",
      "MessageIndex": 8,
      "PostDate": "02/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741360",
      "Title": "Cannot believe what the neighbor said... Ang7 Shanagirl"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Nov 30, 2009 08:29AM PS73 wrote: Friend of college roomate - four years out - ER/PR nodes.  Doing great. Mom of close friend - ten years out. Not sure of dx. but is doing great, never felt better. Two friends of store friend - two to four years out - both great. Colleague - five years out - just had twins! Colleague - four years out - doing ok, had some issues w/ tamoxifen but is doing well. Colleague of mos in law - just out, doing wonderful - running daily, feels good. *every now and again I look at the survivors stories on the home page to lift myself up.  My friends mom gave me a book and her poetry class all wrote exerpts throughout the cancer book - all are doing well, there were about seven entries.",
      "MessageIndex": 5,
      "PostDate": "30/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744713",
      "Title": "Couple of Survivor Stories Pure KerryMac"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 10, 2009 04:19PM PS73 wrote: Hi, just dropping in and checking out y'all's recipes.  They are wonderful!  I was just thinking about swapping mushrooms out for meat to be healthier - great that there's already a meatloaf recipe for it. ..just adding two cent regarding pressure cookers and lentils/beans.  My old colleague is from India and this is a staple in her kitchen.  She throws fresh veggies, lentils, rice and herbs into the pressure cooker and in ten minutes it's finished and it retains the nutrients better than traditional cooking. Have a good evening. ps- I think maybe adding tahini is why my hummus ALWAYS sucks too - good tip!",
      "MessageIndex": 48,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744218",
      "Title": "Your Best Healthy Recipe Let-It-Be jenn3"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "May 31, 2009 04:08PM PS73 wrote: pdaw im in july as well.",
      "MessageIndex": 20,
      "PostDate": "31/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734424",
      "Title": "Starting Chemo June 2009 zuzeee zuzeee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 28, 2009 04:47PM - edited Oct 28, 2009 04:48PM by PS73 Adjuvant online dosen't factor in BRCA or to my knowledge her2nu status.  Its only factors are surgery, chemo and hormone therapy. I personally do not think its a reliable source.  http://www.adjuvantonline.com/online.jsp I logged in as a dr to get the stats.",
      "MessageIndex": 48,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "May 11, 2009 06:52AM PS73 wrote: Hang in there Hannah!!! xoxo",
      "MessageIndex": 259,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 18, 2009 07:22AM PS73 wrote: Hi Angel, I just read thru all of your posts.  I hope you are hanging in there and I just wanted to send some love and support your way :)  xo",
      "MessageIndex": 147,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732096",
      "Title": "New info.... angeltam PS73"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Feb 12, 2010 03:34PM PS73 wrote: Elizabeth, Im so sorry that you got this crappy news.  Sending you warm thoughts and prayers.",
      "MessageIndex": 14,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Mar 9, 2010 06:17AM PS73 wrote: Hi Elizabeth, I just wanted to drop by and wish you well for tomorrow.  I am thinking about you and praying for you.  :) ",
      "MessageIndex": 388,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Nov 23, 2009 06:55AM PS73 wrote: I asked the same question to my oncologist who said, a bilateral mastectomy does not increase your chance of mets. ",
      "MessageIndex": 4,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744378",
      "Title": "Keeping One Breast as a Diagnostic Tool? Alaina blondie45"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Nov 29, 2009 08:49AM PS73 wrote: I was told the opposite actually.  I was told the tamoxifen is taken to reduce recurrance such as mets from the original cancer. I was told the bmx would reduce a new cancer by 30% over thirty years.  Lump+rads or bmx have a five percentish difference in recurrance however a lump +rads has a 1% increase per year for a new bc if you've already had bc.  Your estrogen receptors are blocked by tamoxifen so the (potential) lingering cancerous cells cannot attach to tamoxifen or estrogen and spread thru your system. A new cancer and a recurrance are very different animals and should be treated as such. ",
      "MessageIndex": 24,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744378",
      "Title": "Keeping One Breast as a Diagnostic Tool? Alaina blondie45"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "PS73 wrote: I flipping got a tick bite this am - uugggghhh.  Im really not in the mood for lyme disease right now and Im sure they are going to go batshit crazy with the meds as a preventive. I got it off and squeezed the bloody juice from my leg and swabbed with peroxide but there is a red/brown, itchy, burny mark.  I know I got it all out bc the bugger was intact - not very full looking either. Has anybody gotten a tick bite during chemotherapy?  What did the Drs do? \"Never give in, never give in, never; never; never; never - in nothing, great or small, large or petty - never give in except to convictions of honor and good sense” Dx 4/23/2009, IDC, 2cm, Stage IIA, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741853",
      "Title": "Fall and tic bites PS73 SoCalLisa"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 10, 2009 03:56PM PS73 wrote: thanks lefty!  good info.  it's a sigh of relief too that I won't have a new drug to have to take for ten days!!  i have listerine too!!  :)",
      "MessageIndex": 2,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741853",
      "Title": "Fall and tic bites PS73 SoCalLisa"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Nov 11, 2009 05:52PM PS73 wrote: medical maryjane!!!  ..actually, I don't like the stuff but valium was my drug of choice during adriamycin since Im allergic to most everything else.  I did find that the nurses were the best.  I called for pain management and we went thru all different types verbally and I ended up with a benzo for osteoporosis for the neulasta shots. Hang in there!!",
      "MessageIndex": 77,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743559",
      "Title": "Waah! I had a meltdown. I don't care who posts! Watson konakat"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "May 9, 2009 08:47PM - edited May 10, 2009 12:17PM by PS73 That is good advice.  The honeymoon suite will be in the chemo ward so Im about as pist as I could be.  I was scared yesterday bc Ive never had surgery and Im sad for my fiance bc he is being stripped of what he deserves - as well as I am too and Im bitter sweetly looking forward to my wedding because once it's over, the therapy starts.  How can someone be so happy in one hand and just so sad in another.  The spelling of unfair should be cancer. Thanks gals.",
      "MessageIndex": 7,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733918",
      "Title": "When does it feel real? PS73 Makratz"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "May 10, 2009 12:31PM PS73 wrote: Thank you Paula.  I really am so appreciative to be on this site and meeting other women who can help me through this.  It sounds like you have an amazing support system - and you had a good experience with the anisthesia.  I have to have chemo as well and Im not sure if I would have the option of not having it.  We go for a second opinion soon so Ill see but from what Ive heard (my gf is an oncology nurse), the younger you are the stronger the treatment-so it dosen't come back.  I found a thread which you may find helpful regarding the chemotherapy.  It scares the hell out of me but Im feeling more and more like it's going to happen; more real that is with the help of this and other threads on this site.  Just like checking off the lists for the wedding, Im doing the same for this disease and how to prepare.  Sadness.  Well, it looks like we are about in the same lineup.  I am due to start chemo July 6 (should have been leaving the jungles of asia to head to a sweet beach) but whatever.  I dont know if ill ever be over the bitterness re the honeymoon. here is the thread: community.breastcancer.org/for...   if it dosen't take, it is in the getting through chemo forum titled \"more tips (and a shopping list) for getting through chemo\"  best of luck to you!  ",
      "MessageIndex": 9,
      "PostDate": "10/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733918",
      "Title": "When does it feel real? PS73 Makratz"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "PS73 wrote: Hi, I was dx about three weeks ago with breast cancer.  Ive had two biopsies, all my scans have been done, Ive got my therapy scheduled, my lumpectomy was yesterday and next week I meet with a fertility specialist.  My body has become a science experiment and a pin cushion as well.  I have bruises everywhere and a hole in my right breast.  I am not sure what is wrong with me as this does not seem real.  Am I alone in this?  I am 35 years old, soon to be wed, no children.  New home, new fiance, new job and new cancer.  I cry, I get scared and get weepy when speaking it for the first time with a newly informed friend but I can't wrap my head around it.  Should I see a therapist or is this common?  I don't know when I will really know what is happening until perhaps it has already happened.  I feel like Im going through the motions, going to the doctors, speaking with the specialists, doing what Im supposed to be doing yet I feel like Im living a lie.  I understand the denial aspect and maybe Im still there.  I was pist, very pist last week and still - I am mad at the cancer and mad at the universe for doing this to me when I was so so very happy.  People call me brave and strong and really Im just so so lost and feel like Im in a bad reality tv show.  Im sorry if I come across as bratty and self-indulged but I just really want to know if anybody else feels the same and whoever has been through this already could please tell me when I will feel like it's real and not a lie? \"Never give in, never give in, never; never; never; never - in nothing, great or small, large or petty - never give in except to convictions of honor and good sense” Dx 4/23/2009, IDC, 2cm, Stage IIA, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733918",
      "Title": "When does it feel real? PS73 Makratz"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "May 11, 2009 08:30AM PS73 wrote: You guys are soo good!  Thank you, I am feeling stronger and realizing it.  Unfortunately when I realize it, I get a bit depressed but its nothing gifts don't make easier :P I got a new trumpet vine yesterday and Im not even a mother!   Ameron, very good attitude.  This is the scary part, but we still have to get throught the hard part but if you hang in there Ill hang in there and we both keep breathing.  Check these boards often, they have helped me tremendously. ..and to your point, Ive always wanted a pixie haircut but didn't have the balls; now I have the t*ts",
      "MessageIndex": 14,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733918",
      "Title": "When does it feel real? PS73 Makratz"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "May 31, 2009 05:41PM PS73 wrote: I am in tears right now.  Its been approx one month since my dx.  A. Bonita, your story was lovely and I will be looking for some of your designs and I would love to be able to talk to you re some of the alternative supplements/juicing and if you did this while going through chemo/rads/hormones.  I am an ex-hippie myself and am having a hard time adjusting to the need for pure chemicals to be put into my system. B - the new ladies being diagnosed, please find comfort.  Only one month since the dx and Im making the biggest decision of my life to save my life.  I know very little still but Im still learning.  My big decision now is ACTH or TCH, I feel like its the million-dollar question and if I get it wrong, it's my life at stake.  Its a whirlwind, you will be making decisions on the fly and all I can say is check back on the site and look at your medical doc reports to compare with what these incredibly smart ladies have to say, this has helped me. Also, I have a trapper keeper with a calendar in it and it holds all of my docs - which you will need to bring with you on all of the many many early dx apts and scans.  I keep a small calendar in my purse as well so I don't have to lug around the big cancer bible of stuff.  Ive had the need to make apts from work so this has helped.  Ok dry now.  Thanks for everyones helpful stories.   * although we cancelled our honeymoon in asia, we are headed to the cape to relax and bike ride through the beautiful country side. ",
      "MessageIndex": 29,
      "PostDate": "31/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733918",
      "Title": "When does it feel real? PS73 Makratz"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "PS73 wrote: Good evening,  I was recently diagnosed with breast cancer.  My pathology consists of PASH and cancer.  I have been told that this is rare as the PASH is surrounding the cancer.  I am wondering if this is bad because of PASH's rapid cell division or if it is indifferent.  Im ER+ - the tumor is 2cm and my bone and ct scans were clear.  Is the 2cm the cancer and the pash? I  haven't received the BRCA back or the HER2. I was told this is a grade 3.I have a burning sensation in my right breast from all areas around the tumor including above, the nipple, in the middle of my two breasts and also under my armpit.  Two months ago, I stopeed getting my period.  I went to my obgyn and he prescribed an ultrasound.  They day before going back for my results I found my lump myself.  I swear it was not there before.  My dr gave me my results of my ovarian ultrasound indicating that I had a 4.5 cm cyst on my ovary.  This will go away and he prescribed me progesterone. Twelve days later I got my menses.  He prescribed a breast ultrasound and after al of the tests and one benign path and then a bad mri along with another four biopsies, I have breast cancer. (I had the lump before the progesterone) however post scan (2 weeks later) showed another cyst on my ovary.  Im due for my period tomorrow however i feel just like I did the last cycle.  It took me 54 days to get my period prior to my last cycle.  Im 35 and Ill be getting a lumpectomy at the end of this week. I start chemo in seven weeks and am concerned that with all of my issues of not menstruating, I will not be able to ovulate to have my eggs taken out to fertilize and freeze as embryos..  I have been regular for years -every 28 days and I have not been on birth control for ten years.  My mother took progesterone while she was pregnant with me thirty five years ago however Im told this is not the issue however Im putting this in for statistical reasons. Is there something there?  Ive heard from two drs that my ovulation and my pash/bc are not linked.  How can this be??  They are both reproductive organs.  Could you explain why the PASH and bc mix is so rare and also if you can assist and tell me if the pash is protecting my body from the cancer or is making the cancer spread.  Im not sure if Im grade 3 because of the PASH or the cancer.  Please advise, this is really concerning.  Im to be married in eight weeks and my fiance and I want(ed) to have kids straight away.  Im nervous about the chemo and about pretty much everything.  Please note that there is absolutely no history of breast cancer in my family. Thank you for taking the time to read this and help me to understand. \"Never give in, never give in, never; never; never; never - in nothing, great or small, large or petty - never give in except to convictions of honor and good sense” Dx 4/23/2009, IDC, 2cm, Stage IIA, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733594",
      "Title": "PASH surrounding malignant breast tumor PS73 MTwoman"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "PS73 wrote: HI Ladies,  I know many are here because they were dx w/ BC or have a loved one with BC and I am so sorry.  This site has helped me tremendously through the years... and continues to.  I had a Breast MRI today because my dr felt soft tissue like mass in my chest wall on the left (opp from the BC).  I don't have tissue expanders or anything that would contain metal.  I had a BMX with some grafting but no metal at all to my knowledge.  ..Im a bit worried.  At the point where I received the contrast, as the MRI was taking images, I felt my chest wall being pulled toward the imaging section.  Is this my imagination or could it be that the gadolinium (sp?) was getting caught up on something inside my chest and being pulled toward the magnetic field?  I know it sounds crazy but I felt like I was being pulled and am real worried now. Is this possible?  Thank you for your feedback :) \"Never give in, never give in, never; never; never; never - in nothing, great or small, large or petty - never give in except to convictions of honor and good sense” Dx 4/23/2009, IDC, 2cm, Stage IIA, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779084",
      "Title": "Magnetic Pull w/o TE or metal PS73 PS73"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 6, 2011 09:50AM PS73 wrote: ..maybe polarity in my silicone implants?",
      "MessageIndex": 1,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779084",
      "Title": "Magnetic Pull w/o TE or metal PS73 PS73"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "May 5, 2009 08:51AM PS73 wrote: glostagirl and annew, thank you for the information.  The tumor inside is malignant however the pash is surrounding it, as you mentioned it is rare.  My dr told me I will need chemo and radiation bc of the malignancy.  I go for lumpectomy end of the week so Im hoping they can advise more about what I have.  Its ER+, that is all I know right now.  Waiting for HER2 and BRCA.  Again, thank you!",
      "MessageIndex": 3,
      "PostDate": "05/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733594",
      "Title": "PASH surrounding malignant breast tumor PS73 MTwoman"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 22, 2009 05:39PM PS73 wrote: Dear Acressle, I haven't seen this thread in a long time, it seems like years ago that I wrote this.  So much information, surgery, chemo and just plain life has happened since then and I am certainly a different person now. I never coorelated the PASH w/ hormones before.  ... that is an interesting theory and does seem to make a lot of sense.  Let me know what your doctor says about it.  Just to be clear, did they find cancer w/ the pash or just pash when they took the tumor out?   Note that the reason why my surgeon went back in for another biopsy was because she felt that pash is usually mixed in w/ cancer (but not all the time so just check to confirm w/ the surgeon that they got everything out and its benign :).  Also, the tingling could be from the nerves regenerating at the surgery site, I had a lot of that and still do to this day.  Have you had a breast mri/mammo on both breasts?  Im sure you are fine but stay on top of your drs, as you said to me, you are your own advocate!   also, bhrt is usually paid upfront for the visits and you can reimburse to your insurance per case by case; i consider the money lost and am happy if i get it back.  get your mri and mammo first before doing any hormones.  I took the test but Im not doing anything until Im off of chemo. Hang in there, hopefully I didn't scare you too much :) Let me know how it goes!",
      "MessageIndex": 5,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733594",
      "Title": "PASH surrounding malignant breast tumor PS73 MTwoman"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "May 9, 2009 07:17PM - edited May 9, 2009 07:20PM by PS73 Kimberley, that someone is going to be extra amazing and the grafts look really natural from what I saw. I hope your kids are doing ok and Im sorry that you feel mutiliated.  I look like a heroin addict, I cannot believe I actually let myself go to shoprite looking like I did with bruises all over my left arm becaus they couldn't get the needle in a vein ..and my shirt had an actual blood stain on it from my back and I still don't know where and why the hell wound was there.  One on my collar bone too.  ewww so grody.  Hang in there you are beautiful and you are strong! Hollyann, Im so sorry for your loss.  I can't imagine losing my sister :( ",
      "MessageIndex": 3,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733918",
      "Title": "When does it feel real? PS73 Makratz"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "PS73 wrote: Hi, I was dx about three weeks ago with breast cancer.  Ive had two biopsies, all my scans have been done, Ive got my therapy scheduled, my lumpectomy was yesterday and next week I meet with a fertility specialist.  My body has become a science experiment and a pin cushion as well.  I have bruises everywhere and a hole in my right breast.  I am not sure what is wrong with me as this does not seem real.  Am I alone in this?  I am 35 years old, soon to be wed, no children.  New home, new fiance, new job and new cancer.  I cry, I get scared and get weepy when speaking it for the first time with a newly informed friend but I can't wrap my head around it.  Should I see a therapist or is this common?  I don't know when I will really know what is happening until perhaps it has already happened.  I feel like Im going through the motions, going to the doctors, speaking with the specialists, doing what Im supposed to be doing yet I feel like Im living a lie.  I understand the denial aspect and maybe Im still there.  I was pist, very pist last week and still - I am mad at the cancer and mad at the universe for doing this to me when I was so so very happy.  People call me brave and strong and really Im just so so lost and feel like Im in a bad reality tv show.  Im sorry if I come across as bratty and self-indulged but I just really want to know if anybody else feels the same and whoever has been through this already could please tell me when I will feel like it's real and not a lie? \"Never give in, never give in, never; never; never; never - in nothing, great or small, large or petty - never give in except to convictions of honor and good sense” Dx 4/23/2009, IDC, 2cm, Stage IIA, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733918",
      "Title": "When does it feel real? PS73 Makratz"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 28, 2009 05:43PM PS73 wrote: Hi Rock, thank you so much!  This list is amazing!  I have had two rounds of AC and my cabinets are stocked with most of the tips above.  I can't thank you enough for the tips on the claritin, I live by it and I know it's helping. I  hope you don't mind if I add to this list???  My surgeons mother, who was an avid BC research scientist, unfortunately was dx with BC some time ago.  She put together a list of tips and my surgeon gave it to me today during a  port follow-up.  There are some overlaps so I won't re-add any.  I hope its ok with you that I add her thots and suggestions... Hands/Feet/Nails - Garlic Nail Developer Hardener by Nutrine Ltd, White Plains, NY (helps with nail peeling).  Harmon Udder Cream or Udderly Smooth Udder Cream (Redex Industires, Salem OH  1800-345-7339, Heel Rescue Superior Moisturizing Foot Cream by Profoot www.profootcare.com and if they peel use vaseline. Eyes - Inability to focus and to see clearly bc of constant tearing.  Dexamethasone drops, also optical ointment for skin around the eyes.  The drug irritates the skin, along w/ constant wiping of the eyes.  Skin Care- Rosemary Oil for scalp - to use with grape oil, Baby Magic/Baby Lotion, Baby Shampoo.  Face - Exuiance Day Creme - spf 15 Ulta Mouth - Sensodyne Proenamel Toothpaste, alcohol free mouthwash, Magic Mouthwas - Rx MMW ONC DIPH/Mlox/Bicarb/Lido - tastes terrible but works very well!  (this is verbatim, I have no idea if it's a mixture or a complete rx).  Triamcinolone Acetonide Dental Paste (for mouth sores).  anti nausea meds: emend - 1 hr b4 chemo, next two days in arm kytril - three days every 12 hrs adivan - sleep aid compazine - every 4-6 hrs for first 3  days after chemo, make you drowsy and constipated zofram - by day 3 to 4 switch from compazine. The rest is pretty similar to the above tips but she goes into detail about bone pain bc it appears that she had a terrible go with it.  Here are her notes for the bone pain: Take a claritin one hour before neulasta.  Take pain pills to deal with the bone pain.  I took 2 vicodin (hydrocordone/apap 5/325) every four hrs and also a half of a lorazepam 1mg).  The 1 mg was too strong, but a quarter or a half helped with the twitchyness that the dexamathasone causes (taken the first two days after chemo).  I took the lorazepam (no more than half) both on the days that I took dex and also when I was having bone pain from neulasta.  That was generally days 3-6. Her third tx the bone pain lasted the entire three weeks.  Bless her heart.  Her daughter is an AMAZING surgeon.  My first biopsy was negative but she refused to settle with the information and requested another biopsy.  She caught my cancer at an early stage yet very aggressive.  I can't say enough about these two extraordinary women and I hope you find the information useful.  peace.",
      "MessageIndex": 319,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 7, 2009 03:40PM PS73 wrote: Hi ladies, Just wanted to drop in.  Ive been busy (got hitched last week!) and now the honeymoon awaits.  Im a July gal as well.  Before going into anything I just want to wish you all well.  Ive read each and every story and just think you are amazing and Im lucky to have you ladies by my side as we travel this together. I had my port put in yesterday and tomorrow I go for my first treatment.  I will be getting lots of vitamin water and gatorade.  Wondering why not just drink mineral water for the isolectric balance thing w/o the sugar or is it a taste preference???  I have the same regimine as Jaccee, Dianne and Hopeful.  I am AC 2/4 and TH 1/12 and then finish the h to 12mos.   No clue about the neulastin and when I get the shot, freaking out over my broken back injury three years ago and refusing surgery (now Im a pro at it go figure).  I admit, I am scared shite-less.  The hair was number one and now its more the organs Im fearful of.  I still have hot flashes from the fertility treatments.  I think I need biotine and claritin.  This is a must, right?   Ok, peace ladies.  ...how about July Jezebels (or is that offensive to some?) ",
      "MessageIndex": 127,
      "PostDate": "07/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 11, 2009 05:59AM PS73 wrote: Day 4 - I hear this is the tell all day.  Nervous.  quarter 405 - I spent 24 hours thinking about your indigestion.  really.  Couldn't remember the name of a product a gf rec'd about five years ago and then I woke up at around 3ish today and remembered.  Its namely for heart burn but I used to use it for upset gassy stomaches and it made me better within twenty minutes..  heres the link: www.brioschi-usa.com/  wlproctor39 - very glad you like your port.  it almost makes the chemo unoticable, if you can believe it.  Its a bit uncomfortable but it makes life easier.  ...Im still having issues with my neck from the placement of my body during the procedure.  Have to call my surgeon/onc/nurse about getting the ok to see a chiro w/ the neulasta.  Anybody know about this?  Joni - claritin works for the neulasta - I read it here and take it bc of it.  I don't know if it really works bc I don't want to take the chance of feeling bad.  I also take vitamin b tincture, vitamin d, calcium and magnesium every day since the neulasta shot.  I am worried about a previous car accident where I broke my back and am just being uber cautious. The b will be good for the taxol so Im preparing since I hear that this reduces the tingling in your hands and Im doing 12 weeks of tax/herceptin.  Supposedly is also good for the memory along w/ malic acid (which is juiced apples and not sure if that is so good to do on chemo - anybody?) Il take it to stay away from the chemo fog but only if its ok.  any color poop would be good.  took colace c last night max dosage and hoping for more than the bunny poops ive been getting.  is it better w/o the steroids bc i don't go on them anymore til next round.  paluding mom, Ill put your mom in my prayers.    i gotta take my emend now.  don't want another near disaster like yesterday.  peace ladies. ",
      "MessageIndex": 218,
      "PostDate": "11/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 19, 2009 11:07PM PS73 wrote: Hi Ladies, Im on day 12 and my hair is hanging on.  I had it cut really short saturday and my stylist said she would have never known I was going thru therapy as it was not coming out whatsoever.  I figure by day 20 I should be bald and Im armed.  I got a new puppy!  He is so sweet.  I hope I can manage his care, his name is Charlie.  ..watch him rip my scarves off in front of the neighborhood.  ..should be interesting. The emend is very expensive but works the best, I take th zophran as well and I find this is second best.  Someone at my follow up mentioned that anytime she got nauseated, she would eat and it would curb it.  I had only taken  the drugs and they seemed to help.  Nausea stopped day 10 and I haven't taken anti nausea since.  I think the claritin (not the d) got me through week one starting the day of the neulasta shot so I highly recommend it along w/ alleave or tylenol.  My supplements are calcium, vitamin b blend, D3 and magnesium - my nurse said these were ok to take and Ihave been feeling pretty good.  Colace C works really well for the constipation.  I take four every third night.  Food tasted awful on day ten, I thought someone doused my fish in cod liver oil.  I will never eat fish again. ..but this only lasted a day.  ..watch drinking beer.  I got a nasty thrush in my mouth because of five sips of a home brew and this took one week to cure.  I heard the chlorine issue and not swimming but my friend went through the same regemin and swam all the time so Im not sure - is this for the skin?  Ice chips during the kool aid (adria) portion helps keep mouth sores at bay for me and I intend to stick my hands and feet in ice water during the taxol ...just in case.  My crash days are days 5/6 from the last round.  Im really interested in hearing about everyones crash days.  i wonder if there is any connection or if its entirely personal. Does anybody know anything about staying out of the sun/beach and why.  How about the ocean? Good luck everyone, your stories are very encouraging.  I hope my info is helpful to the newbies.  I am encouraged to drink one gallon of beverage a day.  I can't do this but Im trying.  I go for round 2 of AC this wenesday and then only two more ACs.  Cheers! ",
      "MessageIndex": 431,
      "PostDate": "19/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 30, 2009 11:04PM - edited Jul 30, 2009 11:05PM by PS73 Hi ladies.  Hope everyone is doing ok w the SEs.  By now, the last rounds are on their second week (I think) and you should start feeling better however if not, sorry and hang in there.  With my experience, I think by day seven the SEs are lessened.  By day six,TX2, a new side effect emerged for me.  I had issues with my legs from the neulasta shot. Odd pains like I had been standing all day with knees locked.  No fun and weird that it would wait so long to appear post neulasta. I am also curious about the Vitamin D situation.  Mine was low when I was initally diagnosed.  I was 12 and normal was 35.  I have been taking 2000IUs daily and last week I was still low. My dr. rec'd another 1000IUs, so now I am taking 3000IUs and on average you need around 600-1000IUs. Sunbllock can hinder Vitamin D absorption - great.  ..also areas where there is a lot of smog lessen vitamin D intake.  feeling kinda screwed right now.  ...gotta love NJ. ",
      "MessageIndex": 755,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 4, 2009 09:46AM PS73 wrote: hahahah love it Paulding Mom!!  awesome! Josybee - I am on the same regimine but you are a little ahead of me.  Congrats on being almost done w/ AC.  Only difference is I will go on taxol/herceptin weekly for 12 weeks.  Im NOT looking forward to tomorrow at all - 3rd tx of AC - uuuuuggghhh.  I heard the herceptin is the 'easiest' in terms of immediate SEs.",
      "MessageIndex": 846,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 14, 2009 07:28AM PS73 wrote: stef, my girlfriend sent me a song to listen to - Miley Cyrus - cry.  I know there is a thread somewhere on this site for songs that get you through.  It will of course make her sad and cry at first bc its close to home but they are meant to be inspirational.  I think Im going to now check out that thread and make a mixed cd.  My gf is actually really cute.  Im just out of the closet to a very large wave of ppl.  I kept it close to my chest bc of the wedding and wanting the focus to be on happy and not sad.  It feels liberating and on one hand nice to have a new set of people caring and thinking nice thoughts about you. ..but on the other hand, it is hard to have to say it again for the first time to someone new.  Its like reliving it to me.  ..so in that respect Im pretty exhausted and haven't been sleeping (has to be why). im also having a family dilema.  my sister is coming into town but its on my awful day.  i told her i might not be able to pick my head up off the pillow yet she still wants to see me but obv would not if I asked her not to.  I know ill just break down.  Karen, that is sweet.  I agree. Its nice to have the support from ppl.  As someone told me, people are wanting to be with you because they love you and want to support you through this any way that they can; take some of the burden off of you and walk with you.  Enjoy those flowers. ",
      "MessageIndex": 1012,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 24, 2009 10:19PM PS73 wrote: Hi gals. thanks for the supportive words, they really do help.  I am pist still, hoping to recover from the anger soon.  Ive had two doses of blood thinners now.  It looks like the clots are from the port and the chemo.  My onc today said they need to monitor me every few days to make sure my blood isn't too thin but is about 2x more thin than normally. I am secretly desiring a dirty martini but am not going to do it even though, it should help thin out the blood!  I was told that after my twelve weeks of taxol they are going to remove the port bc of the clots so every three weeks Ill have herceptin intravenously.  Ive read a couple women saying that they don't have the port, how does this feel?  Are your arms sore?  ..Im a lttle worried bc my 'good' veins are on the cancer side.  uggh.  keeping focus.  thanks again. Just wanted to say congrats to those who are feeling great, and I envy you but no doubt you are also dealing w/ cancer so it's not like it's an easy ride for anybody here.  Everyones strength helps me to be strong too.  Also wanted to suggest buff hats.  http://www.planetbuff.com  these are great.  they are sweat wicking so more comfy than hats or scarves.  lots of color options too.  ..not commando as this is really the most comfortable but a close second imo.  Be strong ladies, thanks again! xo",
      "MessageIndex": 1115,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 28, 2009 10:54AM PS73 wrote: Hi gals. Hope everyone has a SE free weekend.  :)",
      "MessageIndex": 1172,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 13, 2009 11:51AM PS73 wrote: Hi Js!  I searched thru this site for information regarding billing and assistance.  Two more women were recently dx w/ BC and one needs financial help.  I know the information is here somewhere but I cant find the numbers.  I found the bc.org info but was wondering if there are any other tips you ladies could send or bump up.  I hope everyone is doing well, I think we are all into the next regimen - congrats on finishing the first part!!! xo",
      "MessageIndex": 1272,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 13, 2009 06:46PM PS73 wrote: Thanks Shelia :)",
      "MessageIndex": 1275,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 24, 2009 05:22PM PS73 wrote: I don't want tamoxifen and am opting out. Im only 25% ER and PR negative which drops the efficacy to 33% and then w/ the low ER I only imagine it even lowers so Im not doing it.  Too many horrible side effects so Im looking into alternatives - it was the bad press that got me reading into alternatives.  I don't understand wiping out your hormonal system - just seems very unnatural but to each his own.  I know ppl who did AIs/tam and are fine and I know ppl who did tam who are not. Guess thats why there are menus. Lauren that is so funny, I used to live in Morristown.  Small world. Tara, I use this sally hansen quick dry in crimson red.  I don't leave the house w/o it - it dries in two minutes. I haven't seen my nails in months when they started graying I covered them immediately and just keep shellacking away.",
      "MessageIndex": 1335,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 21, 2009 02:53PM PS73 wrote: Blessed one, did you do an echocardiagram?  What was your injection fraction?  Herceptin sometimes can be additional damage to your heart and lungs.  If the Adriamycin, was rough on your heart, they may have held off on the herceptin.  This is the only thing I can think of. My taxol started one week after AC.  I do weekly taxols and get herceptin weekly as well. ",
      "MessageIndex": 1456,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jan 19, 2010 11:56AM PS73 wrote: Joni - wow, I am super excited for you that you are finished.  You were the jedi imo who had it the roughest with chemo.  So glad for you!  Lisa, it is cold isn't it.  I stopped wearing the wigs and I haven't gotten as many looks as I thought I would.  I put some gel in my hair to mess it up- the whole 1/2 \" of it.  I think (I hope) I look like a french girl.  ..I think it's attitude.  When I wore my first scarf in public I had all this pizzazz like I was ms. fashion and I didn't get a  look but then one day w/ another scarf I was so paranoid and every person looked at me like I was a cancer patient (which I was). Im two weeks out post bmx and can't wait to have these pesky drains out.  Ive never been one to sit around but I find myself obsessed with ABC daily and it keeps me out of trouble like pulling my left pec muscle opening the oven last week.  Well, I got into lots of trouble for that one so needless to say, Im still in my robe right now. I wish you all warmth and wellness.",
      "MessageIndex": 1609,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 1, 2009 09:46PM PS73 wrote: ..I used to think that because it seemed logical. But, I was told 12 weeks to wait for chemo post surgery as maximum and reasonable amount of time.  I am not sure what the standard is for biopsy to surgery though, sorry.  I was about two weeks post biopsy to surgery because I just wanted it out of me asap.  ...then about 8 weeks to chemo.",
      "MessageIndex": 2,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/744800",
      "Title": "Progression of IDC question sparkyhammerjigsaw baywatcher"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 8, 2009 09:22PM PS73 wrote: ***note - the inconspicuous placement of the cold water bottle between my legs was more of a  'driving in your car with a bottled beverage fashion' and less of a 'im a porn star at the clinic'.  ...just read the kool aid affects your mucuous membranes and the cold constricts the blood vessels and therefore doesn't effect as much.  They toyed w/ using cold on hair (of course I asked) but the results were a numb bald head. Joni - it didn't hurt at all - keep it in mind.  they numbed the area with a cold spray and stuck it in no pain at all! shalom",
      "MessageIndex": 160,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 10, 2009 07:19AM PS73 wrote: Carolee, that is right around the corner.  I hated the anticipation.  Once you start you will feel so so much better (believe it or not).  The anticipation is the pits.  For my first visit, I brought mags, books, a blanket in case I got cold, ice chips (they apparetnly had these) - to suck on during the adria which took me 10mins for 45mls so it wasn't too bad.  My place had a dvd player for everyone individually so a movie is not a bad idea.  It goes quick.  Have some comments. Britta - your blog is really awesome.  I like the layout and found it pretty informative esp the night sweat part - Ive been having night sweats for about three years and wasn't sure why, and now there may be a link to cancer.  Second, Im hoping the part of the vitamin C, and the antioxidants are for post chemo skin and not during as antioxidants and c are a huge no no since they compete w/ the chemo to fight cancer cells.  Just want to clarify.   Not sure if you are going to check back but I had to put it out there to the sisters. Just read this: Chemo drugs are very drying to your body's tissues, and the drug will be going to every cell you have. Right after an infusion, drink 8 ounces of water every hour until bedtime. Avoid caffiene, as it is also drying and may cause you to feel worse. One other benefit of drinking this much water is that it will help your body to process and flush the chemo drugs out of your system sooner, so you can start to recover sooner, too.  Connie you are a huge water drinker - 1 gal a day, bless you but I can't do it dear, I try and try.  ..and lastly i feel pretty darn good right now.  no meds, neulasta shot yesterday *Carolee - this increases your white blood cells (or red, not sure) since they drop during chemo - it goes into the bone marrow to produce more cells.  sometimes you feel growing pains or worse and you get this shot 24 hrs after every Adria treatment -either by a dr or caregiver.  I call it my heroin.   ok, off to shoot my post wedding documentary since my videographer forgot to interview us seperately pre wedding -drr.  documentary and not a video bazzar, friend of a friend.  cheap + artistic = yah.  be well jayhawking jubilleed jedis to the jugonat",
      "MessageIndex": 190,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 10, 2009 08:40AM PS73 wrote: nobody listen to me.  i didn't take my emend first thing and now I feel yucky on the verge of vomiting.  hoping to catch up.  take your drugs as directed.  :(",
      "MessageIndex": 192,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 11, 2009 09:27AM PS73 wrote: Hi Seyla, thanks for the information.  Unfortunately, nothing worked for the pain.  I tried tylenol and alleave for pain.  I tried valium and an anti-anxiety to help me sleep.  Im allergic to pretty much all forms of opiates and then some so I just have to deal.  I only have one more AC!  Im sooo happy to be over the AC hump.  I couldn't bear to move it was so bad and crawling up the stairs with the pounding headaches as well.  Nuf said.  Its done and I dealt and now Im ok.  Thanks for the info on the eyebrows.  I have a wedding in the beginning of Oct and Ill be four taxols into it, (am doing 12 weeks worth of taxol/herceptin then every three weeks for one calendar year of herceptin) so Im hoping to still have eyebrows and lashes - if not, then Ill be doing stick ons.  ...should look like a hottie!  ha, not.  Ill go for the elizabeth taylor eye brows bc her eyebrows were always so beautiful.  I also have a Jackie O. wig which is synthetic so hopefully I won't catch the place on fire. can you imagine!  Hope everyone is ok (((STRENGTH)))   ((((HUGS)))   (((NO PAIN)))",
      "MessageIndex": 968,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 12, 2009 10:31AM PS73 wrote: Kim, congrats on the new business, sound yummmmmmmyyyy. Do you deliver to NJ? :) Good luck Joni2, something good will come out of the exchange student's visit I am sure of it - maybe in their lives or yours.  Im a believer now. I asked my breast surgeon about the BRCA 3/4/5 gene mutation.  I was told by a Dr. at Johns Hopkins that this is a genetic mutation which is linked to melanoma/ovarian/breast/colorectal and pancreatic.  She said that in two years it should be available for testing as it's still experimental.  I found nothing on the internet on it and my dr promises to get back to me after she speaks with the BRCA guy (she texted him yesterday in my presence).  Ill definitely share the info along when I recieve it.  My uncle died of Melanoma and there is absolutely no BC in my family so I am really wanting to find this out.  I promise to post all info I get from her.  Be well everyone.  xo Meghan",
      "MessageIndex": 989,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 17, 2009 07:18PM PS73 wrote: Michelle, you are my hero!  I did loads of gardening today, and am trying to get it all in before I start to feel like crap agin. ..my nails have officially turned grey and are about to start peeling.  lovely.  has anybody tried the garlic stuff?   tx 4 wednesday.  ugggggghhhhhh ",
      "MessageIndex": 1045,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 25, 2009 02:55PM - edited Aug 25, 2009 02:56PM by PS73 You guys are so supportive, thank you.  I feel better already from all of you wonderful ladies (and men)!  ..thanks for the port info, Im more at ease knowing that its do-able. Regarding the scalp - my surgeons mother, a BC survivor, put a list together of things that will aid the SEs from chemo (I posted it on the More Tips (and a Shopping List) for Getting Through Chemo).  She used Rosemary Oil with grape oil for the scalp.  I have no idea if it worked but thought I would post it here in case. Be strong lovely people.",
      "MessageIndex": 1127,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 27, 2009 12:26AM PS73 wrote: Quarter, I hope you feel better soon.  Don't not post - it's not just happy trails here, I think in the thick of it, most of us are going to be sad or sick or both.  Im still there but the amount of support here has helped me tremendously.  Kathy described it as humanistic as possible and I can go weeks as happy as a clam and then out of nowhere it just hits me that I have cancer and I find myself depressed for a long while. So so so many things going on in my head lately but the good of this disease is how it brings people together.  People want to help and support.  It really is phemonenal how people step up and take good care of you when you are down.  I know I am blessed and this helps me get thru the harder times.  Gill, how are you feeling?  How is your ankle?  I hope you feel better soon.  Im not sure what state you live in but in the northeast the weather was brutal last week as Im sure that didn't help your situation and being dizzy. paulding mom, how is your speech coming?  Did you come across any stats on self exams and finding bc that way?  Just curious bc the drs never really cared too much that I found mine, in a way that was noted that is. LoriJo, that is hysterical.  I need to get my licence updated with my new married name but Ive been holding off bc of the chemo, etc...  lmao  I saw a commercial today for eco something (a galvanized steel water bottle) - they were saying that the breakdowns of the chemicals from plastic water bottles contaminate into the water when they sit in the car.  They used the words 'leads to breast cancer' in that commercial. Wow was all I could think; that's pretty ballsy to write.  Then I started thinking about how at the time I had a backseat full of empty water bottles and how I felt that I was being 'healthy' and not drinking the diet pepsi fountain sodas like I wanted.  So it leads me to this question: how do you feel about how you got bc?    Anyway, Im rambling tonight.  Preparing for no sleep. Im going to put the fan about two feet from my body in the hopes that the hot flash that lasts fron 4:30pm to 4:30 am will not be too bad. Im afraid to take anything hormonal so Ive been just dealing with it. Hang in there girls Ihope those of you who had tx this week are doing ok.  just think, only a few days and you'll feel much better.  :)",
      "MessageIndex": 1148,
      "PostDate": "27/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 24, 2009 01:45PM PS73 wrote: My onc literally left a breeze yesterday when I saw him.  I worry that its all over both breasts again.  Such a worry wart.  They really should do mri's while going thru I mean come on, some ppl do reoccur quickly if they didn't get it all.  uggh  the port is ok.  it caused me to get clots so we have a love hate relationship.  If it feels weird, get an ultrasound.  My arm started swelling and getting reddish purple which moved to my chest so I ended up in the ER all day and finally got an ultrasound and they found clots.  It bothered me with pain only for a month before I saw my surgeon and she said it was nothing.  One month later meet coumadin - used and loved by all since 1950.  hmmm. ",
      "MessageIndex": 1327,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 15, 2009 09:21AM PS73 wrote: Danm Joni, I was hoping taxol would have been easier for you (much easier and that you would get a break)!  The eye thing stinks!!  And that is unbelievable that you had to do an MRI for the facial numbness.  I don't know much about the ink so Ill need to look into that prior to any future MRIs.  I have not had facial numbness.  I did and still do have nose bleeds.  The neuropathy started around taxol 6 or so and comes and goes two weeks out post tx.  Its manageable.  After the last tx, I was wiped out though.  I haven't been that tired in a long time.  Also, I got sick with a cold and am stil fighting it.  I really don't want to take antibiotics and so far its been getting much better - all sinus stuff is clear so I think Ill be ok.  I just worry about all the nasty things going around right now. - My hair is about a half an inch all around my head.  It started growing on tx taxol 7 and hasn't stopped.  I read about hair loss after taxol as well but I think it is different for each person. Im starting to get a wave in it - look out! Have a great holiday to everyone!!",
      "MessageIndex": 1547,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Mar 1, 2010 05:31PM PS73 wrote: Lisa, that looked and sounded like fun.  I had joined the group and read that they were headed to Atl.  The website is www.youngsurvival.org.  Im awaiting feedback about starting a group in my hood. I hope everyone is doing good.  I jogged for the first time in a long long time.  It felt awesome.  Im so happy february is long gone.",
      "MessageIndex": 1657,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "PS73 wrote: Hi, just wondering if anybody is having tooth sensitivity during chemo?  This is more like an aching toward the inner depths of the teeth, not near the gums.  Anyone?   Im on taxol/herceptin right now.  Thanks for the feedback! \"Never give in, never give in, never; never; never; never - in nothing, great or small, large or petty - never give in except to convictions of honor and good sense” Dx 4/23/2009, IDC, 2cm, Stage IIA, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/743972",
      "Title": "Teeth Pains and Sensitivity PS73 CoolBreeze"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 8, 2009 09:27PM PS73 wrote: Yes. hopeful, joni 1 and dianne and I are on almost the exact same reg give or take a few.  going to wtch a movie.  just ate wedding cake yum. steroids are making me a little hoppy.  ill stop posting for tonight - im a little obsessed and couldn't wait to come home to report in to the july gals.  i wonder if any men are or have been on this site?  im rambling.  ciao.  water next.",
      "MessageIndex": 161,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 13, 2009 08:03AM PS73 wrote: HI gang.  Thanks for the hairy tongue info.  I was given a  rx of nystatin but its not gone yet, I have done three swishes so far and still have a very white tongue.  pretty nasty  Also noticing that I didn't take the claritin yesterday and yesterday was by far the worse day so far.  Just a tip as it may actually be helping w/ the hit by car at 65mph pain I felt yesterday.  I told the nurse about claritin with the neulasta shot and my nurse said she would pass the info along to other patients if we all feel like its helping with pain management, so kudos to the bco teams.   Day six is not a walk in the park but nothing was as bad as yesterday.  Thanks for the encouragement! Stay strong gals! ",
      "MessageIndex": 263,
      "PostDate": "13/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 16, 2009 11:47AM - edited Jul 16, 2009 11:48AM by PS73 Hi Triple Js!  Its nice to read these posts - very inspiring.  I got great results from my one week apt w/ the nurse - she said, whatever you're doing, keep doing it.  Good info on the scalp as my hair is thinning as we speak.  Connie, my friend, I will put you in my good thoughts on Monday. me.  I live in Franklin Lakes, NJ (not a tv housewife whatsoever -opposite).  I was married June 27, 2009 and dx w/ cancer April 24 (one year to the day of working at the number ONE supporter of breast cancer research).  We cancelled (postponed) our honeymoon to Thailand to December 010 where we will stay in a tree house in chiang mai, sit with the Asian Elephant for a day studying their habits, take a Thai food course AND a jewelery lesson (go Lori!) and then hang in a hut at thebeach.  Im 35 yrs old and no bc in my family so it was a shock but not as devestating as people expected.  Im a survivor - always have and will be.  Im getting a rescue cavalier puppy tomorrow. I pray more than I used to (with my husband, which I find very rewarding) And. Im going to make this fucking disease look fashionable and kick its ass along the way.  cheers Js",
      "MessageIndex": 346,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 23, 2009 09:01AM PS73 wrote: Paulding mom, I am so sorry about your mother.  She has a great support group here!  Tell her to hang in there.  She is lucky to have you right there for her to support her every step of the way.   Shes in my good thoughts and prayers!",
      "MessageIndex": 536,
      "PostDate": "23/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 24, 2009 05:00PM PS73 wrote: Joni sorry to hear that it knocked you out.  ..but glad day five is a little better.  I had heat sweats on m first round but my second round is everything my first round was but earlier and a little more SEs like acid reflux.  First round, day 5 hit me hard.  Second round day 3 (today) is awful.  I can't open my mouth, my throat hurts so bad.  My body is sore to the touch and of course the emotional aspect of shaving my head today.  My DH thought it was sweet to put a little mullet action on the back of my neck and ears so that when I wear a hat or scarf it isn't as noticable.  ...now I have to go back and re-shave it bc he used the number 12 blade and that is about an inch of hair that keeps falling out everywhere.  He was very sweet and came home and brought me soup but I couldn't get off the sofa to have him shave off the rest.  Maybe tonight bc not only is it a mullett, but its a mullett made of knives.  Joni 2, Im with you, shave the shit off pronto!   ..the only hair not falling out is my leg hair and where exactly is the justice in that?  Just want to raise a glass of milk of magnesia to the ladies who are going thru these awful SEs and work right now.  Cheers",
      "MessageIndex": 561,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 26, 2009 11:01AM PS73 wrote: Hey Js.  How is everyone?  From the looks of it, everyone has been managing the SEs.  The asparagus for acid tongue is brilliant, where?  what?  how?  ..going to try it out one day in the future when I have the stomache.  All you georgians, ever hear of Covington?  My sis lives there.  Im day five on my second tx of AC DD and ouch, yuck, puke, bleh, I don't think I could tolerate anything entering my body except lemon water.  Wish I could eat or drink something right now but the thought of it makes me want to vomit.   Puppy is so cute, sleeping on the sofa spread eagle.  I can't imagine being that trusting.  May go to a movie bc have been cooped up all weekend.  Not sure if Ill do a wig or scarf and am trying to figure out how the 1920s scarf fashions worked and Im failing miserably.  I kinda look like a terrorist. Just saying hi to you gals.  Im so glad that you are all doing well!!! ",
      "MessageIndex": 606,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 5, 2009 09:33AM PS73 wrote: Hi gals. Thanks for the support.  Today is round 3 of AC then only one more in two weeks.  Ill be happy to have it behind me.  Connie, you cracked me up with the flatulance, glad its not the nasty heartburn like the last round that you had.   A little gas (or big gas) is welcomed compared to the other SEs. Blessed one, we are on the same regimine - Im one AC round ahead of you.  Drink lots of fluids.  I hated my tx 2 and am hoping 3 is better.  Been juicing all week in hopes it will be better.  cept have a bad back which flared up yesterday bc of nerves, am hoping the neulasta dosen't kick it into gear.  Joseybee we are also on the same regimine.  How are you doing w/ the treatments, you are one ahead of me on AC.  My nurse told me the 12 weekly taxols are better tolerated and the hospital is only 20min away.  Its a pain to get a ride weekly but Im so nervous about the taxol.  ...again, anticipating it like going for my first AC.  We ar kind of pros now aren't we?  I also like to look into the natural girls posts about alternative treatments and get an idea of what they are drinking and eating during tx - smart gals. Tara, my hair fell out day 15 and continued until I shaved it to a buzz.  It was painful to have hair coming out but more in the physical sense bc it was a short hair cut and it hurt.  Day 10 I got a cute pixie (it was past my bra) and donated to wigs for kids.  Five days later I knew it would be gone and it was.  So far I have my eye lashes and eyebrows ...and lots of leg hairs. Stay strong JJJs!",
      "MessageIndex": 881,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 10, 2009 10:49PM PS73 wrote: Hi Js, hope everybody is doing the best they can and managing the SEs.  Im six days out of my tx 3 of AC and this was by far the worst yet.  Im hoping #4 is atleast a little easier. Im allergic to muscle relaxers so ive had to deal with the pain the old fashioned way and it literally hurt to breathe.  The neulasta really kicked my butt this round and I couldn't sleep through the pain with two valium and one anti anxiety.   ..but, Im out of the woods now and am just so relieved to be done with round 3.  I still have the neck pain and the fatigue and the overall feeling of being hungover but far better than this past weekend. Anybody know what to expect w/ the eye brows and the eye lashes?  ..and if Taxol and herceptin make you lose your hair as well?  Christc, I got my period after my first treatment of AC and Im due again any day now.  Not sure what part of the chemo affects menstruation.  Ill ask my nurse when I see her next wed. Hang in there guys, we are barreling through this.  :)",
      "MessageIndex": 958,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 11, 2009 05:57PM PS73 wrote: Congrats Dianne!!!! ",
      "MessageIndex": 976,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 6, 2009 06:23PM - edited Sep 6, 2009 06:35PM by PS73 Joni 1 and RajinCajin, Im so sorry that you are having terrible SEs.  Chemo is awful and yes, it feels like it's killing us at times but you will eventually get thru it.  Just think how far you have come.  Joni, the emend is the best, if you can get it you should certainly try it.  You wrote that the zophran isn't doing anything at all, correct?  IMO, emend is the best and then zophran is second best.  Zophran isn't as exp. as emend though.  Just so you know, my third AC knocked me on my ass and it was by far the worst in terms of pain.  I thought I was going to never get thru it.  The pain was terrible, my skin was three sizes too small for my bones and I was sore to the touch four 72 straight hours, no sleeping pill could help me thru it.  My fourth round I requested a drug for osteoporosis bc I was allergic to everything else.  This worked for me but Ihad other SEs that trumped #3.  I so know where you are coming from and I didn't think I would ever get thru it.  Seriously though, you know your body best, if you really think you are not strong enough for the chemo, you should contact your doctor immediately and discuss options.  ..Especially if your counts are really low.  What are your counts?  Good luck ladies!",
      "MessageIndex": 1237,
      "PostDate": "06/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 30, 2009 10:56AM PS73 wrote: Lauren, I would say anything in the realm of better health is good decison. It is a personal decision whether you go to a nutritionist/ND/Med Dr.  I am in NJ too and am doing tons of research to find a good one who has a mix of all. ..it has been difficult to find someone great but Im committed. I think supplementing is good, depending on where you get your supplements from and with that said, there are some foods that won't give you enough nutrition depending on where you get them and how you prepare them.  I have to supplement D3 at 50,000IUs twice a week plus 4K daily to get my very low numbers up. - Sitting in the sun hasn't helped it either. Its a committment indeed and I personally think a mix of all things above are good, but again, some ppl do/did pure vegetarian and some don't - we all have BC here. I ate broccoli every day for six months prior to dx so who knows about that....  maybe it helped so I wasn't worse off?  I would like to think so. Good luck on your journey!!!",
      "MessageIndex": 1358,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 10, 2009 04:11PM PS73 wrote: lots of water and colace c worked for me while on AC. feel better.",
      "MessageIndex": 1414,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 22, 2009 05:40PM PS73 wrote: wow, congrats!!!!!  yeah no more port dance, no more port dance :)",
      "MessageIndex": 1462,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Nov 30, 2009 10:39PM PS73 wrote: lol - I would imagine that it may be the first pic of that kind on these forums! Im getting my port out because I had some bad clotting issues so the sooner the better.  Ill do herceptin iv style.  sorry about your asthma. ",
      "MessageIndex": 1534,
      "PostDate": "30/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 2, 2009 06:45PM PS73 wrote: haha, i just googled it, seems like there are lots of seventies bushes out there.  ..not just my future bush.  ;p  Ill stop now, prob making you ladies uncomfortable. Happy to hear of the growing hair, mine is looking good and brown/gray/blond too. I went commando today in Brooklyn.  Felt liberated.  ..by commando I mean w/o a wig or a hat.  I got a few looks from people, mostly kids but I had to get my wig cleaned and just said the heck with it.  I finsihed chemo yesterday and deserve to do whatever I like.  SallyMae, hang in there.  Your hair will grow too. ",
      "MessageIndex": 1538,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 5, 2009 05:10PM PS73 wrote: Thanks!  Im happy to be done with it.  :) hope everyone is doing great.  We are having a beautiful snow storm.",
      "MessageIndex": 1541,
      "PostDate": "05/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 14, 2009 11:06PM PS73 wrote: Joni, glad to see you are hanging in there and taxol is much better than the AC.  Have you asked to cut the steroids in half,?  If you do and then the next round do another half, then you may even be able to stop taking the steroids.. I got to thepoint where I didn't need to take the steroid as long as I had the benedryl (it had to be one or the other or both).  Im two weeks post taxol and I have eyelash dirt specs (they look like that) coming in.",
      "MessageIndex": 1544,
      "PostDate": "14/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 31, 2009 10:20AM PS73 wrote: Happy New Year!!  You all helped me in so many ways - I remember being so young and green when I started this journey with the jug a nauts.  May we have a peaceful, healthy and less dramatic 2010.",
      "MessageIndex": 1569,
      "PostDate": "31/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 8, 2009 08:44PM PS73 wrote: Hi Connie, congrats on making it (and working through) your third day after chemo treatment and vry sorry about your sister :(  ..thanks for the ice chip advise - believe it or not, i even sat on a plastic ice block and inconspicuously put a cold water bottle between my legs.  yes, its true. hair or no hair, im a newlywed so be it!  Joni 2- I hope that your port heals.  I broke out from the adhesive and had minor skin ripping scales and bumps, washed with etoh and put on bac. Im sure yours is worse tho so hang in there!  Keep us posted.  Joni 1 - how is your port doing?  I hope some info below prepares you for expectations. I just had my first tx of AC today.  The place was really nice, comfortable and they give you food and a dvd player to watch movies.   I did ok - it's still early though.   My first dose was a steroid (decadron) that lasted about 40mins - 10mg in 50ml solution.  Second was an anti nausea (emend) 115mg in 50ml of solution- about 40mins. My third (and fave) was ativan which is an anti-anxiety- 0.5mg in 50ml solution.  Felt pretty darn good.  Of course the above niceties led up to the bittersweet-frienemy, adria.  This just looks like kool aid so thats what it is to me and apparently the red color comes from coral, which probably is the onlything natural in it.  This only took ten minutes to administer 45mls of straight undiluted kool aid.  Note that when you pee for the first time, it looks like a tequila sunrise so dont be alarmed, rather, use the imagery and head to the tiki bar at the sea of cortez, which is beckoning you.  I make no apologies of being weird these days :) The third, the cytoxan I wasn't a fan of at all.  This again is about 45 mls of undiluted friendly posion and you (I) can taste it.  It was 3q thru and the sinus pain came on.  Like being outside in the cold dry air and breathing in.  This doesn't last though. All in all, I made it through.  Right now, I only have a stiff neck (from the odd placement of my body during the port surgery). And sl acid reflux - very slight. ..just overall feel like Im getting a cold or so w some achiness.  Came home to gorgeous flowers in the garden from my new mother in law and homeade chix soup.  I am so lucky. Also, met three new amazing ladies who will take jin jun (sp?) and reike with me- one who was just finishing her 3tx for uterine cancer and looks fantastic! Different meds, same war. She mentioned this catalog to me by ACS and has inexpensive hats, scarves, good turbons (not weird carmen miranda types but cute ones and also plain skull caps.  also has boob stuff, swim suits and some pretty inexpensive wigs (synthetic) even if its not your thing, could be fun to try on a different attitude every now and again - just don't bake cookies in them!  website: www.tlcdirect.org 1-800-850-9445  Im going to rock the bonnie pixie in dark brown - they take all returns too I hear. Peace Js - jugless'ish bc of my partial mas. ",
      "MessageIndex": 156,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 9, 2009 10:45PM PS73 wrote: lorijo - fmla is an organization out there to help you if you need time off.  you get 12 weeks (unpaid unfortunately) but it guarantees your job.  you don't need to tell your supervisors anything just that you need the time off.  if you can't find info pm me and ill dig it up, i know i have it somewhere.  it stands for family leave act. joni2 - woohoo.  one down!!  uggh the CT/Bone scan was the worst!!  i had the worst gas and we had two apts after.  it was nasty, i was in and out of the bathroom. im one day post first tx.  just have some mild acid reflux. got a little tired and took a three hour nap.  used my anti nauseas twice and had my neulasta.  nothing different pre-cancer save all the drugs.  still tired.  ciao js. ",
      "MessageIndex": 182,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 13, 2009 04:59PM PS73 wrote: Good job Joni 1.  Glad to hear the scans look good.  Hang in there. I go for my pixie hair cut on sat and am donating my hair to wigs for kids.  The very sweet salon doing my hair cut is donating make up to me since I have to dump my old stuff - they did my wedding parties hair and even the manager showed up to the church to see the nups.  Its hard to  find a true blue good salon like that anymore isn't it?  ..i do need to find that look good class though.  any suggestions?  all I found was look good, feel better.",
      "MessageIndex": 271,
      "PostDate": "13/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 14, 2009 04:06PM PS73 wrote: I had the michael jackson juice.  Not sure what its considered but I sure felt happy and was awake not two minutes after they wheeled me back to my bed. The port you will see is a great thing.  I have a huge bump and a scar above it but I can't say my veins would take the chemo so I like it.  You may have a neck ache after the surgery bc they prop you up in a weird way.  It took me about a week to recover from it.   Im anticipating the hair fall out - looking forward to not shaving my legs for a bit anyway.   o2b  your hair looks adorable.  K Js - have to run to a wake for a man who was dx with metastatic cancer one day after my dx.  Sad. ",
      "MessageIndex": 293,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 23, 2009 08:58AM - edited Jul 23, 2009 09:07AM by PS73 Hi team Js!  I enjoyed all of the positive posts.  I had #2 AC treatment yesterday, July 22.  I asked for 1/2 the steroids and they gave me 5ml vs 10ml and I only took 1 of the decaxxxx steroid.  Im doing ok.  I have my neulasta today at 2 and took the claritin in preparation for it.  ...I think the claritin effects individuals differently.  It keeps you up when you really want and need sleep but I know the only day that I didn't take it during the first week, I was on my back and very sore to the touch.  I also have a broken back due to a horrible auto accident and I feel that anything that I can do to make it less severe, I am willing to try. (except surgery- up until now since Im a pro).  I take Calcium, magnesium and the claritin for this and it has worked so far. I also get the inulin from the kefir which helps the calcium absorb in the body.  I had all of these approved by the nurse. Connie, congrats on round 2!!  Yes, more gas than normal here as well.  Same nausea.  Hair is coming out more than a typical shed.  I hope it lasts to next week since I have lunch plans.  ..also I was able to drink one gallon of water/gatorade yesterday!  I need to do it today too. I was worried that the chemo would get washed out of my system if I drank that much water but the nurse said it goes through your blood stream and then your cells, the water pushes it to all the cells and then also flushes it out of your system so it doesn't stick to the fat cells and cause havoc. snowprincess - Im sorry to hear that you are going thru this so young.  I have a friend of an acquantience who went thru (two actuallY) one at 22 and another at 28.  If you want to PM me, I have other ladies you can touch base with - me- 35 but Im still going thru it. Another friend of a friend at 32 when dx.  Now cancer free.  If you have any questions about fertility, etc, PM me.  Hang in there!  (at first I thought I read 12dx for you!) not good.  This site is awesome and encouraging, but down right real to the bones.  not a lot minced. Twinmom - yes, it is much scarier before you go and the anticipation seems endless.  Congrats on round 1!  Bethie1 - woot woot, congrats on getting through it!!!  I will take the advice on the aloe when the time comes.  Thanks for checking in and giving us some insight about the benadryl! Hang in there triple Js!!!!  :) peace",
      "MessageIndex": 535,
      "PostDate": "23/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 30, 2009 01:18PM - edited Aug 30, 2009 04:44PM by PS73",
      "MessageIndex": 1193,
      "PostDate": "30/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 2, 2009 10:14PM PS73 wrote: Glad to read everyone is doing well with the SEs.  I finished AC and today was my first of twelve taxols weekly w/ a couple breaks in between.  I feel pretty good, even went out for ice cream.  PM - Im so sorry to hear about your FIL. xo",
      "MessageIndex": 1220,
      "PostDate": "02/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 28, 2009 10:39AM PS73 wrote: Connie - congrats on being BRCA negative!  You must be so relieved. :) Lisa, my sister said you guys got rained on again, I hope all is ok.  I called the on call dr on fr night, was having weird pains in my breasts.  I thought I felt another lump - impossible?  My dh thinks its my ribcage.  I had had an ultrasound not a month ago on the same breast bc of clots.  This friggin disease is making me crazy but Im enjoying the week off of tx esp since my hubbie brought a cold home and we have a wedding this weekend. I hope everyone is doing good - I can't believe how far along we all are, it seems like a year ago this whole thing started. xo",
      "MessageIndex": 1341,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 30, 2009 09:51AM PS73 wrote: Eliz, Im in NJ, please let me know if you find a good ND. I am going to call a hormone specialist in nyc on central park south and hoping to do this vs tamoxifen and even out my hormones vs eliminating them.  My step mothers friend has been going to her for years and likes her.  I hope she takes my health care!",
      "MessageIndex": 1354,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 21, 2009 11:27PM PS73 wrote: Blessedone, that solves it then :)  ..I hope it heals quickly!!  Thats pretty crazy, dx same month and both in the 2a/grade 3 club.",
      "MessageIndex": 1460,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Dec 15, 2009 05:41PM PS73 wrote: Sorry you are not feeling well Lisa, I agree with Joni, we've been thru the ringer.  After my last tx, I slept for four days practically.  ..but to answer your question regarding tests.  I had my follow up mammo a couple days post my last tx.  It was my six month follow up and they did mammo and ultra sound.  They found some microcalcs around the original surgery site.  All of us agreed that it would be best to get the biopsy.  After a very excruciating weekend the results were b9.  The entire experience led me to my next phase which is not rads but I go for a bmx on jan 8.  I really can't go thru this everytime, I was an emotional wreck - more than the first time.  Im solid with my decision and really feel that its the right one for me. - Im sure you are ok but best to get it checked out.  Good luck with the mammo - follow up with us.  I had so many ailments that were completely different than when I was on the AC.  Neck aches, tooth, skin, ears, breasts -all random ailments.  How is your mom doing?",
      "MessageIndex": 1553,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Feb 16, 2010 08:05AM PS73 wrote: Hi gang.  I hope everybody is doing ok - quarter so sorry for the drama - doesn't it seem like its never ending! I was wondering if anybody is having a reaction post chemo or during herceptin?  My skin is so itchy its crawling.  I thought it was chemo withdrawl but Ive been off chemo for a while now.  Im using oils on my skin so I know its not a hydration thing.  Im trying to drink more water but also wanted to ask the js if they are having a similar issue. Hope you are all great!",
      "MessageIndex": 1634,
      "PostDate": "16/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Feb 17, 2010 09:47AM PS73 wrote: michelle - thanks for the info.  yes, it must be chemo after shock.  im so glad we didnt get the house exterminated - i thought about it though.  hehe - i too have straightish wavy hair which once housed thick curls.  its about an inch as well so the whole process has been seven months from the start of chemo and losing the hair at day sixteen into it.  it started growing back during mid taxol and now Im ten weeks post chemo.",
      "MessageIndex": 1641,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 7, 2009 06:27PM PS73 wrote: Thanks, hes so wonderful.  He won't let me go at this alone, forbids it actually.  Woke me up in the middle of the night to give me advil for the port pain.  Such a sweetie.   I have a question that Im hopeful you can help.  Tomorrow is the chemo christening.  Im drinking lots of water.  I will go out shortly to purchase a few needful things for tomorrow (they really should feed us don't you think?).  Im getting ginger to infuse in some mineral water to help w/ my stomache and prob some honey or is this a no no since its sugar?  Also, is there anything anybody can think of for me to do to prepare for tomorrow pre-during-post chemo.  Im guessing the neulastia will be the next day and read that claritin works for this so Ill pick this up as well.   I really appreciate the posts. what about... To see a jedi knight in your dream represents protection and security. You may be looking for someone to rescue you from current problems. Or, maybe you are looking for your \"knight in shining armor\". If you dream of being a jedi yourself, this signifies your inner strengths and weaknesses.. You are bravely facing your own personal challenges.",
      "MessageIndex": 131,
      "PostDate": "07/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 9, 2009 07:41AM PS73 wrote: backagain - good luck with the port, it hurts like a bitch but its the new black.  save for a large rocklike protrusion that is in your chest, it is such a savior.  No more drug addict arms - yah. joni2 - good luck with that - will be thinking of you, i wonder if the adria looks like koolaid in OR? please let us allknow how you do!!!  you will be great and realize that all of this mental scariness is just that.  backagain - yes I agree.  the only info i could not find was the expectation on the first day.  I should have looked harder as im sure it was on this site.   in case they don't have it: bring lots of water. bring gatorade (you can mix1:1 when you are halfway done w/ your water if you gettired of water), i had all kinds of books/blankets/mags/movies/phone with phone charger/water/gatorade/ with me but you talk to the nurse so much you just don't get that chance to be alone.  we were told no sex w/o condoms the first three days so my hsb wouldn't get chemo.  weird right!  So Connie, you are my fearless leader.  Day four and grande.  So happy dear. Im sure you will be gorgeous w/ short hair.  Keep it up, you give me hope :)",
      "MessageIndex": 165,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 12, 2009 03:19PM - edited Jul 12, 2009 03:20PM by PS73 Day five and am I the only one who feels like Ive been hit by a car?  Called Drs this am and got a script for a throat infection but no returned calls for the lovely thrush.   Drank lots of water, tried keifer.  Biotene is almost empty after five days. Does anybody have any hints on how to get rid of a white tongue and/or if it's def thrush?  I made the mistake of drinking 1/4 of a beer three days ago and have had a yeasty tongue since. Also, I was sick with a chest cold before chemo and I thought it was killed off but looks like it sprang its ugly head back into my throat.  perhaps?  or maybe this is just how this shit goes?  Sorry to be the yang to the above great track record.  ",
      "MessageIndex": 247,
      "PostDate": "12/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 25, 2009 03:18AM PS73 wrote: With ya Joni 2 - I shaved my head today and cried cried cried.  I feel much better now though, the anticipation was not so great.  Im sure you will look beautiful in scarves, hats, turbons, wigs and all the like.  Just got to battle through this my dear.  ..we are all with you. :) Puppy likes to walk on my port and lay on my GI Jane head.  How do you say bad dog, don't walk on mommy?  hmm.  Hoping for a better day tomorrow.  The round 2 SEs kicked my ars today.  Im on DD as well so I take the neulasta - the claritin didn't help or did just was more severe this time, who knows. I was told by my nurse that I could expect the SEs to be the same as the first round but so far they are stronger and earlier so I guess yes, cumulative.  So be it.   Would love a Mr. Misty Cherry Vanilla shake right now.   ..wonder if Dairy Queen delivers at 3:15am?",
      "MessageIndex": 577,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Jul 27, 2009 09:11AM PS73 wrote: SallieMae - warm welcomes here.  Im sorry that you had to join the group but you are at the right place for encouragement, information, laughs, tears and empowerment.  Hopingforacure, Im so sorry that you and your mom are going thru this right now.  I am also in favor of the genetic testing.  The BRCA test will determine if you, your children, and anybody linked by blood to your mother have an increased chance of getting BC as well as Ovarian Cancer. I think that it is important and the increase is significant.  I agree with snowangel - knowledge is power.  Im on the same regimine as your mom but day 19.  I have heard a mixed bag on the AC TH - the AC Ive heard both ways - hard/worse and not as hard as the Taxol.  And with the taxol, that the neuropathic, tingling feelings in the fingers and toes are harsh - thats all Ive heard.  Neither round is easy and none of us want to go thru it but we will because we have to.  We will all get thru it, there is no doubt in my mind.  We will get thru it because we have to.  We have our army formed here and in the end we can laugh at the fact that we are all cyborg-baldie-badasses.    ...if your mom wants a heads up on the ses, she can pm me if she likes.   tell her to drink one gallon of fluids on tx 2 (days 1-3 especially) and ice chips during the AC.  ..off to reike sponsored by the cancer center!",
      "MessageIndex": 639,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 7, 2009 09:42PM PS73 wrote: Hi Sexy Js.  Hoping everybody's side effects are at a minimum for the weekend.  Glasist, you made me cry, a happy cry.  ..thanks! I hear you on the stares.  It happens.  My mother in law told me (whilst I was nearly in tears after a walk thru the mall in a scarf), that yes, we look different and ppl notice it.  All I ask is for a small smile my way, is it too much?  ..that's what I would do if roles were reversed.  Kudos to those who go commando - I hope I can do this too in the future.  I would imagine it is liberating to wear nothing on our bald heads! Elizabeth - nice iwork!  Tell your daughter she is one cool chick.  ..did anybody see 'so you think you can dance' last night?  They did the bc routine again.  Anyone check out that hot calle ocho dance, too? Regarding the stomache issues, I read on a thread for AC SEs that someone took Prostonix for stomache upset and acid.  Im glad the brioschi worked though, its an oldie but goodie.  Hoping for a cure, Im so sorry that your moms onc has moved.  This really tics me off.  Where is the ethicacy or due diligence?  He didn't know two months ago that he was looking for a new location?  I don't know, it just rubs me the wrong way.  Just my thoughts, I personally feel that the care is pretty standard and that the nurses really know their stuff so perhaps setting a regimine with him before he departs and handing it to another well trained onc?  Its a hard decision for sure.  I went to four opinions and we opted for our treatment at the closest (but albeit very good facility) which was also the only differing opinion in TCH vs ACTH.  Anyway she is so lucky to have you and I would imagine that the boards are comforting to you, as I know they are for me.  Hang in there, I hope your moms strep gets cured soon. Im day three post tx AC 3 - sl sore throat.  forgot my neulasta yesterday and took it today- yeah chemo brain.  magnesium stopped working on round three bc I also forgot to take my super expensive emend.  dummy.  I took both when I realized but now the horrible neulasta ses are settling in.  I can barely walk w/ that stupid back injury.  my gf told me I make it look so easy bc I don't complain. I guess I get it out here.  Connie, gassy w/ the prilosec - check.  Sore throat, check.  constipation, check. it goes on.  heartburn, fatigue, hell pain in my legs and back.  nails look like a smoked ten cartons of moores. uck.  I ate sushi and Im not sure if I am supposed to, anybody know about this?  I pigged out.  Probably not my smartest moment, Im blaming chemo brain. I just want to add some stuff to our list.  Many of us will be going on taxol soon.  I was speaking to my onc. and he said the vitamin B complex is good to start now to help w the neuropathy to really get it into our systems.  I started two months ago so Im hoping it helps. Also, I did some research on the SE AC thread.  This is what some ladies are taking. when the time comes: glutasolve - 2x daily for neuropathy.  Atarax - the itching associated with neuropathy (hands/feet). I havent checked the two above w/ the nurse/onc but Ill let you know what they say. K you sexy Js.  I really really apologize for rambling.  I haven't been up to posting lately but reading so there was a lot to get out.  Enjoy the weekend.  My puppy is loving chasing the fireflies; its the cutest and funniest thing to watch so it looks like Ill be doing that. Peace ladies xo Meg ",
      "MessageIndex": 929,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 11, 2009 03:45PM PS73 wrote: HI gals would anybody like to join me in giving two big virtual hugs and raised glasses to Joanne who will be completing her FINAL AC tomorrow and to Connie who will be completing her FINAL AC on Monday!!!!  Stay strong sisters, will be thinking of you both xoxoxoxo",
      "MessageIndex": 973,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 18, 2009 06:23PM PS73 wrote: Dianne, that is really beautiful   :)",
      "MessageIndex": 1053,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 24, 2009 11:31AM PS73 wrote: Hi guys.  Sorry that this disease sucks massively.  Everyone is having a hard time.  I know Im barely hanging on.  Spent all day in the ER for two blood clots that developed from the chemo and my port.  Its a shit disease.  I was wrapped up in all of the hospital beuracracy yesterday and am just so frustrated by everything and I should just be happy to be living and lucky to be on this earth -but Im not, Im pist.  So pist as most of us are right now.  I guess we are all in the trenches now.  Id like to break something but am on blood thinners so its probably not a good idea.  Id say hang in there but what else are we supposed to do? My friend just got back from Africa and visited the prison where Nelson Mandela spent manymany years.  Here is a quote because I don't know what else to do with myself and Im crossing the verge of self pity, which I loathe.  I know we will get thru this because we have to, there are no better options on the table.  Im throwing five virutal pieces of really expensive crystal and saying to you cancer - FUCK YOU and the horse you came in on - Im going to kick your ass and feed your bones to my little puppy.  ..to leave this thread on a more refined note, I will add:   True reconciliation does not consist in merely forgetting the past. - Nelson Mandela",
      "MessageIndex": 1106,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 27, 2009 11:18AM PS73 wrote: Joni, Im so sorry that you are feeling shitty and couldn't go to LA.  Its completely overwhelming.  Ihope you feel better soon, only a couple more to go. I had weird SEs from the AC too.  We called our pharmacy and got their advice onthe SEs and in particular to my tongue thrush, they recd swish and swallow (nyastin). Shelclaire, I love diet pepsi too but it has to be fountain.  I didn't drink too many but certainly had my share right before dx.  Interesting.  The aspartame breaks down into phenylalkanine (sp?) which mimics some sort of weird dna amino acid.  Oddly I am craving one right now.  That and a wendy's cheeseburger. Fuck off cancer, I wont give in to your trickery.",
      "MessageIndex": 1153,
      "PostDate": "27/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 6, 2009 06:37PM PS73 wrote: ...oh yeah, RajinC - the neulasta was my source for pain and it sounds like you are having similar SEs to it. ",
      "MessageIndex": 1238,
      "PostDate": "06/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 24, 2009 11:12AM PS73 wrote: Lisa, I hope everything gets cleared up soon with the flooding.  Just had tx 4 yesterday for taxol/herceptin.  Still hanging on to my eyebrows and lashes.  So far feel pretty good.  Some days I cant exactly walk but as expected.  Other days, I could run a marathon (well walk it anyway).  Q - is anybody feeling pain in both breasts?  I have a port and obv surgery on the other boob but both get jets of cramps running thru them and linger.  Ive seen this written before as questions but has anybody asked their onc about it?  My onc literally passed me in the hall and that was it.  Makes me nervous that new cancer is forming.  Im total anxiety at this point of the disease.  UGGH",
      "MessageIndex": 1323,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Sep 30, 2009 10:12PM PS73 wrote: I have been looking up clinical hormone studies with emphasis on breast cancer and per the research md in the footnotes, I look to see if they are treating physicians and/or naturopathic doctors, locations, other studies they have done, etc.  So far found one MD in Japan but that won't work for me.  ..its a long road with lots of hurdles.  At the moment, Im waiting for info back but Ive contacted a hormone specialist in nyc and asked them if they would be able to discuss options for me or to point me towards someone who specializes in breast cancer - ND/Alternative/other homone specific MDs.  NDs are Naturopathic Doctors.  There are a lot to weed thru - just like MDs. ",
      "MessageIndex": 1362,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 5, 2009 11:44AM PS73 wrote: Joni, Im so glad you are thru with AC.  I find taxol to be much better tolerated - esp weekly which is what Im on.  Good luck to you!!",
      "MessageIndex": 1384,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 12, 2009 04:36PM PS73 wrote: Joni, Im so sorry to hear about your fall.  What do you have to do?  More surgery?  Ive been suffering from a sore throat all thru taxol along w/ earaches.  My dr didn't do much just said, what can I do- here is a name for an ear/nose/throat dr.   I too had a litte drama here the other day. Got bit by a tic and I pulled it of, squeezed the tic juice out of my leg, swabbed w/ peroxide and now it appears to look like a red ring around th bite.  Im not sure if this is from sqeezing or the dreaded.. ld.  I have tx tomorrow and will ask - it's really the last thing I want to deal w/ on top of everything else.  Lauren, congrats on the peach fuzz!",
      "MessageIndex": 1421,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Oct 20, 2009 05:04PM PS73 wrote: Hi gals.  I had tx 7 today for the weekly taxols.  Today was a milestone bc for the last three tx's Ive requested that they cut the steroid in half each time respectively and today I was given no steroids.  Yah.  I actually napped afterwards! Congrats to those who are done, you are my strength!!",
      "MessageIndex": 1446,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Nov 29, 2009 10:58PM PS73 wrote: Hi Js, its been a while since I posted.  I am done with chemo this tuesday - happy dance!!  I also have GI Jane hair - not sure if it will stay.  No eyebrows except one stray dark hair which I color around.  ..and I am so gonna rock the 70s bush when it comes back (sorry for the visual). lol I get my port out Dec 13th and have opted for a bilateral mx with nipple sparing on Jan 8th.  I feel like a surgery pro these days. Glad most are done or into the home stretch.  We've come so far ladies, can you believe it? xo",
      "MessageIndex": 1529,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Feb 16, 2010 02:35PM PS73 wrote: uugh, today is not as bad but its really irritating because I cant reach around my back exactly because of my surgery so I end up rubbing my back on the furniture like a damn cat ;p",
      "MessageIndex": 1636,
      "PostDate": "16/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "PS73",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83234/profile",
      "Content": "Aug 12, 2011 02:34PM PS73 wrote: Hi Jedis.  I haven't been back for a while.  Im so upset to hear about Lisa.  This is horrible. How is her mother, has anyone heard or anything.  They both were dx around the same time-frame. Dear Kathy, I too was on the koolaid.  It all seems individual on how you will react with it.  I did ok on it. The neulasta kicked my butt but I trucked through it.  I took claritan a day before and the day after I believe and it helped a lot.  To the point that my nurses were recommending it to their patients.  I had my concern about messing with the chemo but they said it was ok.  Biotene mouthwash helped to keep away mouthsores and swish and swallow for the time I got thrush.  I chewed on ice during chemo to prevent mouthsores and I read somewhere that women were putting their hands in ice during to help with the irritations from taxol.  Not sure if that helps but it seemed to make it more manageable for me.  Im just gutted in half about Lisa.  She was our angel two years ago starting this group and now she is our angel looking over us.  I don't know what to say except I hate this fucking disease!",
      "MessageIndex": 2070,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    }
  ]
}