{
  "AuthorID": "Psalm121",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
  "Posts": [
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 16, 2009 08:16AM Psalm121 wrote: Good Morning all you Beautiful Warrior Ladies! I've been busy past few days but I've thought of you all every day (several times a day!) and hope everyone is okay.  (in the new meaning of okay we all have).  We had Christmas dinner on Sunday at my niece's house, my family was worried I would skip out on them on Christmas Day since I'm scheduled for chem on Dec. 17th.  I only bought presents for my son and two littlest nieces....everyone else got  money in the Christmas Card.  Even the quick trip to the store to get those presents was overwhelming.  I feel so thankful to be doing things but I can't seem to enjoy them for feeling tired and just so-not-myself.  I have read all the posts and am up-to-date....you all are the greatest!  I always alternate between laughing and crying when I read...sometimes both at the same time!  I still wash my head with the same shampoo just less of it...the funny thing to me is that I still wrap the towel around my head after the shower!!!  Just can't NOT do it!!  When I look in the mirror, I find myself thinking about how I look like I always did and try to pretend there's still hair there.  Then the towel slides off while I'm putting my lotion on and the gig is up....oh well!!  My head actually got a little dry too, so I used that Neutrogena exfoliating face wash on it to and boy did it help!  I went to my son's homecoming basketball game Monday nite....got very tired, but oh so worth it!! I find myself crying most when it is something to do with him...I looked really silly I'm sure, sitting there sniffling and blinking, but he was so handsome escorting his little girlfriend.  I'm just glad it was a day that I could go...the first week and a half after chemo I'm useless/worthless and couldn't do anything even if I wanted to. Mabelle, I loved your party story and SharaD, you could write a book you're so creative!! And Alicia, I loved the stay-at-home in the pjs idea....my son is so busy with basketball practice and games, I can't wait for week-ends when I get to be with him and catch up.  His Christmas break starts Friday, so I hope I'm able to enjoy the next few weeks some. My DH will be taking me to my #3 chemo Thursday, his first trip.  I think he is dreading actually seeing the whole process, but it's so routine already to me.  They always bring both my TX bags at the same time...one nurse reads the bag desciption and the other verifys my chart entry and my wristband ID.  Last time I had the lab people put the IV in for blood draw and leave it so I wouldn't have to just go downstairs and get a second stick for the TX.  I, too had a vein blow with 1st TX and I didn't want to go through that again...first TX IV was put in the back of my hand and that hurt! 2nd TX, I was waiting at the reception desk for my co-pay receipt and the lady was writing Evelyn...I said \"that's not my name\" and she said \"Oh, sorry, I was looking at my computer screen and not your chart\".  Well, when I got downstairs, the nurse said \"Hi, Evelyn, as soon as we get your labs, I'll have a chair for you.\".....uuuhhhhh, \"I'm NOT Evelyn!!\"  \"Oh, sorry, they just called from upstairs and said Evelyn was on her way down!\" Well, then a few minutes later, the nurse came out laughing and said \"I'm so sorry, but your labs came in just after EVELYN'S and we put her in YOUR chair, but we should have another one real soon!!\"  Well, DAMN-IT!!!  I never did SEE this Evelyn, but she better not EVEN be there Thursday...she does NOT want to mess with me!! DH has got to get back in time for son's Bball game this week and I will not be in the mood to be NICE!!! Does anyone have alot of eye-watering?  I noticed last week my right eye was watering and then I noticed a nerve twitch in right eye-lid.....this was on Tuesday and I still have both symptoms in right eye. Left eye waters some but not like right and no nerve twitching....weird. My MIL surgery is scheduled for Dec 30th....will be a big surgery...please continue to pray!! I appreciate it so much!!!    LittleBird, glad you are doing better!!  And Alicia, I'm praying for you and your family......Love to all!!!",
      "MessageIndex": 1001,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 2, 2009 05:23PM Psalm121 wrote: Good evening Warrior Ladies: Hope everyone is doing well or especially better! I, too, have been sick (some vomiting) rough day again....sigh. I can deal with that better than the bone/joint pain.  The Claritin you mention, is that OTC Claritin? and will it help me, (taxotere/cytoxan)?  Also, WBC was high, 33.7 and RBC low, 3.89, HGB somewhat low, 11.5....do these results have anything to do with the bone/joint pain?  I am drinking water and trying to eat, everything just tastes nasty.  I think it's more from the percocet I had to take than the chemo....same problem right after surgery...white tongue and everything tastes peppery.  I need something else to take besides percocet to help with the pain. I tried Aleve starting morning of treatment (every 12 hours) but still got severe bone pain that OTC would NOT touch.  Any help I would appreciate so much.  I know it's important to eat and drink plenty of fluids, but I find myself gagging (sorry) trying to eat and drink. On a happier note, I wish I had a picture of my 14 yr old son trying my wig on!!!  He did some crazy kind of air-guitar move and rocker head-banging motion----I was thinking Dana Carvery, or Rod Stewart?!!!  He's a hoot, a regular comedian, he just needs an audience!!!  He's my sunshine and what keeps me going (he's an only) and my source of laughter obviously.  He's such a young man, now....taller that Mom, which he loves to remind me of.  Now he's measuring against his Dad, who's 6'3\", I used to be 5'8\"---found out first onc visit I'm 5'7\", how's that happen?  My \"cranial prosthesis\" is not my normal hairstyle, it's straighter, but same color.  I .....almost....feel like my old self when I have it on.  I find my head feels cold without something on at home, so I wear a comfy sleep cap, or other cotton hat.  My son came in my room the other nite to tuck ME in, and I had taken my sleep cap off and didn't have time to grab it and put it back on.  I asked him if it bothered him to see me without something on my head and he said \"nope\".  (Kid of few words)!!!!      Look forward to hearing advice......lots of best wishes to all...",
      "MessageIndex": 764,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 18, 2009 06:18AM Psalm121 wrote: Becca: Glad you enjoyed the Christmas Tree decorating and are doing better with those SEs.  The girls here recommend Biotene mouth rinse, it's alcohol free, and you can get it at RiteAid, Walgreens, etc.  I got it and it after #2 tx and it helped tremendously.  Every time I go to the bathroom I brush my teeth, tongue and use the Biotene.  It's clean and fresh, and while I still get the coating, it's not near as bad as it was without the Biotene.  After I've brushed and rinsed, food is always more tolerable for a little while, too.  Sometimes just the effort of trying to eat/drink, is too much, right?'  Best wishes, and hope you continue to feel better!!",
      "MessageIndex": 1027,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 8, 2009 09:36AM Psalm121 wrote: Good Morning all you Beautiful Warrior Ladies!!! Who cares what we look like on the outside? You are all wonderful, funny, inspiring, thoughtful and so dang SMART!!!  So much is going through my head right now, I don't know where to start!! But, here goes....!! BrendaSharon,  I could just picture the DH headscarf shopping trip in my mind----it's sweet and funny at the same time!  I'm also very cautious about going places....I always use a tissue to open doors and keep Lysol wipes in my purse for cleaning grocery cart handles.  Sanitizer is in the car and purse, too!!!  I was always the germaphobe at work anyway -- and now it's just heightened.  I work in a medical clinic...and always seemed to still catch the colds, even when being so careful BEFORE bc!!!   Thanks for all you do for us!!! Shel, loved the Courage quote! The little things, like encouraging each other when we need it most, is what makes this thread so special!!! Sherri, I totally understand the dry skin problem.  Had it after #1 TX, I ended up getting a very gentle exfoliating wash (mine's Neutrogena).  It has helped soooo much....dry skin is cleaned away and then the moisturizer can do it's job!! Melinda, Hope your se's are minimal.....your mentally wimpy statement hit home with me.  Your Mom is probably not even aware she makes you feel she disapproves.  Ask her how she feels, maybe she doesn't know what to say to you...?  I've learned that some people tiptoe around me because THEY are uncomfortable with their own perceptions and ignorances. (meant honestly, not mean-spirited).  Wishing you heartfelt moments!! Cafelov, Warrior Power is Awesome!!  I was on my period my 1st TX, still haven't started and I'm overdue, but not missing it by any means!!! SharaD,  Got your message; I totally agree; but had to laugh; 'cause it's so ME!!!  Love it, Love it, Love it!!!! Kayh, You always have the perfect timing and the right thing to say!!  Alicia, Mouse, Mabelle, These husbands are dealing with our loss as well as theirs.  Their comfort zone has been totally wrecked!  I noticed my husband gets grouchy every time he vacuums---griping about things being cluttered, etc.....I had a meltdown and told him just exactly what Mouse said, \"I didn't ask for ca, and I damn well would RATHER be vacuuming and cleaning house, and so sorry for YOUR inconvenience!!!\" He's been a total sweetheart when he vacuums now!!!  And I always have laundry caught up...so the only laundry he has to do is the weekend after my chemo.....that he didn't gripe about...he just didn't seem to appreciate how much I was still doing even WITH all this crap!!  I caught myself looking at him and yearning to be the wife I was---and I realized this is how he feels as well.  He can't wait for me to be cheerful and energetic and talkative and yes, horny!!!  He yearns for normalcy, just as I do...and sex is just the natural expression of a normal, healthy relationship.  The timing has always had to be right, it's just that now we've got all these other issues thrown into our lives and it's hard for me to believe that he wants that.  But that's HIS normal and I guess that's why I still can't stand at the kitchen sink without getting a slap on the butt, and my...that kiss on the back of the neck DOES feel good!!! Love to all and Happy Husband-Cuddling!!!",
      "MessageIndex": 842,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 30, 2009 08:35AM Psalm121 wrote: Hey, Nette: Thanks for thinking of me....my last TX is Jan. 7th, hadn't noticed BrendaSharon had me listed for tomorrow!  Glad your TX was not rough on you....my WBC's have always been high, too.  I had a major skin break-out after my first TX, started using an exfoliating face wash and shea butter and it helped me alot, too.  Also, I cleaned my shower without gloves and got a little rash on both hands....won't do that anymore!  I'm afraid to step on the scale....I'm one week away from TX and am eating lots of food!!  It still doesn't taste right, but it's waaaay better than a week ago!!  Best Wishes for all the Warriors having treatments this week.  Please remember my MIL, her lung surgery is today.....",
      "MessageIndex": 1141,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jan 5, 2010 11:57AM Psalm121 wrote: Hello Beautiful Warrior Ladies! Oh, I'm so sad, sad, sad!!  and then I log on and see other warriors in the same predicament, we are (a lot of us) in the dreary midst of winter and it is so difficult to be energetic and optimistic.  Yet even when we are miserable, we are supportive and loving. You, my friends, are what help keep me going.  We are collectively a group we did not seek to join but rejoice in the knowledge that we have \"sisters\" we can lean on, and know that we are accepted no matter what.  Unconditional Cyber-Love!!  I also was thinking this morning of all of you and thought we are \"Bosom Friends\"!!  Anyone remember \"Anne of Green Gables\"? Brenda, my heart goes out to you...I'm not the best at keeping up with everyone and so admire those of you that do.  Just know that I pray for everyone on a daily (and throughout the day) basis.  Whenever I think of you individually or as a group, I say a prayer for everyone.  I firmly believe that when we are given such an  impression, it is from God and He is giving us an opportunity to lift up our loved ones in prayer.  Hope everyone has a Blessed day!",
      "MessageIndex": 1197,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Feb 12, 2010 02:18PM Psalm121 wrote: Congratulations BrendaSharon!  So very happy for you.  You have always been such an inspiration to me, so much thoughtfulness and consideration for everyone!!!  I swear I craved stuff during chemo just like I did when I was pregnant!  Did you crave cheeseburgers?  I'm 5 weeks out from last chemo and I am really starting to feel much better this week.  Went back to work, half-days so far, but it sure is nice to be back in the world and not be in so much fear of germs and fevers, etc.  And, boy-o do those cheeseburgers really taste great now!!!  and pizza, and coffee, and chocolate, and onions, and orange juice......not necessarily in that order! I am still stiff and achy, but learned from another thread that there is such a thing as post-chemo rheumatism...?  I'm very curious about that, sounds just like what I'm experiencing.  Read somewhere else on here too that \"we may be done with chemo, but chemo is not done with us\".  Whoever said that was so right...does anyone know how long this stuff affects us? Best wishes all, I'm always thinking of you and keeping you close in my heart and in my prayers.",
      "MessageIndex": 1618,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Nov 26, 2009 07:09AM - edited Dec 3, 2009 07:08PM by Psalm121 Good early morning ladies, and a very Happy Thanksgiving! I have read all posts and have thoroughly enjoyd \"meeting\" you all!! So much helpful information and support.  I can't remember all your post names to address individually yet, just had chemo #2 yesterday and foggy-brained...couldn't sleep last nite, up going to bathroom to flush system!! My chemo is Taxotere and Cytoxan (1st tx 11-5-09, 2nd 11-25-09).  My hair started falling out on my shoulders on day 13 following 1st tx, so I cut it really close with scissors and put my wig on and out the door to plastics appt!!  No other choice, didn't want to look like the Toy Story Barbie dolls or a mangy pup!!! I laugh and I cry when I read all your posts,but mostly, I relate. It's such a relief to know I am not alone.  I had severe bone/joint pain by day 2 after 1st chemo....took percocet (left over from mastectomy-which I stopped taking after 2 days!!) pain was really bad, I, too waited too long to take pain med, Tylenol didn't touch it!! Monday, called Onc office and nurse case manager recommended taking Aleve, (every 12 hours, which helps me get through the nite, as well).  Still took Tylenol by 6th hr after Aleve, kept running low-grade fever and needed exra relief fort that.  Already on Aleve after 2nd treatment, don't want to go down that road again!!  Does anyone get hiccups??!!  Dangdest thing!!  They don't last long, but happen frequently starting treatment day and through the nite even!!  I too use homemade mouth rinse of warm water, 2 tsp baking soda, 1 tsp salt....feels really good after brushing teeth, seems to add to the clean feeling and my mouth feels better for eating afterward.  Plastic utensils are the greatest!!  Mashed potatoes with some butter is bliss!! Not to mention Carnation Instant Breakfast, Applesauce and Orange/Vanilla milkshakes!!!  My darling husband and 13 year old precious son are keeping me in good spirits with much love and support.  Oh the many blessings and the realizations of the things once took for granted!!!  No more!!  I have so much appreciation for my family and friends and their prayers.  Here's hoping all is well with you wonderful ladies....keep inspiring us newbies....I so look forward to the new posts!!  ",
      "MessageIndex": 639,
      "PostDate": "26/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Nov 29, 2009 08:24AM Psalm121 wrote: Good morning, Best wishes to all having treatments this week. I just had treatment #2 on 11-25-09 and am just now sitting in the living room. Bed was the only place to be comfortable.  Fatique was worse this time, joint pain got really bad last nite(Aleve/Tylenol didn't help) so back to the Percocet. I swear i hate taking that stuff, but my limbs were jumping from all the pain pulsing thru and I couldn't stand it.  I did have some nausea, more than last time too. Someone mentioned not being able to stand noise, thought that was just me!!  My family isn't extremely noisy at all, it's just that everything is magnified and I couldn't even tolerate the \"normal routine\" stuff.  I will have to check out the drug interaction info, hadn't even thought of my normal meds having joint pain as a side effect, thanks for the tip! After my 1st tx, I told my husband I didn't think I could do this again, then I felt better and thought, sure I can! Now, I'm back to \"2 more treatments? How can I get through it?\"  Everyone keeps telling me how strong I am, be positive, and you're half-way there.  I totally understand they're trying to help, but I feel like I've hit bottom and trying to pull myself out and that they really have no idea how I feel, because i just don't scream with the pain and awfulness of how I feel.  My #3 tx is 12-17-09 ...took me about 10 days to strengthen up after the first one....Did you wait til pain eased to walk?  I can't imagine walking to the end of my driveway right now....the bathroom is already too far away!  Thanks for all the advice and support, you have no idea how much you all have already helped me!!",
      "MessageIndex": 675,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Nov 29, 2009 01:23PM - edited Dec 3, 2009 07:06PM by Psalm121 Alicia & LindaJ; Thanks for the hugs and reassurance, tears streaming down my face.....it's such a blessing to have friends who REALLY know!!  My first thought when I got my phone call was my son and what happens if \"it's\" really bad?  He's 13, I have missed several basketball games and will definitely miss more.  I just don't have time for this...there's too much else I wanna/gotta do!! You are both absolutely right....as we say \"pull up the big girl britches\" and go on!!  Thanks for nudging me into \"offense\" mode again!!  You girls are the greatest!!  Love & Prayers,",
      "MessageIndex": 678,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 2, 2009 05:33PM Psalm121 wrote: Oh Alicia!!  I'm so sorry for you to be so scared and worried.  I have already said prayer for you and your family....and will to continue to all through the day.  My MIL is having a PET scan tomorrow.....she had lung ca in 2002 and a spot has been found on remaining (yes only 1) lung.  We are very worried as well and I can only imagine what is going thru her mind....and it's not good.  Her doctors have already told her it is a new cancer and to expect surgery.  Alicia, I am sending lots of prayers up for you, your husband and family....Shari",
      "MessageIndex": 766,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 2, 2009 09:18PM Psalm121 wrote: SharaD: All I had been taking for pain was Aleve alternating w/ex-strength Tylenol, per onc recommendation.  I hate taking the percocet, as described side effects happen. But...that pain was terribly unbearable.  I was so miserable, I couldn't stand myself.  I will check on the claritin and vitamin D with onc.  and I will go tomorrow to RiteAid and get that Biotene....thanks so much. I hate to hear you had such a scary chemo experience....scared me just reading about it.  Your Guardian Angel worked overtime on your behalf....and that wonderful son of yours, too!!  Unexcusable that they didn't tell you about pre-meds and give you prescriptions...!!!  I will be thinking of you and praying that your SEs are minimal....You have gone through so much already.My onc gave me a prescription for just FOUR Zofran, to take two/day for two days following chemo and phenegran to take as needed.  I did okay til yesterday, and i think the reason i got sick was not getting something to eat soon enough....better to eat small snacks than try to eat 3 meals/day.  Plus, as you said, drink plenty of water....I like Vitamin Water and warm cups of flavored tea....there's a lot of tea choices that smell and taste wonderful....soothing too.  I somehow seem to suffer from constipation and then diarrhea both, no matter what.    Thanks again for your help and please take care. LittleBird: I am very relieved to hear from you, as I know everyone else will be.  Soooo sorry to hear about your Father-in-law....I will continue praying for you, your husband and family.  Melinda, My husband hauls cars out of the Spring Hill, TN, plant...sometimes hauls them out of Nissan plant in Smyrna.   He took me to the Civil War Battlefield in Murfreesboro a LONG time ago...very haunting place to visit.  Murfreesboro area is beautiful....we thought about moving there years ago, then had our son and didn'nt want to move away from our families.....Loved your comment about losing the boob and hair, but keeping the period!!!  I told my sis the same thing on the way to chemo last week!!!  I was on mine when I had my 1st treatment!!  That's why the bone/joint pain snuck up on me....thought it was more PMS!!!!   Duh!!",
      "MessageIndex": 772,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 16, 2009 09:23AM Psalm121 wrote: SharaD:  You crack me up!! (sounds really 70's doesn't it, I said \"you turkey\" to my son one day and he said \"what kind of stupid 70's saying is that?) My husband had to check on me I was laughiing out loud so much!!! Chemo-breath, indeed!!  I brush my teeth and tongue so much, it's no wonder my mouth is sore...!!!  Hadn't thought of the holistic liquor treatment method but damn I sure have been wanting a beer!! Have you ever read Janet Evanovich's, Stepanie Plum bounty hunter novel series?  That's who you remind me of...she has these hilarious, random thoughts.....that's a compliment!!!  Write 'em down and publish!!!! BrendaSharon, thanks for the well wishes and warm hugs...you're a special lady and we're very fortunate to have you!!!  Didn' know Zofran causes headaches....hhmmm!! Love, Evelyn",
      "MessageIndex": 1007,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 16, 2009 05:05PM Psalm121 wrote: Hey there BWL's: sitting here waiting on the 6:00 news...I'm in KY, but I figured if there's a bald, psycho chick peeing brown spots on her ex's yard it'll make local & national news.....be like one of those connection games....I KNOW HER!!  SHE'S MY HERO!! Just wondering, too....what's the hecks a \"muggascan\"? and do I want one? Don't wanna go back & check if I got that right, I'll lose my post.  Mabelle:  I never did get another period since that Nov one....but i sure have been having hot flushes....at that homecoming game, I was worried I'd have a breakdown and more than that \"cranial prosthesis\" would come off!!  Glad I thought to layer, but I was startin' to run out of layers!!",
      "MessageIndex": 1013,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 24, 2009 12:10PM Psalm121 wrote: I may be from Kentucky, but, I've never smoked, cigarrettes or bongs filled with something special.  Having said that, far be it from me to protest what anyone else wants to try to alleviate their symptoms!!  This nausea is wearing me down, so smoke a bong, I'll eat a pickle.  Yes, a pickle!  I thought it was stupid, too, 'til I tried it after having suffered from nausea all day yesterday.  Guess some \"old wives' tales\" have some truth to them, after all.  Or maybe relief is in the mind of the believer? Re: Hair, or the lack thereof:  I have noticed that I no longer have to pluck that one aggravating little hair that kept coming up on my chin!!!  Momma never told me about that little side-effect of the 40's!!!  But, I sure don't miss shaving, ANYWHERE!!  May even see one of those laser specialists when I'm all reconstructed and a totally hot babe!!! Anyway, you Beautiful Warrior Ladies all have safe trips in visiting the Ins and Out-laws, Love in Abundance, Bountiful Joy, and a Blessed Christmas!! \"I will lift up mine eyes unto the hills; From whence cometh my Help; My Help cometh from the Lord; which made Heaven and Earth\"  Psalm 121",
      "MessageIndex": 1095,
      "PostDate": "24/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 30, 2009 09:02PM Psalm121 wrote: Great News!  My MIL had successful surgery, surgeon was able to get all of ca in lung and margins are clear.  She is on a ventilator for a while, DH hasn't got to see her yet, but surgeon was very pleased with how well she did.  Thanks so much, Warrior Friends, for the prayers and support.  You ladies have all had a rough few days!!  I pray that everyone has a good night's rest and feels muuuuch better tomorrow.  I am exhausted from the day of waiting for news....off to bed myself. ",
      "MessageIndex": 1152,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jan 5, 2010 02:23PM Psalm121 wrote: Michele, So sorry you're in so much pain...I don't have Neupogen/Neulasta shots, but I tried the Claritin for bone/joint pain....didn't help.  It has helped watery eyes...some.  My right eye is constantly watery and still has that aggravating nerve twitch.  I'm two days away from chemo and am so dreading the days afterward, I know what to expect and it makes me want to cry.",
      "MessageIndex": 1199,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 3, 2009 06:26PM Psalm121 wrote: BrendaSharon: Thanks so much for your thoughtfulnes....My MIL had PET scan because chest x-ray found new spot, PET scan results today showed that spot as well, but no new ones anywhere else.  She also has a stomach ulcer.  Her lung doctor is looking for a surgeon for her that can perform surgery by deflating only part of her lung, to remove the ca.  Just one lung, she will die, if her lung collapses.  If they can't do surgery she will definitely be getting radiation and chemo. She's 70 and actually a strong woman, but this is scaring her because she's been there, done that and dreads the whole thing.  Yes, please pray for her, my DH, son and FIL.  My heart breaks for her...they won't do surgery til after the 1st of the year, so I'm hoping to be on the mend myself by then and be able to help her. I pray daily for the the Brave Warrior Sisters and their families who support them.  Without my Husband, son, Mom, my sister, nieces, In-Laws, co-workers, and friends I do NOT think I would be able to do this.  They uplift us, comfort us, endure with us....and I thank GOD for them all.  I am very blessed and continue to pray for many blessings for all of you!!  May you all have healing rest and renewed spirits....!!!",
      "MessageIndex": 781,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Nov 30, 2009 05:09PM Psalm121 wrote: LVLinda & Alicia, Been thinking of you both today...hope all goes well in the coming days with comfort aplenty and minimal SEs! Also, notice all week is scheduled full for other Warrior Ladies---cka0706, mouse6694, doronet,lindaj, boxersue,coolbreeze,sharad,menevermind,deedee22, aronimia,redheadpam, reglau, and shelshel.......lots of wonderful warriors with lots of prayers going your way!!  LittleBird My heart aches for you, but I know your spirit is strong...your poetry speaks from your heart to all of us who have the utmost appreciation for you encouraging us!!  I have just now checked in, rough day....that little \"faerie\" you all speak so fondly of!! Hoping the queasiness, etc...settles down and I can continue on the upside from here.  Although, now that I think about it, I'm starting to feel a little chill....guess I'll go get the Tylenol.  Take care all & good night",
      "MessageIndex": 707,
      "PostDate": "30/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 8, 2009 10:12AM Psalm121 wrote: Melinda, It seems we have so much to deal with....and then we get more!!! My mom was so over-whelmed when I was first diagnosed, I know I explained the same thing to her 5 times!! She totally couldn't understand why I did the mastectomy rather than lumpectomy.. save the boob, yes, but then have radiation for 6 weeks/5 days a week.....didn't want to do that!!  I'm sorry you're having to worry so much about others....it's amazing that we find ourselves comforting people on a regular basis, isn't it? I have a 2 yr old niece that I am afraid to let see me in my baldness!!  Now I am encouraged, I forget sometimes how resilient and accepting children are!! Your little one is having fun with hat dress-up and easing your mind at the same time....thank God for the little ones!!! ",
      "MessageIndex": 844,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 22, 2009 06:32PM Psalm121 wrote: Hello Beautiful Warrior Ladies, Not feeling so beautiful myself actually, but I'm here, Thank God.  Welcome, MERI:  these ladies are wonderful, as I'm sure you have realized.  A great little (widespread!) community with support, laughter and sisterhood.  You're scheduled for your 3rd treatment on the 31st, right?  I just had my third on 12-17 and 4th and final is scheduled for Jan 7th.  Can NOT wait to get this over with!  This treatment really rough on me, I am just now able to make it to the living room and hang out with hubby and son.  I had rt mastectomy with tissue expander and hopefully won't have to have radiation...it was not supposed to be a possibility, anyway.  I had not researched radiation/expander issues, so not able to help with any info there.  I am having terrible fatigue though and know I should be trying to strengthen myself, but just taking a shower wears me out.  I do have some hand weights now and will be using them while watching TV, walking around the house.  Every little bit helps, right?  I have this one little, soft hat that I wear all the time when I'm home.  It's warm and not tight on my head so I can even sleep in it.  I'm like Linus and his blankie, waiting on it to get clean and dry so I can put it back on again!!  I got two other hats, but they're too tight and hurt my head, so I don't even try to wear them anymore.  My wig is only for going out, or if  company other than family is coming by.  If I'm home alone, I just don't wear anything...just my preference, nobody minds seeing me hatless, I just feel better covered when the guys are home.  I hadn't tried any scarves or anything, just easier to pop a hat on....don't feel like I'm patient enough for a scarf to be tied.  You and I are on the same chemo regimen, too.  Do you have bone/joint pain or anything?  So far, my weight stays about the same....I may gain with the steroids and fluids, but then the few days of not eating well and feeling yucky it goes back down.  I guess now is really not the time to try and lose weight, but making healthy choices is not easily done either.  Sometimes I have a milkshake for breakfast!  You know that soup commercial that says \"I love the taste of taste!\" That's how I feel right now....nothing tastes good and just eating a little and trying to drink plenty fluids is such an effort.  I miss being able to eat and enjoy food....this taste in my mouth makes my stomach sick.  Well, now that I've rambled on, please check back in & let us know more about you!!  Take Care",
      "MessageIndex": 1066,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 23, 2009 08:36AM Psalm121 wrote: Hey Michele, So sorry you're feeling so bad.  I'm on  Taxotere/Cytoxan and get severe joint pain.  I have to take hydrocodone for a few days and can then taper off to extra-strength Tylenol.  Have your doctor call something in, there is absolutely no reason to suffer.  I also asked for something to help me sleep this time....never had to do that before.  I don't have stairs, bless your heart, I can't imagine having to tackle stairs with such awful pain.  All I can do is shuffle when I do move around.  For some reason my pain is hips down to feet.  I've also found a heating pad on my knees helps.  I sure do hope you get some relief soon!  Hugs & Prayers",
      "MessageIndex": 1071,
      "PostDate": "23/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jan 16, 2010 07:52AM Psalm121 wrote: Good Morning, Ladies! Oh, Toyah!!!  Glad for your news, sorry you had to worry!  And Alicia, so happy your hubby's results are good! I'm praying for continued good news, as well! Nette, Your posting could have been written by me!  I freeze all day and then when I go to bed and try to sleep, all I do is alternate between shivering and sweating.  I first thought hot flashes, but now, I swear, it's more like spontaneous combustion.....meltdown!!  Guess what?  Oh, yeah....uh huh.....I'M DONE!!!!!  And I ain't going nowhere!!  I want to stick around and see all the Warrior Sisters HEAL & THRIVE!!!  TX #4 was absolutely the worst, the joint pain started before I could even get home...I am finally starting to feel better, but it is just scary how fast my body has lost strength and stamina.  I get so tired just doing little things.  So, now I'm on a mission to strengthen myself. I see PS on Jan 20th, tissue expander still not completely full, but maybe two more fills is all.  Now I've got a lot of things to learn about implants, etc.  There is a really good forum called EXCHANGE CITY & a new one, I think it's RECONSTRUCTION 101, for those of you looking forward to reconstructions.  Lots of good information. I'm actually going to get out of the house today....some therapeutic shopping!!  HAPPY DANCE!!!",
      "MessageIndex": 1330,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Nov 26, 2009 08:37AM - edited Dec 3, 2009 07:44PM by Psalm121",
      "MessageIndex": 23,
      "PostDate": "26/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/741584",
      "Title": "\"its not good news\" littlebird75 badger"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 6, 2012 10:04AM Psalm121 wrote: Sandilee, I just went to my family doctor on Monday & was diagnosed with Costochondritis (inflammation of the cartilage that connects a rib to the breastbone).  I have to admit, I was scared when I went to doctor and was somewhat relieved but I still have this nagging feeling that theres more going on.  I was given a steroid shot and a course of oral predinisone, also labs were drawn to check CBC & calcium levels.  Pain has lessened, but still feel achy tenderness.  This is on my non-mastectomy side.  Pain was severe.  I kept a pillow against my side, strangely enough, pressure helped somehow.  Like you, I have (had) been exercising hard.  My next visit with Onc is June 26th and am wondering if I should call now or just wait til then?  Labs should be back by Friday, June 7th.  Thank you so much for lending an ear to us who need someone so desperately!  My husband thinks I'm worrying too much, but if I hadn't been so persistent pre-diagnosis, well it's just untelling how long it would have been til I found out.   ",
      "MessageIndex": 435,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Dec 21, 2009 06:04PM Psalm121 wrote: diagnosed at 44 then turned 45 two months later.  I had extremely dense breast tissue, regular mammograms since age 40, no family hx. No lump, had burning right breast pain and really prominent veinous pattern, since annual mammogram was 6 months earlier, had diagnostic mammogram/ultrasound.  Mammogram did NOT show abnormality. US would have if technician had done whole breast US, would only do targeted US.  Radiologist recommended \"MRI if breast pain persists\".  Primary Doctor then scheduled Breast MRI, which saved my LIFE!    Women need whole-breast ultrasounds done in addition to other diagnostic imaging, especially for dense breast tissue that younger women have.  My tumor was marked with a clip after biopsy and it still did not show up on diagnostic mammogram, there was the clip, though.",
      "MessageIndex": 353,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 11, 2012 03:09PM Psalm121 wrote: ElaineD: I'm curious as to the \"tickle\" under your ribs...would you care to tell me more?  Did you have pain as well?  What did this symptom indicate to your gastroenterologist?  Did he refer you back to oncologist with this symptom?  I've been having \"twinges\" in left rib area just below breast (non-mastectomy side).  Thanks!",
      "MessageIndex": 464,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 15, 2012 11:43PM Psalm121 wrote: Hello Mazy, It's frightening that an onc would be so ignorant, he should be investigated and lose his license. Thankfully you were persistent & went to a new one. With your recent Dx, did you have fatigue? We who are looking for answers to our complaints /symptoms learn so much when y'all share your stories & paths to Dx, thank you...",
      "MessageIndex": 474,
      "PostDate": "15/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 16, 2012 04:55AM Psalm121 wrote: Hello friends.... I've been scheduled for a bone scan on June 25th....Thx for the concern & advice....it validates our intuitions when you are so supportive & forthcoming with your own experiences. Never underestimate the powerful impact you have!",
      "MessageIndex": 475,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 18, 2012 03:21PM Psalm121 wrote: Thanks Mazy for your reply. A friend of mine that was dxed Oct 2010 w/ triple negative IDC had the \"you need to walk/exercise more, get physical therapy for that shoulder pain\" speech from her onc who is also my onc, she went to another facility entirely & has learned she has bone/liver metastases. I was honestly surprised when he set up my bone scan so quickly with my just one phone call. Do the oncs base the possibility of scans/tests on what our level of complaints are? Did I say something in my symptoms that sent up a red flag to him? What is the deciding factor on us getting further tests scheduled or just being \"reassured\" ? This is overwhelming",
      "MessageIndex": 494,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 19, 2012 02:04PM Psalm121 wrote: Mazy ~ you're so right, I've been worried about seeming paranoid or obsessive & shouldn't be letting those doubts creep in. If I hadn't been so persistent about symptoms with my original diagnosis it's untelling how long it would have gone undetected. I had no lump & \"normal\" mammogram...my symptom was pain. You said you were \"more tired than usual\", do you mean always tired or that you became tired more easily. I just feel exhausted, even first thing in the morning. I háve to rest all throughout the day after any little exertion that 3 weeks ago was not even an issue. I had been exercising & doing great. Thank you for your guidance & understanding....",
      "MessageIndex": 503,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 7, 2012 01:39AM Psalm121 wrote: Hello Chrissy... could you please read my previous post? Am anxiously awaiting your thoughts on my situation. Had replied to Sandilee, with no response yet. Thanks for all your time & consideration",
      "MessageIndex": 441,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 6, 2012 10:20AM Psalm121 wrote: hello mmizerak, what did your doctors say about your rib pain?  I hear you on the not wanting to call about every new ache or twinge, I'm the same way even after everything I've been through.  My pain was front side of rib all the way around to my back....very fatigued, which I hadn't been experiencing since starting my exercise regimen. ",
      "MessageIndex": 436,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 7, 2012 09:21AM Psalm121 wrote: aahh, Chrissy, I understand what you're saying now.  I'm always learning new things and appreciate your input.  My labs should be ready for me to pick up tomorrow.  I plan on taking them with me to Onc appt on June 26th, unless they are abnormal and will then request PCP to fax reports.  As far as pain meds, all I have is OTC and it's just not helping.  Thanks again....you and the ladies who help us on this thread are invaluable! ",
      "MessageIndex": 445,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 16, 2012 04:56AM - edited Jun 16, 2012 04:57AM by Psalm121",
      "MessageIndex": 476,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 20, 2012 04:38AM Psalm121 wrote: Well exbrnxgrl~now I'm curious! If you don't mind sharing, what is your \"accidental bone mets discovery\" experience? I appreciate your willingness to help those of us who are worried & doubting ourselves.",
      "MessageIndex": 511,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 26, 2012 07:39AM Psalm121 wrote: srbl62 ~ I had a bone scan today too & had several bright spots....arm, hips. Can't get those images out of my mind & I'm worried too, very. Hold hands tight....here we go....",
      "MessageIndex": 525,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 27, 2012 11:29PM Psalm121 wrote: Hello Friends ~ Received good news yesterday....bone scan was good, no new issues.  Pain is attributed to scoliosis and overdoing it with housework and exercise.  Probably I should not move furniture when I'm cleaning house  I have to exercise though and was happy that I impressed my Onc nurse with my 6 lb. weight loss.  Had left breast mammogram yesterday, which led to an ultrasound and US-guided core biopsy.  Fingers crossed...should know results by the end of this week.  Thanks for any prayers and support, I can definitely use them! ",
      "MessageIndex": 532,
      "PostDate": "27/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 20, 2012 02:25AM Psalm121 wrote: Chrissy, I'm with Stormy....thanks so much for your dedication & calming reassurances! Chef~ (((hugs))) & know we're all thinking of you & praying for negative nodes",
      "MessageIndex": 509,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 20, 2012 08:21AM Psalm121 wrote: Wow Caryn!! What an experience! I do believe everything happens for a reason & you are an amazing example of that! You are a remarkable testimony to how fragile our lives/futures are & the impact of our decisions. Here's to a wonderful California summer vaca! :)",
      "MessageIndex": 513,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 7, 2012 06:52AM Psalm121 wrote: Hi Chrissy...my PCP did not order scans & haven't learned results of labs yet. So, my rib pain is on non~mastectomy side, what's up with that? & it's getting worse again....still on oral pack of prednisone. I am exhauusted, took a nap yesterday & slept maybe 5 hours last night before pain woke me up. It feels like a deep bruise & heavy, which sounds weird even as I type it but there it is. Thanks Chrissy, you are so sweet....love & hugs to you",
      "MessageIndex": 443,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 8, 2012 10:29PM Psalm121 wrote: Chrissy & ma111: thanks for the posts & concern for me, appreciate it much! Good news:  Labs are normal!  Pain is better, so maybe the steroids are finally helping.  I'll be taking a copy of my labs to Onc for his review. Hadn't heard of the \"Pink Ribbon, Inc.\" movie.  I do have some pink shirts/items that I picked out myself, but sometimes it's a little overwhelming to constantly get pink stuff as gifts! I think our friends identify their love and concern with those symbols and use it as a way of support for us.  My personal favorite shirts are the \"Life is Good\" brand.  I ran across these after diagnosis & before surgery, when I was looking for comfy post-surgery clothes.  I considered finding those shirts as a gentle tap on the shoulder from God to remind me to always be happy, be thankful and remember Life IS Good!  A movie I recommend is \"One for the Money\" based on series of books by Janet Evanovich.  I read them during chemo.  They are hilarious, racy, sexy....whew!  May have to re-read them ;)",
      "MessageIndex": 452,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 12, 2012 08:01AM Psalm121 wrote: Thank you ElaineD, for sharing your experience. I see my Onc on June 26th & have several concerns to discuss with him. My last chest x-ray was pre- surgery in 2009 also had bone scan & that's it. Chest x-ray showed old infection scarring & bone scan showed scoliosis, neither of which I had ever been aware of. Thanks again for your reply & advice",
      "MessageIndex": 467,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Jun 19, 2012 02:14PM Psalm121 wrote: Mazy ~ also meant to mention I've had this sensation of something crawling on my shin bone....nothing is of course but it feels really strange. Ever heard of this kind of symptom? !",
      "MessageIndex": 504,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Nov 11, 2009 03:54PM Psalm121 wrote: RBurton, thank you so much for looking out for us as well as your very wonderful wife!!  I just had my first chemo (cytoxan/taxotere) on 11-5-09 and by Saturday I had severe joint pain!!  The pain was so intense I could barely stand pressure on my bones even while resting.  Thanks for the tip.  My onc/nurse recommended alternating Ex-strength Tylenol and Alleve.  I did this after having taken percocet for two days, which I hated doing but could not endure the pain.  The Tylenol/Alleve has helped....no more pain and no terrible side effects.  Interestingly, I too had to fight to get my concerns/symptoms addressed.  I did not have a lump..only right breast pain and prominent veins. My GYN was not concerned and stated that I did not have an abnormal breast exam, which I did not agree with and proceeded to my family MD, who ordered diagnostic imaging.  I had just had annual mam in Dec 08, which was neg, but I have extremely dense breast tissue.  The diagnostic mam/US in June showed no abnormalities but the radiologist recommended I have a breast MRI if pain persisted.  That MRI saved my life!!  MRI led to core needle bx on 7-27-09 and diagnosed on 7-29-09 with IDC.  My rt mastectomy was on 9-15-09 with expander reconstruction....I turned 45 yrs old seventeen days later.  Everyone needs to be aware of their own bodies and symptoms and be prepared to move on to another doctor when the 1st one doesn't listen.  thanks, again....I'm praying for all the best for you and your wife.",
      "MessageIndex": 1,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/743689",
      "Title": "Side effects: Muscle and Joint Pain, Watery irritated eyes. RBurton RBurton"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Nov 19, 2009 06:45AM - edited Dec 3, 2009 05:46PM by Psalm121",
      "MessageIndex": 1,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744175",
      "Title": "Where to start? sparkyhammerjigsaw CinD"
    },
    {
      "AuthorID": "Psalm121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92328/profile",
      "Content": "Nov 25, 2009 03:38AM - edited Dec 3, 2009 07:53PM by Psalm121 cac100: I had rt mastectomy with nipple sparing on 9-15-09, my tumor was in lower outer quadrant of breast...during surgery skin under nipple was thoroughly scraped and sent to pathology as well (no cancer there).  I also opted for immediate reconstruction with tissue expander....of course I was not immediately symmetrical, but i can envision the outcome and am getting \"fuller\" with each saline fill-up!!!  I joke with my husband about getting air in my tire!!  My mastectomy incision goes under the natural curve of my breast, where an underwire of your bra would rest, and continues up a little toward my underarm.  Not a bad looking incision at all, healing very well.  I may not have sensation but it was important to me to keep my nipple.  You will do what is best for you and when you make your decision and are at peace (can rest at night!!) you'll know you are on the right track.  Everyone is different, everyones comfort zone is different.  I also opted for chemotherapy (4 doses, 3 weeks apart).  I just could not feel comforable NOT doing chemo.  I am only 45 years old and no chemo gave me a recurrence rate of 11% in ten years....was NOT comforable with that statistic.....recurrence? how bad? where? My son in 13 and I want to be here for a long, long time!!  My husband was very supportive and has stood by me 100%!  I am awake tonite because I have chemo#2 tomorrow and my decadron is keeping me from settling down.  My sister is driving me, so maybe a nap on the way?!  I go to a Comprehensive Breast Center, where Breast Surgeon and Oncologist are together.  They also consult with my plastics dr.  Research the different types of surgeries, reconstuctions, chemo, radiations, etc,. before seeing drs.  and write down any questions.  Oh, also if I had done a lumpectomy, I would also have had to do radiation for 6 weeks, 5 days a week, AFTER chemo regimen....so, that played into my decision. My heart goes out to you and I am praying for you that all goes well, whatever you decide, please keep me posted.  and if I've left out anything, please ask....hope to hear from you soon. ",
      "MessageIndex": 2,
      "PostDate": "25/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/744489",
      "Title": "question about nipple sparing mastectomy cl00 LISAMG"
    }
  ]
}