{
  "AuthorID": "Psal70",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129160/profile",
  "Posts": [
    {
      "AuthorID": "Psal70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129160/profile",
      "Content": "Aug 17, 2011 10:00AM Psal70 wrote: NWMom, I am sorry you have to go through this but believe me you will get through it. IF your team recommends radiation then do it and yes teh benefit outweighs what might ot might not happen in the future. I had a MX, chemo and radiation and I said yes to all the treatments they offered me, eventhough my PS said that radiation will damage my skin and the reconstruction results would probably fail but at the end it all worked out for me. Good luck with your decision",
      "MessageIndex": 11,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773149",
      "Title": "To choose radiation therapy or not having one NWMom MarieKelly"
    },
    {
      "AuthorID": "Psal70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129160/profile",
      "Content": "Sep 1, 2011 09:26PM Psal70 wrote: Hi Sandy and I am sorry you have to go through this-but it will pass. You will definitely learn more when you meet with your doctors, it is good that you had all the scans negative ( i had to do PetScan and CTscan not an xray), they will know more about lymph nodes involvement during the surgery and after the pathology report comes out (they do more testing during surgery). I also think they will know the exact staging during that time. But at this moment you can get an idea of what type of treatment you are going to get, whether it is hormone receptor positive or negative or HER2 + or -........... Good luck with your appointments and keep the faith Patricia ",
      "MessageIndex": 1,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774047",
      "Title": "MRI Question SStayton Psal70"
    },
    {
      "AuthorID": "Psal70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129160/profile",
      "Content": "Jul 10, 2011 11:30PM Psal70 wrote: Cm3317 , I am sorry that your mum has to go through this. If it is in the lymph nodes it does not necessarily mean that it is a stage III but also you will find out more after the surgery because during the surgery they do more testing and once you get the pathology report things will become clearer about the staging and the treatment. Please keep in mind that some people have stage IV and they sometimes beat this horrible disease so please don't let the staging scare you or your mother. Good luck",
      "MessageIndex": 1,
      "PostDate": "10/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771447",
      "Title": "My mum has breast cancer Cm3317 BarbaraA"
    },
    {
      "AuthorID": "Psal70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129160/profile",
      "Content": "Jul 11, 2011 04:50PM Psal70 wrote: CM-The results should come back faster than that, I am not sure where you are located, but the results usually come out fast. And if the surgery is in 17 days thats not too far, I waited over a month from diagnosis til my surgery and the doctor's said it was ok because I was getting anxious to get that monster out. Try not to get anxious before you get all the answers.",
      "MessageIndex": 4,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771447",
      "Title": "My mum has breast cancer Cm3317 BarbaraA"
    },
    {
      "AuthorID": "Psal70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129160/profile",
      "Content": "May 25, 2011 12:11AM Psal70 wrote: Yes that is correct , I had asked my onco as well and it is ok to use Botox and facial fillers, so Anniealso go for it if it makes you feel better :)",
      "MessageIndex": 3,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/761134",
      "Title": "Radiesse Injections Lay02 raincitygirl"
    },
    {
      "AuthorID": "Psal70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129160/profile",
      "Content": "Jul 14, 2011 08:40PM Psal70 wrote: Motheroftwins- sorry you have to go through this but believe me it will get better. First it is a shock and in a few months when you are done with your treatments it will be a distant memory, a bump in the road. Goodluck",
      "MessageIndex": 26,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    },
    {
      "AuthorID": "Psal70",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129160/profile",
      "Content": "Jul 16, 2011 11:58PM Psal70 wrote: Justina - you probably won't need radiation since you only have 2 positive nodes, but different hospitals have different protocols. They pretty much know what treatment you need after the biopsy but they find out more after the surgery and pathology report. I pretty much knew before surgery my treatment plan and nothing changed after my surgery, maybe because they knew I was HER2+ and was 39 so I had an aggressive treatment.so your MO will definitely discuss treatment at that visit. Good luck",
      "MessageIndex": 4,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771718",
      "Title": "FIrst visit to MO Justina Psal70"
    }
  ]
}