{
  "AuthorID": "psalmist",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69134/profile",
  "Posts": [
    {
      "AuthorID": "psalmist",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69134/profile",
      "Content": "Sep 11, 2008 12:17PM psalmist wrote: Tweeker, I am in reconstruction after undergoing bilateral prophylactic mastectomy July 10th.  My initial dx three years ago was LCIS in left breast.  I also had dense breast tissue, multiple biopsies, family history (mom, aunt), microcalcifications, and fibrocystic disease.   Never underwent genetic testing.  I just got tired of the constant mammos, follow ups, and the Tamoxifen was too much for me.   SO, I opted for BPM.  And boy, I'm glad I did.  The doctor called a week post op to say they found ductal hyperplasia in the right breast and then called back thirty minutes later to say the lab had just informed him there was a small cancer also in the right breast.  I feel I dodged a bullet, as nothing had shown up on a mammo in May.  We could have gone merrily along not knowing.  I had to go in the following week for a lymph dissection, which was zero involvement for all 16 nodes taken.  No diffiulties associated with lymphedema, although I am careful.  This is not to suggest that my story has to be repeated in anyone else's life, but I just wanted you to know that for me the peace of mind has been worth the pain and discomfort (and believe me, the recon process has been most uncomfortable).  My PS told me before surgery to \"remember why you are doing this.  If you have complications, you must remember that you are avoiding cancer...\"  My oncologist had told me before surgery that close observation is fine...\"as long as the horse stays in the barn.\"  The same oncologist told me last month (after my surgery) that my risk of dying from BC is about 1 percent and I don't need anymore mammograms.  I am not on any follow up regimen except a breast MRI every few years.   I think most importantly, you need to follow your gut -- that \"still small voice\" inside of you.  If you feel peace about your decision, whatever it is, go for it.",
      "MessageIndex": 36,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706536",
      "Title": "prophylactic mastectomy-your input wanted tweekerbeeker lilith"
    },
    {
      "AuthorID": "psalmist",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69134/profile",
      "Content": "Sep 15, 2008 07:42AM psalmist wrote: Lilith - Good reminder about our \"other bits.\"  I haven't been tested for BRCA2, but I had a 2 lb. durmoid cyst removed from an ovary about 8 years ago (benign).  Still wondering what might be growing in there...",
      "MessageIndex": 38,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706536",
      "Title": "prophylactic mastectomy-your input wanted tweekerbeeker lilith"
    },
    {
      "AuthorID": "psalmist",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69134/profile",
      "Content": "Sep 14, 2008 02:37PM psalmist wrote: MsVirgo - Your story is one of courage under fire.  You have my admiration and respect!  How awesome of you to walk in the Susan G Komen race; I sponsored a coworker for that race.  Wishing you a good report and God's TLC in the meantime.  Blessings -- I am cheering for you.",
      "MessageIndex": 78,
      "PostDate": "14/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705266",
      "Title": "Here I Go Again? msvirgo828 redheadace1"
    }
  ]
}