{
  "AuthorID": "pshurtz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77992/profile",
  "Posts": [
    {
      "AuthorID": "pshurtz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77992/profile",
      "Content": "Feb 2, 2011 11:03AM pshurtz wrote: It's so tough living with the sword of damacles dangling over your head...and its hard to ignore it because most of us are left with the evidence of CA--imperfect/uncomfortable reconstructions, lymphadema, side effects of the meds---Geez its enuf to make you Insane!!!! In my case, as is probably true with most 50 somethings--when they do the screens they find evidence of other stuff-cervical polyp (it was nada--but we have to keep checking it every 6 months) sarcoidosis ( did all the tests 2x--every 6 months--and have a 3 inch scar on my throat so they could figure out why the nodes were enlarged--then I said what the hell--its asymptomatic--and I will follow up with it if I seem to have any issues....so at 3.5 years out (YAY) at stage 3--Im trying to minimize the screens and extra stuff.  I know you cant mentally ignore this...and your spots would have been unsettling to me too...but,seems your choices are 1) get a second opinion to reassure yourself that waiting makes sense or 2) learn to live with this extra uncertainty. Honestly, do you know anyone that walks away from a stage 3 CA diagnosis and who has had 1) surgeries 2) radiation 3) chemo & 4) takes AI's and bone strengtheners that ever looks or feels the same or better than the week before they got their awful diagnosis? Im not the same person and I will never be--just as, at 56, I cant wear the string bikini that I wore when I was 20! That being said--you have to do the best you can to keep a positive mental attitude and frankly, ignore it all--or as much as possible!!  Denial can be Good--as long as you arent denying real objective symptoms of illness. Live your life. 3 plus years into this--I still read as much as I can and follow the treatments--have cut way down on the supplements (the science just isnt there--yet,sigh) Eat healthy and have incorporated exercise into my life with the goal of lowering my BMI.  Susan Love says lower BMI and regular exercise is one of the most important things I can do to prevent met--and I believe her!!!!  Im wishing you the best... patricia ",
      "MessageIndex": 3,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764046",
      "Title": "My Big Pink Elephant Arayasunshine69 pshurtz"
    },
    {
      "AuthorID": "pshurtz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77992/profile",
      "Content": "Jan 18, 2009 05:17PM pshurtz wrote: HI- In September of 2007, I was diagnosed with stage III-A estrogen positive breast cancer (4 of 20 nodes positive). I elected an immediate mastectomy and reconstruction, which was largely uneventful ( if having stage 3 breast cancer can ever be considered UNEVENTFUL...lol) While going through 6 every three week chemo treatments with your standard ACT, I did bi-weekly fills for the reconstruction.  Honestly, the worst of it all was being bald--looking like Curly from the 3 stooges was NOT by intended fashion statement! Oh and the HOT FLASHES-- how could I forget these--must be a demonstration of chemo brain. Anyhow-Refills caused minor pain for a couple of days immediately following fill treatment-but nothing serious-way doable without pain med.  Following chemo, I did 6 weeks and BOOST of radiation treatment.  I had no immediate side effects-save sun burned like skin and the reoccurring irritability of having to traipse my butt to the hospital every day. So, for me, and hopefully for you, fatigue was not an issue.  A couple of months after completing radiation, I had a mamogram which, quelle horreur, revealed that I had DCIS in my other breast.  On November 25, 2008, I elected to have another mastectomy and reconstruction of my right breast. (STAGE ZERO--the perfect path report--the one I wished I had gotten a year earlier...)  Approximately 2 weeks after my surgery, I developed lymphadeema in my left arm and breast tightness in my radiated area--a tightness which seems progressive but has remained constant for the last week of so--some shortness of breathe and reoccuring numbness in my hand and fingers.  I will be seeing a rehab person in a couple of weeks. I dont want to scare you--but I am finding that, for me, the radiation wasnt the problem- its the potential long term effects of it...the chest tightness is way unpleasant..so far it hasnt effected visually the implant-ready breast--which I cant get until about 6 months from now. I decided to proceed initially in this way--cause Im no fan of surgery and thought the tram flap route was just too invasive. best wishes to all- patricia ",
      "MessageIndex": 22,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/724718",
      "Title": "Chest Wall Radiation and Reconstruction ninel 55andstillalive"
    }
  ]
}