{
  "AuthorID": "pstamant",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183716/profile",
  "Posts": [
    {
      "AuthorID": "pstamant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183716/profile",
      "Content": "pstamant wrote: Had my first cycle on Tuesday, did well until ache and bone pain started on Thursday. Taking nausea drugs and they are working fine. Using tylenol to deal with body pain but not working as well. Had to resort to the pain meds to get some sleep. Hoping this will pass in a day or so. Trying to do a little each day so I don't get too bogged down. Would certainly welcome some company Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/807281",
      "Title": "Started TC 7.2.2013. Anyone starting now? pstamant pstamant"
    },
    {
      "AuthorID": "pstamant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183716/profile",
      "Content": "Jul 6, 2013 10:23PM pstamant wrote: Hello Goldenbetty, You are so right, we are strong! I'll be cutting my hair next week as well. I already have two fun wigs and I'm looking forward to using them. Everyday is a little adventure! Some good, some not so much fun. But heck, there are so many people who have already done so much more and accomplished so much, I feel like I've got an easier time of it. Thanks for letting me join you on your journey. I'm here any time.",
      "MessageIndex": 2,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/807281",
      "Title": "Started TC 7.2.2013. Anyone starting now? pstamant pstamant"
    },
    {
      "AuthorID": "pstamant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183716/profile",
      "Content": "Jul 7, 2013 03:54AM pstamant wrote: I love my port as well. I've had only one treatment, but it was so easy. I do adjust my seatbelt some days, but mostly it is just fine, and I have no problem with my bras, the straps are outside the port area. I am so glad I had this installed, so convenient.",
      "MessageIndex": 128,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "pstamant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183716/profile",
      "Content": "Jul 7, 2013 03:37AM pstamant wrote: Hi Millie, had my first treatment on 7.2.2013. TC for 6 cycles every three weeks because of heart concern. All went well, no nausea, but I'm taking the medications cuz it works! By Thursday I started getting lots of aches and bone pain, and headache. I've been trying tylenol extra strength but it isn't always working. Had to use pain meds to get sleep. I'll be cutting my hair this next week. I've got two cute wigs to have some fun with, and I'm looking at scarves and hats as well. Got to have some fun, right!",
      "MessageIndex": 127,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    }
  ]
}