{
  "AuthorID": "Psyche",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38085/profile",
  "Posts": [
    {
      "AuthorID": "Psyche",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38085/profile",
      "Content": "May 5, 2008 10:36PM Psyche wrote: Dion, When my bc was diagnosed, the doctors looked at the mammogram and declared that it was classic cancer. They were absolutely certain of it. When the surgeon came out to talk to my friend while I lay in recovery after the lumpectomy, he stated that I had a 50/50 chance of it being benign. (In my case it wasn't benign though) Let me stress to you that they cannot be certain until they have a biopsy. ",
      "MessageIndex": 12,
      "PostDate": "05/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/704600",
      "Title": "Scared out of my mind. DionM sandi-louise"
    },
    {
      "AuthorID": "Psyche",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38085/profile",
      "Content": "May 6, 2008 05:47AM Psyche wrote: You are very young and young breasts often develop lumps and go through changes. See a doctor right away to give you peace of mind and hang here with us who can give you encouragement and great advice. It is very UNLIKELY that you have breast cancer.  Do you have someone to go with you to the doctor?",
      "MessageIndex": 1,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/705096",
      "Title": "maybe, possibly, i pray not Roxi_ray Marple"
    },
    {
      "AuthorID": "Psyche",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38085/profile",
      "Content": "May 6, 2008 05:42AM Psyche wrote: Allow me to also quote Nietzshe and say, \"That which does not kill us makes us stronger.\"  We are some very strong folks here. There are local organizations that will match you with a mentor who has been through a similar experience if that is what you prefer.  However, we are always here in cyberspace to offer love, prayers, and support.",
      "MessageIndex": 3,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705092",
      "Title": "I'm tired charenm MariaC"
    }
  ]
}