{
  "AuthorID": "pteney",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
  "Posts": [
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Jun 17, 2011 05:44PM pteney wrote: Hi Pam, I don't know what made me try it, but one day after my hair finally was long enough, I put on some of the aloe gel i used during radiation on my hair (i get it at Walmart, by Fruit of the Earth in a clear bottle w/blue pump on it).  I kind of scrunch it in and it turns that straight, frizzy white hair into a nice funky wavy kinda look.  It looked 100% different and I was ecstatic.  I've never been happier with my hair since I finally stopped worrying about color and length.  In fact, I had a recurrence and so love the way my gal cuts my hair since it came back and again with the gel, i've never had so many peeps like the color and style!  btw, I too had IBC and reached NED for a long time until my mets.  Take care! Patti ",
      "MessageIndex": 26,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770176",
      "Title": "NOW I'm vain about my hair. anonymice anonymice"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Aug 6, 2016 11:59AM pteney wrote: Patti from Canada - dx 2004, stage 4 since 2010 hugs to all of us hanging in there! 😍",
      "MessageIndex": 170,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Jan 11, 2013 10:30AM pteney wrote: Hi gals, there is one place (tho not it's own official sticky) for all these questions:  Under the Stage lV topics, second one called: Important Stage lV Threads for Stage lV Newbies ... then see the thread called \"Five Questions\" interviews with Stage lV members ... the one where all the links to the Five Questions people that Coolbreeze started.  Hope that helps.  Hugs from Canada, Patti",
      "MessageIndex": 66,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793384",
      "Title": "Five Questions - clairejslm CoolBreeze exbrnxgrl"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Apr 8, 2013 04:40PM - edited Apr 8, 2013 04:41PM by pteney 37 hugs from Canada, Patti",
      "MessageIndex": 39,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Jul 16, 2012 03:09PM pteney wrote: Hi Ann, I am kicking myself that I missed your show again last week - totally forgot and am listening to it right now.  I could have told you I also have a port in my arm.  And I could have told you that I ate my way thru chemo both times (I like to tease that I tried the chemo diet twice and gained weight both times ... not fair for a fluffy gal like me!).  I can also contribute to today's show about mets - got 'em in the bones, so I have dippsy-doodle-bugged thru all things cancer (with relative ease, so I won't bne scaring any listeners if I am able to call in).  I'm listening to last weeks show right now and hope to be able to call in 2 hours if life doesn't get in the way, or my foggy brain forgets - going to leave this page up after i'm done listening to hopefully remind me ...).  Hugs for your great efforts - you are awesome in print or in voice!  Hugs from northern Canada! Patti",
      "MessageIndex": 4,
      "PostDate": "16/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790645",
      "Title": "Subject: Mets CoolBreeze pteney"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Jul 18, 2012 01:18AM pteney wrote: Hi Ann, I'm glad i finally remembered to call your show.  As I listened back after, I was wondering if it would be a good idea to limit us callers to a shorter time - feel bad about rambling on (and talking over you, sorry about that) ... lol ... hope nobody nodded off  ... gotta keep me on track for sure ... don't give up!  Love the reminder here too.  Hugs! Patti",
      "MessageIndex": 14,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790645",
      "Title": "Subject: Mets CoolBreeze pteney"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Jul 25, 2012 08:44AM pteney wrote: Hi Laurie, Chiming in to say my arm port works fantastic - had it since Aug 2010, had 8 rounds of chemo (once/week for 3 weeks, 1 week off) and monthly Aredia infusions since then, and of course, blood draws.  Would highly recommend it being in the arm.  Like Ann, it shows, but then i'm a 'fluffy' gal, so who is really looking?? lol Hugs, Patti",
      "MessageIndex": 5,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790919",
      "Title": "Getting a new port in my arm. Does anyone else have one there? Sido Sido"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Jan 11, 2012 05:45AM pteney wrote: Dear Jenn, A fellow in the chemo room (named Ray - I call him my 'Ray of Sunshine when i see him) and I were talking one day about how I keep trying to plan for the 'what ifs' that we can't control.  He then reached in his wallet and handed me a piece of paper to keep that simply says:  Don't think too far ahead, you'll spoil today.  That phrase has run thru my mind daily now when I need to remind myself to quit that stinkin' thinkin ... It really has helped - just trying to let go and enjoy the daily joys and let the future take care of itself.  I finally realized my family is quite capable of taking care of things - your family is amazing to pull off the wedding details also - and the family feels better for being able to DO something when it seems like life is at a complete standstill when we almost stop breathing because are afraid to breathe and live.  Hope you can find something to help you relax and enjoy all those around you!  Big hugs, Patti",
      "MessageIndex": 118,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780266",
      "Title": "It has spead to my brain...... jenn3 lwd"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Aug 9, 2012 11:08AM - edited Aug 9, 2012 12:33PM by pteney Hi, I also married an older man who ended up getting cancer before me when our sons were 12 and 14, so I was worried about raising teens alone, but he is still here today (cancer didn't return, but strangely now has a massively enlarged gallbladder that could mean cancer and he is waiting to see my surgeon/onc).  Then I got sick as soon as he was well and retired and worried about him either getting cancer back again then or dying before me cuz he is older and who would raise two tall teens who didn't want to go anywhere anyway.  Sigh.  So here we are, kids raised and gone from home, i've survived 8 years so far (mets found on my 5 yr checkup) and now I want to get out of the house and downsize to not burden our sons to clean us out, as it's a crapshoot who will go 1st now, lol.  He's 73, cancer once and possibly now and me way out of shape at 51 with 2 cancers under my considerable belt ... the things we have to worry about!  Hugs to all from Canada, Patti edited to add:  oops ... hit the submit button a few times cuz nothing was happening and my post got posted 3x ... lol -- patience, yeah so not my middle name",
      "MessageIndex": 9,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791699",
      "Title": "Kids and who cares for them alesta29 apple"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Aug 9, 2012 11:09AM - edited Aug 9, 2012 12:31PM by pteney",
      "MessageIndex": 10,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791699",
      "Title": "Kids and who cares for them alesta29 apple"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Aug 9, 2012 11:11AM - edited Aug 9, 2012 12:31PM by pteney",
      "MessageIndex": 11,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791699",
      "Title": "Kids and who cares for them alesta29 apple"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Dec 18, 2012 01:58PM pteney wrote: Hey SPAMgirl, I used to fry up slices of Spam for my boys - had to be the Hormel brand - the imitators are not worth the savings ... speaking of Hormel, when I lived in the states we used to get Hormel Chili with no beans and put on cream cheese, followed by the chili and then grated cheese.  After micro (or oven) top with sour cream and salsa and ya got a great dip ... so miss that!  Here in Canada I see the Hormel Chili, but not without beans - do they still make it?  I saved one can from a visit 4 years ago, but I won't use it, lol, but i like to see the can for the memories!  So nice to hear your company is so good to employees, and nice hubby got a job!  Awesome!  Hugs from Canada, Patti",
      "MessageIndex": 16,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797481",
      "Title": "Five Questions - SPAMgirl SonnyB RonnieKay"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Aug 15, 2012 07:17PM pteney wrote: Funny you should bring this up ... I've been on femara only 1.5 yrs and just a few weeks ago said enough and stopped.  Called onc's office after a week and told them (instead of being mature and calling first ...) and he wants to see me to switch - but it is a 6 hr drive or 7.5 bus each way and i said i'd wait until my next scan (November) and see him after and restart the femara in another week, so i actually only didn't take a total of 12 pills (take at nite too).  I did feel better within a week, but then the doubts creep in with any pain (normal for bone mets anyways, i'm sure) but I feel 51 going on 81 easily after only a couple pills ... no fun!  I do have to look into the helpful suggestions here.  I feel your pain!  Hugs from Canada! Patti",
      "MessageIndex": 12,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792036",
      "Title": "On AI's 6 yrs... can't take the pain anymore meima-Bev JillThut"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Dec 16, 2011 01:53AM pteney wrote: Hi Kathy, I was the same way - I would just get hooked up to chemo (small town at the hospital in a room) and ask the nurse to order me a lunch (and it was only like 10:30) ... we had a laugh about it eventually.  I like your quip about being a foodaholic, so with ya there, think it must be stress too.  Hi my name is Patti and i've tried the 'chemo diet' twice and gained weight both times !!! LOL Hugs!",
      "MessageIndex": 1,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779609",
      "Title": "pigging out: decadron or apprehension K-Lo 3rings"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "pteney wrote: Hello all, I got the results of my latest CT coupla days ago - woo hoo, still dancing with the Stable Boy - and asked my onc about why i've never had a PET or MRI.  His response was that there were no questions in my CT, that I never needed either of the others.  So, my question is, huh??? LOL  Seriously, i'm wondering if that is true.  It seems like i've read that some cancers have been missed in a CT and caught only on PET/MRI.  I want to be reassured that I am actually stable, and not worry i'm not.  I was on 8 months of Taxol and now he is putting me on Femara (I had IBC 6 yrs ago, got dx on 5 yr anniv w/mets to hip and sternum and few 'slightly enlarged' lymphnodes in chest and one under arm that are now still shrinking after 2 CT's since taxol). Hugs to all, Patti March 2010 bone mets, illiac crest, sternum. Taxol, now femara, aredia, zolodex. Dx 10/7/2004, IBC, Stage IIIC, 26/29 nodes, ER+/PR-, HER2- Dx 4/7/2010, IBC, Stage IV, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767258",
      "Title": "CT vs. PET or MRI pteney pteney"
    },
    {
      "AuthorID": "pteney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9244/profile",
      "Content": "Apr 8, 2011 07:51PM - edited Apr 8, 2011 11:35PM by pteney Thanks Kelly and Dawn ... i will just settle down and be grateful for the news and go with what my doc says that nothing alerted them to do further testing.  I too had full bone biopsy (oops, i mean full body bone scan, lol) and head, chest and abdomen CT (including a 3D of my hip I believe) as well as biopsies to be diagnosed.  Have a great weekend gals! Patti",
      "MessageIndex": 3,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767258",
      "Title": "CT vs. PET or MRI pteney pteney"
    }
  ]
}