{
  "AuthorID": "Pu241",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211151/profile",
  "Posts": [
    {
      "AuthorID": "Pu241",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211151/profile",
      "Content": "Jun 9, 2015 11:05AM Pu241 wrote: Mysunshine wrote: \"I do not understand why some of you are told you can eat sugar. I have done a lot of research and Cancer cells love sugar. I am also reading a book called, Anti Cancer a New Way of Life. Many studies are cited where sugar is a no no. Do research. There is a lot of researched based, reliable information if you take the time.\" All cells love sugar, it is how cells healthy and cancerous power themselves. Find a way to selectively shutdown a cancer cell, and only a cancer cells, ability to power itself and then you'd have something. Unfortunately, a cancer cells basic genetic make-up includes the same biochemical machinery that a healthy cell uses. This is my \"research\", nothing but a few clicks of the mouse to show that the \"sugar feeds cancer\" is another myth. Like all things, too much is not good for anyone. http://www.mdanderson.org/patient-and-cancer-infor... http://www.mayoclinic.org/diseases-conditions/canc... http://www.dana-farber.org/health-library/sugar-an...  ",
      "MessageIndex": 2199,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Pu241",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211151/profile",
      "Content": "Jun 9, 2015 11:59AM Pu241 wrote: I'm not arguing limiting sugar! I would agree with that! You implied that sugar feeds the growth of cancer, and my response was that all cell use sugar to power themselves not just cancer. How do you distinguish normal cell growth/functioning from the metabolization of sugar, from the same function in a cancer cell? How does your experience with Autism and developmental delays for 25 yrs bear upon your supposition that sugar feeds cancer more than healthy cells? I value fact based nutritional information, I don't need a book, just a reputable reference. Again, what does the beef, dairy, and chicken industry have with sugar feeding cancer growth over normal cell operations? Simply sharing unsubstantiated rumor/myth serves no purpose but to scare those who have suffered enough. Who's one indulgence, a doughnut, a slice of pie, a chocolate; if they can bear to eat/taste it, is now tainted with the false thought that this could be feeding my cancer. No need to respond further, Just wanted to put this out for the lady's to get a more balanced view.",
      "MessageIndex": 2203,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    }
  ]
}