{
  "AuthorID": "pumpkinweed…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94854/profile",
  "Posts": [
    {
      "AuthorID": "pumpkinweed…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94854/profile",
      "Content": "Mar 17, 2012 01:04AM pumpkinweed wrote: Hi Lynn, I agree with all the positive aspects people have mentioned, but here are some negative ones since you have asked for these specifically.  The one negative that has been the toughest for me to deal with is the isolation.  Some people just don't know how to respond - and I don't blame them - and so they ignore you.  It was hard for me when people I had cared for in various ways never even acknowledged my cancer.  So, this is a risk.   Also, it will be hard for people to know where you are at any given time, emotionally, and so you will have to deal with that, too.    You will have to deal with people responding to you or not responding to you in the opposite way of what you need in that moment.  I think these are the biggest downsides.  Someone like coolbreeze who I love and admire seems to know just how to handle this.  But I know that I would struggle with that part.  So it just depends on what is the priority for you and what you think you can handle.  I would just encourage you to do what is best for you.  :)",
      "MessageIndex": 20,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784170",
      "Title": "Would you do this? Thoughts Please! Lynn1 bhd1"
    },
    {
      "AuthorID": "pumpkinweed…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94854/profile",
      "Content": "Mar 17, 2012 01:45AM pumpkinweed wrote: A potential drawback I just thought of has to do with your job security.  Is there any concern that if your company had to downsize, you would become a leading candidate?  I don't know if there are laws about this, maybe others can speak to this point.   Are those in management the compassionate type?  And I just realized that I'm in a Stage IV thread.  I got here through a search and didn't realize where I was, so please forgive.   :)",
      "MessageIndex": 21,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784170",
      "Title": "Would you do this? Thoughts Please! Lynn1 bhd1"
    },
    {
      "AuthorID": "pumpkinweed…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94854/profile",
      "Content": "Dec 26, 2009 08:23PM pumpkinweed wrote: I was diagnosed 3 years ago, and am currently doing 6 month visits which just include a physical exam and blood work.  My doctor does not do TMs or any diagnostic tests unless there are symptoms.  When I questioned why no scans, my onc explained that studies have shown that detecting metastatic cancer earlier does not affect survival...  I didn't want to believe this was true - and who knows if this study is right; but the philosophy of some oncs like mine is that routine tests do not affect outcome, they only increase anxiety.  I was skeptical until I had pain in my side and had to have an MRI (it was clear)....  the anxiety was so bad that I never wanted to have another scan ever!   I understand the philosophy better now.  But I do have alot of trust in my onc.  I think it's important to find a doctor that you can connect with, and one that you really trust.   It never hurts to get a second opinion, even at this point in your care.  I got a second opinion after treatment just to make sure there was nothing more to do, so you may want to go that route, too.",
      "MessageIndex": 15,
      "PostDate": "26/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/745699",
      "Title": "Follow up for Stage I's carcharm 1Lizzy"
    }
  ]
}