{
  "AuthorID": "Purdue98",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94121/profile",
  "Posts": [
    {
      "AuthorID": "Purdue98",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94121/profile",
      "Content": "Jan 26, 2010 06:24PM Purdue98 wrote: Thank you ladies for all of the words of wisdom and encouragement. I really appreciate it! It is comforting to connect with others who are going through some of the same experiences, and also from those who have been there. I was wondering too why I felt SO exhausted after the last AC...didn't realize \"powerful\" empact of the steroids. God bless!",
      "MessageIndex": 11,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747346",
      "Title": "question about \"steroid crash\" Purdue98 Beverly11"
    },
    {
      "AuthorID": "Purdue98",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94121/profile",
      "Content": "Purdue98 wrote: Hello- I've seen some mention of the \"steroid crashing\" after AC tx. Does this refer to the horrible feeling that heart is pounding, you feel like everything is out of control, you feel like you want to scream, yet you feel so exhausted ?  Or is this just one of the \"emotional\" side effects of chemo? Just finished AC....hoping Taxol will be better?? thanks! Dx 10/10/2009, DCIS, 3cm, Stage IIIA, 6/24 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747346",
      "Title": "question about \"steroid crash\" Purdue98 Beverly11"
    },
    {
      "AuthorID": "Purdue98",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94121/profile",
      "Content": "Purdue98 wrote: I've had 4 AC tx and 2 Taxol tx, and now I have a nice, round little belly to go with my bald head and flat chest :)  Has anyone else experienced 10 + pound weight gain?  During the first 4 treatments I felt so nauseated all the time, that I just ate whatever sounded good. With the Taxol, I am feeling less nausea, and am trying to eat a healthier diet, but can't say that I always pass up the sweets.... Will the weight gain resolve after chemo with increased exercise/better diet?  I will probably end up with an ooph and early menopause (I am 34) so I am a little worried about my future pants size. (sounds silly, but it is hard sometimes to have a positive body image in the midst of things). Thanks ladies! I value your comments/suggestions. Dx 10/10/2009, DCIS, 3cm, Stage IIIA, 6/24 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748468",
      "Title": "Weight gain during ACT Purdue98 cindy2"
    }
  ]
}