{
  "AuthorID": "purple_shmo…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213445/profile",
  "Posts": [
    {
      "AuthorID": "purple_shmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213445/profile",
      "Content": "Apr 2, 2015 05:11PM purple_shmoo wrote: Thank you everyone for the replies! I had my appt with my surgeon today and am feeling better. I am triple negative or rather the cancer is. It is approximated at 4cm x 2 cm. my surgeon did a lymph node biopsy today and said visually they look cancer free but I will have results next week. MRI does not depend on my period (maybe because not hormone involved?) and is scheduled for next Thursday. She also drew blood for the BRAC test due to my age and the triple neg ( I have no family history of cancer). Preliminarily she says my treatment plan will involve chemo and surgery with the possibility of radiation depending on chosen surgery and final size of tumor. I will need with oncologist tomorrow, and get most of the tests back next week. I feel better having more information now. I am curious if anyone has had chemo recommended before surgery that didn't choose to do it? Or if anyone can point me to a link to help me understand the choice better. Thank you all so much for the supportive words!",
      "MessageIndex": 5,
      "PostDate": "02/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830105",
      "Title": "So Scared purple_shmoo purple_shmoo"
    },
    {
      "AuthorID": "purple_shmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213445/profile",
      "Content": "Apr 14, 2015 07:11AM purple_shmoo wrote: People told me I would feel better once I had a plan in place and dates, and I definitely do. Just waiting for port surgery next week and start chemo the following week. nervous, but feeling determined",
      "MessageIndex": 18,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830105",
      "Title": "So Scared purple_shmoo purple_shmoo"
    },
    {
      "AuthorID": "purple_shmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213445/profile",
      "Content": "Apr 12, 2015 06:27PM purple_shmoo wrote: thank you everyone for the feedback. Things are going as well as can be expected. I am going for chemo first. I am waiting to have my port put in to get started. Will have that done this Tuesday if they have any cancellations, otherwise next Tuesday the 21st. Will start chemo the following Monday. 10 chemo treatments over 20 weeks is the revised plan. No evidence that Cancer has speed to lymph nodes. Both lymph node biopsy and PET scan came back clear. Nervous about starting chemo and all of the possible side effects but trying to stay positive and focused.",
      "MessageIndex": 15,
      "PostDate": "12/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830105",
      "Title": "So Scared purple_shmoo purple_shmoo"
    },
    {
      "AuthorID": "purple_shmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213445/profile",
      "Content": "Apr 3, 2015 04:53AM - edited Apr 3, 2015 04:54AM by purple_shmoo Thank you",
      "MessageIndex": 8,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830105",
      "Title": "So Scared purple_shmoo purple_shmoo"
    },
    {
      "AuthorID": "purple_shmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213445/profile",
      "Content": "Apr 3, 2015 04:05PM purple_shmoo wrote: Thank you Lillierose! I am down in Florida. I need the MRI because I have 2 spots also on left breast that they think are benign but want to make sure. I was told because of their location the MRI is best to do this. The Oncologist today recommends chemo first, 20 weeks. 4 doses over 8 weeks of Adriamycin and Cytoxan and then 12 weeks of Taxol. He is willing to discuss surgery first if lymph node biopsy comes back clear. Getting 2nd opinion on Tuesday. Good luck with your results. You will find a way to take care of your little one",
      "MessageIndex": 10,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830105",
      "Title": "So Scared purple_shmoo purple_shmoo"
    },
    {
      "AuthorID": "purple_shmo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213445/profile",
      "Content": "Apr 12, 2015 09:52PM purple_shmoo wrote: I feel the same way. Although the two weeks (tomorrow) have been filled with tests and appointments, now thT I have a plan I want to get started on the chemo. Unfortunately my bs can't fit me I. Until the 21st to get my port! Hoping someone cancels the Tuesday so I can get in. I wk then start chemo the flowing Monday. It just feels like forever! I too am 3- and have N inflamed lymph node that they buece to be from the biopsy. The PET scan showed some inflammation in the lymph nodes but they said it did not light up like Cancer. So cautiously optimistic that it is contained ing my breast for now",
      "MessageIndex": 10,
      "PostDate": "12/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/830212",
      "Title": "Feeling like the doctors are to relaxed? LillieRose purple_shmoo"
    }
  ]
}