{
  "AuthorID": "PVM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263765/profile",
  "Posts": [
    {
      "AuthorID": "PVM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263765/profile",
      "Content": "Jan 5, 2018 08:14PM PVM wrote: Ladies have been lurking on this thread for a while & had to post how much of an inspiration you all are. From the 1 year to 5 to 10 to 15 & plus years. This is so encouraging to read especially as im finishing my cancer treatment. Have 7 rads to go woot woot woot. I wont lie ladies i do worry about reoccurred as well as developing LE & am so tired of seeing peoples eyes open wide when i tell them how many positive nodes i had. Does it ever get easier i wonder but in the meantime i will try not allow Cancer to rob me of living a happy life & enjoying life. It has taken so much from me already but i shall continue to stay in warrior mode & read the wonderful inspirational stories of you survivors. WorrywortSuzie i cannot believe a doctor would even have the nerve to say that to you. Unless he has a crystal ball & can guess the future he has no idea if your cancer will come back or not. What a jerk, does he not realize that having a BC diagnosis not only leaves physical scars but mental scars too. Don't listen to him you continue to stay strong & fight. Have a wonderful weekend ladies ",
      "MessageIndex": 90,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    },
    {
      "AuthorID": "PVM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263765/profile",
      "Content": "Jan 6, 2018 04:46PM PVM wrote: Honeybeaw thanks so much for the hugs & moral support & I shall definitely try to stay positive even though like you my mind tends to drift every now & then. I shall take a page from your book & try to keep busy & the positive in my life :) I think all the amazing warriors on these threads are all inspiring & hope to join you ladies with many years cancer free. Hugs xo ",
      "MessageIndex": 92,
      "PostDate": "06/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    },
    {
      "AuthorID": "PVM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263765/profile",
      "Content": "Dec 15, 2017 12:11PM PVM wrote: Mamatwoboys it is normal to be angry & frustrated while going though this journey. Its not one we asked for but its one we shall damn well kick butt in & win! All the wonderful warriors on this thread gave you amazing advise. Like Hariry i was the same asked why me i think that is common for all of us & then once i started to get more into my treatment i got stronger & had a stronger will to fight. You will get that too, i pray that you find strength to get through all your treatments with no major SE. I was lucky i had a great support of family & friends & that made me stronger. I also met some amazing ladies going through the same thing as me & we became very good friends. Everyone's journey is different but we share one common goal to kick butt! Something i will always remember when i had my hardest moments was my friends & family kept on telling me the following \"keep your head up, God gives his hardest battles to his strongest soldiers\" WE are strong & we are deff soldiers & we shall kick butt & beat this beast! Wishing you strength as you get through this & you will get through this.",
      "MessageIndex": 8,
      "PostDate": "15/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860812",
      "Title": "Just starting this fight Mamatwoboys PVM"
    }
  ]
}