{
  "AuthorID": "pwilmarth",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
  "Posts": [
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Sep 21, 2015 06:01PM pwilmarth wrote: Ronnie Kay, I take the opposite point of view. She did what she needed to do without making the story about her. We don't know if she used some of her wealth to support breast cancer research, which is more meaningful. Frankly, I couldn't take the self serving publicity from Angelina Jolie and her double mmastectomies. It always felt like narcissism. Just help fund some research and keep the details to yourself..",
      "MessageIndex": 13,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835148",
      "Title": "Jackie Collins died of breast cancer yesterday at 77yrs old. MusicLover DivineMrsM"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 22, 2016 02:53PM - edited Aug 22, 2016 02:54PM by pwilmarth Very sorry to hear your Dance with NED has hit an impass. Good news is that TDM-1 is now the second line drug for HER2+ BC and it's had very good results. - let's hope that they move you quickly to the new drug.",
      "MessageIndex": 15,
      "PostDate": "22/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847180",
      "Title": "My 3 years with NED is over Tilda AmyJM"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 2, 2016 04:18PM pwilmarth wrote: Stage IV Feb 2015",
      "MessageIndex": 127,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 10, 2015 03:33PM pwilmarth wrote: Interestingly, I read an article in Forbes magazine that the big pharmaceutical companies are very interested in bringing new immunotherapies to market - because cancer treatment has the potential to be very profitable. New more effective treatments with fewer side effects are definitely coming to market. For our benefit.",
      "MessageIndex": 2,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837411",
      "Title": "Interesting Article on Pricing of Ibrance/Heceptin/Affinitor oriole ShetlandPony"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Apr 27, 2017 09:54PM pwilmarth wrote: I took STD and applied for SSDI at the same time. Health insurance should not be an issue. You are eligible for Medicaid and if you meet income requirements you can opt the buy-in for Medicaid. My health insurance was free until I started receiving SSDI. Then I opted for Medicaid buy-in which costs $130 per month. Once you have SSDI you can participate in back to work programs. Right now I work 4 hours a week.  I will be eligible for Medicare this year and it will cost the same for Part B as I am paying for Medicaid. Really, both government programs are better than the programs offered by employers or Obama care. I would probably stick with Medicaid but there's too much uncertainty with Trump and his healthcare plans. As soon as I am eligible, I will switch to Medicare which should happen in a next 6 months",
      "MessageIndex": 5,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/854522",
      "Title": "Working vs not working vs disability....Help LisaL1005 Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 23, 2015 06:22PM pwilmarth wrote: I was listening to a podcast on Living With Metastatic Breast Cancer last week. They said there are 14 million of us in the United States. It used to be that the oncology doctors saw only a few of us in a day, and now they see 40 patients a day with metastatic breast cancer. Our doctors are getting better and better at treating this disease.",
      "MessageIndex": 736,
      "PostDate": "23/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "pwilmarth wrote: I know it's not breast cancer. Just watched the ESPY awards and this man's battle with leukemia left me with tears in my eyes. Dx 12/1/2014, Left, 6cm+, Stage IV, ER-/PR-, HER2+ (FISH) Surgery 1/12/2015 Mastectomy: Left Chemotherapy 2/24/2015 Taxotere (docetaxel) Targeted Therapy 2/24/2015 Perjeta (pertuzumab) Targeted Therapy 2/24/2015 Herceptin (trastuzumab) Radiation Therapy 7/21/2015 3DCRT: Breast, Lymph nodes Radiation Therapy 10/21/2016 External: Brain Targeted Therapy 11/25/2016 Kadcyla (T-DM1, ado-trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845927",
      "Title": "TNT's Craig Sager honored with Jimmy V Award pwilmarth RonnieKay"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jul 24, 2016 06:17PM pwilmarth wrote: Remote Second Opinions for Breast Cancer You might try this option. The University of Colorado has one of the leading breast cancer specialists in the country and they are very active in a number of clinical trials.",
      "MessageIndex": 5,
      "PostDate": "24/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845373",
      "Title": "HER2+ MBC with PIK3CA mutations, poor response to Perjeta, TDM1 fight2s pwilmarth"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jul 24, 2016 10:18AM - edited Jul 24, 2016 10:19AM by pwilmarth Yes, genetic profiling will help. Any of the major cancer centers have physicians who can help you with this",
      "MessageIndex": 4,
      "PostDate": "24/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845373",
      "Title": "HER2+ MBC with PIK3CA mutations, poor response to Perjeta, TDM1 fight2s pwilmarth"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jun 23, 2016 08:13AM - edited Jun 23, 2016 09:17AM by pwilmarth Probably the best place to start is ClinicalTrials.gov. There's currently an phase III trial called the Bolero 3 trial. If you scroll down the list you will see a list of study locations. There are several throughout the United States. If you connect to one of these locations, you will have a good place to start when you bring your mom to the United States. Here's a listing of cancer centers in the US who are participating in studies involving these mutations. United States, Arizona University of Arizona / Arizona Cancer Center AZ Onc Assoc Tucson, Arizona, United States, 85724  University of Arizona / Arizona Cancer Center Deptof Uof A/Arizona Cancer(3) Tucson, Arizona, United States, 85724  United States, California University of California San Diego La Jolla - UCSD Moores Cancer La Jolla, California, United States, 92093-0658 United States, Colorado Rocky Mountain Cancer Centers RMCC Greenwood Village, Colorado, United States United States, District of Columbia Georgetown University/Lombardi Cancer Center Dept.of Lombardi CancerCtr (3) Washington, District of Columbia, United States, 20007-2197 United States, Florida Comprehensive Cancer Center - Boca Raton Deerfield Beach Boca Raton, Florida, United States, 33248 Comprehensive Cancer Center - Boca Raton Dept.of BocaRatonCompCanCtr Boca Raton, Florida, United States, 33248 Florida Cancer Specialists DeptofFloridaCancerSpecialists Fort Myers, Florida, United States, 33901 Memorial Hospital Memorial Cancer Institute Hollywood, Florida, United States, 33021 MD Anderson Cancer Center - Orlando Dept.ofMDACC-Orlando(2) Orlando, Florida, United States, 32806 United States, Georgia Emory University School of Medicine/Winship Cancer Institute Dept.of WinshipCancerInst. (2) Atlanta, Georgia, United States, 30322 United States, Illinois North Shore University Health System NSU Evanston, Illinois, United States, 60201 United States, Kansas Kansas City Cancer Center KCCC- South (2) Overland Park, Kansas, United States, 66210 United States, Maryland Maryland Oncology Hematology Owning Mills, Maryland, United States, 21117, United States, Minnesota Park Nicollet Institute Dept. of Park Nicollet St. Louis Park, Minnesota, United States, 55416 United States, Missouri St. Louis University Cancer Center SLU Cancer Center St. Louis, Missouri, United States, 63110 United States, Nebraska University of Nebraska Medical Center Unv Nebraska Med Ctr (2) Omaha, Nebraska, United States, 68198 United States, Nevada Comprehensive Cancer Centers of Nevada CCC of Nevada Henderson (4) Las Vegas, Nevada, United States, 89109 Nevada Cancer Institute Dept. of Nevada Cancer (3) Las Vegas, Nevada, United States, 89135 United States, New Jersey Overlook Hospital - Carol G Simon Cancer Center Carol G Simon Summit, New Jersey, United States, 07901  United States, New York NYU Langone Arena Oncology Dept.ofArenaOncologyAssoc(2) Lake Success, New York, United States, 11042  United States, North Carolina Duke University Medical Center Dept. of DUMC (2) Durham, North Carolina, United States, 27710 United States, Oregon Northwest Cancer Specialists Tutlatin Portland, Oregon, United States, 97210 United States, Pennsylvania University of Pittsburgh Cancer Institute DeptofMageeWomen'sHospital(2) Pittsburgh, Pennsylvania, United States, 15232 United States, Tennessee The Jones Clinic Dept .of The Jones Clinic (3) Germantown, Tennessee, United States, 38138 Sarah Cannon Research Institute Dept.ofSarahCannonCancerCtr(6) Nashville, Tennessee, United States, 37203 United States, Texas University of Texas Southwestern Medical Center University of TX SW Med Ctr(2) Dallas, Texas, United States, 75390-8852  Texas Oncology, P.A. Presbyterian Hospital (2) Dallas, Texas, United States, 75246 Texas Oncology, P.A. Texas Onc - Amarillo Dallas, Texas, United States, 75246 Oncology, P.A. Texas Oncology - Sammons Dallas, Texas, United States, 75246 Texas Oncology, P.A. Midtown Dallas, Texas, United States, 75251 Texas Cancer Center ( Medical City Dallas Hospital) Dept. of Texas Cancer Ctr. (2) Dallas, Texas, United States, 75230  University of Texas/MD Anderson Cancer Center Dept of MD Anderson (17) Houston, Texas, United States, 77030-4009  Baylor College of Medicine Baylor Houston, Texas, United States, 77030  Longview Cancer Center Longview Cancer Center (2) Longview, Texas, United States, 75601  Cancer Care Centers of South Texas / HOAST CCC of So. TX- San Antonio(2) San Antonio, Texas, United States, 78229 South Texas Oncology and Hematology, PA South Texas Oncology (2) San Antonio, Texas, United States, 78258 Tyler Cancer Center Dept.ofTylerCancerCtr. (2) Tyler, Texas, United States, 75702 United States, Utah Utah Cancer Specialists Utah Cancer (2) Salt Lake City, Utah, United States, 84106  United States, Virginia Virginia Cancer Specialists, PC Dept.ofFairfaxNo.VA (2) Fairfax, Virginia, United States, 22031 Virginia Oncology Associates Dept. of VOA (2) Norfolk, Virginia, United States, 23502 United States, Washington Swedish Cancer Institute Swedish Cancer Institute Seattle, Washington, United States, 98104  United States, Wisconsin St Vincent Hospital Green Bay Oncology Green Bay, Wisconsin, United States, 54301",
      "MessageIndex": 2,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845373",
      "Title": "HER2+ MBC with PIK3CA mutations, poor response to Perjeta, TDM1 fight2s pwilmarth"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jul 25, 2016 07:07AM pwilmarth wrote: It turns out that the University of Colorado isn't the only major cancer center that offers online second opinions. There are at least three others Look into online second opinion services such as those at the Cleveland Clinic, Johns Hopkins, and Harvard-affiliated Partners HealthCare. All four of these centers are part of the National Cancer Institute's centers.",
      "MessageIndex": 7,
      "PostDate": "25/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845373",
      "Title": "HER2+ MBC with PIK3CA mutations, poor response to Perjeta, TDM1 fight2s pwilmarth"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 7, 2017 11:22PM pwilmarth wrote: I would say they are monitoring you closely and watching for changes. My RO walked me through my latest MRI and showed me the spots he is monitoring. It was pretty cool to see what he's following and the sizes of the things he's watching. The computer gave readouts like 1.0 mm X 5.0 mm. Take out a ruler and look at those measurements. Those are tiny spots. He felt like these are \"slow growing\" and gave my MO the option to change treatments. I will have another MRI in about 6 weeks to ensure that there isn't any significant changes in these spots. But spots that are this small will not have any symptoms and I feel good with lots of energy. I don't think I can ask for anything more.",
      "MessageIndex": 16,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/857438",
      "Title": "Good scans -- I think! Tina2 Kandy"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 14, 2015 12:40PM - edited Dec 14, 2015 01:41PM by pwilmarth SSDI is independent of STD and LTD. You can get STD and LTD at the same time as SSDI, but SSDI doesn't pay until you have been disabled for 5 months. However, because of Social Security rules, the first check doesn't arrive until at least 30 days after you start receiving benefits. For example, my effective date of disability was 6/4/15 Benefits start 12/4/15 First check is due 1/4/16 but Social Security issues checks based on the day of the month you were born: 1st through 10th Second Wednesday 11th through 20th Third Wednesday After the 20th Fourth Wednesday My first check will arrive 1/27/16 Your STD benefit will be exhausted before this, but I would check with Social Security about how they handle the LTD. There's rules about \"Substantial Gain Activities\" and your LTD may be deducted from your SSDI payment. Still it's worth applying and getting approved for SSDI because of the effect it has on your Medicare eligibility. There are vocational rehab opportunities available to you and should you choose, you can do trial of work programs that allow you to return to work without losing your disability benefit or Medicare eligibility.",
      "MessageIndex": 24,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 23, 2015 05:58AM pwilmarth wrote: It won't be hard to be granted disability. Whoever is your provider with disability will simply request information from your cancer center. This is something your cancer center will be prepared to assist you with. At my cancer center they have one person who does nothing but manage the requests for documentation from disability insurance providers and Social Security. You just have to find out who it is and sign a release of information.",
      "MessageIndex": 32,
      "PostDate": "23/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 8, 2016 06:58PM - edited Aug 8, 2016 07:09PM by pwilmarth Published online 2014 Nov 11 Erythropoietin and Cancer: The Unintended Consequences of Anemia Correction A plethora of scientific evidence demonstrates a growth-promoting, anti-apoptotic action of EPO and other ESAs on non-hematopoietic cells, both normal and malignant, and this is supported by numerous clinical observations showing adverse effects of EPO administration on the clinical management of tumor growth and progression. As anticipated just a few years ago, physicians who care for anemic cancer patients have been facing a dilemma, whether to treat the anemic patient with an ESA, thereby potentially increasing the risk of worsening the malignancy, or to withhold ESA treatment, with resultant patient fatigue, reduced physical activity, increased hypoxic stress, and reliance on transfusion therapy. Primary tumors are not yet EPOR typed (like breast cancers are assessed for ER/PR expression) though this idea should be considered. There has been much discussion of EPO use in cancer patients, and several professional and regulatory organizations and authorities have issued various guidances. Perhaps, the following \"rule\" used by several clinicians interviewed by one of the authors should be considered. If the cancer patient is being treated with curative intent, avoid the use of ESAs. If the treatment plan is more conservative or palliative, consider ESAs for anemia treatment, but proceed with great caution",
      "MessageIndex": 3,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846720",
      "Title": "Iron Infusion and Procrit--what to do?? Phoebegal Phoebegal"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 17, 2015 07:32AM pwilmarth wrote: One thing that has happened since I went on disability is that my expenses have gone down. It's something we never think about, but it costs money to work. I don't drive nearly as much as I used to. I used to spend $50 per week for gas. Since I no longer have to go to work every day, the amount I spend on gas is minimal. A tank of gas lasts me over a month, depending on doctor's appointments. Because I was so busy, I seldom had time to cook and I used to eat out a lot. Now, I have time to cook my own food (better for my health), and my food costs have gone down. If your disability pays you 60% of your salary, remember that is 60% of your pre-tax dollars. For me, that meant I received nearly as much money as I used to get after taxes and deductions for health insurance and disability insurance. So I didn't feel like I was getting less money and I certainly was spending less. My disability was more than I will receive from SSDI in January. But working part-time will make up for some of this lost income and I will be ok. I've worked in long-term care during my nursing career, and it happens to almost everyone if you live long enough - you will develop health problems, retire and will need financial assistance. Most of us won't have acquired enough assets to cover our expenses. We will need to apply for Medicaid and Medicare (working with people right now who used to be engineers and college professors - and they are on Medicaid and Medicare). I have been fortunate enough to work in the administrative side of healthcare and it taught me how and when to apply for these programs. These are your safety nets and they are there for you to use. I just look at this as a new chapter in my life. It's an opportunity to get involved in the things that I enjoy and enhance my spiritual growth. I have a neighbor who is my age and he is retired. He's very involved with his church and because it's the holidays, he goes to local nursing homes and provides entertainment to the residents. He gets to do things in the service of others and it keeps him active and involved in his community. It's really up to you. But leaving full-time employment isn't a loss. It's an opportunity for growth.",
      "MessageIndex": 28,
      "PostDate": "17/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 25, 2015 12:21PM pwilmarth wrote: Those are interesting articles and worth reading. Everyone who is contemplating taking disability should read them. My concern is that these articles are quite intimidating for the average person and create needless anxiety. As a practical matter, it's not difficult to navigate the system. Everything is automated and you receive letters informing you of your rights every step along the way. I can tell you from experience with the healthcare system on the financial side of things that most people who don't have insurance don't understand how the system works. Because we are a long-term care provider, we deal with the Medicaid process all the time. Some people will be fortunate enough to have some assets before they need Medicaid and will have to do what we call \"spend downs\". How much this is depends on the state you live in. But you can get this information from you state's Healthcare Policy and Financing department. The main point I want to make is that eventually everyone can qualify for Medicaid, regardless of your financial situation. If this weren't the case, we would have many people over the age of 65 who have no insurance coverage at all. This would also be the case for people over the age of 50 who develop health problems. And yet, I've worked with many people between the ages of 50 to 65 who are disabled due to health problems (not necessarily cancer) who are fully eligible through Medicaid and have all of their financial needs met. They aren't wealthy, but they are not homeless or lacking basic necessities like food and clothing. Most people who are not working will meet the poverty level requirement. Unless you have amassed a large sum of money, you won't be able to afford COBRA benefits or be able to afford your own coverage. Because of the nature of cancer treatment, most healthcare plans in The Marketplace simply don't provide enough coverage and you will still have large copays - especially for standard things like PET scans and MUGA scans. I was quoted a copay of $250 for each of these scans with the highest coverage plan they had. With financial assistance, I would still have to pay $500.month for insurance coverage (and I was only paying $350/month through my employer). It's always good if you have a spouse who has an employer sponsored plan and you can receive coverage under their plan. However, some employers of smaller companies are finding that providing health insurance coverage for dependents is too expensive and are dropping that benefit. So your spouse may not be able to get benefits for you. The other thing I would bear in mind that, if you are married, some assets may be excluded because of spousal protection. For example, owning a house. Your spouse must still have a place to live. One mistake that people make is that they think they can give away assets to family members before they apply for Medicaid. If you are thinking about doing this, DON'T. It will disqualify you for Medicaid for five years. My employer sponsored plan was through Kaiser Permanente and when my coverage ended, I received notice from both my employer and KP. This qualifies as a \"triggering event\". Kaiser Permanente is a large enough organization that they have licensed advisors to speak to about my options. When I told her about my personal situation and explained to her that their Marketplace plan was inadequate to meet my needs, she transferred me to the appropriate organization that handles Medicaid for my state. Everything happened on the phone. One thing I would recommend is to talk to someone at your cancer center about applying for Medicaid. They usually have social workers and these professionals are used to helping people navigate the system. As far as finding providers, you will receive a list of providers available to you in your area. But if you are being treated at a large cancer center, they most likely accept Medicaid and the transition from one type of insurance coverage to another will be pretty smooth. Their billing department will do all of the grunt work. Because of computers, they can access information about your eligibility through the Medicaid portal. And frankly, most hospitals take Medicare and Medicaid. If you live in an area with a large university hospital, you should be able to find a provider - and you will get the best healthcare available, because teaching hospitals provide the best care from the leading researchers in the country. My own experience with the healthcare system is that Medicare and Medicaid provide the best coverage available. What most lay people don't understand is that the Federal government regulates anyone who accepts Medicare and Medicaid through the Center for Medicare/Medicaid. Nearly every question you have about Medicare or Medicaid eligibility can be answered by researching their website.",
      "MessageIndex": 43,
      "PostDate": "25/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 11, 2016 12:31AM - edited Aug 11, 2016 12:33AM by pwilmarth I'm always sorry to hear when a young person has to face this issue and that cancer is the reason for it. One of the things I would suggest is you start with a document called The Five Wishes. It's less intimidating. Most of the Advance Directive forms that you see used by hospitals and nursing homes are solely directed at the technical aspects of end-of-life care. This document is more personal and humane. Then have a discussion with the person who you designate as your decision-maker. And the suggestion about including a clergy member is good - but social workers are very skilled with helping people finish these forms. I would also like to say that you shouldn't think of completing this form as an automatic assumption that you are going to die. The treatment for MBC has gotten so much better and it may be years before the document is needed. But the discussion with your family is very important. ",
      "MessageIndex": 9,
      "PostDate": "11/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846804",
      "Title": "advanced care directives melp27 PattyPeppermint"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 11, 2016 01:41AM pwilmarth wrote: Many states already require the POLST form. In Colorado, it's called the MOST form and has been used by hospitals and nursing homes for several years. The basic concepts in it are also covered in The Five Wishes but the MOST or POLST form is legally binding for healthcare professionals and was developed to help members of the healthcare team know what \"rules\" to follow when dealing with seriously ill or life-threatening situations. As you can imagine, end-of-life care is an emotionally charged situation where a caregiver walking into a situation needs guidance about what to do. Prior to these forms, the assumption was a nurse or paramedic always administered CPR/Advanced Life Support unless there was a physician's order stating not to. And for paramedics transporting a patient to the ER, advanced directives were not legally binding. The paramedics were required to administer CPR/Advanced Life Support. Now, we are required to follow the MOST or POLST form. There was a well-publicized incident involving an assisted living center where the caregivers called 911 but wouldn't administer CPR at the request of the 911 operator. It created a lot of negative publicity on the Internet and people assumed that the caregivers were negligent for not administering CPR. It turns out that the patient and the family didn't want CPR administered by the caregivers. But licensed caregivers live in fear of lawsuits and the potential for legal actions against their licenses for not acting according to the patient's wishes, regardless of which side of the question the patient is on. The chances are, if you enter a healthcare facility, they will ask you to sign a POLST Form or MOST form because it's considered a physician's order. But it still is based solely on the technical aspects of end-of-life care and not the personal side, where the patient gets to tell people what they want while they are dying. ",
      "MessageIndex": 11,
      "PostDate": "11/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846804",
      "Title": "advanced care directives melp27 PattyPeppermint"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Oct 6, 2016 11:32PM pwilmarth wrote: Denny, I used to get nosebleeds on Taxotere, And I have prolific watering of my right eye nearly every day. Strange.",
      "MessageIndex": 604,
      "PostDate": "06/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 16, 2016 06:43PM pwilmarth wrote: Hi ladies. I introduced myself about 6 weeks ago. Had progression on Herceptin and Perjeta with brain mets. Finished radiation therapy last week and met with the MO today. I will be starting T-DM1 next week. I noticed that one of you had a question about the observation period after your infusion. Genentech recommends an observation period of 30 minutes after your infusion and most infusion centers will follow that standard. I'm looking forward to joining your discussions. Here's hoping that all of us have stable disease for many years to come.",
      "MessageIndex": 647,
      "PostDate": "16/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 18, 2016 11:21AM pwilmarth wrote: Welcome ESCORPION!",
      "MessageIndex": 650,
      "PostDate": "18/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jan 13, 2017 12:18PM pwilmarth wrote: Welcome Pasque. Had my third treatment yesterday and anticipating PET scan after fourth treatment in mid February.",
      "MessageIndex": 725,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Mar 3, 2017 10:34PM - edited Mar 3, 2017 11:08PM by pwilmarth The best way to interpret you Liver Function Tests is too look at what your lab reports as a normal range. For example, my lab reports a normal range as 5-40 for an AST, 5-50 for an ALT and 0.1-1.5 for a bilirubin. These are the tests that Genentech recommends for monitoring your liver. Genentech then makes recommendations for dosing your Kadcyla based on something called ULN (which means upper limits of normal). I have had 6 doses of Kadcyla, and my bilirubin and ALT have remained in the normal range and pretty stable. My AST did rise to 50 after my first dose, but has remained stable until this last dose, where it went up to 61. Both of those numbers are outside of the \"normal level\" reported by my lab. However, Genentech doesn't recommend making any changes in the dose until we reach 5 times the upper range of normal. Should that happen, the dose will be held until my labs return to 2 times the upper range of normal and the drug will be restarted at a lower dose This becomes a serious issue if your lab results are 20 times the upper range of normal. That's when they will stop the treatment",
      "MessageIndex": 811,
      "PostDate": "03/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Apr 19, 2017 12:51PM - edited Apr 19, 2017 01:02PM by pwilmarth Just reporting in to my Kadcyla sisters. Completed my seventh dose of Kadcyla twelve days ago and will receive my 8th dose next week. Had a brain MRI Monday and just received results from Radiation Oncologist. I had 18 micro-lesions back in November. Today, the majority are gone and the few that are left are much smaller. I'm due for another PET/CT scan very soon. Radiation Oncologist says this it the best possible outcome. My appetite has improved quite a bit since starting on Remeron and my peripheral neuropathy is much more tolerable with MS Contin, Gabapentin and Oxycodone for breakthrough pain. I had lost about 50# since November, but now it's stabilized. I wouldn't mind losing a few more pounds as my weight is still higher than what I usually weigh as an adult. My liver function tests are stable. I have more energy and I'm doing more than I was 6 months ago. Hoping all is well with each of you.",
      "MessageIndex": 869,
      "PostDate": "19/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 11, 2015 04:32AM pwilmarth wrote: Here is my experience with work and disability: I knew I had breast cancer before my first doctor's appointment. Since I hadn't been officially diagnosed yet, I told my boss that I would need time off for surgery. So I went on a medical leave of absence in December of last year. I simply was having too much trouble concentrating at work, and I had a demanding, stressful job. After I was diagnosed, it was a month before they were able to schedule me for surgery. I wouldn't have been able to do my job anyway because of the exhaustion I was having, so I spent time resting (I slept a lot) and making plans for what I knew would be a long journey through cancer treatment with surgery, chemotherapy and radiation therapy. Much of that included simplifying my life and getting rid of those things that I felt I couldn't manage anymore. I sold my house (a big two-story, three bedroom house) and moved into a one bedroom apartment. After my surgery in January, I went back to work in February and felt good, but chemotherapy started in February. I managed to work full-time through chemotherapy but had many days after my infusions (which were every three weeks) when I was barely functional. Much of my job required using my brain and I definitely had \"chemo\" brain, as well as exhaustion from the effects of chemo. Near the end of chemotherapy, I developed peripheral neuropathy. Part of the requirements of my job included the possibility of having to cover other departments when staffing shortages required it. The demands of those jobs required me to able to stand on my feet for long periods of time (8 to 12 hours per day), My boss had kept me out of that requirement while I was on chemotherapy but he had plans to put me back into the mix. With the neuropathy, I would not have been able to do that without severe pain. And I was still facing radiation therapy with daily treatments for five weeks and the exhaustion that comes with it. I had always known that taking disability was an option and the stress of the job I was in made that option attractive to me. I had short-term disability benefits, but I am 61 years old and approaching the age when taking Social Security benefits was an option. Since I'm a nurse, I often receive flyers about various educational seminars. One of them came from a licensed social worker about palliative care and it dealt with some of these issues around spiritual and emotional distress. When we're faced with stage IV breast cancer, much of our thinking needs to be directed towards Quality of Life. And trying to maintain full-time employment in this stressful job that often required me to work 12 hours a day was directly impacting the quality of my life. With some encouragement from a co-worker, I looked into Social Security benefits. I wouldn't qualify for normal social security benefits until I am 62. However, if I took disability, I could stop working and I would receive $500/month more than if I waited until I was 62 to retire. This was very close to the amount of money I would receive at age 66 (full retirement age). And disability benefits automatically convert to normal Social Security at age 66 with no loss in income. In addition, by taking disability this year, I would be eligible for Medicare in two years instead of waiting until I am age 65. It turns out that a diagnosis of Metastatic Breast Cancer is an automatic qualifier for disability benefits. And the whole application process is expedited - you know within 10 days of submitting your application if you are approved (which I was). But there are some caveats - you have to stop working (or limit your income to less than $1090 per month) for five months. Your first check won't arrive until 6 months after your effective date of disability. So you have to have a financial cushion to carry you through those first 6 months. For me, part of that money came from the sale of my house. Part of it came from an old IRA account. The rest of it came from using my short-term disability insurance (which covers you for 22 weeks - just long enough to cover you until Social Security comes in). The other issue is health insurance. While I was receiving short-term disability, my employer still provided me with health insurance. Once the short-term disability stopped, the coverage for health insurance stopped. The cost of insurance through my COBRA provider would be $700/month - something that on a fixed income I would never be able to afford. That sent me to The Marketplace, to try to find a less expensive plan. They ask you about your taxable income for 2015 and your projected taxable income for 2016. Even though I've barely worked this year (four months), I still had a fair amount of income and with financial assistance, I was still looking at paying $500/month for insurance. I always understood that at some point, I would need Medicaid. Social Security disability means you are eligible for Medicaid. When I spoke to The Marketplace person, she transferred me to Connect for Health Colorado, which is the entity that deals with Medicaid applications through The Marketplace. Over the phone, we completed a Medicaid application - and I was approved and received my Medicaid card two weeks after the application. I did have to go to the local Human Services department with proof of citizenship and a Social Security Number, but now all is in place. With Medicaid in place, I have much better medical coverage. I used to have $35 copays for all the specialist appointments through my employer's health plan - now I pay $2. I recently had cataract surgery and my copay was $1. I went on disability in June of this year. Without the stress of a full-time job, the quality of my life has improved 1000%. I returned to work, but in a limited capacity - just one day per week and no prolonged standing. It's therapeutic for me to work one day per week and provides me with some extra money. I still enjoy visiting with my coworkers and most of them seem to feel inspired by my journey with breast cancer. But I'm not working enough to disqualify me from disability. Overall, the decision to take disability was a good one. ",
      "MessageIndex": 14,
      "PostDate": "11/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jun 25, 2016 05:24PM pwilmarth wrote: From what I'm reading, I think we have some confusion about the CLEOPATRA study. It never included carboplatins. The study design was docetaxel, Herceptin and Perjeta. There was never any conclusions about stopping this regimen in the metastatic setting. There isn't an oncologist out there who can tell you whether it's safe or not safe to stop this treatment. In this particular treatment regimen, the drug that is most responsible for neuropathy is docetaxel. And I developed neuropathy on that drug. But the goal isn't to stay on that drug forever, just 6 doses. The hope is that your nerves will recover after the docetaxel is stopped. My nerves got better, but it's been over a year and I still have neuropathy. Some days are better and some days are worse. Since the release of the results of the CLEOPATRA study, oncologists have looked at using Herceptin and Perjeta in other treatment settings, including the adjuvant and neoadjuvant setting. In these cases they would use a carboplatin and the goal might be 12 months of treatment. But the risk of neuropathy is strong with the carboplatins. If my oncologist were to recommend that I start a carboplatin, I would be reluctant to do so because I would not want to reinjure my already damaged nerves. And I would be asking why? The neuropathy can get worse, causing a definite negative impact on the quality of my life. It's never wrong to discuss your concerns with your oncologists. They know that some treatments aren't tolerated well by their patients, and, in fact, this is one of the major reasons that certain treatments are stopped.",
      "MessageIndex": 7,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845397",
      "Title": "The doctor works for YOU!! Thoughts on decision-making pajim Longtermsurvivor"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 14, 2015 01:01PM pwilmarth wrote: Single mom - I am single (no children) and have always had to manage the finances in my house. It's a lot to think about. Here's what comes from the Social Security website regarding pensions: \"If you get a pension from work not covered by Social Security If you start receiving a pension from a job for which you did not pay Social Security taxes—for example, from the federal civil service system, some state or local pension systems, nonprofit organizations or a foreign government— your Social Security benefit may be reduced. Also, tell us if the amount of your pension changes.\" It's always worth calling Social Security to ask specific questions about your situation. Social Security doesn't say you can't work, but your disability may prevent you from handling full-time employment - that's why there's a cap on the amount of income you have. They also have Ticket To Work programs that gives you quite a bit of flexibility in terms of returning to work. Frankly for the past 6 months, I haven't had the energy to work full-time and haven't felt isolated. While I was getting radiation therapy, I got plenty of social interactions with the radiation therapists, and I've gotten to know the nurses at my infusion center quite well. There's church, and because I'm over the age of 60, there's a senior center I can get involved in. I am thinking about doing volunteer work with a local animal rescue shelter. I am starting to feel better, and I could also choose to work more, but anything over $1090/month is deducted from my Social Security checks. I also have to watch my monthly income because of Medicaid. My state limits my income to $1300/month from employers - and I can't afford health insurance out of pocket.",
      "MessageIndex": 25,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 24, 2015 11:55AM - edited Dec 24, 2015 11:58AM by pwilmarth You decide when to apply, but you have to stop working for the application to be approved. For example, I could stop working tomorrow. My date of disability would be 12/24/15. But I could wait several weeks to apply, since disability benefits don't start until after you are disabled for five months.",
      "MessageIndex": 37,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 8, 2016 08:09PM pwilmarth wrote: I'm guessing that he does know it, but is operating with the intent to offer improved quality of life for you. It's quite a statement when you say you \"feel like you can't go on\". There's a lot of references to stem cells and genetic testing and most of the concerns with EPO are related to specific mutations - one of them being the mechanism for the development of resistance to anti-HER2 treatment (Herceptin). It doesn't sound like the science has advanced enough for them to make predictions based on genetic subtypes, so the advice to proceed with caution is well-meant. Probably the best answer is a trial of transfusions to see if this improves your quality of life.",
      "MessageIndex": 5,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846720",
      "Title": "Iron Infusion and Procrit--what to do?? Phoebegal Phoebegal"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "May 15, 2016 04:12PM pwilmarth wrote: Words, however kind, can't mend your heartache, but those who care and share your loss wish you comfort and peace of mind. May you find strength in the love of family and in the warm embrace of friends. Words cannot express my sadness. May the comfort of God help you through this difficult time.",
      "MessageIndex": 23,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/844241",
      "Title": "My wife has passed Tiger_Blood RonnieKay"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 17, 2016 01:27AM pwilmarth wrote: The only answer I have for you is: Do you enjoy living? Most of us continue because we still get some joy out of life. But many women do reach a point where they are exhausted and no longer get pleasure from life. And they decide to stop treatment. That is very much a personal decision. As far as your son's opinion about the drugs \"poisoning\" you, the answer is yes, some of the drugs have side effects that are not tolerable, but many of the newer treatments are designed to target only the cancer cells. In every discussion that oncologists have about these drugs they talk about the toxicity of the drugs they are using. The balance is always in favor of safety and administering the drugs with the idea that a drug is stopped if you don't tolerate it.",
      "MessageIndex": 5,
      "PostDate": "17/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/850100",
      "Title": "Decision patti4511 DivineMrsM"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Oct 6, 2016 06:54PM pwilmarth wrote: Just wanted to introduce myself to everyone in the T-DM1 group. Just got results of my PET scan and there's been progression on Herceptin and Perjeta. MO tells me I will start on T-DM1, so I will be joining this group.",
      "MessageIndex": 602,
      "PostDate": "06/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 28, 2016 06:38PM - edited Nov 28, 2016 06:38PM by pwilmarth",
      "MessageIndex": 667,
      "PostDate": "28/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 5, 2016 06:41PM - edited Dec 6, 2016 01:36AM by pwilmarth DL3 and ESCORPION - Genentech recommends monitoring the following lab tests before each dose of Kadcyla: Liver Function Tests (AST/ALT) Bilirubin Platelet counts If there is an increase in AST/ALT or bilirubin or decrease in platelet counts, then your MO may decrease the dose or hold Kadcyla until your labs recover to normal and then restart at a lower dose. If your lab results increase by 4 times, they will stop the treatment (or your platelet count drops to less then 25,000) As far as PET scans go, the general recommendations are every 3 months for the first year and then every 6 months there after. I haven't actually seen any recommendations for yearly PET scans but that doesn't mean that a physician would not opt for yearly scans or more frequent scans based on your history. If there is a change in treatment your MO may increase the frequency (usually after two cycles of the new therapy) to determine if the new regimen is working. For some cancers, they are able to detect positive changes on day 14, and in clinical trials, the protocol may be to perform a scan on day 14 and day 59. My first PET scan was performed in FEB 2015 and the second was performed in APRIL 2015 - roughly 8 weeks after starting therapy. So there is room for a lot of leeway in determining when to perform a scan. Think of it this way - One Size Does Not Fit All Denny123 - just watched a video by a radiation oncologist at the University of North Carolina who quoted a rate of 50% of women with HER2+ MBC will develop brain mets. Supporting data suggests that 55 - 65% of patients being treated with T-DM1 will develop brain metastasis. Apparently some women experience a disruption in the blood brain barrier which allows T-DM1 to cross the blood-brain barrier, allowing T-DM1 to treat brain mets. Having just been treated for brain mets, I believe that all of us need to understand what the symptoms for brain mets are. My progression was caught on routine PET scan before I noticed symptoms. So without a PET scan or symptoms, a brain MRI isn't necessary. The Brain MRI is used for planning treatment (my radiation treatment was delivered by something called a TrueBeam machine, which uses computerized 3D mapping to precisely deliver radiation therapy to the cancer cells and to spare the healthy cells). Treatment took only 10 minutes under this machine. The following is a good reference to the treatment of brain metastasis Brain Metastasis TrueBeam Radiation Treatment After radiation therapy you are given your mask as a trophy for graduating to the next level",
      "MessageIndex": 689,
      "PostDate": "05/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jul 19, 2017 08:33PM pwilmarth wrote: Hi ladies. I just thought I would give a brief update since it's been about 3 months since I posted. Finished my 11 th dose of Kadcyla today. Had a PET scan last week and MO is very pleased with results. Last October, I had a PET scan which showed progression in the liver and bones (left hip). I finally started on Zometa in June after completion of dental work. There is no activity in hips or bones. Last week's PET scan showed only two tiny spots on the liver which continues to be an improvement from the previous PET/Scan. My last Brain MRI was essentially clear. I had another one yesterday and I'm waiting to hear from RO for results. AST is slightly elevated but remains between 60-70. My MO is very pleased with today's results. I'm keeping all of you in my thoughts and prayers and hoping that you all can achieve the positive results that I have on Kadcyla",
      "MessageIndex": 952,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "pwilmarth wrote: I don't how many of you watched the 60 minutes episode tonight. It followed the course of 5 patients who were being treated for a brain cancer with a radical new therapy using the polio virus at Duke University. The gist of the story is: a doctor has learned how to alter the DNA of polio so that it invades only cancer cells. This makes the cancer cell susceptible to the immune system activating T-cells and killing cancer cells. They have only had a few patients in a Phase I clinical trial, but the results were so astonishing that the FDA has fast-tracked this treatment so it can be available to everyone with this type of cancer. Patient Number One was a 20 year old woman who was in nursing school when she was diagnosed. Her prognosis was poor. She had all of the treatments she could for her cancer. There were no other options for her. Today, her cancer is in remission (I don't think they are quite ready to use the word cured) and she's finished nursing school. The second patient was a 74 year old retired cardiologist. His cancer is now gone. There's still a lot that the oncologists involved with treatment are learning, but this treatment has the potential to be used on every type of cancer, including breast cancer (the researchers thought it would be available for clinical trials within 3-5 years). Watching the journey for Patient Number One made me cry. It seems we are getting close to a \"cure\" for this disease using our own immune systems to fight the battle. When this becomes available for us, how many of you want to be Patient Number One? Patient Number One Dx 12/1/2014, Left, 6cm+, Stage IV, ER-/PR-, HER2+ (FISH) Surgery 1/12/2015 Mastectomy: Left Chemotherapy 2/24/2015 Taxotere (docetaxel) Targeted Therapy 2/24/2015 Perjeta (pertuzumab) Targeted Therapy 2/24/2015 Herceptin (trastuzumab) Radiation Therapy 7/21/2015 3DCRT: Breast, Lymph nodes Radiation Therapy 10/21/2016 External: Brain Targeted Therapy 11/25/2016 Kadcyla (T-DM1, ado-trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/844299",
      "Title": "60 Minutes and Patient Number One pwilmarth Beatmon"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 8, 2016 06:26PM - edited Aug 8, 2016 06:40PM by pwilmarth Procrit and Chemotherapy Procrit website Epoetin and Darbepoetin Treatment for Adults With Cancer It appears to be contraindicated in cancers of the bone marrow. PROCRIT should not be used for treatment of anemia: •If you have cancer and you are receiving hormones, biologic products or radiation therapy unless also receiving chemotherapy at the same time. •If you have cancer and you will not be receiving chemotherapy that may cause anemia for at least 2 more months. •If you have a cancer that has a high chance of being cured. •In place of emergency treatment for anemia (red blood cell transfusions). I can understand your concerns, but Procrit is often given to dialysis patients for the same reason - to stimulate the bone marrow to produce red blood cells. Patients receive it without adverse effects for years. So this is a quality of life issue. Do you take the Procrit and receive the benefit of increased red blood cells and more energy? Or do you decline the Procrit with the understanding that you are not going to feel as well as you could because of the anemia. I don't have an easy answer for you. But it's a risk-vs-benefits situation and only you can decide what feels comfortable for you.",
      "MessageIndex": 2,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846720",
      "Title": "Iron Infusion and Procrit--what to do?? Phoebegal Phoebegal"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 12, 2015 03:56AM pwilmarth wrote: The Marketplace is part of all the changes with \"Obamacare\". I'm sure that Michigan has something similar.",
      "MessageIndex": 17,
      "PostDate": "12/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 25, 2015 07:22AM - edited Dec 25, 2015 07:36AM by pwilmarth Don't worry about insurance. Once you have no income, you are eligible for Medicaid. Medicaid is the insurance provider of last resort. You will be covered by your employer's health plan, then be offered COBRA benefits, which you won't be able to afford. You apply for Medicaid, and everything gets billed to them. The way medical billing works is this: First your provider will bill any health insurance plan that you may have - either something you purchase or your employer provides, or workmen's comp if it's a work-related injury, or auto insurance if it's related to an automobile accident. If the bill is denied, then they bill Medicare if you have it. If Medicare denies the claim, then they bill Medicaid. There's only three questions you have to answer to be eligible for Medicaid: 1. Are you currently working? 2. Is anyone in your household disabled (why it's important to get SSDI approved because you can answer yes). 3. If you are working, how often do you get paid? How much money do you make with each paycheck? If you have no income, you are eligible for Medicaid. Be mindful of how much money you have in your bank account. You can't have a large amount of savings. You are allowed to own a home, even if it has a large amount of equity and you are allowed to own one vehicle to meet your daily transportation needs. The government is aware that most people need a car to meet basic transportation needs.",
      "MessageIndex": 40,
      "PostDate": "25/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837348",
      "Title": "Financial and Career Implications of Cancer LynnFish Lumpie"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jun 26, 2016 08:33AM - edited Jun 26, 2016 08:37AM by pwilmarth Stephanie Thanks for the link. One of the things that struck me about the OP's POV - and that is what she was expressing - is the anger she was feeling about the disease and coming to terms with it. So she hated the idea of journey. I'm not particularly fond of the War On Cancer metaphor and using The Battle perspective. I've never found fighting something that is part of me (and make no mistake, cancer is as much a part of me as my fingers and toes) as very useful for my overall mental health. I prefer to live in hope, love, forgiveness and positive thinking. I cringe whenever someone says \"You're so brave\". That's also a war mentality, but there's also nothing Brave about it. I have no choice. Cancer, chronic disease, old age, and death are part of what it means to be human. All of our ancestors experienced what it means to progress through these phases of life that make us human. So I choose not to comment on someone else's expression of what being human means to them. Each of us are at different places. If someone is at the anger, denial, and resistance stage, I let it be and let them express what is their reality. Over the course of time, as people adjust to their new reality, these words soften. But in the beginning, people want to think that having a diagnosis of metastatic breast cancer marks them as different or special from other human beings who are dealing with difficult realities of being human. We had a reminder just two weeks ago about how suddenly the \"journey\" can end in Orlando. From what we know, those were young, healthy people out celebrating at a local nightclub. They had no idea that their journey was about to end. Those who died had no chance to contemplate what it means to die. Those who survived are now on that path in their lives when they get to learn what survivorship means. And some of them will be sure to tell us their stories.",
      "MessageIndex": 92,
      "PostDate": "26/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818107",
      "Title": "MBC is Not a \"Journey\" Bestbird cliff"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Sep 15, 2015 05:15PM pwilmarth wrote: I'm just 61 and it would be sad if I had to limit my activities because of cataracts. I do pretty much what I want except for the driving. And thankfully, I still have good vision in my right eye. I think about both of my grandmothers, who had cataracts before surgery was an option. Thankfully, this is just a temporary setback and not something permanent. We take our blessings where they come from.",
      "MessageIndex": 8,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834820",
      "Title": "Cataracts?!? Huh? usafmom Heidihill"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 23, 2016 06:26PM pwilmarth wrote: Jenn, there's a simple principal out there that says: The antidote to fear is knowledge. If you are having symptoms, talk to your MO. That's the best person to help you rule out brain mets. I just went through treatment for brain mets a month ago. Yes it's scary, but the treatment is effective and you will feel better rapidly after treatment. And then you will have close follow-up from the radiation oncologist from that point forward.",
      "MessageIndex": 15,
      "PostDate": "23/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851383",
      "Title": "Vertigo? Brain mets? Afraid to know JeninMichigan txmom"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Sep 15, 2015 11:16AM - edited Sep 15, 2015 01:23PM by pwilmarth I am a nurse and these studies are not done from anyo other perspective than financial. They're not concerned with the value of a human life. New treatments are always expensive because of the cost to bring these drugs to market. So, if we're only basing treatments on costs, we all would be getting the drugs from the 1990s.. Because they're cheap. Currently, organizations like the National Cancer institute have determined that the standard of care for HER2+ metastatic breast cancer is THP, followed by H&P. That forces the insurance companies, as well as Medicare and Medicaid to pay for the treatment. Where patients who might benefit from THP are being shortchanged is the Stage II and Stage III her2+ cases. They have to progress to stage IV to get the best treatment available! Right now, there's many exciting advances happening in breast cancer treatment. When these treatments are approved for treatment, we'll be facing the same issues. Will vaccines only be available for stage IV cancer, or will it be used to treat cancer before it advances this far?",
      "MessageIndex": 2,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834983",
      "Title": "Study: It's too expensive to treat women with Perjeta scrunchthecat scrunchthecat"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 20, 2016 03:39PM - edited Nov 20, 2016 04:17PM by pwilmarth Some women do well on just Herceptin for years and then they have progression. Which means that the cancer has become resistant to Herceptin alone. About 3 years ago, they finished a study called the Cleopatra study which showed that women with de novo (never treated) metastatic breast cancer did well on a protocol using Taxotere Herceptin and Perjeta. They lived longer and had longer progression free survival than women who were treated only with Herceptin At about the same time they were doing studies with T-DM1 which also showed good results but wasn't better than Herceptin and Perjeta for first line treatment. So the standard of care became THP for firstline treatment and T-DM1 for women who progress on THP. What you will see is a mixture of women on T-DM1 because THP wasn't the standard when they were diagnosed with MBC and they have been treated with other treatment protocols. Plus they are still investigating ways to use T-DM1 with other drugs for HER2+ cancer that has shown resistance to current treatment protocols. I often refer women to the following link about HER2+ disease. The one thing I take away from this video is how upbeat and positive the oncologists are about treating this type of breast cancer. HER2+ Breast Cancer As far as the question about can you go back on a drug that was used in the past - that's a complicated topic as you can tell by the way the oncologists discuss it in the video. Clearly they are using Herceptin in T-DM1 to deliver the chemotherapy drug to cancer cells, but they are using it only as a mechanism to deliver chemotherapy to the cancer cell and not for its therapeutic benefit for the Herceptin. My understanding is that the T-DM1 has more Herceptin in it. As far as your question about ER/PR status - it doesn't matter in terms of being treated with Herceptin and Perjeta. They treat everyone with a targeted therapy for HER2+ breast cancer. It's just that the oncologists also have to consider the ER/PR status in their treatment plans. You will often here them talk about the Luminal status of women with breast cancer. I think the more difficult cancers are triple negative and Luminal B. Luminal A is easiest followed by purely HER2+ breast cancer.",
      "MessageIndex": 656,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 29, 2016 05:39PM - edited Nov 29, 2016 06:24PM by pwilmarth Escorpion: Well, I haven't had lung mets but I can speak to bone, brain and liver. I'll start with lung mets: When I was first diagnosed with metastatic breast cancer, I had just had surgery. My first PET scan was about a month later after the surgeon had cleared me for treatment by the medical oncologist. The PET scan showed a small liver mets and a small spot to the rib. I don't really consider that mets but a progression of the primary tumor into the rib as the surgeon told me he had taken as much of the tumor from the rib as he could and the margin was very small between the tumor and the rib. After the PET Scan in October, it identified one small spot to the left hip. I didn't start noticing symptoms until about two weeks ago, which is about a month after the PET scan showed the small spot. The two symptoms I noticed are Pain in the hip and back pain. We did labs last week and my calcium levels were normal. As they were at my last blood draw in September. The liver mets never produced any symptoms and my Liver Function Tests were all normal. After two rounds of Taxotere, Perjeta and Herceptin, the PET scan showed No EVIDENCE OF DISEASE and I stayed there until the PET scan in October. Typically you will see the following listed as symptoms of liver mets: •loss of appetite. •weight loss. •dark-colored urine. •abdominal swelling or bloating. •jaundice, a yellowing of the skin or the whites of the eyes. •pain in the right shoulder. •pain in the upper right abdomen. •nausea. As far as the liver goes, I still have no symptoms, and my Liver Function Tests were normal. But I suspect you would have to have significant mets to experience these symptoms. On my last PET scan (October 3rd), the PET scan showed two small spots to the liver and one small spot to the left hip as well as three small spots to the brain. After an MRI of the brain, my Radiation oncologist counted 18 small spots to the brain - which meant that I was headed for Whole Brain Radiation treatment. At the time of the PET scan, I had not noticed any symptoms to the liver or bone, but by the end of Radiation Therapy I was noticing some achiness to my left hip and some back pain to my left side. But I also have a history of an old back injury to that area from sciatica and prior to the bone mets, I would get flare-ups that were similar to the type of pain I am having now. Symptoms of bone mets are: As far as the brain goes, there were some things going on around the time of the PET scan in October that I didn't recognize as symptoms of brain mets. I also had high blood pressure and was on Metoprolol - a drug that is recommended for women on Herceptin to prevent declines in Left Ventricular Ejection Function as well as to control High Blood Pressure in women receiving Herceptin (High blood pressure is a common side effect for women on Herceptin). I had two episodes where I had visual difficulties and I could not read the computer screen because I had double vision. I took my blood pressure and noticed that it was sitting at 180/90. I thought I may have missed my metoprolol and I took another dose - which lowered my blood pressure and restored my vision. I also noticed that I felt a weird feeling in my brain - like I was wearing a hat on my brain - but only on the left side. I didn't have another episode for another two weeks which was about the time that the radiation oncologist was counting those 18 spots on my brain. In addition to this, I noticed that I was having trouble staying awake and I was having trouble concentrating on normal cognitive activities. I like to play fantasy football and during this time I was having trouble completing my lineups. After WBR, I no longer have this problem. The main issue with brain mets is that it's not the cancer itself that is impacting the ability of your brain to function. It's the pressure that the cancer cells put on normal brain cells that causes the symptoms. It's what the doctors call cerebral edema and cerebral edema can be caused by many things - including infection, trauma, stroke, bleeding into the brain, radiation therapy, brain tumors, and pre-eclampsia during pregnancy. So there's a standard set of questions you ask to determine if you are having cerebral edema: Do you have a headache that is not relieved by Tylenol? Based on my experience I would follow up that question with are you experiencing any abnormal sensations in your head or brain? Are you seeing any unusual spots in your eyes? Do you see shooting stars or fireworks? Double vision? As we got further into this I was noticing that some objects that I looked at for a long time (like this computer screen), would still linger in my visual field after I had stopped looking at it. Are you experiencing any numbness or tingling in unusual places in your body? For me, I noticed an area on my left arm and left leg that would have numbness and tingling that would come and go. Are you experiencing any balance problems or difficulty controlling what your arms or legs do? For me, I noticed that I couldn't always predict where my left leg was going to go. I also noticed changes in my hearing. The Radiation Oncologist said it was not unusual to feel like your head is under water - and that you are trying to hear things like they are under water. Nausea is a difficult symptom for me to recognize, but I did experience that from time to time. Here is a list of symptoms that you might also experience:  The good news is that once your medical oncologist gets the results of your PET scan, he or she will start you on steroids and every one of these symptoms will start to improve. Once radiation treatment begins, you will notice a rapid improvement in the symptoms One of the things that complicates your treatment when you develop mets to the brain, bone and liver is that the radiaton oncologist has to treat the brain mets first before they can begin treatment to the other areas. For those of us who will receive Kadcyla as our next treatment, this is because the drug can cause low platelet counts which can cause bleeding into the brain, which is something that neither the radiation oncologist nor the medical oncologist wants to see. So I was very happy to finally start Kadcyla on Monday.",
      "MessageIndex": 674,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jan 18, 2017 10:19AM pwilmarth wrote: Pasque - I receive Decadron with each Kadcyla treatment. Also in regards to the protein drink, you can do something simpler and less expensive. It's something dietitians recommend for cancer patients so I'm sure it's safe. Add nonfat milk powder to regular milk either 2% or whole milk depending on what you want. Mix it up well and refrigerate. If you add 1/3 cup of milk powder to a cup of milk, you will double the protein content of the milk, giving you 16 grams of protein per cup. This was something that I saw recommended when I was on Taxotere. It was really helpful when my appetite wasn't so great. I suspect you could make an eggnog recipe without the alcohol and achieve the same thing.",
      "MessageIndex": 742,
      "PostDate": "18/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Feb 3, 2017 10:41PM pwilmarth wrote: Hello ladies. Yesterday was my fourth dose of Kadcyla. Feel pretty good today, just dealing with that boost of energy from the dexamethasone. Anticipating the crash tomorrow. I've been fortunate with no issues with nosebleeds, but I do get the dry mouth. Use a mouthwash to help, and some wafers that stick to the roof of your mouth and help with night-time dry mouth. Still my favorite dry mouth remedy is lemon drops. Lemon is the best at generating saliva and it tastes the best of any of the other products. I've noticed loose stools come on between day 7-10. I've gotten good at anticipating and taking steps to prevent and minimize the effects - BRAT diet and Immodium during peak days. My labs have been good. Just had my first follow-up MRI for brain mets after Whole Brain Radiation Therapy and there has been a significant improvement in the cancerous areas - all much smaller. Radiation Oncologist feels they are dead cells, but we will be monitoring every three months for a year. As far as bone mets - all the achiness I was feeling in my hip is gone and I will have PET/CT scan at the end of the month to confirm what my symptoms are telling me.",
      "MessageIndex": 772,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Feb 23, 2017 07:11PM - edited Feb 23, 2017 07:12PM by pwilmarth Hello Ladies just had my fifth dose of Kadcyla. Last week's PET-CT scan was good news. We're not at NED or remission, but they are calling the disease stable. Which is okay with me. I do get pre-meds as well I was troubled by ankle pain from neuropathy about two weeks ago. Met with the Palliative care specialist and he increased my Neuorotin from 1200mg per day to 1500 mg per day. He also added 15mg of MS Contin once a day at bedtime. What a godsend the MS Contin has been. Mind you, I sleep a lot more, but the pain is practically gone! Also took up knitting again, something I haven't done in years and the distraction from the knitting has decreased my awareness of any discomfort. - I believe I will become on those church ladies that makes baby blankets, and hats for baibies as well as hats for women to pick up at The American Cancer Society!",
      "MessageIndex": 796,
      "PostDate": "23/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Jul 20, 2017 03:56AM - edited Jul 20, 2017 01:33PM by pwilmarth The symptoms of brain metastasis are similar to the symptoms of a stroke or swelling of the brain. That means feeling tired, having high blood pressure, numbness or tingling in unusual places on your body, and difficulty concentrating. Headaches that do not respond to mild pain relievers are also symptoms. It can also present with difficulty walking and balance problems. I had most of these within 3 weeks of spotting the micro-lesions on an PET/CT scan. So if you are getting regular scans, chances increase that the lesions will be caught before you have symptoms. And your MO will immediately refer you for an MRI. Senator John McCain, was just diagnosed with Brain Cancer, and it was found by CT scan. If you went to the ER complaining of these symptoms, they would order a CT scan. The MRI has more specific uses for treatment of brain metastasis. Here are a few YouTube videos from UCLA and the University of North Carolina on Brain Metastasis which may help you discuss this with your MO: Cancer Treatment for Brain Metastasis | #UCLAMDChat Webinar Brain Metastasis - Dr Tim Zagar - 2014 MBCN Conference at UNC Understanding Brain Metastases An Overview of Treatment Options and Care Guideline Good examples of symptoms It's been 8 months since I was treated for brain metastasis and nearly every symptom is gone. One of the confounding factors once you are treated is deciding if your symptoms are a result of the cancer or a side effect of the therapy. I have been left with some hearing loss in the left ear and it's not certain if this will clear by my one year anniversary. It has shown improvement since last November. This symptom started after treatment began when my head felt like it was underwater. So the answer to your question is to continue to communicate with your MO. Many doctors will send women for an MRI to ease the anxiety but I gather that you live in Canada or one of the countries that want to limit the expense of unnecessary MRIs. If you are worried, be the squeaky wheel and keep bugging your MO about your concerns. BTW radiation therapy for brain metastasis increases long-term survival two to four times longer. This has been known for 50 years. New uses of radiation therapy has improved this data.",
      "MessageIndex": 956,
      "PostDate": "20/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Sep 15, 2015 12:56PM pwilmarth wrote: Thought I would share this link Wide Range of Cancer Treatment May Produce Ocular Complications I was on Taxotere from February to May and noticed my vision worsened during treatment. I also was producing a lot of tears while I was on Taxotere, which impacted my ability to see. I never thought to mention the visual changes to my oncologist. After I finished Taxotere, my vision cleared in my right eye, but remained cloudy in the left eye. I scheduled an appointment with the optometrist and was diagnosed with bilateral cataracts last week. I'm scheduled to see the opthmalogist at the end of September for evaluation for cataract surgery. After reading this, I know now that it wasn't the Taxotere that induced or hastened my cataracts. It was the steroids I took with the Taxotere that was responsible. I don't think I would have been scheduled for cataract surgery any sooner. Because of the risk for infection while on Taxotere, I think we would have waited until I was done with chemotherapy. I just completed radiation therapy 3 weeks ago. Sometimes, we know more about our disease than the professionals we see. The optometrist I saw wasn't sure if the progression of the cataracts was related to chemotherapy, but based on this article, I'm certain it was. Thankfully, there were no signs of retinal damage or glaucoma. I'm just grateful that cataract surgery is available to correct the problem. The vision in my left eye does impact my ability to drive and work (have to increase the font on the computer in order to read the screen).",
      "MessageIndex": 6,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834820",
      "Title": "Cataracts?!? Huh? usafmom Heidihill"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 31, 2016 02:44AM - edited Aug 31, 2016 02:47AM by pwilmarth The Cleopatra study reported up to 8 rounds of Taxotere. When your oncologist says for as long as you can tolerate it, then you need to watch for symptoms of peripheral neuropathy. If you develop neuropathy on Taxotere, the hope is that it will get better or go away after you stop the drug, but that isn't always the case. I have peripheral neuropathy and have been off of Taxotere for 18 months. The damage from the Taxotere is permanent. If you don't stop the Taxotere soon enough, you could end up with the type of damage that impacts the quality of your life and limits your mobility and ability to walk and do simple things like type on a keyboard, or button your clothes. I don't mean to frighten you, but there was a story on Dateline about an oncologist in Michigan who was giving high doses of chemotherapy to patients without cancer. Many of them developed peripheral neuropathy that greatly reduced the quality of their lives. Instead of stopping the drugs, he would keep them on the drugs, while their symptoms got worse and worse. It was very sad to watch the damage that was done to these people by a greedy doctor who was administering these drugs so he could bill Medicare and the insurance companies. Eventually that oncologist was charged with murder and sentenced to prison. So I wouldn't say to stop the drug, but you need to be cautious if you go beyond 8 doses. And speak up and squawk if you develop any unusual sensations in your fingers and toes.",
      "MessageIndex": 9,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847397",
      "Title": "8 Rounds of Taxotere, Perjeta, Herceptin? Or not? rosetide rosetide"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 19, 2015 12:48PM pwilmarth wrote: Congratulations!",
      "MessageIndex": 43,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838598",
      "Title": "14 years! Denny123 pwilmarth"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 29, 2016 02:47PM pwilmarth wrote: Escorpion Thanks for the concern, but I was responding to cbd's concern regarding her headaches, which I didn't make clear. Fortunately I haven't had any problems with headaches, but I also take Tylenol, Vicodin, and Advil as well as Gabapentin for peripheral neuropathy and it would take a massive headache before I would notice it. I tolerated the Kadcyla treatment yesterday without any problems, but I never had problems with Herceptin before, so I don't expect anything negative.",
      "MessageIndex": 671,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 21, 2016 12:26PM pwilmarth wrote: I haven't but, but my MO wants to start after I have some dental work done - which is one of the risk factors for osteonecrosis",
      "MessageIndex": 2,
      "PostDate": "21/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/850333",
      "Title": "Medication-Related Osteonecrosis of the Jaw sharethehope MinusTwo"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Oct 12, 2016 04:05AM pwilmarth wrote: I'm living with MBC and I still walk my dogs everyday and I grow tomatoes on my patio - which gives me great pleasure. I work occasionally which keeps me involved and active in my profession, but eliminates the demands of a very stressful job that was decreasing my joy and happiness with living. I get great pleasure teaching people and this forum has given me one outlet for continuing this passion. Each of us are at different places in our lives. Some of us are still dealing with the sadness, anger and denial that comes with a disease that isn't curable, but treatable. Some of us are a little bit further into acceptance. And while some of us are still dealing with the emotional realities of the disease, some of us have overcome many more difficult life stories before we were hit with MBC. It isn't always easy thinking about my own mortality, but life is still good and I'm choosing to live life with as much joy as possible. I'm 62, and I've worked with many people who have passed away before this age. So any day I get on this earth is a bonus, a gift that I choose to spend wisely.",
      "MessageIndex": 24,
      "PostDate": "12/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/848731",
      "Title": "Quotes from you for MBC Awareness Day (Oct 13)?! Moderators dlb823"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 18, 2016 08:03PM pwilmarth wrote: Denny 123 - I'm very optimistic about the drug. I think I was one of the first women at my infusion center to be treated with Taxotere, H&P, so I may be one of the first to graduate to Kadcyla. But the reports on the drug are very good.",
      "MessageIndex": 653,
      "PostDate": "18/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 28, 2016 05:45PM - edited Nov 29, 2016 01:14AM by pwilmarth Today I'm at my infusion center receiving my first infusion of Kadcyla. The nurse did her due diligence and educated me to the side effects of the drug. Headaches are listed as occurring in 10 -29% of patients receiving Kadcyla. So it's a common side effect. I would just caution you to let your MO know because headaches can be symptoms of other things",
      "MessageIndex": 666,
      "PostDate": "28/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Nov 29, 2016 01:13AM pwilmarth wrote: This link is from breastcancer.org: Headaches There isn't a lot of information about reducing the dose for Kadcyla for persistent headaches. This is something that you would want to discuss with your MO because the goal is always quality of life with treatment for MBC and if headaches are causing you to have a decreased quality of life, it should be managed. But headaches are the cardinal sign for a number of diseases including stroke and migraines as well as swelling of the brain - which can be caused by a number of things either related or unrelated to your cancer. As someone who just underwent radiation therapy for brain metastasis, I heard enough about headaches either caused by swelling of the brain or radionecrosis. Which brings me to the second point - something called palliative care. Once you and your oncologist have ruled out other causes for the headache, you should consider palliative care - which means symptom management. Symptom management covers a broad range of symptoms, but improving the quality of your life by managing your headaches is something a palliative care team can help you with.",
      "MessageIndex": 668,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Dec 6, 2016 03:55PM pwilmarth wrote: ESCORPION As far as symptoms go, I wasn't experiencing any symptoms that I recognized when the PET scan was performed, but things started escalating after the results of the PET scan came in. So it's possible that your friend didn't have symptoms and it's also possible that her symptoms were so subtle that she didn't recognize them. Remember that one of the symptoms of brain metastasis is memory problems and decline in cognitive function so she may not be a good historian. As far as scans go, the medical oncologist uses three types of scans - bone scans, CT scans and PET scans. MRIs are used primarily by radiation oncologists to plan treatment - the mask you are given to wear is based on computerized 3D mapping from your brain MRI and to monitor your brain after treatment. You will be followed closely by the radiation oncologist every 3 months after treatment and you will have an MRI every three months afterwards. The radiation oncologist is checking for healing of your brain as well as monitoring for the return of any metastasis. Suffice it to say that you will become good friends with the radiation oncologist. As far as the treatment being painful - it is not. You hop up on the table of the machine and the radiation therapist positions you on the table with the mask in place. The purpose of the mask is to prevent you from moving during treatment because the machine is programmed to deliver radiation to the cancer cells avoiding the healthy cells. Then the therapist delivers your treatment, removes the mask and you are done. It never took longer than 10 minutes and it never hurt. And you start feeling better very quickly after treatment, within 3 to 4 treatments. Very often, a PET scan is performed with a CT scan, so it's not incorrect to think of a PET scan as also including a CT scan. The difference is the PET scan is detecting spots where cancer cells are utilizing glucose (or sugar) and the PET scan may miss a certain type of bone metastasis. It just so happens that breast cancer produces this type of bone metastasis, so your medical oncologist may prefer a bone scan over a PET scan or CT to detect this type of metastasis. As far as is it better to catch these things sooner - I would say yes because of the issue of quality of life. If you wait for symptoms to start, you also have to wait for treatment to kill the cancer cells, and for your body to heal, which means more pain and discomfort for you. But the treatment will kill the cancer regardless. It's just a question of how long it takes for you to recover. If you aren't having symptoms, it will take less time to recover.",
      "MessageIndex": 692,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Feb 3, 2017 11:19PM pwilmarth wrote: Yes, Biotene is one of the products I keep on hand.",
      "MessageIndex": 774,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 29, 2016 11:45PM pwilmarth wrote: Sorry to hear that you have joined us but we welcome you with open arms",
      "MessageIndex": 7,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847509",
      "Title": "Introducing myself - newly stage 4 Larkin artistatheart"
    },
    {
      "AuthorID": "pwilmarth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215061/profile",
      "Content": "Aug 22, 2016 08:12PM pwilmarth wrote: I always find your posts fascinating, and a good discussion for people who are unfamiliar with what dying looks like. I've spent the bulk of my career working with life and death - both at the beginning of life and the end. I know what it looks like, which for a good portion of adults who were not raised in third-world countries is very unfamiliar. But the question behind the question is: What does death feel like? Will I be in pain? Will I suffer? With good end-of-life care, you don't have to. Personally, on my own journey, I'm not close enough to think about what dying means on a personal level. But I'm fully aware that it is inevitable, and it will be peaceful.",
      "MessageIndex": 130,
      "PostDate": "22/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    }
  ]
}