{
  "AuthorID": "qutypy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76476/profile",
  "Posts": [
    {
      "AuthorID": "qutypy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76476/profile",
      "Content": "Dec 23, 2008 02:26PM qutypy wrote: Hi, I am scheduled to see the plastix surgeon on the 6th of Jan. Then surgery very soon after. I will be having a bilateral with reconstruction ( I think). I was diognosed with DCIS last Friday and have already seen the breast surgeon. original plan was a lumpectomy, radiation and bilateral mastectomy in June, but It will make me crazy till then, so I hope to forgo the lumpectomy and head straight to the other. Face the dragon as a friend put it. So off I go.... Good luck to you, and I hope we can stay in touch. Carla ",
      "MessageIndex": 11,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726161",
      "Title": "January Mastectomy crusader1 bettelou68"
    },
    {
      "AuthorID": "qutypy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76476/profile",
      "Content": "Feb 24, 2009 08:37PM qutypy wrote: I thought I heard them all, when a ditz I play maj jong said  \" oh, do you think you got it from your implants??\"  That just sealed the deal for me and her.....I have heard the most insipid, insensitive comments. I love the one about getting new boobs. I want my old ones back! The ones that are squishy and need an underwire bra....I realize some people just don't know what to say, I appreciate  that, I really do, but some people are just plain stupid....",
      "MessageIndex": 14,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729165",
      "Title": "Stupid Comments About Upcoming Mastectomy Shanagirl Kitt09"
    },
    {
      "AuthorID": "qutypy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76476/profile",
      "Content": "Feb 16, 2009 02:57PM qutypy wrote: Hi Diamond I had a bilateral MX after a diagnosis of DCIS late December. I had immediate reconstruction and am now recovering nicely 3 weeks post op.I decided not to do the BRCA test yet. I have no family history of breast cancer but decided to be done with any \"what if's \" I am very happy with my decision. I researched it to death and decided the odds of a recurrence were too high for my comfort level.",
      "MessageIndex": 10,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/728992",
      "Title": "Bilateral Mastectomy DiamondGurl Superwoman808"
    }
  ]
}