{
  "AuthorID": "R_healing",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112870/profile",
  "Posts": [
    {
      "AuthorID": "R_healing",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112870/profile",
      "Content": "Dec 31, 2010 10:05PM R_healing wrote: njwall - you have got some great advice here. There are tons of financial resources and if you start with Komen they can help you navigate to the next step.  Don't let money stand between you and your health. In addition, check out this organization www.networkofstrength.org/ - they are there 24/7 to listen and to help you, for FREE.  Remember, no matter how bad it feels right now in this moment, this moment will pass and things will feel better in another moment.  Do not give up and know that you are not alone, ever.",
      "MessageIndex": 19,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762696",
      "Title": "Need a friend njwall mamanmidwife"
    },
    {
      "AuthorID": "R_healing",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112870/profile",
      "Content": "Dec 29, 2010 04:05PM R_healing wrote: I am so glad to have found this thread!  I am in week two of my first really bad \"black hole\" experience.  My last round of chemo (#6 of 8) hit me hard, followed by a bad cold, needing to go out on disability (which I didn't want to do) and the holiday blues.  I had been pretty good up until this point but having a really hard time climbing out of the hole to a place of feeling better (physcially and emotionally).  Called my onc this morning after another emotional melt down to ask for antidepressants or something to help.  Not an easy thing for me to do but after I called I felt better just asking for the help.  And then I found all your wonderful words of wisdom - thank you all!",
      "MessageIndex": 19,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762437",
      "Title": "How do you turn bad days around? Arayasunshine69 faithfulheart"
    },
    {
      "AuthorID": "R_healing",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112870/profile",
      "Content": "Jan 1, 2011 08:31AM R_healing wrote: Dear abcd- It is so hard to hear the words and process what it means to your life going forward.  I too did chemo first and personally I am glad I did it before surgery rather than after.  I am not sure how all these amazing women go through surgery and then have to contend with chemo.  Seems so much harder to me.  Chemo gets harder over time but it is something you can do and there are a lot of drugs to help you get through.  I walk almost everyday through chemo - you can too.  Don't give up!",
      "MessageIndex": 4,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762756",
      "Title": "Your views are welcome abcd libraylil"
    }
  ]
}