{
  "AuthorID": "Rabbit_fan",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
  "Posts": [
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Jan 2, 2010 05:52PM Rabbit_fan wrote: Doe - don't be discouraged by the comment that since melatonin didn't prevent one person's cancer it has no effect on cancer.  In my opinion, that's no different than someone saying, 'I had chemo and I still got mets, so chemo has no effect on mets.'  I don't think a statement like that would go over too well.... There's some good info on the Life Extension website: http://www.lef.org/protocols/prtcl-022g.shtml#melatonin",
      "MessageIndex": 6,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/746152",
      "Title": "Melatonin lionessdoe lionessdoe"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Jan 3, 2010 01:00PM Rabbit_fan wrote: Doe - you're welcome!  A lot of people seem to be worried that information that's not backed up by a large-scale, double-blind, randomized trial gives people false hope.  Like Dr. David Servan-Schreiber and Dr. Keith Block both say, is it better to leave people with false hopelessness? Hang in there and do what you know is right for you!  Good luck with your colonoscopy (ew!).",
      "MessageIndex": 13,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/746152",
      "Title": "Melatonin lionessdoe lionessdoe"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Jan 3, 2010 05:23PM Rabbit_fan wrote: Carolyn, this is I'm sure way more info that you want at this point, but I'm posting it in response to patoo...  I still say get the Oncotype to help confirm your decision. Ki-67 was on my biopsy path report.  It is also part of what they measure when they do the Oncotype, but it is only one component of the Oncotype score, and they don't report it as part of the Oncotype report. Where people are ER+ and HER2-, some researchers are trying to use Ki-67 as a proxy for a test like Oncotype, because it is cheaper and something that is already measured during pathology.  I have seen at least one study where they propose Ki-67 cutoff of 14% to group people into lower and higher recurrence risk.  That's still research though, and hasn't been validated or put into standard practice.  I've also seen opinions where they say you should look at Ki-67 as more of a continuous risk measure rather than simply a high/low cutoff point measure. I think I googled just about everything on my pathology report, so that's how I came to be intersted in Ki-67.  When I pointed it out to my oncologist on my first visit, he hadn't even paid any attention to it.  I don't think they all look at it that much.  But I also saw an oncologist who is a researcher for a second opinion, and he brought up the Ki-67 and said that even though my Ki-67 was on the high side he wouldn't have put me through chemo either, with my low Oncotype of 11.",
      "MessageIndex": 5,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/746163",
      "Title": "Oncotype test opinions... ckm3ofhearts ckm3ofhearts"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Jan 3, 2010 10:00PM - edited Jan 3, 2010 10:01PM by Rabbit_fan jrlegal - You would want to look at all of the things on your path report when deciding about chemo or the Oncotype.  Your ER, HER2, grade, node status, tumor size, lymphovascular invasion status, and not just Ki-67.  Ki-67 is just an additional thing to consider.  Do you know yet what all of those other tumor measurements are?  What was your oncologist's recommendation?  I think I remember the Oncotype taking 10 days from when they get the tumor sample.  It probably tells that on their website. Edited to add - I don't know that Ki-67 is a standard measurement on all path reports, so it some people might not know theirs. ",
      "MessageIndex": 7,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/746163",
      "Title": "Oncotype test opinions... ckm3ofhearts ckm3ofhearts"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Nov 25, 2009 10:06PM - edited Nov 25, 2009 10:07PM by Rabbit_fan Me too!  I really appreciate that one of you will always give a sincere and very thoughtful answer to a question on this forum, no matter how silly.  Happy Thanksgiving! p.s., I'm talking about myself with the silly questions :)",
      "MessageIndex": 3,
      "PostDate": "25/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/744501",
      "Title": "Thankful for Binney, and this thread kira Binney4"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Jan 2, 2010 11:50PM Rabbit_fan wrote: For me the Oncotype was the easiest decision I made.  Chemo has always been one of my biggest fears.  My onc could only demonstrate a 3% chance that chemo would give me any benefit, but she recommended it anyway.  That means that she would give chemo to 100 people with my tumor characteristics, and 97 of them would have it for nothing!  I asked for the Oncotype and told myself I would go with chemo if I wasn't in the low risk category.  I came back at an 11 and was very happy to skip chemo.  Their strategy to me seems to be to throw everything at everyone because they don't know who needs it and who doesn't.  The Oncotype can help you find out if your one of those who won't get anything out of it.  I agree with cookiegal - if you don't come back in the low score group, since you're inclined to do chemo anyway you can still do it.  Then you will have more assurance that it's not for nothing. Do you know what your Ki-67% was?  Ki-67 is an indicator of proliferation.  Some people with a high Ki-67 can still have a low Oncotype score, and some researchers are theorizing that those people are the ones in the low Oncotype group who do recur.",
      "MessageIndex": 2,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/746163",
      "Title": "Oncotype test opinions... ckm3ofhearts ckm3ofhearts"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Jan 4, 2010 01:55AM Rabbit_fan wrote: Hi grama5 - From what I can find, p53 is a gene, and mutation in the p53 gene is an indicator of a more 'aggressive' cancer and potentially unfavorable outcome.  My path report said my p53 was negative with a labeling index of 5%.  So if they said yours was favorable I would guess that it was negative for the mutation.  I didn't look into this one as much because my result was OK.  Since my Ki-67 was high I did a lot of researching on it.",
      "MessageIndex": 10,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/746163",
      "Title": "Oncotype test opinions... ckm3ofhearts ckm3ofhearts"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Oct 3, 2009 07:22PM Rabbit_fan wrote:",
      "MessageIndex": 3,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/741397",
      "Title": "Is my therapist telling me the right thing? Rabbit_fan Rabbit_fan"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Rabbit_fan wrote: I've been having slight swelling in my armpit and first few inches of my upper arm.  I went to an LE therapist and she's calling it \"lymphatic swelling\" right now.  She said the one arm was 1cm bigger than the other, but when I measure it seems like and inch bigger.  She did drainage massage and gave me a 20/30 mm sleeve to wear.  She says I should wear it for a few months to see if it goes away, because she says she's seen that happen in a similar case.  She didn't give me a glove or gauntlet though - she said I didn't need it because my swelling was only in my upper arm.  I just read on this forum that you should never wear just a sleeve.  And that a sleeve that's too tight can cause LE.  It's all so confusing. I've been wearing the sleeve for two days and it does make my upper arm feel better, because without it the swollen area burns and feel irritated all the time.  I haven't noticed any swelling in my hand since I started wearing it. Am I doing the right thing wearing the sleeve only?  Does that seem like the right compression for someone with just a little swelling in the upper arm??? Any input would be appreciated - thanks so much! Dx at age 45 via screening mammo. Oncoplastic lumpectomy, radiation, tamoxifen. Oncotype 11-refused chemo. Cancer was my Jillian Michaels. Dx 4/2009, ILC, <1cm, Stage IB, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/741397",
      "Title": "Is my therapist telling me the right thing? Rabbit_fan Rabbit_fan"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Jun 26, 2009 12:46PM - edited Jun 26, 2009 12:52PM by Rabbit_fan",
      "MessageIndex": 4,
      "PostDate": "26/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736544",
      "Title": "Taking tomaxifen while going through radiation bqswnnhn09 1Cathi"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Oct 31, 2009 09:18PM Rabbit_fan wrote: hrf, I'm sorry too, about your second diagnosis and not having an easy time of it.  pickle - thanks for that thought about the woman being mad at herself for spending her years up to recurrance worrying about it.  I've been feeling the same way lately, but never quite put it in words.  Like the Carly Simon song - you never know, maybe \"these are the good old days.\"  I really want to work on enjoying what's still good and stop worrying.  I worried about cancer for years because of family members having it, and that didn't do me any good, I got it anyway.  So now I need to try something new - enjoying my life instead of fighting it.  I find myself living in the present a LOT more than I used to, so for me that's a positive outcome.",
      "MessageIndex": 47,
      "PostDate": "31/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "Rabbit_fan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85750/profile",
      "Content": "Oct 31, 2009 08:12PM Rabbit_fan wrote: I think this is a good idea too.  Stage 1 and 2 do have better odds of good outcomes but still have a lot of fear to deal with.  I think that would be easier in a place where you don't worry about upsetting someone with a later stage. I really feel like I've been on a rollercoaster for the last 7 months.  I come to the board and find stats that reassure me and I feel good, but I also come to the board and find research that shows something unfavorable and then I obsess over whatever that issue was for a while.  Most recently it was my tamoxifen metabolizer status.  But then today I noticed that someone (sorry, don't remember who) posted a link to an outcomes calculator - it showed that 15 years out I have a better chance of dying of something else than of cancer.  That really helped calm me down today.  I have made HUGE changes to my diet and don't feel deprived at all anymore.  I used to be completely addicted to junk food and cheese, and I really think it was an addiction.  I could never lose the extra 30 lbs. - I just couldn't stay away from the pizza and candy.  But I really feel like all of the cheese and sugar could have contributed to my cancer, so I feel lucky that I can change that maybe before it's too late.  I also kind of feel like I had such a lousy diet that I already ate my lifetime allotment of junk.  Every time I purposely eat something that I've chosen because it's healthy I feel really good about that.  At first I really looked forward to my weekly \"splurge\" that I was allowing myself, but I don't even focus on that anymore.  I also have more motivation to get on the treadmill and bike now, too.  My doctor really emphasized the importance of exercise, and told me that studies have shown exercise of I think 1/2 hour per day can cut mortality in BC survivors by half.  That's a lot.  Just today while I was on the treadmill I was thinking to myself, \"I'm fighting cancer!\"  It helps me be less lazy.  The uncertainty of outcomes and treatment effectiveness is really frustrating and consumes your mind so much.  For me working hard at healthy eating and exercise is a way of taking back some control over all of that uncertainty.  Guess I had a lot to get out today :)",
      "MessageIndex": 42,
      "PostDate": "31/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    }
  ]
}