{
  "AuthorID": "Rachel1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
  "Posts": [
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Oct 4, 2011 05:18PM Rachel1 wrote: I've got to admit, I really hate the pink crap also. I've got so much of it, I'm not sure what to do anymore. Some of it I did burn -- that somehow felt so good.  It was kind of like giving bc the bird. Rachel ",
      "MessageIndex": 67,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774174",
      "Title": "What to do about pinktober...yuch.. weesa Celtic_Spirit"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 16, 2013 08:03PM Rachel1 wrote: As someone BRCA2+ I think it is great that she is talking about it. Obviously it is an individual decision what to do before a dx. However, knowing what I know and after all I've been through, I wish I had known I was BRCA2+ before my dx. I certainly would have opted for the dbl. mastectomy and hysterectomy.  Rachel",
      "MessageIndex": 3,
      "PostDate": "16/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/804728",
      "Title": "Angelina Jolie SpunkyGirl Loral"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Sep 5, 2011 08:33PM Rachel1 wrote: I can so relate. I used to love pink. Now I hate it. I can't do the pink ribbon think. I have burned so many pink things I've lost count. It was quite cathartic. Wish I were closer so I could join you, but I'll be there in spirit.   Rachel ",
      "MessageIndex": 17,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774174",
      "Title": "What to do about pinktober...yuch.. weesa Celtic_Spirit"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Nov 6, 2012 09:11PM Rachel1 wrote: Yes, a suspicious ultrasound can NOT be cancer. I am one that had that happen. Now, I did have breast cancer in my rt. breast. A year later I was scheduled for a dbl. mastectomy with reconstruction (diep) as I am BRCA2+. My surgeon wanted a mammogram and ultrasound of both breasts just to be sure of what she was dealing with before my surgery. My mammogram was fine (must add that I had a clear mammo six days before I felt a lump, but I digress). The ultrasound found a small mass in the left breast. The radiologist said it was highly suspicious and didn't present as benign. My surgeon asked the radiologist for an immediate biopsy. He inserted the needle and the mass disappeared. It was a cyst.  I was sobbing for joy and the radiologist and nurse were emotional as well.  I totally understand being scared to death. But please know that suspicious or highly suspicious can also turn out to be nothing at all.  You are taking action and being cared for.  Big (((((hug)))) my dear. We're all sisters here!! Rachel 5/2010 IDC, 4.5cm, stage IIB, grade 3, 7+nodes, BRCA2+",
      "MessageIndex": 5,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/796012",
      "Title": "are 'suspicious' ultrasounds ever NOT cancer? scar3d2death Kareywith3littlekittens"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Dec 10, 2012 05:10PM Rachel1 wrote: Hi Pure,   I'd have to agree with your dr. You had everything removed and it went to pathology. For something to grow that quickly in 7 months doesn't seem likely. I had a diep a year ago. The scar tissue is constantly changing.  I'm suppose to keep working on it to keep it from getting hard and bead like. I actually have my physical therapist or DH do the honors. If I keep feeling around I freak myself out :-( Rachel",
      "MessageIndex": 5,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797461",
      "Title": "What are the chances? Pure Rachel1"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Apr 5, 2012 10:08PM Rachel1 wrote: I think I had Caaclark's surgeon.  When I asked about dbl. mastectomy she said we're more worried about mets.  A dbl. mastectomy wouldn't increase my odds of survival. Ah, thank you so much. (She obviously never heard of the placebo/nocebo effect). She also said no BRCA test. I was too old at dx.  My onc., however, fought insurance for the test -- and guess what?? Apparently I wasn't too old as I am BRCA2+  Needless to say, when it was time for the mastectomy I got another surgeon. Adios and don't let the door hit you in the rear. Rachel 5.2010 IDC 4.5, grade 3, +nodes and BRCA2+ ",
      "MessageIndex": 14,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785265",
      "Title": "What does/did your MO/RO/BS/PS say that made you want to scream? Momof2inME Wordwrangler"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Sep 19, 2011 03:49PM Rachel1 wrote: ((((((((((((Bobbie)))))))))),  Sending prayers and love your way. I am so sorry for your loss. Please know you and your family are in my thoughts! Hugs, Rachel ",
      "MessageIndex": 19,
      "PostDate": "19/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/775112",
      "Title": "Dave's Tribute SpunkyGirl apple"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 31, 2013 06:45PM Rachel1 wrote: Hi Pure, I have panic attacks and anxiety where it feels like I can't get enough O2. It's horrible. When I start to get that way, I actually have to remind myself to breathe deeply. I tend to breathe shallowly and hyperventilate, which then feels like I'm having lung issues.  And, I'm another xanax girl and in therapy since dx.  It's pretty revealing that you don't have these issues when you are sound asleep or involved in other things. If you focus on your finger throbbing, by God it will throb. When you put all your attention on your breathing, something is going to come up. However, when you take your attention off your breathing, things simmer down. This says to me anxiety.  Before my dx I had all these same aches and pains and never paid a bit of attention. Now I'm hypervigilant and can't tell which ache is significant. That for me is so difficult to deal with. It makes me cRaZy!! Rachel",
      "MessageIndex": 7,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/799724",
      "Title": "Is this syptom of Lung Mets? Pure HLB"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 28, 2010 04:10PM Rachel1 wrote: I was just diagnosed. I just cried through this song two times. I'm going to Fight Like a Girl.  Thank you. Thank you. Thank you for sharing this with me. Rachel ",
      "MessageIndex": 5,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753240",
      "Title": "FIGHT LIKE A GIRL barnest Rachel1"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Nov 16, 2011 02:37PM Rachel1 wrote: I have a friend who is HER2+ and 10 years out. She's doing great and never thinks about cancer. I just love her!! Whenever I start to worry about mets or recurrence -- she calmly tells me, just don't go down that road. Rachel ",
      "MessageIndex": 5,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778072",
      "Title": "Thread I started for HER2 Stage III'ers PlantLover antonia1"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Oct 21, 2013 03:27PM Rachel1 wrote: Hi Karina, I'm exactly the same way. I hate going and it doesn't seem to be getting better with time. My therapist says it triggers my post traumatic stress syndrome. I feel very frightened and vulnerable like everything is going to be taken away from me --- again. I'm working so hard to reframe my appts. I am doing this to take care of myself. Won't it be grand to hear the great news I'm expecting; but alas I haven't fully mastered it. xoxo Rachel",
      "MessageIndex": 4,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/813217",
      "Title": "Struggling emotionally for a check up Karina Octobergirl"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 28, 2011 06:33PM Rachel1 wrote: Hi there...  Latte, I am now 51, but was dx at 49 yrs. 11 months. Originally, the onc. and surgeon I saw at a teaching hospital didn't want to do the BRCA test. They figured I was too old. However, my local onc. thought it had been growing in my 40's and I made the BRCA insurance cut off, so he checked. Interestingly, I have no family history of breast, ovarian, colon or prostate cancer.  What gives?? I do have a hysterectomy scheduled for  next week.  I'm hoping and praying that it negative. I just had a clear PET/CT so can I dare to think all will be well?? Then I want to have the BMX asap. However, I just finished rads in December, so I don't know how long I'll have to wait. Hugs, Rachel ",
      "MessageIndex": 6,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763960",
      "Title": "Any BRCA+ women here? Rachel1 elmcity69"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: I just had a PET/CT last week and it was clear. But then the onc. told me I am BRCA2 +. So now I'm facing having a bilat. mastect. and my ovaries removed.  How do deal with this bit of news? Here I thought I was getting the dx behind me -- finished chemo in October and just finished rads in Dec.  I'm scaring myself thinking that I have this lurking genetic mutation that is just going to keep rearing its ugly head. Rachel IDC 4.5, grade 3, ER/PR+ and yes, nodes. Now BRCA2+  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763960",
      "Title": "Any BRCA+ women here? Rachel1 elmcity69"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jun 14, 2012 07:06AM Rachel1 wrote: Bump",
      "MessageIndex": 212,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Feb 15, 2012 08:16PM Rachel1 wrote: bump",
      "MessageIndex": 126,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: I'm not sure where to post this.  About a year after finishing chemo and six months after radiation (four months after the oomph -- and a month before my bilat. mastectomy with diep). I had a colonoscopy and endoscopy.  I had been having pain in my stomach. My colonoscopy was fine, but endoscopy showed an ulcer that was trying to heal. He did a biopsy and it did not show cancer. The dr. put me on dexalant -- which a year later I just started to take regularly. I thought maybe I could get by only when it flared. I had never experienced gut aches before this dx and chemo.  and am wondering if anyone else has developed an ulcer.  Mine is not h-pylori.  Of course, it scares the crap out of me every time I have an attack. I'm brca2+ on top of IDC grade 3 with node involvement and er/pr+. So I'm off to the races with every pain thinking liver mets., stomach mets., etc. My pain is on the bc and radiated side (right).    Thanks for any reassurance. Rachel  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787789",
      "Title": "Ulcer after chemo. Anyone???? Rachel1 Rachel1"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Nov 2, 2010 04:12PM Rachel1 wrote: Hi, my name is Rachel and I was diagnosed in May with IDC stage 2, grade 3, 7/23 nodes ER+/PR+, HER2- I'm on day 11 of rads and really starting to feel it.  My breast feels swollen and my nipple hurts.  Last week I had to have an ultra sound on my nipple because I could feel lumps. The rad. onc. freaked me out when I showed him. He immediately said the lumps were worrisome. When I told him I was scared, he said he'd be scared if he were me.  The ultra sound showed simple cysts perhaps due to fluid backing up from the lymph node dissection or from the radioactive trace the put into the nipple when the did the sentinal node dissection.  Anyway, that was a day from hell.  I'm also looking for node positive women who might want to be email pals. I live in a remote area of the Rocky Mtns. In fact, it is a six hour drive, round trip, for rad. treatment and I have to do 34.   Glad I found this board. TIA. Rachel ",
      "MessageIndex": 381,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 25, 2012 08:20PM Rachel1 wrote: I had biopsy, lumpectomy, SNB, then lymph nodes removed. Then we went right to chemo, then rads. Three months after chemo ended they did a PET/CT scan.  I've since had two additional CT scans because of having a diep reconstruction and a chest x-ray.  My onc. doesn't do scans yearly unless I have something bothering me.  He does blood work every three months.  I see my surgeon every 3 months as well. Although at the next visit it'll be 6 months. Rachel  IDC 4.5cm, nodes+, BRCA2+, ER+ ",
      "MessageIndex": 7,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781558",
      "Title": "Diagnostics: CAT, PET, bone density, blood tests .....? dltnhm dltnhm"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 25, 2015 09:06PM Rachel1 wrote: Thanks, Weesa. As I sit here freakin out with tears streaming down my face, I needed to hear from you. xo Rachel",
      "MessageIndex": 138,
      "PostDate": "25/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/815407",
      "Title": "Stage III Cancer Survivors .... 10+ Years and Out AlwaysHope karen1956"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Feb 19, 2012 06:32PM Rachel1 wrote: I knew about benadryl -- it was news to my onc. I checked that link -- please someone clarify -- is aspirin on it also??? Aspirin been getting press as a preventative to bc and I've been taking it, then I believe I saw it on the drug interaction list. Rachel ",
      "MessageIndex": 11,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782866",
      "Title": "No Benadryl or Tylenol PM While on Tamoxifen????? pupfoster1 JacquelineG"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Apr 6, 2011 09:12PM Rachel1 wrote: I'm so glad I came here, because I am 10 months out from surgery and I'm getting pain in the scar/lumpectomy site. It comes and goes. I've been more stressed lately and hold it in my shoulders and I'm thinking pecs. Anyway, it is a shooting pain. So, glad I'm not alone!!! Rachel ",
      "MessageIndex": 5,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767080",
      "Title": "Twinges and lumpectomy Thatgirl Rachel1"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jul 15, 2010 01:37PM Rachel1 wrote: Just got my hair cut into a short, short pixie cut. This was after my second AC and it had started to come out. I'm not sure if the cut will even last a week or if I should have buzzed it. I'm such a weinie. My wigs won't be in for another 5 days. They are of course all long hair. Which will probably be weird after short hair and nada.  I feel like a have a bell for a brain. It dings with worrying that the cancer will be terminated, to dinging about hair loss.  Urggggg. Rachel ",
      "MessageIndex": 1083,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jul 13, 2010 06:36PM Rachel1 wrote: Just finished my 2nd round of AC and feel like something on the bottom of a shoe.  Exhausted, head ache, depressed, nausea. My hair is starting to fall out -- flee for it's life--I'm also drinking (I've got a stomach ache) and not peeing.  Even my jaw hurts from clenching it.  This so **&^ucks. After first AC it seemed like I had a little reprieve of at least 12 hrs. Not this time.  Keeping you all in my prayers, Rachel IDC, stage 2, grade 3 pos. nodes, ER/PR+ ",
      "MessageIndex": 1049,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Nov 24, 2011 09:02AM Rachel1 wrote: Happy Thanksgiving!! Rachel ",
      "MessageIndex": 2,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778608",
      "Title": "Happy Thanksgiving Karina jennyboog"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 27, 2011 10:17AM Rachel1 wrote: I had a clear mammogram six days before finding the lump while doing yoga.  I then saw three dr.'s who all said it's fibrocystic and not to worry. One was my surgeon who had done a previous biopsy and he refused to biopsy saying it was nothing. After waiting and worrying for 7 months I insisted he remove it -- guess what??? 4.5 cm IDC grade 3 with node involvement.  I am so sad and angry. Why did I put myself through all those yearly mammograms?? Knowing I had dense breasts why didn't they ultra sound or biopsy?? Why didn't I insist on an ultra sound or have the dang thing removed instead of waiting and worrying for 7 months?? I so hope that Souad is right and that the universe reverses itself and gives you a great gift after a nasty kick. I am ready for a shower of gifts. Hugs to you all. Rachel ",
      "MessageIndex": 8,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764015",
      "Title": "How could I go for yearly mammos and end up with a 6.5cm tumour? Cat123 scuttlers"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jul 4, 2011 05:58AM Rachel1 wrote: Thanks Karen. I'll have to check him out. I think I'm having Stephanie Miller at Rose do the bilat. mastectomy.  Have you heard of her? Rachel",
      "MessageIndex": 4,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771114",
      "Title": "Looking for a great onc. in Rocky Mtns. Rachel1 Chava"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 2, 2012 05:03PM Rachel1 wrote: Will light the candle and send up prayers. All is well, all is well and all is well. Big ((((Hug)))) Rachel ",
      "MessageIndex": 12,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780329",
      "Title": "Hold Me Up Sistahs pupfoster1 thefuzzylemon"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Apr 24, 2012 09:09PM Rachel1 wrote: My nutritional onc. has me on 15,000 iu a day and vit . k to help with absorption. Rachel ",
      "MessageIndex": 8,
      "PostDate": "24/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786341",
      "Title": "Vit D levels dropping...Help!! faithfulheart faithfulheart"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: I'm trying so hard to stay positive. But I can't seen to hold it together.  Just diagnosed 10 days ago -- is it possible?  IDC stage 2, 2 nodes out of 6 positive.  I meet with oncologist Tuesday and then have a second appt. at the Breast Center in Denver to meet with a team. Every ache now, I think is an indication of cancer.  I've never been a glass is half full kind of person and I feel like I'm dying...and I fear I am dying and I don't know how to go forward. I have a 9 and 11 yr. old and I husband I love and I can't bear to hurt everyone.  I can't stop crying. Please tell me there's hope. Rachel  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753322",
      "Title": "I don't know how to do this.... Rachel1 coonie"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 21, 2011 06:15PM Rachel1 wrote: Hi Carla, Congrats. on a year and a half.  I'm a little behind you -- just one year also with 7 nodes.  I hear you when you talk about the dr. It's like they plant that little seed and wham you start to feel everything and doubt yourself.  Lately, everything hurts on me also. I think I am definitely suffering from Sherri's \"canceritis\" . I'm told it will get better.  You sound like you have a wonderful job! And, welcome to this board. Rachel ",
      "MessageIndex": 3,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769228",
      "Title": "Stage IIIA - One year & Half lolita85 lolita85"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Anyone know of a great onc. in the Rocky Mtn. region for my follow-ups. I just posted on the hormonal board, but here's my issue.  I just found out that trazodone reduces the effectiveness of tamoxifen.  I have been taking trazodone every night (sometimes 2 X's per night) since last June -- I started tamoxifen last Oct. --  and was never informed by my onc who prescribed both drugs of this interaction. Neither did he tell me that benedryl shouldn't be taken with it also. WTF???? I did have a hysterectomy in February -- so I guess that was a good decision. But still -- here I've been thinking that I had all this protection with tamoxifen!! Now, of course, I'm worried. Can someone help talk me down. Rachel DX IDC May 2010 grade 3 with lymph node involvement, BRCA2+ and ER+  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771114",
      "Title": "Looking for a great onc. in Rocky Mtns. Rachel1 Chava"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 10, 2012 07:20PM Rachel1 wrote: You are glowing and beautiful.  This is great!! Rachel ",
      "MessageIndex": 22,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Dec 11, 2011 11:29AM Rachel1 wrote: Congratualtion Queenie and msphil. Please keep the stories coming!!!!!!!!",
      "MessageIndex": 12,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779272",
      "Title": "just got home from mammo, 3 yrs NED! myrtle1 pupfoster1"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 30, 2010 12:24AM Rachel1 wrote: You are all such incredible women. I'm honored that you have reached out to me the way you have.  God, it's so weird. I don't know you. But I KNOW you all-- and feel such love for each of you. Thank you so much for being here for me.  I want to be there for all of you also. Love, Rachel ",
      "MessageIndex": 12,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753322",
      "Title": "I don't know how to do this.... Rachel1 coonie"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 29, 2010 09:32PM Rachel1 wrote: Thank you for your response. Just knowing that someone is out there is a comfort. I will be keeping you in my prayers during your surgery. I'll also try not to go to those horrible places.  Love, Rachel",
      "MessageIndex": 2,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753322",
      "Title": "I don't know how to do this.... Rachel1 coonie"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 30, 2010 03:11PM Rachel1 wrote: Hi CalypsoGirl, I will look up the Kids' Alive info. that you recommended. We haven't even told our kids yet.  Where do you have your treatment done and do you like your dr,'s? I'm going down to the Univ. of Co. Breast Center in Aurora on Wednesday.  I didn' t know where to turn. Do you know anything about them?  I live in WY. We have an oncologist who comes to town once a week. I'll see him on Tuesday.  Thanks for your help. Love, Rachel ",
      "MessageIndex": 17,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753322",
      "Title": "I don't know how to do this.... Rachel1 coonie"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: I am er+/pr- with 7 nodes + and IDC.  I came across an article that says we have a worse prognosis.  Are there any long termers out there?? Why is it a worse prognosis?  Rachel  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792909",
      "Title": "Any er+/pr- out there? Rachel1 ruthbru"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Sep 3, 2012 08:17PM Rachel1 wrote: I am so glad to hear what you all have to say. My onc. said I was IDC, 4.5 cm., grade 3, er+/pr- (however, he said he thought the pr was a false negative) and node positive. I'm not sure why my onc. thought that. I had told him that I had been using progesterone oil for at least a year before my dx. I had suspected that I was estrogen dominant and trying to balance things out. Will that effect pathology?  Then, my breast surgeon said she never heard of a false negative pr.  So for a couple of years I've been thinking I was er+ and pr+ because of the onc., but when the surgeon said she thought he was wrong, I kind of freaked.   I received dd A/C and dd taxotere x 8. I had 34 rads and an oomph. and bilateral mastectomy because I'm BRCA2+  Will an oomph help where tamoxifen won't?  I've been on tamox, for two years and begin an aromotase enhib. in October. I'm not doing metformin or zometa -- are other er+/pr- women doing that?  Thanks for the discussion. Hugs, Rachel ",
      "MessageIndex": 7,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792909",
      "Title": "Any er+/pr- out there? Rachel1 ruthbru"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Sep 5, 2012 05:17PM Rachel1 wrote: Are these the same white button mushrooms in the grocery store? I am taking dim 2 tabs twice a day. Thanks, Logan T.",
      "MessageIndex": 10,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792909",
      "Title": "Any er+/pr- out there? Rachel1 ruthbru"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Two weeks ago I was assured I had fibrocystic breasts. Now I have an invasive intraductal cancer with medullary tendencies (I don't even know what all that really means) stage 2 and had two nodes test positive (the sentinal and one attached) the other 4 or 6 that he took were okay.  I'm so frightened. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753208",
      "Title": "Please help Rachel1 mawhinney"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Hi all, I was dx in May of 2010. I had a lumpectomy was stage 2, grade 3 er/pr+, 7+nodes and brca2+. I did chemo, rads and had a mastectomy a year ago with diep reconstruction. Off and on I get pain in the scar area from the lumpectomy. They took muscle from the area -- lump was on the right at 5 o'clock -- very unusual area. No bc in muscle and clear margins.  My scar in that area is very tight and that changes with how much salt I eat, weight gain, lymphodema, etc.  But does anyone else get stabbing or shooting pain in their original scar area?  Thanks, I'm trying not to freak, but you know how that goes. Reaching for my xanax unfortunately. Rachel   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Hi all, I was dx in May of 2010. I had a lumpectomy was stage 2, grade 3 er/pr+, 7+nodes and brca2+. I did chemo, rads and had a mastectomy a year ago with diep reconstruction. Off and on I get pain in the scar area from the lumpectomy. They took muscle from the area -- lump was on the right at 5 o'clock -- very unusual area. No bc in muscle and clear margins.  My scar in that area is very tight and that changes with how much salt I eat, weight gain, lymphodema, etc.  But does anyone else get stabbing or shooting pain in their original scar area?  Thanks, I'm trying not to freak, but you know how that goes. Reaching for my xanax unfortunately. Rachel   Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jun 13, 2013 07:40PM Rachel1 wrote: Yes!!! Wonderful news, congratulations. May all your troubles be wee ones! Rachel",
      "MessageIndex": 27,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/806012",
      "Title": "In shock for a different reason - PREGNANT! Letlet kathleen1966"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 5, 2011 05:57PM Rachel1 wrote: Lindalou,  I love how you think!! \"Just remember ladies that positive nodes means a well functioning lymphatic and immune system doing its job, capturing and imprisoning those cancer cells that are trying to move out of the breast area.\"  I'd like this as a tattoo on my arm pit!!! I've got 7 out of 23 positive (to think 7 was once my lucky number) and I've been freaked by it. I just finished chemo AC/taxotere in October and 34 rads in December. I'm on tamoxifen. But this after the treatment stage has been HARD.  Thanks to all the ladies who have responded!! ",
      "MessageIndex": 34,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/755213",
      "Title": "Anyone out there with more than 10 nodes positive? TammytrustsGod margyc"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Has anyone used a penguin cold cap while going through chemo and do they work or am I wasting time and money on this? Thanks, Rachel  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/754548",
      "Title": "Penguin Cold Caps Rachel1 LuvUMom"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 29, 2010 10:01PM Rachel1 wrote: Thank you for your big hug. I can't believe the support. Now I'm crying harder, but it's because I feel so loved,by you ladies. Thank you.",
      "MessageIndex": 7,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753322",
      "Title": "I don't know how to do this.... Rachel1 coonie"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 7, 2013 06:51PM Rachel1 wrote: Thanks, GmaFoley. It helps to know I'm not alone. Hugs, Rachel",
      "MessageIndex": 2,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Hi all, I was dx in May of 2010. I had a lumpectomy was stage 2, grade 3 er/pr+, 7+nodes and brca2+. I did chemo, rads and had a mastectomy a year ago with diep reconstruction. Off and on I get pain in the scar area from the lumpectomy. They took muscle from the area -- lump was on the right at 5 o'clock -- very unusual area. No bc in muscle and clear margins.  My scar in that area is very tight and that changes with how much salt I eat, weight gain, lymphodema, etc.  But does anyone else get stabbing or shooting pain in their original scar area?  Thanks, I'm trying not to freak, but you know how that goes. Reaching for my xanax unfortunately. Rachel   Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: I had a lumpectomy in May 2010. I had a bilateral mastectomy with diep reconstruction two months ago.  I had clear margins at the lumpectomy site. They took muscle (right by my sternum) and it was clear.  All the pathology was clear two months ago. I also had two CT scans two months ago and all clear.  My issue is that I get pain in the same tumor site where they took muscle (and tumor).  It started after the bilateral mastectomy. How long do you feel scar pain after surgery?  Thanks, Rachel IDC, stage 11b, 4.5 cm, grade 3, lymph nodes, er+, brca2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778815",
      "Title": "Pain in scar area after bmx Rachel1 debbie6122"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Jan 18, 2013 07:01PM Rachel1 wrote: This is so odd to read this post. I have been thinking the same thing over the last 2.5 yrs. I'm a teacher and used to get everything and spend a few days of the year head in the toilet sick as a dog.  I hate to even let this out in the universe, but since chemo...I've been.....you know.   What gives?? Rachel ",
      "MessageIndex": 13,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/798181",
      "Title": "Colds, Flu, - not me, I had chemo clariceak beth1965"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Feb 27, 2012 12:51PM Rachel1 wrote: Diana-- Congratulations on 10 and here's to another 10+10+10+10.  I second and third what the others said.  Thanks for sticking around and being here for all of us.  I was dx in 2010 with 4.5 cm IDC grade 3, er/pr+, brca2+ and 7+ nodes.  You are my anchor. When I don't feel like working out -- I think of you.  God Bless. Rachel ",
      "MessageIndex": 15,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783260",
      "Title": "Diana50!!!!!! ck55 kimf"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Nov 20, 2011 03:49AM Rachel1 wrote: Bless those little mice. I can actually have a glass of wine -- yahoo -- popping a xanax sometimes just doesn't cut it ;o) Rachel ",
      "MessageIndex": 11,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Hi all, I was dx in May of 2010. I had a lumpectomy was stage 2, grade 3 er/pr+, 7+nodes and brca2+. I did chemo, rads and had a mastectomy a year ago with diep reconstruction. Off and on I get pain in the scar area from the lumpectomy. They took muscle from the area -- lump was on the right at 5 o'clock -- very unusual area. No bc in muscle and clear margins.  My scar in that area is very tight and that changes with how much salt I eat, weight gain, lymphodema, etc.  But does anyone else get stabbing or shooting pain in their original scar area?  Thanks, I'm trying not to freak, but you know how that goes. Reaching for my xanax unfortunately. Rachel   Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "May 7, 2016 02:44AM Rachel1 wrote: I don't know if it's falsodex, but I've got it big time. I can hardly speak at times because I start coughing. Mine is not improving either. I've been on faslodex since June. I keep thinking it wii go away as the month progresses, but nope. I make excuses at work or on the phone saying I have a cold or allergies. It's so annoying",
      "MessageIndex": 6,
      "PostDate": "07/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843739",
      "Title": "Faslodex cough? GoldenGirls Bluebird-DE"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Mar 23, 2015 10:39PM Rachel1 wrote: You said it so well. I feel like a lab rat too and know exactly what you mean about waiting for the shoe to drop. I'm worse at appt. time or even if I think of my appt. it's a constant struggle. Xo Rachel",
      "MessageIndex": 5,
      "PostDate": "23/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/829550",
      "Title": "Stage 3 anxiety fear of reacurrence Carolehebert RSS"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: my 6 month labs came Bach high in Alk phos. Dr. Wants to rerun them And a pet. He suspects liver and/ or bone mets. My serum calcium didn't change. I'm beside myself with tears and grief, please tell me what you think. Rachel Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832147",
      "Title": "Six month labs with high Alk phos Rachel1 sandilee"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Dec 10, 2011 06:57PM Rachel1 wrote: Congratulations Carol.  Such great news. Thanks for sharing. It does give us all hope!! I never knew I'd be so invested in other peoples scans, but it's like when one of us does well -- we all do well. Does that make sense? Rachel dx 2010 IDC 4.5 grade 3, node +, BRCA2+, ER+ ",
      "MessageIndex": 10,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779319",
      "Title": "All clear mammo for me too. caaclark eine"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Hi ladies, This is not a new sensation for me, I'd just like to know if I'm not alone. I'm 2.5 yrs. out from rads -- 35+ boosts -- also had a lumpectomy and then mastectomy of that breast. I still have soreness/tenderness under the breast along the bra line. I don't notice it all the time, but certainly when I press on the area doing a breast exam or when it's compressed when I'm bending over. Anyone else still having issues? TIA Rachel Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/803209",
      "Title": "Rib tenderness after rads Rachel1 jennyboog"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: I am on arimidex (10 months) and have been experiencing shoulder pain (top of shoulder radiates out from there) for the last three months. It is on the side that I sleep on-- putting all my newly acquired arimidex weight on. My husband, oddly enough, has the same pain on the side that he sleeps on -- opposite side from mine almost like we're book ends. My pain is on the noncancerous side. Has anyone else experienced this?? I'm so scared. I know arimidex causes joint pain and stiffness -- you should see me hobble out of bed in the morning. Please talk me down. I freakin hate this disease!! Rachel Must add -- the pain has kind of an achy burning sensation to it. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/812771",
      "Title": "Shoulder pain in noncancer side Rachel1 hopefour"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Oct 14, 2013 04:14PM Rachel1 wrote: As a huge anchovy fan, I say yummmo!",
      "MessageIndex": 10,
      "PostDate": "14/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/812771",
      "Title": "Shoulder pain in noncancer side Rachel1 hopefour"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Oct 21, 2013 04:28PM Rachel1 wrote: Thanks Hopefour, I still have the pain but only seem to notice it when my mind is not preoccupied with other things. Is that a good sign?? xoxo Rachel",
      "MessageIndex": 12,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/812771",
      "Title": "Shoulder pain in noncancer side Rachel1 hopefour"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Oct 13, 2013 10:22AM Rachel1 wrote: Thank you, ladies. It helps to know I'm not alone with AI pain. I have my regular 3 month onc. appt. this week and I'll mention it. I'm always afraid that they'll freak and want to do all these tests which will put me into panic mode and re traumatize me. I know that being proactive is best, but it sets off post traumatic stress like only you women would believe. Weesa, we did recently change out our mattress, but did not go with a high end. I need to rethink that decision and look into a termperpedic. I think it's interesting that you also had issues with your shoulders. I've also had knee problems, leg aches, elbow aches -- all since taking AI's. I look back so longingly at those days before bc when a pain like this was simply a pain that I would shrug off and say, \"oh, I irritated my shoulder. What an annoyance. Hope it heals soon, so I can work hard again.\" Now, I become traumatized. I hate that. It makes me feel like a victim to bc. And I don't want bc to take any more from me. Okay, the tears are starting to flow so I'll end here. Love you gals. Rachel",
      "MessageIndex": 5,
      "PostDate": "13/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/812771",
      "Title": "Shoulder pain in noncancer side Rachel1 hopefour"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Apr 12, 2013 08:58AM Rachel1 wrote: Thanks, proudtospin. Glad to know I'm not alone. I get bad muscle cramps from the node dissection down my breast. It happens when I'm stressed. Rachel",
      "MessageIndex": 2,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/803209",
      "Title": "Rib tenderness after rads Rachel1 jennyboog"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Apr 12, 2013 01:53PM Rachel1 wrote: HI Nancy, Thanks for responding. Funny how that works with knees. I've got bad knees and an elbow that's killing me, but I don't automatically go to the \"c\" word.",
      "MessageIndex": 5,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/803209",
      "Title": "Rib tenderness after rads Rachel1 jennyboog"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Sep 2, 2011 06:12PM Rachel1 wrote: I totally understand how you feel. I was a stage 2 at dx with 2 positive nodes. After a full dissection and another 5, they still said stage 2. I'm not going to argue. Now many docs. aren't doing node dissections after a + sentinel node biopsy. So I would think staging will be effected.  In fact, my onc. recommended I not have a full node dissection. He said it wouldn't change my protocol. My 2nd opinion at a university hospital said a node dissection was standard practice. Within three months of my dissection, the new reports were coming out saying chemo and rads were as effective.  Anyway, I relate to more ladies on this board because of the +nodes. But if my onc.'s want to call it stage 2 -- okey dokey, whatever. Hugs, Rachel ",
      "MessageIndex": 7,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774100",
      "Title": "Ok now I feel dumb... Letlet Yanyan"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Mar 2, 2012 07:47AM Rachel1 wrote: Checking in also. Hugs, Rachel ",
      "MessageIndex": 25,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783300",
      "Title": "Freaking out - questionable nodularity Shanagirl jennyboog"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Rachel1 wrote: Anyone else here not produce the protein for tumor markers. I was told at my last 3 mo. appt. that I don't produce the protein, so no marker test. My onc. only does labs. Should I be concerned about this?? What do your oncs. do to follow you? Thanks, Rachel  IDC 5/2010 4.5 cm, grade 3, 7+nodes, BRCA2+, oomph 2/11, bilat mx 9/11, tamoxifen  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785784",
      "Title": "Tumor Marker ? Rachel1 financegirl"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Oct 13, 2013 08:33PM Rachel1 wrote: Claire, Can you recommend a pillow top? I'll pick up arnica gel tomorrow. I make a killer putanesca sauce as well. Do you ever put tuna in yours? It's awesome. Rachel",
      "MessageIndex": 8,
      "PostDate": "13/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/812771",
      "Title": "Shoulder pain in noncancer side Rachel1 hopefour"
    },
    {
      "AuthorID": "Rachel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102700/profile",
      "Content": "Dec 31, 2011 03:47PM Rachel1 wrote: I think we all have these dark days when we think it's going to kill us. I did when I was first dx and I do now a year after treatment ended. (They node + thing in particular freaks me out.) When I'm feeling particularly low I look at the stage 3 women who are 5+ years out.  You can't argue with those thriving women. Death or mets might be one possibility, but so is living a long, healthy, cancer-free life.  I guess what I'm saying is you can dwell on either of those possibilities, the choice is ours what we select to embrace and energize. Bessie, great post. Thanks you. Our tradition on New Year's eve is to write our wishes, prayers, hopes and dreams on tiny bits of paper and tie them with a bow. Then at midnight we burn them.   I'll be sending up prayers for all of us that we have an abundance of good health and peace of mind. Happy New Year. Rachel IDC 4.5 grade 3, + nodes, brca2+, er+ ",
      "MessageIndex": 11,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780275",
      "Title": "Can we survive? CherylinOhio Josiekat"
    }
  ]
}