{
  "AuthorID": "Rafaela",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67679/profile",
  "Posts": [
    {
      "AuthorID": "Rafaela",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67679/profile",
      "Content": "Jun 30, 2008 08:26AM Rafaela wrote: I had a wire guided lumpectomy on 6/12 and just scheduled 2nd surgery for 7/10 to clear margins and remove sentinel lymph node. I'm concerned about having the SLN injection. When I asked the breast surgeon's nurse about if they numb the area before doing the injection, she didn't know the answer. I am a wimp when it comes to pain and very nervous about that part. I was also a wreck about having the wire inserted, but they gave me lots of lidocaine and it wasn't too bad. What is the standard procedure when you get the injection? I'm scheduled in nuclear medicine for the injection at 11and scheduled for surgery at 1:30. Can I insist on being numbed up before the injection?",
      "MessageIndex": 4,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705592",
      "Title": "Wire Excision biopsy painkillers ICanDoThis morning"
    },
    {
      "AuthorID": "Rafaela",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67679/profile",
      "Content": "Jun 29, 2008 12:02PM Rafaela wrote: I had a stereo tactic biopsy done in April. I told the tech and doctor right up front that I had a very low pain threshold. Both were women and couldn't have been nicer. The whole set up was really weird - you're on a table with your breast hanging thru a hole. I kind of felt like a car as they raised the table to work underneath. I'm a 34B, very small, so they had me put my arm through the hole to add some weight to bring the breast down more through the hole. After injecting the lidocaine and giving it a little time to work, they inserted the needle. I did feel some pressure and told the doc. She immediately injected more lidocaine. I was a little uncomfortable having to stay perfectly still for about 1.5 hours, but it wasn't horrendous. Once the lidocaine wore off, ice packs and tylenol worked fine. On 6/12, I had a wire loc lumpectomy. Believe me when I say that I was petrified of having the wire inserted. Again, I told them I was a wimp and had a very low pain threshold. The radiology doctor was great and said ok - I'll give you the whole syringe of lidocaine. I looked the other way the whole time. I was slightly uncomfortable when they took some more mammo shots after the wire was in. But it wasn't awful. I had asked the BS about valium before the procedure and was told no because I would be going to surgery after the wire insert and the anesthesiologist does not allow valium because he (anes) is not there in radiology to monitor. My advice - be very vocal about your concerns, pain level. tell them right from the get go. if you feel any pain during the procedure, you have every right to tell them to stop, give you more lidocaine and make you more comfortable. This site will give you lots of information and support from women all over the world. Prayers heading your way - keep us posted. Rafaela",
      "MessageIndex": 17,
      "PostDate": "29/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/707511",
      "Title": "Core Biopsy Pain Estepp suems"
    },
    {
      "AuthorID": "Rafaela",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67679/profile",
      "Content": "Aug 3, 2008 12:03PM Rafaela wrote: Me too - no rads for me. I had rads 20 years ago for head/neck cancer, right side and 6 months of chemo. From '04 - '06 had 4 malignant sarcomas in shoulder area - docs said most likely a post-rad effect. Had 3 surgeries over the course of 2 years. Not going to do the rads for the bc - my left side. With my past history, it would be my lousy luck to get complications to heart, lung, or chest wall. I've been for two opinions recently. Both docs are saying rads, then tamoxifen, BUT they can understand my decision not to do rads. With my dx, docs are saying reoccurance rate without rads is 20%. Yes, everyone is different and we do make our own decisions. Best wishes and good luck, Rafaela",
      "MessageIndex": 10,
      "PostDate": "03/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/718964",
      "Title": "I have decided NOT to do radiation... OrliNaaman burma"
    },
    {
      "AuthorID": "Rafaela",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67679/profile",
      "Content": "Jul 6, 2008 01:37AM Rafaela wrote: I've been reading this thread this afternoon and have a few ?s. I'm having SNB and clean margin lump surgery on 7/10. Minor when compared to mx. Had wire loc lump on 6/12. What do I need to know or have on hand for SNB? How long will it be before I can shower? How about shaving or deodorant? I usually wear a soft, molded type bra without wires which worked out just fine after the wire loc. How uncomfortable is it sleeping? Limits of range of motion? I'm off work the day after and plan to go back on Monday so I'll have the weekend. BS said maybe I'll need Monday off too. BTW - I don't relax or stay put very well, always too much to do. Looking for suggestions Thanks and God Bless, Rafaela",
      "MessageIndex": 15,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706721",
      "Title": "Toilet Items suggestions for after surgery Young79 Iamblessed"
    },
    {
      "AuthorID": "Rafaela",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67679/profile",
      "Content": "Jul 5, 2008 05:29PM Rafaela wrote: I had a wire loc lumpectomy on 6/12. Had local for wire insert with lidocaine. Didn't feel a thing other the the sting of the needle for the lidocaine. two hours later went to OR for lump and had twilight anesthesia - totally knocked me out, woke up in the OR at the end right before they moved me to post op. twilight anesthesia was great, out of OR at 3:30' left the hospital at 5. Better than general anesthesia for this procedure, cause no breathing tube needed.",
      "MessageIndex": 8,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708521",
      "Title": "Are you awake or asleep? snoopygirl karen1956"
    },
    {
      "AuthorID": "Rafaela",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67679/profile",
      "Content": "Aug 3, 2008 07:54AM Rafaela wrote: Hi Bette, I had re-excision and SNB last month. Surgery was on a Thursday, I worked from home Friday (I'm in inside sales), rested over the weekend and went back to work Monday. I typically work a 10 hour day, not because I have to, but because of what I do. I was a little tired at night the week after surgery, so went to work, then came home and rested. For the SNB incision, I had stitches inside, covered with steri-strips, then covered with a bandage. I took the outer bandage off in the shower, it came off easy when it got wet. Steri-strips stayed on for about 10 days. I'm sorry your boss is not understanding. Any other options there? Can you talk to someone in human resources or personnel? Rafaela",
      "MessageIndex": 5,
      "PostDate": "03/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/718949",
      "Title": "SNB recovery time bettelou68 bettelou68"
    },
    {
      "AuthorID": "Rafaela",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67679/profile",
      "Content": "Aug 3, 2008 12:47PM Rafaela wrote: Hi Bette, Before the surgery, I went to nuclear medicine to have dye injections to 'light up' the sentinel node during surgery. I had general anesthesia for surgery. They did re-excision to clear margins and sentinel node biopsy - two incisions. They gave me a script for vicodin to use as needed for pain after surgery. Listen to your body after surgery and rest when you can. Keep us posted this week. Good Luck and <<BIG HUGS>> Rafaela",
      "MessageIndex": 7,
      "PostDate": "03/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/718949",
      "Title": "SNB recovery time bettelou68 bettelou68"
    }
  ]
}