{
  "AuthorID": "raindeer121…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
  "Posts": [
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "Jun 9, 2015 09:00PM raindeer1217 wrote: Not sure if this thread is still active or not. I've been experiencing hip pain for a year now. It's been steadily getting worse. I had a bone scan 6 months ago and it came back clean. Drs say nothing is there. As the pain is keeping me awake tonight. Deep down I know something is there",
      "MessageIndex": 19,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789488",
      "Title": "Can bone mets be missed with regular CT and bone scans? foreverhopeful GoldenGirls"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "Sep 27, 2014 02:10PM raindeer1217 wrote: ps and now my silly shoulder is hurting me more regularly.  It's the oddest pain. Can't really describe it.  Bone mets can't possible invade/spread this fast right?",
      "MessageIndex": 2687,
      "PostDate": "27/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 6, 2013 06:43AM raindeer1217 wrote: Hello. Landed in the ER this weekend with possible blood clot as i coughed up some blood in the prior night and had a little blood in mucus the next day too. I had made a long car ride to Ct to visit friends. So I wasn't at my hospital. Thankfully cleared and went home after a gamete of test. However the ER did a chest CatScan. Upon my release they told me the radiologist found a 3mm nodular on my left lung. They said I should request a medical release and have my Dr's review the test. Tried to not worry all weekend but I did. I poked around the Mets IV site looking at signature i was stunned how many woman were node free/clear but had mets. Is this common?",
      "MessageIndex": 1363,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 7, 2013 11:05PM raindeer1217 wrote: Meet with my Oncologist, she pushed out chemo till 1st week in June, after she reviewed the radiologist report from the Lung CatScan. She said she was going to go to the breast cancer board on the 23rd of this month. Her words were its a slim chance but it's a possibility. The nodulars (2 small 3mm) are too small to Biopsy. She will review my case with the board and then go from there. Her words were no chemo no nothing if it's mets. The 23rd seems forever away. What the heck are the chances of this happening? 1.79cm er pr+ her2- nodes clear grade 3. Dr's reply was 10-20%. I am an insurance agent I don't like those odds.",
      "MessageIndex": 1374,
      "PostDate": "07/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 22, 2013 12:28PM raindeer1217 wrote: hi Everyone!  Well i got the call from my Dr. they aren't entirely sure whats on my lungs, a spot is evident as the other spot appears to be a node.  They've opted to push to chemo and do another scan in 3 months.  More waiting.  feeling very numb to this process and just want to get on with my life.  I am having intense anger and frustration this week not sure where its all coming from.  Not normally a person that lashes out or gets angry but man alive has my temper been quick this last week. ",
      "MessageIndex": 1456,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "Nov 13, 2013 06:56AM - edited Nov 13, 2013 06:57AM by raindeer1217",
      "MessageIndex": 1877,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "Sep 26, 2014 09:52PM raindeer1217 wrote: hello everyone.... imagine concerns and questions just like mine have been asked many times over but I am going to voice my concern and i would welcome any insight or direction.  The last 12-13 weeks I have been suffering from hip pain, at 1st it was just a little hitch in my giddy up it wasn't constant pain either. Even now its not horrible pain my hip or pelvic feels weak or unstable like my bone is brittle.  i do get pain \"flair ups\" . I tried to push it off as getting older (I am turning 37) and I am very active thinking i might be just feeling the woes of an  over and over used body that’s still out of shape from winning the battle with the red devil. Well a few weeks ago I took a fall on my mountain bike and broke my pelvic bone (had a cat scan that found two Olvusion factures). The fall wasn’t awful and it was at low speed so when the ER dr said I had broken my pelvic on the same area where I've been experiencing the hip pain for several months it surprised me and concerned me.    I’ve taken way bigger and harder falls in the past and never broke anything. I received a call yesterday from my primary Dr saying she has contacted my Oncologist to \"consult\" on my hip pain.    I am going in for Xrays this week. When I took the bike fall they only did Cats can for softtissue so Mets wouldn’t show up on the scan (is that true?)  I've read that X-rays don't always show bone mets either.    Guess I am just worried that being I am so young and I didnt have node involvement with my cancer that my Drs. will brush me off.   I am also getting shoulder pain too, which just started this week.   I am not on any hormone treatment, I opted to not take the drug for the side effects.  So the hip discompfort isn't drug related. Would you mind sharing your experiencewith Mets and your DX? My tumor was 1.9cm, with several smaller clusters (5 to be exact) of other cancer tumors.  The largest had vascular involement (not really sure what that means) but no node involvement. I am worried that the Xrays won’t show the mets and myinsurance won’t pay for a bone scan which i guess is much better at early detection.   I am feeling gun shy which I am sure is normal and I don't want to worry that every ache and pain is \"mets\" but I am feeling really uneasy.  Thank you for your time. Rain.",
      "MessageIndex": 2680,
      "PostDate": "26/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 8, 2013 03:04PM raindeer1217 wrote: hello.  Thank you ladies for your passionate replies! Very Much.  I should of clarified my Dr's words.  She said that IF its Mets the chemo plan that she had in mind is off the table and treatment course will change.  Not no treatment. She was implying no treatment till they can further evaluate.   She has opted to hold off on my originally planned Chemo Start Date which was the 16th until she can bring my scans to the Breast Cancer Board/Panel that meets on the 23rd.  She has not said it's mets.  She has said that she and the radiologist are \"concerned\" about what they see on the images as was the radiologist in CT that did my scan as I was visiting friends and landed in the ER with possible blood clot to my leg).  So thats three Dr's so far that were \"concerned\" My Dr is reaching out to the panel for additional review, which I am grateful for.   Sorry I didn't mean for my post to sound so daunting. I am worried and hate the idea of waiting two more weeks for what the panel sees, but really its a good idea to make sure all avenues have been looked at to make sure I am getting the correct kind of chemo.    Thank you for your fierce and protective replies! I so was getting a second opinion on my own regardless when I was told the news about the scan. One thing I am learning quickly is you've got to take control of your treatment. Thank you, L",
      "MessageIndex": 1381,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 6, 2013 06:45PM raindeer1217 wrote: Merlcat- they say that woman that battle BC come out stronger mind and body..... however they also say that after the battle is won often woman are left to battle yet again. PSD. After reading so many victorious warrior's post!  I've found that in time most have found a way to live with cancer being part of their lives. Talking about fear is helpful and this is the perfect place to come and talk or type! Barsco- Thank you for taking time to reply, I admire you for where you in your journey and that here you are reaching out to someone else.  Your smile is beautiful! jjl- holy crap! thank you for the post can't imagine being where you are. Re-occ after 1 year. Forget my worries! How are you doing?!!!  As for my nodes they came out neg. I don't have a lump. Well no thats not true my nodes are swollen in the my non-cancer side i chose a double BMX with TE's.  My left side the nodes where removed or at least the 4 in my armpit. they all came back as neg. I am worried about the Nodules they found on my lungs but after reading more (still learning how to read post and move around in the flow if this website)  i'am seeing that many woman get lung test and get pos hits on test but it doesn't mean its indicative to mets.   Thank you again everyone for the replies.  Love the feelings and caring that run on this site! -Rain ",
      "MessageIndex": 1369,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "Nov 13, 2013 06:54AM raindeer1217 wrote: Hello posting lightly over here, hate to complain when I should feel grateful but I am not feeling well I'am 7 weeks out and hit the ground running. Hit a wall yesterday. Not feeling well, can't put words to it really. Little disoriented, tired, strange catch in my lungs, headache very ache. My vision in my left eye seems \"dark\" like I am seeing a shadow. It's not a cold or a flu. Any insight would be helpful. Tried googling it but my symptoms are too great.",
      "MessageIndex": 1876,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 6, 2013 01:51PM raindeer1217 wrote: Katie! Hi and happy Monday! Thank you for the reply. Helped tons! Your description of travel with mask gloves wig n fake boobs made me laugh, phew. Hope your public appearance went well I admire you for forging forward and making a public appearance. Curious if you ended up going wigless? I'll be watching for future post from you. With Care Rain",
      "MessageIndex": 767,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 6, 2013 02:01PM raindeer1217 wrote: Irene hello fellow Vermonter. I say yes go on FB and blast it out. I had a hard time making that decision to come out in FB as I've been in 8 months of negotiotions to sell my business and become a manager of a like much much lager business. Then cancer dx came out of the blue. Thought for sure the sale and the new job would be nix'd. To my great surprise my new boss and purchaser is understanding! So my point in this... This time is about you at this moment you do what you need to, to get thru it. FB posting help blast out to loved ones quickly. Helps keep the constant phones calls and you having to re-detail the same info over and over. Lastly, lovelove love the idea of a head shaving party! Fabulous! Wishing you nothing but the best!",
      "MessageIndex": 768,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "Sep 27, 2014 02:06PM raindeer1217 wrote: Chrissy and Sandilee - thank you both for sharing and replying. I called my Oncologist yesterday and my primary Dr also to see what they discussed in their consultation. No return call.... I fought the urge to call again and pester them. I not a push or needy patient so I can't imagine why they are brushing me off. Hope to heck no news is good news and they aren't avoiding me because they want to give me one more weekend before they rock my world. (Sigh)  Woke feeling really good this morning almost no pain and I even rode my MTBike last night on easy side trails, thought huh maybe the pain is gone? Tonight helped a friend move so lots of up and down stairs moving walking. My husband was pretty insistent I take it easy. Saying rain don't over do it. Na na I am all good I feel great! Yay!' Come home sit relax make my way up stairs to bed. Oopphh feeling stiff in my stupid hip. Ouchie just a little. Lay down start feeling the \"ache\". Why does it get worse stopping vs with activity or vs vs other days? Well it's almost 1am and now I can't sleep.  What did your early pain feel like? Are you ladies in bad pain ?  Thank you for your time. Rain ",
      "MessageIndex": 2686,
      "PostDate": "27/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 2, 2013 05:23AM raindeer1217 wrote: Katie love your quote! How are you handling chemo? I start in a few weeks. It hasn't hit me yet..... (dundun-dunn) scary background music playing. I put on a good front but in all honesty scared numb. Glad I found this site and the warriors that unite! -Rain",
      "MessageIndex": 695,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 2, 2013 05:36AM - edited May 2, 2013 05:39AM by raindeer1217 Hi. Still learning the ropes of the boards not sure how or where to post. (sorry) I start chemo in a few weeks, I am also suppose to start a new very stressful job June 1st. Short run down. I am selling my insurance agency which has been in negotiations for 8 months. Expected closing was May 1st. I was then hired as a commercial lines manager which was supose to start May 2nd. Well cancer Dx messed it all up. (grumble) holy crap!!! Amazingly my new job says they still want me!!! Sick n all!!! (hooray!!) My question is. I am starting chemo soon. Is working a full-time stressful job going to be possible?! Ahhhhhhhhh!!!!",
      "MessageIndex": 696,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 6, 2013 06:57PM raindeer1217 wrote: Hello Heather My heart goes out to you. The unknown is scary. Are you having expanders at the time of your BMX? If so in my opinion the expanders elevate the pain level some. They are hard and uncomfortable. I am a very suborn independent athletic (extreme sports) woman and I needed help after my double BMX with Tissue Expanders. I am sure you could get the job done on your own emptying the drains but girl you'll be very sore the 1st few days, full time help would be a great for those few days. The drains are daunting and scary and yep kinda gross and uncomfortable but do-able. Take any and all help offered to you! Good luck!",
      "MessageIndex": 776,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "Jun 15, 2013 03:44AM raindeer1217 wrote: Thank you for sharing this Andrea! Going to take care with this.",
      "MessageIndex": 3,
      "PostDate": "15/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806123",
      "Title": "A-C Hand Foot Syndrome and prevention NewHopeAndrea Spookiesmom"
    },
    {
      "AuthorID": "raindeer121…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174857/profile",
      "Content": "May 2, 2013 06:11AM raindeer1217 wrote: Carol, thank you for the reply. Helpful indeed. Amazing how even when our health is at risk we still freight the little stuff. Or at least I do. I've gained weight the last month due to not having normal intense cardio exercise.... Surgery will slow ya down! Ha. Then I freight over how my breast look and how much the expanders hurt... Then worry about work... The list is endless. So thank you Carol for your reply post. I need to focus on the number 1. Getting healthy and well. The rest won't matter if I get more sick. Hope your next round treats you kindly! -Rain",
      "MessageIndex": 698,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    }
  ]
}