{
  "AuthorID": "Raineyb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
  "Posts": [
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Feb 21, 2013 12:19PM Raineyb wrote: Good for you for being honest with your feelings- hiding things that are eating you inside will destroy you. Trust me, i feel you. I used to get panic attacks all the ime before i got sober from drugs and alcohol, and they were so scary.  Dizzy, thought i was having a heart attack.  That was 5 years ago.  I started having them the other day after i was told i needed a biopsy.  I am in hell over this, and today is the today i am supposed to get the phone call with the results.  I am actually not going to answer the phone, because i am so afraid of what will happen to me phsyically if it is bad news( like a panic attack of the worst kind).  But get those ugly feelings out and be honest.  I even told God i was upset with him for going through all this.  He can handle it, and everyone else understands.  Go read my post to see my feelings if you want.  It is \"I have microcals and i am sick with fear\". my feelings are pretty horrific.  I am happy you are okay.",
      "MessageIndex": 33,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/799640",
      "Title": "I think I had my first panic attack...:/ Yell1724 Raineyb"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Feb 19, 2013 07:03PM Raineyb wrote: I am very worried, you are right. It is because i found a small round moveable bump inbetween my armpit and right breast a few days before Christmas and flipped out.  The earliest i was able to get into an OBGY was February 5th-so i had to panic and wait that whole time.  She said the lump felt like a lymph node, no big deal, but i could go get a mammo if i wanted to ease my mind.  SO that was scheduled for Feb. 15th-more waiting.  And i was convinced that after that i would be free of this and feel happy again.  And then they found the calcifications, and said i needed to come back Monday for a biopsy. I lost it, just hysterical crying, and they really didnt tell me much else.  So the whole weekend, all i did was read and read and read, and hypervenilate, it was just awful.  My fiance went with me on Monday, and the staff tried to start immediately and i said i needed to tak to the doc first.  I would tell him i read about the birads, and he would say, yes you are a category 4.  I asked if the 3 subcategories were correct, he said yes, i put you in the second, because i truly do not know anything.  We asked more statistics, if he had seen this before and what the outcome was, anything-anything to help us, and each time it was just \"We don't ever know unless we do this.\"  And he even talked weird.  I said \"How often are what i have cancer\". He said \"Some times i see alot of cancer in what you have.\" So i cry and then he says \"But what you have, i see a 70-80% benign rate\". So i am just confused. His wording sucked. My fiance is also very to the point, a man of few words, and when we left he was like \"Man that doctor really didnt say anything. I thought i was emotionless!\"  I also do not have any history of breast cancer in my family.  I have always been in good health.  I have been getting a lot of colds lately,but i thought that is because i just moved from the Hill Country in Texas to the state of Washington and the total climate change. But now i am analyzing every second of my life. I do not think i will have the strength to answer my phone.  Life has really run me down these past few years, andthen this happens. Its the worst i have ever felt in my life.  I am very scared for myself if its bad, because i can't fight anything.  It will destroy me emotionally.  ",
      "MessageIndex": 4,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Feb 20, 2013 04:27PM Raineyb wrote: i took my phone apart. cant decide if i am going to put it back together. i am not ready for the phone call. the only time i feel peace is when i am sleeping and sometimes with my darling daughter, and now i am haing a hard time with that.",
      "MessageIndex": 10,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Feb 22, 2013 11:55PM Raineyb wrote: You are all stronger than I.  I will hang around and be there for people on these boards.  I wrote a facebook post about it, in hopes my friends will read it, and maybe even share it.  If you want to read it, here is the link.   https://www.facebook.com/notes/rainey-boll/some-info-for-20-30-something-women-about-your-boobies-start-checkups-now/10151438649884020",
      "MessageIndex": 36,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Raineyb wrote: I finally decided to post.  I am miserable. I am 31 years old with a 2 year old daughte who is my world. I had a mammogram on friday february 15th bc i found a small lump near my armpit.  Doctors said it is a regular lymph node, nothing to worry about at all. But they found microcalcifications on my right breast. I was told to come back for biopsy on Monday the 18th.  I had the whole weekend to e scared to death, crying at least once an hour. At biopsy, i literally asked every question imaginable to my doctor, and i could get absolutely nothing out of him.  I am a wreck.  I have stressed myself into the flu.  I am angry, and i have the worst feeling about what the results will be.  I was positive up until this point, because it seems to not be worth it, plus i do not have the energy.  I am a Birads4, which i found out by asking and put in the second category because the doctor kind of puts everyone there, because he is never sure.  His vagueness angered me.  I find so much info, sometimes it makes me feel better, sometimes i start bawling.  All i want to be is a mommy to my angel daughter, and i am just so scared. Does anyone have any legitimate statistics on what i am going through?  I have never been so upset in my life- i need help-not just nice words, even though they help too. I am supposed to get the phone call on Thursday.  Please help me. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Feb 20, 2013 12:26PM Raineyb wrote: Without getting in to detail, i will say i have had a pretty tough life.  It is kind of a joke between me and my fiance, that if things are going to go terribly wrong, it will happen to me.  I have been dealt so much painful stuff, and when i had my daughter, i finally felt like it was all done.  I felt my purpose, i felt God, i felt joy like i never have before.  Being a mom is truly my calling-and i am great at it.  That is the only thing i can say i am truly great at.  And now i feel like if that is jeopordized....i won't be able to handle it.  I wont understand anything anymore.  I have been through too much- instead of fighting, i can see the great depression.  I am already in it.  I am thinking about throwing my phone in the toilet \"on accident\".  As i said, i moved across the country, my parents and family are all in Texas.  I do not know anyone in this town, and my fiance went back to school when we got here.  Right now i do not know if i am more scared to be alone, or if i am more scared to be around people and attempt to act okay.  All i know is i have to be healthy for my daughter.  That is all i want. More than anything i have ever experienced.",
      "MessageIndex": 8,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Feb 20, 2013 08:27PM Raineyb wrote: i am very depressed.  I have almost 5 years sober, and let me tell you, right before i got sober, i thought i was depressed.  That was a cakewalk compared to this.  I took a nap earlier, and i woke up kind of out of it, and thought it was morning, and instantly started crying because i thought it was the bad news day.  I just know that if it is bad i will not be able to go forward.  I would not be able to handle it emotionally.   ",
      "MessageIndex": 12,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Feb 21, 2013 02:27PM Raineyb wrote: I called the doctor and told them they did not need to call me because i am not ready for any information they have to give me, but i will come by and get my medical records one day if i ever get ready. I cant do it.  I am going to die from anxiety first.",
      "MessageIndex": 21,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Feb 21, 2013 04:23PM Raineyb wrote: when i called the first time to tell them that, the woman i needed to give my message to was not in, so they said to call back.  So i did, and i was crying as  i told her i would like to be able to just come by and pick them up one day when i had more strength.  She said to hold while she went to check if they were even done and if the doctor would approve that.  When she came and picked the phone back up off hold, she just yelled \"THEY ARE BENIGN!!!!! YAAAAA!!!\". Of course, i just started dying crying from joy, and she was giggling and she said \"I am so sorry honey, but you sounded like you were on the verge of worrying yourself into a grave and i saw the good news and had to tell you!\" i just fell in my fiances arms crying and he was really happy and relieved too. I must say that you are all much stronger people than I am.  And you are so unbelievably kind. If i was able to send a gift, or a card, even flowers directly to each one of you, i would in a instant. But all i can say is thank you from the bottom of my heart for listening to my whining.  People like you who offer expreince, and strength, and hope are what makes the world a better place. I cant even begin to explain how grateful i am for you, i will pray over each of you, and i believe you are angels. I am trying to figure out how i can be of help to others after going through this hideous mess. All i can really think of right now is maybe trying to explain to people, especially younger girls my age, what breast calcifications even are.  Because until this i had never heard of them.  I thought, if you feel a lump, you need a checkup. I did not know their were ones you couldnt even feel.  So i am going to do my best to somehow inform girls of that. I also worry, because had i not found that original lymph node, i wouldnt have had a mammogram, because i am 31, and women don't really start them until age 40.  If these calcifications are capable of being the earliest form of cancer, and women can get them at my age....alot more cases of cancer could potentially be caught early.  I think that is a problem, and i want to look into that.  I believe with all my heart that women and children are the most valuable sould, should be informed and have access to testing and health info.   I will continue to come back to this site to be a listening ear, and if anything tell people that i can relate to the fear. I would offer coping advice, buuuuuuut i think i kind of failed in that area :)  But i will pass along the good energy,prayers, and hope that each one of you offered me.  Thanks ladies. God bless you.",
      "MessageIndex": 25,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Raineyb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171208/profile",
      "Content": "Raineyb wrote: I finally decided to post.  I am miserable. I am 31 years old with a 2 year old daughte who is my world. I had a mammogram on friday february 15th bc i found a small lump near my armpit.  Doctors said it is a regular lymph node, nothing to worry about at all. But they found microcalcifications on my right breast. I was told to come back for biopsy on Monday the 18th.  I had the whole weekend to e scared to death, crying at least once an hour. At biopsy, i literally asked every question imaginable to my doctor, and i could get absolutely nothing out of him.  I am a wreck.  I have stressed myself into the flu.  I am angry, and i have the worst feeling about what the results will be.  I was positive up until this point, because it seems to not be worth it, plus i do not have the energy.  I am a Birads4, which i found out by asking and put in the second category because the doctor kind of puts everyone there, because he is never sure.  His vagueness angered me.  I find so much info, sometimes it makes me feel better, sometimes i start bawling.  All i want to be is a mommy to my angel daughter, and i am just so scared. Does anyone have any legitimate statistics on what i am going through?  I have never been so upset in my life- i need help-not just nice words, even though they help too. I am supposed to get the phone call on Thursday.  Please help me. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    }
  ]
}