{
  "AuthorID": "RainbowRibb…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70375/profile",
  "Posts": [
    {
      "AuthorID": "RainbowRibb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70375/profile",
      "Content": "Aug 4, 2008 01:28PM RainbowRibbon9 wrote: Wow, it's so amazing to hear from caring people when I'm having such a hard time. I haven't been comfortable talking to any of my friends, and here you are, the friends I need right now. It means so much to me, thanks to each of you. I'm afraid my overactive imagination tends to lead me to fear the worst, and it would be so much healthier to expect the best. My mental/emotional state is still very affected by the recent (and ongoing) crisis with my mother, and I feel so vulnerable; this fear is just compounding my anxiety. The mammogram and ultrasound are at this time tomorrow, and I am somewhat calmer because I won't have to wait much longer. How long does it take to get test results? Anyhow, it's a gorgeous summer day, time to go work in the garden. Thanks for giving me some strength and sharing your time and experience. Cheers, Rainbow",
      "MessageIndex": 4,
      "PostDate": "04/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718986",
      "Title": "Trying to stay calm RainbowRibbon9 Shirlann"
    },
    {
      "AuthorID": "RainbowRibb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70375/profile",
      "Content": "Aug 6, 2008 07:47PM RainbowRibbon9 wrote: Hi Lisa, I sent you a private message about the breast reduction. Please let me know if you got it. Hope you're doing well. Cheers, Rainbow",
      "MessageIndex": 9,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718986",
      "Title": "Trying to stay calm RainbowRibbon9 Shirlann"
    },
    {
      "AuthorID": "RainbowRibb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70375/profile",
      "Content": "Aug 5, 2008 04:12PM RainbowRibbon9 wrote: Dear Friends, I went to the hospital today for the mammogram and ultrasound feeling surprisingly serene; I'm sure in large part due to the encouragement I received here. I was feeling rather stoic, prepared for whatever they found. The ultrasound technician was taking all these images of a large dark mass, measuring its dimensions, and I was thinking, \"It's ok, I can deal with it\". Then she said she was going to show the images to the doctor, and I thought, \"This is it\". The technician came back a few minutes later and reported that the doctor described it as a hematoma from the breast reduction surgery, and that it was resolving. I was totally stunned. Despite my efforts to be optimistic, I had really been expecting to get diagnosed, so I'm amazed to have this good news. My partner is totally ecstatic...\"I told you it would be all right!\"  It's like I was looking down a dark road I didn't know if I was going to be taking. And down that road was pain, loss, hospitals and fear, but then I found this site. And I saw others journeying all along the road and they were reaching out their hands to the new ones, hugging each other, comforting frightened young mothers, and no one was alone. Every spark of contact created light, and instead of a dark scary place, it was bright and alive. As I waited at that crossroad worrying, I felt love and support from all of you, and it gave me so much strength. Now that I'm moving on, I want to give you all great big hugs and thanks from the bottom of my heart. You really make this world a better place. The next Run for the Cure, no more excuses, I'll be out there running for you. Peace, Rainbow",
      "MessageIndex": 6,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718986",
      "Title": "Trying to stay calm RainbowRibbon9 Shirlann"
    }
  ]
}