{
  "AuthorID": "Random987",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104726/profile",
  "Posts": [
    {
      "AuthorID": "Random987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104726/profile",
      "Content": "Random987 wrote: My 72 year old mother was just diagnosed with Stage T-1a.  ER/PR negative, HER2 positive. Ki-67 at 15%.   It was originally thought as only DCis, but they found \"microscopic foci of invasive disease\" largest about 4mm.  She has now had two lumpectomy's and her surgeon is recommending a third because one of the margins is less than 1mm.  Her oncologist told her to wait to discuss with the radiation doctor to see if she could \"get it\".  He recommends adjuvent chemo followed by targeted Rx directed against the Her-2 (and likely radiation). The survival charts provided by the oncologist show only a marginal benefit for chemo (I think it helped 3 out of 100 people).  My mother is healthy, but has been through a lot of surgeries lately (knee replacement, hip replacement, spinal fusion, cataracts, etc.) Plus, we lost my Dad to metastatic melanoma about a year and half ago.  I live in a another state, so she is relying on her friends to help her out.   I guess the bottom line is whether chemo is really worth it?  I am relatively young, so I am predisposed to say \"throw the kitchen sink at it\".  However, she is 72, so I don't want to ruin her quality of life going forward..... Any insight?   Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/755779",
      "Title": "Mother Recently Diagnosed Random987 LuvRVing"
    },
    {
      "AuthorID": "Random987",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104726/profile",
      "Content": "Jul 26, 2010 10:34PM Random987 wrote: Thanks for the reply.  The problem is that it appears her treatment is in the grey area, she is over 70 and her tumor was less them .5cm.  However, with the Her2+, it may push it toward chemo, but there is not a lot of data out there, especially on the elderly.   ",
      "MessageIndex": 2,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/755779",
      "Title": "Mother Recently Diagnosed Random987 LuvRVing"
    }
  ]
}