{
  "AuthorID": "randymich",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64813/profile",
  "Posts": [
    {
      "AuthorID": "randymich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64813/profile",
      "Content": "randymich wrote: I recently had a lumpectomy and waiting for my results. The lump was blue black and shiny attached to something grey white. I asked if I could take a picture of it, so I did. I was curious to see what they took out of me. The doctor said he will be surprised if it comes back cancer. However, he offered no other comments on types or names of what it could be. So I googled similar looking lumps. I came up with Blue Dome Cysts. Does anyone have any info on this or others that have had similar like lumps removed? This was sitting on top of my implant, so it was rather deep. It's been 3 days and still have not heard back. Thank You,Michelle Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/847116",
      "Title": "Had a Lumpectomy 3 days ago the cyst or tumor is Blue? randymich randymich"
    },
    {
      "AuthorID": "randymich",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64813/profile",
      "Content": "randymich wrote: My mom is on her third round of Chemo, she is doing OK, but we have a few concerns. I was not with her on her last treatment, but she tells me there is a difference in the way the medicine is injected and makes her feel. She says the faster they inject , her bones ache sooner and the pain is worse. She tells the nurse to slow it down, but has anyone else ever experienced what she has described? 1 week from her 3rd infusion treatment mom says she has a rash on her chest, is this suppose to happen? Her veins hurt now and the last treatment was 1 1/2 weeks ago. I will see her tomorrow, but she tells me at the site of were they put the needle, it has a hard long bump, no bruising and it hurts. Does anyone think its more then a collapsed vein? Mom goes to the doc on Thursday, but I'm concerned that she is waiting to long? Today she looked pale and she says shes tired and tired of the treatment. Any advice or opinions would help. Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709528",
      "Title": "My mom has a rash and her veins? randymich snowyday"
    }
  ]
}