{
  "AuthorID": "ranita17",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241972/profile",
  "Posts": [
    {
      "AuthorID": "ranita17",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241972/profile",
      "Content": "Nov 3, 2016 09:01PM ranita17 wrote: Hello, I posted elsewhere, but am really desperate for more information. Palpable lump found in June 2015 and dr didn't do anything. Went back to another dr Nov 2015, had an ultrasound, BIRADS 4a, 26 x 19 x 6 mm. FNAB in February showed benign \"fibrocystic change\" Met with a breast surgeon last month because it felt larger. ultrasound showed that it grew to 29 x 8 x 28 mm. CNB with 6 11 gauge cores showed \"fibroadenomatoid changes\" Surgeon says it has to be removed instead of cryoablation because it is growing and they can't 100% call it a fibroadenoma eventhough it feels like one. I'm very scared. I'm a scientist and read articles and can't see why it has to be removed. What is standard? What are the risks of leaving it versus removing it? I have dense tissue and am 34.",
      "MessageIndex": 19,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/839709",
      "Title": "Should I have fibroadenoma removed? Please help..... Roxgirl Moderators"
    },
    {
      "AuthorID": "ranita17",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241972/profile",
      "Content": "Nov 3, 2016 06:35PM ranita17 wrote: I have a similar issue. I had the misfortune of first being at a university student health center. Lump was found during a normal CBE. Dr. said it's probably a cyst and will go away. I'm 34 and she should have sent me to imaging. I went back after 5 months because it didn't go away and insisted on imaging. It was BIRADS 4a on ultrasound and pretty big (26 x 19 x 6 mm) and that breast center wanted over 11K for a CNB (I'm a student, poor, and have to pay 10%) so I switched to UCSF's breast center. They said that it feels like a fibroadenoma and had me do a FNAB which showed \"fibrocystic change.\" I followed up 8 months later because it felt bigger. Ultrasound showed it grew to 29 x 8 x 28 mm. I had a CNB and they took 6 cores. Pathologist \"couldn't check off every box to label it a fibroadenoma\" so it was called \"fibroadenomatoid changes.\" While still benign, the breast surgeon says it needs to be removed because it's growing. Has anyone had a similar situation? I'm afraid of surgery. I still not fully understand why it needs removal?",
      "MessageIndex": 22,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    }
  ]
}