{
  "AuthorID": "ratbait",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
  "Posts": [
    {
      "AuthorID": "ratbait",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
      "Content": "May 24, 2008 05:20PM ratbait wrote: I don't have personal experience, but blood can be drawn and IVs given in the foot.",
      "MessageIndex": 1,
      "PostDate": "24/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706027",
      "Title": "port problem remgirl remgirl"
    },
    {
      "AuthorID": "ratbait",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
      "Content": "Nov 13, 2008 03:37PM - edited Nov 13, 2008 03:38PM by ratbait Lefty, I reviewed the treatment plan with my rad onc, and he went over what part of the body will receive what part of radiation.  The BP is in the same area as the supraclavicular nodes, so if you are getting that level of radiation, you will have exposure. Many people with early stage cancers do not have the supraclavicular nodes radiated.  I would assume this would translate into significantly reduced risk of compications. If you have questions of concerns, talk to your doctor and understand your treatment plan.  And discuss your concerns if the supraclavicular area is going to be radiatied.  With cancer, there is always a trade off between risks and benefits.",
      "MessageIndex": 77,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/698235",
      "Title": "radiation-induced brachial plexopathy Erica35 ryder51"
    },
    {
      "AuthorID": "ratbait",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
      "Content": "Sep 6, 2008 09:47PM ratbait wrote: Hugs to you and your sister.  It is not hopeless.  I know several women who are living with stage IV cancer, and who have lived with it for 7 to 9 years.  Treatment options are great here in the US.  Can she come here?  For bone mets, bisphosphonates have helped many women with their quality of life.  Zometa is the standard drug, which is by IV infusion.  1200 mg of Calcium and vitamin D are taken daily. There are also many treatments for liver mets, including chemo, SIR spheres, and ablation. The mets board will have people who can give you better advice. ",
      "MessageIndex": 3,
      "PostDate": "06/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/720445",
      "Title": "Stage IV - any hope? FormysisterT ratbait"
    },
    {
      "AuthorID": "ratbait",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
      "Content": "Sep 12, 2008 07:01PM ratbait wrote: There are some pretty good videos on self massage at the following website http://www.nwlymphedemacenter.org/ You may want to use these until you can see your therapist. I was able to get the swelling down some after watching the video, but was making some mistakes, so you should have someone teach you where to massage.  The biggest mistake I made is that if you are having radiation to the axilla, you need to clear to the back, but there were other, smaller mistakes I was making. Good luck and hugs.  ",
      "MessageIndex": 3,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720974",
      "Title": "Radiation making lymphdema worse? nobleanna007 ratbait"
    },
    {
      "AuthorID": "ratbait",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
      "Content": "Aug 4, 2009 04:48PM ratbait wrote: I have been able to wear compression shirts, and have not had a problem.  For me, these are a better option because the fabrics wick.  But my LE is minor and does not impact my hand.  My favorite brand is underarmour heatgear compression wear.  I buy it true to size, so it is tight.  Many people buy a size up, but they don't have LE issues. Be sure to stay hydrated and build up slowly. I also bought a myotape to measure my arm.  ",
      "MessageIndex": 7,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/738389",
      "Title": "Exercising w/ a compression sleeve kap24 SpunkyGirl"
    },
    {
      "AuthorID": "ratbait",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
      "Content": "Sep 12, 2008 07:56PM ratbait wrote: I have had cording three times over the course of six months.  The first two responded to gentle upward stretching and resolved itself within a few weeks. This last one has lasted a while longer.  And I am seeing a lympedema therapist for minor swelling.  I have two areas of cording.  One she says feels like a tendon, and the second is lymphatic.  So there can be several different causes. Hugs.",
      "MessageIndex": 11,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721005",
      "Title": "Eeek - a CORD! I'm freaking out... Kleenex knowledgeforpower"
    },
    {
      "AuthorID": "ratbait",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
      "Content": "Sep 27, 2008 01:10AM ratbait wrote: I can tell you about my experience with carpal tunnel.  I was able to cure it successfully without surgery, and had the same symptoms you did. 1)  Understand what is causing the inflammation (it can be many things) and change your environment and behaviors.  I had an ergonomic evaluation done on my computer, changed my mouse, stopped riding my bicycle, and scrubbed things with my other hand. 2)  Wear a wrist brace 24/7.  I bought two at Walmart (they get stinky) and took them off only to shower.  But that was before BC and before lymphedema.  Check with your therapist and have her see the wrist braces and their fit before wearing them. 3)  Control the inflammation with motrin (or aspirin or ibuprofin) It took about 2 months to heal, but I've only had one flare up in ten years, and that was quickly healed.  I haven't had an issue through chemo, but taxol certainly has found all of my other old aches and pains and created a few new ones. My friends that have had surgery still have issues with their wrists. Just thought I would let you know there may be alternatives to surgery. Gentle hugs.  There were so many things I couldn't do when I had carpal tunnel.",
      "MessageIndex": 3,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721757",
      "Title": "Surgery on LE arm? nobleanna007 nobleanna007"
    },
    {
      "AuthorID": "ratbait",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66877/profile",
      "Content": "Sep 27, 2008 01:06AM ratbait wrote: I can tell you about my experience with carpal tunnel.  I was able to cure it successfully without surgery, and had the same symptoms you did. 1)  Understand what is causing the inflammation (it can be many things) and change them.  I had an ergonomic evaluation done on my computer, changed my mouse, stopped riding my bicycle, and scrubbed things with my other hand. 2)  I wore those wrist braces you can buy at the drugstore 24/7.  I took them off only to shower. Check with your therapist and have her see the wrist braces and their fit before wearing them. 3)  Control the inflammation with motrin (or aspirin or ibuprofin) It took about 2 months to heal, but I've only had one flare up in ten years, and that was quickly healed. My friends that have had surgery still have pain.",
      "MessageIndex": 2,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721757",
      "Title": "Surgery on LE arm? nobleanna007 nobleanna007"
    }
  ]
}