{
  "AuthorID": "ravenruth",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
  "Posts": [
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Oct 13, 2009 05:41PM ravenruth wrote: My dr told me to wait a full 2 weeks after radiation before I start Tamoxifin. My last radiation is this Friday. I wish you luck.",
      "MessageIndex": 1,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742036",
      "Title": "Tamoxifen B4 or after Rads concernedsis concernedsis"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Aug 21, 2009 03:15PM ravenruth wrote: I am going in Monday morning to get marked up, and then they will schedule the radiation. My radiologist told me to stop taking the tamoxfin until I get the radiation completely done. I had only taken 4 tablets so I guess that is ok, I am scheduled for 6 1/2 weeks - M-f. I had all clear margins after my lumpectomy. It was close to the chest wall in the right breast but it was only 1/8 inch, and everything around it was clear. I have never heard of the shortened 3 week radiation. Please advise . I hope the radiation starts in August also. A regular mammogram I was told would not have picked this up. Thank God I went digital",
      "MessageIndex": 185,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Oct 17, 2009 08:51PM ravenruth wrote: I didn't get to ring a bell but they all gave me hugs and a certificate saying I passed  They told me I had a great sense of humor & to come back & see them, I actually am going to miss them but not the rads",
      "MessageIndex": 502,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Aug 22, 2009 02:50PM ravenruth wrote: Thanks for the information 03132W, unfortunately I have large breasts, does that mean I will not qualify? All my margins were perfect and I too was told to stop tamoxfin (I only did 3 or 4) till the radiation stopped. Mine was 1/8 inch or 3 ctms. (also non evasive- in the milk ducts) Do I wear deoderant on the day I get marked up before radiation begins?",
      "MessageIndex": 191,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Aug 31, 2009 09:05PM ravenruth wrote: Hey beautiful people. I hope all is well. I had my 1st radiation today and it took about 30 minutes due to extra pictures. I agree it is a pain to raise your one arm up and keep it there for awhile while my head is turned to the left. It gives you a pain in the neck. She said tomorrow and 4ever it would be about 15 minutes from start to finish at the most. They are wonderful though and thanks to you all & God I couldn't do this without you all. 33 treatments and 1 down, 32 more to go. I will keep you all in my prayers. I go at 8:45 am everyday. (except Monday is a holiday)",
      "MessageIndex": 268,
      "PostDate": "31/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Aug 27, 2009 09:56PM ravenruth wrote: Hi ladies, I just got marked up yesterday and I start my first day of radiation on this Monday at 1:30 PM EST andI am scared. I know not to use deoderant but I am afraid the sharpie black marks will come off when I shower. What kind of soap should I use during my 6 1/2 weeks of radiation. I shower daily. What am I to expect on my first day of treatment? Thanks four your help in this matter. God Bless and keep me in your prayers as I will you all.",
      "MessageIndex": 242,
      "PostDate": "27/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Oct 16, 2009 10:01PM - edited Oct 16, 2009 10:05PM by ravenruth Hey guys finishedd with my rads today but my underarm hurts like you know what. I am burned under my underarm even though my lympth nodes were clear. I can't wear a bra yet but I hope my underarm clears up before long. I was told not to start tamoxifin until  2 weeks ater radiation. I pray I don't gain any weight. I am starting a diet hopefully on Monday. Congratulations ladies, now we all have to look forward to the next 5 years on tamoxifin. Lets all pray we all will make it. Do any of you live in Maryland or are we not supposed to ask. Have a great evening everyone and my prayers are with you all/",
      "MessageIndex": 497,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Oct 4, 2009 09:48PM ravenruth wrote: Peg119- I too have the same irritations on my chest and 10 more to go. I am big breasted and I am having a terrible time some days . It is fine when you go without a bra & a  bit under the boob & the high up the underarm is sore & brown. I hope I can make it the last 2 weeks. I told the last  5 treatments are boosters. Is that worse? The doctors gave me some cream but it doesn't seem to help. Do you or anyone know of a cream that will?  Hopefully one with alovera gel. Please help. I have been told I will need it after radiation also. Thanks",
      "MessageIndex": 435,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Oct 9, 2009 08:54PM ravenruth wrote: Hey everyone. I finish up next Thursday or Friday due to the boosts I have to get. Pray that I will make it. I then start taking tamoxifin for 5 years. I feel so fat(I am fat-100 pounds overweight and I have to get this fat off) I feel rotten. My underarm has a 2-3 inch open raw burn space and it hurts. I hope it will soon heal. I too am big breasted DDD .  I am using the silverdene also, My boosts are going to be near the nipple area because the cancer was almost against the chest wall even though it was a small . I am glad I won't have to raise my right arm and risk getting burned more. Mabe I can join weight watchers or something because I have been diagnosed with anxiety/panic attacks and depression and this extra weight doesn't help. Please pray for me to get thru all this. You all are like family, God Bless",
      "MessageIndex": 472,
      "PostDate": "09/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Oct 12, 2009 06:27PM ravenruth wrote: hey ladies, I had one booster today and 4 more to go & I will be done.Fiday is my last day. Then the dr. told me to wait 2 weeks before I start the Tamoxifin. Pray that this doesn't put additional weight on me. I really do not want it. My right underarm is so sore I could scream. I have also developed this nagging cough, I never had one this long. I wonder if radiation has something to do with it? 2 days last week I threw up. I hope I am not catching something else. I do have sinus problems too. I am praying that we will all reach our goals. God Bless! Any of you all live in MD?",
      "MessageIndex": 476,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "ravenruth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87278/profile",
      "Content": "Dec 4, 2009 09:07PM ravenruth wrote: I also have no hair or odor under my one arm. It is kinda weird feeling. I seem to be eating more than ever since I started taking tamoxifin. I hope this soon stops",
      "MessageIndex": 521,
      "PostDate": "04/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    }
  ]
}