{
  "AuthorID": "rdrake0",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
  "Posts": [
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "rdrake0 wrote: In July of 08 I had serious GI problems.  After exhaustive barium swallows, upper GI, and colonoscopy, I was diagnosed with IBS.  Oct of 08 a mammo found bc and I had a lumpecomy in Dec08/Jan09.  A PET/CT showed a 'lesion consistent with mets' in my liver.  My onc wanted to wait to see if it grew, which it did.  Meanwhile I had a liver biopsy done. I started Ixempra (clinical trial) in July 09.  Two months later the cancer in my liver grew more.  That ended the clinical trial.  But the Ixempra was REALLY hard on my gut.  It feels like I swallowed rat poison!  Anyone else with IBS out there who has the same thing on their chemo?  There is more... The liver biopsy came back very similar to the bc biopsy in that both are highly ER/PR+ and her2-.  Here is a summary of the comparison: Both specimens contain tumor with a similar histologic appearance containing areas of \"comedocarcinoma\" appearance.  In both cases, the tumors express both estrogen and progesterone receptors. The liver tumor shows focal synaptophysin positivity. Whereas this is often used as a marker of neuroendocrine change, it can also be seen in a minority of breastcarcinomas and is thus not entirely specific. On the basis of the available evidence we conclude that the liver tumor represents a metastatic lesion from the breast adenocarcinoma. This new onc tends to believe there is a good chance that the liver cancer is the neuroendocrine type and is coming from my liver [not liver cancer, though(?)].  He said that the neuroendocrine cancer could actually be responsible for my IBS!  Wow!  I'd sure like to get rid of that crappy IBS right along with the cancer in one chemo experience!  Sorry, I'm getting carried away. Does anyone have something to add to my mess, er, experience? Thanks. Ruth Dx 11/12/2008, IDC, <1cm, Stage IV, Grade 3, 0/1 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741470",
      "Title": "Chemo and IBS rdrake0 rdrake0"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Nov 3, 2009 07:28PM - edited Nov 3, 2009 07:29PM by rdrake0 After the bad experience with the onc at CTCA, Zion, I was suspicous of all oncs.  But I have found a wonderful place where docs and nurses care about their patients - UPMC, Pittsburgh!  I live in IL, but my dh and I have traveled 5 times back to UPMC with a 6th one coming up in Dec 09.  There are no commercials, just a very informative website.  And they ARE in my BCBS network!  So insurance pays for everything after my first $1800 out-of-pocket is fulfilled. (which happened Jan 2 of this year, by the way!)  That is hugh for me!  Kudos to Dr. Geller! Ruth",
      "MessageIndex": 15,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743197",
      "Title": "What are your real thoughts on CTCA LuAnnH Alpal"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Nov 3, 2009 10:02AM - edited Nov 3, 2009 10:05AM by rdrake0 I went to CTCA in Zion, IL for my bc surgery in Dec 08 and Jan 09 for rescission.  The nurses are the best anywhere!  They care, they listen to you, and they take REALLY GOOD care of you.  And the food in the cafeteria is organic and chemical free, but still tastes wonderful!  What you get in your room, though, does NOT come from their cafeteria!  Trust me on that! I went around and around with my surgeon, however, about that nuclear dye injection.  I had heard it could be brutal.  So I asked for numbing or to be under for it.  He assured me it would be all OK.  It was NOT, for me anyway.  And I am still miffed at him for lying to me.  But he did a great job on the lumpectomy. My BIGGEST concern with CTCA Zion is the oncologist, Dennis Citrin.  He has been there since 2004, came there from many years at Northwestern in Chicago.  I met him one time before surgery, and talked to him a grand total of two times.  That's all.  He was supposed to be my team leader, but he was unavailable to me whenever I called him.  So was his nurse, by the way.  The second time we talked, he called me and said, \"Congratulations, you don't have to do chemo!\"  I asked for my Oncotype score and he didn't have it!  He didn't have any info at all!  I still don't know what he based his decision on. But my worst experience with Dr. Citrin was when I asked for a whole body PET/CT scan.  I asked for it on my first visit with him and again during the phone conversation, both times he said no.  The second time I asked why, and he said it was unnecessary, that there was 'no way the cancer in my breast could have gotten out'.  I had been having colon/abdominal problems for several years and decided to pursue the PET issue with a local onc who ordered it.  That is how I found out that cancer was eating my liver up!  A biopsy said it was bc mets! So that is my CTCA story.  I had BCBS, so they welcomed me with open arms!  But I still had to pay over $2000 for my stay because they were out of network. Their commercials sure sound good, though, don't they? Ruth",
      "MessageIndex": 6,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743197",
      "Title": "What are your real thoughts on CTCA LuAnnH Alpal"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Nov 4, 2009 04:28PM - edited Nov 4, 2009 04:30PM by rdrake0 I, too, have had lousy doctoring locally (not CTCA).  To the point of considering suing two of the doctors who flat out lied to me about the mets to my liver!  Has anyone else out there considered doing that?  I'm not wishing to get rich or anything...I'd probably donate whatever I win to the American Cancer Society for more cancer research.  I just want good care.  I expect it...I paid for it!  How dare they be so uncaring!  Doctors who treat us like that should not be in the medical profession!!!!! Guess you can tell I get worked up about this.  Sorry. Ruth",
      "MessageIndex": 24,
      "PostDate": "04/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743197",
      "Title": "What are your real thoughts on CTCA LuAnnH Alpal"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Dec 14, 2009 10:46AM rdrake0 wrote: I have neuroendoctrine cancer in my liver.  The docs say it could have come from any organ that secretes fluids, including the liver.  However, they have mostly decided it came from my bc.  (PET and CT scans have not shown any activity outside of my breast and liver.)  The main difference, they said, between the bc cells from my breast and the ones from my liver is a powdery substance surrounding the ones from my liver.  Both were ER/PR+ (highly) and HER2-. Anyone know anything about this?  The more I hear the more confused I get about it.",
      "MessageIndex": 4,
      "PostDate": "14/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745267",
      "Title": "neuroendocrine breast cancer lillian1 Kssb"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "May 2, 2009 08:04PM rdrake0 wrote: I teach, and my school won't let us take an hour.  It's half day!  That really helped!  I had my rads at 8am, came home and took a nap.  Had a high protein lunch and went to my afternoon half day.  I wasn't really tired until a week after the rads ended.  Then it was like I hit a brick wall!  Now a month later, I do sometimes get tired, but usually at the end of the day.  I did not do chemo.  I am taking Arimidex which I started 5 days after the last rad tx.  That might account for some of the fatigue, too. I'm taking a ton of supplements.  I found that Omega-3 gave me diarrhea really bad.  I was taking 4x2400mg.  Now I take 1 in the morning.  Still have diarrhea, but not as bad.",
      "MessageIndex": 67,
      "PostDate": "02/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730002",
      "Title": "RADIATION FATIGUE - POLL bluejay1 Siciliana"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Jul 1, 2009 10:37AM rdrake0 wrote: I have mets to my liver.  One big one was just removed surgically with6 our of 12 other smaller ones biopsied.  Surgeon wants me to take chemo.  I am on Arimidex.  Anyone know how to tell if the Arimidex is working?  Do they shrink visibly on an MRI or something?  I am 70%ER and 80%PR. ",
      "MessageIndex": 6,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736769",
      "Title": "Newly Diagnosed - Looking for Input on Treatment Jill45 rdrake0"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Aug 29, 2009 03:17PM rdrake0 wrote: There are several options now for the delivery of the chemo.  I am getting Ixemplra which taken once every three weeks causes some serious side effects like neuropathy, among other things.  But I'm getting it once a week (lesser dose more often) and after 5 weeks I feel great and still have my hair!  (By the way, I get chemo for 3 weeks and have one week off.)  I have heard that A/C can be done this way, too.  Then there are fractionated doses which mean you get partial doses over three to five days.  I understand it has less side effects but still effective against cancer.  There also is a pump that you wear for a week or so. Hope this helps!  Good luck and stay positive.  You are in my prayers. Ruth",
      "MessageIndex": 1,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/739693",
      "Title": "options to ac sammygrey44 sammygrey44"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "rdrake0 wrote: I had the first CT scan of my life July of 2008.  My right kidney at that time had a 1mm cyst in it.  Now, August 2009, I have had a breast MRI, 2 liver MRI's, 2 whole body PET/CT scans, a bone scan, 3 CT scans (2 with berium, all with injections), and two other berium swallow tests for my stomach and small intestine.  Oh, and don't forget about the SNB!  And after each of these tests, that 1mm cyst has grown.  Now it is over 1cm and others have started to grow as well - in both kidneys. Just how safe are these imaging scans for our bodies to endure, anyway?  Anyone, especially those of you in the medical persuation, or anyone else who has researched it, know stats on this?  Also, how do we protect our kidneys and other organs from this bombardment of nuclear and radioactive glucose that they inject for these tests? It feels like we are robbing Peter to pay Paul with our health. Dx 11/12/2008, IDC, <1cm, Stage IV, Grade 3, 0/1 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738468",
      "Title": "Damaging Effects of Scans, etc. rdrake0 bygracealone"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Sep 23, 2009 07:56PM rdrake0 wrote: Hi, CCarter!  So sorry about those people.  I usually just give people like that my 'teacher' glare!!  My kids used to really hate it! (Told them I learned it in Teaching 101!)  It really works for dorks like that. Are you getting your \"A\"C weekly or every 3 weeks?  Or another way?  I'm hoping to be on it someday.  I think I'll have to change clinics to get it, though.  My onc said nobody uses AC anymore.  He said all docs use taxanes nowadays.  Guess not! Stay strong.  You can do this. Ruth",
      "MessageIndex": 39,
      "PostDate": "23/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739694",
      "Title": "Crap Liver Mets ccarter48818 sportsmom"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Sep 19, 2009 06:34PM - edited Sep 19, 2009 06:37PM by rdrake0 Hi, everyone!  I have bc liver mets, too.  There are (were) 14 tumors in there.  My surgeon took out 2 of them to biopsy, so that leaves 12.  PLEASE, everyone please post what chemo you are on and how often you get it!  I'd love to compare how effective the different chemos are for all of you! I am on Ixempra and I hate it!  I get it weekly on a 4 week schedule, Ixempra on weeks 1, 2, and 3 with 4 off and Avastin on weeks 1 and 3.  I know that sounds confusing.  On a recent MRI, after two rounds of chemo (7 weeks actually), some tumors grew a little while others shrunk a little.  I really don't like that!  Have a CT on Monday.  Hope it hasn't spread! Oh, I have the MRI because I have fatty liver disease and the fat apparently hides the smaller tumors on a CT scan (the ones that are pea to marble size).  The CT is to check for cancer elsewhere in my body.  I'm in a clinical trial that requires the CT. Sorry to go on and on.  But please post what you are getting and when! Thanks, Ruth",
      "MessageIndex": 36,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739694",
      "Title": "Crap Liver Mets ccarter48818 sportsmom"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Oct 11, 2009 08:29PM rdrake0 wrote: Hi, everyone!  I sympathize with Krystyna!  My dh and I planned a camping/horseback riding trip up into the Rockies in Montana last summer.  But due to PETs and CTs, etc, we had to cancel.  Oh, well, the Rockies have been there for a while and they aren't going anywhere very fast, right? I have a theory about ER/PR+ people (me, too, by the way). My bc was 70% ER+ and 80% PR+.  The mets in my liver were slightly less that those numbers.  I'm thinking that the Arimidex I was taking which, after 4 months, 'stopped working', had killed off most of the 70%/80% ER/PR+ cancer cells, but couldn't touch the 30/20% of the remaining cancer cells that weren't ER/PR+.  And so, of course, they grew!!  I guess the only way to test my theory is to do another biopsy.  Which they probably won't do.  Another comment, I was on Ixempra and after 2 months, it failed and the cancer grew.  So I am scheduled for a new treatment (I think it's new, anyway) called Intra-hepatic chemoemobolization.  They will go into my femoral artery using an angeogram, travel up to the hepatic artery and inject adriamycin directly into the liver, then seal it off with a temperary foam.  That leaves the chemo locked in there for anywhere from a week to a month to kill the cancer.  Meanwhile, the liver cells are still fed by another larger vein.  This isn't the glass chemo beads.  It's just chemo.  The advantage is that since the chemo doesn't get out into the body, much anyway, the se's are minimal if at all.  I have 7 active lesions in my liver, all growing fast.  So I guess the docs worry about running out of time trying another systemic chemo.  I don't seem to have cancer anywhere else at this point. Anyway, wish me luck!  I'll tell you all about it when I return next weekend!  The procedure is this Thursday. Ruth",
      "MessageIndex": 15,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741902",
      "Title": "Just diagnosed with liver metastasis Krystyna Krystyna"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Oct 17, 2009 07:28AM - edited Oct 17, 2009 07:29AM by rdrake0 Hi, Krystyna and everyone else!  So sorry about your mets!  I have mets to my liver.  They are growing very fast.  I had Ixempra/Avastin for my first chemo.  The cancer grew. So this past week I went in for a TACE (Intra-hepatic Chemoemobilization) on my liver.  It is a new procedure, only a few places do it right now.  They put me under, kinda like they do for a colonoscopy, then went into an artery in my groin - like an angiogram.  They went into the hepatic artery into the liver and deposited Adriamycin directly into the right lobe.  The artery was then blocked temporarily so that the chemo stays in the liver, mostly anyway!  In two month's time they will repeat this procedure on my left side.  This TACE thing was done last Thursday, it is now Saturday, and no pain.  A little nauseous and poor appetite.  But this thing has been very tolerable so far!!  I didn't loose all of my hair on the Ixempra, just thinning out.  But I was expecting to loose it all!  We'll see if I lose more with this TACE thing! Also, I should note that I have no mets anywhere else that they can find, anyway.  So wish me luck that this TACE thing kills the liver cancer. Just another note: I have been having conversations with God about my future.  I only ask that if there is something else he wants me to do, I am willing to go the distance with this cancer so I can be here to serve him.  I have asked this of him often before the cancer.  So the prayers are not new recently.  Just a little more passionate right now, is all! Thanks for listening. Ruth",
      "MessageIndex": 32,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741902",
      "Title": "Just diagnosed with liver metastasis Krystyna Krystyna"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Oct 21, 2009 04:16PM rdrake0 wrote: Update on Intra-hepatic Chemoemobolization treatment:  I had the procedure done last Thursday.  They only did the right side.  I felt fine when I woke up that day.  And fine Friday when we drove home.  Saturday I was really contipated. Sunday I thought I would die from the constipation pain!!  Like concrete!  Took Mirolax in the AM on each of Sat, Sun, Mon, and Tues without success.  Never had that happen before!!  A nurse called me Tues AM to check up on me and suggested Milk of Magnisia every hour on the hour until it broke loose.  By that time it only took one dose and Mt. Olympus erupted!  Three times that morning!  Felt fine that day, just kinda tired.  Then Tues night started having stabbing pain in my right side and under collar bone!  Worse than labor!  Could hardly breathe.  So, for the first time since the lumpectomy, I took an Oxycodone.  Didn't want to because it causes constipation, and Lord knows I don't need that!  But I'm armed with Milk of Mag now!  The Oxy worked.  Wow, what a trip that was!  Glad I wasn't driving!  Had to take another Oxy this morning.  It's supposed to only work for 3 hours.  And for 3 hours I had no pain at all.  But the residule effect lasted a lot longer.  I will have blood tests done every week for the next two months and we will keep track of things that way.  Then in Dec I have to go back and have either the left side done, or doc said maybe the right side again if necessary.  They will do scans, etc, to check on the progress at that time. Sorry about the long story!  A lot has happened!  Huggs. Ruth",
      "MessageIndex": 41,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741902",
      "Title": "Just diagnosed with liver metastasis Krystyna Krystyna"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "rdrake0 wrote: I've had two different chemos.  The first was Ixempra for 2 months (2-4week cycles), and the second is Adriamycin injected directly into my liver.  Both chemos have had the same effect on my stomach and intestines.  The contents turn rock-hard, like cement, for about 4 days after each treatment. Anyone else out there experience this?  Does anything help alleviate this problem?  I have tried Mirolax with no response. Thanks for any advise anyone can give. Ruth Dx 11/12/2008, IDC, <1cm, Stage IV, Grade 3, 0/1 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/744565",
      "Title": "Chemo Turns Gut to Cement rdrake0 ccbaby"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Nov 27, 2009 02:39PM rdrake0 wrote: Thanks to everyone for your suggestions!  I can't eat wheat or gluten, but I forgot to mention that!  The prunes and stool softeners sound great.  I did buy Milk of Mag and used it on the 4th day and things worked that day.  So maybe that is what finally broke it loose.  I did drink water all day the 1st and 2nd day after the chemo, but by the 3rd day, since I didn't drink during the night, I was blocked and couldn't drink much anymore, or eat either.  That was scarry.  I have another chemoemobilization coming up Dec 9th and I want to be ready for it this time! Thanks again. Ruth",
      "MessageIndex": 5,
      "PostDate": "27/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/744565",
      "Title": "Chemo Turns Gut to Cement rdrake0 ccbaby"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Oct 17, 2009 10:33AM rdrake0 wrote: Also, I should note that I have no mets anywhere else that they can find, anyway.  So wish me luck that this TACE thing kills the liver cancer. Just another note: I have been having conversations with God about my future.  I only ask that if there is something else he wants me to do, I am willing to go the distance with this cancer so I can be here to serve him.  I have asked this of him often before the cancer.  So the prayers are not new recently.  Just a little more passionate right now, is all! Thanks for listening. Ruth",
      "MessageIndex": 8,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720509",
      "Title": "SIR Spheres for Liver Mets SunshineLovesGod lifeline59"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Nov 28, 2009 06:44PM - edited Nov 28, 2009 06:57PM by rdrake0 Sorry about your recurrence.  I can tell you a little about Ixempra. But there was a thread here http://community.breastcancer.org/forum/8/topic/705044?page=12#post_1536237, where other bc girls posted for awhile.  By the time I was on Ixempra, though, most of them were all off of it. I was in a clinical trial where I got Ixempra last Sept.  I failed on it.  Had mets to my liver which continued to grow.  Are you in a clinical trial?  I got it weekly for 3 of 4 weeks with one week off. Be careful NOT to eat anything with grapefruit in it.  Grapefruit exaggerates Ixempra. One bad thing I'll note here is that Ixempra doesn't really kill the cancer (I guess).  Everyone I have heard of who took it had the cancer come back almost immediately after stopping it.  I was told I'd never be able to get off of it.  My cancer continued to grow on it, so we stopped anyway.  I am now having chemoemobilizations (Adriamycin) to my liver.  It seems to be working.  It's rough for about 1 or 2 weeks, but if it works...! Good luck, huggs, and keep us posted as to your progress! Ruth",
      "MessageIndex": 2,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/744611",
      "Title": "Starting Ixempra Squirrel62 Squirrel62"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Aug 10, 2009 06:49PM rdrake0 wrote: I'm 60 and definitely post menopause.  I was on Arimidex from April through July.  So I had hot flashes with it.  But I stopped the Arimidex (doc said it wasn't working) when I started chemo.  I get hot flashes now, too.  But I noticed something.  I usually get the hot flashes after I eat!  It's usually about 1-2 hours afterwards.  Anyone else notice that pattern? Ruth",
      "MessageIndex": 4,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738704",
      "Title": "Hot Flashes and Chemotherapy Sandals rdrake0"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Nov 16, 2009 09:17AM rdrake0 wrote: 59.  Most of my adult life I have averaged 130 pounds.  But I started gaining weight at 45, pre-menopause, about 5 pounds per year.  Then about 10 pounds per year from age 50 on until last Dec I reached 200 pounds!  I'm guessing the cancer started back around age 45-50 and the estrogen in the fat kept it fueled.  Try as I might I just could not stop the weight gain much less lose weight.   After chemo, I'm now down to 145.  I'm happy with that. Ruth",
      "MessageIndex": 342,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Aug 8, 2009 09:10PM rdrake0 wrote: In the list of things to get for chemo, it is mentioned that AC is processed through the liver and Taxol is processed through the kidneys.  Where is Ixempra processed? Thanks. Ruth",
      "MessageIndex": 321,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "rdrake0 wrote: Anyone now having or ever have Doxil for chemo?  It might be my next tx since Ixempra failed me. Ruth Dx 11/12/2008, IDC, <1cm, Stage IV, Grade 3, 0/1 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741632",
      "Title": "Doxil Questions rdrake0 JeanneG"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Dec 10, 2009 08:34PM rdrake0 wrote: I was told that during the PET, they inject a radioactive glucose (sugar) into your vein.  The cancer slurps it up faster than most other tissue and so it glows more on the scan, indicating its location and size, kinda.  There are often false positives on PETs.  This also makes one wonder, if cancer is such a pig on sugar for a PET, should any of us cancer victims be eating sugar at all?  Hummmm.  I don't think I can live without it...and chocolate, oh, my.  What a dilemma.  I don't understand the protein thing, though.  I was told to have a high protein before my two PETs.  Don't know why. Ruth",
      "MessageIndex": 7,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745202",
      "Title": "Preparing for a PET Scan chk8 clemson93"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Jul 1, 2009 02:12PM rdrake0 wrote: Could you describe  your pain?  I felt like I had been punched in the gut (actually happened to me about 35 years ago during gymnastics...got a knee in my upper belly).  I had 13 pea to marble sized lesions growing in my liver (2 removed last Tues and 5 core biopsied).  I discovered several months ago, however, by experimentation, that cutting out sweets eased the pain until it is all but gone.  High fructose corn syrup is the worst!  Also, I eliminated MSG and other additives and presevatives from my diet.  A bonus is I have lost 22 pounds since the new year.  Yayyyyyyyyy!",
      "MessageIndex": 3,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736797",
      "Title": "Liver Mets Question madams30 Denny123"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "rdrake0 wrote: After reading the thread about Lactose intolerance to Xeloda, I started to wonder about Celiac issues to chemos.  Anyone know of any?  Glutin can be found in way weird places like vinegar, soysauce, ice cream, etc.  So I was thinking it might also be in a chemo, too.  Or made from a wheat product. Ruth Dx 11/12/2008, IDC, <1cm, Stage IV, Grade 3, 0/1 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747852",
      "Title": "Wheat and Glutin Sensitivities to Chemo rdrake0 rdrake0"
    },
    {
      "AuthorID": "rdrake0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77619/profile",
      "Content": "Jul 1, 2009 12:10PM - edited Jul 1, 2009 12:10PM by rdrake0 How old is your mom?  And did they do a biopsy to find out for sure that it is bc mets?  Do you have good insurance? Hang in there.  You are a great caregiver and deserve lots of hugs from us out here! Ruth",
      "MessageIndex": 1,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736797",
      "Title": "Liver Mets Question madams30 Denny123"
    }
  ]
}