{
  "AuthorID": "ReadyAbout",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
  "Posts": [
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 12, 2018 05:49PM ReadyAbout wrote: I had horrible nerve pain following bmx and after my PS blew it off for 3 weeks, he finally relented and sent me to a pain specialist. I am on Cymbalta and I also use a topical ibuprofen cream called Voltaren. Both have been very helpful and I just wish my PS had listened to me earlier when I told him about bad the pain was. It's like he had never had a patient with neuropathic pain before, and I find that hard to believe. I feel much, much better on Cymbalta - still residual sensitivity, but nothing like it was before.",
      "MessageIndex": 69,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860079",
      "Title": "Hypersensitive skin/nerves after mastectomy az2017 Silverpullet"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 30, 2018 07:04PM ReadyAbout wrote: I had a lumpectomy, then learned a month later that I wasn't a good candidate for radiation, so I opted for bmx and prepectoral reconstruction. My PS advised that I do bilateral since my breasts had quite a bit of droop (thank, kids!) and it would have been too hard to match the foob with the remaining breast. Also, both the BS and the PS mentioned my relatively young age (49) as a reason to perhaps consider bilateral mastectomy. I had many complications after surgery, some minor, one major, and yet I would STILL do it all over again. I think if I had left the healthy breast on, I would be waiting for the other shoe to drop. I am a very healthy person with a track record of rare health issues, so I didn't trust the healthy breast to behave. Good luck with your decision and outcome!",
      "MessageIndex": 7,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866110",
      "Title": "Planed Lumpectomy but now Mastectomy- Thoughts Jimiwithani Jimiwithani"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Apr 20, 2018 03:52AM ReadyAbout wrote: Prairiedog, I found the stupid lump 3 days before Christmas and was diagnosed Feb 1. I definitely thought I would be entirely done with all treatment by April - had no idea that 80% of breast cancer involves waiting. I had lumpectomy on 2/23 (it was a breeze) and was going to start radiation but then learned that I wasn't a good candidate for rads since I have a vascular condition that could cause problems 5-10 years later. I am STILL waiting on Oncotype/HER2 because the tumor was misdiagnosed as DCIS and pathologists at Oncotype lab discovered it was invasive. We can put on a man on the moon but apparently we still can't diagnose a tumor under the microscope correctly. Anyway, glad to have you on board and I hope everything goes well!",
      "MessageIndex": 2,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Apr 25, 2018 03:18AM ReadyAbout wrote: PatsyKB, welcome to the Maypole! (can someone come up with a catchy name for our group?) FWIW, I have a friend who had breast cancer and also had significant breast cancer history on her mother's side. She tested negative for a breast cancer gene, but the geneticist said that she probably has a gene that simply has not been linked to breast cancer yet. The speed at which research is shaking up genes & cancer is staggering. I have an ATM VUS gene mutation and the VUS simply means that they don't know enough to classify it one way or the other yet. And I agree, having even a zygote of a plan does wonders for one's feeling of control and optimism! Here's hoping your lumpectomy goes well!",
      "MessageIndex": 10,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 155,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 24, 2018 04:29AM ReadyAbout wrote: FasterPussycat: You have been through the WRINGER on your way to the surgery. Congratulations for getting to the big day with your sanity intact! (more or less) Good luck tomorrow. We are in your corner, cheering loudly!",
      "MessageIndex": 196,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 30, 2018 11:32PM ReadyAbout wrote: Two weeks post bmx and I got the DRAINS out today! {{aggressively pumps fist in air}} The sides of my chest feel like a giant sunburn but it is SO NICE to not have the drains hanging out! I have significant axillary webbing on the SNB arm so I will start PT for that because my range of motion is severely limited. The PS also wrote a prescription for steroids to subdue the swelling and tame Limey, my pet hematoma. Finally, the tissue on my left breast/nipple was not healing very well and there was a chance that if enough tissue became necrotic, I would need surgery to clean it out. Someone on the reconstruction forum told me about hyperbaric oxygen therapy. My PS had never had a patient do it, but he wrote a prescription and my insurance approved it (<----biggest surprise since being diagnosed) and I started two days ago. I can already see a difference and even my PS was impressed when he saw me today. I go for two hours every day, first thing in the morning. It will help the tissue heal faster and better and prepare me for future surgeries. (TE exchange, fat grafting, etc.)",
      "MessageIndex": 290,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 1, 2018 11:25PM ReadyAbout wrote: SLL: FWIW, a friend of mine had several drains in for 5 and 1/2 weeks. FIVE. She simply could not get below the 30ml mark and finally marched into the PS office and demanded that they be removed. She didn't have any problems with drain removal after all that time so you should be fine. Deep breaths....",
      "MessageIndex": 314,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 6, 2018 04:43AM ReadyAbout wrote: Hey Friends! It's SO GOOD to hear so many stories of people mending well/turning the corner! Woot woot! I think my nerve pain is improving as I took half the doses of Percocet today and felt ok. I am sad that I tried to wean myself off the pain meds last week when I was in such bad shape. My friends sent me some socks that said \"I am strong\" on the top and I looked at them one morning and burst into tears because \"strong\" was the last thing I felt. I guess I'll know for the next surgery, lol. I did a long hike with one of my kids today and had the best time - she is in college and will leave soon for Peru for the rest of the summer and I was so excited to have one-on-one time with her. I start PT tomorrow for the axillary webbing in one arm and I'm eager to get that ironed out as it is tough to straighten/use that arm. I finally called the MO to get my Oncotype score (long story) and it's 19. I was hoping to skip Tamoxifen but I have a feeling he will lobby in favor of it. I am sorry to hear about people having pain/issues with fills - I agree that it is so hard to be in pain and need the drugs but at the same time worry that you will become addicted or be perceived by your doctor as at risk of addiction. I will get my first fill one month post-op because I had issues with the tissue healing; I'm a little nervous about how the nerve pain will be but baby steps... I hope everyone continues down the path of healing and optimism. GO TEAM!",
      "MessageIndex": 349,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 15, 2018 11:11PM ReadyAbout wrote: WARNING - ANGRY VENT AHEAD: I went to the PS to get my first fill today. He couldn't do the fill because he FORGOT to tell me to take antibiotics beforehand. Even worse, he tried to say that I must have forgotten amidst the \"overload\" of information I've received lately. (I am super Type A when it comes to details, so no, I did not \"forget\".) He still refused to prescribe anything for the nerve pain, saying that he didn't know where I got the \"myth\" that gabapentin is a good medication - he said all it would do is make me high. The crowning glory of the appointment (other than him running an hour late) is that I pointed out 4-5 surgical threads still hanging out of my skin in various places and asked if those have a function in the future. They don't - I guess he just didn't notice them when he was tidying up after surgery. He snipped them off and I hope he was embarrassed by this oversight. I am waiting anxiously for the shipment of marijuana edibles from my cousin in Colorado to see if it helps with the nerve pain. Worst of all, because of this delay with the fills, I don't think I can do the exchange before I have to report back to school in August. He said the exchange would probably involve a lift with fat graft, and to recover I would need to take a week and a half off from school, so I will probably wait until fall break in October or Thanksgiving, so 5-6 months with tissue expanders. UGH! (insert muffled scream here) Sorry for this litany of complaints - maybe I'll post happy ones after the edibles arrive, LOL.",
      "MessageIndex": 438,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 20, 2018 11:48PM ReadyAbout wrote: I went for the first fill today and PS removed the air from the expanders and then put in 180 ccs. I had prepectoral reconstruction so my expanders are on top of the chest wall and I think that makes the fills a bit easier. I don't feel any discomfort yet. I'm going in for one more fill, but honestly, I could be happy with that size - is that crazy? Maybe I got used to the crumpled look of the tissue expanders, but my foobs looked normal to me in the office. I'm 5'4\" and on the lean side so I don't want to very big. I guess I'll hang out with them the next 3 weeks and see how it goes. sn75: I really think the Penetrex cream has helped; in fact, I just ordered a refill yesterday. Maybe it's a placebo effect, but either way, it has helped with the nerve pain. I'm seeing the pain specialist tomorrow and will report back if I get any good advice. My nerve pain definitely improved after 3 weeks, but man, those 3 weeks were r-o-u-g-h. I think I have maybe had 6 days since surgery where I haven't cried at some point in the day, and I am not a crier. Also, I was allergic to the foam padding they put all around me after surgery and I took Benadryl for it- it was awful trying to get under the foam to scratch and when they finally took it off after a week, there were a few big blisters that had popped. At the very least, the Benadryl will help you sleep. I'm sorry you are going through all this! Michi: I definitely feel more pain in the morning. It's like a little thought bubble with \"WTH?!\" pops up above my head when I sit up in bed. I take an Aleve, make some coffee, and then sit still for 30 minutes while I wait for the Aleve to kick in. I also wake up every night with some pain but I usually just ignore it. I am 5 weeks out and have tried to run a little bit but each time I do, there's a painful tugging sensation on the lower outside corner of each breast, apparently from the sutures that hold my expanders in place. In the meantime, I've done spin, elliptical, hikes, treadmill walks, etc. I did 5 lb bicep curls yesterday, then briefly wondered why my left bicep was sore today, lol. My PS gave me the ok today to start lifting light weights, but my tissue expanders are on top, not under, the chest muscle and that may be why I can start.",
      "MessageIndex": 477,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 527,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 11, 2018 01:25PM ReadyAbout wrote: Well, I probably shouldn't have been so braggy about getting through all those needle sticks because I woke up with an infection in one breast (tissue is red, swollen, and hot to the touch) and now have a fever. I think it is most likely from yesterday's ordeal. PS is starting me on two antibiotics and hopefully that fixes things quickly because he said the alternative is a few days in the hospital on IV antibiotics, and I wouldn't want to miss my colonoscopy on Friday, LOL!",
      "MessageIndex": 587,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 620,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Aug 9, 2018 11:04PM ReadyAbout wrote: sn75: I hope your fill went well and that the chaos that always attends the beginning of school settles down to a manageable level. (Although you must admit the kitten and bookcases were self-inflicted, lol.) I went back today for teacher planning and school starts next Wednesday, so I will be with you in angst shortly. I am so ready to get these TEs out. I thought I had gotten used to them, but there's an edge poking out in one area that is very painful to the touch- like I can't even hold something between my arm and chest on that side because it's so sensitive. I have no idea what brand of implant I'm getting, I just know they are silicone and they are not gummies. My exchange date is Sept. 4. I think I will need grafting and a lift but my PS and I agreed to do it later, like at Thanksgiving or Christmas, so I don't miss more school. He likes to do grafting after the exchange anyway. My college roommate texted me today to see if I would talk to her cousin who has BC. She is only 32 and is having bmx, 20 weeks of chemo, and radiation - I think the cancer is stage 2 or 3. I feel guilty for having gotten through this (so far) with only a bmx and Tamoxifen. It certainly put things in perspective for me today.",
      "MessageIndex": 675,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Aug 30, 2018 07:31PM ReadyAbout wrote: Count me in the tired group. I went from doing nothing all summer to teaching/coaching/back-to-school events and I'm currently running on fumes. My exchange surgery is supposed to be next Tuesday, but I'm a little concerned that it's not going to happen because the tissue on my left side is starting to look more red and that's the side that had an infection last month. I don't have a fever and it's not hotter than the good side, so hopefully I can still have the exchange surgery. I left a msg on the voicemail at my PS office this morning asking if he wanted me to come in today and 4 hours later, still no response. *sigh*",
      "MessageIndex": 719,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Sep 5, 2018 01:18PM ReadyAbout wrote: Welp, I may have to join the September surgery group and then the December or January one! I had the expander on my infected side removed yesterday. It feels SO good to have the TE out - it was swollen and painful and looked like a tomato. The dr wanted to take out expanders on BOTH sides, replace with new expanders, and insert an antibiotic plate on the bad side, then do exchange surgery in a month. It didn't make sense to me to meddle with the good side, and I hated the idea of getting implant surgery just as I'm getting over the infection. At the last minute I told him I wanted the TE removed on my bad side and then sewn up and left alone to heal on its own. And I decided to leave my PS; he and his office have been so disorganized and a friend who is well-connected in the PS world advised that I get out now. I'm meeting with two PS tomorrow in the hopes of finding one who will be a better fit. I talk to my female students regularly about advocating for themselves and learning not to be afraid of conflict if it is needed, that they don't have to be pleasers all the time. Yet here I was enduring a PS who repeatedly disappointed me; I need to walk the talk now!",
      "MessageIndex": 721,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 744,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 775,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 3, 2018 12:36PM ReadyAbout wrote: PrairieDog- GOOD LUCK today and pleasantsa, GOOD LUCK tomorrow! I will be praying for y’all. It will go great! Ice packs are your friend! Curl up on the sofa when you get home and make people bring you peeled grapes and something fruity in a goblet while you binge on Netflix.",
      "MessageIndex": 35,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 3, 2018 07:32PM ReadyAbout wrote: SLL101984 - I'm really sorry you've got to go through the BMX. I estimate that 25% of my mental desktop is continuously running a file called \"Upcoming Mastectomy\" and there's no \"Command Z\" shortcut to undo it. Because of all the pink ribbons, cheery slogans and cute balloons, some people assume breast cancer is an easy road, and it's not. I'm guilty of assuming it was no big deal since the survival rates are so high, then I got cancer. If you are doing reconstruction, you may want to see if you're a candidate for prepectoral reconstruction and find out which plastic surgeons in your area do it. The implants go OVER, not under the chest muscle, so there's a much quicker recovery time. There is a board dedicated to this topic: \"TE/Implant Over the pectoral\". At the top of that board is a lengthy list of PS in each region of the U.S. who do prepectoral. Hope this helps!",
      "MessageIndex": 38,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 124,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 24, 2018 02:31PM ReadyAbout wrote: SLL101984- you made it! Congratulations! And I would not have turned a second night in the hospital down! I have TEs as well and while they aren’t the most comfy things, I can live with them. Give yourself some grace with the pain meds. I have been on them for 8 days now and the best I can do is space them 6 hours apart. I’ve tried skipping a dose and the pain is too much for me. (And I have a high pain threshold.) I am on Percocet and I talked to a pain specialist who said I can’t get addicted. After reading so much about the opioid crisis, I think many of us are wary of taking what we’ve been prescribed. I knew this recovery would be hard and even so, it has been very tough. I pity the first friend who congratulates me on getting new boobs.",
      "MessageIndex": 200,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 27, 2018 06:52PM ReadyAbout wrote: Daizy, FWIW, I had NSM on 5/16 without direct-to-implant. My PS does not like to do direct-to-implant because he wants to see how the tissue will respond. In my case, that was smart since my left breast/nipple are not doing that well post-surgery. I should get my drains out on 5/30. I do have tissue expanders, so I am not sure about NSM with nothing in there, but I imagine if you are keeping the same size or downsizing, you should be okay. I did not pursue the fat-grafting options since my number 1 priority was getting back to running. (I just reorganized our kitchen pantry - that's how stir crazy I am.) Did you do prepectoral reconstruction? There is a forum dedicated to that, although it's not well-titled. Here is link for the thread: https://community.breastcancer.org/forum/44/topics/835911?page=51#idx_1522",
      "MessageIndex": 251,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 4, 2018 04:48AM ReadyAbout wrote: sn75: every PS is different, but the general rule seems to be 30ml per drain/day before they are removed. I've heard of some PS who want it below 20 ml, but 30 seems to be the standard. I had all drains removed at 2 weeks post-op, but I won't have my first fill until one month after surgery because my tissue wasn't healing well when I saw the PS and now his schedule is full. I don't know of any rules about drains and fills, but I'm sure someone here can weigh in. I have tissue expanders and I guess there are ccs in there but the PS never told me anything about it and my boobs remind me of 2 aluminum cans that have been partially crushed.",
      "MessageIndex": 331,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 19, 2018 03:15PM ReadyAbout wrote: May Peeps: Thank you for all the encouragement! Who else outside of our elite club could possibly know what this is like? My PS either reads this board or felt bad about how he treated me on Friday because he called yesterday and is going to refer me to a pain specialist. While I am grateful that he came to his senses, I just can't imagine that I'm his first patient to have these issues. My pain is improving bit by bit, but regardless, I want to meet with the pain doctor since I have at least one more surgery in the future and I may have a similar reaction. Also, my cording is SO much better - I can straighten my arm all the way and the cords in the armpit are getting looser. The PT has been awesome to work with. kandyhunt: ZERO Oncotype?! WOW! That is fantastic - I've never heard of someone coming in at a zero. For once, it's good to have the lowest score on a test! My score is a 19 and when I meet with the MO in a few weeks, I'm sure he'll have a big ole bottle of Tamo waiting for me, lol. sn75 & blessed: the sunburn feeling/sensitivity is nerve pain - it's what I've been moaning about for the past month. There are 4-6 nerves on each side of the breast that are cut during a bmx and they sometimes react angrily to surgery. A few things I have found that help (besides drugs, since my PS wouldn't give me any): Penetrex cream (Amazon) - I slather it on 3-4 times a day and rub it in well. I think rubbing it on my skin, although painful, has helped desensitize the painful areas. Shower: putting the shower head on a strong setting and letting it hit the sensitive areas also desensitizes the skin. Caveat: I could even think about doing either of those things the first week or two of nerve pain, but now that I'm in week 4, it's tolerable. I also spent a considerable part of the first two weeks just walking around the house topless- fortunately, I have daughters. A friend who had nerve pain with her bmx said that she kept wanting to invent an inverse cone like dogs wear after surgery - one that would go around your neck and lift the shirt away from the skin - I have thought about that a gazillion times since! Bras: for those of you wondering about which bras to wear after surgery, there is a thread about this: https://community.breastcancer.org/forum/44/topics... Several people have recommended Coobie bras to me, and they seem to be comfy, but right now I'm more comfortable in zip up athletic bras from Athleta. Naked and Eberjay are also brands that have been recommended. ",
      "MessageIndex": 467,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 558,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Aug 15, 2018 08:43PM ReadyAbout wrote: kandyhunt: I am so sorrry about this setback. I almost had to have my TEs replaced in July when I got an infection, and I was really dejected at the prospect of waiting longer. As it was, I have to wait a little longer for my exchange surgery due to the infection. When we thought I would lose both TEs and have an extra surgery, my husband encouraged me to think about how far I'd come and all that I'd been through and to consider this a \"blip\" on the radar. For some reason, that pep talk calmed me down. Nothing about this is easy.",
      "MessageIndex": 684,
      "PostDate": "15/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Sep 13, 2018 04:01AM ReadyAbout wrote: Woop woop! My neighbor, who is a nurse practictioner in plastics, just came over and pulled my drain from the TE removal surgery last week. I feel glorious! Hopefully I won't ever have to see my original PS again. I found a new doctor and if there's an upside to all the complications, it's that it made me find a new PS. sn75: I will probably have expanders at least 7 months, so I feel your pain. I'm excited for your exchange surgery! My neighbor told me that expanders are a lot heavier than implants, and I feel like my right foob has sagged since my bmx/recon surgery. She says I will feel so much better when I get implants. Scars: some people swear by BioOil, others like Mederma, and there's a bandaid type thing called Scar Away that you put on your scars every day for a few months and it helps diminish them. My incisions haven't bothered me even once, and since I have two more surgeries ahead, I'm not spending any time on them yet. I'm too busy finding prosthetic inserts to put on my flat side, lol.",
      "MessageIndex": 734,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Sep 18, 2018 10:20PM ReadyAbout wrote: Thanks everyone for your replies on what you wish you had known. SLL: Woot woot! Congratulations on upcoming exchange surgery! Keep us posted on how it goes! So far, I don't mind being flat on one side and if my husband didn't care, I would probably go flat on both sides. The only downside to being flat is that wearing a prosthetic isn't very comfortable and I can't bring myself to wear one when I coach tennis or go to gym- it's still unbelievably hot in Nashville and I figure I'm 50 years old so no one's looking at me anyway, lol. The surgery to remove my infected TE was 9/4, and the PS never called me until yesterday to say that they had noticed I never came in for follow up and that I needed to come in. I called his office this morning, got a recording (of course) and left a message saying that I found a new surgeon to work with and that I wished him well in the future. I'm sure he told his receptionist that I was a troubled patient or something, but I took the high road and am moving on. I did tell my husband that if I have even one more problem with this bad side, I am going to stay flat on that side. I just want my life back.",
      "MessageIndex": 746,
      "PostDate": "18/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Oct 10, 2018 09:42PM ReadyAbout wrote: I wear a sleeve on my SNB arm when I lift weights because I have had axillary cording 3 times since bmx and I've had cellulitis (infection) twice on that side. I have read a few articles that say cording and/or cellulitis can increase risk of LE and with my luck, I will get it. I am currently flat on one side due to repeated cellulitis. I will get implant on the good side and new TE on bad side Nov 5. Maybe get implant on bad side in Feb but I also need hamstring surgery so I need to triage which body part is betraying me the worst, lol.",
      "MessageIndex": 776,
      "PostDate": "10/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Sep 7, 2018 02:29PM ReadyAbout wrote: I just had an expander removed and will be half flat for next two months. I've got steri-strips over incision site and I'm wondering when I'll feel ok wearing a Coobie bra? I plan to shove two inserts in the Coobie and hope that evens my sides out enough until I get a new expander in. Do any of you remember how long it took before you felt like you could wear a bra?",
      "MessageIndex": 134,
      "PostDate": "07/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Sep 14, 2018 10:59AM ReadyAbout wrote: I got a set of knitted knockers yesterday and am wearing one today on my flat side. So far so good! Knitted Knockers is a nonprofit and the rep for my region happens to live nearby so I went to her house yesterday to pick a set out. It was so cool! It's a group of knitters nationwide who knit these - she said it takes her about 3-4 nights in front of the TV to knit a set. They have all sizes and they leave a hole in the back of the knocker so you can pull the stuffing out and create the exact size you want. The yarn is super soft, not that I have any sensation in my chest anymore, lol. Here's a pic of my set. Check out their website! ",
      "MessageIndex": 138,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Oct 3, 2018 09:39AM ReadyAbout wrote: I met with BS yesterday. She hadn't seen me since a week post-bmx in May and was unaware I'd had so many complications. I am currently flat on one side and have a TE on the other side. I expressed my frustration at not being able to run and return to my normal activities - I need an MRI on my hamstring because it's torn, but I can't get the MRI as long as I have an expander in. Anyway, she said that it may take several more months of waiting to get an expander because I had an active infection one month ago. She also said I had a lot of scar tissue from 2 bouts of cellulitis as well as contracture of the tissue since nothing is in it now. I am now leaning towards going half flat permanently. I meet with the PS tomorrow to discuss options going forward - I switched PS last month so he is new to me. I was diagnosed Feb 1 and I think I've hit a wall in terms of wanting to keep this foob. I would appreciate pros and cons from anyone. I will be a full B cup on the right foob after implant. So far I don't mind the knitted knockers - I don't wear on at the gym or when I'm wearing a button down with a blazer, which I wear often at work.",
      "MessageIndex": 142,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 7, 2018 04:18AM ReadyAbout wrote: SLL and Nurselola: The whole thing is one interminably long rollercoaster, and I hate rollercoasters. As I sometimes say when friends ask how I'm doing, \"So far, I can't really find anything to recommend this experience.\" There are good days and bad days and when I'm having a bad one, I try two methods. One is saying silently to myself, \"Listen up, we really don't have time for this.\" and moving on quickly to the next thing; the other is to allow myself a few breaks in the day to feel down or have a \"micro cry\" for a few minutes. I am missing my grandmother's funeral tomorrow because this is my last week at school before I have surgery and I have mountains upon mountains of things to do before I leave. I try to enjoy the small things every day and remind myself that I am still on the right side of the grass while I have friends and relatives who haven't been so fortunate. Today I went hiking with a friend and the trees on the hillsides were beautiful and everything was green and it was like walking through an e.e. cummings poem.",
      "MessageIndex": 61,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 14, 2018 05:34AM ReadyAbout wrote: uneedaklu, welcome to the May group and sorry for the reason you are here! Yes, the waiting is terrible and unfortunately there are lots of ups and downs, dead ends and detours, good news followed by bad news. I wish someone had told me that when I was first diagnosed. It can be demoralizing dealing with the unknowns but the forums here are a great resource. Chin up and deep breaths.",
      "MessageIndex": 101,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 19, 2018 12:27AM ReadyAbout wrote: Faster: I had a heart attack at age 41. I have a heart condition that was never diagnosed correctly until I had the heart attack.. Your docs will want to run a gazillion tests on you and probably start you on a regimen of beta blockers, calcium channel blockers, and a statin. The beta blockers are terrible - they made me very sleepy and apathetic and I stopped taking them after 3-4 weeks. Nine months later they took me off the statin. It's like they have a standard protocol and will follow through with that whether or not it makes sense. Very frustrating. Oneof7: has your PS discussed prepectoral implants with you? This is a newer type of reconstruction - the implants ride on top of the muscle instead of underneath, so the recovery time is quicker. I had prepectoral done 2 days ago. The PS said he may have to go back in at a later date to add some fat grafting, but time will tell.",
      "MessageIndex": 156,
      "PostDate": "19/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 25, 2018 03:54AM ReadyAbout wrote: 8 days post bmx and today I finally started feeling like myself again. The most bothersome thing (aside from drains) is a hematoma I have under my armpit from the lymph node removal. It feels like I'm trying to smuggle a small lime past TSA. It doesn't hurt, but it is very uncomfortable since it's so big. The BS did an ultrasound of it yesterday and said that she could try to aspirate it, but it's full of coagulated blood and not very much would come out, so I passed on her generous offer. My path report came back with all good news so I will do leprechaun kicks as soon as I feel up to it!",
      "MessageIndex": 212,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 31, 2018 02:18PM ReadyAbout wrote: good luck, eo2378! I’ll be praying for a smooth surgery and positive results",
      "MessageIndex": 299,
      "PostDate": "31/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 10, 2018 02:04PM ReadyAbout wrote: Tomorrow is my last day of hyperbaric oxygen therapy (yay!) and the next day I start PT for cording/webbing in my SNB arm. Did anyone else have cording? Tight cords go from my armpit to below my elbow and I can't straighten my arm or reach for things without significant pain. I did one session of PT last week and one of the cords popped and while it was a little unpleasant, it was nice to have that release. I'm still having nerve pain/hypersensitivity but doctor wouldn't prescribe nerve pain medicine. I have been taking a half dose of Percocet when I wake up and then Advil the rest of the day, but I'm on the verge of tears by late afternoon and I'm not a crier. Wearing no shirt/bra provides instant relief but I can only do that around the house. (: I will see the PS on Friday and if I'm still having the nerve pain, we are going to have a little \"Come to Jesus\" talk.",
      "MessageIndex": 392,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 29, 2018 01:52PM ReadyAbout wrote: I'm relieved to hear that others are still dealing with fatigue - I am surprised to still be this tired. I think part of it is due to waking up a gazillion times during the night and part is recovering from the surgery. I just started a muscle relaxant at night due to a hamstring injury and even that isn't helping me sleep well. I'm usually tapped out by 9:00- I went to an outdoor concert the other night with my husband and by 9:30, all I could think about was lying down and going to sleep in the grass, which to my credit, I didn't. I turn 50 tomorrow and for my birthday, my PCP scheduled a colonoscopy, so I have that to look forward to in a few weeks. I told a friend that one of the hardest things about this stage of the recovery is wondering when I will enjoy things and look forward to things like I used to. I feel like a subdued version of myself. A friend who has gone through this reminded me that all of us in the May group are currently in the intermediate stage of recovery, which is the hardest stage. It will get better even if it feels like that day is distant.",
      "MessageIndex": 530,
      "PostDate": "29/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 4, 2018 02:17AM ReadyAbout wrote: Faster: I know it's been a long road, but the side that had necrosis has healed so well! It looks good! My left side looked the same way and that's when I did the hyperbaric treatments to help it heal. It looks like your tissue is well on the way to full healing. I started Tamoxifen on Saturday. Based on my Oncotype, I have a 20% chance of recurrence somewhere else in the body later; taking Tamoxifen for 5 years will lower the odds to 12%, which still sounds kind of crappy odds to me, but the MO said that 95% of his patients with the same profile take the Tamoxifen. Has anyone else started Tamo yet? My PS cleared me to resume lifting weights so I'm back in the gym doing slightly lower weights with more reps. I still have some cording, which makes some things difficult, but overall I feel more confident using my arms in all kinds of weights. Do the stretches and arm exercises, friends! They will really help you regain range of motion quickly! Happy 4th, friends!",
      "MessageIndex": 548,
      "PostDate": "04/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 682,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Sep 16, 2018 03:32AM ReadyAbout wrote: I'm meeting with someone tomorrow who will have bmx/recon in November. I am going to print out a supply list that someone shared with me before my bmx. Other than that, is there anything you wish you had known before surgery? Anything advice that was particularly helpful? I'd like to put together a list of advice/insight that I can share with others in the future.",
      "MessageIndex": 736,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 806,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 1, 2018 04:13AM ReadyAbout wrote: Pleasantsa: You the real MVP of this board! Thanks for putting the list together! MiAnBu and BlueSky1969, I will be lifting up you and your medical teams in prayer tonight and throughout the day tomorrow. When you feel up to it, please post and let us know how it went. You can do this!",
      "MessageIndex": 27,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 8, 2018 05:06PM ReadyAbout wrote: Praying for smooth surgery and best possible outcomes, Mtnx and traildweller! Please update us when you are able!",
      "MessageIndex": 70,
      "PostDate": "08/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 10, 2018 03:43PM ReadyAbout wrote: Hi eo2378, I am so sorry that you are going through cancer yet again. Phantom pain is possible but I am unsure of its probability. Here is a link to a short article. Did your BS discuss it with you? http://www.breastcancer.org/treatment/side_effects/phantom_breast_pain",
      "MessageIndex": 87,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 17, 2018 10:27PM ReadyAbout wrote: Hello May Friends! I am back at home - had the BMX, SNB, prepectoral reconstruction with TEs. The pain from the SNB injections was not too bad. They numbed the area up with lidocaine and I felt 20 seconds of stinging with each shot and then felt fine. The hardest part was getting up to use the bathroom several hours after I awoke from surgery- I was super wobbly/dizzy and my husband and a nurse had to help. I felt like I was going to throw up but then I felt great as soon as I got back into bed. And... to add insult to injury, my period showed up for surprise visit so the nurse had to help me with deal with that as well - whatever they are paying her, it's not enough. Nodes were clear (wahooo!) and the BS and PS said everything went well. The most helpful thing so far has been a post mastectomy sweatshirt that a friend bought for me on etsy. It has large pockets sewn on the inside to hold the drains and it's lightweight so I can wear it all the time. Here is a link for it. Post mastectomy hoodie Good luck everyone - you've got this!",
      "MessageIndex": 145,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 21, 2018 09:54PM ReadyAbout wrote: As soon as I skipped a dose of Percocet, my intestines worked like it was some kind of race. Glad to check that off the list of concerns. I got the bandaging off today which was fabulous since my skin had a reaction to it and I was miserable with blisters and itching. Got one drain out and the other three have to wait 2 more weeks. I’ve had a fever the past 3 days so I’m getting an ultrasound just to rule out a blood clot. The right breast looks great, the left one is so-so with a 50/50 chance of some tissue becoming necrotic. Dr said it’s one of the risks in nipple sparing reconstruction. He said there’s nothing I can do to help the left side succeed other than pray. I’m just so happy to get the bandaging off. I almost clawed my chest off this morning because the itching was so intense.",
      "MessageIndex": 174,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 186,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 217,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 26, 2018 06:05PM ReadyAbout wrote: Tampa59: SNB is the pits! (thank you ladies and gentlemen, remember to tip your waitress....) I had SNB on my left side and that side is much more tender, achy, sunburn-ish, etc. than the right. I also have far less range of motion on the left side than the right - I really notice it when I'm reaching for something or doing the exercises I was given. To top it off, I have a hematoma at the site of the SNB incision and it is uncomfortable. My surgeon discussed doing SNB on my good side since I was having a bmx. She said that if they happened to find cancer in my \"good\" breast after it was removed, it would be good to have already done SNB on that side and have the pathology. At first I said ok, but then I read about what SNB entails and possible side effects, and I changed my mind. I am SO GLAD I did not consent to doing SNB on the good side! The pathology on the good side came out clean and I was spared the discomfort of SNB on both sides. I could tell that the surgeon thought it would be better to do SNB on both sides, but I was resolute in my decision and this time, it paid off.",
      "MessageIndex": 239,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 29, 2018 09:45PM ReadyAbout wrote: Kelligirl5: I have a hematoma in my armpit from the SNB and I honestly feel like it gets bigger when I am active and then shrinks a bit when I sleep at night. Have you noticed yours changing size at all? Also, mine is hard and about the size of a small lime. I just walked a mile with a friend and I swear it grew just from that. I have put a heating pad on it at different times but I can't tell a difference. I am sorry you are having these issues, especially since you're back to work!",
      "MessageIndex": 277,
      "PostDate": "29/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 279,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 1, 2018 02:12AM ReadyAbout wrote:",
      "MessageIndex": 305,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 310,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 341,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 7, 2018 12:50AM ReadyAbout wrote: SPDGirl: I am 3 weeks post-BMX and just shaved my armpits today. If my PS gave me a waiting period, I don't remember it. I talked to a few BC survivor friends about how to do this because I tried to shave in the shower and then would check later and it looked like nothing had been shaved. They said to look in a mirror while I'm doing it - that due to swelling/TEs/implants, the angle will always be kind of weird. All 3 of them said they still have to use a mirror to shave. Also, there are two different Oncotype tests for BC: one is for DCIS and one is for invasive. They both have very different scoring ranges so you definitely want to be sure you've got the right test range for your score. Also, FWIW, I was ambivalent about doing reconstruction and I might have very well been tempted to skip it if my husband didn't have an opinion. He would have supported me if I had not done reconstruction, but he said that if I was okay with it, he would prefer that I go for it. I am not sizing up or anything, so clearly he won't be ogling a new, supersized set. I pointed out to him that if 1 out of every 8 men got testicular cancer and had to get their testicles removed but could opt to leave the skin and meanwhile choose the the new shape and size of their fake testicles, and oh by the way, there will be no sensation or functional purpose to them now, very few would make that transition. My husband gets a chest cold and acts like he's in the last stages of tuberculosis. {...rolls eyes...}",
      "MessageIndex": 363,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 403,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 22, 2018 03:08PM ReadyAbout wrote: OK Friends, I went to the pain specialist yesterday and here is my book report for anyone who needs it. She was SO helpful! She slowly listed several different medications and the side effect of each, and then we agreed on a plan. For those of you with nerve pain, there are several drugs that are effective for treating it and it just depends on your situation/pain. My doctor and I decided on Cymbalta, which happens to be an antidepressant also used for treating nerve pain in diabetic patients. It won't make me sleepy or groggy, I can drive on it, it's not considered a narcotic/opioid, and it's kind of a 2-for-1, as it will treat any situational depression I may have in slogging through cancer treatment. She also prescribed a topical ibuprofen gel called Voltaren; it is used for joint pain but can be effective for nerve pain as well. I'll slather that on several times a day and also keep up with the Penetrex cream I've been using. She also mentioned taking Cymbalta ahead of my next surgery to minimize potential nerve pain afterwards. Finally, she said that although opioids get a bad rap because of the addiction issues that are always in the press, they are precisely the drug people need to take after major surgery. She said no other medication will touch the post-surgery pain as effectively as narcotics like Percocet, especially after you've been \"flayed open in a mastectomy\". It was just nice to hear a doctor acknowledge what a ruthless surgery this is. Hope this helps! It sounds like many of us are dealing with some challenges at precisely the point we expected to be getting back into the routine of our previous lives. I really feel for those of you with little ones at home! I don't know how I would managed this back when mine were that age; my younger one is a whirlwind of energy and was always swinging from the rafters on a good day.",
      "MessageIndex": 485,
      "PostDate": "22/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 23, 2018 03:56AM ReadyAbout wrote: FaithsMama: I'm certainly not a doctor, but I wonder if an oral steroid would help with some of the symptoms you are describing: the swelling and the itching? I had numbness/tingling in my hand on the SNB side the week after surgery and my PS put me on prednisone for about 5-7 days. Apparently I had swelling in the arm that was pressing on nerves? Just a thought. I'm sorry you are still in chronic pain - it can feel very isolating, especially when you are surrounded by people who have no idea what you are going through.",
      "MessageIndex": 489,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 30, 2018 03:39AM ReadyAbout wrote: Marena: So sorry you are dealing with the ups and downs of a healthcare team that isn't consistent. You'd think that we would at least get a pass when it comes to post-surgery complications, but I guess not. This may not be a popular opinion, but I decided after I was diagnosed to seek out female healthcare providers. Whether it's a fair assessment or not, I feel like women listen better and are less likely to finish my sentences or chalk me up as an uppity patient. Since then, I've found a female PCP, orthopedist, PT, etc. and I've been so pleased with my experience each time. Also, my mother was a physician recruiter for a large medical clinic and she once told me that when push comes to shove, a PA is often a better listener than an MD, so my PCP is a PA and so is my pain specialist. My only truly bad experience this entire time has been with my PS, which unfortunately, is a big piece of the puzzle. I hope the pieces fall into place for you, and sooner than later. {hugs}",
      "MessageIndex": 534,
      "PostDate": "30/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 7, 2018 12:39PM ReadyAbout wrote: ljm33- I had bad back pain for a week or two after surgery. I really wanted to go get a deep tissue massage, but of course, couldn't lie facedown, so no luck. I used a \"shepherd's crook\" back massage tool that we already owned and went to town digging into the spot that was really bad. Somehow it worked and pain went away. It looks like this and you can find them on Amazon.  faithsmama: it sounds like your tissue expander may have \"window-shaded\", or flipped up. A friend of mine had it happen and said it was terrible. I am so sorry the pain and discomfort have continued! Question on fills: I had my first fill about 2-3 weeks ago and get another one on Monday. My fills have saline. Do the fills \"settle\" into the tissue as time goes on? My right foob has kind of caved in and my husband is convinced the saline is leaking. I just think the expanders have sunk down into the tissue. Either way, I hope it doesn't throw off the schedule for exchange surgery. I'm hoping to get it down Labor Day week when all of our students are on field trips so I don't miss class time.",
      "MessageIndex": 570,
      "PostDate": "07/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 589,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 16, 2018 12:14AM ReadyAbout wrote: Michi and SLL: I LOVE the photos of your gorgeous daughters! Makes me miss the days when my girls were that age - they are teens and a little averse to cuddling, lol. FaithsMama: you are juggling A LOT. You should be really proud of yourself for having come this far and also for dealing with so many issues at once. I hope things improve SOON! I got paroled from the hospital yesterday, just in time to go to a concert last night! My closest college friends had all come to town for it, and it was such a gift to be able to join them. I'm not out of the woods yet with this left foob - taking two antibiotics and checking in weekly with the doctor. If it doesn't heal 100% when I'm done with antibiotics, I'll have to get the expander taken out and he'll put in an \"antibiotic plate\" and a new expander ON BOTH SIDES. Ugh. Fingers crossed and prayers lifted it doesn't come to that. Also, only having one arm as a viable option for blood draws and IV tubes is really hard! My right arm was a pin cushion by the time I left. On a bright note, friends took time to visit with me while I was in the hospital so I had a steady stream of people to talk to and had some great conversations. I was mildly concerned about keeping up my streak of drinking one different craft beer every night this summer, so one of my friends snuck in a cold IPA for me. Good times!  ",
      "MessageIndex": 616,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 24, 2018 11:07PM ReadyAbout wrote: Greetings from Antibioticsville, Population: Me I saw my PS yesterday, one week after being out of hospital for infection. I've been on two antibiotics at home for the past week. The good news: the infection looks much better, which he wasn't expecting. We both thought I would be having surgery this week to take the expander out. Not-so-good news: infection isn't totally gone so it's another week on antibiotics. I can't do exchange surgery until this infection is resolved for at least a month or two, so it's frustrating. And we had to cancel my only trip this summer, which hit me really hard. We were supposed to fly to a bluegrass festival in Oregon but had to cancel since the infection wreaked havoc on my white blood cell counts and endurance. I am a teacher and normally I have all kinds of adventures in the summer - instead, I've only made it outside the city limits once since May. Waah waah... first world problems. In the meantime, I'm prepping today for colonoscopy tomorrow because turning 50 is fun! I'm quickly learning that doing a \"cleanse\" while on strong antibiotics isn't the easiest way to do things. The one bright spot is being able to wear my magnetic employee badge on my tissue expanders when I report for work Aug. 9. It's the little things...",
      "MessageIndex": 642,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 713,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Apr 28, 2018 03:09AM ReadyAbout wrote: MiAnBu - good luck on your surgery Tuesday! I am glad you found us! I was diagnosed on 2/1 and this forum has become my Facebook/Insta/Twitter since then. You and I can share notes on the joys of TEs after mastectomy, lol. Prairiedog- best of luck on the lumpectomy! For me, biopsy was actually a bit more painful than the lump. The day after lumpectomy I walked on treadmill, pruned all the hydrangeas in our yard, and went to grocery store. I had more discomfort a week or two later, as I remember guarding the \"bad\" side when walking in big crowds at school. Y'all are going to do great. We can do hard things!",
      "MessageIndex": 15,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Apr 30, 2018 08:30PM ReadyAbout wrote: Kelligirl5, FWIW, I had a lumpectomy in February and it was much easier than I expected! I had no pain the following day and ended up doing some yard work and errands. I did keep those little ice packs on for the first 24 hours or so. I did not have SNB done at the time, so that may be painful post-surgery. I went back to work a couple of days after the surgery. I did have some discomfort the following week, mainly I noticed that when walking briskly, the incision site was kind of painful and I kept holding my arm against my side to keep the breast still. As for your kids, I think teens are often a lot more resilient than we give them credit for. My kids (19 & 16) got very worried when they realized we were keeping something health-related from them, but when we told them what was going on, they did fine. I think because I was very matter-of-fact and upbeat, they responded accordingly. (Or maybe I have done a superb job of raising them to not be emotionally attached to me, lol.) I feel you on the timing of surgery with end of the school year! It's terrible timing with all the festivities and chaos of the end of the year, but we can't control everything. I am a teacher and will miss the last 10 days of school because I'm having a mastectomy. No idea how I will write all those sub plans but somehow it will get done. Let us know how the biopsy goes!",
      "MessageIndex": 22,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 3, 2018 03:36AM ReadyAbout wrote: SLL101984: I am at the point of losing my mind. I have been in limbo most of 2018. I hope all your puzzle pieces come together quickly, but my genetic testing took at least 2-3 weeks of waiting. Also, I was supposed to find out my Oncotype score on 4/5 and through a comedy of errors, my tumor wasn't processed by the lab, and when it finally was, the lab called the oncologist to say my cancer was invasive, not DCIS. Every single one of my doctors said they had never seen that happen, and my MO was actually very upset about it, but I have a rare cancer that is hard to diagnose on slides. I'm getting dmx, SNB and prepectoral recon on 5/16 because I'm not a good candidate for radiation. I find that the closer I get to mx date, the more emotional I get, which has surprised me. It has been very challenging to teach and deal with the end-of-year shenanigans of middle schoolers and stay positive; I feel like I've earned an Olympic gold in compartmentalizing. I have known since 1/9 that something wasn't right, so I am ready for surgery. As Tom Petty once said, \"The waiting is the hardest part.\"",
      "MessageIndex": 33,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 5, 2018 07:03PM ReadyAbout wrote: MiAnBu - welcome back! I'm glad to hear your surgery went well! Sounds like you are getting around nicely! I hope surgery went well for BlueSky as well. My 32 year old cousin found out 2.5 weeks ago that he has testicular cancer and he's already had surgery, scans, and started chemo. It was shocking to me how fast the treatment protocol is for testicular cancer vs. breast cancer.",
      "MessageIndex": 51,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 6, 2018 04:04AM ReadyAbout wrote: Pleasantsa: thanks for updating all the names and surgery dates! Great to know that all went well yesterday, and I really appreciate you detailing what the SNB prep work is like. I thought I'd be passed out during the geiger counter part and I never considered that they might do a mammo or some other test before surgery starts. Some have said that the dye injection is horribly painful while others sailed through it - guess I'll find out soon, lol. Journey: I'm sorry you're joining the sorority that no one wants to be in, but welcome aboard! There's a lot of info to ingest about BC and my unsolicited advice is to research enough to ask good questions at your dr appts but not so much that you get the \"WebMD\" effect, i.e. convinced you need to get your affairs in order. This website is a phenomenal resource and as you add information about your particular cancer to your personal profile, the website automatically downloads relevant articles for you to read. Finally, deep breaths. Breast cancer involves a lot of tests and a lot of waiting, and if you are a Type A person who enjoys an orderly, logical progression, it can be hard. And if you figure out how to relax through all this, tell me how. (:",
      "MessageIndex": 56,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 9, 2018 05:55PM ReadyAbout wrote: I honestly had more discomfort after biopsy than lumpectomy - not sure why. Neither was bad, but when the pain meds wore off from the biopsy, I felt like someone had punched me in the side of the breast as hard at they could, while lumpectomy discomfort was mostly at incision site and hypersensitivity of the nipple which took at least 2 months to improve. I just got an email from surgeon's office about an appointment on Monday that I knew NOTHING about - I called and it turns out I have to meet with the surgeon before my bmx on Wednesday. I'm Type A so I know I didn't leave my last appointment with this scheduled. *SMH* I'm glad I had already decided to take off from work on Monday and Tuesday, but I'm a little bummed that part of both days will be spent at doctor and hospital getting ready for the surgery.",
      "MessageIndex": 81,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 16, 2018 01:37PM ReadyAbout wrote: Headed to the hospital now - a little SNB, a little DMX, some recon with TEs, and I may ask them to take a look at my right hamstring, lol. See you on the other side, friends!",
      "MessageIndex": 114,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 20, 2018 10:06PM ReadyAbout wrote: The Percocet has my intestines shut down in gridlock so I just switched over to Tylenol this afternoon. I’ve barely eaten since last Tues- no appetite- but I’ve taken Miralax, prune juice, stool softeners, etc. and still no bowel movement. A friend who has been through bmx had the same experience with painkillers and had to go off pain meds. I keep thinking of that scene in Dumb & Dumber where one of them takes Turbolax and then can’t flush the toilet. I should probably Yelp some area plumbers ahead of time, lol.",
      "MessageIndex": 170,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 26, 2018 01:38AM ReadyAbout wrote: Michi- I ordered a wedge pillow on Amazon and I put my usual pillow on that and have slept well. I am usually a side sleeper so I've been pleasantly surprised by how well I've slept on my back, but I definitely need the wedge. SPDGirl: I think pain bulbs are used in more progressive hospitals, at least that's my theory. I was given Percocet and a pat on the back for pain. I did get two kinds of exercises and I've been fairly faithful about doing them. It's weird though, because one involves raising my hands/arms slowly and there's a distinct clicking feeling that I think is the tissue expander clicking against cartilage. It's gross. I've had friends who were told to do no exercises and friends who practically needed a gym membership to do what their dr wanted, so each dr. is different. Also, FWIW, I'm on day 9 post bmx/snb and I only took one Percocet at 8 a.m. this morning and have taken Ibuprofen since then. The past two days have been exponentially better in terms of pain and my ability to see some shafts of light come through. I don't think I would relive week 1 for all the money in the world.",
      "MessageIndex": 232,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 248,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 28, 2018 04:24PM ReadyAbout wrote: I was just reading the discharge papers from the hospital (12 days after surgery, lol) and it said that if the output from the drains is less than 30ml in 24 hours, call the doctor. My PS never mentioned this and 2 of my drains have been less than 15ml for the past 6 days and the other one has been under 30 for 3-4 days now. My PS has been on vacation the past week so I wouldn't have gotten them out earlier, but I wonder if timing matters at all. In any case, it has been a pain (literally) to keep these things in longer than necessary. I will see him on Wednesday and hopefully get more than a \"drive by\" appointment - he hasn't been very attentive in appointments, even by my relaxed standards.",
      "MessageIndex": 258,
      "PostDate": "28/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "May 29, 2018 04:39AM ReadyAbout wrote: Hi Patchie, I am in week 2 of recovery and I feel so much better than week 1! I can only speak for myself, but week 1 was very difficult. Stay on the schedule for pain meds and have them by your nightstand so you don't even need to get up from the bed to take them during the night. Week 2, the things I still need help with: Driving - I am not supposed to drive until I am off pain meds, and although I only take them when I wake up and when I go to bed, I don't want to drive because SNB has left my arm very tight and unreliable at the moment. Since I'm not driving, I bought a subscription for a grocery delivery service called Shipt and that has been great. Bathing: I can't shower until my drains are out so I am doing the best I can but I can't reach my back. I have to enlist a family member to help but you could totally skip that. Dressing: go with button front tops and elastic waist pants (sweatpants) in case you have trouble dressing. I bought several large button downs at Goodwill and have lived in them and large hoodies the past two weeks. The skin at incisions sites and on the SNB arm is extremely sensitive and I just want to wear soft things. That's about it. I am 49 and an avid runner so I thought I would weather all this better than the average person and I was wrong. I don't think I stayed on top of the pain meds and when the pain hit, it was staggering. Things distinctly improved exactly one week after surgery. I have walked the neighborhood, gone hiking, and done the recumbent bike at the Y, all at probably half speed, but just doing something active has been a balm for the soul. Finally, don't be reluctant to reach out to people - they want to help, they just aren't sure how. When I was first diagnosed someone pulled me aside and said, \"When you let people help, you are blessing them.\" We don't get any bonus points or gold stars for navigating this on our own - ask for help when you need it and someone will be delighted you did. Good luck with your recovery - you've got this!",
      "MessageIndex": 269,
      "PostDate": "29/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 2, 2018 05:44AM ReadyAbout wrote: Joy- that’s my biggest challenge right now: the sunburn feeling/hypersensitivity in armpits, sides, chest, etc. I am 2.5 weeks post bmx. I talked to the surgeon today and he said it’s not uncommon. He said there are 4 to 6 nerves that are cut on each side of the breast so there’s going to be nerve pain. I told him I’m wary of staying on Percocet (although I’m resentful of the media for making me scared to take pain pills when I’m in actual pain). He said to try 800 mg of Advil three times a day and see how that goes. He recommended that I only do that heavy dosage for about five days but it should get me over the hump of this pain. I am still going to take a Percocet first thing in the morning for several more days because everything hurts. I’m waking up most nights at 2 or 3 and taking Advil. I have always had a high pain threshold (I went to gym day after lumpectomy) so this kind of pain has been an unwelcome surprise. Getting into really soft pajamas early in the evening has been a huge help.",
      "MessageIndex": 318,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 2, 2018 07:17PM ReadyAbout wrote: FaithsMama: Yes, I've got tissue expanders - they are gross but I'm trying to be kind to them. I also have some funky autoimmune issues and I think that must be part of my hypersensitivity. I feel really good in the morning because I take a Percocet. I went to spin class this morning and my spin teacher was surprised to see me there and I was like, \"Yeah, but I'll be in pajamas by 4 this afternoon and curled up in a fetal position.\" I feel absolutely terrible later in the day although the Advil helps somewhat.",
      "MessageIndex": 320,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 372,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 11, 2018 01:02AM ReadyAbout wrote: Here is a picture of what cording can look like and it is exactly what my arm looks like. Another term for it is \"axillary webbing. Cords in armpit and at inside elbow - a quick test to see if you have cording is to simply raise your arm above your head and the cords should be visible. The PT is not going to be fun but I want my *&$(*%&@ arm back. ",
      "MessageIndex": 397,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 12, 2018 06:36PM ReadyAbout wrote: Triple: I just finished a PT session for cording and while it’s painful, it feels so much better afterward. I also have a surprising amount of scar tissue on the left side and she dug into that’s as well. I will see PT three times/week for the next 4-6 weeks. FaithsMama: I am with you re: the pain. I called my PS to ask for meds specific to nerve pain and he wouldn’t prescribe anything. I will see him on Friday and I’m not leaving the office without a plan for this pain. In the meantime, a cousin in CO is sending me some low dose marijuana candy to see if it helps with nerve pain. I figure it can’t hurt to try and I’m so frustrated I can’t see straight.",
      "MessageIndex": 411,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 434,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 465,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 496,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jun 26, 2018 04:25AM ReadyAbout wrote: Faster: I am so, so sorry you are going through this. When something this ridiculous happens, my husband always says (sarcastically) \"And yet we supposedly have the best healthcare in the world.\" When you meet with the doctor on Thursday, you may want to ask him to give you a supply of dressings to last you until the next appointment and if there's a way to apply a dressing that works better. When my tissue wasn't healing, I had to visit a wound doctor while doing the hyperbaric sessions. She ended up ordering a special dressing called a Sorbact gel dressing - it was a mesh strip designed for infected wounds. Here is a link for it. My insurance had to approve it so maybe it's expensive, but it's worth a shot. I would put this on every 2 days and a giant square bandaid over it. https://www.bsnmedical.com/products/wound-care-vascular/category-product-search/advanced-wound-care/wound-bed-preparation/cutimedr-sorbactr.html",
      "MessageIndex": 503,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 5, 2018 07:06PM ReadyAbout wrote: blessed: Like most drugs, Tamoxifen can have a wide range of side effects and nausea can certainly be one of them. There's a forum dedicated to Tamoxifen, but keep in mind that almost everyone on that forum is having side effects, so it's narrow demographic chiming in. The most common side effects I hear about are joint pain and weight gain. (Why can't side effects ever be clear skin and weight loss??) I had bad nausea the first few days on Cymbalta - I almost stopped taking it after the first day because the side effects were so bad. I stuck with it and feel totally fine on it now. It may be that your body needs a few days to adjust to Tamoxifen. Good luck!",
      "MessageIndex": 557,
      "PostDate": "05/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 10, 2018 09:43PM ReadyAbout wrote: Off topic, but I just have to mention this: I had to get a large needle injection in my hamstring today for a running injury. It involved drawing blood, spinning it down to get the platelets, then injecting those back into the hamstring. Anyway, I had read about it on different forums and many, many runners said the injection pain was unimaginable and they would never do it again. The doctor and nurses had a tough time finding a vein on me that was big and wouldn't roll and they stuck me at least 15 times in my right arm, wrist, hand, etc., finally getting enough blood from the veins on my feet. They kept apologizing and I was like, \"This is NOTHING compared to mastectomy surgery.\" Then when the doctor did the big injection, I didn't realize it was over, because again, NOTHING will ever compare to mastectomy surgery. We have walked through fire and come out the other end and I think many, if not all of us, will be tougher than ever in the face of adversity. I am grateful for all of you who have shared the ups and downs of this difficult journey - y'all are a tribe of strong women!",
      "MessageIndex": 579,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 13, 2018 05:47AM ReadyAbout wrote: SPDgirl: some states let you do a certain number of PT visits without a referral. In TN where I live, it’s 15 visits. Definitely push for seeing a PT- they are so helpful! FaithsMama: I am so sorry you continue to have chronic pain. I know it probably consumes much of your waking thoughts. Have you seen a PT yet? They may be able to help with any tightness. What does your dr say? I get to skip the colonoscopy tomorrow because I’m in the hospital getting a boatload of IV antibiotics. My infected foob was more swollen today so PS made me go to hospital. Apparently it’s called cellutitis and it can get bad if not treated early. Blazing a trail through Netflix over here...",
      "MessageIndex": 598,
      "PostDate": "13/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "ReadyAbout wrote: Anyone out there scheduled for May yet? I am having double mastectomy and reconstruction May 16 and would love to connect with others who are going to belly up to the bar in May. Dx 2/1/2018, IDC: Papillary, Left, 1cm, Stage IA, Grade 2, 0/5 nodes, ER+/PR+ Surgery 2/23/2018 Lumpectomy: Left Surgery 5/16/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Silicone implant, Tissue expander placement; Reconstruction (right): Silicone implant, Tissue expander placement Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 651,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Aug 18, 2018 03:14AM ReadyAbout wrote: I have been on Tamoxifen for 7 weeks and my exchange surgery will be Sept 4. MO never mentioned anything and neither did PS, but PS is so disorganized that he would never think about a detail like that. I learned that his nurse is also his receptionist, which explains why it’s chaotic over there To make matters worse, she quit recently and last time I called, my PS’s wife was answering the phones.",
      "MessageIndex": 697,
      "PostDate": "18/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "ReadyAbout",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268199/profile",
      "Content": "Jul 23, 2018 10:48PM ReadyAbout wrote: Someone on another board here used a sonic massage to break up her cords. I did PT for it and thought it had gone away, but no, there's still some cording in there and it's annoying. I notice it when I reach for things or stretch my arms out at the gym, like doing lat pulldowns. I massage the cords while I watch TV and I'm tough on them, but they won't go away. I'm going to try the sonic massage.",
      "MessageIndex": 3,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/865619",
      "Title": "Sonic massage for cording / lymphedema with Clarisonic Mia ? Jeremiah29-11 Rah2464"
    }
  ]
}