{
  "AuthorID": "realtimedyno",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59525/profile",
  "Posts": [
    {
      "AuthorID": "realtimedyno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59525/profile",
      "Content": "realtimedyno wrote: Hello again.  Not only is my daughter waiting for results of a \"suspicious\" tumor in one breast, but also a \"nonpalpable\" mass discovered during ultrasound in the other.  This mass is in the upper center part of the breast, and the radiologist told her it was distinct in appearance from surrounding tissue.  I can't find anything on the internet that fits this description.  It's about 3 cm in size, but she couldn't feel it. Thank you so much for any response.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/695632",
      "Title": "Nonpalpable mass on ultrasound realtimedyno Beesie"
    },
    {
      "AuthorID": "realtimedyno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59525/profile",
      "Content": "realtimedyno wrote: Hello--My 31 year-old daughter had a lump checked via ultrasound and the radiologist immediately did a core biopsy.  He said the ultrasound was very suspicious because the edges of the tumor were \"furry\"--not smooth.  They weren't wild (I think the word is spiculated), but still not smooth. Yhe other MD told my daughter he'd never seen an ultrasound reading with furry edges that turned out to be benign. And lo-and-behold, the other breast showed a mass that was nonpalpable, in the upper breast area, so they biopsied that one, too. s  We're worried sick, and the results won't be back for ten days. Does anyone have any experience as to how accurate an estimate is from the ultrasound?  Any observations would help our anxiety. Thanx  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/695590",
      "Title": "ultrasound MD: It's a 50/50 change of malignancy realtimedyno leaf"
    }
  ]
}