{
  "AuthorID": "Rebas2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108056/profile",
  "Posts": [
    {
      "AuthorID": "Rebas2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108056/profile",
      "Content": "Jul 14, 2011 03:34PM Rebas2 wrote: I love your attitude :-)  Your post made me chuckle.  We are proud to be here!!",
      "MessageIndex": 335,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Rebas2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108056/profile",
      "Content": "Jul 14, 2011 03:57PM Rebas2 wrote: Barbe1958, I like your sense of humor too.  I am reading all the posts on the reconstruction because I think I am reassuring myself with what I think to be my final decision.  I believe to be 95% sure that I will stick with the \"flat look.\"  When I first had both removed I felt not only cold (amazing how I never knew how much extra insulation I carried around!) but almost unprotected.  I felt like there was literally no extra cushion protecting me from harm if I was to get bumped or have something thrown my way (not trying to be funny here, just have kids that don't realize how off their aim can be).  Now I am more comfortable without my fake boobies -- I call them \"oobs\" because they are not real boobs to me.  ;-)  I am not good at layering my clothes to look right and def. could use fashion advice because the bras are not comfortable to me.  I have talked to some women who have had reconstruction and they are happy with the surgery but wish they wouldn't have had it because their size has changed after some years and they feel their boobs don't fit them well.  That too makes me want to think twice before going under the knife again.  Two things that I slightly struggle with are my seatbelt not staying comfortable w/o wearing my oobs, and swimming -- I don't want to wear my only set and risk wrecking them (don't have the right suit to accomodate them yet either).  Thanks for listening and keep up the humor :-) ",
      "MessageIndex": 336,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    }
  ]
}