{
  "AuthorID": "RebeccaA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188799/profile",
  "Posts": [
    {
      "AuthorID": "RebeccaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188799/profile",
      "Content": "Oct 19, 2013 04:54PM RebeccaA wrote: Hopefor, Pam, Soteria, Enerva, etc... Thanks for all the kind, encouraging words. This has been s pretty good week. I returned to work for a couple of days after getting the first oncologist visit over with. I start chemo on the 28th, but first I go Monday for the port insertion. I'll be glad to have it but I'm not looking forward to more discomfort in my chest area. It seems that as soon as I'm feeling pretty good, it's time for another procedure. Ugh! Felt really good this week, then it was time for an expander fill Friday. I really can't say that the expansion is bothering me but it seems to aggravate the area under my arm where it is still sore from surgery. Also, I keep reading all this stuff about people who are positive do better in cancer treatments and recovering. So now whenever I feel down, I beat myself up and worry that I am not being positive enough!",
      "MessageIndex": 170,
      "PostDate": "19/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "RebeccaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188799/profile",
      "Content": "Oct 12, 2013 02:05PM RebeccaA wrote: Count me in as another Stage III sister. Since finding out I had breast cancer, I wake up some mornings thinking that surely this can't be real and wondering why I can't awaken from this nightmare and how my life went so horribly wrong. Other days I'm upbeat and positive that I will get through this! I knew going into surgery that the tumor was pretty big but I was hoping to have none or limited lymph node involvement. But results were worse than expected. My husband told me the results, but I was suspicious that they were not telling me everything. I guess I thought that as bad as it sounded there must be something worse they were hiding. It must have been paranoia or not feeling in control while lying in the hospital unable to do anything. So, it's been almost three weeks since surgery. It is still up and down emotionally, but I am beginning to feel more like myself and I am so ready to get out of bandages. Next week I meet with the oncologist and find out about my treatment, which I guess will begin soon. Reading all of the posts here has helped me to feel hopeful and that I can face this and get through it.",
      "MessageIndex": 162,
      "PostDate": "12/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "RebeccaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188799/profile",
      "Content": "Oct 19, 2013 05:15PM RebeccaA wrote: Hi Enerva. I am getting 6 chemo treatments of taxotere and carboplatin over 18 weeks. So each treatment will be 3 weeks apart. I'll also be getting herceptin. I do have small veins and I think trying chemo, a year of herceptin plus lab work all the time would just deplete my veins and stress me our. Overall the port is the way for me despite the discomfort that may result from the procedure.",
      "MessageIndex": 172,
      "PostDate": "19/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "RebeccaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188799/profile",
      "Content": "Oct 9, 2013 06:04PM RebeccaA wrote: I've just had surgery so I am not yet at the point where I can even attempt shaving that side. However, a friend who had a mastectomy told me that she uses small scissors to trim (carefully!) under the arm where she cannot reach with a razor.",
      "MessageIndex": 3,
      "PostDate": "09/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808634",
      "Title": "Underarm hair after a mastectomy lala1 RebeccaA"
    },
    {
      "AuthorID": "RebeccaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188799/profile",
      "Content": "Jun 3, 2015 11:35AM RebeccaA wrote: I love your post and attitude!  ",
      "MessageIndex": 148,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/815407",
      "Title": "Stage III Cancer Survivors .... 10+ Years and Out AlwaysHope karen1956"
    },
    {
      "AuthorID": "RebeccaA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188799/profile",
      "Content": "Jul 17, 2014 12:58PM RebeccaA wrote: I've had the Compresleeve for about 2 months and love it.  Much more comfortable than wrapping, so I use it more often and usually keep it on most of the night.  With wrapping, I usually ended up tearing it off in the middle of the night because I felt so hot and uncomfortable.   Though there is some thickness to the Compresleeve, I really don't get hot during the night like I did with wrapping.  (And I love in Louisiana where summer is brutal!) I wear it with a cotton sleeve that came with it.  Some nights I also wear on Isotoner glove as well to help with finger swelling. The Compresleeve works well for me.",
      "MessageIndex": 87,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/754835",
      "Title": "CompreSleeve Sher glennie19"
    }
  ]
}