{
  "AuthorID": "Rebekah77",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
  "Posts": [
    {
      "AuthorID": "Rebekah77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
      "Content": "Feb 1, 2017 11:59AM Rebekah77 wrote: Just a little update. Meeting with Genetic Counseler March 1st. I'm looking forward to getting it over with! I also got a new Dr. She is fantastic. Ihave been having issues with my breasts lately. I just had an unsuccessful Dutcogram today due to nipple bleeding. However the Dr. blew my duct. OUCH!! So will have to try again when the nipple bleeds again. NOT FUN! I will also be asking for a referral to the breast clinic. Some of my cysts are extremely large and painful. My breasts are b cup and one cyst is the size of a walnut. So hoping to get a few drained to take some of the pain away. I go for a pelvic US tomorrow due to 3 periods in January and some heavy cramping and black discharge. (My periods have ALWAYS been regular) I honestly think it is due to perimenopause. Family history of early menopause. I'm having night sweats as well as a few other symptoms. But i will see my Dr. when she gets the results and go from there. I'm not stressed or worried about anything. Just taking everything as it comes!!",
      "MessageIndex": 5,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/850992",
      "Title": "Cystic Dense Breasts Possible BRCA1 Positive Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "Rebekah77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
      "Content": "Dec 8, 2016 11:10AM Rebekah77 wrote: Hello dcdrogers,  I have requested an MRI however my Dr. informed me that they do not use MRI for breast testing, dispite that everywhere i have read suggests it can be better at detecting anything in Dense breasts. My ultrasound did pick up some abnormalities in my left breast, however my Dr. did not seem too concerned. There is a University close that has a 3D MRI machine, it is not covered by healthcare and as of yet they are not doing breast MRI's. I am a little extra concerned only because he has missed issues with me in the past. I had been urinating sand and blood clots at one point and I felt something. He said it was a bladder infection. Turns out I passed a stone. Another time I had a sore swollen foot. Xray came back clear. He did no follow-up. I went to see a foot specialist. Turned out to be a stress fracture. I was in a boot for 8 weeks. Unfortunately there are NO Doctors accepting new patients in our city or outlying communities. I'm stuck with him. I'm sure some people may think i am over reacting, or being too cautious? I am actually handling things quite well. Just being proactive. I actually just called the Genetic Testing facilities. My Dr. has not even sent the referral in yet. He has had the info for several weeks!!! I spoke to a Genetic counsllor and she said she would contact him to request my referral. She told me that once they have it I will be seen rather quickly. Let's hope the ball get's rolling.  Thanks Ladies!!",
      "MessageIndex": 3,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/850992",
      "Title": "Cystic Dense Breasts Possible BRCA1 Positive Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "Rebekah77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
      "Content": "Rebekah77 wrote: Hello Ladies, Here is my story....with questions. I am a 39 yr old mother of 4. This past summer my sister was DX with OV cancer @ 40. I was never concerned about getting cancer, as we don't have much history of cancer in the family, other than a grandfather who passed away in his 80's of bowel cancer. So when my mom told me that my sister tested positive for the BRCA 1 gene mutation i was stunned. I was told there is a 50% chance that i too could be BRCA 1 positive. So I saw my Dr. He ordered the Genetic testing and sent me for my first Mammogram. Turns out I have to see a gentic Counsellor before i can get Genetic testing. Looks like a long wait.... So i went for my Mammogam and they called me back the next day for a recheck of my left breat and an ultrasound as well. I went back, of course really nervous. I was told my Dr. would have the results that day. I waited all afternoon and called the next morning. I saw my Dr. that day and was told i have very Cystic breasts and they are Dense. But no cancer, although i am at a higher risk. I was just wondering that given the risk, would it have been worthwhile for the dr to just sample a few pieces of breat tissue to ensure there are no cancer cells? Also, with the possible BRCA 1 Gene mutation, i would think that due to my sister's positive result, they would bump me up the list for Genetic testing.I live in Canada and from what i understand, that is procedure. Thanks so much!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/850992",
      "Title": "Cystic Dense Breasts Possible BRCA1 Positive Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "Rebekah77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
      "Content": "Dec 8, 2016 12:07PM Rebekah77 wrote: Hi Beesie,  I am aware the Cystic dense breasts are common for my age. It also puts women at a slightly higher risk because there is more breast tissue (which is where cancer cells grow) and less fat. And of course harder to screen. If I had a Dr. I could trust I wouldn't be as concerned. He is in no hurry to submit my sisters Genetic info so I can be tested. If it is negative....great!!! Thats what i am hoping. I am just taking the steps to ensure that i am healthy now! The Dr, did factor in the BRCA1. Until it comes back negative, there is still a 50% chance, so that is why i was sent for a Mammogram in the first place. There are many women who due to a mutation in the family are automatically higher risk until testing can prove otherwise. I'm in Alberta!  Thanks for your imput!!",
      "MessageIndex": 4,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/850992",
      "Title": "Cystic Dense Breasts Possible BRCA1 Positive Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "Rebekah77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
      "Content": "Rebekah77 wrote: Hello, Hoping to get some insight. I'm at high risk for BC due to BRCA1 mutation. I have dence cystic breasts. I woke up the other morning with blood stain on my bed (a bit bigger than a dime size). I checked my body but couldn't find anywhere the blood could have come from. So I layed in bed the way i sleep and it lines up perfectly with my right breast. So it must have dripped out while i was sleeping. I just wondered if anyone out there may have experienced anything similar? I'm not freaking out or panicing....just wondering. I see my Dr. tomorrow. Just thought someone might have some insight about anything I can ask the Dr? Thank you! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851909",
      "Title": "Bloody Discharge From Nipple Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "Rebekah77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
      "Content": "Jan 27, 2017 12:33PM Rebekah77 wrote: Hey MsMinnie! Have you gotten your results back yet?  I'm still waiting on my Ultrasound results.",
      "MessageIndex": 6,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851909",
      "Title": "Bloody Discharge From Nipple Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "Rebekah77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
      "Content": "Jan 23, 2017 08:58AM Rebekah77 wrote: Thank you msminnie!!  Thank you so much for trhat advice!! I will take a pic of the stain on my matress protector, as my boyfriend had already washed the sheets!! I wear Black bras, so no way to see of anymore comes out. I will be buying white ones! I have ultrasound on Wednesday, hopefully get some answers!  Thank you ladies! I do appreciate all of your imput and advice!!",
      "MessageIndex": 4,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851909",
      "Title": "Bloody Discharge From Nipple Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "Rebekah77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243512/profile",
      "Content": "Jan 26, 2017 11:00AM Rebekah77 wrote: Hi again ladies,  I had my ultrasound yesterday. The lady asked me a ton of questions, took lots of pictures and measured one lump. She also checked lymph nodes. My last ultrasound (of my other breast) there were no measurements taken and I was told then my Dr. would have the results right away. This time i was told my Dr would have the results in a couple of days? Just wondering if any of you have had this before? I'm assuming if it is something it could be an Intraductal papilloma?  Thanks again ladies!!",
      "MessageIndex": 5,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851909",
      "Title": "Bloody Discharge From Nipple Rebekah77 Rebekah77"
    }
  ]
}