{
  "AuthorID": "rebilla",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
  "Posts": [
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "Mar 29, 2009 05:43AM rebilla wrote: hi to you all, i have just  read some of the posts here and find some comfort in your postive attitudes.i am waiting for my results from a core biopsy, but have been advised to prepare for the worst.the man who did the ultrasound said i had a mass with a tiny cancer, but my lymph nodes were clear.he suggested i might be better having a prophylactic mastectomy, instead of a lumpetomy and radiation,purely because i have already been treated for calification in my other breast, and family history.i have thought about mastectomy for a long time now, so it will be quite  an   easy decision for me to make.what i would like to know is whether surgery is delayed waiting to have a mastecomy rather than the lumpetomy, and is the cancer at risk of getting bigger.",
      "MessageIndex": 114,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/699762",
      "Title": "DCIS gigiola happy29"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "Apr 19, 2009 12:50AM rebilla wrote: hi to all and thanks for your kind remarks, i have now seen my consultant and he is all for me having a double mastecomy and bilateral reconstruction, but says that the plastic surgeon might not agree to doing both sides when there is no cancer present at this particular time in one breast.( i must add that i am writing this from england, am i right in thinking this is an american forum, and maybe your doctors work differently to ours.) he did suggest that another recon surgeon might be happy to do bilateral.i will have to wait until thursday and see what happens.",
      "MessageIndex": 5,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "May 25, 2009 10:05PM rebilla wrote: hi rosita, glad to hear all is well with you. don't they let you out of hospital early there.!!!!!!!!!!! i was in for 8 days altogether, they keep you in until the drains come out,which for me was 6 days after the op.Today, i have been back to have some fluid build up drained off.this didn't hurt at all and i feel absolutely wonderful.i am having my first saline injections this thursday.i am sure you will be feeling fine very soon.take care.",
      "MessageIndex": 24,
      "PostDate": "25/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "Apr 25, 2009 02:52AM rebilla wrote: rosita, our cases are so similar,i too had a mamogram last may which was all clear. what type of reconstruction are you having ? are they going to do the whole lot in one go ? we will have to compare notes afterwards.",
      "MessageIndex": 13,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "Apr 23, 2009 03:37AM rebilla wrote: well,i am seeing the plastic surgeon tomorrow at long last, but i have been warned that it is unlikely that i can have the bi-lateral with immediate recon (like you rosita) because i have only one affected breast at this moment in time, even though i have had califications previously.so until tomorrow comes i still don't know the outcome of all this.my lump was found on 9th march.",
      "MessageIndex": 8,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "May 10, 2009 10:47PM rebilla wrote: hi, my date is getting nearer at last, i'm going in thursday, for  a friday am op.i feel strangely calm at the moment, proberbly because i've waited so long and come to terms with it. anyway, i am having the tissue expanders inserted and then in a few months, when everythings settled down,they will be replaced with silicone gel implants, which i am assured are the most natural look and feel compared to saline.if i'm home before the 22nd  rosita,i will let you know how it all went,if not, then good luck and take care when you go in, and try not to worry to much in the meantime.xxxx",
      "MessageIndex": 16,
      "PostDate": "10/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "Apr 15, 2009 11:49PM rebilla wrote: hi, i had califications in my right breast 3 years ago and had them removed, but now i have invasive cancer (grade 1) on my left side,which can be treated with a lumpectomy and radiation next week.i have opted for the double mastecomy and reconstruction because i cannot live with the constant worry of it coming back yet again. but alas, i have just heard from my breast care nurse and she doesn't think that i will be able to have a d/m as i only have cancer on one side  (even though i have had problems before).my appointment isn't until 23rd april and then there is a wait of a few weeks for surgery.i have already been waiting a month ( since biopsy results). i am terrified that the cancer is spreading in this time, and i still don't know what i will be having done. ",
      "MessageIndex": 2,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "Apr 19, 2009 12:57AM rebilla wrote: forgot to ask, txbadboob, how do you feel now you have had a dmx.are you coping ok ? are you going to have any reconstruction ? apparently loads of woman have the dmx with a view to recon later but never follow this through. is this because they are comfortable with no boobs,or because they don't want to have to go through more surgery  etc.i am a bit mixed up at the moment and change my mind all the time about what i think i would be comfortable with.at the end of the day,how can you decide on anything 100% when you haven't experienced the outcome.",
      "MessageIndex": 6,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "Apr 25, 2009 02:45AM rebilla wrote: hi everyone, well i suppose it's good news.saw my plastic surgeon and she has agreed to do a dm/x and bi-lateral recon.i feel so relieved about that.i now have to decide exactly what type of recon i want and if i want to have it all done together. here are my options.i can have either \"tissue expansion\" using silicone,which takes up to 5 hours or \"flap\" using muscle and fat from my stomach and back (apparently i don't have enough to spare on my tummy to do both breasts).which is a longer op that takes up to 6 hours each side,and i would have to have two separate ops.even though i'd love a flat stomach i am leaning towards the first option as this is the easiest and best recovery.although the end result isn't as natural looking as the flap. next,i have to decide whether to take an appointment for this thursday(30th) and have a lumpectomy and lymph nodes removed, wait for results (2 weeks) and then book the mestecomy and recon,which would proberbly be mid june.OR have the whole package done on may 15th, which means keeping the blessed thing for another 3 weeks,which is fine as long as it doesn't start spreading.i have until monday to decide what i want to do.if i take this option rosita we will be convalescing together.it is a hard decision to make.",
      "MessageIndex": 12,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "May 24, 2009 09:57PM rebilla wrote: hi everyone, oh well, all sorted.had my op on 15th as planned . everything went really well and i came out of hospital on the 22nd.i had my drains removed  friday morning, but have now got quite a build up of fluid under my left breast (the one where i had lymph node sampling).i am going back to see my consultant tomorrow to have it drained off and then on thursday i start my first course of saline injections.apart from some discomfort with the fluid and tightness across the chest i feel great considering alli have had done.i have no regrets with my decision to have immediate recon and now i am looking forward to watching my new \"boobs\" grow, although i have been warned that this can be quite painful at times.",
      "MessageIndex": 21,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "May 24, 2009 10:00PM rebilla wrote: hi rossita, hope everything went well for you with your op on the 21st and that you are feeling as well as i am.please let me know how things are with you as soon as you are up to it.take care.",
      "MessageIndex": 22,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "rebilla wrote: hi,i had my results from a biopsy 2 weeks ago, grade 1.three years ago i had calification in my other breast.i am seriously thinking of a double mastecomy and reconstruction, but have to wait to see the recontruction doctor, which will be next week.i am going mad with worry, in case it is spreading while i am waiting to see her.and then i will have to wait for the op.if i had gone for the lumpectomy and radiation it would all be over now.have i made the right decision,and is it normal to wait so long for this type of surgery. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "rebilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81568/profile",
      "Content": "Jul 18, 2009 09:38AM rebilla wrote: hi everyone, i'm writing from here in england, after seeing your discussion board.i hope you ladies don't mind me joining in on your talks.i need someone to talk to about my nausea. i had my first chemo session on july 8th and have felt so sick since then. to date i have lost 11 lbs in weight.i am on my 4th different anti sickness drug.none of them help much.my sense of smell is overwhelming,i can even \"smell\" my own skin.even fruit and water have a \"funny\" taste. is anyone else out there in the same boat,or am i the only one going through this.",
      "MessageIndex": 385,
      "PostDate": "18/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    }
  ]
}