{
  "AuthorID": "RebzAmy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
  "Posts": [
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Sep 30, 2015 01:04PM RebzAmy wrote: what a complete shock. There are lots of treatments for people with mets and there are loads of ladies who have done extremely well on the different treatments. Hopefully some of those will come and chat with you here and give you some advice.",
      "MessageIndex": 2,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/835379",
      "Title": "Bye Bye stage-3 many krcll"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Jun 27, 2016 02:42PM RebzAmy wrote: Hi ladies, Mine was about 5cm and HER2+ and very fast growing, several lymph nodes affected and one was huge under my arm - felt like the size of an egg yolk. That was 9 years ago now :)",
      "MessageIndex": 8,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Aug 25, 2014 01:55PM RebzAmy wrote: Hi Shaunagill so sorry to hear you're going through this worry.  I can understand how scared you must be and I really sympathise with you.  I remember my mum developing a really large lump once and it grew really quickly.  It turned out to be a fluid filled cyst but the doctor had really thought it was something sinister, and it was very hard.  Hoping all is okay for you and will be thinking of you for when you have your appointment on Wednesday.   Hugs.  Amy",
      "MessageIndex": 2,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823959",
      "Title": "Terrified of what could be! Shaunagill31 Kicks"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Dec 18, 2015 12:24AM RebzAmy wrote: Torridon, The fact you have to wait so long sounds awful and wrong. Which hospital are you being treated at? Hugs",
      "MessageIndex": 15,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838547",
      "Title": "Plurex drain ascites......feel alone here in uk Torridon Longtermsurvivor"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Dec 16, 2012 09:15PM RebzAmy wrote: hi Jabal I had this after my mastectomy and it was cording - it took a while for it to go away and lots of stretching etc but as it's so early on, I wouldn't suggest doing much stretching right now. I remember it feeling like there was a guitar cord or a few of them in my arm - it was so weird and the whole area was tight and stretched. I'm sure the area is swollen too and will be for a little while still. If it bothers you then maybe make an appointment to see your doctor.",
      "MessageIndex": 3,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797672",
      "Title": "sentinal node dissection/pain lump..help! jabal shianne29"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Feb 8, 2015 01:19AM RebzAmy wrote: I know somebody who had a 98% chance of survival and she had hormonal breast cancer and was on Letrozole for 5 years. She came off them and 2 years later was diagnosed with metastatic breast cancer, which probably meant that she was possibly stage 4 from the start but that the Letrozole was holding it in check until she came off it. So, some of the 93% go on to develop secondaries - that's what I think I understand the question to be.",
      "MessageIndex": 3,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/828285",
      "Title": "If 93% survival rate at 5 yrs - why do the 7% perish? rleepac HaveFaithInHim"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Sep 16, 2012 05:10PM RebzAmy wrote: As a new wife and stepmother myself to an 11 year old boy, your posts really struck a cord with me. I made a really big effort to include my stepson's late mother in our lives. He has a memory box, some photos of his late mother on his bedroom wall, various other things in his room which were hers and I made it clear that his late mother is part of all of our lives and always will be. Occasionally he gets upset about his mummy (he was 6 when she passed) and we deal with it. I will always  make sure the memories are preserved. I've also developed a special relationship with my stepson's grandparents who treat me like a daughter-in-law - it's a very special relationship all round.",
      "MessageIndex": 4,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793606",
      "Title": "I am so so sad 4myangels penny4cats"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Nov 16, 2011 12:27PM RebzAmy wrote: HI ladies I was HER2+ and diagnosed in June 2007 now 4 1/2 years ago.....",
      "MessageIndex": 3,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778072",
      "Title": "Thread I started for HER2 Stage III'ers PlantLover antonia1"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Jul 1, 2014 02:01PM RebzAmy wrote: wonderful news Leah, mazeltov :) ",
      "MessageIndex": 32,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822402",
      "Title": "I have a new granddaughter! Leah_S bhd1"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Dec 28, 2016 04:12AM RebzAmy wrote: I don't think it's anything to worry about. I have problems with my neck and back etc and I get that if I bend my neck forward and sometimes when I'm jogging. May just be coincidence",
      "MessageIndex": 1,
      "PostDate": "28/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851450",
      "Title": "Shock Sensation upon Neck Flexion LynnieRich LynnieRich"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Sep 9, 2017 04:35AM RebzAmy wrote: KSeaman, similar to you and got the same issues except somehow my husband is very accepting of it - won't go into too much detail here and I feel so bad sometimes that I'm like this but it's been like this now for a good few years and we just manage. Lots of emotions went on around the whole fact, probably more for me than for him as I wondered how he could deal with it and how he could be so accepting. We are crazy in love still. It's good that you're going for counselling as you both need to know where you stand and you need to know what his stance is about it all and then go from there as to how you can work it out. It's so hard having to deal with the diagnosis and then any side effects that may result from it. Thinking of you.",
      "MessageIndex": 1,
      "PostDate": "09/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/858532",
      "Title": "Need Some Advice - Sex is ruining my marriage KSeaman Falconer"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Aug 4, 2018 11:58AM RebzAmy wrote: Hi Trixy09, So sorry you're going through this worry. Google is really bad for making you feel awful when you do a search. There are various other possibilities that it could be. IBC is pretty rare. I know it's easy for me to say not to worry, because you will, and it doesn't help that it's the weekend. Horrible time for you but Monday will come and you'll do whatever needs doing.",
      "MessageIndex": 1,
      "PostDate": "04/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866393",
      "Title": "Worried inflammatory breast cancer Trixy09 NervousNellie18"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Jan 26, 2015 05:09AM RebzAmy wrote: There are lots of little boney bits and things around that area which are part of your make up. I know that I've felt around there on occasions and thought OMG what's that? Then felt the other side and had the same thing there, which made me feel more relieved as I realised it was just part of my make up. Hopefully, that's all it is for you",
      "MessageIndex": 2854,
      "PostDate": "26/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Jul 14, 2012 04:50AM RebzAmy wrote: Hi Kmtmom1 A large number of lumps that are found by women are in fact benign. It is important to be breast aware and gets lumps checked out so the best thing you could do is go and get that MRI you were supposed to have. I know it's easy for me to say this as you're probably scared due to your mum's diagnosis at a young age but the sooner the better and hopefully it will just be  still fibrocystic changes. Nobody here can tell you what it is which is why you should just make the appointment. If it helps at all, my mum had a huge lump in her breast and was told it was most likely BC but it in fact turned out to be a huge fluid filled cyst or something like that. The good thing is that you only had a scan relatively recently so please go and get the follow up you were supposed to get.  RebzAmy ",
      "MessageIndex": 1,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/790547",
      "Title": "Found a lump. What do you think? Kmtmom1 msphil"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Feb 1, 2017 04:42AM RebzAmy wrote: Hi Bernmomof3, I'll be thinking of you for tomorrow (today). My lump was between 4-5 cm and it was near the top centre quadrant of my left breast, and there was another lump underneath it, but don't know the size of that. They had to go down to my bone to get clearance. My mom's sister had breast cancer and my dad's sister did too. Hope all goes smoothly.",
      "MessageIndex": 1,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/852298",
      "Title": "Very scared Bernmomof3 bevin"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "May 18, 2010 05:23PM RebzAmy wrote: Hi D-Ann123 My hair started falling out probably around a week to ten days after my first lot of chemo. I think my scalp did feel a bit tingly but can't actually remember. I just remember taking a strand of hair and it sort of just came out in my hand very easily.",
      "MessageIndex": 2,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/752774",
      "Title": "when does your hair fall out with kemo D-Ann123 pupfoster1"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Jan 1, 2016 04:23AM RebzAmy wrote: I have taken amitriptyline for years (since 2007 when I was diagnosed with breast cancer). I started taking a very low dose 10-20mg to help me sleep at night and take the edge off my anxiety whilst I was being diagnosed and going through treatment and it was great. I continued taking it until recently when I decided to wean myself off it. Within a very short space of time, I started feeling really unwell, pain in my neck, shoulders and especially jaw (always suffered from jaw pain and headaches) and was having headaches at night and during the day that I couldn't shift and nausea and just aching, I also wear a nightguard on my teeth as I clench my teeth at night. Went to dentist and told him about my painful jaw and neck - got referred to hospital and had MRI scans which showed severe arthritis in my jaw and neck. Was told that amitriptyline is a drug they would prescribe for this sort of pain. Put myself back on it immediately and the relief from the pain and feeling ill was noticeable the next day and by the day after I felt back to myself again. It so does work for pain. My husband takes it for his MS pain. I only take it at night as it makes you a bit sleepy but I get a good night's sleep with it. I'm having jaw surgery and injections into all the painful areas in a few weeks time.",
      "MessageIndex": 4,
      "PostDate": "01/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/839031",
      "Title": "Is anyone taking Amitriptyline for pain? Louisap Soniatoronto"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Sep 13, 2010 03:02AM RebzAmy wrote: Hi Nora and Fightinhrd I had a breast reduction on both sides in 2005 or 2006 and in June 2007 I was diagnosed with breast cancer. I didn't have any scans beforehand to see if anything was wrong - my breast consultant never ceases to be amazed that nobody thought to do this before my reduction. Anyway lumps can grow fast and I only realised something was wrong when I felt a huge lump in my armpit and my GP told me that I also had a large lump in my breast. It turned out to be IDC and HER2+++ and very aggressive hence the reason it grew so quickly. Oh yes, I also had widespread DCIS to mastectomy and lymph node removal for me.",
      "MessageIndex": 4,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757919",
      "Title": "Just diagnosed after a successful breast reduction nora_az LISAMG"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Sep 18, 2010 08:15AM RebzAmy wrote: Hi LisaAMG I had no scans or anything before my breast reduction and I also had widespread DCIS when I was actually diagnosed in 2007. In terms of screening I was too young to start screening being only my 30s. It's very possible something was there when I had the reduction and this triggered the growth of the tumour or DCIS to become invasive - but who knows? I do have a family history, my dad's sister having been diagnosed around age 40 and then again a few years ago aged 55. My mum's sister was also diagnosed but at an older age - prob around 60. As a result of this, I also had preventative surgery recently by having the other unaffected side removed and rebuilt.",
      "MessageIndex": 8,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757919",
      "Title": "Just diagnosed after a successful breast reduction nora_az LISAMG"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Dec 2, 2010 04:38PM RebzAmy wrote: Hi Ling29 I remember quite a few years back my mum found a lump in her breast which seemed to appear from no where. She went to her GP who basically told her she thought it was cancerous and referred her to a consultant. It was a very scary time for us all - I will never forget it and in the end they operated on her and took it out and it turned out to be a cyst surrounded by fluid which was such a relief. HOpefully things will turn out ok for you too. Rebzamy xx",
      "MessageIndex": 3,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761410",
      "Title": "Can a cancerous tumor grow quickly within a week? Ling29 Ling29"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Feb 20, 2013 09:56PM RebzAmy wrote: yeah it's good you're seeing the doctor tomorrow and wishing you the best of luck. My mum had a huge lump spring up years ago and we all got scared - it turned out to be a fluid filled cyst and it was pretty hard from what I remember. I'll be thinking of you for tomorrow RA xxx",
      "MessageIndex": 6,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800764",
      "Title": "I've been sick for 8 months Shayhaze Momcat1962"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "May 12, 2016 02:13PM RebzAmy wrote: I'm replying because I did hear of somebody who had some rib removed here in the UK. When she was diagnosed the cancer had gone right down to her rib and they removed a part of it. No idea how and as far as I know she's doing fine. If it's just spot that you have ie on the rib, then maybe it can be removed. I will see if i can find out more about the lady who had this done.",
      "MessageIndex": 16,
      "PostDate": "12/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/844186",
      "Title": "New to Stage 4 indenial zarovka"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Mar 30, 2019 01:36PM RebzAmy wrote: When I was diagnosed in my 30s in 2007, my oncologist told me that he was considering the treatment he was giving me to be curative treatment. I recently had an abdomen scan and head scan and all clear. I remember hearing the words, 'curative treatment' and held onto that.",
      "MessageIndex": 7,
      "PostDate": "30/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870709",
      "Title": "How long is a Course of radiation for axillary nodes? B-A-P RebzAmy"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Jun 3, 2010 04:12PM RebzAmy wrote: Hi tovahsmum Sorry to hear you're worrying about this. I had a bone marrow and bone biopsy and was put into the twilight zone - basically I remember nothing about it. One minute I was there and the next I was 'waking' up and felt completely fine - no memories just bit sleepy. Please don't worry it's actually very pleasant. xx",
      "MessageIndex": 3,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753560",
      "Title": "really scared of surgery next week and not being put out totally tovahsmom NativeMainer"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "May 23, 2010 02:54PM RebzAmy wrote: Hi Meaghan I just googled it for you and got the following: Pseudoangiomatous stromal hyperplasia (PASH) is a type of benign breast lesion that occurs as a single palpable mass or a dense region on a mammogram The masses observed in individuals with PASH are benign (non-cancerous) and require diagnosis only to distinguish them from cancerous (malignant) lesions.  It may be mistaken for angiosarcoma; however, the breast lesions caused by angiosarcoma are different than those seen in PASH The size of PASH lesions range from incidental microscopic findings to breast masses that are palpable or evident on a mammogram. Masses are usually large (5-6 cm in diameter), with reported diameters ranging from 1 to 12 cm.  The masses may grow over time PASH most commonly affects premenopausal women. The age range of people diagnosed with PASH is 14-67 years; however, most individuals are diagnosed in their late thirties or forties Surgical removal of the PASH lesions has been performed in some individuals.  A wide margin around the mass may be removed to prevent recurrence. Although PASH lesions often grow over time and may recur, they are neither associated with malignancy (cancer) nor considered to be premalignant (pre-cancerous).[1]  According to the medical text, CONN's Current Therapy 2007, approximately 7 percent of people experience a recurrence of PASH.[2]",
      "MessageIndex": 2,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/753026",
      "Title": "What is PASH? Meaghan alligans"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Aug 4, 2013 12:48PM RebzAmy wrote: From what I understand, the rads are local treatment and treat the area with tumour plus surrounding areas just in case there are minute cells that have spread out a little.  If the cells have already spread (maybe minute cells have travelled around the body) rads will not treat these, chemo can as it treats the whole body. The rads are an important part of treatment as they can reach tissue and areas that surgery can't.  It wasn't particuarly tactful of the MO to say this however he/she was being brutally honest.  That said, nobody can say whose cancer will come back and whose won't whatever treatment you end up having.  I was given rads and it covered three different areas - this was the belts and braces of my treatment as my oncologist described it.  ",
      "MessageIndex": 1,
      "PostDate": "04/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/808828",
      "Title": "RADS does it lower chances of distant mets too? rozem pupmom"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Feb 8, 2015 02:13AM RebzAmy wrote: I did use the cold cap for the majority of my treatment and it didn't work and in the UK it's free. Towards the middle of treatment, so much hair had come out and the cold on my head was so painful, that I chose to stop using it in the end as it wasn't working. The cold was extremely uncomfortable and as my hair got thinner and thinner, it got worse and worse so I was pretty relieved in the end when I stopped using it. I then got a wig. I know that it can work for some people, but those people are very few.",
      "MessageIndex": 30,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/828260",
      "Title": "Anyone choose NOT to use 'cold caps'? rleepac sbelizabeth"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Jul 17, 2016 04:03AM RebzAmy wrote: Wow, I stayed in for a week after my mastectomy - although I'd had all of my chemo prior to this so that's maybe why, plus my white blood count was low as well. When I had my reconstruction - I had two - I stayed in for a week each time.",
      "MessageIndex": 10,
      "PostDate": "17/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846011",
      "Title": "Overnight stay for mastectomy LM525 Meow13"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Dec 1, 2015 01:03AM RebzAmy wrote: Torridon, so sorry you're feeling so unwell and are stuck in hospital. I just wanted to pop by and say hi and give you some gentle hugs. I hope Starbrightlyshines's post gives you some sort of comfort. Big hugs RebzAmy xxx",
      "MessageIndex": 9,
      "PostDate": "01/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837147",
      "Title": "sub acute bowel obstruction- please help Torridon Bestbird"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Nov 5, 2015 03:29PM RebzAmy wrote: Interesting discussion. I was diagnosed in my mid 30s - and this followed both my mother's sister having had it and my father's sister. Both were different though, my dad's sister was youngish, in her early 40s and my mum's sister was around 60. Both are fine now, although my dad's sister did have a recurrence. My diagnosis was different and my breast cancer was very aggressive and treated very aggressively. I was tested for the BRCA gene (being of Ashkenazi descent) and that was negative. So - both aunts had it and so did I but there's no faulty gene!",
      "MessageIndex": 8,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836449",
      "Title": "Cancer Risk, Cancer in Relatives Question CherylCC CherylCC"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Oct 27, 2014 10:42AM RebzAmy wrote: Hi Jemimah, I'm not an expert so you do need to contact a doctor, but it could just be a simple infection or an allergy to your washing powder, bath products etc.  Cancer usually presents completely differently to what you've described.  I know you probably feel embarrassed and scared but I'm sure all will be fine and you just need peace of mind.  Good luck and please let us know how you get on.",
      "MessageIndex": 2,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825779",
      "Title": "INCREDIBLY WORRIED IM 14 jemimah jemimah"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "May 13, 2014 08:51AM RebzAmy wrote: Could you have been bitten by something?  Or had a spot that got infected?",
      "MessageIndex": 3,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821036",
      "Title": "Does anyone know what this is ? Slightly concerned amypat123 Moderators"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Oct 19, 2014 03:41AM RebzAmy wrote: Hi MamaD Mine were swollen and I was grade III - now 7 years down the line now :)  ",
      "MessageIndex": 3,
      "PostDate": "19/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/825207",
      "Title": "Scared- lymph question? MamaM NatsFan"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Nov 23, 2014 03:11AM RebzAmy wrote: Amazing news - long may the drugs keep doing their thing for you xxx",
      "MessageIndex": 22,
      "PostDate": "23/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826483",
      "Title": "Complete Metabolic Remission MarshaMay PattyPeppermint"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "May 8, 2012 09:51AM RebzAmy wrote: I was an egg donor for somebody - I went through the whole process three times for them which meant my body was flooded with hormones, firstly to do something called down regulating so that the person I was donating to was in synch with my body and my cycle, then I had to inject myself daily for 2-3 weeks (can't remember now) and finally the egg collection. It was a few months after the final collection I was diagnosed with breast cancer however mine was HER2+. In relation to the person I was donating to, this was a good thing because had it been hormonal cancer, they would have felt it may have been due to what I'd been through for them that caused this to happen but who knows! R",
      "MessageIndex": 9,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787140",
      "Title": "Fertility drug connection??? number5 NicolaSue"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "May 25, 2014 02:14AM RebzAmy wrote: Question:  I went through 3 lots of egg donation for somebody very close to me and then was diagnosed with breast cancer probably around 2 years later.  The breast cancer was NOT hormonal, it was HER2+ - does this mean that the drugs I took for the egg donation could still possibly have caused my breast cancer even though it was not hormone positive?  Or could this be just one of those things.  Just wondering ...",
      "MessageIndex": 35,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787140",
      "Title": "Fertility drug connection??? number5 NicolaSue"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Jan 15, 2011 05:38PM RebzAmy wrote: oh yes completely I haven't had an eye test since diagnosis even though i wear glasses, I had either a panic attack or slight reaction to dentist when I had an injection to numb the area for the filling (hadn't been to the dentist since before diagnosis). I hate visiting the doctor and have to be dragged there kicking and screaming. Recently I had low iron and that terrified me too. I carry diazepam around with me for occasions such as this and took one just before my recent oncology check up! It's not nice. Oh yes I've been told to try doing breathing exercises to calm me down too as apparently that helps - seems that when I'm really really nervous I hold my breath a lot.",
      "MessageIndex": 1,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763424",
      "Title": "Panic at ANYTHING medical related bookgirl frustratedrg"
    },
    {
      "AuthorID": "RebzAmy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56693/profile",
      "Content": "Dec 29, 2011 06:13PM RebzAmy wrote: Hi Lele109 I had a lump in my breast and a lump under my arm plus a large area of DCIS. The lumps were both large. Good luck for next week.",
      "MessageIndex": 1,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780188",
      "Title": "What are your symptoms? lele109 Lyn1n"
    }
  ]
}