{
  "AuthorID": "RedheadPam",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
  "Posts": [
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Aug 27, 2014 07:01PM RedheadPam wrote: Linda - I'm in Indianapolis...",
      "MessageIndex": 4559,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Dec 21, 2009 03:25PM RedheadPam wrote: Hello ladies!  Just checking in to say hi...not much is happening here, but I am counting down the hours to my LAST TREATMENT!!!!! By this time Wednesday I will feel like crap but will be all done with chemo treatments. My Onc wants me to come back on Jan 7 to talk about radiation...I am starting to feel like the light at the end of the tunnel is getting just a little bit bigger.  I know it may not feel like it right now, but we are all getting closer and closer to being through with this! No major SEs right now -- sleeplessness as usual, and now my feet hurt.  Could be neuropathy, could be plantar fasciatis from spending my summer in cheap flipflops.  Ah, rubbery flipflops, how I love thee, even though you kill my arches.  Having the occasional spontaneous nosebleed too, but at least they are short-lived. Is anyone else getting nervous about seeing relatives over the holidays?  My big brother is coming in for a visit, and I only see him once a year.  He is coming right when I know I will feel the worst, and I feel guilty that I won't be able to spend much time with him....and I don't think he is quite grasping how my life is right now. Every time I mention that I will be sick when he is here, he seems surprised and a little confused. I am sure he'll understand, but it just doesn't seem real to him.  The hospital where I have my treatments had a breast cancer survivor event last week.  It was pretty cool, lots of booths with various support organizations, services, etc., plus music and food. I signed up to get info on some survivor camping trips, and even a dragon boat racing team (rowing) made up of survivors!  I figure that will help me get back in shape this summer! A couple of the ladies there were openly hairless, which I really admired.  I am not quite there yet, but am feeling comfortable enough to go out in a baseball cap with the back of my bald head showing. Major hugs to everyone having a tx coming up, or who is feeling lousy from the last tx! ",
      "MessageIndex": 1055,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Dec 22, 2009 01:03PM RedheadPam wrote: Micheleboots - yup, a little ugly, although I might be able to wear the \"Elegant\" line of sandals when it gets warm....they don't look too bad.  I just have a penchant for shoes that are terrible for my feet - flipflops, clogs, little ankle boots - at least I rarely wear high heels. Mouse, I find that the steroids don't keep me awake as much as I had feared.  My sleeplessnes actually comes later after the treatment, when the hot flashes wake me up.  My problem with the steroids is that every treatment, I get just a little more puffy-looking from the combination of the oral steroids and the IV steroids they give me at chemo.  I can't wait to feel well enough to work out more and eat properly to lose this puffy face.",
      "MessageIndex": 1061,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Dec 28, 2009 04:09PM RedheadPam wrote: Hey Ladies - hope everyone had a wonderful Christmas! I am off this week, wich I thought would mean lots of lovely rest, but has actually meant 3 inches of snow and lots of snowy neighborhood kiddos! Oh well, DD is having a great time. I have to make a confession to you all -- I did something today I shouldn't have.  I just couldn't stand it anymore.  I had to smell good for a change! It seems like all I smell right now is chemicals...I stripped the bed, put the sheets through the wash on 'sanitize\", and took a hot shower with - gasp - actual smelly shower gel! Yes! real girl soap! I was tempted to throw caution to the wind and add some Secret Powder Dry in my pits, too, but that felt a little too wild. So I stuck with a little H20 lotion on my knees and elbows. Now I am soft and clean and smell like a girly girl, and I am happy.  I had broke down crying because I didn't want to feel or look or smell like a sick person one more minute.  ps - Shara - you go girl! Ony problem is you are making me crave brownies....flashbacks to the 70's....   Big hugs and small SEs to all....here's to a healthy 2010 for us all.",
      "MessageIndex": 1120,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Jan 27, 2010 04:56PM RedheadPam wrote: Melinda --I just laughed out loud at my desk!!  I have noticed the same thing -- except that my pee always veers to the right!  What is up with that? Personally I do NOT miss my pubes.  They can just stay away, especially the way they used to try to launch a sneak attack down my inner thighs.My bikini wax lady probably misses all the money I used to spend keeping them at bay. As far as the farts are concerned, I am wondering whether the bit of hair that used to be, well, around the back, is gone, too?   That little tidbit of info will just have to remain a mystery, since I am not about to look and check!  Sherri - I had a hyst and ooph almost a year to the day before I was diagnosed with BC (due to major tube blockage, twisted ovaries, cysts, you name it.  There is a website called Hyster Sisters with a lot of good info on hysts and the recovery process.  The main thing that drove me crazy was that I couldn't drive for a month afterward....they don't let you drive until you can stomp your foot and not feel pain in your abdomen. Get a good support belt to wrap around your incision and 'hold you in' while you heal.. Good pain meds, though! Major hugs to everyone from Rads land...10 down, 23 to go!",
      "MessageIndex": 1451,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 1, 2010 04:23PM RedheadPam wrote: Hello Warriors!  I just wanted to stop in and say hello, and see how everyone is doing.  To all those wonderful women who are still on chemo, hang in there!  You can get through this. My news is that I AM DONE WITH RADS!!!!! I had my last treatment today. It was just a bit over 6 months from diagnosis to my 'graduation' today.  I walked out of the treatment center and promptly burst into tears. I feel like I had been holding those tears in for the last 6 months.  I have cried a total of 3 times today (once when my wonderful DH sent me a dozen pink roses). It is going to feel strange to not have to have any treatments.  I do need to meet with my onc to talk about what drugs I'll be on, but other than that, I am claiming my life back from breast cancer.  Now I just need to grow some hair! Many healing hugs to all, sending you vibes that tx will be fast and SE-free!",
      "MessageIndex": 1737,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Feb 19, 2010 09:26AM RedheadPam wrote: Great news, Cafe and SLV! It is great to hear everyone having happy things to report! Life in rads land goes on -- I am having tx # 27 of 33 today!!! Monday is my last regular rad, and we'll be doing the setup for my 5 boosts then, too.  Rads is DEFINITELY easier than chemo...so there's something to look forward to. My left breast is starting to change from pink to light red and get a little sore, but nothing I can't handle. I am much more annoyed that at 8 weeks post-chemo, my eyebrows decided to start falling like snowflakes this week! I had reeaaally hoped that I would hang on to them, but doesn't look that way.  Oh well, I hear they come back pretty quickly, but for now I have a bad case of butter-face.",
      "MessageIndex": 1661,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 18, 2010 10:39AM RedheadPam wrote: Ladies - thanks for the kind words!  I feel like my hair has really taken off -- like I can almost watch it grow. I do have the \"duck fuzz,\" but I don't want to cut it off, since it kind of fills in the spaces.  My onc told me as soon as I have enough hair to dye, to go for it.  Believe me, I will! Melinda - Looking good!  I have bags under my eyes big enough to pack for a trip, so no worries.  It seems like about 2 weeks after the end of rads, my hair really started to come in...you'll get there! Cafelovr - AWESOME NEWS!  Sending you thoughts for maybe even more shrinkage and easy surgery!  Sending warm Springtime hugs to all...",
      "MessageIndex": 1859,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 2, 2010 02:49PM RedheadPam wrote: Ladies, thanks for the congrats!  I went out for sushi today with my co-workers -- my first non-rads lunchtime in 6 weeks! Soooooo yummy.....  I went to a fundraiser on Friday for a foundation that gives grants to women with BC (I'm meeting with my new personal trainer tonight as part of my grant -- got to get rid of my \"bigassitis....\").  They had a spa treatment room that all the survivors got to participate in before the rest of the attendees.  I had my nails done, a facial microdermabrasion, then because that sucked all the makeup off, I have my makeup done by a pro.  Thought I would share my photo of little bald me all glammed up (I am wearing hot pink pjs, by the way -- everyone there wore their pink pjs...). Woo Hoo! ",
      "MessageIndex": 1746,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 11, 2010 01:02PM RedheadPam wrote: Hello, Ladies!  Welcome to all the monkeys on this side of the wall -- time for drinks! Brenda -I love the \"roadmap to recovery\". My markings totally looked like a map...I am so glad to have them gone.  The last ones faded away a few days after my last tx - yay! Shara - CONGRATS on the great news!!!! You kicked that tumor's ass!  Maybe you'll come away from the seedy motel with a great mystery novel ready to write. Sounds like you already have the characters... Saw my onc today, and I have in my hand the first of my Tamoxifen.  He said he'd like for me to be on that for 2 years, then we'll switch to an aromitase inhibitor.  Easier on the bones,  fewer SEs, apparently. Even though I had a hysterectomy a year before my BC diagnosis, he'd rather try that first. He's also setting me up with an appointment for the nutritionist to start working on my diet -- I'm past ass lyphedema and on to suffering from full-on fatassitis. It's been 10 days since my last rads, and except for a big pink circle where my boosts were, my skin is almost totally back to normal.  It sounds crazy, but I swear the green tea spray my rads onc had me use worked some kind of magic to keep away any major burns.  Wishing no SEs and soft foobies for all!",
      "MessageIndex": 1791,
      "PostDate": "11/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Apr 28, 2010 02:31PM RedheadPam wrote: So, Ladies, I've missed you all!  I stopped by just to send hugs to all and see how everyone is doing.  I saw all the hair photos - way to go!  I'm 16 weeks PFC, and here's what I have going on....It is taking on an odd light brown-ish color, but I'm afraid to color it.  I've heard too many stories of post-chemo hair turning purple with haircolor! The Chemo curlies are starting to arrive, too, although only in the back so far. I've had one little trim to get the wiry, white hair off, and that really helped. It is starting to feel less weird not having any doctor appointments, no one checking me out, just....life. Feels good, though. I hope you are all doing well and that you are feeling strong and loved. Hugs and hair to all!  ",
      "MessageIndex": 2147,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "May 20, 2010 07:14PM RedheadPam wrote: Ladies,  I just wanted to tell you all that your hair looks fab! It is so exciting to come back for a 'visit' and see so much hair going on!  I was sooo happy to hear that we have heard from CC.  Yay!  Well, i was planning on waiting until 6 months past-chemo to color my hair, but I just couldn't wait another minute.  I was tired of looking in the mirror and not seeing ME, So I went to the store, took a deep breath and grabbed whatever looked good. I decided to go with a semi-permanent color at first, kind of a dark brown auburn-ish color....and the \"chemo curls\" are starting to creep in.....so here I am, 5 months PFC.... ",
      "MessageIndex": 2340,
      "PostDate": "20/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 19, 2009 09:46AM RedheadPam wrote: Brenda Sharon -- thinking of you today and sending you clear vibes for your MRI results! Becca and iammom2four - welcome to our little sisterhood!  I am sorry BC brings you here, but glad you have found us. You'll find the support here amazing.  Alicia - I tried ativan and OMG!  I didn't sleep for 3 days. I am wondering whether the pounding is related to a mild anemia duing my nadir week, since I have read that can be a side effect.  I may look for a new multivitiamin with extra iron. I'm going to ask my onc next time we talk.  Kimmy -ice cream for breakfast is TOTALLY ok! Calcium, dairy, what could be better?  Sprinkle some granola or cereal bits on top and you might as well be eating Cheerios. Eat what tastes good!  I'm a little wiped today -- between the photo shoot, work and a board meeting yesterday, plus I went to the gym, I tried to do too much.  Won't do that again. I think today I will just hang in my little cubicle and try to catch up on stuff. Sometimes you just feel like putting your head down and taking a snooze, but the snoring might bother my cube mates.  Instead of hugs today, I'm goign to send out neck rubs, since that sounds reeeally goooood.....   ",
      "MessageIndex": 488,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 19, 2009 10:23AM RedheadPam wrote: Brenda Sharon -- doing the HAPPY DANCE here for you!",
      "MessageIndex": 495,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 28, 2009 01:42PM RedheadPam wrote: Hello ladies!  Just checking in from a relaxing holiday weekend to see how everyone is doing....Sherri and Suepen, congrats on the good news! Iammom2four...I agree that Immodium shouldn't make you constipated. After my first tx I took it for several days and it just made me \"normal.\" Give it a try, and get some baby wipes or the \"adult wipes\"...they helped me soooo much.  Not too many SEs after tx #2. Had the headache, ear ringing and blood pounding feeling that went away after day 7, and now have a very, very slight rash across my cheeks.  Last time the rash want all down my back and belly, so this time around it seems much better. I wore one of my wigs out to Thanksgiving dinner, and by dessert was ready to fling the thing across the restaurant. I just can't seem to find anything to go underneath the wigs to make it more comfy.  The little \"panty hose\" type things from the wig shop squeeze my head, and the edges of the wig (where the little adjustable tabs are) drive me crazy with itching! What do you all wear under your wig to make it bearable? TX #3 is coming up this week...I just keep thinking that I'll be 3/4 done! Anamary1, I totally understand how you feel.  My SEs have been mild to tolerable, and I feel a little guilty.  I wish I could figure out the secret to why my body tolerates chemo so well and share it with you all! I feel so bad for all my Warrior sisters who are suffering through this. Huge {{{HUGS}}} to you all -- wishing you joints that don't ache, food that tastes good, steroids that don't make you gain weight, and happy visits from the poop fairy. What more could you want!",
      "MessageIndex": 665,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Oct 14, 2010 02:40PM RedheadPam wrote: Alicia - love the highlights!  I have been putting off getting my curly mullet trimmed back and some highlights done...but you might just inspire me....",
      "MessageIndex": 3186,
      "PostDate": "14/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 8, 2011 04:44PM RedheadPam wrote: Ladies, Nothing much to report from here (and that's a GOOD thing!), but I was thinking about how last year at this time I had my last rads and finished treatment, then thought of all of you and wanted to send hugs.   So, Hugs and cocktails to all! Pam",
      "MessageIndex": 3819,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 17, 2011 01:29PM RedheadPam wrote: Ladies, thanks one and all for the props!  I think we are all rocking our looks with hair (why are all the smileys bald??)! Sue, I'd love to hear what the ENT doc and acupuncturist say about your tinnitus.  Mine is a bit different -- a steady, very high-pitched tone that comes and goes.  It's worst at night, but I can also hear it from time to time through the day, mostly on the right side.  It started with chemo and is one thing that has just hung around. Bleh.",
      "MessageIndex": 3852,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 18, 2011 10:05PM RedheadPam wrote: So, it's 11pm, and my achy, stiff hips and restless legs are keeping me awake.....sometimes, tamoxifen is really a mixed blessing.",
      "MessageIndex": 3854,
      "PostDate": "18/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Aug 27, 2014 07:06AM RedheadPam wrote: Hello all! I have been away from the board for so long, but you were all on my mind....tomorrow is a big day. I will be exactly 5 years out from DX day, and thankfully still NED. I have ten months more to go on Femara, and then my onc says that's it! I am not sure anyone but you ladies understands what mixed emotions a cancerversary brings. I want to make a huge, hot deal about it, but at the same time forget it happend. Unfortunately, cancer changes us forever in some way.  It seems both like forever ago and yet just yesterday that we all started on this unwanted journey together. Sending hugs to all....please friend me on Facebook - Pam Rosenberg. ",
      "MessageIndex": 4556,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 6, 2009 10:15AM RedheadPam wrote: Good Morning, Warriors!  Encouragement to everyone who is onthe chemo train today, or who is recovering....  regalu... I know exactly what you mean about looking forward to it.  As yucky as it is, I am looking forward to being able to say that I am HALFWAY DONE after next Thursday's treatment!  Get it over and done with!!  mouse.... some foods that have helped me are Pepperidge Farm raisin bread, plain..just enough sweetness to be yummy, but still bland, ginger ale, Rold Gold honey wheat pretzel rods, and Dannon Whips yogurt -- I don't like the consistency of yogurt, but I can do those.   Kimmy... My hair started falling out on day 13...first it was just about10 strands at a time, when I would run my fingers through it, I would come out with a little bit sticking to my fingers.  Yesterday, it became about 20 strands per, but not every time.  Today is day 15, and I am getting more like 30-40 strands at a time, plus it is falling on its own a little bit.  Not quite like a Charlie Brown Christmas tree shedding its needles yet !  I am wearing a white hoodie today, and the fleecy part of the hood is sweeping up hairs like crazy. My goal is to get through the weekend with hair, than I'll have my hairdresser shave it next week, accomapnied by my friends and a little \"bon voyage hair\" party.  Some one mentioned day 3 being the worst (I'm sorry I can't remember who...with chemo brain, by the time I scroll up, read, and scroll back down I forget who it was!!!!). For me, day 3 we great last time-- I woke up energetic and went to the gym!  Then day 4 came and I felt like I'd been hit by a truck and was nauseous. Day 4 is definintely the worst for me....  I have to share something that made me cry a little this week.  My daughter (10) has a best friends from the time they were babies. I was talking to her mom this week, and she said that the little girl had cut a foot off of her long, wavy hair and then asked her mom if she could give it to me! Breaks my heart and makes me proud all at once! Of course she ended up donating to Locks of Love. Somewhere out there a fellow bald warrior will be getting a beautiful brown wig made from hair from a very, very special little girl.  Much love and ginger ale toasts to everyone..... Pam",
      "MessageIndex": 167,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 19, 2009 03:09PM RedheadPam wrote:",
      "MessageIndex": 505,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Dec 7, 2009 09:43AM RedheadPam wrote: Hi, ladies, just checking in -- I had tx #3 Thursday, and it knocked me for a loop.  Don't know why it was harder this time, other than they pumped me way full of extra Benadryl. I was wiped out and kinda queasy...finally took a compazine last night and slept all night, which I hadn't done in weeks! Today the roads are a mess with snow, so I'm staying home from work and resting for one more day.  I just keep thinkiing that I only have one more tx to go, so I can make this -- we all can!  Be strong and push through, take care of ourselves.",
      "MessageIndex": 817,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Dec 12, 2009 03:07PM RedheadPam wrote: Hi, Ladies!  Life has been busy, so I apologize for being so quiet...We are lighting our Hanukkah candles by the light of our Christmas tree; December is jus tone long holiday at our house.  Happy Hanukkah to all my fellow warriors who celebrate! Tx #3 really did its work on me, but I started to feel much better yesterday. So far every tx has been just a little different in some way, wish I knew why. This time it has been more fatigue, a sore tongue, more of that \"all over crappy\" feeling and more ringing in my ears. Ah, well, just one more to go!  One little bit of good news is that they decided to move tx #4 from Christmas Eve to Dec.23, since most of the staff will be off the 24th. So I will be done one day sooner. Someone asked about hair -- I never did shave all the way down, so I have always had stubble, but now it is starting to grow back a bit! Woo Hoo! I actually have little tufts in front of my ears that are around1/2 inch long, but very very fine. Leg and pit hair is still there but sparse and slow-growing -- I have shaved maybe twice and haven't really needed to. I really miss my nose hairs -- my nose is totally dry and sore. ( Funny, I would NEVER have imagined typing the words \"I miss my nose hairs\" in a sentence!) DH and I went to his office party last night. I had thought about wearing a wig, since I had not seen his coworkers since I lost my hair, but he asked me not to.  He doesn't wan't me to be uncomfortable, and is perfectly happy with me in scarves and hats.  So comfort and my sweet DH won out. I found a lovely hand-dyed silk scarf at the gift shop where I work (an art education center), tied it over a stretchy black turban and off we went. I actually felt like a normal human being -- sometimes I forget about the whole hair thing and am surprised when I catch myself in a mirror and remember I'm bald! I am still figuring out where to wear a wig and where to go comfy -- is anyone wearing mostly wigs?  How does everyone decide? I am certainly not bold enough to go bald in public yet, but if anyone is, you go warrior!  My onc will be away for my last treatment, so I am seeing him Thursday to check in --strange to think this part of the battle is coming to a close. Then on to rads and, as they say, \"dancing with NED\"!!!!  Hugs to all -- Pam",
      "MessageIndex": 942,
      "PostDate": "12/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Jan 7, 2010 05:47PM - edited Jan 7, 2010 05:49PM by RedheadPam Hi, Warrior Women!  I am sending waves and vibes of happiness and strength to all.  Had my followup with my onc today and I am OFFICIALLY DONE WITH CHEMO! I had my last tx on 12/23, but onc has now given me the official all clear and we are ready to move on to rads! I cannot tell you how good this feels, and I can't wait until you are all in my shoes.  I know it seems like it will never end, but it WILL end and you WILL feel normal again. My big fat steroid face is starting to go down a bit and my stubble is starting to feel a little more like hair, although my eyelashes are apparently heading someplace warm for the winter. I can stop carrying anti nausea meds everywhere I go and can eat sushi and maybe even have a margarita.  I am sending every bit of determination and strength to all of you that I can. My Onc is setting up my appointment with the radiation onc...but he says I look like a good candidate for the Canadian protocol, which would mean only 3 weeks of rads. Will know soon!   Much love and wishes for no SEs..... (oh, ps...the commerical I was the \"wig model\" for is done -- anyone want to see?)",
      "MessageIndex": 1244,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Jan 8, 2010 12:45PM RedheadPam wrote: The Canadian Protocol is three weeks of treatments instead of six, but it depends on your stage, node involvement, etc.... http://www.breastcancer.org/treatment/radiation/new_research/20080922b.jsp",
      "MessageIndex": 1255,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Dec 28, 2009 05:29PM RedheadPam wrote: Melinda - somewhere along the way I was told (my surgeon, I think) to use only soaps like Basis or unscented, drop all antiperspirants with aluminum and so on -- I have been using a deoderant crystal and cornstarch powder along with the very mild unscented soap.  But It just isn't getting the chemo funk! I want to smell girly and be soft and lotion-y.  I know I should watch for parabens in cosmetics and try to stay organic, but I have to keep my mental health going, too. I got some Christmas money burning a hole in my pocket, so I may go shopping at Sephora or some such for some high-end organic lotions.",
      "MessageIndex": 1122,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Jan 14, 2010 10:59AM RedheadPam wrote: Toyah -- There are a few articles out there that say increased levels of HCG caused by breast cancer can produce false-positive pregancy tests. Hope that's what it turns out to be! http://ezinearticles.com/?False-Positive-Pregnancy-Test&id=1080612",
      "MessageIndex": 1313,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Jan 8, 2010 06:26AM RedheadPam wrote: Ok, so here is the link to the ad....I think there are 3 pictures of me in it. Aparently some of the images from the ads may show up in print, too, but who knows if I'll be one....the wig in the last shot is the one they gave me as payment for my day of modeling...... http://www.stvincent.org/about/foundation/foundation_success.htm",
      "MessageIndex": 1248,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Jan 19, 2010 05:05PM RedheadPam wrote: Hi, Ladies...just popping back from radiation land to check in on everyone. I hope chemo isn't giving everyone too many SEs. I feel like I am on the far bank of a huge river, and am shouting encouragement to you all while you swim across! You can make it! Rads is definitely different.  I was thinking about it while lying on the \"couch\" during treatment today (couch being a nice way to say hard table...).  Chemo was scary and wierd because it was toxic and made me sick, but on the other hand you sat in a recliner and had an IV, which was familiar.  Rads so far don't give me any SEs, so I don't feel sick (yet), but you lie on a hard table in a big room while a huge machine zaps you and people talk to you over an intercom. It is scary and wierd in a whole different way.  I am starting to get into the routine of rads -- going every day at lunch, getting situated under the machine, putting cream on my breast, keeping my markings visible. I am doing 33 treatments total, 28 regular and 5 boosts. I see the Rads onc every Monday after my tx.I am in and out in less than 20 minutes most days. I may be delusional, but I think my hair is starting to come back a little bit.  My dr said it is ok to take biotin supplements to encourage hair growth, so I'm giving it a try. At least it feels a little more like hair and a little less like stubble -- even though someof it is still teeny-tiny. Probably every sixth hair is sticking up an inch or so, but is still that transparent chemo hair. Every day I feel a little more of the effects of chemo fading away. I am sleeping better, at least. I am holding my breath to see if I lose any more eyelashes...I hear that happens about a month post-chemo. I am still thinking of you all and sending good vibes...hoping you all join me on this side soon!!!",
      "MessageIndex": 1366,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Feb 19, 2010 04:27PM RedheadPam wrote: Michele, I don't know anything about the boosts yet, other than they are focused right on where the tumor was and a little bit surrounding it.  They showed me a special metal frame today that was built just for me, that I think the radiation boost is focused through. It shouldn't hurt any more than a regular zap, I don't think....The main thing that has bothered me about rads is having to go every fricken' day. At least I get weekends off, but my every lunch hour has been driving to rads, getting rads, driving back to work from rads. Repeat.You're right about feeling like Groundhog's Day. Alicia -- I still have SOME of my eyelashes, but they are mighty sparse.  I never wear mascara anyway since it bugs my contacts, so I've been substituting eyeliner.  Hugs to all!",
      "MessageIndex": 1666,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Apr 28, 2010 05:05PM RedheadPam wrote: I was a redhead -- I was my color, I bought it myself! My natural color was more of a dark brown with a touch of auburn, but I had been all out red/auburn for years.  It is growing back in thick -- I used a kit from the drugstore called Regentresse...the package says it's like Nioxin, but it was cheaper. I can't say if it helped, but so far it hasn't hurt!  The white wiry bits kind of stuck out all over randomly, plus I had little longer 'tufts' over each ear.  I did start out more gray, but it just seems to get darker by the day.   I have no idea where the little light brown patch on the crown of my head came from --that just showed up this morning. Every day it's something new. I am on Tamoxifen, and I don't see any effect on my hair...I'm interested to hear whether anyone is feeling side effects form it.  So far I'm ok, but I keep waiting for those famous mood swings to hit!!!",
      "MessageIndex": 2150,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Feb 11, 2010 03:57PM - edited Feb 11, 2010 03:58PM by RedheadPam {{{{{{{{{{{{{HUGS}}}}}}}}}}}} to all you warrior women!  Welcome to the new monkeys on this side of the wall! ",
      "MessageIndex": 1607,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Jun 14, 2010 01:46PM RedheadPam wrote: Hi, Ladies!  I just wanted to stop by and see how everyone's doing.  Sending big warm hugs your way! I went to my onc last week for my first checkup since ending treatments.  I was sitting there waiting for my blood draw, when I looked across the hall and got a glimpse of the chemo infusion rooms. Suddenly, it all came rushing back and I almost cried. On the good side, though, it was soooo sweet seeing the words \"No Evidence of Disease\" on his computer screen!  Gotta love that NED! I see my rads onc in a month or so for my checkup with her....It is still strange NOT having doctor appts..... I'm going to try to change my photo to a current one -- if it works, you'll see the latest on the hair growing project.  I described it the other day as \"Peter Pan pixie length.\"  Color isn't taking as well as I'd like, but each time I do a semi-permanent color it seems to work better. Take care of yourselves...sending many healing thoughts to everyone....",
      "MessageIndex": 2475,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 2, 2010 04:36PM RedheadPam wrote: Alicia - Ha!  I wish those were my eyebrows!  The inside bit on each is me, the rest is drawn on -- but she did do a good job!",
      "MessageIndex": 1748,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Mar 17, 2010 01:07PM RedheadPam wrote:",
      "MessageIndex": 1842,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Oct 12, 2010 04:39PM RedheadPam wrote: Ladies,  I just stopped by to see how everyone is doing..so much good news lately!!  Sending {{{BIG HUGS}}}}} to all.  It's hard to believe that it was just a year ago that we all met - damn, what a year it's been! I had my first real mammo since diagnosis last week....thank god still NED :-)!  The radiologist who read the results says I don't need to come back for a year...of course, my onc and rads onc may differ on that, but still, the thought of going a whole year is exciting and scary, at the same time.  I'm hanging in on Tamoxifen, just the occasional hot flash, leg cramp and muscle ache, nothing major.  Have somehow managed to lose almost 20 lbs, but don't tell anyone about the Oreo I just scarfed down! My onc is big on 'no sugar', but really? I consider chocolate to be therapy. What fun is life without an occasional Oreo....! Is anyone else feeling a little overwhelmed having a \"cancerversary\" at the same time as Breast Cancer Awareness month?   I almost teared up at the grocery the other day...something about seeing pink cases of soda and bags of chips was just overwhelming.  I appreciate the effort, but sometimes you just wanna get away from all that pink! Sending out my love to all -- I read here all the time, but really need to get off my rear and post more often. Take care, stay healthy....",
      "MessageIndex": 3156,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Apr 21, 2011 04:03PM RedheadPam wrote: Hello, ladies!  I just stopped by to send Happy Easter/Happy Passover hugs to everyone (it's chocolate bunnies AND matzoh at our house ). Not much new to report here, other than Spring finally arriving, so that's a good thing.  I am talking to my onc about aching and stiffness in my hips -- they say it's a common side effect of the Tamox, so I'm hoping some Tylenol Arthritis will help. Makes me feel darn old, though. I am trying to find a website for someone -- I am racking my brain trying to find a site where you put in different aspects of your diagnosis and it gives you a percentage benefit of treatment -- am I crazy? I feel like I used it at some point, and now it's like it doesn't exist.  Ah, chemo brain, how you stink. Wishing everyone lots of warmth and sunshine....",
      "MessageIndex": 3962,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Apr 23, 2011 01:03PM RedheadPam wrote: Thanks, Melinda -- that's the site I was thinking of!",
      "MessageIndex": 3970,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 5, 2009 01:44PM RedheadPam wrote: Hi, fellow Warriors!  Thanks to all for the kind welcome...I really look forward to checking in and hearing how everyone is doing.  Well, today for me is day 14 post-chemo#1, and the hair is coming out right on schedule. Not in big clumps, but when I run my hand through my hair, I get 10-20 strands each time. It's gonna take a while for it all to fall out, though, since I have always had super-thick hair.  In a way I'm relieved that it finally started to fall, because me scalp has been KILLING me (think allover bad sunburn), and it does seem to hurt less now.  Just for fun, DH and I were adding up how much I'll save over the next year in hair product, cuts, bikini waxes, etc....made me feel a little bit better!  Gotta find SOMETHING to smile about! Hugs and virgin martinis to all!",
      "MessageIndex": 142,
      "PostDate": "05/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 7, 2009 06:29PM RedheadPam wrote: HI, all! I forgot to give my stats last time -- I'm 49, married to an amazing man for 15 years.  We have one daughter, 10, who is adopted -- I have been wondering whether the fertility drugs I took doing IVF years ago had anything to do with my BC.  We had a gorgeous day here, and I spent the day shopping with DD. It was the first day I didn't feel comfortable going out without a hat...I lost a good, large handful of hair in the shower this morning. I am hoping to keep as much as possible through tomorrow.  We are going to visit my dad, who is in his 80's, and I really want to keep everything as normal as posible for him. I feel totally normal and pretty energetic, but don't want to LOOK sicker than I am. reglau -- I was absolutely flushed and hot the first couple of days after tx.  Not sure if it was the chemo or the steroids. Hope everyone has a relaxing and peaceful Sunday!  Pam",
      "MessageIndex": 208,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 12, 2009 01:57PM RedheadPam wrote: Hello fellow Warriors!  I'm just back from tx #2...thanks to all for you good wishes, I am sure they helped!  #2 was a bit easier, just because I knew what to expect. Even with extra steroids last night, and IV steroids and Bendryl before tx, I had a slight allergic reaction to the Taxotere. Luckily, it was MUCH milder than last time and a little \"push\" of Bendryl took care of it. Now I feel fine but and sleeeeepy from all the Bendryl.  Halfway done!!!!!!! I had a \"roommate\" in chemo this morning...a man and his wife...there was a little excitement because tomorrow is his last tx, and he has been coming in for chemo every day for the last month!  Puts my four little treatments into a whole new perspective. I did find out that they have cake to celebrate everyone's last tx, so I'll start think about what kind of cake I want. Now I'm off to take a nap, so I will check back in later.  Many {{{{{hugs}}}}}}} to all.....",
      "MessageIndex": 326,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 14, 2009 02:44PM - edited Nov 14, 2009 02:46PM by RedheadPam Hello, fellow warriors!  Hope everyone who had a tx this week is feeling well and strong.  Major{{hugs}} to Melinda, BrendaSharon, Cafelovr, Coolbreeze and anyone else who needs one -- hugs are always free.  A few of you ladies have asked about the allergic reaction to the Taxotere...believe me, you know something is up the minute it kicks in! The first tx, they gave me IV steroids but no Bendryl before.  within a few seconds of the Taxotere drip starting, my chest started to tighten, then my face turned beet red. Then my lower back and hip muscles \"seized up\" --- that was what really hurt! DH yelled for the nurse to come back and everyone came running. They pushed a Bendryl injection thrugh my IV, and gradually everything subsided. This time around, I took extra steroids the night before, they added a Bendyrl drip and I still had some of the muscle pain. One Bendryl push took it away almost immediately, though.  So now we know to tell the nurse to stay close and keep an eye on me. No problems as all with the Cytoxan.  Besides that, I am having a fairly easy time of it. No problems with smells or tastes, my nails are fine, and I've had to take anti-nausea meds only two days out of the three weeks. No neuropathy yet, either, knock on wood. My onc says because my wbc count stayed up last time, he doesn't need to see me between treatments.  So barring any issues, I am on my own until my next tx! We went to the mall today for the first time since I lost my hair, and that was a little strange.  I felt a bit conspicious in my scarf (cool white bandana with sequins from headcovers.com), but you know what? If people want to stare, let 'em. I will wear my baldness (well, covered with a scarf or hat...I'm not THAT bold yet!) proudly as a WARRIOR!",
      "MessageIndex": 378,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 26, 2010 03:52PM RedheadPam wrote:",
      "MessageIndex": 3437,
      "PostDate": "26/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Aug 29, 2011 10:21AM RedheadPam wrote: Hello ladies -- I was thinking of you all yesterday on my \"cancerversary\" (does anyone else hate that term?) and hoping you're all well....what a journey we've all had in the last two years. As much as I wish this had never happened to any of us, I have to say that the best thing to come out of all this has been the amazing community of women I've found online and on Twitter. On to more lightearted topics...I got my hair cut last week and tadaaa! Chemo curl is gone . Only took a couple of years, but hey! I was very excited. Check out the new profile photo....  Sending warm hugs, chocolate and fruity cocktails to one and all...",
      "MessageIndex": 4215,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 3, 2009 04:23PM RedheadPam wrote: Hello, fellow warrior chicks!  Mind if I join in?  I actually had my first TC tx Oct 22, but it seems like my diagnosis date is about the same as everyone's, so I thought I might grab my water bottle and my fluffly blankie and settle in right here. I was diagnosed during my normal mammo. Had a lumpectomy 9/24 with no node involvement and clear margins, so DH and I were doing the happy happy dance, thinking it would be radiation then Aromitase Inhibitors(I've had a hysterectomy,so I can do those instead of Tamoxifen). My Oncotype DX came back at 30 -- and I think it shocked even my surgeon and onc.  So now it's 4 rounds of TC on10/22, 11/12, 12/4 and yes, Christmas Eve. Merry Friggin' Ho! My first chemo has been good, so far...better than I had feared.  I did have a headache and this wierd whooshing sound in my ears the first week or so -- did anyone else get that? Not much nausea...although I did dive in to a whole Red Velvet cupcake on Saturday and ooooohhh, paid for it in spades later. You'd think it would put me off of cupcakes, but no such luck...they still tempted me the next day. Damn little perky sweet morsels of deliciousness! Today, my scalp is aflame, so I fear that my hair is not long for this world.  Ah, well, I scored a sweet wig at the Look Good Feel Better session I went to yesterday -- Raqual Welch brand and everything! I haven't had a chance to read through everyone's post, but I look forward to sharing this journey with you all....many hug..... Pam",
      "MessageIndex": 97,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 18, 2009 01:17PM RedheadPam wrote: OK, just for fun, post your answers to these questions: Thing(s) I miss most while on chemo: Margaritas and antiperspirant! Thing(s) I miss LEAST on chemo: tweezing! Most annoying trivial side effect of chemo: Less public hair = more, um, \"spraying\" on the potty... who knew? Silver lining: Standing in your chemo scarf holding your tray in the middle of a busy Chipotle at lunchtime gets you a table faster than normal! Anyone?",
      "MessageIndex": 470,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 20, 2009 08:58AM RedheadPam wrote: Wig pics!  So I took pics in both of my wigs -- the first is the one I got at the photoshoot the other day, the other one I got at the LGFB seminar. I like the cut of the first, but the second color is closer to my usual.  Here's #1 ",
      "MessageIndex": 519,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 20, 2009 09:59AM RedheadPam wrote: Here's #2 -- it's a little longer in the back than you can see..... ",
      "MessageIndex": 525,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 20, 2009 12:42PM RedheadPam wrote: Kimmy -- sooo glad you are feeling good!  Never feel bad about bragging a bit -- I think it gives us all hope when we are down.  Now I am craving banana bread!  Did anyone else know that you have a 5-post limit per 24 hours until you hit 50 posts?  I found that out when I hit the limit between wig photo #1 and #2! You don't find out you're over the limit until your post is all set and you hit \"submit\", either.  Oh well, now I know.  One thing I have been wondering about is the Neupogen shots.  Did everyone's onc just included those as part of the \"package,\" or are they in response to a SE?   Mine has never mentioned them, didn't even want me come in for bloodwork between tx's this time because my wbc count was good last time.Don't get me wrong, I'm certainly not missing them, I just wondered!  Doronet -- the other thing I like on crackers is the little Laughing Cow cheese - the soft one that comes in wedges.  It's a little less tangy than cream cheese to my taste, so sometimes that goes down easier.  Thanks to everyone for the kind words about my wigs! I am getting used to them a bit more, but  dang, they itch! Scarves and hats are so much more comfy.I need to find the right thing to wear under them, because the little thing from the wig shop (like a \"footy\" for your head) squeezes too much, and a terrycloth scarf liner is too big.I'd love to see everyoneelse's pics. I will bet you are all lovely in yours . Big hugs to all, especially those in the midst of treatment and the aftermath..... Pam",
      "MessageIndex": 533,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 18, 2009 12:59PM RedheadPam wrote: Hi and {{{{HUGS}}} to all my WARRIOR sisters! Sorry I've been away for a couple of days. I felt like crap on a cracker Sunday night and Monday, so all I did was sleep. Yesterday, I woke up feeling like a new person and hopped off to work. So the pattern seems to be holding that days 4 and 5 are my\"out of it\" days. The only side effects I am having right now are dry eyes, heartburn/reflux (does it ever go away?) and the most annoying one...when I lie down at night, I feel my heartbeat through my whole body BOOM BOOM BOOM. My heartbeat isn't rushing, I just feel it all over! I am trying relaxation techniques, but I am wondering whether this is a SE of the chemo or of \"chemopause.\" In either case, it stinks. I had a bit of a brush with fame today and have to tell you about it! I was at a local hospital boutique a week or so ago, playing with wigs and hats, when the saleslady asked if I'd be willing to be a model in a a photoshoot they were going to do. They'd pay me with a wig. Sure! said I, always up for an adventure and a free wig :-). So I show up this morning, and there was a photographer, a director, a MAKEUP STYLIST and about five other people, waiting to take my photo!!! I tried on wigs, shopped for hats, etc. while the photog snapped away and I did my best Next Top Model imitation. They're going to make the stills into a tv ad for the boutique! I came away with a new Rene of Paris wig. I have absolutely no idea when or where it will be on, but anyone in the Indy area, keep an eye out for my little bald head. I have been thinking about a little \"posting game\" we can play for fun, so I may be posting some fun questions here in a bit. Anyone up for a smile? much love to all.....",
      "MessageIndex": 468,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Nov 22, 2009 07:27PM RedheadPam wrote: Hi, ladies!  Hope you don't mind a \"newbie\" popping in to ask a question.....I am on Taxotere and Cytoxan.  Started to lose my hair right on schedule around day 13 after my first tx, shaved it down to a little \"stubble\" around day 17. So now I am a little more than a week out after my 2nd tx, and I swear the stubble is growing!  It itches and pokes when I sleep. So what is up with that and what should I do?  Shave it down, let it be?  Is this going to fall out again, grow more or just hang out as it is? Any advice appreciated....thanks!",
      "MessageIndex": 3957,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RedheadPam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91878/profile",
      "Content": "Dec 22, 2009 08:29AM RedheadPam wrote: Hi, momto3!  I was diagnosed with Stage 1 Grade 1 IDC in late August during my regular mammogram. It was sized at just under 1cm.  Had a lumpectory in September, and thankfully had no node involvement and clear margins. We assumed from all the results that I would go straight to radiation, but my oncotype came back at 30(!!!), so it was onto 4 rounds of chemo for me. I am having my last treatment this week, then will have rads starting in January.   I agree with Jofran -- have the Octotype test! It showed that I had a 22% chance that my cancer would come back, which will go down to around 8% thanks to the chemo.  The lumpectomy was easy, as surgeries go.  I've had a gall bladder removal, tubal surgery and a hysterectomy, and this was easier than any of those.  Best of luck, and feel free to ask anything -- the women here are the best!",
      "MessageIndex": 3,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/745649",
      "Title": "Anyone with successful Lumpectomy stories momto3 ootee"
    }
  ]
}