{
  "AuthorID": "Redhead01",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
  "Posts": [
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Nov 15, 2014 01:10AM Redhead01 wrote: Erica....I also responded to you on another board....my first T/C  chemo was 11/13... and am very relived i am feeling great!  But have been proactive thanxs to tips on theses boards, loading up with ginger root tabs/tea/candy/snaps....and drinkign 100 oz of juice-flavored water for 2 days now to flush the toxins.  No nauseu to speek of...I also took the dr presribes meds whether I felt any coming on....no harm...take it before you \"May\" need it.  Today is Neulasta shot, but have taken the advice of others here to take Claritin 3 days before and for a week after {more than drs say)   can't hurt.  VERY mild bowel issues so far.. i've had worse after a bad meal out.   Worst was having a blood pressure of 181/110 when they sat me in the infusion chair...anxious, much? So they reduced that with a shot (had my port put in only 3 days prior....no numbing cream but they iced the area...it was still sore and healing but that wasnt too bad either).  I'm also taking B6, D3, and magnesuim to head of neuropahty issue....alll cleared with my onc team.  Hope this helps you hunny, praising God I found the angels He sent here to help us along the way.  Blessings....cant wait to hear bout your story now.  Hugs  Ginny",
      "MessageIndex": 191,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Nov 19, 2014 11:37AM Redhead01 wrote: On wanting to reduce some meds today, I skipped the Claritin....heck, been taking it daily for 7 days now......wrong move!  Had to leave work in intense bone pain...then read that the shot is time-relased over 10 days.....duh....wish I'd known that.  Trying to limit the Ibuprofin too, since can only take 6 per 24 hrs.  I may have an oxycodine tonite----yet those cause constipation ARRRRGH what a balancing act this is becoming.  ",
      "MessageIndex": 307,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Nov 29, 2014 11:44PM Redhead01 wrote: Greetings all.....hoping your Thanksgiving was awesome!  Just caught up a bit on the board, was absent more due to being busy...a good thing!  Kept as much hair as possible for holiday pictures...but was able to start pulling it out 3 days before....now have patchy bald spots and am anxious to get this part over with.  #2 chemo on Dec 4th/Thursday, so it's gearing up for battle time again.  My biggest problem was with the Neulasta shot.....took Claritin as suggested....stopped 4 days after shot, went to work....but could barely drive myself home.....felt like labor pains in hips and back...the pain got ahead of the ibuprofin and a claritin once I got home.  Luckily had Vicodin...  The next dr visit I told my story...said I could take claritin every day...and gave me a prescript for Vicoprofin for next time.    Thank you for the head toppings info....thinking I'll skip the wig thing, but who knows.  Best wishes to you gals, keep posting your stories, it really helps to know we're not alone in this.  Sure, we have our loved ones.....but no one truly knows what we have been dealt. HUGS!",
      "MessageIndex": 505,
      "PostDate": "29/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Dec 1, 2014 06:59PM Redhead01 wrote: Hey Girls....saw this tip and works for me, when you get down to the precious few remaining short hairs.... \"brush\" your head with a sueded lint remover (theyre usually red) ....not the sticky-gel rollers.  Feels nicer and helps relieve the itchies, plus trapping them.  Wearing a hat to work today.....OK for now, but don't know how MONTHS of this will feel.  My #2 T/C is Thursday....gearing up too with ginger tablets 2x/day now, and will super-hydrate beginning Wed (100 oz per day....)  Really seemed to keep the SE's very managable, and am more prepared for Neulasta too.  Bring it on....means half way done! Also.... am Ginny Creyer on Facebook......since we need an invite.  Thank you!",
      "MessageIndex": 544,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Feb 1, 2015 11:04AM Redhead01 wrote: Minivan....I feel your angst. Since most of us in this group are well into our chemo regimes or done, the full forces of what we've been through are hitting like a brick wall. My kids are in their 30's now, so I can tell you that BC or not....teenagers begin to pull away from us....its natural and normal, so try not to take it too personally. I highly doubt they want a new mother, so cut that self-depreciating thought. My relief of my last chemo on Jan 15, has been replaced with being so fed up with feeling sick and tired, with no end in near sight....I'm hearing 4-6 months after to gain some strength , and I've yet to even start radiation. I'm tired of the fight too. I don't feel like I'm a survivor.....just barely surviving instead. I pity anyone one around me, expecting me to be on the mend but I'm just not! This all sucks...but there is the chance...that tomorrow will be better than today. Dear God, please bless us all with more peace and patience to endure this with grace. Amen",
      "MessageIndex": 891,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Feb 1, 2015 05:11PM Redhead01 wrote: Wheelygirl....I just noticed our dx/treatment course is almost identical. I too, didn't feel \"recovered\" from my 3rd chemo before the 4th came up, felt cheated out of that one good week....but at least my last good week was at Christmas. Congrats on having your last one this week, enjoy knowing that much is done, hunker down for the long haul. I'm having my port removed on 2/19, then heal a few weeks, getting rad sim mid-March. I'm laying on my belly for rads, and having to lay on the port besides would suck. I'm thankful for the break, rather than wanting to get it over with.....either way, time passes, and by the looks of things, it's months of fatigue either way. Have you visited the Winter Rads board yet? I have...time to get saddled up for the next battle, and these women here are great, as the medical community dismisses most our complaints. They have the best advice based on experience. My husband has been my best cheerleader too. I'd be sick of me by now, so either he's a good actor or really does love me! ",
      "MessageIndex": 893,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Nov 18, 2014 04:25AM Redhead01 wrote: Good Morning Ladies-in-Waiting (for this to be over).   I'm Day 5 since 1st T/C....and the big D is hitting this morning....waiting for the anti-D's to kick in before heading into day-2 of work.  Breath In....the first day is the best....get your meds set up, stock the frig, vacuum or clean if it'll make you feel better.   All the pre-prep the Ladies suggest really do help ALOT.  I wasn't having any major bowl issues...until today :( Silverbelle.....I had the Neulasta shot on Saturday....got it in my belly (heard that reduces site soreness....I had ZERO there).  Take Claritin a fews days longer than dr's say.  Last nite was the only time that ibuprofen wasn't helping...and you can only take 6 in 24 hrs, so I crawled into bed with a heating pad...that helped.  I think I will space out the pain killers today....would rather be able to sleep, than not be uncomfortable during the day. Soups and ice cream seem to feel the best.... been forcing bananas and yogurt.  Having a protein shake now with crushed ice.... Re: Port cream...... was told to cover with a piece of Saran Wrap after you apply (usually 1 hr before chemo).  Might work better than a Band-Aid.  I didn't have the cream yet for C#1, but was given a bag of ice for the area before the stick...not bad. Running on Faith! Hugs to all....Ginny      ",
      "MessageIndex": 256,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Nov 19, 2014 12:20AM Redhead01 wrote: sheeba: re mouth cocktail..... I put 2 cups water in a small jar (maybe held pickles?)..... stir in 1 teaspoon of salt, 1 teaspoon baking soda.  I keep it at the kitchen sink when home, take along to work.  I keep a tiny plastic cup with it....like the kind on top of cough syrp bottles.  I actually love to rinse whenever possible as it makes my mouth feel fresher.    Day 6 for me...was feeling quite well after morning Big D....but was woken up at 2am with just general achey pain.  Hair is starting to itch....like its dirty and due for a wash...but isn't.  I'm not getting it cut short first.....keeping all I can as long as I can. Erica.....I could not keep up with the 100 oz of water after day 3....made me feel worse.  But do agree it is most beneficial to flush out what toxins you can ASAP.  Don't worry if you have to ease up....don't force yourself.    Keep sharing Ladies....we may not all get to mention each one of separately, but I do read each helpfull bit.  Sharing our tips is the best...even though we are all so different, in general....the tips help tremendously.",
      "MessageIndex": 292,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Dec 10, 2014 12:30AM Redhead01 wrote: sashield....love your attitude....LMAO at mother-in-law comment !",
      "MessageIndex": 670,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Dec 13, 2014 01:32AM Redhead01 wrote: Sooooo relating to the bad moods/vibes thing.....was just telling hubs that I need to snap out of it and remember to be grateful for a warm home, food, loving dogs to snuggle with, over a dozen encouragment cards from friends.....we all get it.  Even each side effect isn't all that bad.....but combined and for days on end....takes it toll.  Week one over....its uphill from here now.  Seems like the big D was worse this second round, and yes....doing little chores are fatiguing.  Expecting and planning on doing barely nothing after the next two remaining ones.  There's plenty of nothing to do in February so I'll catch up on whatever then.  I don't have children at home anymore, but I would suggest those that do, start making good on accepting the help of anyone who offered.  It will bless them, and you.  Hugs to you all.",
      "MessageIndex": 689,
      "PostDate": "13/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Dec 15, 2014 04:17PM Redhead01 wrote: YO Mrshq1...... the 100 oz does NOT have to be all pure water.... gag!  I've added a bit of POM fruit juice to mine to flavor it, used herbal teas....soups count.  Have a blast on the 29th! Marcela - Onc said the Big D can be helped with pro-biotics, instead of meds...since you prefer that.  We are all entitled to a good rant and/or pity-party....just don't pitch a tent and stay there.  I must remind myself of my blessings constantly. My new adventure:   A skin rash on face and scalp.  Actually...a combo of red bumps, flushed areas, and flat scaley patches here & there.  My 'watch'   list says only need to call the doc when 50%+ of the body is covered....Gawd, hope not! 2nd Facebook request please:  My email is GinnyCU2@aol.com... Muchas !  ",
      "MessageIndex": 710,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Dec 5, 2014 11:54AM Redhead01 wrote: Prayers for dear Janiner on their way! Have that pity-party....we all desersve one now and then and a good cry is thearaptuic!  Big battles like that one however make the smaller ones more bearable.  I had my 1st chemo 3 days afer port surgery....no numbing cream, but they did ice before the procedure.  I'm still brusied around the port, a month later...and taking off the bra seems to pull on it, so the girls are strapped in till bed time (used to be the first thing I did when got home from work...drop the bra)!  Had my 2nd T/C on 12/4...used the numbing cream but actually think the icing worked better.  Perhaps doing both may help ease your way, Janiner.   Soon we all will be rocking the bald look, loving the shorter shower times, freedom of changing up our looks with hats and wigs.  Get some fab BIG earrings and bold lipsticks.  We've been given CHOICES via that dreaded word....change.  Most changes in life are unwanted and uncomfortable....but usually it turns out to be good for you.  We've each made the choice to FIGHT this cancer....let's embrace the changes it brings....especially life perspectives renewed.  Hugs and love to each of you.",
      "MessageIndex": 612,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Nov 4, 2014 08:08PM Redhead01 wrote: Greetings fellow travelers on this detour of our lives.  Thank you for starting a thread that we'll all be basically on a similar time-line together.  I'm getting a port on Monday, 11/10...then start chemo on the 13th.  Taxotere & Cytoxan, once every three weeks, 4 times.  FOUR!!  I am so relieved....  it will still be a course of 3 months, but am so thankful.   Living in PA, I hibernate over the winter time anyway, dark early nights will be easier to take if I'm ready for bed at 6PM !!  Cheers ladies, God bless each of you. Ginny",
      "MessageIndex": 68,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Feb 14, 2015 03:41AM Redhead01 wrote: Justjean....your rant is more than justified, and you're more than welcome in any society...polite or not, telling it like it is, is refreshing. This journey is hard on us all, even those with \"minimal\" SEs....we've been slashed, poisoned and burned....barbaric indeed. I don't start my rads until mid-March, so have begun reading these boards now. I prefer nothing be sugar coated and prepared for the worst while praying for the best. I for one, appreciate your sharing",
      "MessageIndex": 1669,
      "PostDate": "14/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Feb 24, 2015 12:07PM Redhead01 wrote: As for wait times....my last chemo was Jan 15, had my port removed February 19, and going for rad sim on March 13. I wanted the port out due to lying prone for the rads.....the docs didn't think it was a dangerous request. If any of those sucker cancer cells got started again after chemo, the rads will finish them off, so I'm not worried. I'm thankful for the breaks to regain strength and more \"normal\" days before hitting this last marathon. I'll be looking for a Spring Ads group here too. Thank you all for sharing your adventures",
      "MessageIndex": 1892,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Apr 4, 2015 10:42AM Redhead01 wrote: I only had TWO lymph nodes removed, and developed Stage 2 Lymphedema, so wearing a compression sleeve as much as possible. Am hoping some weight loss in the future will help with this. Good to catch it early, but hard to reverse, if at all.",
      "MessageIndex": 2695,
      "PostDate": "04/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Oct 22, 2014 08:26AM - edited Oct 22, 2014 08:35AM by Redhead01 Thanks for a shout-out!  Your type of cancer seems to be the same as mine.  I haven't gotten to the 5 yr pill thing yet.... am reading up on Armidex and Tamoxifil.....both have scarey side affects!  I'll have to check out those kinds of boards too :)  Hugs & Blessings",
      "MessageIndex": 645,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Oct 22, 2014 08:33AM Redhead01 wrote: Thank you for the shout out, and cream info.  Being a redhead, I'm just shy of being albino-white with  sensitive skin.  I have a feeling I'll be airing this \"girl\" out whenever I can...hubs will love THAT! LOL  Hugs and blessings :) ",
      "MessageIndex": 646,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Oct 21, 2014 01:41PM Redhead01 wrote: Greetings all....newbie here!  I will be getting getting a scan and markings on Friday, and if all goes well, will have my first rad treatment.  I will be getting these in a prone position, with the left breast hanging out for all the fun.  I am SO happy to have this option, as my small tumor was right up against the chest wall....was really worried about rads...hadn't even heard of this option!  My question:  Is anybody else here using this position (laying on your stomach)?",
      "MessageIndex": 632,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Redhead01",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206770/profile",
      "Content": "Oct 22, 2014 12:19PM - edited Oct 22, 2014 12:19PM by Redhead01 I share your concerns, especially since my tumor was smack-dab against my chest wall (left).  I am being offered rads in a prone position, that is.....laying on your belly, with your breast hanging down...I'm  reading that this lessens heart/lung side effects by 90%!  Why aren't ALL rads given this way?  Anyway, seems that only the bigger city/cancer centers have these specialized tables.  See if this can be an option for you....it sure reduced my anxiety.",
      "MessageIndex": 647,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    }
  ]
}