{
  "AuthorID": "Redoat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111649/profile",
  "Posts": [
    {
      "AuthorID": "Redoat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111649/profile",
      "Content": "Redoat wrote: I wrote about 13 days ago.. my Grandmother who has stage IV Breast cancer with mets to the bone... was taken to the hospital 13 days with a horrible cough and trouble breathing... told us it was PNEUMONIA.... Within 24 hrs of starting antibiotics, she had to be put on a ventilator.... to help with oxygen.. within 24 hours of that.. she has to be put in a RESPIRATOR(breathing tube down and feeding tube as well)  We went on like this for days and days... she trying to pull the tube out.. they trying to figure out why the pneumonia wasn't clearing up.  Turns out not only did she have the pneumonia but a pleural effusion. They were able to drain 2 liters of fluid from her lungs!!!!!!!!!!!!!  We have been there every day... watching her go through this.. and then today... she was able to get off the RESPIRATOR and is not just on an oxygen mask that is not invasive.. she is with it and is breathing well with just the mask on! She is weak but knows what's going on and is starting to eat small amounts of soft food.  The biopsy of the lung came back benign however the fluid came back malignant. We now wait for her oncologist to tell us what should be next! She is so weak, I can't imagine chemo right now for her, but I think they do want to continue the treatment.. (as we were only diagnosed in OctobeR) So she is still in ICU and we WAIT and we WAIT...... I feel like she's getting weaker and weaker.. and slipping away from me.. and it SCARES THE HELL OUT OF Me.. I've never gone a day without her with me..... seeing her.... being on the phone with her. She's lived with us my whole life and even after I got married 2 years ago, I spoke to her on the phone 2-3 times a DAY.. and saw her 4-5 times a week!!!! God I need my miracle! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763250",
      "Title": "My grandma update Redoat chainsawz"
    },
    {
      "AuthorID": "Redoat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111649/profile",
      "Content": "Redoat wrote: My grandmother was diagnosed in October with STAGE 4 .....mets to the bone.... she has been on radiation.. and currently XOLEDA. We recently found out that she now has mets to the Stomach. She was rushed to the hospital on 12/30 with trouble breathing and a cough. She has PNEUMONIA and is on a ventilator in ICU... they have her sedated and the Dr. said that the pneumonia is starting to break up... but I am just starting to have a bad feeling abouit this all.. It's sooo much ......... she is soo out of it and druged up and she had to stop her CANCER TREATMENTS (Chemo, Herception, Zometa) because of the PNEUMONIA..... which is scaring me too :-( I just need her to beat this and get BACK ON TREATMENTs :-(  SOOOO SCARED.. NEED PRAYERS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762833",
      "Title": "Just getting worse Redoat justjudie"
    },
    {
      "AuthorID": "Redoat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111649/profile",
      "Content": "Jan 3, 2011 02:50PM Redoat wrote: Thank you everyone! I went to work today because I know I need to maintain some sort of normalcy in life. I will be back up at the hospital at 6pm this evening. My mother was up there before and I was told that she is resting comfortably on the ventilator. She is still sedated and has been sleeping for the last 12 hours straight.",
      "MessageIndex": 9,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762833",
      "Title": "Just getting worse Redoat justjudie"
    },
    {
      "AuthorID": "Redoat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111649/profile",
      "Content": "Redoat wrote: My grandmother, Helene, is now an ANGEL! She passed Saturday night after a short but intense battle with Stage 4 Breast Cancer I have only posted a few times.. as my grandmother was only diagnosed in October of 2010, I didn't get much time to post...We did radiation on the bones.... doing herceptin........and Zometa...... and just finished the first round of Xeloda... when she developed this cough that never went away.. they kept saying pneumonia.. and put her in the hospital.. but then it turned out to be a plueral effusion... drained liquids... and kept trying.. on a respirator.. breathing masks you NAME IT!!!.... but nothing worked.. her BODY GAVE OUT.... We also found out that there were a few spots on the lungs.... AND the cancver had spread throughout the stomach as well!!!!! She must have had this WAAAAAY BEFORE OCTOBER ... and just didn't know!!!!!!!! or felt symptoms and didn't think anything of it. Feel like we didn't get enough time to fight..................... and now she has left me... my grandmother.. my sister.. my beast friend..... THIS GOD DAMN CANCER HAS TO BE STOPPED!!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763586",
      "Title": "Another Angel....... Redoat Makratz"
    },
    {
      "AuthorID": "Redoat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111649/profile",
      "Content": "Redoat wrote: My grandmother, Helene, is now an ANGEL! She passed Saturday night after a short but intense battle with Stage 4 Breast Cancer I have only posted a few times.. as my grandmother was only diagnosed in October of 2010, I didn't get much time to post...We did radiation on the bones.... doing herceptin........and Zometa...... and just finished the first round of Xeloda... when she developed this cough that never went away.. they kept saying pneumonia.. and put her in the hospital.. but then it turned out to be a plueral effusion... drained liquids... and kept trying.. on a respirator.. breathing masks you NAME IT!!!.... but nothing worked.. her BODY GAVE OUT.... We also found out that there were a few spots on the lungs.... AND the cancver had spread throughout the stomach as well!!!!! She must have had this WAAAAAY BEFORE OCTOBER ... and just didn't know!!!!!!!! or felt symptoms and didn't think anything of it. Feel like we didn't get enough time to fight..................... and now she has left me... my grandmother.. my sister.. my beast friend..... THIS GOD DAMN CANCER HAS TO BE STOPPED!!!! Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763586",
      "Title": "Another Angel....... Redoat Makratz"
    }
  ]
}