{
  "AuthorID": "RedRensink",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
  "Posts": [
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 10, 2014 09:23AM - edited Jan 10, 2014 09:33AM by RedRensink Lighthouselady: Thanks so much for your comments! I am very interested what the MO says on Monday, but really good to know. And I didn't put together the A was also \"the Red Devil\" that my baby sister used 7 years ago. She was diagnosed at 29.  NJMom3: I have been showering since the week after my surgery, with the drains. My PS said it was fine and they have some type of clear bandage on my cancer side because that skin isn't sure it wants to live. I use a belt with my drain bulbs on them around my waist, and tuck the tubing in, cynching it tight, to give my tubes room to move without pulling. You can also use a lanyard like once you use for an ID. Just slide the bulbs on there. Under the pits I use alcohol on a cotton swab. Doesn't make you feel fresh but at least it kills the stinky bacteria. I had a double with drains on both sides so I don't want to take a chance of deoderant irritating them. ",
      "MessageIndex": 810,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 10, 2014 06:51PM RedRensink wrote: will2survive- I might have the pain wrong (mine is more on my torso, on my sides) but my PS's nurse said that between week 3-8 severed nerves start to regenerate. She said my described pain, and those electrical feeling, shooting pains that I get, are all related to nerve regeneration. Hope that helps. ",
      "MessageIndex": 828,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 17, 2014 07:33PM RedRensink wrote: NJmom- Your post on the 13th is me! You sucked the words out of my mouth. I'm not \"strong\" or \"courageous\". Those words are used for someone who has a choice in the matter... I have no F*NG CHOICE but to do this. What I'm really sick of....  every. single. time. I have 1 day where I feel a fraction of my old self creeping in, I feel some measure of relief or just being OK, it means it's time for some new procedure to go and start the pain f*ing train rolling again. SO SICK OF IT.  Monday- was my first MO visit. They gave me a flu shot in advance of 1st chemo.  Tuesday- woke up at 1am (wed) with my whole body in pain, aching, throwing up, nausea, chilled to the bone, unable to rest, sleep or even find a sliver of comfortable position, fever- 101.7. The flu shot gave me the flue Wed- miserable. had to start taking hydrocodone again. slept 12 hours strait. nauseous. dizzy. weak Thurs- weak, flight fever, dizzy, nauseous... but better.  Fri- dizzy persists but feel best I've felt for days. Can get up, no hydrocodone. Oh yeah. I got my port placed today... by 8pm, port site is throbbing and on fire. turning red. feel the catheter in my jugular... I'm a crying freaking mess. The best part? I encouraged my husband to go out of town on a biz trip, overnight, to Michigan. I am a freaking idiot. Andy my 3 and 4 year olds of course are crying because the sitter is here because I can't put them to bed, give them a bath, and make them dinner.  ... so over this... chemo #1 next Wed....  ",
      "MessageIndex": 910,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 23, 2014 06:32AM RedRensink wrote: NJmom- He did do all the work in the office. I felt nothing for sensation but the tugging, pulling, adding new drain et al was really just icky. I just didn't look, nurse distracted me wth convo and my survivor baby sister was with me to distract. I actually have had no issues with this drain. It's right in front so I can lay on my sides. don't feel it al all- and it sure smells and feels better than the #4 drain they took out last week. I think this one will come out tomorrow. MO wants t gone a sit gives an infection risk now that I started chemo... Whole new chapter in this journey, right?!  Sam2- had same with c-section, only my poor hubby had to pack it 2x/day. What a trooper. He does better when he feels needed anyway. Gives him a definitive role.  Swim- feeling the hugs. Thx!  Since I didn't fill this week, I don't feel any TE pain or the nearly uncontrollable desire to rip them out. Since I do t have any exchange on the horizon I guess I don't mind the break. They suck but didn't know I COULD feel human with them in. Up til now, this while reconstruction thing is my biggest stressor in the process, but after chemo yeateday Iay change my mind.  Hugs to all ya'll. :)",
      "MessageIndex": 948,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 8, 2014 06:59PM RedRensink wrote: Hi. This is my first time posting/finding this site. My little sister used to post when she was going through her treatments, starting at 29. She sent me the link today and I've found a lot of stuff.  Sandra- Really sorry to hear the complications. I hope the tests come back negative and you'll be up and around soon.  I have DMX (still trying to catch on to the acronyms...) on 12/20 with tissue expanders. They suck. Still have 2 of 4 drains. They suck. Weeping, bleeding at entry point, pulling, and causing a lot of pain. It seems my pain is worse now than in the past week or so. Called docs (BS/RS) and they both said it is normal to have increased pain between 3-8 weeks as the nerve cells are starting to regenerate. I have had 2 c-sections and my brain can't understand how it can get worse and not better. First visit to MO on Monday. Found out after my surgery that my initial staging/pathology was wrong. THought I was IIDC, stage 1, but after full pathology and node dissection they found a tumor in a node. Now I'm ILC, stage II. Is such a reversal common? So they tell me now I have chemo, Herceptin, and adding radiation.  Spoke today with dr at Sloan Kettering. He states I should add Andiamycin. Has anyone had this as part of their chemo? It sounds pretty scary with potential heart and vein damage, but this dr swears by the data and safety if done correctly. Thanks.",
      "MessageIndex": 780,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 12, 2014 06:03PM RedRensink wrote: Oh thank GOD someone else feels the sunburn and not just me!!!!! What is that?!?! It's killing me, every night. Starts in the evening and gets worse as the night wears on. Then I have that same- sit up/stand up in the am, pain and iron bra pressure rushing into my chest. THIS is why I'm here. ",
      "MessageIndex": 858,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 10, 2014 11:12AM RedRensink wrote: Sandra: That's really interesting. I haven't done much research on PS because I had no idea reconstruction would be so much of my stress, pain, discomfort, etc. Having had my baby sister go through this 7 years ago my brain has been trying to thinking through and accept DMX, surgeries, chemo, radiation, diagnosis, chemo drugs, etc etc etc. I was COMPLETELY taken off guard every time reconstruction comes up as a topic because I just didn't realize how much a part of having cancer it is. Having said that, I have no idea then what my PS's plan is. I have not picked out my implants nor have we discussed it. We have not talked about sizing. I know I want to go back to a C after growing to a DD after having my girls in 09 and 10. His response has been \"I have no idea about cup sizes. We fill until you like where you are, then we do one additional fill to get the natural droop.\". I love him; he's been an awesome doc and highly recommended by both survivors and my BS. I'm concerned that we haven't had these types of discussions now... ",
      "MessageIndex": 814,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 17, 2014 07:57PM RedRensink wrote: OK... sorry y'all for whining.... It's honestly the first day I've just been emotional about everything.  Let's see... positive... positive... positive... positive... Got my last 2 drains out on Tuesday. That was a like pop-the-cork awesome. And with my hubby out of the house and alone at least I get the bed to myself. I can sweat, roll, grunt all night long and not have to worry about waking him up. ",
      "MessageIndex": 911,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 22, 2014 06:47AM RedRensink wrote: NJmom- with chemo #1 sched for today I had a major boob blow out on Monday. Home alone with 4 yr old, get out if shower and 1/4\" of my incision suddenly spits open like a dam burst and I'm literally gushing and squirting blood and bloody fluid all over the bathroom. Bled through 4 layers of towels. Looked like a scene out if a horror movie; think  scarred for life. Emergency trip to PS. He had to cut all my soft tissue that hadn't healed yet, scrub, and see it up. 12+ stitches and the proud owner of a new drain, hanging from this boob. #5 to date. They call this a \"detour\". Still have chemo scheduled though. At least port surgery was uneventful, for the most part. Knock knock. We should see it in action today....",
      "MessageIndex": 939,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 9, 2014 06:25PM RedRensink wrote: Thanks for the warm welcome... and yeah.. I'm sorry to be here, too. I don't think I can still believe it and probably wont until I start chemo. I'll also check HER2+ group. Thanks for that advice. Will2survive: I asked my RS yesterday about my discomfort, the TE and my pits. I told him I feel like I'm growing side boob. Once he quit laughing he said smaller or slighter build women have the potential for more pain. He also said the TE is one size fits all and they are very big, so it is under your arms potentially. My experience so far (and extremely limited) is that you don't really stop feeling like you have foreign junk in your chest,  you get used to the feeling until you get to swap them out. Good to know I'm not the only one felling that way- just sorry for your discomfort as well.  Just frustrated with more pains than less after 3 weeks. I hope to not just complain soon... I know there is still a loooong road ahead.  Sandra- So happy to hear it wasn't a stroke. And thanks again for the support already. :) ",
      "MessageIndex": 793,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "RedRensink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194439/profile",
      "Content": "Jan 12, 2014 02:42PM RedRensink wrote: NJMom- Exactly how I felt. I was trying to wean myself off the drugs, too. I don't like how they make me feel. I was really distressed when I had an increase in pain rather than decrease. Called docs and that's when they told me the nerves regenerate between 3-8 wks, causing increased pain. I explained to them very rationally that I have had 2 c-sections and at 3 weeks was off drugs and just trying not to overdue so as to reinjur. Nurse basically laughed at me (in a nice way) and explained (again)- you've just had parts of your body REMOVED. And lymph nodes are organs- removed. It's much harder than a c-section. I, too, was really upset, but trying to be kind to myself. This isn't how I planned my recovery, but after a personal tantrum, and back on pain killers, I'm feeling better. I day at a time! And you and I had our surgery on the same day. I have first visit with MO tomorrow.... on to next step in the business of having cancer.  TrinityMom- That's insane!!! Hope you're resting up today. ",
      "MessageIndex": 847,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    }
  ]
}