{
  "AuthorID": "redsox",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
  "Posts": [
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Dec 29, 2011 11:59AM redsox wrote: Margins can be a tough call even for the doctors.  If you had one margin that was not clear (as opposed to marginally clear) the third option would be the way to go -- or both the second and third options.  An MRI cannot definitely tell you how wide the margin is but it can give information about possible additional areas of concern at the margin or any place in the breast. If you would like to consider the first option you should have a consult with a radiation oncologist and get that opinion on whether the margin is good enough with radiation therapy.  If your surgeon takes the case to a Tumor Board where all of the relevant specialists review and discuss the case to try to reach consensus on the best recommendation that would also be good.",
      "MessageIndex": 1,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780178",
      "Title": "Margins - Clear (but one is marginally clear) arbouch mawhinney"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Aug 29, 2010 04:44PM redsox wrote: If you are having discharge and other symptoms in both breasts (rather than just one), my understanding is that it is most likely hormonal and not cancer.  Still, a mammogram and perhaps an ultrasound are a good place to start.  Just make sure the doctors take you seriously and find an answer.  It sounds like you are on the right path.",
      "MessageIndex": 3,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/757379",
      "Title": "Waiting for Mammogram After Discovering Bloody Discharge dido1 leaf"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jun 22, 2012 09:49AM redsox wrote: They do take some additional tissue.  I had excision of an intraductal papilloma and they found DCIS in the tissue next to it. ",
      "MessageIndex": 4,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/789463",
      "Title": "excisional biopsy for intraductal papilloma SecretAgentL SecretAgentL"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Apr 6, 2010 02:08PM - edited Apr 6, 2010 02:10PM by redsox More like about 10 minutes (depends on exactly what fields they use) once everything is routine. Mine was get in the room, get positioned with the nudging around that went with that, then from the first machine angle (medial) there was one long field (~30 seconds beam-on time) and two short fields (<10 seconds each), then the machine swings around to the other (lateral) side and does three similar fields, with time in between each field for the machine to make its adjustments.  The boost was one field and beam-on time was less than a minute but still took setup and all.  The techs and doc kept telling me the boost would be much faster.  LOL -- I told them I was glad they were excited but the actual treatment time was the least of it compared to getting there and home again.  I was just happy that the boost treatment field was smaller.",
      "MessageIndex": 7,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/750839",
      "Title": "Music and Rads sweatyspice Raili"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Apr 6, 2010 03:00AM redsox wrote: Most important -- don't bring any music with a strong beat that would tempt you to move your body.  I agree on nature sounds or soft instrumental. Ballads or other songs without much beat would be good.",
      "MessageIndex": 2,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/750839",
      "Title": "Music and Rads sweatyspice Raili"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Apr 2, 2014 09:13PM - edited Apr 2, 2014 09:13PM by redsox Ask the rad onc to look at it and give you an explanation. With reconstructed breasts the way the breast falls to the side is different from the way a natural breast falls.  Did you have anything done to the reconstructed breast after the simulation for radiation treatment planning?",
      "MessageIndex": 2,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/819802",
      "Title": "Radiation to right breast but left breast getting pinky? muska percy4"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Apr 3, 2014 08:53AM redsox wrote: I agree with you that I would not accept a dismissal from the rad tech and would want an assessment from the rad onc.",
      "MessageIndex": 4,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/819802",
      "Title": "Radiation to right breast but left breast getting pinky? muska percy4"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 28, 2010 09:39PM redsox wrote: WOW!  so beautiful!",
      "MessageIndex": 49,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747294",
      "Title": "Clint \"Buddy\" Warren Griffith II is here!!!! Billynda lkc"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Sep 21, 2011 01:05PM redsox wrote: I had discharge from the nipple.  Nothing showed up on my diagnostic mammogram.  Something showed up on ultrasound but it might have been cancer, papilloma, or something else.  The US-guided core needle biopsy was B9.  Findings did not explain the discharge.  I had an excisional biopsy that found a papilloma and also DCIS (and some other non-cancer, non-normal stuff).  I had the excisional biopsy on a Friday and expected to take it easy that weekend.  Saturday morning I felt pretty normal and did my usual weekend chores and activities.  I could have gone to work on Saturday but it would have been nice to take that day off if it had been a workday.  Monday I was back at work and fine. If they were to take a node, the recovery time would be longer.  ",
      "MessageIndex": 1,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775256",
      "Title": "Excisional biopsy/lumpectomy scheduled - what to expect skl679 Moderators"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 10, 2011 10:39AM redsox wrote: If you have more than one independent tumor in the same breast -- the T classification is based on the largest primary tumor.  Measurements of tumor size are not added together.  The record should show that there is another tumor(s), but it is not separately staged. If you have primary tumors in each breast, each breast is staged separately.  Treatment is usually driven mostly by the more advanced tumor.   ",
      "MessageIndex": 6,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763184",
      "Title": "Stage 1 or 2? JulieH coonie"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 10, 2011 09:39AM - edited Jan 10, 2011 09:40AM by redsox \"The pathologic tumor size for the T classification is a measurement of only the invasive component.\"  from the AJCC Staging Manual, breast cancer section.  They give an example.  The DCIS does not affect the staging when you have an invasive component.",
      "MessageIndex": 1,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763184",
      "Title": "Stage 1 or 2? JulieH coonie"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jul 21, 2011 03:16PM redsox wrote: \"Curative intent\"!  Those are lovely words and it means they really do hope to cream that sucker for good or at least a very long time.  I know there are good doctors in Sacramento but it is worth the hardship to to go to UCSF. ",
      "MessageIndex": 28,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771923",
      "Title": "What my doctor said.... CoolBreeze elmcity69"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jul 26, 2011 01:18PM redsox wrote: I did not need any kind of pain tablets, just hydrocortisone cream liberally applied to the skin.",
      "MessageIndex": 1,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772187",
      "Title": "Is pain medicaton needed for rads bedo 3monstmama"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Sep 28, 2013 11:43AM redsox wrote: Your med onc does not understand radiation. The current recommendation is not for the same area you had treated before. That was whole breast for DCIS. After a double Mx the treated area is gone. The areas the rad onc is talking about treating are different -- nodes and chest wall -- and require a different dose. With two positive nodes and four tumors you probably do need radiation. By all means get another opinion, but get it from a doc who understands the indications and delivery of radiation.",
      "MessageIndex": 7,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/811782",
      "Title": "Had recurrence and Dr wants to do radiation AGAIN!?!? Run4Us Run4Us"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Dec 2, 2011 04:06AM redsox wrote: I agree that you should come over to the DCIS board.  It is one place where we can complain and argue about DCIS without feeling guilty about all the other women who have it worse than we do. Lowrider--  Glad to see you again and thanks for continuing to support the new and early posters! ",
      "MessageIndex": 7,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/778063",
      "Title": "need lumpectomy after biopsy that didn't confirm a diagnosis. miricurt538 redsox"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Oct 28, 2010 06:54AM redsox wrote: The other likely next step is more views on the mammogram, including magnified views.  For mag views they use a smaller paddle and focus on the area of concern.  It is like having the normal mammogram except it takes longer and may hurt a little more.",
      "MessageIndex": 3,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/759951",
      "Title": "What is involved in diagnostic testing? jenniferinchi LeahinTexas"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jun 28, 2009 08:18PM redsox wrote: For whole breast fields the dose is within a narrow range, usually about 45-50 Gy +/- a boost.  Differences in stage, grade and tumor location are more likely to affect whether and which nodal fields (e.g. supraclavicular, axillary, internal mammary) are treated.  Partial breast irradiation would be different from this dose range. ",
      "MessageIndex": 1,
      "PostDate": "28/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736621",
      "Title": "Radiation dosage nanabolini knowledgeforpower"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 28, 2011 12:45AM redsox wrote: Everybody should go to a radiation oncology facility with modern and relatively new linear accelerators, but most breast cancer patients do not need esoteric or unusual equipment.  I do think the quality of the radiation oncologist is very important and I would check that person's qualifications and experience in treating breast cancer thoroughly.  If you are going to a major cancer center for surgery you could ask them.  If the rad onc is well qualified most likely the rest of the staff is good but you can ask about that as well.",
      "MessageIndex": 1,
      "PostDate": "28/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766688",
      "Title": "How important is the radiation facility? JSwan JSwan"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jul 8, 2010 07:14PM redsox wrote: Having the machine breakdown so often would make me worry.  I think you should ask to see the rad onc and ask for an explanation of the problems and what they do to check that the machine is working right after a malfunction.  I had 34 treatments with no cancellations.  Twice the machine had scheduled routine monthly service that required shifting treatment time.   One day that they were running late I think they said that they were backed up because they had problems with the machine earlier in the day.  Other than that there were no signs of machine malfunctions. ",
      "MessageIndex": 3,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/755076",
      "Title": "Rads Machines breakdown? Dilly Celtic_Spirit"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Aug 31, 2009 01:04PM redsox wrote: Reasons to go to the radiation oncologist immediately after diagnosis include: a. help you decide between lumpectomy + radiation therapy vs. mastectomy, b. get all the information you need for all options upfront and let you make well-informed plans, c. schedule radiation therapy to start within 4-6 weeks of surgery (although this is less important for Stage 0, Grade 1, than it is for more aggressive tumors). Questions you might want to ask (if the doctor does not go over all this anyway): Is there any reason I am not a good candidate for lumpectomy and radiation? What are the options for radiation treatment, e.g. standard whole breast irradiation (usually about 25-35 treatments, 5 days a week), accelerated whole breast irradiation (usually about 16-18 treatments with higher dose per treatment, 5 days a week), partial breast irradiation (area right around the tumor treated but not the whole breast, usually 5-10 treatments in 1-2 weeks)?  What do you recommend as your preferred option for me?  Are any other options reasonable choices for me?  If so, what are the pros and cons? Are any of them not appropriate for me and why?  Also, ask whatever questions you want about the logistics and process of radiation treatment. note:  Your tumor looks highly favorable but quite big and you have other non-cancer but abnormal stuff going on.  That probably eliminates partial breast irradiation as an option but I am not a doctor!  All I took was the path reports and copies of mammograms.  Reliance on MRI varies with different doctors.  Most radiation oncologists will want to double-check pathology slides themselves. I chose to go to a facility that is less convenient than others because I wanted that radiation oncologist.  It is a pain 5 days a week for almost 7 weeks but should give me peace of mind in the long run.  ",
      "MessageIndex": 2,
      "PostDate": "31/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739758",
      "Title": "questions for the radiation oncologist? tovahsmom newday1976"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 21, 2013 12:01PM redsox wrote: Which specialists have you discussed rads with?  I would get an opinion from at least one of each, breast surgeon, medical oncologist, and radiation oncologist, and then second opinions if you still are uncertain.  If they all say it is a soft call, then it is.  The issue is really the level of risk from one positive intramammary node.  I think that is pretty unusual so there is not a lot of data to help you decide.",
      "MessageIndex": 3,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802114",
      "Title": "To Do or Not To Do Rads? What do you think? jenjenl jenjenl"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 21, 2013 05:52PM redsox wrote: The Red Sox have to be better than last year! No place to go but up. At least they should be less frustrating to watch. Since you are 33 and BRCA1+, being aggressive is a good strategy for you.",
      "MessageIndex": 11,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802114",
      "Title": "To Do or Not To Do Rads? What do you think? jenjenl jenjenl"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 27, 2010 10:58AM redsox wrote: I have one clip from the core needle biopsy to mark where they sampled and multiple clips from the lumpectomy to mark the cavity.  They use the clips for future diagnostic imaging and planning of radiation therapy.  If you have a mastectomy the clips may or may not be removed with the mastectomy.  The material in these clips should be safe for MRI.  Most recent surgical clips or implants used for other purposes, such as to stop bleeding, should be safe as well but you should ask.  Metal clips or implants used long ago are not likely to be compatible with MRI.  Diagnostic radiologists should have reference materials to track specific types of metal and its compatibility with MRI.  The best approach on surgical clips or implants is to ask the surgeon if it is compatible with MRI and/or ask for very specific information on the type of metal.  With that info ask the radiologist if the metal is compatible.  Typically someone reviewing a checklist before an MRI should ask if you have any metal in your body, but that's often right before the MRI -- not good if you do not have the info!",
      "MessageIndex": 8,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/745603",
      "Title": "Surgical clip seen on X-ray cheza LRM216"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 21, 2013 02:06PM redsox wrote: I think the key issue for jenjen1 is whether the one positive intra-mammary node means treating those nodes would improve her chances in that area.  That is part of the regional treatment.   Radiation is a local-regional treatment intended to reduce the risk of local-regional recurrence.  If you can prevent a local-regional recurrence, that might reduce the risk of that recurrence eventually leading to a distant recurrence, but the main treatment aimed at decreasing the distant recurrence risk is chemo.",
      "MessageIndex": 6,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802114",
      "Title": "To Do or Not To Do Rads? What do you think? jenjenl jenjenl"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Feb 23, 2010 04:20PM - edited Feb 23, 2010 04:21PM by redsox",
      "MessageIndex": 4,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/748822",
      "Title": "what does the stylish rad patient wear under her shirt? 3monstmama InMontreal"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Feb 23, 2010 04:20PM redsox wrote: I pulled an old silk undershirt out of my drawer which felt nice.  Then I bought a silk camisole from Winter Silks.  I wore those under my clothes starting at the end of week 4 until about 2 weeks after the end of rads.  Cotton feels OK, but silk feels great!",
      "MessageIndex": 3,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/748822",
      "Title": "what does the stylish rad patient wear under her shirt? 3monstmama InMontreal"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jun 9, 2010 09:29PM redsox wrote: Redsoxfan,  Given your screen name, I really must reply!  ...but I am not sure what to say.  I did lumpectomy and radiation and am now on tamoxifen.  So far the worst I have encountered was the core biopsy.  Radiation therapy is different from most other branches of medicine and can be scary but I can provide some insight.  Check for PMs and we can go in a little deeper. Right now the Red Sox are behind 5-0 but Justin Masterson is pitching for the Indians.  As bad as his record has been since the Red Sox traded him can we really root against him?   ",
      "MessageIndex": 5,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/753895",
      "Title": "Is this the right course? redsoxfan pj12"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 17, 2010 04:18PM redsox wrote: I consider gender to be only one factor and a minor one compared to many others, but it is a personal decision. Considering the feelings you are describing, I think you should go to a female doctor.  The frequency of breast physical exams may be as little as the initial consult and follow-up after treatment is done, but doing the breast exam is part of the doctor's job.  If you have any problems with your breasts during treatment, assessment including a breast exam is necessary.  It seems unlikely that you are going to be able to establish a good doctor-patient relationship if you dread having him touch you. As for the techs the only time they touched my breasts at all was with a marker, not directly.  The goal is to define a position for you such that the breast falls in exactly the same position every day once they have you correctly aligned.  Alignment involved pushing and nudging the body but not the breasts.  If you have very large breasts there may be more need to touch them to get them in the correct position. It is not at all like the process of getting a mammogram. Most facilities will have a mix of male and female techs and two are involved with your treatment each day.  At least one will usually be female and you can ask for that one to do the positioning.  That may mean you are sometimes choosing the less experienced or less skilled over a better option.",
      "MessageIndex": 16,
      "PostDate": "17/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/746776",
      "Title": "Does someone literally have to touch your breast every day?? Raili Sido"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 16, 2012 10:55PM redsox wrote: I can't tell from your description why it looks old.  I would not think plastic is better or newer than metal.  If you have doubts ask your radiation oncologist how old the machine is and tell him/her your concerns.  I would think all of the linear accelerators at MSKCC are reasonably new.",
      "MessageIndex": 2,
      "PostDate": "16/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/784251",
      "Title": "Radiation Machine granitegirl granitegirl"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 6, 2010 11:54PM redsox wrote: NativeMainer wrote: Also, radiation therapy hasn't changed in decades, and is no more or less effective now than in the 50s.  Wow! ..so not true! In the 50's mastectomy was the only option for most breast cancer patients, radiation was only used for some nodal fields if the cancer had spread, the machines were completely different and less effective, the planning was standard instead of customized, the results were much worse, etc. .... If anything, the biggest problem with radiation therapy is that it is changing so fast that it is hard to be sure all the doctors are up on the latest techniques.",
      "MessageIndex": 12,
      "PostDate": "06/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749143",
      "Title": "Can you/did you ever miss a day? Raili Raili"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Dec 27, 2011 09:22PM redsox wrote: Lisa75, As someone who had lumpectomy and whole breast radiation therapy (but no nodal surgery) I can tell you that you can expect to be tired in the latter part of radiation therapy and for a week or so after it ends, but you will be able to walk as long a distance as you do now and climb as many stairs as you do now and engage in your usual brand of exercise.  You will not be matching any personal bests and will have lower energy levels and less ambition than usual.  But normal activities can continue.  I worked all the way through radiation, leaving work an hour early to get to my post-5:00 PM treatment time.  After a long drive home I did not do much in the evenings but I was still awake and alert until the usual time. I think that is pretty normal for those who have not had chemo.  For patients who had chemo and rads the tiredness is cumulative so they generally feel it more.",
      "MessageIndex": 23,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779761",
      "Title": "Did I make wrong decision re IORT? LWA LWA"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Dec 31, 2010 08:22AM redsox wrote: It depends on what you are looking for and it sounds like you should look for cause-specific survival.  There are other endpoints that are commonly reported, such as recurrence-free survival (death or any recurrence counts as a failure) or metastasis-free survival (death or distant metastasis counts as a failure but not local recurrence). Some of the issues involved in reporting and choosing among different endpoints are:",
      "MessageIndex": 3,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762710",
      "Title": "question about stages and prognosis lrr4993 redsox"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 22, 2013 02:44PM redsox wrote: Radiation therapy is often delivered to areas other than the breast where the cancer has or may have spread, including the chest wall and nodal areas.  These areas can still be treated even after a mastectomy.  They do treatment planning specifically for your body and can make adjustments for the shape of your breast area.   Most of the material on the web does show whole breast irradiation rather than the nodal areas but this site might help: http://www.cancer.gov/cancertopics/pdq/treatment/breast/Patient/page6 When you meet with the radiation oncologist, ask for a detailed explanation of what areas would be treated and why.  ",
      "MessageIndex": 6,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/799212",
      "Title": "No breasts now Katski liefie"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 5, 2014 05:45AM redsox wrote: The rad onc should visually check the skin on and under the breast at each weekly visit as part of monitoring skin condition. Since skin is the issue physically examining the breast is not usually necessary during treatment, just at the initial consult, if there are particular problems during treatment, and during follow-up visits after treatment is done.",
      "MessageIndex": 5,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/818731",
      "Title": "RO never examines breast at weekly appt Frankenfinger08 Frankenfinger08"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 31, 2011 03:05PM redsox wrote: asmd-- It can be DCIS with nipple discharge and a lump.  The fact that it showed up in one year does not automatically mean it is aggressive.  It may actually have been caught early.  Anyway, you will find out the biopsy results tomorrow. If the results of the biopsy require more procedures, I would try to see a breast surgeon before you plan to leave for Europe and get the next steps scheduled, but I would go on the trip anyway.  It would then be a trip to celebrate the 5-years and gather strength to face what comes next.  Good luck!",
      "MessageIndex": 4,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/766844",
      "Title": "palpable mass- dcis? asmd SarahsMom"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Nov 21, 2010 07:14AM redsox wrote: There are several reasons they may want a second CT for simulation.  Maybe you were not in a natural position and they are worried about being able to sustain it through treatment. Maybe they want a different position because they are not satisfied with the options they have for treatment plans with the first CT, I am sure there are other reasons.  I would take it as a sign they are being thorough and looking for the best plan they can get for you.",
      "MessageIndex": 2,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757570",
      "Title": "2 CT scans before rads? jdootoo redsox"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 23, 2012 02:35AM redsox wrote: The Oncotype DX test was reported on these discussion boards by several people even before the presentation at the San Antonio Breast Cancer Symposium.  In the time I have been here there have always been posters talking about the pros and cons of radiation therapy and tamoxifen for DCIS. The evidence base in this area is more substantial than many other areas and many viewpoints are generally represented in discussions here.  I agree that this is the benefit of this site as opposed to one that advocates a specific limited position with sparse data. P.S.  You are actually citing Suzanne Somers as a source! A good reason not to check out your website.",
      "MessageIndex": 18,
      "PostDate": "23/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "May 31, 2011 02:15PM redsox wrote: Simulation is a data gathering session usually done with a CT simulator.  They position you on the simulator which replicates the treatment machine and take the CT.  This gathers data about the exact geometry of your anatomy and your tumor or the location where your tumor was and any other areas they want to target.  For me the specific targets were the clips left to mark the location where the tumor had been and the seroma filling the surgical cavity.  Then they put reference marks on you with dot-like tattoos or sometimes markers so that they can consistently replicate the exact position.  They take the data and develop the treatment plan, which means they try various arrangements of the radiation beams to create a dose distribution that delivers the amounts of radiation prescribed to the areas they want to treat while avoiding areas they don't want to expose, as much as possible.  The area scanned is the abdomen only, and perhaps not all of that. It does see the whole slice through your body in that area but the area depends on how much they expect to treat.  \"Regional lymph nodes cannot be directly seen on planning CT, unless pathologically enlarged.\"  per Clinical Radiation Oncology by Gunderson and Tepper, p. 1484 (one of the standard rad onc textbooks).  It would seem that they would not be able to see cancer spread except by happenstance. As for results, tell the rad onc of your concern and ask him or her to tell you what the CT showed by the end of the simulation. It is not sent on to a diagnostic radiologist to be read -- the rad onc is the one reading it.",
      "MessageIndex": 1,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769690",
      "Title": "help with pr erad CT scan melania redsox"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jul 28, 2010 09:55PM redsox wrote: I would ask the doctor about it.  Since you are having radiation now I would start there but you may want to go back to the breast surgeon. White/ clear/ milky discharge is most often benign, e.g. papilloma, but it can be cancer.  Bloody discharge has a higher probability of being cancer but still may be benign.  Green / blue discharge is usually an infection.",
      "MessageIndex": 5,
      "PostDate": "28/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755837",
      "Title": "nipple discharge jlb60 redsox"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 22, 2010 10:17AM redsox wrote: Sweatyspice,  Full breast rads does not mean the breast will be tender for life.  It may be true for some women, but certainly not for all.  Another side effect to ask about and discuss probabilities.  It does take some time (e.g. 3 months) for the breast to feel normal again. ",
      "MessageIndex": 13,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746976",
      "Title": "I JUST WANT THEM OFF JudeMama Delilahbear"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "May 26, 2010 04:42PM redsox wrote: I agree that a second opinion would be a good idea if they recommend radiation therapy. I have not heard of radiation therapy being used for ADH.  Usually the treatment is surgical removal (mostly to make sure it is nothing more than ADH) and maybe tamoxifen.  Although the difference between ADH and DCIS can be a fine line you have a second opinion confirming the pathology finding.  I am not a supporter of minimal treatment for DCIS and had radiation after lumpectomy for DCIS but I think radiation therapy would be overkill for ADH -- better to find a good surveillance plan.",
      "MessageIndex": 3,
      "PostDate": "26/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/753151",
      "Title": "ADH, family history unavailable (adopted) lobelia awb"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Aug 29, 2011 09:38AM redsox wrote: The four quadrants of the breast do not have equal amounts of breast tissue so we shouldn't expect equal numbers of cancers in each quadrant. The upper outer quadrant has more breast tissue than the inner quadrants.  That's one factor.  The lower outer quadrant has breast tissue tailing off under the armpit but they usually call that the tail of the breast and not the lower outer quadrant.  The drainage to the nodes is greater in the upper outer quadrant than the others which may also be a factor.  ",
      "MessageIndex": 3,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773874",
      "Title": "I wonder if it matters which quadrant? meme31 meme31"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jun 30, 2010 08:47PM redsox wrote: The purpose of the CT is to give them a complete picture of the geometry of your body in the area they are going to treat, e.g. breast, chest wall, and/or nodes.  They are looking for lung, heart, and other areas they want to avoid including in the radiation fields.  Also, they are looking for indications of the site of the cancer that they want to target, such as clips placed by the surgeon or seroma in the surgical cavity.  Then they do the treatment planning which means they plan the path of the radiation beams, location, angle, dose.  They look at various arrangements of the beams and the dose pattern on your body to find the one the best hits the target and avoids critical structures such as heart and lungs.  Some of the lung is included in any breast plan, but they try to minimize it.  The scar is usually a target area because it has higher risk of recurrence than other areas.  The other breast is not similar enough to guide planning except to keep it out of the line of the radiation beams.",
      "MessageIndex": 4,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754731",
      "Title": "Purpose of CT scan before rads Houndmommy faithfulc"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Nov 17, 2010 10:45AM redsox wrote: Have you seen a breast surgeon? Is the MD concerned that the biopsy did not sample all of the suspicious area or that the results are not consistent with symptoms or imaging? I had a core biopsy reported as -- completely benign -- come back in a year for routine mammogram.  My doctor did not believe the results explained my symptoms and referred me to a breast surgeon who agreed and did an excisional biopsy that found DCIS.  If you have not seen a breast surgeon, my recommendation would be to see one.",
      "MessageIndex": 4,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760843",
      "Title": "benign results vs repeat biopsy nursing_51 nursing_51"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 1, 2011 11:00AM redsox wrote: IDC +  EIC means invasive ductal carcinoma + extensive intraductal (i.e. DCIS) component.  The IDC is the important part for determining treatment.  The DCIS is important if you want to have a lumpectomy, but if you have a mastectomy the DCIS should all be removed and not be a factor.  It might mean you are more likely to have close margins even with a mastectomy.  The treatment you are having for the IDC should be enough that the DCIS is not an issue.   ",
      "MessageIndex": 4,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762726",
      "Title": "IDC with extensive invasive component janette1958 janette1958"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Apr 8, 2014 08:48PM redsox wrote: My advice is to get your rads treatments scheduled for a time after you finish work. I did that based on comments I read on this board that many felt tired for an hour or two after rads before getting a second wind. I did work through rads. The fatigue was not overwhelming but rather a feeling of lower energy than usual and it does get worse toward the end of treatment.  ",
      "MessageIndex": 1,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/819988",
      "Title": "Working during rads? faerywings faerywings"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Nov 29, 2010 04:42PM redsox wrote: Take a deep breath!  Although it is frustrating you really don't have enough information yet to try to figure a treatment strategy.  Most breast cancers do not grow that fast.  Waiting for biopsy or other tests may seem like an eternity but the cancer is not likely to grow significantly in a few weeks. You don't have a cancer diagnosis. If you do have cancer, you don't know the stage or other characteristics.  What treatment is appropriate depends on information that is not yet available to you or doctors.  You may have surgical options of lumpectomy or mastectomy, but mastectomy may be the only real option.  Radiation therapy may or may not be appropriate for you, but I can tell you that they do not use Cyberknife or similar machines on breast cancer, except for isolated metastases.  Cyberknife treats a smaller area than APBI which treats a smaller area than whole breast irradiation.  APBI is newer technology with shorter follow-up data than whole breast irradiation and is usually recommended only to patients at low risk who meet specific conditions. Most doctors would probably not recommend it to you, regardless of your tumor characteristics, because you are 46 and still have a long life expectancy.  The following article describes guidelines for APBI based on the data available.  Their age criteria is >=60 years old or cautionary for 50-59.    http://www.redjournal.org/article/S0360-3016(09)00313-7/abstract This is a stressful experience and especially bad if you already have a lot of stress in your life but my advice for now is to try to relax and search for the best options for cancer centers, breast surgeons, medical oncologists, and radiation oncologists in your area and with your insurance.  ",
      "MessageIndex": 1,
      "PostDate": "29/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761319",
      "Title": "APBI, Cyberknife, Intravenous Vit C? grayeyes grayeyes"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "May 7, 2010 09:47AM redsox wrote: It took 7 days including the weekend.  It can be shorter but I think the minimum is about 3 working days.",
      "MessageIndex": 1,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/752317",
      "Title": "surgical biopsy question jdfnj2 SWELL"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 24, 2014 12:28PM redsox wrote: Actually the risk of recurrence you were given is quite reasonable for DCIS treated with lumpectomy alone. Many factors affect your individual risk but 20-30% is not extremely high or low.",
      "MessageIndex": 12,
      "PostDate": "24/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/819397",
      "Title": "Dangers of radiation? faerywings trish01254"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Feb 2, 2014 09:44AM redsox wrote: Ask your radiation oncologist about it.   I don't think the caution is based on the shot making the radiation less effective.  Rather, I think your body may have a bad reaction to the shingles shot because your immune system is less able to deal with it. ",
      "MessageIndex": 1,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/817604",
      "Title": "Did I cause my radiation to be less effective? SallyS70 SallyS70"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Jan 14, 2011 09:22PM redsox wrote: I am seconding what Beesie said, \"Did they actually do the biopsy in the wrong area of your breast, or did the biopsy not capture any of the suspicious cells?  The first is a problem and as Deanna mentioned, you may want to go to a different facility to have the biopsy done again.  The second is a fairly common problem.\" I would not go back for a redo of the same procedure at the same place.  A different procedure is in order, or else a different facility.  But the first biopsy does not always establish a diagnosis.",
      "MessageIndex": 6,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/763363",
      "Title": "They biopsied the wrong place Librarian Optimistictraveler"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Nov 10, 2009 09:52AM redsox wrote: This is a good site: http://www.rtanswers.org/ The person who wrote about getting daily CT scans was presumably getting \"tomotherapy\", which can allow very precise targetting of the radiation to the area at risk and better spare normal tissues.  It is not commonly used for breast cancer but is done in some facilities.  The dose from the CT is counted in the total dose if you get tomotherapy. ",
      "MessageIndex": 1,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/743612",
      "Title": "Details about your rads RunswithScissors cmharris59"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Dec 30, 2010 09:05PM redsox wrote: Survival rates are based on the original diagnosis.  If stage 1 had a 90% 5-year survival rate, that means that 90% of the people originally diagnosed as stage 1 are alive 5 years later.  The deaths include death from any cause, cancer, heart disease, auto accidents, etc.  Studies also often report \"Cause-specific survival\".  For that measure only deaths related to cancer (including death from complications of the cancer or the treatment) would be counted as a failure (or cause-specific death).  When studies are analyzed for 5 year survival, some cases may not have follow-up data for 5 years.  Those cases are censored (dropped from the analysis) after the last time point where data is available for the case.",
      "MessageIndex": 1,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762710",
      "Title": "question about stages and prognosis lrr4993 redsox"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Dec 11, 2011 09:41AM redsox wrote: Oaklandmama, I think you will find many helpful responses if you post this on the Stage IV board. ((HUGS))",
      "MessageIndex": 1,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779376",
      "Title": "parenting young children with mets oaklandmama apple"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Sep 11, 2011 04:25PM redsox wrote: Accelerated Partial Breast Irradiation (APBI) -- Mammosite is one method -- is a newer technology with shorter follow-up data than whole breast irradiation and is usually recommended only to patients at low risk who meet specific conditions.  The rationale is that the area nearest the tumor site has the highest risk of recurrence so treating just that area with radiation therapy will reduce the rate of recurrence in the area at highest risk. The rest of the breast, which is treated with whole breast irradiation but not with APBI, does have some risk of recurrence, but for carefully selected patients that risk may be quite low.  The following article describes guidelines from the major professional society of radiation oncologists for APBI based on the data available. http://www.redjournal.org/article/S0360-3016(09)00313-7/abstract Criteria for being \"suitable\" for APBI include patient age >= 60 years old, no BRCA 1/2 mutation, tumor size <= 2 cm., Stage T1, margins negative by at least 2 mm., no lymph-vascular space invasion, ER+, unicentric only, clinically unifocal with total size <= 2 cm., invasive ductal or other favorable histology, not pure DCIS, no extensive intraductal (i.e. DCIS) component, pathologically node negative, sentinel node biopsy or axillary lymph node dissection.  The article goes on to loosen some of those criteria in defining a \"cautionary\" group for whom APBI may be considered, as well as a group of patients for whom APBI is \"unsuitable\".  Some radiation oncologists are more favorably inclined toward APBI than others and use of these guidelines, especially for the \"cautionary\" group  will vary.  Accelerated Whole Breast Irradiation (AWBI) is another option that treats the whole breast in 3-4 weeks with larger daily fraction doses than the traditional ~6 week plan. That option has been widely used in Canada for many years. I chose traditional whole breast irradiation because I wanted to treat the whole area at risk and because I wanted the lower daily dose over time. Radiation works by disrupting the process of cell division. Normal cells can respond and repair themselves better than cancer cells but radiation kills cells over time at the critical stage of cell division. I wanted to give the radiation time to work to combat the cancer biology.  Still, I don't think there is a magic to 6 weeks and I do think  accelerated plans such as AWBI can work well.  I had some tan/pink skin and some fatigue during treatment but the side effects were minor.  If you search these boards you will find numerous threads discussing both Mammosite treatment and traditional radiation therapy and you can make your own judgment.",
      "MessageIndex": 6,
      "PostDate": "11/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774538",
      "Title": "Mammosite Rad vs. 6 wk Rad.?? 1942kathy treeskier"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Aug 30, 2010 03:41PM redsox wrote: I agree with somanywomen's advice.  The most important factors are insurance coverage, the reputation of the doctor and center, and your comfort with them.  Others that may matter include being part of an NCI Cancer Center, freestanding vs. hospital-based, level of equipment and personnel.  I would take the onc's concerns seriously and ask a lot of questions, but it may just be referral patterns and who she knows.  Research your options and ask questions! I went to a center on the opposite side of the city from where I live because the doctor had the best reputation for treating breast cancer in the area and because I had great rapport with him from the initial visit.  I had a late afternoon appointment and worked through the whole treatment but I did have to leave work an hour or so early and did not make up the time.  That fell under intermittent FMLA for me -- check if you qualify.",
      "MessageIndex": 2,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757414",
      "Title": "How do you choose a radiation oncologist. JFV JFV"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Oct 5, 2009 03:34PM redsox wrote: You can have radiation in the future to a different location in the body but generally not more radiation to the same area treated this time.  Maximum tolerated dose relates to each area of the body separately.",
      "MessageIndex": 133,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Nov 12, 2009 02:52PM - edited Nov 12, 2009 02:53PM by redsox There is a thread called, \"Abbreviations for Newbies\" on the Waiting for Test Results forum.  I just bumped it and it should be at the top now. ",
      "MessageIndex": 28,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/743267",
      "Title": "I think I'm the oldest one here! Chevyboy Chevyboy"
    },
    {
      "AuthorID": "redsox",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85818/profile",
      "Content": "Mar 6, 2013 05:01PM redsox wrote: The following article describes guidelines from the major professional society of radiation oncologists for Accelerated Partial Breast Irradiation (APBI) (brachytherapy is one method) based on the data available.  www.sciencedirect.com/science/... Criteria for being \"suitable\" for APBI include patient age >= 60 years old, no BRCA 1/2 mutation, tumor size <= 2 cm., Stage T1, margins negative by at least 2 mm., no lymph-vascular space invasion, ER+, unicentric only, clinically unifocal with total size <= 2 cm., invasive ductal or other favorable histology, not pure DCIS, no extensive intraductal (i.e. DCIS) component, pathologically node negative, sentinel node biopsy or axillary lymph node dissection. The article goes on to loosen some of those criteria in defining a \"cautionary\" group for whom APBI may be considered, as well as a group of patients for whom APBI is \"unsuitable\". Some radiation oncologists are more favorably inclined toward APBI than others and use of these guidelines, especially for the \"cautionary\" group will vary.",
      "MessageIndex": 3,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/801462",
      "Title": "brachytherapy? Anyone having or have had this method? Lorial1962 Cowgirl13"
    }
  ]
}