{
  "AuthorID": "regbeach",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
  "Posts": [
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jun 5, 2013 09:19PM regbeach wrote: Really? 3 months of fatigue from rads?  My mom had her initial appt. and is scheduled for another set-up next week.  She had lumpectomy in April, took us a few weeks to research and then pass on chemo.  We were hours away from getting the pic line when I cancelled it.  I am mom's caregiver. She had a stroke last June and can only walk with assistance, understands in general, and can only express herself very minimally. She goes to therapy for walking, arm and speech still and still is improving.  We have been told that around the 5th or 6th week there may be some fatigue but it was not conveyed that it would last beyond that.  We went through some fatigue adjusting to anti-seizure meds. It made going to therapy nearly impossible (since she either wouldn't go to it, was asleep before it, or irritated at it) which caused her walking to decline somewhat. After researching chemo and preparing myself mentally for those side effects, wondering how she would take it, how I would physically be able to care for her during it, etc., when we finally cancelled chemo, it felt like radiation would be no comparison (relatively easy). Have other people gotten similar warning about possible 3 months of fatigue?  Is that with an accelerated schedule?",
      "MessageIndex": 524,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jun 9, 2013 04:38AM regbeach wrote: My mom starts radiation on Tuesday- the shortened Canadian regimen.  Should I be putting aloe on her now (I am her caregiver since her stroke last year)?  The dr. seems fine with waiting.  More importantly, when I put it on, where should I put it exactly- all over her entire breast on the side that is getting radiation and under the armpit (near incision)?  Do I need to wash it off before she goes to radiation the next day?  Right now, she gets shower every other day from an aide.   Of course, I could wash that area on the other days.",
      "MessageIndex": 327,
      "PostDate": "09/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 5, 2013 03:04PM regbeach wrote: Mom's RO said there was no need to use any lotion at the start.  Not sure if he said to wait to see if issues or just if it was OK to wait because, like others said, why not be proactive.  It's just lotion.  As I wrote before, she uses Miaderm (no need to wash it off before rads as long as used a few hrs. before).   3 times a day and no issues- little bumpiness in the crease but thats it.  She is getting accelerated Canadian regimen so higher daily dose, of 17 treatments.  4 left.",
      "MessageIndex": 784,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 10, 2013 12:08AM regbeach wrote: Today, the nurse and techs told my mom that her skin looked \"amazing\" and \"incredible\" for having only ONE more treatment left on the accelerated Canadian regimen (higher daily dose of rads).  But, one red spot has shown up in the crease.  The nurse said to alternate the Miaderm lotion we have been using and cornstarch.  I just tried to put cornstarch on and made a mess!  I used a paper towel and tried to dab it on but it went all over her shorts.  Any ideas for getting cornstarch into the crease when she is sitting up? I am my mom's caregiver and, of course, I am headed out of town for 3 days (for only the second time in a year).  So, I need to write some instructions for her aides after I figure out how to do it.  I am praying that it doesn't open up this weekend when I am not here. Thanks. Sharon",
      "MessageIndex": 856,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 21, 2013 05:19PM regbeach wrote: Mom's bright red/pink spots in the crease were blisters the next morning, then at one point had some pus. They are back to being red/pink spots but bigger now and today it looked like there was some dried blood (brown).  I have been putting the silver sulfadiazine on it 2 times per day and wiping them clean before applying it.  I will check in with the rad nurse tomorrow but any idea how many days til they close up.  Her last rad was 10 days ago. Thanks.",
      "MessageIndex": 1076,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 3, 2013 10:45AM regbeach wrote: Interesting some of you have been nauseous.  I am taking my mom to a gastro today because three times she was thrown up after doing some exercise.  Twice was in phy. therapy after doing some step-ups which are hard work for her, but when she did less strenuous therapy no throwing up.  I blamed it on orange juice for breakfast, too much acid, not eating enough beforehand.  Yesterday, it happened after a medium-sized walk that she has done many times.  She hasn't eaten since. She has been very tired in the mornings.  It is complicated because she can't talk to tell me how she feels. Praying the gastro just thinks its acid buildup exacerbated by activity (?)",
      "MessageIndex": 737,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 11, 2013 04:42AM regbeach wrote: Thanks, AnnieLane. My mom is supposed to go for a test for gastroparesis (delayed stomach emptying). She did accelerated rads. One week into it, she threw up in PT.  Then again, one week later also while exercising. Then, twice the next week after medium (for her) walks, now 3 times this week.  Each week her appetite has been decreasing, and she seems to have alot of acid buildup.  She eats a couple pcs. of toast and a few bites of a bland dinner.  Obviously, I am worried.  The gastro said they need to see results of this test and, if gastroparesis, the treatment is fairly easy and nothing to worry about.  We were supposed to have test today but offices are so non-customer focused.  The only time they schedule it is 7:30 am, even when I explained issues with seizure med making mom sleepy that early in AM, etc.  She threw up late last night so slept in recliner. She was exhausted and I couldn't get her up.  I asked RO if vomiting could be from rads but he thinks not.  I am still hoping it is. PS- She finished rads today!  One red spot but they don't think it will get worse.  Still using Miaderm only.",
      "MessageIndex": 878,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 12, 2013 01:40AM regbeach wrote: As I posted before, my mom's RO and techs dismissed her nausea and vomiting as having nothing to do with rads.  But, saw a gastro today who said it definitely can be from rads.  Who knows...Taking Prilosec to reduce acid and going for stomach emptying test Mon.  With any luck as the rads leave her body over the next 2 weeks, so will this vomiting issue.",
      "MessageIndex": 898,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 3, 2013 10:41AM regbeach wrote: To the person just starting rads who is having issue with hard table.  My mom is basically paralyzed on one side- the side where the rads need to hit.  The only way we could get her positioned good enough was to be sort of cocked onto her other side with foam things under her hip and shoulders. The first day she moved during the CT scan- we had been there for 1.5 hrs. at that point.  Then I realized she was laying on that hard table, pushing into her hip bone. She can't shift her weight so I bet it hurt.  I asked if they had a mat and sure enough they did. It is about 1/4\" thick pad that is the length and width of the table.  It did the trick.",
      "MessageIndex": 736,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 18, 2013 12:16AM regbeach wrote: Gowiththeflow- Remind me please- does your nausea only happen after rads or is it random throughout day?  Did you have rads to your stomach area?  I'm sure I mentioned my mom has been struggling with vomiting. The gastro doesn't know why though she hasn't had any tests done yet (couldn't do gastric emptying test since mom couldn't eat the necessary meal).  She can hardly eat anything without feeling full, then when she walks she throws up- usually mucous now.  Prilosec seems to cut down on the acid she was throwing up. Melody46- Does your cough produce mucous that you have to spit out?  Is that why you are going to a gastro? Did the RO think it was caused by radiation?  My mom sometimes spits up thick mucous- like post-nasal drip mucous I think.  It happens in morning and today clearly happened right after her shower (like the shower steam broke it up and she had to get it out). Thanks.",
      "MessageIndex": 1013,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 18, 2013 12:19AM regbeach wrote: I thought mom was out of the woods with skin breakdown. She finished accelerated rads. last Wed.  RO thought she would be fine.  Her skin the crease and below it has gotten more tan since Wed.  I just noticed when I changed her and put lotion on that 2 spots in the crease appear to have opened up. They are a bright red/pink (sort of like a bad skinned knee).  I will call dr. in the AM- is that the breakdown others have talked about? Thanks.",
      "MessageIndex": 1014,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jul 19, 2013 09:02AM regbeach wrote: My mom's bright red/pink spots, turned to blisters.   By the time I got the Silver Sulfadine, they sort of looked like pus (since I didn't put lotion in that area, it's all I could think it was).  I am assuming that is just part of what the SS is for, right?  Nothing to call dr. back for? I put thick amounts of the SS on.  I am hesitant to wash it off since I don't want to rub the area. Thanks.",
      "MessageIndex": 1035,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "regbeach",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171311/profile",
      "Content": "Jun 30, 2013 05:17AM regbeach wrote: I have been using Miaderm on my mother 3 times a day and (knock on wood) her skin looks fine.  Maybe slightly pink in the crease after rads. She gets accelerated Canadian regimen which is more grays per visit but less cumulatively. She is at 11/17.  I recommend Miaderm.  You can order it on Amazon.  I use Prime shipping which is usually 2 days and have gotten it in less than 24 hrs.  On second tube now but we put it on generously.  As long as you use it at least 4 hrs. before rads, you don't have to wash it off either.",
      "MessageIndex": 662,
      "PostDate": "30/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    }
  ]
}