{
  "AuthorID": "Reina_de_lo…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242079/profile",
  "Posts": [
    {
      "AuthorID": "Reina_de_lo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242079/profile",
      "Content": "Jan 10, 2017 07:04PM Reina_de_los_changos wrote: Hi! In addition to Knitted Knockers, I also bought foam forms from Walgreen's online. They're light and comfortable. :)",
      "MessageIndex": 2,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/851508",
      "Title": "Foam Breast Forms - Source? Footsox2 Reina_de_los_changos"
    },
    {
      "AuthorID": "Reina_de_lo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242079/profile",
      "Content": "Dec 11, 2016 04:20PM Reina_de_los_changos wrote: Thank you! It helps that you are triple negative as well. So many women I talk to have hormone therapy, so I have to explain why I'm different. I will hang in there and continue therapy.",
      "MessageIndex": 5,
      "PostDate": "11/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851157",
      "Title": "Want to stop chemo Reina_de_los_changos FightingTheFight"
    },
    {
      "AuthorID": "Reina_de_lo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242079/profile",
      "Content": "Dec 11, 2016 04:19PM Reina_de_los_changos wrote: Thank you",
      "MessageIndex": 4,
      "PostDate": "11/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851157",
      "Title": "Want to stop chemo Reina_de_los_changos FightingTheFight"
    },
    {
      "AuthorID": "Reina_de_lo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242079/profile",
      "Content": "Sep 11, 2017 07:04PM Reina_de_los_changos wrote: Hello Everyone, I'm glad to hear I'm not crazy! Chemo ended in March (AC+T), and I haven't been able to get my body back. I used to hike, and exercise regularly, but my body can't take it anymore. My legs ache so bad-- really painful cramps all up and down. The bottoms of my feet hurt too. I was having joint pain, but I've been taking glucosamine for a month now, and my joints feel better now. I also have the sweats that was mentioned, but I'm pretty sure that's the menopause that was starting when chemo started. Like what I've heard, I take it day by day. I work full time teaching second grade, and that can wear me out sometimes. But I'm grateful that I can work, and enjoy what I do. Also, I don't feel depressed at all. I do have some anxious moments, and can get stressed, but Itry to remain grateful. I figure it could be worse. When I spoke with my oncologist last month about this pain, she suggested a couple of things. I just messaged her to tell her I'm still in pain. So we'll see what she says. Hang in there! I think we're all here for a reason...",
      "MessageIndex": 17,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858109",
      "Title": "Living with Long Term Side Effects of Chemo eevah Mybctc"
    },
    {
      "AuthorID": "Reina_de_lo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242079/profile",
      "Content": "Apr 21, 2017 09:26PM Reina_de_los_changos wrote: I'm so happy to read everyone's posts! I had the same question as Danix-- should I shave this baby chick hair. I actually think I look like an old bald man, with the hair texture of a sheep-- baaaaa! After reading, it sounds like I should leave it alone. I'm also going to try some of that hair color recommended. Diana, I sighed when I saw your hair. I would like mine to look like that. I'm 7 weeks out, and feel old and ugly. Wigs make me hot too, so I wear a cap when I'm out. Now the ugly grey hair is starting to show by my ears, so I'm a bit self-conscious. Thanks for posting, Ladies! So nice to know I'm not alone in this. :D",
      "MessageIndex": 25248,
      "PostDate": "21/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Reina_de_lo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242079/profile",
      "Content": "Jun 20, 2018 08:39PM Reina_de_los_changos wrote: Hi Sara, Right breast is holding her own! :) Dawn",
      "MessageIndex": 74,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "Reina_de_lo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242079/profile",
      "Content": "Jun 14, 2018 02:32PM Reina_de_los_changos wrote: Hi Sara, Welcome to the Uni-boob club! I have been a uni since 9/9/16-- almost 2 years, wow! Reading the other posts, I have the same issues. Mostly trying to find a bra I like (which really has ALWAYS been my issue), but also finding a prosthesis that I like. Swimsuits are the toughest, but I'm still looking. My right side is about a C cup, so it's kind of awkward if I don't wear a bra. The comfortable bra I have doesn't support my foob well, and I'm constantly adjusting it. My silicone breast stays put the best, but sets off the TSA screeners. It's not a big deal, I just say I have a prosthetic breast, they pat me down, and I'm on my way. I'm not usually embarrassed about having one breast. It was my choice not to have reconstructive surgery, and I'm still happy with my decision. I'd say-- you do you, Boo! It's nice to have choices, and this forum to share ideas. Rock that \"I kicked cancer's ass\" scar! But if you find you're too uncomfortable, go for the surgery. :D Dawn",
      "MessageIndex": 69,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    }
  ]
}