{
  "AuthorID": "REKoz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
  "Posts": [
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jun 20, 2011 07:26AM REKoz wrote: I know too well how much you must be struggling with this. Do a search for the stop smoking thread on this site.  Loads of support there. Good luck!",
      "MessageIndex": 1,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770554",
      "Title": "E-Cigarettes? Help me with not smoking! BlueCowgirl BlueCowgirl"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 13, 2009 03:44AM REKoz wrote: I for one Thank You respin! Everytime I have seen a post on this being rerun, I'm already too late. I am so looking forward to seeing this!  Thanks again and God Bless. Ellen",
      "MessageIndex": 1,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729009",
      "Title": "\"Living Proof\" Herceptin Movie respin respin"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jul 12, 2011 10:03AM REKoz wrote: I did as well as can be expected of any chemo while on Abraxane. Actually, I felt very fortunate to get it as an early stager. No steroids, premeds etc. to cause their own se's. Could you talk about Morphea. What is it? This is the first I've heard it mentioned.",
      "MessageIndex": 1,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771470",
      "Title": "Abraxane.... Gymgirl2679 REKoz"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 20, 2009 02:27PM REKoz wrote: Stumped- Both my Mom and I had papillomas. Both of us also had IDC and opted for a bilateral mastectomy. In my case, I was small breasted. The cancer took about one quadrant of the breast. I had 2 papillomas, each in a different quadrant. Though they are benign, the had to come out. I'm not an MD so I can only tell you of my experience. Both my gyno and breast surgeon insisted they had to go. So, I was going to be left with nothing anyway. I would guess in your case, you are going to have a biopsy on those \"abnormal cells\". If all they find is papillomas, it would simply be a matter of removing those benign growths. It is indeed trite to tell you not to worry as not knowing is the scariest part of the entire experience. You have not specified the answer the nurse gave you? You are certainly due an explanation of your results and whether any further testing is required. If you do not get a satisfactory answer, a second opinion is certainly in order. Good luck to you. Ellen  Good luck to you. Ellen",
      "MessageIndex": 1,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/731086",
      "Title": "papilloma, Ok ,whats Next,? Stumped barbe1958"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 20, 2009 04:08PM REKoz wrote: Hi again Bev- I am happy to help. The fear and terror are quite fresh in my mind! I have a feeling they will always be very powerful. It's horrible. I'm thinking it might be a good idea for you to try to get your Mom's history. She died very young and I'm certain your Doc's will find that important to how they may proceed with you. May I ask how old you are? Anyway, as of now you have been told only that you have pappiloma's. Try to concentrate on that being very positive as best you can rather then go to the \"what if's\". And definitely stay close to the boards here as they have been my life raft. xoEllen",
      "MessageIndex": 3,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/731086",
      "Title": "papilloma, Ok ,whats Next,? Stumped barbe1958"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Oct 3, 2009 05:52AM REKoz wrote: I'd like to respond to this and if there are any great writers out there, I surely could use their help because a letter to my hospital administrator is most definitely in order. I had a bmx last November with immediate TE's and alloderm. What happened to me was that I developed a horrible post op infection. Some of this is still foggy because I was on Percocet and couldn't understand why I had so much pain. Long story short, when my entire chest was purple and black, I went back to my FORMER PS in agonizing pain despite the Percocet. This \"professional\" proceeded to empty my expanders of the 60cc saline he put in at surgery with absolutely NO pain protocol whatsoever. I thought I was going to die right there on his table!! He said he had nothing in his office to give me...not even something topical!!  When I thought I was going to pass out, he told me I should go to the emergency room if it continued!!! Then, he sends me on my way with a perscription of 2.5mg valium. They do not even make valium in 2.5 so that could not be filled!!!  He never changed my post op antibiotics! I feel like he took out the saline because to cover his a$$. I truly think the infection was due to overfill as I was FLAT to begin with and the incisions were just splitting!! By the grace of God, I saw the Oncologist for the first time 2 days later. He took one look at me and had me on IV Vancomyacin every day for 2 weeks!  He saved the expanders, and I switched Plastic Surgeons. Not only that but my first PS's bedside manner was the WORST ever. Like a macho man who could give a crap about us women! So for those who have just had surgery like mine, it is SO important to pay attention to both the looks of your chest and the amount of pain you are experiencing. If one is still experiencing ridiculous pain even with strong meds, an infection could be the culprit. I just get livid looking back but I am gentle with myself when I can't believe I wasn't in this guys face sooner. I couldn't expect myself to know anything about this procedure without having gone through it. I feel it's imperative that if I can help even one person avoid the hell I went through, I will have succeeded in this new mission of mine. So, any good writers want to help me out with my letter? I am still going through recon with another PS (excellent) in the same practice. Can't be sent till I am all done a few months from now! I'd really appreciate some help. Not one other women should have to deal with this man!!",
      "MessageIndex": 22,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741061",
      "Title": "Pain medicine for mastectomy--survey tracyanne tracyanne"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 4, 2011 03:48PM REKoz wrote: Hi Ladies- I just had my 6 month visit with my Onc. and thought I'd share what he told me when I asked about Zometa. Though newly menopausal when diagnosed, I am taking Tamoxifen rather than the AL's tried but not tolerated AT ALL. He said that the Tamox. actually has a bone protecting effect. If my next bone density test shows a decline, we would discuss it then. But he feels that as long as my bones are good now and I am on Tamox., I should be fine. It would be a different story if I were on AL's. This was news to me. Good news actually. Thought I'd pass that on to those of you on Tamox. who like me were unaware of this. Nice to put something about it in the plus column! My best to all, Ellen",
      "MessageIndex": 17,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762627",
      "Title": "Anyone else Stage 1 BC Survivor who gets Zometa infusions? Nicole112 Parentof1"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Oct 25, 2010 01:24PM REKoz wrote: Wow, I'm so sorry this happened to you. As if cancer isn't enough. Having had the experience of incisions opening, I would strongly suggest you get into see someone. I would think at the very least you would need an antibiotic. I ended up having to have IV Vanco.for 2 weeks after my bmx. The PS (no longer employed by me!) did nothing when he saw it. Thankfully, the Oncologist did the following day. That treatment saved my expanders! I'm not trying to scare you and I hope I haven't. An open incision is an open invitation for bacteria. The sooner it's taken care of, the better the chance of a positive outcome. Best of luck to you! Ellen",
      "MessageIndex": 3,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759811",
      "Title": "Hematoma RealtorJackie BarbaraA"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "May 12, 2009 11:23AM REKoz wrote: 1. If you chose to read the se's of chemo, do so when you are NOT overcome with fear. Realize that as our cancer is individual, so are our se experiences. 2. My biggest regret was not asking for better anti nausea drugs sooner! I just assumed it was the \"cumulative effect\" I had to learn to live with. Until I got Emend and my entire chemo experience changed to the point where I actually felt I could complete tx.  And I DID!! 3. Don't read that chemo is \"doable\" when you are as sick as hell! You will not like the individuals who say that. OR you will wonder what is wrong with you!!",
      "MessageIndex": 12,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Apr 27, 2011 01:23PM REKoz wrote: Amy- I've been here over a year and have posted a few times with little to no responses. This is only your second post!   Posts get \"lost\" (pushed back pages) sometimes, particularly if the site is busy. I see that you're stage 3. Why don't you introduce yourself on the Stage 3 thread? I'm sure that the ladies there will be more then happy to help you!",
      "MessageIndex": 2,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768205",
      "Title": "very surprised at how unhelpful this site is amylynn1108 Moderators"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Apr 16, 2011 06:55AM REKoz wrote: So very sorry you are faced with this again. My situation is only similar to yours in terms of the papillomas. I had 3cm DCIS \"admixed\" with 1.2 cm IDC in the lower inner quadrant of left breast. Along with that, 2 papilloma's, each in a different quadrant which they said had to be removed. I was small chested so I really had no choice but to have a mastectomy. Lumpectomy would have left me with nothing anyway. It sounds as if you may be facing the same thing. We all have our different ways of coping with stress. It was almost easier for me to not have to make the decision between lump and mx. They say the papillomas are non cancerous but they will not leave them there because they \"can grow to be cancer.\"  Only you can decide whether you can comfortably live with being BRCA + and keeping a breast that is obviously prone to irregular growths. I salute your strength if that's what you choose. I couldn't do it. Wishing you peace and good health! Ellen",
      "MessageIndex": 13,
      "PostDate": "16/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/762394",
      "Title": "Atypical Ductal Hyperplasia 2 years following IDC Stage II eeyore2515 bdavis"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 1, 2009 02:07PM REKoz wrote: Donna- We have to get it together about which thread we are going to be \"chatting\" on! I wrote to you on the other a few hours ago. Anyway, absolutely ZERO need to thank me. We are all here for each other and thank God for that. I see it as a gift to have the supportive nature of my fellow travelers in a way I have with my close real life friendships. Even though there is no face to face (we don't even know what some of us look like-I must work on posting a pix for that more personal feel). Though in this case my friends, although incredibly supportive can't get me through some of this the same way as those traveling the exact same road. To answer your question, I don't know if you remember but I had a horrible post op infection and almost lost the expanders after my Nov. 10th surgery. As a result, I had to wait until that was resolved before I started chemo. It was down to the last minute I'm telling you! The expanders were going to have to go if the scar revision was not successful before mid Jan. That was the chemo wait deadline and I started on the 16th! Now, I will not get filled AT ALL (they took out what was put in during surgery during infection) until after chemo. I have come to terms with that but only because I was thankful that I didn't have to get them out! It's all about PERSPECTIVE..life in general and this bc for sure! I swore I would NOT under any circumstances do chemo when first diagnosed and actually had some of my friends believing they would have to sit me down and beg when I found out I had to have it! What really tips me in the chemo favor is the fact that they found this (and yours too) early and I really feel that once I'm done, my chances are real good to live life cancer free. I still don't know if I would do it if my prognosis was poor. I've learned to never say never but I do not see myself as one with the special constitution it takes to get through that. Now, my friends, family see me as strong but I see it as doing what I have to do. I am not going to sugar coat it for you, I HATE chemo. Even though my se's are not as bad as many of my \"sisters\" here, I just hate feeling like crap(no pun intended) constantly. As I wrote on the other board, I am now on my 1 week vacation after Fridays tx. First of 4. So, now I am feeling the effects of that and if it's like last week, it's downhill from today and peaks on Tuesday. Am soo looking forward to feeling good for an entire week! Thoughts of having to be drugged and dragged to the next cycle enter my mind frequently! But perservere I will and get through this because there IS light at the end of the tunnel. Plus, I have to be in good shape for my oldest (of  2) daughter's July 25th wedding!  Just pray for constantly for strength, use your life resources and these boards and we'll get thru this! The beauty of this support here is that my writing this to you reinforces what I know to be true regardless of how I sometimes feel otherwise. We make each other stronger in the most incredible ways! Look forward to hearing back from you and I always look forward to read about other's journeys to strengthen my own. Hugs, Ellen",
      "MessageIndex": 8,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728200",
      "Title": "Told Chemo is Recommended!! DonnaDio DonnaDio"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 11, 2009 06:43AM REKoz wrote: I am on Abraxane (and carboplatin plus Herceptin) every week x 3 one week off in between for 4 cycles. I just finished my first cycle and am experiencing a great week off! Dread going back on Friday. It plays real havoc with my stomach, can't eat anything but rice, crackers, ginger ale etc. until the day before I start again. The weekly is suppose to be easier because it is lower doses. It stinks but I guess it could be worse. I haven't lost my hair yet but my scalp feels funny. Hope this helps Ellen",
      "MessageIndex": 4,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728809",
      "Title": "Abraxane ? kbugmom bevsteed"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 20, 2010 09:15AM REKoz wrote: I am so sorry you are having difficulties. I had an infection on both sides after my bmx. No one ever brought up being allergic to alloderm to me. My Onc. took one look at me (after I had seen my now fired PS) and put me on 14 days IV Vancomyicin. It did the trick and I did not have to have the expanders removed. From what I understand, the faster they put you on Abx, the better chance you have of not losing them. Do you have a temp?  My feeling is that you need to get your PS to put you on the big guns abx asap.",
      "MessageIndex": 2,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748650",
      "Title": "Has anyone had a reaction to alloderm? chris14 chris14"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 30, 2009 03:41AM REKoz wrote: Donna- It's me, Ellen. I looked for you on the other thread and unfortunately here you are. We have much more in common then I knew! Same age (well, I just turned 53) and EXACT same thinking going into bi-lateral surgery. Only, I am HER+ so that completely put me in the chemo party. One thing that I kept and continually keep telling myself is that I will NEVER have to look back and say I didn't do everything possible to kick this cancer in the proverbial BUTT! How would I feel if GOD FORBID it reoccurred and I didn't do what the Professionals thought best? And I'm telling you, this chemo is no picnic! Don't know that I'd do it again (yeah I know, never would have a double mast. either!) but at least I am doing everything I can NOW. I think we are both in a position (you even more so being HER neg) to do what must be done now with strong odds in our favor of never having to face these decisions again. It totally sucks the big one (excuse my language but cancer deserves it!) but get a great Onco. you feel comfortable with and fight this as best you can now. We all do this together right? Ellen",
      "MessageIndex": 3,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728200",
      "Title": "Told Chemo is Recommended!! DonnaDio DonnaDio"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 23, 2012 11:40AM REKoz wrote: I had Abraxane and Carbo. as my chemo treatment 3 years ago.  Herceptin was also in that mix since I was HER2+.  It looks as though my schedule was the same as well.  Rather than once every 3 weeks, I went weekly x 3 and had a week off before beginning the next round.  12 weeks on that protocol is equivalent to 4 treatments for someone going every 3 weeks. When I was going through treatment, I was unable to connect with any other early stager on this site on this protocol.  It is my understanding that due to it's very high cost, most insurance co.'s will only approve Abraxane for our Stage 4 sisters. Many of whom have previously been treated with carbo among other chemos.  Needless to say then, there is a valid reason for the lack of responses to your post. There are so few of us around to have been treated with this protocol as our first line chemo! I'd be happy to answer any questions or share my experience if it will be helpful to you. I remember well the mental lift I got when passing the halfway point in chemo.  I might not have been feeling too swift physically, but my head was buzzing with excitement each time I remembered that more treatment was behind me than in front of me! Best, Ellen",
      "MessageIndex": 1,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783090",
      "Title": "Abraxane and carboplatin Seagrover Seagrover"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 21, 2012 04:38AM REKoz wrote: Congratulations to a fellow Long Islander!  I know for me, completing the chemo end of treatment brought with it a joy I had not felt since diagnosis. Your elation jumps right off the screen and into my heart. Particularly after reading that you are a Mom to four little girls!  God Bless you sister-friend! I'm guessing you've read this already, but the Herceptin only months are a cakewalk in comparison and that too will be over before you know it. Having your sister-in-law take the kids is a gift indeed- almost as good as the knowledge that this is the last time you will need this recovery time! Congrats again and thanks for beginning my day with a smile!",
      "MessageIndex": 2,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782982",
      "Title": "LAST TC part of my TCH Tomorrow. NeedtobeSTRONG financegirl"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 14, 2010 06:27PM REKoz wrote: This is a wonderful thread ladies and I have thus far (hopefully forever) avoided lymphedema. Just one of those BC sisters who devours all of this type of informative and compassionate discussion of BC. It's just so much more then the trauma of cancer and surgical alternation/removal of our breasts! You ladies dealing with this have my best wishes for a semblence of peace that your issues can at least be made \"doable.\"  And Binney, I have read many of your posts this past year and have always had such respect for them. Most of all, your willingness to share your vast knowledge freely with others and educating us is truly a gift. Peace and Love Ellen",
      "MessageIndex": 25,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748290",
      "Title": "My Surgeon never told me tamlyn110 PauldingMom"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 6, 2009 02:50PM - edited Mar 6, 2009 02:51PM by REKoz Mom- 3 years ago at 77 Me- 2 weeks after my 53rd b-day. Tested Brac neg, Something I forgot to ask genetic counselor. Maybe someone can help. Mom adopted, no family med history known. Since I was Brac neg, does that def. mean my girls are? If not that gene, I am convinced there's some as yet not identified genetic component. Onc. said my girls should have a baseline MRI (not mammo) at 30. These ages and stats are HORRIBLE! Ellen",
      "MessageIndex": 171,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jun 8, 2012 11:53AM REKoz wrote: Hi akc- Since no one has come by yet, I can share what it MAY mean. I am by far an expert and my diagnosis was cancer from the start. That being said, along with the cancerous tumor, I had what they call papillomas. I was told they were not cancerous but they had to be removed. Apparently, they can develop into cancer and from all my reading here over the years, it does seem that they are always removed.  So, in my very non professional opinion, your diagnosis says you have papilloma(s) within the ducts. Mild atypic is actually encouraging. Atypia means atypical..\"mild\" to me means something looks not quite right but it's surely not slapping them in the face.  Do you see anywhere on the biopsy report a BIRADS number? Hope this calms you down a bit. This is all so damn scary! Best- Ellen",
      "MessageIndex": 2,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/788745",
      "Title": "Intraductal papillomatosis with mild atypia akc820608 kwithtwo"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 3, 2009 02:29PM REKoz wrote: IMO, there are BREAST CARE CENTERS with state of the art diagnostics and research. Of course Sloan is well known and having not had experience there, I cannot comment. I went locally on LI and am so impressed with how I was handled from the very minute I had a fishy looking mammo. I agree with the poster who was able to have the same care at her local hospital, particularly if the diagnostics are equivelent. My sincere belief is that once something comes up questionable on a mammo, a breast care center is the best place to be both for your physical needs and the almost as important MENTAL needs. Whether it be MSK or not.  Just an opinion, Everyone has bad experiences and good experiences everywhere depending on so many things.",
      "MessageIndex": 10,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729028",
      "Title": "Sloan-Kettering KATIEKAY Hortense"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "REKoz wrote: I am just curious about this ladies and hope for some input. My ultrasound biopsy had me graded 3 with the Bloom Richardson scale. But my surgical path had the cancer characteristics at 2 which is of course what I prefer to think it is. I would think that the surgical path is much more exact. Am I right? Thanks, Ellen BMX 11/08, Abraxane/Carbo/x4 1/09 Herceptin until 1/10, Recon w expanders-1st exchange Dec. 09. Revision from 700 Style 20 to 600 Style 45-Oct 10 Dx 10/16/2008, IDC, 1cm, Stage IB, Grade 3, 0/5 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730454",
      "Title": "Which Histolic Grade do you use? REKoz simpsojc"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 30, 2009 09:25AM REKoz wrote: My heart goes out to you Laurie. I too had a bilateral mx in November. I clearly remember those last few days of having my own breasts and not being able to wrap my head around the fact that they would be gone. Breast Cancer sucks, there is no way around that. I've had several major episodes in my life where I have had to learn acceptance. None came close to this one and I still struggle with it. But I figure when I truly have internalized it, I will be a pro!  Except for losing my children or my closest loved ones, I think acceptance of any of life's hardships from here on in will be a breeze. If we don't grow during this, I think we're screwed!! I'm sending you hugs and MANY positive vibes for your surgery. You have found a wonderful place filled with beautiful women to share your journey with. xoEllen",
      "MessageIndex": 9,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731566",
      "Title": "OMG-it hit me today-HARD! TCGGal faithandprayers"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jun 2, 2009 03:49AM REKoz wrote: Thanks Denali my trusty thread Buddy!  I'm surprised some of the more experienced gals didn't bother to answer this. PET set up for Monday the 8th. I'm not letting worry about it run my life for sure. But, I have to admit and KNOW you understand that it doesn't leave the back of my mind! Will keep you informed. xoEllen",
      "MessageIndex": 3,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735032",
      "Title": "Finished chemo- Tumor markers up? HELP REKoz LakeArrowheadgirl"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "May 3, 2009 07:09PM REKoz wrote: Thanks for the Hubiclens tip. If I can't find it, can you suggest something like it? I had a nasty post op infection after bi mx and have revision scheduled for May 27th. I'll do anything to avoid another infection, though this one is day op. Worse or better for germs?  Hummmmm",
      "MessageIndex": 1,
      "PostDate": "03/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733555",
      "Title": "Stopping infections before they start AnneW lvtwoqlt"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 19, 2009 06:10PM REKoz wrote: Thank you ladies. I was thinking that the surgical path would trump the biopsy path. It definitely makes me feel better as I was a grade 3 in biopsy and a 2 with the surgical path. The difference was the nuclear type. Biopsy was 3, 3, 1. Surgical 3, 2, 1. I like the sounds of grade 2 better. Best, Ellen (who can't spell- maybe people thought I was talking about blood pressure instead of histologic grades!)",
      "MessageIndex": 8,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730454",
      "Title": "Which Histolic Grade do you use? REKoz simpsojc"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 16, 2009 11:42AM REKoz wrote: I've not visited the Mets board until now. I've been following this issue as a Social Worker, always interested in resolving issues. Certainly, I do not pretend that I can resolve this but I would like to add my input. First and most importantly, I would never even presume to identify with the feelings of anyone dealing with mets. How could I? I've not walked in your shoes and cannot even begin to fathom how I would feel. Like anything else in life, not one person can claim to know how they would feel, react etc. unless they've \"been there.\" IMO, anyone who thinks otherwise has much growing up to do. It's just a fact of life in my mind. Unfortunately, our culture has become so incredibly judgemental that often times, people confuse judgement with knowledge. A very sad commentary on where we've come. But that's for another discussion. I just want to say from my experience as a \"newbie\", I joined this site with absolutely no clue on where to start. Someone mentioned that there are many who do not understand the \"unwritten rules\" when posting here. I was one of them until I followed this thread. I still post by scrolling through active topics and obviously as an early stager, have not hit on an issue that applies to me on the mets board. I guess my point is that it may make sense to somehow inform newbies of those \"unwritten rules.\" Aside from the emotional need to seek answers when first diagnosed, many women have not even participated in internet discussion groups before. Those that have are certainly more savy about where and what to post. So, whether it be a seperate forum for just metsters, or some sort of notice to those just joining the community, clarity might prevent those clueless (but not necessarily hurtful) individuals from inadvertantly being insensative to the needs of those courageous Stage iv women. God Bless you All. Ellen",
      "MessageIndex": 21,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730686",
      "Title": "Please don't leave us PT63 EWB"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 30, 2009 05:38PM REKoz wrote: ccbaby- Do you have the option of not working? There are a lot of women who do continue to work. I am one of them. However, my original plan of being back in the office full time was quickly quashed due to chemo se's. I work at a university and around a lot of people. When my white counts got too low (though not low enough to stop chemo), my boss arranged for me to work from home. Thank God!! I've had a rough time of it on chemo and on some days could never have gotten myself up and out to work. Everyone is different as we well know . Some ladies need the distraction of work.But if you have the option of working less, being kinder to your body and away from public germs might be to your benefit. I wish you all the best on your journey. God Bless. Ellen",
      "MessageIndex": 1,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731645",
      "Title": "Going back to work during chemo ccbaby jrgolomb"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 18, 2011 12:37PM REKoz wrote: Add me to the list of those who had too much going on inside a very small left breast where a lumpectomy was not an option. I chose to have a bilateral but not without agonizing over it. The first sign FOR ME was seeing the image of having just one breast removed. The fear and horror I felt was completely unexpected. Perhaps it was reality setting in but other then discovering I had to have chemo, that was the only other day I broke down uncontrollably. For some reason, the visual of missing one of a pair freaked me out. Since I knew I would have recon on the cancer breast, I learned that I would likely have surgery on the other (anyway) for a better match. And of course, I'd still have the anxiety of annual mammo's (which is how they found the left bc). Finally, my father in law who is an MD (admittedly of the older school) expressed his strong belief that if it were his wife or daughters, he'd encourage doing both. His feeling is that if a woman is past child bearing age and cancer is found in any female related part, the optimal resolution is remove in it's entirety. Of course, there are hundreds of survivors who did not go this route so I am not claiming that he is right and others wrong. Just saying that his opinion factored into my decision as well. And finally, I am a believer of people coming into your life for a reason. I got to talking to a wonderful woman fighting stage 4 for the past 10 years. When I told her I was leaning toward a bmx, she said that she wished she had done that when first diagnosed stage 2. We both agreed that her outcome could very well have been the same but she lives with the \"what if.\" That sealed the deal for me. I don't need to live with anymore regrets than I already have! The recon (exanders-implant) was long and not complication free, I have yet to decide if I will go for nips. In clothes, I look great and even without, I do have to matching breasts albeit without feeling. A sexual complication I had not even considered but have found to be a HUGE loss in terms of responsiveness. I know that I wouldn't have done this any other way, I didn't know that I'd be living with a \"what if\" anyway. What if I kept the healthy breast that responded more than I ever imagined before this all happened?  To say this all blows is an understatement! My best wishes for peace with whatever you decide.",
      "MessageIndex": 14,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765075",
      "Title": "What were the reasons that you had a MX versus a lumpectomy geogal anneflorida"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 6, 2009 09:58AM REKoz wrote: Hi Everyone- This is my second post but have been keeping up with you all as a way of \"seeing my future!\" I believe it was Holtbolt who made mention of hubby wanting to rip the laptop from her and I too am experiencing that same male reaction!  Legally not my DH, I'll call him my DSO (dear significant other.) He has been truly AWESOME throughout except for understanding my time on these boards....he thinks reading about all the bad SE's is not good and just gets me \"set up\" for being depressed. As I am assuming you boardies know, it is more about education and BEING PREPARED and I'm not depressed. At least anymore than any of us having to deal with all this! I said in my orig. post that I had a nasty infection after bilateral with expanders and two weeks ago had a scar revision which looks great. Then stitches popped on the left lymph side which last week were resewn with added permanent stitches for insurance. Saw PS yesterday, looks good and he is giving it one more week before taking stitches out. So, I am behind on EVERYTHING, I can't use this left arm at all, let alone lift over my head for fear of popping. Right arm is great. See Onco. tomorrow and believe he will start me on Herceptin this week. Don't see too many HER2+ on this board but the board specific to that doesn't feel right for me. I want to stay on with all you Jewels as the chemo experiences are the journey I am most interested in NOT taking alone! After stitch removal next week, I am sure to start weekly (for 12) Taxotere and Carboplatin with the Herception. I haven't seen many (if at all) anyone weekly here? Onco. seems to feel with my infection and healing issues, this will be less taxing on my system as opposed to one big blast every 3. Anyone familiar at all with this protocol? Andrea in MN.- I lived just south of Minneapolis for five years in the late 80's. My girls were 2 and 5 when we moved there...now 27 and 24!  So, I guess I was alot younger too! But I LOVED living there at that time. I know I couldn't take the winters anymore because I am sick of them here in milder Long Island, NY. But your state is filled with the most kind people anywhere. It wouldn't be as beautiful a place to live if it were warmer cuz everyone would move there! I was never more at peace with myself and my trust and love of fellow human beings then in Minnesota! And I've moved around alot! I am one of your states best cheerleaders! Now I'll become a cheerleader for the Jewels as this is board provides that very same positivity about our fellow travellers! Good luck to everyone this week. I'll be back soon! Ellen ",
      "MessageIndex": 302,
      "PostDate": "06/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 19, 2009 08:35PM REKoz wrote: Lost is awesome! Just gets my insides going with all the twists and turns. Just watched last nights epi again, Jin with the gun gets me almost giddy with questions. What time are we in now? Best show on TV! I think there's a Lost and Friday Night Lights Thread. Love that show too. Wishing all se freedom. I go for my 2nd (weekly for 3) of this quarter tx tomorrow. Did much better this week on stomach issues. Fatigue a bigger issue though...2 days in a row of 3-4 hour naps! Never was a napper and hate sleeping the afternoon away. Oh well, I'll take this over stomach havoc anytime. Ellen",
      "MessageIndex": 1243,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 31, 2009 05:23PM REKoz wrote: ddlatt- I posted here early on as I started chemo in Jan. Sorta drifted over to the TCH thread as that is the chemo closest to mine. But instead of Taxotere, I have been on Abraxane from the start (c-carboplatin, H-herceptin). It is $$$ and most insurance will only pay for late stagers. My Onc. was able to get it for me due to my bilateral carpal and the fact that it is less likely to cause neuropathy. That holds true due to it's composition and the fact that no pre meds (which also cause nueropathy) are required. Keep in mind that I go weekly x 3 instead of every three. But my hands have held out wonderfully! I'll get the tingling in both hands and feet but not often and it is very manageable. I have one more cycle to go and thus far have had no nail problems either. I hope to say the same at the end of treatment! If you can get it, you may find it much more tolerable. I do have Emend after starting of with Zofran as the nausea got worse. But that could be more from the carbo. Best of luck to you. Ellen",
      "MessageIndex": 1742,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jul 9, 2011 04:49PM REKoz wrote: So sorry you are going through this. I will never EVER forget how it feels- especially in the early going,when you cannot possibly get your head wrapped around the possibility of having breast cancer. Unfortunately, I too was a BIRADS 5 (though no lumps could be felt) prior to the ultrasound and definitive diagnosis. Although there is always the possibility of B9, a BIRADS 5 is as high as it goes on the \"suspicious\" scale. I hope that's not the case for you but I do think you may want to prepare your mind as best you can for a breast cancer diagnosis. I'll pray that's not the case for you but should this be the result, you have found a wonderful refuge as well as a source of voluminous information here at BCO.  Please keep us advised. All the best, Ellen",
      "MessageIndex": 1,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771370",
      "Title": "BI RADS 5 Rockysg1 22lifeisgood"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 10, 2009 07:27PM REKoz wrote: I'm going to bumb this in the hope that more people are around.",
      "MessageIndex": 1,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730454",
      "Title": "Which Histolic Grade do you use? REKoz simpsojc"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 8, 2011 12:09AM REKoz wrote: Hi Meg- Can I assume that you did Herceptin as you didn't mention it and you are HER2+? Our stats are similar other then the fact that I was ER+. Very small of chest, I had no option but to have a mastectomy and decided to do a bilateral. My Onc. told me I had a 95% chance of now being surgically \"cured\" followed by 5 years of an anti hormonal (which you won't need).  I totally understand why you would be fearful. Especially because all that positive \"self talk\" that it wasn't cancer didn't help. Do you still have any meds for anti-anxiety? If anything is going to put your anxiety into overdrive, it's this! I know that there is always the possibility that I may not fall into the 95% of those who remain cancer free. But there's a far better chance that I won't. That helps me deal with the fear of return. What also helps me is the thought that I got through this when in the beginning, I truly did not think I would mentally survive (especially chemo!)  Though I am not dealing with anything that provokes fear that it's back, I have learned that I can't change a THING that is unknowlingly going on in my body. There are so many \"what ifs\" that could drive you crazy. I need every ounce of energy I can get and am determined not to let my fears gobble it up until I know exactly what I am dealing with. I think it's wise to get into the Dr. when you can but until then, you don't know what it is. The odds are on your side that it is not cancer. Try to remember that until you see the Dr. Hugs to you and please update. Ellen",
      "MessageIndex": 5,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/765837",
      "Title": "Really scared MissMeg MissMeg"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Nov 3, 2010 01:20PM REKoz wrote: You're not a moron! How many of us knew anything about wigs before chemo? It's just another of the many issues we suddenly have to become knowledgeable about. I am fortunate enough to have excellent insurance so I went to a shop that specializes in all things cancer. I actually got fitted for my wig and YES, there is a nylon( I think there are other materials as well) cap to wear under and keep them in place. I also had a synthetic wig and washed it as you would your own hair. Purchased synthetic wig shampoo and conditioner from TLC, which I'm pretty sure you can get to through the American Cancer Assoc. site. I found that to be cheaper then most others. You can also get the cap to wear underneath there. Though my wig was great (I'd love the same \"cut\" now with my hair back), I totally hear you on the \"oddness\" of wearing it. No matter how good it looks, it's very difficult to \"forget\" that it's not a natural part of you. Just another reminder of what you're going through. The last time I wore mine was at my daughter's wedding- almost 3 months after finishing chemo but still on Herceptin. After being completely bald, the little hair I had growing in was good enough for me to ditch the wig! Best wishes to you for a smooth and successful recovery. Believe it or not, you will look back and think it went fast. I can hardly relate to that bald person I see in pictures now. Thank God!",
      "MessageIndex": 2,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/760238",
      "Title": "Help with wigs anonymice anonymice"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 21, 2011 09:34AM REKoz wrote: I'm thinking that the title of this thread is a little misleading. Seems that the real issue is your feeling that because you are early stage, people don't understand what you've been through and/or the mental trauma caused by any cancer diagnosis. I can't imagine why one would feel guilty because their cancer isn't worse!  Spend more time on these boards learning what life is like for our stage 4 sisters, check out the ever growing list of angels who lost the fight leaving behind hundreds of motherless children. Realize that the majority of us early stagers will never have to put up a fight again while many are fighting everyday against the demon that has overtaken their lives and will likely win the battle for the body one day. I do know the feeling (especially toward the end of treatment) that those around you assume you will easily move on once treatment is over. It was caught early, you were treated and your odds are good that it won't return. Many of us have found the most challenging time mentally is when treatment is over and we are left to our own devices to navigate a \"new normal.\" We will never be the same as we were- no one ever is after experiencing trauma. And though you may feel like a fish out of water for a time, it does get better. Believe me, I am anything but Polly Positive and I can still let what's happened get me down sometimes. But I am always grateful that I have been given the opportunity TO move on with great odds that I left friggin cancer behind. Involuntarily entered into the lottery that is breast cancer, I feel like I have a winning ticket. I just wish we all did. My heart couldn't feel more for those not as fortunate.",
      "MessageIndex": 15,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763157",
      "Title": "Depression Over Good Prognosis? huntreiter3 Momine"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 20, 2010 07:47PM REKoz wrote: I bought a simple cotton knit black cap at the mastectomy boutique that I lived in.Literally day and night! I had chemo weekly in the winter so I didn't go out much!  When I did, I wore a baseball cap with the hair attached which looked great. For anything more then running out, I wore a wig. Loved how it looked, hated how it felt. Finished chemo at the end of May and the last time I wore the wig was at my daughter's wedding at the end of July.  It's a difficult time, but it does pass quicker then you think. My best wishes to all going through chemo now. It will become just another unpleasant memory I promise!",
      "MessageIndex": 11,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748636",
      "Title": "What was your favorite head covering through chemo? BooBee Brendatrue"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 15, 2009 11:47AM REKoz wrote: Oh am I EVER happy to see this post! I had a bilateral mastectomy on Nov. 10th. It was the Plastic Surgeon who was MERCILESS on me about my smoking. He was the most pompous, unfeeling moralistically superior a-hole mentioned it within every sentence he uttered. He set me up for all sorts of problems and guess what? I had them..a NASTY infection that set me back a month and caused me to have a scar revision which thankfully looks great now...NOW that I have a new PS! No question, smoking effects healing. In my case though, I am convinced orig. PS overfilled my expanders initially which pulled the incision apart. When the Home care nurse said get your butt to the PS, you are developing an infection, all this guy did was take all the fluid out that HE put in. The pain was beyond belief and I almost had to go to the emergency room. No numbing, no nothing (said he had nothing??)..just stuck needles into infected mastectomy! Sends me home with no change in the basic \"\"leave the hospital antibiotics. No question this guy was trying to save his butt by getting all the fluid out and told me to come back in a week! Thank God for my oncologist! When I saw him two days (and out of my mind pain later), he immediately put me on 12 days IV Vancomyocin. Luckily, I had a port put in at surgery because I knew I'd be on Herceptin for a year!  Infection cleared which so fortunately saved me from expander removal. However, we will not be even discussing beginning to fill for at least a month and maybe not till I'm done with chemo should I run into any problems there. My new PS also highly suggests (without making me feel like a peice of dirt) no smoking and I have cut down considerably. Neither of them would have done a DIEP as a smoker even if I had been a candidate. I have read alot of literature concurrent with that opinion. Anyway, I start chemo tomorrow...Abraxane, Carboplatin and Herception 3 weeks on, one off for 12 cycles. I have been told that without having to take steriods, this may be easier on me. Hope so because I HAVE to return to work on Tues! I am thinking this protocol will significantly lessen my enjoyment of smoking and contribute greatly to my strong desire to stop all together. I'm with you ladies as far as feeling so stupid adding carcinogins into an already cancerous body. But also identify with the feeling that it's been darn near impossible under this stress. My mantra is that chemo will SUCK, but it will be my friend. Metal tastes do not bode well for any mouth input, let alone cigs! Love these boards and hope to get to \"know\" some of you better! Best of luck to all! Ellen",
      "MessageIndex": 21,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727106",
      "Title": "Smoking and no masectomy? Deb-from-Ohio anianiau"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Apr 20, 2009 06:53AM REKoz wrote: Just adding what my Onc. told me my daughters (27, 24) should do which absolutely confirms JeansBeans experience. My mother (age 77, 3 yrs ago) and now me at age 53 is most certainly within the criteria for risk. Mom did not have to BRCA test but I did and it was negative. I'm convinced further research will uncover more genetic variables as no one can talk me out of thinking my girls ARE at high risk. Anyway, my Onc.'s opinion is that the girls each get a baseline MRI at age 30. Earlier would be OK with me but the point is, it's the MRI and not an initial mammo that will be their starting point. In regard to the hormonals in particularly diary and meat, organic is all I will buy now and have stressed same to my daughters. Highly hormonal positive makes me think that my past history of LOVING milk and drinking it by the gallons as it was a \"good\" thing was in fact a great aide in developing this cancer. Same could be said for the Irish meat and potato upbringing I had and passed on to them! It's hard for them to fully grasp how to undo everything they learned. Just as it was for me. I just pray that they never have to find out the hard way like I did!  And I try not to dwell on my anger that they put out and APPROVE so many carcinogenic products to begin with. There has to be a multitude of people that think we are somehow \"protected\" as I thought my whole naive life! God Bless us all! Ellen",
      "MessageIndex": 13,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731797",
      "Title": "What's in store for our young daughters? pinkshortcake Carolina59"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 17, 2009 10:23AM REKoz wrote: Hi- I have posted here once or twice before starting chemo yesterday. I haven't seen anyone on this board with the same protocol as me. Has me curious. Instead of taxotere, I am getting Carboplatin and Abraxane which I am told is IAbraxane) easier on the system and does not require steriods. I have carpal tunnel and hand issues and this drug is also supposed to be better at avoiding neuropathy. The Oncol. (LOVE him) had to fight insurance because usually this is given to higher stage cancer or reoccurrent bc. I am also HER2 pos which adds Herceptin to the regiman. I am on a 3 weeks on, one week off for a total of 12 treatments. Also told on this protocol, se's may be less due to smaller doses. I got anti nausea shot in the port prior to treatment and have Zofran to take at home. After chemo, I just felt really tired but the biggest issue seems to be headaches.  I have been fortunate enough to not have problems with headaches in my life. I have none of the other meds I have seen here. Is there anyone familiar with this type of protocol? I am returning to work on Tues. since my bilateral with expanders on Nov. 10th. Nasty post op infection, 12 days IV Vancomyacin and finally scar revision which now looks as if it should have after surgery. Hoping I'm not pushing it by returning to work (adm. asst-desk job) but have run out of sick time and $$! I have to do what I have to do. My cancer was discovered exactly one year to the month of my last period ( I'm 53) so I have had some experiences with those blasted hot flashes which only get worse! One thing I thought I'd mention-particularly to you younger girls going into forced menopause- is that my Oncologist has me on the anti depressent Effexor. I actually went on Wellbutrin at the advice of my Gyno when diagnosed and did feel that helped. However, after surgery I could NOT sleep to begin with and everytime I nodded, I'd be awoken by a hot flash. The Oncol. said that Effexor has been proven to help about 60% of woman with hot flashes. It's only been a month and I do still have them but less frequently. AND, I get a full night of sleep! Thought maybe it might be worth talking to your MD's about. Ellen",
      "MessageIndex": 594,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 29, 2009 07:25PM REKoz wrote: Kim-No need at all to apologize! I have met 2 \"angels\" in particular in treatment who are both long time chemo champs! They happened to be in my room on the worst day I have experienced post op when I was on IV Vancomyacin for post op infection. I KNOW I was led to them in that room on that day and have seen them since. They are awesome and I TOTALLY get the inspiration emanating from such strong warriors. I think I'm just feeling fragile today. On the whole, I am getting thru this whole thing by always seeing the positive and am of course lifted by the support of those around me and on the boards here. Just one of those days for me which we're all bound to have. I hear you on the teen worries! I got through two daughters who are now 24 and 27. The oldest is getting married in July, 3 months after I've stopped treatment. Thank God for that timing! After all we've been through this year, I imagine it will be quite the emotional day. My younger one is finishing up her Masters but is still a teen in many ways! No matter hold old they are, it's our fate as Moms to always worry about them! Have a wonderful night cuddling! Ellen",
      "MessageIndex": 871,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 30, 2009 06:08AM REKoz wrote: Kim-  Yes, having the wedding to look forward to is a blessing. It's going to be rather large at 200. We moved several times while the girls were growing up and will be seeing some of our friends that we haven't seen in years. I was diagnosed in Oct. when we were getting into the full planning mode and had to work on my sadness that my daughter was having to deal with this during such a happy time. Plus the fact that Mom could no longer be 100% focused on her. Of course, she was not struggling with that part nearly as much as I was and I learned very quickly that this was not a topic she would even consider discussing! Her Dad and I were married 25 years and he has since remarried and lives in China! We are the \"Bruce and Demi\" of common folk though and he has been wonderful in both emotional and financial support. Another gift coming from this BC, she will be proud that her parents respect their history and can still share her moment together! As far as the recur anxiety (Dianetoo), I think it might be due to where I am. As a weekly person, I just start to feel better and then it's back to BLECH. Today is #3 and then a week off so I am trying to focus on that wonderful fact instead of the fact of physically going downhill after today. As weird as it seems, for me, the biggest issue with recur is more chemo. Of course the cancer itself is not a happy thought but it's the thought of continual chemo that just does not seem doable to me. I am far from an anxious person and it does not occupy my mind, I just HATE HATE HATE feeling so gross. Haven't lost my hair yet but I think I'm as emotionally prepared as one can be, Wig appt tomorrow and also prosthesis since I won't be getting filled till after chemo due to that infection and scar revision. Believe it or not, I've come to terms with everything but this friggin chemo! Well, it's off to the shower b/4 I leave for that friggin chemo!  At least it's a great motivator to get my work done as I bring my laptop and it makes the time go super fast. Here's wishing  you all a great day in the midst of this battle we all face. Ellen ",
      "MessageIndex": 881,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 11, 2009 09:55AM REKoz wrote: Morning Jewels- Renrel-I went to the AMC Look Good Feel Better program the other night. They showed a great trick for head covering with a mans undershirt. I am going to look in the dollar stores for t shirts in different colors. They cut off right under the arms of an x-tra large size so all thats left is the torso. Open the shirt in a circle and twist the entire thing. Then take one section to your forhead and open it over your head all the while holding the rest of the twisted part behind you. Then you fold one rear twist over the other and bring around to front (like you would do with a towel for when you had hair and washed it!) It looks really good and being cotton is very comfy. I hope you can visualize that. It might work for you. My chemo is weekly x 3 with one week off in between.  On Friday (the 13th so friggin appropriate), I will begin the second round of 3 (of 4 total). I DREAD it as I have been feeling almost like my old self for a week now. I really, really don't want to go back...whaa whaa. This does indeed stink more than any stink I will be making next week! Enjoy the day. It's beautiful here in the East. A huge tease for spring. Ellen",
      "MessageIndex": 1102,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 23, 2009 07:05PM REKoz wrote: Hi Janet- Although this is my first (and God willing last) go at chemo, I am on Abraxane as well as Carboplatin and Herceptin.My Onco. was able to get this approved even though I am early stage for a bunch of reasons. The biggest advantage that I can tell from reading here is that it does not require steroids as it is water soluable whereas taxotere is not.  It would be hard to tell you how just that drug effects me because I am not sure what causes what. I am also on a different schedule than most- 3 weeks on, one off x 4 cycles. I'll be halfway through after my tx on Friday. I have lost my hair, and seem to experience most of the same things everyone else does. Nausea (helped by Zofran), stomach issues (Immodium AD helps) and fatigue. Somedays I feel just about normal. It's not very predictable.  Hope this helps. Good luck to you. It's got to be really tough after 20 years. By the way, I am a young 53!! Ellen",
      "MessageIndex": 1318,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 31, 2009 08:30AM REKoz wrote: Hi everyone- So many new posts in 24 hours and this tiny menopausal chemo fogged brain cannot possibly address by name so I apologize in advance for what may just be a rambling of thoughts. First one is to my Paris bound sister..any room in that suitcase for me? You are truly fortunate to have that opportunity in front of you and man, if ever there was a time to grab it, it would be after getting through this! I loved what you said about \"who knows what we'd do when actually faced with something.\" So true! I have spent my life saying to anyone who would listen that I would NEVER do chemo under any circumstances. Well, I should have learned after my divorce (I too am on great terms with my ex..however, he lives in China. Unlike Paris, there is no appeal to live there!) to never say never because here I am the day after my 3rd tx! Like you, I am awestruck by the attitude of those facing recur's but truly wonder if I could do it. Some people are stronger than others. Did I mention the sea bands for nausea? You can get them in any pharmacy and they have been a wonderful, drug free addition to making that se a little more tolerable for me. LOL at my sister with the 13 yr old babysitter. Get Mommy buzzed and romanced and then leave. I can imagine you passed out upon his return! Thanks for the smiles. I had thrush issues after being on IV Vanco for 12 days followed by oral abx for a month after post op infection. It does indeed stink and I am Bioteneing like crazy with a rx on hand should it pop up again during this chemo. My present issue is cold sores that aren't festering anymore but won't heal (I have an rx for that too!) and the appearance of zits I haven't seen in 35 years! The Oncol. said this can be a se from the Herceptin. WONDERFUL, the drug I have to take for a year! I have a topical rx for that. So, you can imagine that I am feeling like one hot middle aged sexpot right now!  Hair is still here and I could get lucky but I think it will just take longer for me being that I am on a weekly cycle. I can't even imagine the emotional work it is going to take for me to walk out the door once that happens! DD (the July bride to be) and I are going wig shopping today. I'm also getting the prothesis since I won't be filled at all during chemo. Just thank God I have the most awesome SO who always makes me feel like a million bucks no matter how gross looking I become! Without him and the support of DD's and great friends.AND these boards..Well just Thank God! Here's to another day of living life no matter what it's throwing at us! Ellen",
      "MessageIndex": 907,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 2, 2009 10:34AM REKoz wrote: Hi Everyone- My name is Ellen and I am just thrilled to be part of a \"group\" having to deal with the experience of this very difficult journey. I had a bilateral mastectomy with expanders on Nov. 10th which was unfortunately followed by a very NASTY infection.Since I am HER2+, I had a port put in at the same time as surgery with a year of Herceptin treatment looming. Very fortunate there as I had  almost 2 weeks on IV Vancomyacin. Infection cleared and I just had the eschar removal and scar revision done last week. Unfortunately (again) a few stiches popped on the lymph surgery side which was just packed and resewn with both disolvable and permanent stitches. Left arm in a sling as a do not use \"reminder.\" It has to stay bandaged until I see PS on Monday but the wound was clean and there does not seem to be any signs of infection. I've been on some sort of antibiotics since surgery so I had developed thrush,(UGH) which has since cleared on antifungals. It sure makes me very afraid of mouth sores when chemo starts though! I'm so glad I've read about the throat coat and absolutely plan on ordering that! Anyway, if the PS clears me, I will be starting chemo (carboplatin, taxotere or abraxane which he-my GREAT oncologist- would prefer but may not be covered as an early stage patient) along with Herceptin and anti estrogen in pill form (think Femara, not 100% sure). Originally, I was to be on a 3 week cycle for 12 weeks but he has changed it to weekly with my penchant for infections. The Herceptin will continue for one year on 3 weeks after chemo. Since that change, he took Neulasta off my perscription list and only kept Zofran for nausea.From reading this, I'm thinking I'm glad Neulasta is not in the picture! I'm so looking forward to \"getting to know\" my fellow travellers, comparing notes, advice and most importantly...support. My work situation gives me a little more time of getting by but I REALLY want to go back asap. I believe that will be discussed with my Oncologist once treatment starts and how it effects me is known, My oldest daughter (27...I'm 53, another daughter almost 24), is getting married on July 25th and the sooner this treatment starts, the sooner I can focus on what will be one of the most special days of my life! Not to mention hers and the fact that she can get the attention she so deserves. Of course, she just cares about me getting better but as all you Mom's know, I want to be able to give her all I've got! Thanks Lisa for starting this thread (I am soo jealous that you live where you can get instant therapy from warm sunshine along an ocean beach!...too cold on out LI beaches now!) and I for sure plan on being an active member of the \"Jewels!\"",
      "MessageIndex": 192,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 29, 2009 05:52PM REKoz wrote: I'm thinking it's just me in my chemo funk but when I read about the woman you sat next to today B.Kim along with all the recur's I see, I get..I don't know first mad, then sad, the scared as hell. Obviously having been diagnosed from my yearly mammo, I understand that we have no control. Most of the time, I am very positive because I have the facts of my BC to back that up, no nodes, small tumor Stage 1 but with that pesky HER2 pos. Still, after swearing that I would refuse chemo should that be suggested after surgery, I find myself readying for #3 tomorrow and then my first break on a 3 on 1 off x 4 protocol. So, I do also understand that when faced with something head on, I CAN change my mind. Truthfully though, a recur after 6 months? I just don't know that I could do it. I just told my SO (signif. other) this story and said: \"if that happens to me, we're off to everyplace I've ever wanted to see, I'll max out my credit cards but I'll have the best year of my then short lived life. Of course, he doesn't see it that way, but I really feel that the only reason I am doing chemo is to get better and stay that way! Denial maybe? I don't know. I know it happens, but...oh I don't know, I'm rambling...it just freaks me the heck out! Thanks for letting me vent. I'm sure it's anxiety about tomorrow after having 2 real good days. Ellen",
      "MessageIndex": 865,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 5, 2009 02:31PM REKoz wrote: Hi- This direction of this thread currently should be good for me. So many great tips on our nuitritional needs. I just want to know if I am the only one who can't stomach most of it right now? After surgery but b/4 chemo I did some great protein shakes in the blender. Now? BLEECH! Even the thought of diary anything (which I normally love too much) is so unappealing. Even when I try to make it appealing, it ends up not hanging around my insides too long.  I am on a 3 week on, 1 off (this week YAY) cycle so I'm guessing it makes a big difference how one feels. I eat the same things whether it be good or bad days because my stomach is just getting beaten up! Actually, I can widen my menu a bit on good days and have chicken, maybe a veggie or two but on bad days?  Even the rice, toast and soup route causes what my DSO calls \"internal disorder\", I feel I'm doomed to eat like this till chemo is over in early May!",
      "MessageIndex": 1012,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Apr 1, 2009 11:07AM REKoz wrote: ddlatt- Yes, I am also taking carboplatin. So the nausea could likely be due to that rather then Abraxane. Carbo is usually the culprit. Without the pre meds, you would have a much easier time of it. I have not had ANY body aches period on this regiman. Just tiredness/heaviness. Go for it! I don't think you'll be sorry. Ellen",
      "MessageIndex": 1749,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 15, 2009 05:49PM REKoz wrote: Renrel- Something very strange has happened to this former non believer in everything \"organic.\" I thought I had been eating whatever for so many years and was just fine (ha!) and almost thought of organic as just another way to mislead people and get them to spend more $. Not anymore! I haven't read anything specific, just many different articles, opinions etc. So now that I see where my former thinking has gotten me, I can't help but zero in on the hormones and antibiotics given to the animals. Actually, I had wondered about that due to the increasing amount of young girls developing earlier and earlier. Now, with my bc being 90% ER and PR pos, it's as if a switch has gone off in my brain. I'm not one to easily change eating habits (or any for that matter) but I will no longer buy any diary or meat that is not organic. Veggies not sprayed with pesticides will be next but I can only do so much at a time! Besides, my chemo has me eating nothing but soup, rice (yes, organic) and toast for three weeks of the month. Just can't see how the non organic couldn't have had something to do with bc. I don't think it's the sole reason but I am no longer going to eat something I think may promote it. Ellen",
      "MessageIndex": 1170,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 17, 2009 11:33AM REKoz wrote: Morning Ladies- I just want to add my 2 cents in regarding support groups. I have been a huge advocate of such groups as I was in one years ago that I believed saved my life. I thought when diagnosed, I would immediately go out and find a local group to deal with the various issues we have. Problem was/is that between chemo, Dr. visits, work and life in general I just don't have the energy to commit to going elsewhere at the moment. I have found all I need to go on by being a member here. Seriously, I came to this realization in a most powerful way when my hair began falling out last week. By reading the experience of both those who have gone before me and those traveling along with me, I was more prepared to go for that shave then I ever could have imagined. My caring family is incredibly supportive but truly could not understand how I could do that. And the thing is, I didn't need for them to understand. My sisters here understand and that is what gives me the strength to do what I must do and accept things as best I can. I guess what I am saying is that if you find much comfort and sisterhood here and not within a physical group this could be all you need. I know it is for me, for now. Ellen",
      "MessageIndex": 1191,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 18, 2009 06:39PM REKoz wrote: Any chance the headaches could be from the anti nausea drugs? I get one after the infusion (I forget what they give me with chemo and I know taking the Zofran for a few days gives me a headache. Butt I can live with that and a few tylenols much more then the nausea if I don't take them. Just a thought. Ellen",
      "MessageIndex": 1221,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 3, 2009 06:05PM REKoz wrote: Wow Lester! You're basically saying one of your co-workers screwed (not literally of course!) your daughter? That is unbelievable! Unacceptable really for any teacher to do to a good student who is dealing with this in her family. But a CO-WORKER?? My goodness, I can hardly contain myself, I can't imagine what I would have to say to that, that....%$#$ This is difficult on our children-regardless of age. We were just getting into the real swing of planning my oldest daughter's July wedding when I was diagnosed in Oct. I cried a lot over the fact that she was no longer getting the focus she deserved. Of course, she would hear nothing of it but I still feel badly. It should be the best time of her life. Sometimes I have to be reminded that I will be three months out of chemo then which will make the event all the more special. Hoping it's a good night for all you Jewels. Ellen",
      "MessageIndex": 974,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 5, 2009 03:21PM REKoz wrote: Thanks Diane- This regiman is supposed to be easier! It's smaller doses v. a every 3 week blast. I had a nasty post op infection and was just in the nick of time able to save the expanders!  Surgery was Nov. 10th and they would only hold off chemo until mid Jan. for scar revision to be in place. I started chemo the 16th!  Onco. felt I had less a chance of reinfection on this regiman and no fills until after chemo. It's OK- (at least after one cycle so far) because I have had one 24 hour period that's real bad. Then it's as described the rest of the time except on Thurs  (the day before next treatment) when I feel almost myself!  I think it will all taste so VERY YUMMY when I'm done! At least 10 pounds of yummy I'm thinking! Ellen ",
      "MessageIndex": 1014,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 4, 2009 03:55PM REKoz wrote: Princess-Your post made me laugh! Only I have an even better one for you. My DSO counts those #'s into yet a more manageable sequence. He used my 12 and broke it down as follows: 1-6, then count backward 6-1. Our \"mind game\" is that magic number 6! I am starting my 6 count backward next Friday!  It does seem that no matter how we are \"counting\" this midpoint has more of a psychological edge to it. I'm sure a lot of it is due to the fact that we are really feeling beaten up just about now. You Jewels ROCK! Loving the burning cancer cap!  On the subject of trips, I just told my Dad that if this ever became terminal, I would not go out feeling this lousy. Said I'd run up all my charge cards and visit all the beautiful places I've ever wanted to see. Credit co's would basically HAVE to write it off- can't get blood from a stone. Then he said that with my luck, I would go to Lourdes and come back cured! Ouch!  Oh would I EVER love a trip, but might not be doable with my daughter's wedding in July. What could be better than being free of chemo and completely \"present\" for one of the most special days of my life? Best wishes for keep on keeping on Jewels! Ellen",
      "MessageIndex": 1433,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 5, 2009 09:51AM REKoz wrote: All I can say is just DITTO all of the above posts re: this emotional roller coaster, the public perception of us going through bc and our own private thoughts. The feelings of needing things from people whether in words or deeds at some times but not at others. How those \"not now\" times can cause a bigger funk through no fault of the giver. How we could NEVER explain to that person why we feel what we do at particular times. And the guilt we feel when we feel offended when one causes an emotional nosedive when their intentions were so good. And the guilt we feel when we are just flat down for the count while the others are shouldering our former \"duties.\" As I've said to those close to me, having this bc is just ALWAYS present. I explain that it's not as if I constantly go into a pity pot and let it depress me. Actually, I rarely do. It's just that this experience is so very POWERFUL on every emotional level and we so often are ruled by the power of it all in ways that we ourselves don't expect. I cannot WAIT to look back and say: \"What a long strange trip it's been!\" Blessings, Ellen",
      "MessageIndex": 1441,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Feb 14, 2009 09:09AM REKoz wrote: Hello Jewels I'm back after round one of three, cycle 2 (of 4.) I am on a different protocol then just about anyone else I have seen here. I'm on Abraxane which is the same as taxotere but does not require steroids because it has a \"natural absorption quality\" unlike taxotere. From all that I've read, that's a good thing because the steroids seem to cause more problems then the chemo. Abraxane is only approved for mets but due to the fact that I have pre existing nerve issues in my hands and I have to work, the dear Oncologist was able to persuade the insurance co. I am also on Carboplatin and Herceptin. The first cycle had me feeling the worst on Mon. and Tues so we shall see what happens this time. Surely I have learned that you can't predict anything as far as treatment goes. I have a Caringbridge website and on Tues. I had written that my hair was intact. That drastically changed on Thurs. and by yesterday I decided that I did not want to be dealing with the emotional and physical mess that was rapidly developing from my head. So, I bit the bullet and went for the shave after chemo. The hairdresser used the longest setting so it is not truly bald per se. About an inch of spikey and OH MY, wayyyy too much gray was hiding under all that thickness! I have 4 brothers (and a sister) and I mentioned that I now look just like my bro's, in all aspects except for from the waist down!  I see the PS on Monday and am anxious to see if he will reconsider his declaration of no fills of the expanders until after chemo. That was his thinking last month after that nasty infection and scar revision. Though now the scars look nice and healed. I would not risk it all just for a few fills but sure would be nice if he was comfortable doing so! Have a wonderful long weekend ladies. I am looking forward to my daughter coming during the week. Lucky her, as a School Social Worker, she gets all the vacations, including the entire summer! We are going to pick out wedding invites and start planning the shower. It surely is a great thing to have in my life now. I just wish I could give it the focus and prominence it would ordinarily get from me. Later Raiders..or more appropriately, fellow warriors! Ellen",
      "MessageIndex": 1152,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Aug 8, 2009 05:26PM REKoz wrote: I had a midlife crisis! After 25 years of marriage (and a good one while it lasted), I failed at making my ex \"the one\" after our 2 girls went off to college. I knew I'd be a mom for my entire life and when the major responsibilities for that stopped, so did our marriage. While out in the open with my midlife \"crisis\" and the need to now find a \"new me\" outside of \"Mom\", he not only continued to see me only as just that, he added a little of his \"fatherly\" behavior to our relationship. He's a very good person who just didn't \"get it.\" Refusing counseling, I do believe in the end, his midlife crisis was worse then mine. He moved to China (for work), met 26 yr old non English speaking Chinese girl and married her! Now he gets all the adoration he needs and once again gets to use all his fatherly skills!! Our girls love him and always will but ask them if they think he has a slight problem giving up his role!!",
      "MessageIndex": 22,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738612",
      "Title": "I Am Getting Divorced Heidi521 wallan"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jan 15, 2009 05:26PM REKoz wrote: Deb- It so blows my mind that such insensative know it alls think their patients will trust them! I am at the tail end of the generation (53) that didn't challange MD's and felt it was a huge step in my personal development to fire the first PS. HUGE HUGE for me and I have chosen to see this as an empowerment growth experience I was so in need of. I will NEVER again let someone touch my body if they show no respect for me as a person. I had to be under anesthesia but my daughter told me I reemed the orig. PS because he brought up smoking right after surgery YET again. I told him I would appreciate him refraining from discussing a past I can do nothing about and told him I was sick of it. Once this infection came and he tortured me that night, he was a goner. He happens to be associated with the medical center of the university I work for and of course my goodbye letter was sent on my work email. Now I will make sure no one at work or at the infusion center never uses him. It's the best I can do to insure no one else has to deal with that superior attitude. I LOVE my oncologist however...a kind, gentle man who has an open door policy anytime I need him. Hopefully, I won't need to use it. 1st chemo tomorrow, I so hope I don't end up in any hospital as I have read about here. I can't take anymore setbacks!  One of our missions here I think is to take care of those that follow us. We must make sure to pass on our experiences that have made this journey so much worse as well as encourage each other along the way. Ellen",
      "MessageIndex": 23,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727106",
      "Title": "Smoking and no masectomy? Deb-from-Ohio anianiau"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "May 30, 2009 04:31AM REKoz wrote: Can anyone help? Tell me tumor markers are not the be all and end all?",
      "MessageIndex": 1,
      "PostDate": "30/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735032",
      "Title": "Finished chemo- Tumor markers up? HELP REKoz LakeArrowheadgirl"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 11, 2009 11:59AM REKoz wrote: I just tripped up on this thread and thought I'd share this link: http://www.aolhealth.com/healthy-living/beauty-skin-care/unsafe-ingredients-products just some more products for us to stay away from. Blessings, Ellen",
      "MessageIndex": 38,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729860",
      "Title": "Cosmetic & Lotions Reneepals rrs"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "REKoz wrote: This seemed to be the most logical forum to post this in, though it could go in others as well. LINKY: http://www.nbcnewyork.com/news/local/Breast-Cancer-Victim-Wins-15M-in-Malpractice-Suit-139125964.html For those of us here, we've obviously dealt with the results of our mammos at least once. God knows how many will have to go through this again. I am going to post this link on my Facebook page and would encourage all FB users to do the same. It's our friends and loved ones not as familiar with this whole process whom I believe would be best served by this story. The bottom line for all of us is to ALWAYS GO WITH YOUR GUT INSTINCT!  It's so easy and quite human when in the face of an impending cancer diagnosis to ignore your inner voice when it conflicts with an MD declaring you cancer free! BMX 11/08, Abraxane/Carbo/x4 1/09 Herceptin until 1/10, Recon w expanders-1st exchange Dec. 09. Revision from 700 Style 20 to 600 Style 45-Oct 10 Dx 10/16/2008, IDC, 1cm, Stage IB, Grade 3, 0/5 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/782516",
      "Title": "A Powerful Precautionary Tale REKoz financegirl"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Jun 6, 2012 02:09PM REKoz wrote: Unless I am reading this wrong two thoughts immediately come to mind. The first is that this post does not belong in this forum but rather \"Not diagnosed but concerned About Metastasis.\" I can surely understand how this mistake may occur and because it happened so often, the forum mentioned above was created. I'm not on here often anymore. When I am, I scroll \"Active Topics\" and thus arrived here. It's even a little uncomfortable posting a response so I hope this gets moved. Thought #2: This thread is a tad difficult to follow and please correct me if I'm wrong Sallyyy. I'm assuming you had a PET sometime after Nov. diagnosis of Stage 1 HER2+, finished your chemo and are now continuing with Herceptin only for the rest of the year? That PET showed lung nodules too small to biopsy and you're concerned that they may be cancer as well? If that's correct, then I can share my experience because my stats are identical. One person responded accurately that under these circumstances, you're Onc. will want to rescan to see if they grow or change in any way. Also spot on was the comment that this is very common (though unknown) among the population in general. We know because we have PET scans and it can be due to all sorts of benign reasons (past pneumonia, infection, allergies etc. etc.) I am scanned annually now to monitor several lung nodules and they have remained unchanged since my first scan in late '08. If you look around the site, you will find many like us with benign nodules. This is not to say that it couldn't possibly be worse, but the odds are in your favor- particularly since your nodes were clear.    My Oncologist never recommended staying on chemo longer! I'm surprised at that suggestion since I've never seen (on here or read about) an early stager with unspecified lung nodules to continue on prolonged chemo!  I'm thinking if it wasn't me misinterpreting, then those who suggested that course have. They may have assumed you are Stage 4 because that is where you posted.  That's an altogether different situation....  ",
      "MessageIndex": 25,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787979",
      "Title": "Lung mets sallyyy Cydz"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Dec 12, 2010 04:31PM REKoz wrote: Me (raising hand)!  I actually had 2 papillomas each in a different quadrant of the breast. Unfortunately, I also had IDC in yet another quadrant. I was told that though not cancerous, the papillomas had to be removed as sometimes they can become cancer. Lumpectomy was not an option for me as I was very small breasted and would be left with nothing. Just want to prepare you. Yes, a papilloma is infinitely better than cancer, but you may be looking at having to have it taken out. My best wishes for a positive outcome. Ellen",
      "MessageIndex": 5,
      "PostDate": "12/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/761893",
      "Title": "Intraductal Papilloma? 3LittleMonkeys 3LittleMonkeys"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "REKoz wrote: I just finished chemo early May after a bilateral mx for a 1.2 tumor- no nodes. Got home from work yesterday and there was a message from my Onc. I saw him last week for the after chemo visit and he told me my tumor markers were slightly up! I hadn't made an appt yet for the PET scan he ordered but will now certainly be doing that on Monday. He did say that there are non cancer related issues that could cause the markers to go up but I just need encouragement from my sisters here. Never paid much attention to my numbers unless there was an issue and this is one I was definitely not expecting. Damn! I had no qualms about my after chemo PET and now I'm freaking! Tumor was removed with complete margins. There was a node in my lung that was not cancer but now I'm thinking maybe it is...Could someone help ease this rampant mind going to all these dark places? I was so ready to move on from this! Any calming words would be most appreciated. xoEllen BMX 11/08, Abraxane/Carbo/x4 1/09 Herceptin until 1/10, Recon w expanders-1st exchange Dec. 09. Revision from 700 Style 20 to 600 Style 45-Oct 10 Dx 10/16/2008, IDC, 1cm, Stage IB, Grade 3, 0/5 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735032",
      "Title": "Finished chemo- Tumor markers up? HELP REKoz LakeArrowheadgirl"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Apr 11, 2011 10:55AM REKoz wrote: Hi Jane- If your mouth is sore now (I had forgotten that one...sorry!), I'd recommend you get Biotene toothpaste and mouth wash. Also, stay as hydrated as you possibly can. Congrats on getting two treatments out of the way...the only way I could mentally get by sometimes was to keep my eye on how many I had done rather than how many I had left! You will most likely get more fatigued as tx's mount. So try to get anything you need to get done asap. By the end, you will probably truly know the meaning of couch potato! My best to you! Ellen",
      "MessageIndex": 6,
      "PostDate": "11/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/766661",
      "Title": "Experience with Abraxane? sweetcorn sweetcorn"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "May 3, 2009 07:47PM REKoz wrote: I love what you wrote! Brought tears to my eyes. HARDY congrats to you! You represent all of us.",
      "MessageIndex": 6,
      "PostDate": "03/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/733575",
      "Title": "breast cancer didn't win today everyminute everyminute"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Nov 12, 2009 04:03PM REKoz wrote: I'm sorry you're feeling sad as well. It's been a year since my surgery (I also had a post op infection) and I am still undergoing recon. Although I can't claim to have not lost it before surgery, I have found this a process similar to grief (and no wonder, grief is certainly warranted!) Though I have been much better since chemo ended, I find my sadness comes in waves and sometimes out of nowhere. From surgery through chemo, those waves would lead to crying spells. Now when they come, I just get depressed. I don't dwell and try to look at the reality that it could be much worse. But losing a chunk of the carefree person I was does get me down. I miss the old me and am still finding a comfort level with the new me. If I've learned anything at all, it's definitely the fact that I've given myself permission to accept whatever I feel at any given time. Good luck to you!",
      "MessageIndex": 2,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743773",
      "Title": "Been handling this ... until today cka0706 kel1"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Oct 24, 2009 08:44AM REKoz wrote: Dear Lifeisbeautiful- At this time last year, I was exactly where you are. Not procedure wise (I had a double mx) but most certainly mentally. It's a place we ALL have been and you would be hard pressed to find someone who didn't say this is the worst stage in the whole process. You are in shock and just overwrought with fear. While I won't go so far as to say it get's easy from here, I will say that you WILL come back to reality and do what you must with some sense of acceptance.Knowledge is power!! I did not find this site until after my surgery but before chemo. It helped me beyond words to learn about chemo (and SO much more), get support,reassurance and yes, love from my fellow travelers.  So in that respect, you are fortunate to be here from the get go. I know for me, there has never been a more frightening or \"feeling alone\" experience in my life then when first diagnosed. By being here, you WILL discover that you are indeed not alone and the support you will receive will be huge in helping you deal with fear. I'm sorry I cannot address your specific questions, but more info is needed to answer them. There's a stage 2 and a grade 2 (which on a 1-3 scale defines particular characteristics of the cancer and it's aggressiveness). Do you have a biopsy report to refer to? Anyway, I just wanted to chime in and lend my support in this oh so very traumatic time. You WILL get through this, just keep putting one foot in front of the other. And if you are a person of faith, you will find that extremely helpful as well. Blessings to you.",
      "MessageIndex": 3,
      "PostDate": "24/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742686",
      "Title": "Pathology Is Back - Cancer Lifeisbeautiful jenn3"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Mar 27, 2011 11:16AM REKoz wrote: Hi Jane- Sorry you haven't received any replies yet. I believe that's because Abraxane is not commonly given to us early stagers thereby making it difficult to find someone in a similar position to share their experience. At least that's what I found while I was going through my chemo cocktail of Abraxane and Carboplatin (along with Herceptin for HER2+). My feeling is that we are in the very fortunate minority. It is very expensive and not easy to get through insurance approval at stage 1.  My scientific knowledge is FAR from stellar but because of it's chemical make up, Abraxane does not require having to take Neulasta or Decatron.  From all that I have gleaned from our sisters here, they can be as difficult as the chemo itself. If you read up on it, you'll see it has something to do with not having the chemical compounds that add to the SE's of the other taxanes. This is why it is considered a more \"gentle\" chemo according to my Onc. He pushed it through for me due to pre existing neuropathy issues as well as my need to return to work during chemo. Now for your $10,000 question...how did I make out on it? Not bad in comparison to the other Taxane ladies I believe. Of course everyone is different and chemo in any form is not- as they say- \"a walk in the park.\" My hair did begin to fall out in clumps. I shaved it before it got to be too much and the scalp relief was instantaneous! The Zofran which worked early on for nausea was not good enough as I progressed. I HIGHLY recommend asking for Emend asap if you find this the case for you. I suffered needlessly because I waited. And there was fatigue- also more prominent as I went along. While not SE free by any means, reading the SE experiences of ladies on other chemo protocols did always give me reason to believe it could be worse. I had to delay my last chemo due to low blood counts. They came back to acceptable range the following week which put me 2 weeks out from my next surgery. In order to insure my counts were good for that, my Onc. dropped the Carbo from my last chemo. Interestingly enough, my SE's were far more tolerable. I'm thinking that means that the Abraxane was the more gentle drug. I do hope this dissertation was of some help to you. Wishing you all the best as you go through treatment!!  I pop on this board often so please don't hesitate to reach out if you need to. Ellen",
      "MessageIndex": 1,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/766661",
      "Title": "Experience with Abraxane? sweetcorn sweetcorn"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Sep 21, 2012 12:50PM REKoz wrote: Hello Kelpie- My chemo \"cocktail\" was Abraxane, Carboplatin and Herceptin.  I did 4 rounds of the first two and the usual year of Herceptin.  Finished everything in Jan. 2010. I am really grateful that I was able to get Abraxane rather than Taxotere as an early stager. Whether it was the Abraxane itself or due to not having to have the pre meds (steriods), I seemed to do better side effect wise than my Taxotere sisters. Hoping the same holds true for you!  Best, Ellen",
      "MessageIndex": 1,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/793848",
      "Title": "Combinations with Abraxane ?? KelpieAU REKoz"
    },
    {
      "AuthorID": "REKoz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77172/profile",
      "Content": "Sep 22, 2012 07:35AM REKoz wrote: Like marywh, I was 3 weeks on and one off. It was set up that way with the idea that it would produce the minimum amount of side effects and thus enable me to keep working. As is usually the case, the further along I got, the harder it was to do that. Moving from Zofran to Emend was a Godsend as far as the nausea. It made all the difference not feeling so sick-anything else was tolerable. I did end up taking more time off from work because I did become a vacant zombie like slug... Kelpie- What is your drug combo and protocol?  My experience is that you are entirely correct regarding what other chemo you have with Abraxane.  When I went in for my last chemo, my counts were not good and I was scheduled for a recon procedure a few weeks later. To enable that to happen, my Onc. left out the carbo for my last treatment. I felt infinitely better without it and am convinced that was the drug that gave me the most problems.",
      "MessageIndex": 4,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/793848",
      "Title": "Combinations with Abraxane ?? KelpieAU REKoz"
    }
  ]
}