{
  "AuthorID": "reneeromer",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
  "Posts": [
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 30, 2017 03:04PM reneeromer wrote: My biopsy was last wednesday (5/24). I had the ultrasound core type. They told me about 7 business days until I hear something. My honeymoon is scheduled for next week. I can't even look forward to it. Such a bummer. I'm glad you're getting everything in one day. Are you sure you'll have to have everything done? I hope they have a look-see and you don't have to get the biopsy. Fingers crossed for you!!  Rebamacfan, Thanks for your comment! It really helps when you connect with others sharing the same fears and experiences. I went and bought 4 dresses today. It took my mind off of the waiting for a little bit. I just want to know so that I can start fighting or be a rock for those fighting. This experience has changed my life.  xoxo",
      "MessageIndex": 4,
      "PostDate": "30/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855624",
      "Title": "Newbie here, 👋 Stormborn djmammo"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 30, 2017 02:24PM reneeromer wrote: Stormborn, Your experience is so close to mine. I recently lost weight and had a pain in my right breast all day a few weeks ago. I felt where the pain was and sure enough there was a lump. I already had a referral to get a mammogram so I scheduled it the next day letting them know I had felt a lump.They said they couldn't see me until JUNE 5th!! I asked if they had other facilities they could send me to and they found an earlier appointment somewhere else. When there, they focused on the lump. As soon as the mammogram was done, they had me wait for the Radiologist to look at it. I was then sent in to ultrasound. After that, I had to go talk to the Radiologist. She told me that the lump was moderately suspicious and that I needed a biopsy. I was scheduled two days later. And here I am today... waiting for the results. It's not easy. Many scenarios go through your head. But see if there's somewhere else you can go. THE WAITING IS THE WORST!! Crossing my fingers that all will be good for you!!! We are here!!",
      "MessageIndex": 1,
      "PostDate": "30/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855624",
      "Title": "Newbie here, 👋 Stormborn djmammo"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 30, 2017 03:49PM reneeromer wrote: I'm in California... nowhere near as pretty as where you are! I am hoping that you don't even have to do the biopsy. They checked my lymph nodes and those were clear so I am grateful for that. I get a sick feeling when I picture my doctor's number pop up on my phone. I guess that's how everyone feels at some point. I will take your advice and relax on my trip and I definitely will book another one! Something to look forward to is always good. I'm such an impatient person that on top of waiting for the call, I want the whole ordeal to be over. I want you to think good thoughts. I know it's tough and I need to follow my own advice... but we are strong!! I'm here for you!! xoxo",
      "MessageIndex": 7,
      "PostDate": "30/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855624",
      "Title": "Newbie here, 👋 Stormborn djmammo"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 23, 2017 09:43PM reneeromer wrote: I just found a lump about 2 weeks ago. Sounds similar to yours and the same location. I had a mammogram and ultrasound yesterday and have to go in for biopsy tomorrow. The radiologist said it's of moderate suspicion and my lymph nodes are fine but I'm still scared of the results. I know it's not an easy thing to do... but go, please.",
      "MessageIndex": 9,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855313",
      "Title": "Found a lump concerned Missvan Kicks"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "reneeromer wrote: This Post was deleted by reneeromer. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855410",
      "Title": "Biopsy today. Everything seems so surreal. reneeromer reneeromer"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "Apr 20, 2018 06:01AM reneeromer wrote: Hello, I returned to this website because a year ago on May 2, I found a large lump in my right breast. My first thought was, \"Here we go\". I knew it was going to be an ordeal. I spent 2 months wondering about my diagnosis because although it was deemed benign, they needed to take it out to make sure. Anyway, I know how you are feeling. The best part of your day is when you wake, before you remember what's going on in your life, right? That was the best part of my day, at least. Well, all ended up being ok. I have two large scars and my breast is smaller now but I was spared the \"C\" word. I spent my time worrying, crying, preparing. However, if it happens to me again... I will spend time NOT worrying, NOT crying or preparing, but with the attitude that everything NEEDS to be and can be ok. I know it's easy for me to say... now. But you will be so much stronger after this. You'll be proud of yourself that you got through it and that you will be able to relate to all these women who need our words of encouragement. This was my saving grace... this site. I may not get to wear the pink ribbon for myself... but I know how it feels to be on the brink of being able to. I will wear it for all the women who need my support and love. I hope all goes well!!! My thoughts are with you!! Hugs!!!! Renee",
      "MessageIndex": 5,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864076",
      "Title": "Waiting on Biopsy Results JoyMrt5 Blondlady"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 23, 2017 02:32PM reneeromer wrote: I thought about going to my car last night and letting it all out but I didn't. The house will be quieter tonight. I do need to let it all out. The lump in my throat must be visible by now haha. Thank you gb2115.",
      "MessageIndex": 3,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 24, 2017 12:50PM reneeromer wrote: MTwoman, Thank you. I will take your advice. It was such a peaceful moment and it made me smile. Sending you a hug for replying to me :)  LoveT, Thank you so much. You will also be in my thoughts and prayers for good news. You all make this so much more bearable. xoxo",
      "MessageIndex": 9,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 24, 2017 10:44PM reneeromer wrote: MJ, Yes, this is a wonderful group! My hummingbird is your hummingbird! Thank you for your kind words! I have 3 children that need me but I have been praying to god to let me meet and spoil my grandchildren. Whenever that may be! It's all so surreal to me, still. Thank you again... big hugs!!!!",
      "MessageIndex": 14,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 25, 2017 03:50PM reneeromer wrote: Gb2115 About 7 days.",
      "MessageIndex": 21,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 24, 2017 11:51AM reneeromer wrote: Thank you for your replies! My appointment is in a few hours. Yesterday I was crying in my car and I looked over and there was a hummingbird about 12 inches from my face just staring at me. It stayed there for a good 10 seconds, flew away, then came back and did the same thing. Grasping at straws, but it was almost a religious experience for me. I'm so nervous but appreciate you giving me words of encouragement. It really feels like you're the only person on the planet sometimes. Love to all. R",
      "MessageIndex": 6,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 24, 2017 01:37PM reneeromer wrote: Knitpig, Thank you!! I will definitely keep you updated. You've been my only outlet! xoxo",
      "MessageIndex": 11,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 31, 2017 03:46PM reneeromer wrote: Hi pennychild, Oh my gosh, I am hoping and praying you get good news!!!!!!! It's awful, isn't it? I can't take my mind off of it. And now I'm going to rally for you, too!! I have pain here and there... letting me know \"it's there\". The entry site looks kinda bad. I hope it's not as bad under the tape. I have bruising about the size of my palm still. I had my biopsy a day before you did. I hope I don't have to wait longer than this week for results. Good vibes for you pennychild!!!! Renee",
      "MessageIndex": 27,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 24, 2017 05:40PM reneeromer wrote: I just had my biopsy done a few hours ago and just got home. For the most part it didn't hurt. Mostly just a feeling of pressure. The worst part for me is just being scared of the results. The feeling in the room with the dr. And nurses was light and comfy. She explained everything she was doing while it was happening. Now the waiting game begins. For me and most.... torture. I hope your results come back just fine! You'll be in my thoughts!",
      "MessageIndex": 3,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855443",
      "Title": "Biopsy/ultrasound scheduled...worried Gdeann reneeromer"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "reneeromer wrote: Hello and thanks to those who contribute to this great site! I am a 44 year old Mom. Just got re-married and am about to go on my honeymoon (June 8). I had been feeling pain in my right breast off and on for a few months but I had an iud and thought that it might be just a side effect from a non-existent period or hormonal. I recently lost about 10 lbs and noticed my breasts were less dense. So I felt where the pain was and noticed a lump. Great. I had just gotten a physical early April and my doctor didn't feel any lumps (or missed it), but wanted me to get a mammogram anyway. Since I already had the referral, I called and made an appointment and let them know that I felt a lump. Got in right away. They did a mammogram and ultrasound. Scary, scary, scary. The radiologist called me in to discuss. I saw a dark mass, oblong, looked huge to me. She said between low, moderate, and highly suspicious, that mine was moderately suspicious. She said not to think cancer. I don't know if that was to ease my nerves but she also said that my lymph nodes were clear so that is a good thing. I go for my biopsy tomorrow. My emotions are all over the place. I'm prepared to hear the worst when the results come back but I am so scared as well. Trying to get through the day is tough. Trying to not cry is hard. Trying to act normal is torture. Anyone have a similar story or words of encouragement? Thank you in advance oxox Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 25, 2017 02:35PM reneeromer wrote: LoveT, I'm here for you! Keep your pretty little head up and positive thoughts every single minute of the day! Can't wait til we can put this behind us! MTwoman, your comments mean the world! JungChic, thank you! I know that thinking positive is important. I think I'm finally getting up from the initial \"gut punch\". Day by day! Tpralph, thank you for the positivity! I'm going to try and enjoy this pretty day",
      "MessageIndex": 19,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 31, 2017 12:52PM reneeromer wrote: Hello All, The waiting game is excruciating. Everyone is on pins and needles. I have been trying to stay busy but I know I am going to cringe when my doctors number shows up on my phone. My honeymoon trip to Cancun is next week and I haven't even done anything to prepare for it. This is a surreal experience. My biopsy site is finally looking better. The bruising was incredible! I take the tapes off today. I'm rambling. I'm sorry. I'm just scared and anxious. xoxo",
      "MessageIndex": 24,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    },
    {
      "AuthorID": "reneeromer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252751/profile",
      "Content": "May 24, 2017 07:44PM reneeromer wrote: all done guys. Now the waiting game begins. You were all in the room with me today. Thank you!",
      "MessageIndex": 12,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855381",
      "Title": "Biopsy tomorrow... sick to my stomach reneeromer MTwoman"
    }
  ]
}