{
  "AuthorID": "renee1008",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86817/profile",
  "Posts": [
    {
      "AuthorID": "renee1008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86817/profile",
      "Content": "Aug 15, 2009 09:35AM - edited Oct 13, 2009 08:56AM by renee1008 I'm sorry your mom and your family have to go thru this, but like she said not only is it treatable, it is curable.  I was dx last Oct.  I was 47 and have a 20 year old daughter.  My onc told me that 10 years younger than I was at dx is when my daughter should start mammos.  So, at 37, she will have her first.  The hardest part for me was telling people, so I know how she feels.  I didn't want to be anything less to anyone.  I pretty much kept up my normal routine.  I only missed work the day of treatments.  I had a lumpectomy, chemo and radiation.  Chemo was my choice, for peace of mind.  I was right in the middle of the chart as far as recurrence.  So, for 4 treatments, that now days are not so bad, it was well worth it.  Talk all you need to, ask any question you can think of.  Your mom sounds like she has a good attitude.  She needs to keep it up, and everyone around her.  Waiting is so hard.  I'm sure she is very anxious.  When she meets with onc and gets a plan, she will be better.  I'll pray for you and your family.  That's the main thing that go me thru my ordeal, and helps me still, every day.\\ --Renee",
      "MessageIndex": 1,
      "PostDate": "15/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738989",
      "Title": "My mom was just diagnosed mstxrn22 mstxrn22"
    },
    {
      "AuthorID": "renee1008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86817/profile",
      "Content": "Aug 13, 2009 09:32AM renee1008 wrote: Hello. I finished chemo March 12 and my hair is just now enough to feel comfortable going without my wig...(still not to work though).  I've always had blonde, fairly straight hair, but it's coming back dark brownish-black and very curly.  I've heard that it takes about a year or more for the curls to relax.  I don't know if that's just from the weight of your hair, or if it changes back.  I'm having major hot flashes too, so I'll probably keep a short style for awhile.  Also, the past few weeks (when it started curling) my scalp is so tender.  It hurts like it did when my hair came out.  Is that normal? --Renee",
      "MessageIndex": 3058,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "renee1008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86817/profile",
      "Content": "Mar 29, 2010 04:01PM renee1008 wrote: Hello Ladies, I don't post often but keep up with you (or try to...) and take in all the unspoken advise.  I was a natural blonde with fairly straight hair (a little wave).  It came back dark brown and very, very curly.  My hair has always grown very slowly.  I didn't start taking Biotin until after going topless (wore a wig for 7 months) I just recently had my first hair cut (I cut all the kinky curls off) and am really liking the short cut.  I always wore it shoulder length before.  Since I like the short style I'm thinking about not taking biotin any longer.  Does it just grow length or does it make it thicker?  If it will thicken up I want to continue taking it, but if it just grows the existing hair longer, I don't know.  I can't believe after all the waiting for hair, that I'm even concerned about it growing longer...",
      "MessageIndex": 4926,
      "PostDate": "29/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "renee1008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86817/profile",
      "Content": "Jul 21, 2009 04:04PM renee1008 wrote: Hello all. I finished chemo mid-March and mid-May could see some color and a faint hair line. Now, it's about 1/2\" to 3/4\". Not growing very fast. The top and crown is thickest, with the sides still pretty thin. The color is like a no-color; not black, not brown, not gray...just somewhere in between. My eyelashes and eyebrows are very thin. I started using LiLash a week ago. Anyone with good results from using it? --Renee",
      "MessageIndex": 2880,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "renee1008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86817/profile",
      "Content": "renee1008 wrote: I had lumpectomy Nov 08.  At 2 week post op I was told I had an alergic reaction to the radioactive injection to locate sentinel node.  My breast was red, blue, swollen and had a hard knot the size of the palm of my hand.  It's been 8 months and the coloring is much better, and it's about an inch in size.  It's still somewhat sore.  Just wondering if anyone has experience this, and how long it takes to fully clear up? Dx 10/23/2008, IDC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2- Surgery 11/11/2008 Lumpectomy: Right; Lymph node removal: Right, Sentinel Chemotherapy 1/7/2009 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 4/16/2009 Breast Hormonal Therapy 5/14/2009 Aromasin (exemestane) Surgery 11/11/2010 Prophylactic ovary removal Surgery 10/10/2014 Prophylactic mastectomy: Left, Right; Reconstruction (left): Latissimus dorsi flap, Nipple reconstruction; Reconstruction (right): Latissimus dorsi flap, Nipple reconstruction Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737749",
      "Title": "Alergic Reaction to Radioactive Injection renee1008 renee1008"
    },
    {
      "AuthorID": "renee1008",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86817/profile",
      "Content": "Aug 10, 2009 03:52PM renee1008 wrote: Hello all. My oncotype score was right in the middle of the chart....24. One # either way and my onc would have said either yes or no.  I went into her office as scared of the word \"chemo\" as I was \"cancer\". I was so hoping she wouldn't recommend chemo, but before I left her office I was afraid she wouldn't let me do chemo.  I say fight it with all you've got.  I can say I did everything I could do, and for me, peace of mind, was well worth it.  I did 4 x taxotere and cytoxan.  No nausea.  I, too, could have slept thru treatments if it weren't for the nice people there to talk to during them.  I'm 22 weeks out from chemo and 14 from radiation.  My hair's coming in...black and curly...and I'm naturally blonde with straight hair.  I'm begining to feel like \"me\" again.  Praying for you all.",
      "MessageIndex": 36,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738514",
      "Title": "31 yrs. Old Struggling to decide on Chemo yasminv1 yasminv1"
    }
  ]
}