{
  "AuthorID": "resaz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97215/profile",
  "Posts": [
    {
      "AuthorID": "resaz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97215/profile",
      "Content": "Feb 9, 2010 09:28PM resaz wrote: Thank you Tara! I am supposed to meet with a breast surgeon next wednesday.  After the radiologist who did another test on the discharge said that it did contain blood, my doctor called and said that I needed to see a surgeon.  He said it didn't mean that I would have to have surgery but that that's where I needed to go.  I guess from what I understand about even a papilloma, they will take it out.  If that's indeed the case then why even do a ductogram??  Seems a bit over the top if it's just going to be taken out anyway for them to examine. Unless there is some unknown to me condition that causes bleeding that will not need to be removed but I haven't found anything that causes bleeding in the duct that is not removed. I'm trying to focus on it all being fine b/c I know that there is really nothing I can do anyway until I have the answers.  I just want to be as educated about it all as possible so I know what to ask.... Thanks again for taking the time to reply, I really appreciate it!!  Res",
      "MessageIndex": 2,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/748084",
      "Title": "intraductal papilloma/DCIS resaz neochiq"
    },
    {
      "AuthorID": "resaz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97215/profile",
      "Content": "resaz wrote: Has anyone out there been reassured that the bloody nipple discharge is an intraductal papilloma only to find out it's more? Like DCIS?  Did you have a nipple smear or a ductogram and did they tell you anything?  If you have bleeding from your nipple--will they leave it or remove it  anyway?  do you have to have these tests if they are going to take out the duct anyway?  All this waiting is hard....not knowing but knowing that something is not right.... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/748084",
      "Title": "intraductal papilloma/DCIS resaz neochiq"
    }
  ]
}