{
  "AuthorID": "revkat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
  "Posts": [
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Dec 13, 2010 04:43PM revkat wrote: Wow, I went googling and you all are right. Sorry to question you, but 3 to possibly 6 percent seems so high! That's a lot for such a significant side effect. And when I had TC it wasn't mentioned in any of the material on side effects that I received (I checked). So if 10,000 women have Taxotere then 300 to 600 become permanently bald? I wonder if they did include very thin hair in that (not that it's much better), I also wonder if there are any studies to predict who is most at risk (not that risk predictors have worked well for me on this bc experience.) Just wow. ",
      "MessageIndex": 17,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 20, 2010 03:56PM revkat wrote: Thank you so much for posting these. My LE is fairly mild so I often can't see a difference (but can feel it) but when I posed like your pictures I noticed the swelling around my thumb that I hadn't before. So I can keep track of that as a \"sign\" of when things need to be taken care of.  It's good to have pictures somewhere between normal and the \"worst case\" things the PT showed me (I think to scare me into being compliant with treatment. It worked.)",
      "MessageIndex": 1,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751566",
      "Title": "VISIBLE SIGNS OF LYMPHEDEMA - A PICTORIAL LindaLou53 glennie19"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Dec 13, 2010 07:35AM revkat wrote: I just don't think 10% can be right, or even 3%. If that were true one in ten women would be permanently bald from TC and that certainly isn't happening on this board. I thought it was more like a tiny fraction of one percent. Otter? Have you seen any research?",
      "MessageIndex": 13,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 8, 2009 02:14PM revkat wrote: But Kira, she didn't tell women to throw caution to the wind, she \"guessed that we would see women start questioning all the rules\". She didn't tell them to disregard the rules. And I think it is appropriate to question. Lots of people don't take any precautions and never get LE. Some people take all the precautions and still get LE. Some people don't take precautions and get LE. It is worth asking why and whether the precautions we are currently given have any relationship to preventing LE (I'm going to say they have relevance to living with LE, but my evidence would be anecdotal -- just my own experience.)",
      "MessageIndex": 47,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/741383",
      "Title": "Susan Love proclaims no need for lymphedema risk reductions kira TammyLou"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Dec 15, 2008 09:24PM revkat wrote: Thanks for the clear critique of that article, Otter. When I was reading it I was thinking that 5% seemed like a significant number, as well! And then it turns out that it's much higher than 5%. Having been in the bad luck side of things on getting this bc (one bc risk calculator put me at around a 1.5% risk for getting it, hah!) it seems like wearing a compression sleeve and gauntlet is a small thing to do to keep that % down closer to 0.",
      "MessageIndex": 3,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/725862",
      "Title": "lymphedema and air travel suzmarks amygil81"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 8, 2009 01:29PM revkat wrote: Everytime I read the title of this thread I am annoyed. Dr. Love did not say there is no need for LE risk reductions, she said that women will continue to push the limits. And we may discover that some of what we have been told actually does reduce risk, and some of it is not needed. And because it would be really hard to fill a study with people willing to intentionally be exposed to the risk of LE, new information may well come because of people pushing the current limits. I was following all the rules and I developed LE very shortly after radiation with no obvious trigger. I think it has way more to do with our underlying lymph system than what we do with our arms. HOWEVER, once you have LE and know that your system is compromised it makes a lot of sense to avoid anything that could lead to cellulitis and to manage the swelling as best you can. I found the study about weightlifting empowering. I hated the thought that I wasn't supposed to lift anything more than 5 lbs for the rest of my life. I couldn't find a specialized trainer (admittedly I didn't look too hard) but I took in the method section of the study and talked with a trainer at my gym and we put together a slow, gentle program. I wear my sleeve and I monitor my swelling and other symptoms. On days I lift I make sure to wear my jovi pak at night. I feel much better knowing that picking up a baby is something that I can do, not something that will hurt my arm. I really wonder if you can \"ward off\" LE, or if you are going to get it you just will no matter what. But there is a big difference between trying to prevent it and dealing with it once you have it. And a difference between people with mild and moderate and severe LE. So, once again on this BC journey we have to work out what works for each of us.",
      "MessageIndex": 45,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/741383",
      "Title": "Susan Love proclaims no need for lymphedema risk reductions kira TammyLou"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 12, 2010 09:29AM revkat wrote: My liver enzymes have been all over the place too. During chemo they went way high, resulting in delaying one treatment a week. During that week they came down by half and then they never went that high again even with more chemo. During the last year they have gone up and down like a yo-yo, but an ultrasound of my liver showed no damage or disease. Go figure. I've about decided that mine are very sensitive to exercise! (strenuous exercise can raise them). Keeping an eye on them sounds like a good plan, but I'd let the doctor do any worrying at this point. ",
      "MessageIndex": 2,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/754004",
      "Title": "Elevated Liver Enzymes jdootoo weety"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jan 22, 2011 06:37PM revkat wrote: I was told I had a small <1cm, grade 1, stage one cancer too. That was before surgery. To everyone's surprise, it was 2 cm, grade 2 and there was a 1 cm tumor in the sentinel node. Stage 2. You really can't know for sure until it is out. Your doctor is recommending mx because of your history and knowing that you are rejecting radiation. You can go with a lumpectomy, but if I were you, I would try to get mentally prepared to have to change plans following that surgery if anything unexpected is discovered.",
      "MessageIndex": 16,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Nov 6, 2010 04:34AM revkat wrote: I had an abdominal CT scan at diagnosis but nothing as part of follow up. No scans unless I start reporting symptoms or my blood works goes seriously wacky. I have had roller coaster liver enzymes and my onco was going to order a CT scan to check it out, but when I asked if that would give more info than an ultrasound she happily changed to order to an ultrasound (all clear). If/when your onco wants to do a scan, you can always ask if a cheaper procedure would provide the same info.",
      "MessageIndex": 8,
      "PostDate": "06/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/760370",
      "Title": "Stage II ladies, how often do you get PET/CT scans? Fearless_One jan508"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Feb 18, 2009 07:25AM revkat wrote: Try searching for \"cording\". That's what we call it, though I've had several medical prof. ask me what I mean when I used that term. Axillary Web Syndrome may be the technical term, though when I read about that it seems a little different than just the one wire down my arm. I'm a year out now, and I can't remember how long it took to resolve. What I do remember is that the came and went. I'd be all stretched out and feeling good about my range of motion and then I'd reach for something and ouch, there was this string holding my arm tight. But I haven't had one in a long, long time now. Mostly I did gentle stretching and massaging along it. Not sure if that made a difference or not, but it made me feel better!",
      "MessageIndex": 3,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729271",
      "Title": "rope-like cord in my arm after SNB/lumpectomy Macchick kira"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 13, 2009 07:54PM revkat wrote: If your tumor was estrogen positive and Her2 negative and you are postmenapausal, the Oncotype DX test will give you good information regarding the effectiveness of chemo for your cancer. If you are Her2 positive you will want herceptin and that is currently always given with some kind of chemo. If you are estrogen negative you will need chemo because hormonal treatments are not available to you as an alternative way to control any cancer cells that have escaped from the tumor. If you are premenapausal the Oncotype could still be helpful, but the company that makes it doesn't stand behind it yet since not enough research has been done, and your insurance company may not pay for it ($3000). Also, in the US it would be a rare thing (though I think there is someone on these boards who was this rare occurrence) for an oncologist to suggest skipping chemo if the cancer had spread to your lymph nodes.",
      "MessageIndex": 2,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/734143",
      "Title": "Positive node but no chemo MED swimangel72"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 13, 2010 01:07PM revkat wrote: Fascinating how few posts the posters on this thread have. Just saying. Social media marking is an insidious thing. I know, my daughter is in the field.",
      "MessageIndex": 11,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/753092",
      "Title": "Cancer Centers of America?? catwood revkat"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jan 17, 2009 11:23PM revkat wrote: A spiculated mass flips the odds that the lump will be cancerous from the 80% benign -- 20 % cancer to 80% cancer -- 20% benign. But that still is a significant chunk of them that turn out benign. Lori gave a good overview of what happens now. Best of luck to you and hope for a good outcome.",
      "MessageIndex": 4,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727544",
      "Title": "Spiculated Mass joanmac52 Moderators"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Nov 25, 2008 08:26AM revkat wrote: I have been told I have dense breasts several times, but they were able to see my tumor on a mammo, so I don't know how dense. Still, I could ask forever, but my HMO is not going to approve a breast MRI unless I meet the guidelines Otter posted above. And getting one on my own would mean not just paying for the test, but finding a doctor outside my HMO who would order it, paying him/her, and then paying for the test. What I don't get is that we have all this anecdotal evidence here of women whose tumors, or additional tumors, were found on an MRI, but the studies still aren't showing an overall benefit for using MRIs for dense breasts. What's that about? Does the treatment we recieve take care of those additional tumors when they aren't discovered? Or are they the kind that a recent article in the NYTimes says \"just disappear\"?",
      "MessageIndex": 21,
      "PostDate": "25/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724857",
      "Title": "Dense Breasts Ask for MRI Aug242007 Beesie"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Nov 9, 2010 06:59PM revkat wrote: Jane, there are women who have gotten LE without lymph node dissection, even without sentinel node biopsy. Although a change in surgical process may reduce the number of women with LE, it won't eliminate the condition. So, don't waste your anti-treatment rants on us, ok?",
      "MessageIndex": 21,
      "PostDate": "09/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/760515",
      "Title": "WooHoo - Washington Post Article on LE! NatsFan otter"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 7, 2008 02:52PM revkat wrote: Oh my gosh, I have to renew my driver's license in a few months. I never thought about having an ID photo taken while bald. Ack. Hopefully the few tiny little stubbles I have (4 weeks since last treatment) will be somewhat hairlike by then. . .",
      "MessageIndex": 55,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708370",
      "Title": "What I hate MOST about being bald! HeatherBLocklear dhettish"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Nov 9, 2010 07:11PM revkat wrote: The article the OP posted is about LE. Eliminating lymph node dissection may reduce the incidence of LE (or not, it would need to be studied) but it wouldn't eliminate it. As you would know if you had read the article. But I don't think you have LE, do you? How have you treated your cancer, given that you don't see benefit in chemo or hormonal treatments, as you have made so clear on other threads? The OP was pointing out that the LE activists on this board have done a great thing getting a major newspaper to do a story on LE. You are using that for your own, ill informed, purposes. Good job, women!",
      "MessageIndex": 23,
      "PostDate": "09/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/760515",
      "Title": "WooHoo - Washington Post Article on LE! NatsFan otter"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 30, 2011 02:07PM revkat wrote: Suzybelle, I am so sorry. I get sick of this and my LE is only mild. But I still get sick of the sleeve (and am totally bummed to have read the the lymphediva sleeves aren't long enough for those of us with gorilla arms). And I really get sick of the constant, if mild, ache in my shoulder/arm/side, because it alwasy reminds me of cancer/surgery/LE. As far as swimsuits go, being a tad older than you, I am happy with a one piece tyr fitness type suit. I like to think that I just look like my 20 year old daughter who is a competitive swimmer and has a very flat (due to genetics and being slim) chest. So I wear that with a floaty sheer cover up and call things good. And as far as the sales clerk, well she asked for it! You gave a brief polite answer and if it wasn't enough for her she deserves to feel squirmy! I hope you get a cool evening with people you enjoy. ",
      "MessageIndex": 2,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/769651",
      "Title": "So sick of this. Suzybelle cookiegal"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 2, 2008 03:47PM revkat wrote: I thought of one more. I wear glasses and I really hate the dents they leave in my skull skin above my ears. It just looks weird. A friend of mine's 14 yr old son commented last weeked that \"except for the bald thing she looks pretty good for someone with cancer.\" Had to appreciate the honesty because honestly, the bald thing does not look good on me.",
      "MessageIndex": 17,
      "PostDate": "02/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708370",
      "Title": "What I hate MOST about being bald! HeatherBLocklear dhettish"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 1, 2008 04:47PM revkat wrote: I was trying to figure out why my mother's gardener had such a funny look one day when I was sitting in her sun room. It wasn't until later that I realized he was seeing me bald! I hate that when I am lying on my side to sleep and I put one hand under my head, it sticks to my skull. Yuck. I also really hate having my ears exposed. No idea why this bugs me so much, but even when I had hair I always had it cut so that it went over my ears.",
      "MessageIndex": 4,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708370",
      "Title": "What I hate MOST about being bald! HeatherBLocklear dhettish"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 28, 2010 07:01PM revkat wrote: OH, I forgot to respond to that part. I use a Jovi Pak and I like it well enough. It's sure easier than wrapping. It was hard to get used to not being able to bend my arm a  lot when I sleep, but that seems to have worked out. It is hot in the summer, but Binney's tip on putting it in the fridge to get cold really has helped. And when I get up in the morning my arm is smaller.",
      "MessageIndex": 3,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/759974",
      "Title": "Nightsleeve Drama - need some help Suzybelle Suzybelle"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 28, 2010 06:27PM revkat wrote: I am sure that somewhere in the world there is a competent LE garment fitter who knows something. My experience, however, has been that they can't even read a measuring tape and write the number down accurately on a form. So how the HELL would a garment fitter be able to make a prognosis of your future? Plus, I've never heard that you could treat LE 5 YEARS before it shows up.  One of our experts can probably give you a more informed response, but I just want to say that your fitter was practicing medicine without a license or a brain! There. I have the same problem with insurance only paying for the place with the incompetent idiots (and I don't say that lightly, I have evidence!). ",
      "MessageIndex": 1,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/759974",
      "Title": "Nightsleeve Drama - need some help Suzybelle Suzybelle"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 26, 2010 10:41AM revkat wrote: I have to add that I too have had problems with fitters. It really seems like my husband and I can do a better job of measuring and then ordering the correct product. Initially I was ordered a custom sleeve (which I really didn't need, the others work fine). The first one was too short and they had to have a new one remade (after first trying to convince me that we could just stretch the too short one by getting it wet and pulling on it.) Then when I was fit for a Jovi pak the fitter ordered a regular when my arm is obviously very long (right on the border between a long and an extra long). Again had to get a new one remade. I wish all the companies allowed us to order directly from them, and I wish my insurance would reimburse me for ordering directly instead of going through their vendor, because it would be a lot cheaper for them. End of rant. By the way, Medi 95 works well for me, I like the material and the fit. I wish they would make some pretty colors! ",
      "MessageIndex": 15,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751794",
      "Title": "Now what do I do? lexislove Binney4"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Mar 1, 2009 10:36PM revkat wrote: Oncotype scores and corresponding recurrence risks assume that you will take tamoxifen for 5 yrs. The scores are not meaningful for those who chose not to take an tamoxifen or an AI. A low oncotype score indicates that chemo may not be helpful NOT that you can skip out on the hormonal treatments.",
      "MessageIndex": 15,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 13, 2008 09:14PM revkat wrote: I'm not Otter, but I did google around a bit trying to get some solid numbers on recurrence risks. I didn't find any nice handy charts, but the figure of \"around a third of early bc will have a recurrence\" was tossed around a bit. And that was with treatment (surgery, chemo if indictated, tamox or an AI). So then if you figure it will be higher with stage 3, and maybe adding in the risk of a new primary. . . the 80% may not be that high. Still, for each individual it is 50-50. Either it does or doesn't. And there are some lifestyle things we can do to reduce the chances further. And if caught early a local recurrence can be very treatable. And I think I'll stop here, because I worry about recurrence al the time myself. . .",
      "MessageIndex": 34,
      "PostDate": "13/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/708899",
      "Title": "80 % chance of it coming back!!! Naomi browneyes2323"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "revkat wrote: I was referred by my PT to a medical supply place for a custom sleeve and not custom glove. First, I had to make an appointment to be measured. Waited a week for that. Was measured. Waited 3 weeks for the sleeve to arrive. Went in to try it on. It was a different fitter (the first one seemed like an air head, the second one seemed to know what she was doing.) She wondered aloud why I had been given a Medi since most people get Juzo or Jobst, then remembered that the first fitter only knows how to do Medi measurements. With much tugging we get the sleeve on. It only reaches to my mid-upper arm. And the wrist goes down below my wrist bones so it binds when I move my hand. (The glove fits, but of course to have it be the same color as the sleeve would be too much to ask). So she re-measures the length of my arm. Below the elbow it's just off by .5cm, but above the elbow it is off by 3cm. She say she will talk to the sales rep about ordering me one that fits better. Then I get a call that the sales rep has said she should remeasure the circumference as well as length so we make an appointment for that. Another week. I go in. The sales rep and both fitters are there. To get the sleeve on requires a donning device and everyone pushing and pulling. The sales rep thinks it only looks about an inch too short. She suggests they wet it and try to stretch it to get the extra inch. I go home. Go back today to pick it up. No one was in the office but the secretary. She hands it to me and says \"put it on\". I point out that it took several people with rubber gloves and a donning device to get it on the day before, I'm probably not going to be able to do it myself. She calls fitter 1 (who evidently owns the place). He tells her where to find gloves but says I can't have a donning device. You can tell that the upper arm has been stretched because of the spaces between the sleeve and the silicone band and it sort of looks stretched out of shape. I get the damn thing on. It still does not reach to my axilla -- about an inch shy so on the outer arm it  maybe reaches 3/4 of the way up my upper arm. Not to mention that it is very uncomfortable at the wrist because it is too long. At this point I was close to losing it. I took off the sleeve and said \"I need one that fits properly\" and left. Every time I think about it I want to scream. I'm not sure what to do next. I'm not going to wear that sleeve. Should I just buy a non custom one somewhere else? I have mild LE, but I'm having radiation so I can't do the full massage I was doing. Do all sleeves feel like you can't bend your wrist or your elbow? How high up your arm should it go? Help! Dx 1/28/2008, IDC, 2cm, Stage II, Grade 2, 1/20 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/718863",
      "Title": "Sleeve saga revkat unlimited"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 29, 2009 10:12AM revkat wrote: I'm not going to touch the diet stuff, but I want to point out that this is an article about a study done with mice that looked at the mechanism for the spread of cancer. While the findings are very interesting, a lot more would have to be done to move to the point of clinical application in humans. This is the kind of basic research that needs to be done so that we know more about what is behind the growth of cancers, but imho to take this study and claim that the treatments that women are having causes their cancer to spread is really jumping the gun. And really, cancer research is constantly being done. You think your docs should tell you about every study done before they give you treatment? Part of what we pay them for is to sift through this stuff for what is clinically relevant (and, yes, some do a better job than others.)",
      "MessageIndex": 3,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742933",
      "Title": "study shows chemo, radiation can cause cancer to spread Fairyfloss bluedasher"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 21, 2008 12:43AM revkat wrote: I'm almost 6 weeks out and have gotten that soft, white hair. You can only see it in certain lights, but I can tell by feel. My scalp is all fuzzy instead of smooth. I'm liking it! Keep growing little hairs!",
      "MessageIndex": 151,
      "PostDate": "21/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 26, 2008 07:51PM revkat wrote: Week 7 out of tx and my eyelashes are going fast. The fuzz on my head, however, is being joined by some stubble. And I'll need to shave my legs before church tomorrow. I'm hoping to have an \"edgy\" hairstyle by Labor Day.",
      "MessageIndex": 182,
      "PostDate": "26/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Mar 3, 2009 09:25AM revkat wrote: I think the 1 of 3 is for any type of cancer. At least that's the number I've heard floating around recently for women.",
      "MessageIndex": 27,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 15, 2008 09:56PM revkat wrote: Otter you are such a helper. I don't think you can ever leave these boards! I go around trying to answer things (always noting that I'm not Otter) but I just don't have your touch.",
      "MessageIndex": 40,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/708899",
      "Title": "80 % chance of it coming back!!! Naomi browneyes2323"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Aug 1, 2008 04:26AM revkat wrote: Thank you Grace. My first call tomorrow is going to be to the therapist who referred me there in the first place to see what other options might be available!",
      "MessageIndex": 2,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/718863",
      "Title": "Sleeve saga revkat unlimited"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Aug 4, 2008 01:42AM revkat wrote: Well, it turns out my HMO only has a contract with one provider. BUT, the good news is that due to living in crowded SoCal, they have a number of offices if I am willing to drive a bit. I am SO willing to drive 30 minutes if it means I never have to deal with those folks again! So I am going for a new measurement in an office where the PT has had patients report good experiences. In the meantime, she suggested an off-the-shelf sleeve that another provider carries so I got that this weekend. It certainly is more comfortable than the one that required three people to force on! And it reaches all the way up my arm. ",
      "MessageIndex": 4,
      "PostDate": "04/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/718863",
      "Title": "Sleeve saga revkat unlimited"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Sep 5, 2008 03:13PM revkat wrote: otter, I think I finished up about a week after you and I only have about 1/2 inch of hair too. I've got pretty good coverage -- mostly dark or white -- but the length is really slow to come. I've always had thick, fast-growing hair so I'm a little annoyed at how slow it's being. But, as you say, here's to HAIR! of anykind.",
      "MessageIndex": 313,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Nov 12, 2008 03:27PM revkat wrote: It is so good to have followed folks through this whole cycle. I finished chemo just about the same time as Otter and guess what? Just yesterday I noticed the eyebrows/lashes were getting a little thin again and broke out the eyebrow powder! My head hair is salt and pepper and very curly. Other people say complementary things, but I'm not so crazy about it. But it is hair.  I think my leg and arm hair is thicker than before chemo, which is kind of annoying. And I still have some facial fuzz, but it is light enough that I'm just going to wait for it to fall out.",
      "MessageIndex": 626,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Mar 11, 2009 05:33PM revkat wrote: when I had my first cut the stylist noticed that it was twice as long in the back as in the front. If this holds true for others it would explain the lack of bangs. I'm 8 months out of chemo and I have a head full of hair, but only a few little curls to pull down on my (rather high) forhead. Sigh. Some day.",
      "MessageIndex": 1400,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Feb 20, 2009 11:34AM revkat wrote: I had a tiny trim a week ago (last chemo was June 10, 2008) and discovered that 1) the growth was quite uneven. In the back my hair is maybe 4 inches and on top only about 2. Weird. 2) the little ends were all white. That first hair that you think has no color is really the beginning of \"real\" hair. 3) when the stylist blew dry, flat ironed and used lots of product on my hair, I actually looked like the \"me\" I remember! Unfortunately it takes so much work that I'm just going to have to get used to the curls.",
      "MessageIndex": 1270,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Feb 20, 2009 06:43PM - edited Feb 20, 2009 06:45PM by revkat I would think that anything on your head would get too hot if you are really working. Having said that, I wore \"do-rags\" from sparklingearth.com all last summer. They had a nice terrycloth band in the front to absorb the sweat and they have some that are designed for hot weather, so maybe you could find something there. I did soak mine in water and then wear them when I was at the kids' swim meets and it was over 100! Here's a link to some mesh ones, maybe they would work.  sparklingearth.com/products.as...",
      "MessageIndex": 1274,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 27, 2008 09:39PM revkat wrote: Alsdo annoying would be the return of those stupid chin hairs!",
      "MessageIndex": 192,
      "PostDate": "27/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 13, 2008 12:18PM revkat wrote: I know many people have mentioned that with a lumpectomy is can be a big chunk of tissue, but I have to say that with mine (2cm with good margins) it really does not look like a huge dent and doesn't even look that much smaller than the other one. I am a 36 small C. On the other hand, when one of the nodes came back positive and the tumor was twice as large as projected (the ultrasound and mamm both had it at only 1cm) I have rethought the decision many times.",
      "MessageIndex": 11,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705441",
      "Title": "lumpectomy vs. mastectomy? kira Shirlann"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 8, 2008 10:39PM revkat wrote: Hi Otter! I haven't been around much, but just wanted to see how folks were. My hair and yours seem to be following the same sort of mousy-brown-not-growing-fast enough plan. Out of curiosity I finally got a ruler out and it seems to vary between 1/2 and 1 inch. I've been wondering if maybe it takes longer to come back on TC than on some of the other combinations. I have reached the stage where folks aren't sure if this is on purpose (heaven forbid!) or not. It makes for some strange conversations. And when I make some comment about having hair in the past, people don't always realize I'm trying to play the cancer card. Bummer, I was kind of liking that card.",
      "MessageIndex": 389,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 18, 2010 11:21PM revkat wrote:",
      "MessageIndex": 11,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759540",
      "Title": "Follow up with surgeon for 5 years? Why? Halah Mantra"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 18, 2008 11:43AM revkat wrote: I had some very specific episodes of dizziness following round 2 of taxotere and cytoxen. Everything spun around for about 3 hours unless I held perfectly still. The onco said is was probably due to the chemo, though I wonder if it was a se of some of the meds we take for se's!",
      "MessageIndex": 9,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704804",
      "Title": "Taxotere side effects vs. A/C effects osufan otter"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Aug 26, 2008 12:31PM revkat wrote: Wal-mart and Target both have Tom's of Maine products. I am using pure aloe and a calendula lotion. I mix them together because I am to cheap to buy miaderm! Anyway, I don't remember the calendula being outrangeous -- in the $10 range for a bottle that has lasted the whole 6 weeks. (well, so far 5 1/2, but I there's still some left). During the early weeks the calendula really seemed to reduce the redness.",
      "MessageIndex": 13,
      "PostDate": "26/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Sep 11, 2008 04:38PM revkat wrote: I finished rads a week ago and just wanted to say to tomatojuice that while it was physically sooooo much easier than chemo, the first week of rads was, for me, much harder emotionally. I had to focus on breathing and relaxing, because the only thing that kept me from jumping off the table and running out was the thought of accidentally radiating some other part of my body! (Like my nose or something). And I am/was firmly convinced that rads were an important and necessary part of my treatment so my reaction didn't make sense, it just was. There's just something weird about being alone with that machine. It did get easier after that first week to make myself go. And the techs were always so nice and encouraging. I didn't have any burning until the last week and then during boosts. By now the un-boosted part of my skin is normal (but tan) and the boost area has started healing up well. I have felt more tired this past week than any time during rads, but I think that has to do with the whole \"finishing treatment\" emotional changes.",
      "MessageIndex": 145,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 11, 2010 03:11PM revkat wrote: Ta-da! I finished. My sister, who got me into this, had a bad day -- with an anxiety attack at the start of the swim and heat exhaustion during the run -- so we took it slow and easy, but two years ago, when I had just finished chemo and radiation, I would never have thought about even attempting something like this, so it is a victory of sorts. And I might try one again and see about improving that time! The best part? At about the last mile of the run we were passed by a woman who was also wearing a compression sleeve! I called out to here and we shared greetings -- neither of us swim in the sleeve and it does slow down that first transition. I looked for her after the finish, to get a picture of our arms for you all, but couldn't find her in the crowd. Go swell sister triathletes! ",
      "MessageIndex": 14,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/755415",
      "Title": "Triathlon and LE revkat Binney4"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 28, 2009 09:53PM revkat wrote: Yes. I had lumpectomy and radiation last year too (finished rad in Sept. 2008). The radiated breast is larger and firmer (and tanner) than the other. In fact, as the months go by I am noticing that my non-treated breast is sagging, like one might expect in menapause, while the treated breast remains firm and high. So, when I go braless, my nipples are not on the same level at all! I don't know if it is scar tissue or what. I'd be interested in knkowing what your onc says, or if others know what exactly has happened to that breast tissue.",
      "MessageIndex": 1,
      "PostDate": "28/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736653",
      "Title": "Breast bigger after radiation rgiuff kimaesha"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 16, 2010 12:25AM revkat wrote: MOTC -- I have been thinking that I need to see a therapist again. The last time was just about a year ago, and since then I have lost a little weight, changed a lot of fat into muscle, and become much more active. I've just been putting off dealing with the whole referral process for my HMO -- it's just such a hassle. Ok, I'll email my doc to get a referral. I hate dealing with LE -- docs who know nothing, therapists who aren't really trained, fitters who can't use a tape measure. When you finally find someone who knows what they are doing it is such a blessing! mkayk -- awesome! My sister and I are training together (she did a half-marathon last fall) and I have been working with a personal trainer. I am really excited about it. Definitely not planning to win any prizes, but given where I was 2 years ago, to be able to say \"I did it!\" will be great. ",
      "MessageIndex": 8,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/755415",
      "Title": "Triathlon and LE revkat Binney4"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 15, 2010 06:05PM revkat wrote: I will try swimming with an old sleeve next time I go. It doesn't bother me with other exercise, so I don't see why it would with swimming, I've just always felt like it would be uncomfortable in the water and that the chlorine would be bad for the sleeve. But it's been almost two years since I got my first sleeves, so I am getting a pile of old ones I can experiment with. Yes, definitely need the sleeve for the bike and run part. And biking I periodically hold my arm up and open and close my fist. I also shift hand positions a lot. For a long time I was afraid to try biking, but my husband loves it, so I finally gave in, and so far, no long term problems with the arm although it can get achy during a long ride. Same thing with running (well, jogging is probably a better description). Every now and then I have to reach up and stretch. ",
      "MessageIndex": 3,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/755415",
      "Title": "Triathlon and LE revkat Binney4"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 6, 2010 04:11PM - edited Aug 20, 2013 05:53AM by revkat Just thought I'd update you all. The race (well, \"race\" is a bit of an overstatement, our aim is to finish, so maybe I should just call it an \"event\") is this weekend. I tried swimming both way and I just can't stand the feel of the sleeve in the water. At first with the swimming (when I was doing less than 1000 yds) I really noticed that it was good for my arm. Everything felt so much better after swimming. But then, when I up the yardage, I've had more problems. I've compensated by wearing my jovi pak more regularly. I am going to be wearing a sleevless wetsuit for this event. I've wondered if a full wetsuit, when the water is colder, would provide compression? Hmmm. I probably won't be finding out, because swimming has turned out to be my least favorite part of this. So I will have to don a sleeve over a damp arm, but I'm pretty good at sleeve doning. Just have to be careful not to slug myself in the jaw while pulling it on. It really has helped to have a new sleeve for the biking and running, although I hate getting a new sleeve all dirty (got some bike grease on one). I'm wrestling with biking gloves at the present. When I wear a biking glove over my glove my little finger tends to go numb(even though I'm wearing large gloves). If I don't wear a biking glove my palms, especially near the wrist, gets sore. I'm experimenting with putting some foam inside a stretched out glove, but that won't work for the triathlon. So, I'll probably just let the little finger go numb for this event. I like the biking the best and plan to continue with it after this so I'll keep tinkering. Running. I hated it the most at first, but seem to have turned a corner. Still, I don't know if I could do more than the 5k. My arms get tired and heavy if I let them hang down at all. Thanks for all the suggestions. I'll let you know how it goes. I'm ready for the training to be over, but I'm looking forward to the event itself. After all, everyone gets a medal!",
      "MessageIndex": 12,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/755415",
      "Title": "Triathlon and LE revkat Binney4"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "revkat wrote: I know we have some super athletes on this board, so maybe you can give me some help here. My sister has talked me into trying a sprint triathlon this fall. I've done the distances (500yd swim, 14 mi. bike, 3 mile run) separately, so I think I can do this, but I got to thinking about the transitions -- do I swim with a sleeve and then let it air dry while biking? Or should I try to pull on a sleeve after swimming (I don't usually swim with a sleeve on). Other ideas and hints for training? I was an athlete in my youth, but pretty much was down to a brisk daily walk before bc. And I didn't exercise during chemo much at all. Mostly I lay on the couch and moaned. And then went to work when I felt better. For the last year I have been working out with weights 2x a week using the protocol from the recent study (and I've never been able to get over 5lb dumbells without a flare :( ) and cardio 5x a week. I'm way more fit, but doing something like this race is a new thing for me.   Dx 1/28/2008, IDC, 2cm, Stage II, Grade 2, 1/20 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/755415",
      "Title": "Triathlon and LE revkat Binney4"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 2, 2009 01:27AM revkat wrote: I've been wearing the Jobst without silcone for the past few months and I find it stays up just fine. Occasionally I do have to readjust it on the upper arm, but really not a bother and it doesn't bag or wrinkle at all.",
      "MessageIndex": 3,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/731769",
      "Title": "Jobst off the shelf sleeves-no silicone beads on sleeve OneBadBoob OneBadBoob"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 17, 2011 03:38PM revkat wrote: Wow. I'm little confused about the kind of bc her mother had the second time. It was stage III right? But then there were the comments about metastic bc and \"wanting 10 more years\". Her treatment plan seemed very stage III typical. And it was some aggressive type but they didn't specify. I'm guessing maybe triple negative? Does it run more in families?   She had a mother with post-menapausal bc and probably a great aunt. That is not a strong family history. That's what my kids have and I certainly don't think they should have prophlactic mastectomies. Of course, the missing part of this story is what kind of bc her mom had the second time, that could make a difference. And was it the same kind the great aunt had? Missing pieces might make this story make more sense. I am surprised her insurance paid for it, but I suppose one of her collegues could make the arguement for her. It is very interesting to me when doctors make decisions that aren't really grounded in evidence based medicine.Sort of like when Dr. Weiss had bc (she's the radiation oncologist who runs this site) and she choose mastectomy with reconstruction rather than breast conserving surgery and radiation. Makes you go \"hmm\". If Tricare is paying for alternating MRIs and mammograms, I'm going to have to have a talk with my HMO which is only going for mammograms. Oh wait, that's standard of care, breast MRIs haven't been shown to have a greater benefit than risk. Silly me, I thought that was the kind of thing we made health care decisions based on. No wonder heath care costs are skyrocketing. So our tax dollars paid $80000 for non-medically necessary surgery. Just my humble opinion. I know there are many others. ",
      "MessageIndex": 5,
      "PostDate": "17/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/771720",
      "Title": "High risk breast surgeon undergoes PBM... Soccermom4force alexandria58"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 18, 2011 03:23AM revkat wrote: My statement about the doctor not having a strong family history wasn't related to her BRCA status, it was related to the fact that she had a mother with postmenopausal bc and an great aunt who we don't have any medical information on. That's only one first degree relative and the postmenapausal status makes it a weaker genetic possibility. Two sisters is a much stronger genetic link. An Onc or BS is aware of what can happen, but also has a very skewed view of what can happen. Sort of like reading this website can give us! If this doctor had had any indication of cancer or precancerous conditions I would have felt differently. As it is, I think she acted out of unjustified fear. But I do recognize that the article didn't give us all the medical informatio needed to understand the situation. ",
      "MessageIndex": 9,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/771720",
      "Title": "High risk breast surgeon undergoes PBM... Soccermom4force alexandria58"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 23, 2010 04:56AM revkat wrote: Estepp -- if you are wearing your wrappings 6-12 hours a day you are doing better than I did at first! I would put them on with the best intentions and a few hours later be frantically pulling them off. Only to realize when I calmed down that I needed to put them on again. I think I am a little claustrophobic.  But they really do work to keep down the swelling. And you won't have wrap forever. ",
      "MessageIndex": 17,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/754100",
      "Title": "New at Lymphedeme montrial kcshreve"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Aug 10, 2010 06:05AM revkat wrote: I love, love, love this thread. I have lots of days when I say to my husband, \"have I ever told you how much I hate LE?\"  You are all strong and noble women and I salute you (with my sleeved and gloved arm)! ",
      "MessageIndex": 14,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756559",
      "Title": "Singing the \"When is your arm going to get better?\" Blues Suzybelle o2bhealthy"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Dec 10, 2008 03:16AM revkat wrote: Like so many of us April Chemo folks, I 've been lurking on your thread too. I just want to affirm that Noelle's curly hair stuff is amazing. I had 3 little girls with fuzzy heads until I saw an ad for the book \"Curly Girl\". It changed their lives! And now with my chemo curls in robust bloom, I am using their products too. (Hey Lauren, Otter, Noelle. . .)",
      "MessageIndex": 3957,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 9, 2008 12:23PM revkat wrote: You May women are amazing! I took my hat off in the car today and drove through LA traffic almost hoping for some reaction, but you know, I'm not sure that anyone else noticed. Maybe it's like middle school -- we think everyone is looking at us, but really they're all worrying that everyone is looking at them. Rock on.",
      "MessageIndex": 805,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 12, 2008 09:13AM revkat wrote: Hi, I'm just dropping by from the April thread. Wanted to add (for what it's worth) my experience with constipation was that it was fine to wait until the night after chemo to take the first stool softener. But I haven't had it as bad as many folks do. And with the nausea -- I was told the same thing about morning sickness (which I had a moderate amount of with 3 pregnancies) and motion sickness (which I have a lot of). But, I haven't had any nausea with chemo! I'm on zofran, before chem and then I take it every 8 hours without fail for the next 3 days. Everyone seems to respond to all these things a bit differently, so the first time around remember to write down what you take when and how you feel (you will forget by the time your next treatment comes around), then you can tweak things for round 2. In general though, most of us seem to discover that we should go ahead and take all those meds! You probably will only need them for the first week but it is always better to stay ahead for the se's than to try to catch up to them.",
      "MessageIndex": 213,
      "PostDate": "12/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Aug 27, 2010 06:39PM revkat wrote: Hey Kate, Docs vary about scans at Stage 2b. It is not abnormal to only have labs and a chest x-ray, though some also do a bone scan and abdominal CT or some kind of MRI. If you are 3 years out with no symptoms of mets and your lab work is still looking good, just consider the radiation you didn't get with more scans as a good thing! It is normal not to have rads with less than 4 positive nodes if you have a mastectomy. With 1-3 positive nodes a lot would depend on the margins they got. If they were positive or very close, rads could be suggested. If the margins were good and clear it's less likely. Also, 3 years ago they seemed to be less aggressive about the rads with mastectomy. Leg pain and tamoxifen. Yep, it happens. The best thing is to move around, but if you can't do that could you do some of the stretching exercises they recommend for long plane flights? Like foot circles and seated legs lifts. Or seated bring your heels up to your seat as much as possible and then extend your leg? Will they really not let you stand and do a deep knee bend between calls? That sucks. On breaks can you walk around and stretch out a bit? Sounds like you are doing well! ",
      "MessageIndex": 696,
      "PostDate": "27/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jan 28, 2009 09:34PM revkat wrote: Thank you so much bsOK. That answered my question. So I had something around 30% chance of having further spread (I'm not sure what method they used on the sentinel and my path reports are packed away right now.). I guess that makes it worth checking, since any of the calculators I've seen only gave me a <5% chance of having bc in the first place! Maria, my BS basically said, \"if we see it in any of the sentinel nodes, I'm going ahead with an axillary dissection while you are under\" and I said \"ok\". I guess the upside is I only had to have one surgery since she got good margins.",
      "MessageIndex": 12,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728145",
      "Title": "Typographical Error on Pathology Report Britt Britt"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Mar 13, 2009 11:21PM revkat wrote: Linda -- my breast were described as heterogeneously dense too. I asked my Breast Surgeon what that meant and she said there were several terms they use and heterogeneously dense was the least dense of the dense one. (did that make any sense? anyway, there are several more dense classifications -- she said that this was the first level of dense). And she thought mine looked less dense (and therefore easier to read) than the previous mammogram, probably due to chemopause and tamoxifen. ",
      "MessageIndex": 5370,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 8, 2008 05:58PM revkat wrote: Heidi, one thing to consider is that this discussion board is not a random sample. Women who had a lumpectomy and have not had a recurrence are not likely to be posting here, they are out living their lives! Talk to your doctors about your cancer, do some research, look at the numbers, and do what feels right to you. There is no one right answer.",
      "MessageIndex": 9,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706946",
      "Title": "Anyone? Lumpectomy vs. Mastectomy w/No Re-occurance???"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 9, 2008 09:06PM revkat wrote: Shirlann -- and we are so glad you are here, because you offer a unique perspective for those in the midst of treatment! Thanks for your input.",
      "MessageIndex": 12,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706946",
      "Title": "Anyone? Lumpectomy vs. Mastectomy w/No Re-occurance???"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 3, 2008 02:19PM revkat wrote: Kathy, I know that Otter got her Neulasta shots on the day of treatment. Her onco had a study that showed it was just as effective. And Otter knows everything , so I would guess it's ok to go that way.",
      "MessageIndex": 1202,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 4, 2008 09:57PM revkat wrote: I started chemo in April and finished mid-June, but this is one of my favorite threads. There is so much creativity in this group (and care for each other too). Carry on.",
      "MessageIndex": 1237,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 16, 2008 11:14PM revkat wrote: Noelle, Dundas may be a teeny tiny town, but I've been there! I have a friend who lives out in the woods around there and works in Hamilton, so my d and I went through last summer on a pre-college tour. She was interesting in Waterloo at the time, but decided that dealing with the distance (we're in Calif) and a different country would be too much. If I'd know we were going to be having bc together I would have stopped at your store!  Oh, and all my girls have long curly hair and after seeing your pic they told me to stop moaning about my hair -- you lost a lot more than I did!",
      "MessageIndex": 1489,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 27, 2011 07:40PM - edited May 27, 2011 07:41PM by revkat",
      "MessageIndex": 11,
      "PostDate": "27/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768822",
      "Title": "Diet, suplements and Stage IV alicia_en_madrid K-Lo"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Dec 10, 2009 10:33PM revkat wrote:",
      "MessageIndex": 7163,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 15, 2008 11:50AM revkat wrote:",
      "MessageIndex": 277,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Dec 20, 2010 11:45AM revkat wrote: Well, I'm a Christian (see the \"rev\" part of my user name) and I am not fond of the celebration of Christmas. I much prefer the Advent season (which is all about waiting and longing) leading up to it. And since most folks don't want to come to church on Christmas day, by the end of the Christmas eve service the spiritual part of celebrating the incarnation is all done. All this to say, since I was diagnosed I really can't stand the whole family dinner thing (too much work and too much conflict) so we will be joining our Jewish and non-religious friends at the Chinese restaurant for dim sum on Christmas day! (Ok, the kids to get some present and we have a tree, but really, people think I'm sort of grinchy about the whole cultural celebration thing). ",
      "MessageIndex": 53,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761581",
      "Title": "Anyone NOT celebrate Christmas? Mom3 Shanagirl"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jan 28, 2009 09:04PM revkat wrote: I'm really interested to hear responses to this. I had one positive node and 2 negative from the SNB. I then had the ALND and all 17 nodes from that were negative. As I result I have had a lot of pain and some mild lyphedema for something that actually added no benefit to my health (unless you count the peace of mind of knowing there wasn't any further cancer.) But it didn't change my treatment. And I lost 17 good nodes. Does anyone know the % chance further affected nodes will be found if one sentinal is positive but others in that first group are negative?",
      "MessageIndex": 5,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728145",
      "Title": "Typographical Error on Pathology Report Britt Britt"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jan 29, 2009 01:27PM revkat wrote: I may not be a May girl, but I am so in on a shovel brigade for Randie's pulmo. Don't they teach them the first week of med school \"NO LAUGHING AT PATIENTS\", not to mention \"YOU DON\"T KNOW HOW LONG PEOPLE WILL LIVE\". Ok, I'm done shouting. But along with your May buddies, I worried about you, Randie, the whole time we didn't hear from you and I am holding you in my thoughts today. Hope the meeting with the onco goes well and gets you a plan for the (many, many) days and months and years ahead!",
      "MessageIndex": 4661,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Mar 11, 2009 05:31PM revkat wrote: If you all can't see spending the $$ for total Deva care of your hair, you should still try the One Condition. I used to use it even when my hair was mostly straight. And believe me I turn those bottles over and cut them in half to get every drop of the conditioner out because of the cost!",
      "MessageIndex": 5330,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 18, 2008 02:54PM revkat wrote: I choose prozac over effexor a few years ago because effexor does have the need to be dosed at the same time each day without fail or you can get some side effects like nausea and dizziness. At the low doses for hot flashes has anyone noticed this?",
      "MessageIndex": 13,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705629",
      "Title": "Anyone Had Good Results with Effexor? bluewillow Caya"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 1, 2008 10:39AM revkat wrote: Well, I finally registered after lurking for a month or so. I start 4 cycles of T/C today. And it's not an April Fool joke. Dang. Prior to surgery (lumpectomy) the doctor was thinking about 1cm, nodes looked clear clinically, grade was 1. I got adjusted to thinking surgery, rads, tamox, and out. But no, 2cm. grade 2, and that stupid sentinel node with a .8 tumor. I spent a good week reading every study I could find about chemo trying to figure a way out, but finally have accepted that there's no onco in North America that wouldn't recommend it. (Maybe in Europe, my onco acknowledges, but I'm not in Europe, am I?) So today it is. I've got 3 girls -- 20, 16, 13. The oldest is home on medical leave from her first real job because of chronic headaches, which stinks for her, but has been great for me. She's a real help. The middle is a senior and has to figure out college for next year -- this diagnosis has made staying close to home look attractive to her, but I want her to stretch her wings. The youngest is the sweetest 13 year old girl ever. (Takes after her dad that way, they are both so easy going and caring). My mom also lives with us, and she broke her hip two days before my surgery. She's doing well, but let me say, we sure didn't plan 08 to look like this! It's either anxiety or the steriods, but I am totally wired this morning. It will be good to just get it done! I hate having to do this, but am glad to have the option and folks to go through it with.",
      "MessageIndex": 33,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 2, 2008 09:12AM revkat wrote: Well, treatment #1 was uneventful. They did infuse both the T and C very slowly -- which meant I was there for 6 hours between orientation and picking up the final meds at the pharmacy. Fortunately my D brought a portable DVD player and a bc survivor friend came by for a visit in the middle. I would rather take the time to do it slowly than have to treat a reaction, so it was ok. Now the wait to see what side effects I get! This morning I feel a bit shakey, but that could be due to little sleep the past few days -- between the steriods and the anxious anticipation it's been tough. One interesting side effect, my affected arm has been tight through the elbow (could it be cording a month after surgery?) but the steriods seem to have helped with that, perhaps relieving inflamation? Anyway, best wishes to everyone starting this week. revkat",
      "MessageIndex": 45,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 12, 2008 11:52PM revkat wrote: I don't have a port either, for 4 cycles of TC. The doctors and phlebotomists all think I have great veins. The onc nurse moaned and complained about having to use a vein (then got it in on one try with no bruising later).  But we're staying with the veins. There are risks to ports too. And otter, I've had the same worry about having a blood draw and then chemo put in the same arm (what about a leak?) but they tell me not to worry.",
      "MessageIndex": 210,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 19, 2008 06:33PM revkat wrote: I had my first treatment on 4/1 and have been watching the hair fall out all week. We buzzed it Thursday night (my h's practice on the poodle came in handy!) and were all surprised how good I looked with it. But now the bits are coming out and I look like I have mange. I wonder if it is better to pull or shave what's left? So far my strategy has been to wait until I can't stand it and then act. It seems to help with the emotional stuff -- by the time we buzzed it I was more than ready to get rid of the limp dead look. I'm not quite ready to get rid of the fuzz yet, maybe tomorrow.",
      "MessageIndex": 308,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 8, 2008 06:53PM revkat wrote: I've been wandering around the boards feeling grouchy, so I thought maybe I should come back here to \"my\" chemo group and not bother everyone else. I started chem April 1 and thought I would have my last treatment June 3. So I was telling myself it would really only be two months! Then last week they delayed my tx due to elevated liver enzymes. I go in tomorrow to have them rechecked. This whole week has seemed like a waste to me -- I can't seem to get anything done, I just keep taking naps, I feel really down. I haven't felt great and then when I think about doing another treatment and feeling really bad again it seems pointless to get started on anything. Someone this morning finally nailed it for me -- I feel like everyone else is graduating and I have to go to summer school. I'm hoping my enzymes will be back to normal tomorrow and I can get this thing over with. Just one more thing I have no control over.",
      "MessageIndex": 1092,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 10, 2008 11:20AM revkat wrote: well, the good news is that I get to get it done today! The bad news is that I'll have to feel bad again before feeling better. But still, it feels better to finish the course and not end up wondering \"what if?\" Thanks so much for your supportive words this weekend. I needed that.",
      "MessageIndex": 1104,
      "PostDate": "10/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Aug 9, 2008 02:31AM revkat wrote: Roberta -- the radiation tatoos stay on forever, but they are very tiny. Sue -- how wonderful to be done! Yay you! I haven't been posting much since I finished chemo (gosh, could it be 8 weeks ago!!!!). Between rads and getting back to work full-time I'm beat most of the time. But it's good to check in and see how it is going for everyone.",
      "MessageIndex": 1432,
      "PostDate": "09/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 14, 2008 05:58PM revkat wrote: Oh yes, Linda, we have become shameless about accepting food from friends. It is such a huge gift to us and they want to help somehow. Our church organized 3 meals to follow each treatment. Even though my dh or dds could cook, it seems like they get down when I'm at my worst so it helps them out too.",
      "MessageIndex": 849,
      "PostDate": "14/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 8, 2008 08:50PM revkat wrote: Thanks otter and Sue, I think maybe it all just started to catch up with me when I had to stop moving and just wait. Up to this point there was always the next thing right ahead. Now I feel like I'm in chemo-limbo land. Everything will probably be ok tomorrow and we will plunge on ahead, but right now I feel more weepy than I have before in this journey (ok, except for coming out of the anesthesia, but that's drug related, right?) And Sue, I always feel like such a wimp since I'm only having 4 rounds. Those of you with more deserve an extra badge of merit. Let's see. . . what would work well. . . It's not like we want to pin a medal on your chest! How about a chocolate medallion?",
      "MessageIndex": 1095,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 6, 2008 03:37PM - edited Apr 6, 2008 03:38PM by revkat tigwin -- thanks for the dosage suggestion. I was only taking 25mg, so I'll up it next time. It is just too weird (as others have said) to go from someone who takes very little meds to just popping all these pills! But I will say again the anti-nausea stuff worked great. And once I took the vicodin it did knock out the aching (at least for 4 hours at a time.) I took a nap today and even though it was short woke up feeling almost human for the first time since Thursday evening. Now for a shower! It sure does seem that everyone experiences chemo slightly differently. I wish I could be one of those \"never missed a day of work\" types, but I've already blown that! But maybe I can get in a few days this week and next if things continue to improve.",
      "MessageIndex": 115,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 8, 2008 12:48PM revkat wrote: Hey, I woke up this morning and felt. . .  not horrible! I do have some thrush, but dh is picking up the meds this morning and it doesn't hurt, more like irritation. So maybe I will have a bit of energy to face the hair falling out thing next weekend.",
      "MessageIndex": 138,
      "PostDate": "08/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 28, 2008 12:05AM - edited Apr 28, 2008 12:19AM by revkat I blame the weepiness on day 4-6 (depending on individual preference). Today is day 6 and I am only feeing marginally able to be up a bit. Yesterday was the flat out in bed day. I pretty much hate cancer. And chemo. Taking it one step at a time. And otter, don't worry to much about that index. It's so general that I don't see how it can be useful in indidivual cases. Sure, big is worse that small, fewer nodes are better, lower grade is better, but that leaves a whole lot out about the biology of your tumor and the effect your treatment has on it. (But looking at your diagnosis I get a Nottingham index of 3.2, isn't that supposed to be good?) There is an end to this, really. For angie and others on the first time around, I promise that you will feel better (before we get to do it again!). Last time it really was day 9 before I felt able to go out and about, but then that last week (day 14-21) was wonderful. If you are doing dose dense, I don't know, but I still can promise, there is an end.",
      "MessageIndex": 528,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Dec 15, 2009 10:16AM revkat wrote: What a beautiful baby!  It's hard to believe that it's been almost 2 years. My in-laws are coming to visit the week after Christmas and I told my husband, \"you know the last time they came I got breast cancer.\" He didn't think it was funny. So glad you all are doing well. I finally started working out regularly in August and realize that I feel better than I did before treatment (well, except for the slight neuropathy in my feet, the mild LE in my arm, the hot flashes . . .) and my hair looks like mine again (with a little help from some coloring.) May your holidays be bright! ",
      "MessageIndex": 1914,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Nov 12, 2008 03:45PM revkat wrote: Medical folks will say that your bc is metastatic to lymph nodes if they find anything in your nodes, but it is not the same as saying you have stage IV metastatic cancer. For them it just means it has gone beyond the primary tumor in your breast. I was offered that trial with the Avastin (since it has been effective with metastatic stage IV they are doing a trial to see if it helps with early stage) but I went with TC. Mine is strongly ER+ however, so I felt like the hormal meds were the important piece, the chemo was just extra insurance.",
      "MessageIndex": 6,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724317",
      "Title": "AC&T vs T/C? EleanorJ Seabee"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 5, 2008 07:35PM revkat wrote: Well, day 4 really sucked. No nausea, but I felt like every single muscle fiber and bone joint ached. Slowly feeling a bit better today. I am in awe of anyone who goes to work feeling like that! Benadryl didn't help with sleep, but maybe I didn't take enough. We made it through neupogen shot #1, (H did it, he has experience with bovine injections!) but I'm dreading the remaining 19. I'm going with the \"take care of yourself, rest if needed\" advice. revkat",
      "MessageIndex": 90,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 12, 2008 01:25AM - edited Apr 12, 2008 01:25AM by revkat Susan -- I'm on neupogen. My husband or daughter give me the shots (in the abdomen) because I'm such a wimp about needles. It would be hard for me to sort out which of the aches and pains were from the taxotere and which from the neupogen. I mean, they started before the shots but were at their worst while I was having the shots. Not writhing level pain at all. Well within that \"doable\" category. I think you are right, that often those having a hard time with something are the ones who post. Makes sense to me. That's what I do! My wbc counts were right on target so I guess the neupogen is doing the job.",
      "MessageIndex": 195,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 3, 2008 03:23AM revkat wrote: Sue -- I think you will start feeling better soon, give it a few more days.   But, it does hit some of us harder than others. I thought I could work 2 out of 3 weeks, but it wasn't possible -- my employer is super flexible, so they are willing to take a bit of work from home and one out of 3 weeks, but otherwise I'd have to forget it. If your counts are low of course you feel lousy. You may feel better next round if they figure out how to keep your counts up. I have decided not to entertain thoughts about what I'm learning, or what meaning this all may have at this point. Right now it's just about one foot in front of the other, taking the next step. Be kind to yourself, don't measure by what someone else can do, rest when you need to. kat",
      "MessageIndex": 665,
      "PostDate": "03/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 20, 2008 04:13PM revkat wrote: what is the deal with hemoglobin? Mine was 12 before I started chemo, 11.5 after tx 1, and only 10.7 after tx 2 but the onco is totally unconcerned. I do feel weak and tired. Should I be concerned?",
      "MessageIndex": 900,
      "PostDate": "20/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 21, 2008 09:02PM revkat wrote: Your info and spectulations are so timely, Otter. I spent the day in the ER because of a fever (100.7) and some chills, cough, stuffy nose. Of course the first thought was that I was neutropenic so blood tests, urine, chest x-ray were ordered. All clear at this point though they are running some cultures. And my blood counts were good. In fact the wbc was above the normal range. I've been wondering if I'm getting too much neupogen, since every time it has been high. Now I wonder if the fever isn't just from my bone marrow being in overdrive and pushing out too many of those suckers! This was the first time I've ever been a patient in an ER and I told my daughter -- blood letting and fasting seem to be coming back in style. We were there from 11 to 5 with no food offered, I had to ask for something to drink and was only give a small juice box, and then right before I left my bp was low (haven't I heard folks say that may be a side effect of the chemo?). So then they suspected I was dehydrated and hung some saline drip. Ya think? 6 hours with nothing to drink, 10 hours without food, and pulling out 8 tubes of blood. Could mess up a person's electolytes a bit. Anyway, I'm home now. Where I can eat and drink as much as needed. We think I probably have a cold. But I'm not neutropenic, thank goodness.",
      "MessageIndex": 925,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 25, 2008 04:00PM revkat wrote: I think I may have reached a new stage in this journey. I'm over tx3 (well except for the low blood pressure and low hemoglobin which means I feel tired) and I actually am eager to get to tx4. Let's just do it and get it over with. Why bother trying to feel better when it's just going to get worse before it gets better? I have to wait another week for tx4, but when people shared about looking forward to it, I used to think \"what?!?!\" Now I understand. Counting down to that last one.",
      "MessageIndex": 965,
      "PostDate": "25/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Mar 31, 2009 06:31AM revkat wrote: Believe, this is the chemo in April 2008 thread and it doesn't tend to be very active anymore (I guess we were so self-centered at the time that we didn't think about people having chemo in other Aprils! We were just as scared and worried as you are now. And we are here to tell the story!) There is an April 2009 thread, I think they do have the year in their thread title. I had TC not ACT and I couldn't have driven my kids 3 days later and felt safe about it. But then I was a real chemo wimp compared to some folks around here. I did pretty well for about 48 hours after treatment and then was totallly wiped out for about 3 days and weak for another few days. On the other hand, there are women who never missed a day of work. I think it had to do with your personal tolerance for the medication, the strength of your will (you know, we women will do what we have to do), and how well the meds they give you for the side effects work for you (and do take them!). Find those April 2009 women and good luck to you!",
      "MessageIndex": 1864,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jul 18, 2011 12:15PM revkat wrote: If a person has any indication of cancer, however small, I think it becomes entirely their decision on how to proceed with treatment. I just think this doctor, despite her medical background, overreacted. I had no risk factors. None. In fact, when new risk factors are announced it always is \"look, another risk factor I didn't have.\" Yet I have bc. Should all women have mastectomies? All women who tend toward obsessive thinking? All women who have any relative with cancer even though the link is not strong? Where do we draw the line? And who pays? When does it become elective surgery? mitkita I am sorry for your loss. ",
      "MessageIndex": 13,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/771720",
      "Title": "High risk breast surgeon undergoes PBM... Soccermom4force alexandria58"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 22, 2008 01:21AM revkat wrote: Angie The only other bothersome side effects I can think of is the whole constipation/diarhea thing. And also the aching (slightly diff. than fatigue). Find out if they will let you take Advil or if they are Tylenol only folks at your doc. Oh, and then the mouth sores -- but rinsing well and often seems to really keep those at bay. Now I'm afraid of discouraging you. It is not that bad! And then the se's fade and you get a few good days and you really appreciate them! I will be thinking good thoughts for you as I have treatment 2 tomorrow. It's weird, I thought I would be dreading it more, but you know, the hair is out, the path is ahead, and I'm just buying a bunch of my favorite drinks. (Trader Joe's bottled limeade really hit the spot last time.)",
      "MessageIndex": 346,
      "PostDate": "22/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 23, 2008 03:56AM revkat wrote: tomatojuice -- thinking good thoughts for you for tomorrow. Maybe you have the worst out of the way now  and the chemo will be a breeze! Treatment 2 was as uneventful as tx 1, plus took a couple of hours less time, even with having to wait an hour for the blood work to come through. Now if I can only get ahead of the aches and pains to come in a few days. . .",
      "MessageIndex": 400,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 30, 2008 06:45PM revkat wrote: bcs75 -- I'm just doing 4x of Taxotere and Cytoxin. I'm in SoCal where the UCLA study about not giving Adriamycin to Her2- women has had a big influence so this is what my onco recommended. I feel like a wimp whining when it's only 4 treatments, but there it is.",
      "MessageIndex": 1020,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Feb 27, 2009 04:19PM - edited Feb 27, 2009 04:20PM by revkat Happy birthday Angie. I just realized that it's my surgery anniversary too. And I got the results from my first follow-up mammo -- all clear. Got the curly hair thing going and I hate it. I just want to look like me. Other people don't seem to understand that. People may indeed get perms to look this way, but that is different from having your own hair taken away and replaced by this alien mop! Sigh. Oh, and I HATE when they touch it without asking! One of the things about curls is that you need to gel and scrunch and leave them alone, or else you get lots of frizz. Why do people think that because I've had cancer I want them to rub my head and mess up my hair? My treatment ended, my job ended, my middle d left for college and the oldest d got a real job and moved out, and a program I'd been in for 5 years with a group of wonderful women ended -- all in the past 6 months. I feel like I have to start my whole life over at this point, and I'm still to tired to get started. . . The past year was a total blur. Where do I begin now?",
      "MessageIndex": 1827,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Oct 1, 2009 05:00PM revkat wrote: I just came off a series of blood tests where my liver enzymes were elevated to almost that 3X normal level -- high 80s in the first test. A test the next week showed them down 8-10 points, a test a few days later down a bit more, and another week later down into the normal range. Why? No idea. I have had no changes in diet or drug therapy, don't drink, etc. It could possibly be because I started working out about a month before the first test and have been sore a lot ever since, but the dr. pooh-poohed that theory. Anyway, they are back to normal so we're just chalking it up to \"one of those things\" and I'll have another blood test in two months. There is some natural variation in some of this stuff, but since we've had cancer the docs feel the need to do something when in other situations they might just wait and see.",
      "MessageIndex": 3,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/741223",
      "Title": "elevated liver tests mkl48 revkat"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Feb 2, 2010 09:14PM revkat wrote: I have an armpit full of tiny clips too. I believe that when they do an axillary dissection some surgeons use the clips to control internal bleeding. I have not had any pain that I felt was related to them, they are very tiny.",
      "MessageIndex": 5,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/747590",
      "Title": "20 plus surgical clips left..does anyone have this? smart23 MariH"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Aug 20, 2010 01:12AM revkat wrote: Awesome!",
      "MessageIndex": 2,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756962",
      "Title": "Me -- running in my sleeve Member_of_the_Club SpunkyGirl"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Aug 16, 2010 05:32PM revkat wrote: It's that \"for rest of your life\" thing that is so hard to accept. I hate it. This morning I was wearing my Jovipak around (hadn't really started the day yet and I've been having a bit of flare up) and my Mom came over. She was all concerned and once again I had to explain that it was a forever thing. Some times it's better than other times. I can't figure out what happened this time, perhaps it's just that the hot weather finally got to us (don't kill me, but we've had the most wonderful cool summer in Southern California this year). Sigh. Double sigh. Whenever I have rechecks with my surgeon and she says \"is there anything I can do for you?\" I always respond, \"I'd like my lymph nodes back please\".    I mostly come to these boards for the LE discussions. If not for that, maybe I would be able to \"move on\", whatever that means. ",
      "MessageIndex": 47,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756559",
      "Title": "Singing the \"When is your arm going to get better?\" Blues Suzybelle o2bhealthy"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 8, 2008 08:34PM revkat wrote: Got the yougurt, check. Got some Smart Water, (don't know who recommended this, but it really did taste better than our regular filtered water does, which is more important to me than the electrolytes since pretty much everything tastes gross right now). Got the nystatin for thrush. Excuse me, why would you give someone who is already taking all sorts of things that mess up their stomach a really gross liquid that they are supposed to swollow but is likely to make them gag? Why not the more expensive pill that you only have to take a few of. Oh wait, I think I answered that myself. (Can you say HMO?) You all don't know how important this board is to me right now. I'd like to be the brave cheerful one (You GO Otter!) but right not I'm just hanging on. My medical folks have been great, until now. The chemo nurse message line doesn't return calls (really, I've called twice now to the number they gave me, calling before noon, and no one called back that day). It does not make me feel secure as a chemo patient. I am meeting with my onc on Friday, and unless there is a plan where I can talk to a person who can do something within the day, I'm not having another dose. It seems risky and unethical to me to give chemo and then be unreachable. Ok, rant over. I've held on pretty well, but my emotions are all over the place today. Is that a side effect?",
      "MessageIndex": 153,
      "PostDate": "08/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jan 17, 2011 03:18PM revkat wrote: It's been 3 years since diagnosis for me, and one of the things I have noted in following bc research is that different studies get different results. Patients want answers, and we want them now, but I can imagine that physicians who have been following the research for a decade of two have seen new ideas, based a one study, some and go. If I had it to do over, today, with what I know now, I would discuss the study that shows no overall survival benefit for axillary dissection in detail with my surgeon. If I did proceed with one, I would also want to discuss the LE prevention information that is out there, in particular the part about not beginning to stretch at all until healing is well underway (I thought I was supposed to get going with the exercises like the day after surgery). I do have mild LE but in my case I got attention right away and have learned techniques for managing it and have very few problems. My arm never has looked like the horror pictures posted (they showed us worse than that at an LE educational program that went with my treatment). Jane and Molly feel very strongly that no one should have axillary dissections and that no one should take Aromatase Inhibitors. That's their opinion. Each person facing these decisions needs to talk with their doctors, raise your doubts, listen to their reasoning, and make your own decision. I once asked my oncologist how she could stand her job, since there are so many unknowns in bc treatment and we are never absolutely sure it won't come back. She said, \"that's why I treat other kinds of cancer too.\"! Oncologists know how much they don't know with this fricking disease, they would love for their to be a magic bullets, but until that day we slog on into the unknown with what we know.  ",
      "MessageIndex": 66,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 20, 2008 05:38AM revkat wrote: Liz -- I can't imagine having a baby now, congrats on your little boy!  But then I am a bit older than you -- 48. I hope your scans go well. I was really worried about them, but that was the one part of all this that went better than expected. And it is true, what you will hear around here a lot, it does get easier once you have a treatment plan and are  in the \"just do it\" stage.",
      "MessageIndex": 317,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 6, 2008 06:38PM revkat wrote: Lee -- all my grey hair fell out first, but the rest eventually followed (actually I do have very sparse fuzz left. I buzzed it, but never got around to shaving it, so it's kind of fun to imagine how it would look if I hadn't buzzed it -- very thin) Sue -- I really thought I might be sitting in a meeting at work and have all my hair just fall off my head, but it doesn't really work that way. I guess it catches on other hairs, or it dies but needs some kind of pressure to actually fall out (not a lot of pressure but something). Anyway, I wore a scarf to work after the buzz job and before I was really bald. I kind of miss the buzz job days -- that felt sort of hip. Bald just feels. . . bald.",
      "MessageIndex": 737,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 30, 2008 08:42AM revkat wrote: Linda -- I'm going to ask my onco the same question about neupogen today! However, I've only been having 5 shots, so I doubt she'll be interested in any changes. Still, even on the day that is supposed to be my nadir, my wbc is above the normal range. I was hoping to only have say 4 shots this time. That's how much I hate them! I'll let you know what she says. Getting ready for my final TC treatment next week. This round has been a real struggle, what with fever, fatigue, sinus pain, twitchy goopy eyes. My husband says that I seem sort of \"dulled out\", and I feel that way. My mind works so much slower, I don't have anything interesting to say, mostly I just want it to be over. I hope getting the last one and knowing I'm done will pick me up a bit. Like some of you, I've only been able to work about one week out of the 3. Fortunately, like Sue, my work place is just glad to see me when I show up and not very demanding of me right now. Kalyla -- I am so sorry about your complications. I hope you heal up faster than expected.",
      "MessageIndex": 1015,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Apr 8, 2009 10:58PM revkat wrote: My ALT went from 14 before chemo to 109 just before the final treatment. They delayed my last chemo a week and it went down 50 in just that one week. By two months after chemo was done it was back into the 20s. She should call and talk to the nurse just for reassurance, but it will probably come down on its own. There's nothing she can do in the meantime, just don't add a whole lot more work to the liver.",
      "MessageIndex": 6,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/732187",
      "Title": "High ALT (liver enzyme) mid chemo? Husband11 NanaA"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Mar 30, 2009 11:35AM revkat wrote: One study that showed no statistical difference in recurrence rate following  either lumpectomy + radiation or mastectomy. Only mastectomy + radiation was significantly lower. Int J Radiat Oncol Biol Phys. 2009 Mar 1;73(3):734-44.  Ten-year recurrence rates in young women with breast cancer by locoregional treatment approach.Beadle BM, Woodward WA, Tucker SL, Outlaw ED, Allen PK, Oh JL, Strom EA, Perkins GH, Tereffe W, Yu TK, Meric-Bernstam F, Litton JK, Buchholz TA. ",
      "MessageIndex": 46,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731141",
      "Title": "Dear doctor, I wish ... mawhinney 2frogs1princess"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 6, 2011 08:09PM revkat wrote: I am 3 years out of TC chemo and my WBC count has never gone up past 3.8. (on a scale where 4.0 is the low end of normal). It hangs around 3.4 to 3.8. My onco says the chemo has made this my new normal and since my %s of different kinds of white blood cells is good she's not worried. My HCT is also always just below the low end of normal and that doesn't worry her either -- again because the overall ratios of red blood cells are ok. I don't know how low you are, but a rare side effect of tamoxifen is low WBC. ",
      "MessageIndex": 7,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768610",
      "Title": "WBC count low 6 mo after chemo sanbar8771 revkat"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Nov 27, 2008 11:26PM revkat wrote: Well, I saw that video too, and the PT left us alone to view it. But prior to that we had an educational session with the PT and one other woman where we could ask lots of questions. And then after viewing the video the PT spent quite a bit of time going over the massage with me. I never felt like she wasn't open to questions. I had at least 2 follow-up sessions, it's hard to remember now. I did have a horrible time getting my sleeve measured and ordered and delivered. But that was the company that Kaiser contracts with not KP itself. My impression was that I wasn't getting the care that some here have described where the PT actually does hands on massage of them and wraps their arm and teaching them about wrapping. I don't know if that is just because my LE was so mild, or if wrapping is not part of Kaiser's standard of care for LE. I know that Kaiser has a few PTs scattered about CA who are listed on the LE therapist website, and I've thought about emailing one of them to see if I could get a better picture of what Kaiser offers for LE patients. At any rate, I think you should follow up somehow. You could contact member services, or you could start by emailing the PT directly (if you register with the KP website you can email any of the medical personnel who treat you. We've always gotten prompt replies). Maybe you caught him/her on a bad day, maybe this therapist really doesn't know about LE and was just assigned to cover it, maybe it's just a bad match and you can request a different therapist. I don't know, but we've discovered with Kaiser that there often is another possiblity than the one presented, but we may have to dig for it.",
      "MessageIndex": 2,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/725079",
      "Title": "Problems with PT - Kaiser cgoody maxgirl"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "May 12, 2008 04:14PM revkat wrote: Otter, once again you have nailed one of my concerns! I don't have the answer, but I've wondered just because of how things feel in my arm pit and along my arm, it seems like the cording is getting worse, not better, and I do keep doing my exercises. It also feels like my arm is better while I'm on the steriods and then gets to feeling all stiff and achey when I go off them.",
      "MessageIndex": 2,
      "PostDate": "12/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/705419",
      "Title": "Can Taxotere (or Taxol) trigger lymphedema? otter bomber410"
    },
    {
      "AuthorID": "revkat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65090/profile",
      "Content": "Jun 26, 2008 11:28AM revkat wrote: I had a little bit of leakage with Taxotere and Cytoxan. My dr. said that taxotere does something (relaxes maybe?) to smooth muscles so that would explain the reflux so many have had, and the lowering of blood pressure and I assume a little urinary leakage as well.",
      "MessageIndex": 4,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708041",
      "Title": "Leaking urine after chemo tomatojuice NancyD"
    }
  ]
}