{
  "AuthorID": "rferraris",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
  "Posts": [
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Aug 6, 2009 09:27PM rferraris wrote: Angel, I had a drain for almost a year after my bilateral tram!  I can so relate to what you are feeling.  I have a seroma that originally started under my right arm and went al the way down in to my groin on the left side.  My PS cut it out three times, injected it with doxycillian 3 times and injected it with Tisseal.  Needless to say 20 months post-op I still have the waterbed effect going on in my belly.  I have stumped my PS, oncologist, bs and the immunoligist that treated me for staph (2x in less than 1 yr).  They cannot find any documentation on this lasting this long.  The latest thought is that it is actually lymph fluid filling in the pertineum (sp) cavity.  Unfortunately the only doctor that we can find that might know anything about this is the Upstate NY and I live in Central Georgia.   When my seroma was the largest (it is shrinking) I was very anemic and had to have weekly iron infusions.  I was borderline of needing a blood transfusion.  To me it would make sense that blood loss would cause anemia.   Stay positive!  It helps me to try to find some kind of humor in all of this!!  One of my girlfriends told me the other day that all of my docs should be paying me since they are learning so much off of me!!!",
      "MessageIndex": 1,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Apr 18, 2009 10:58PM rferraris wrote: CJ Please visit www.rallyfoundation.org.  They are a non-profit organization that raises research dollars for pediatric cancer.  The founder is a very good friend of mine.  I know that Dean will want to know of your daughter.   You are all in our prayers. Rachel",
      "MessageIndex": 110,
      "PostDate": "18/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "May 27, 2009 10:15PM rferraris wrote: You have to realize that those darn cancer cells are microscopic and we don't know exactly where they are.  Even though it sounds like you didn't have any lymph node involvement, what if there are cells brewing there?  Your treatment is YOUR decision.  Have you met with a medical oncologist yet to discuss treatment options?  I was at a conference for young women diagnosed with breast cancer under 40 and one of the major breast cancer guru's said that if you are HER2+ and receive Herceptin for 1 yr and make it 5 years after that without a recurrence, that your change of recurrence after that point in less than 1%.  Sounds like pretty good odds to me!",
      "MessageIndex": 2,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734898",
      "Title": "I do not want Radiation or Chemo Lexus2009 Beesie"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Aug 10, 2006 03:45PM rferraris wrote: My jewely will made one from any kind of bracelet. He has a charm that can be added to a regular one or will shorten one and add a bar. He recommends the colored (red) ones and not the one that is just gold or silver.",
      "MessageIndex": 8,
      "PostDate": "10/08/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/387146",
      "Title": "bracelet help needed Candyce Binney4"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Apr 13, 2009 02:45PM rferraris wrote: I had three clots in October from a PICC line and one of them was under where my port was (already removed).  Have they told you that you have a jugular clot or is this what you are worried about??",
      "MessageIndex": 4,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/732399",
      "Title": "jugular clot MicheleS deemdee"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Apr 3, 2008 08:59AM rferraris wrote: Ditto!  I'd also be careful about their water & food bowls.  Make sure everyone washes their hands good after petting and caring for them. Cute story...we had one cat and I wanted a kitten for her but dh said no.  One week after my mastectomy we were walking out our front door to go to the surgeon for a follow-up and low and behold there was a kitten crying at our front door!  She walked right in when we opened it.  Well, 18 months later, she is still with us!  BTW....her name is Kemo!!! Best wishes! Rachel",
      "MessageIndex": 3,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703313",
      "Title": "pets and chemo haykat57 mittmott"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Jul 17, 2009 10:25PM rferraris wrote: I have had tremendous pain in my legs and it started about the time I finished TAC & started Tamoxifan.  I have asked my oncologist several times about it and she says that it is not the Tamoxifan.  She did some more blood work on my last visit because the pain has gotten to the point that Tylenol doesn't cut it.  She wants me to \"take it easy\" and to stretch more.  My pain is in my calves, equal pain on both sides at the same time.",
      "MessageIndex": 3,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737329",
      "Title": "legs always sore hopelives rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Jun 13, 2007 01:40PM rferraris wrote:",
      "MessageIndex": 8,
      "PostDate": "13/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/624442",
      "Title": "Neulasta shot didn't work Enaid fireba"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Apr 7, 2008 02:28AM rferraris wrote: Anything by Chris Tomlin, especially Amazing Grace/My chains are Gone. Natalie Grant's Held was written by my friends daughter-in-law is an awesome song. My current favorite is Praise You in this Storm by Casting Crowns.",
      "MessageIndex": 15,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/702650",
      "Title": "Good Christian Music SpunkyGirl SpunkyGirl"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Jun 11, 2008 03:15AM rferraris wrote: I just wore a cami with a little spandex in it.  Make sure whatever shirt you wear you won't care about getting ruined.  Like someone said earlier the markings will fade but mine went around to my back and down my ribs/belly. Compared to chemo, radiation is a breeze! ",
      "MessageIndex": 3,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/707069",
      "Title": "What to wear? Wintermoon623 joteach"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Mar 3, 2009 06:33PM rferraris wrote: You need to get that fluid out!  I have had a major seroma since my recon 12/07.  Mine started under my right auxilla and went all the way to my groin on my left side.  The aspiration shouldn't hurt too bad, maybe just a little sting at first.",
      "MessageIndex": 3,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730043",
      "Title": "self diagnosis.......seroma skippyrcis rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Mar 5, 2009 11:25PM rferraris wrote: I've been dealing with a seroma for over a year!  I've stumped them all here and have even been to Atlanta to Emory University.  I spent 90% of 2008 with either a JP drain or a penrose drain.  The few weeks that I didn't have a drain I would go in for weekly aspirations.  I'm down to going about once a month.  They can explain what is going on but not why.  I am so tired of this and ready to move on.  I cannot have my modification for my reconstruction until I've done 6 months with no fluid. My immunologist think that my lymphatics have been messed up and there isn't anyone locally that can do some kind of lymphatics test.  I think I may win an award for the longest healing time for a bilateral tram (15 months so far!!)",
      "MessageIndex": 15,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730043",
      "Title": "self diagnosis.......seroma skippyrcis rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Jul 13, 2009 10:14PM rferraris wrote: Jenns I was 35 when I started chemo in 2006.  I was stage III, invasive ductal carcinoma & lobular.  I had 13 positive nodes so I did have to hard stuff but I made it through!  I too was ER+ but was HER2-.  Waiting a couple of weeks will be fine.  That will give her body time to heal from your surgery.  If you need chemo you need to be strong when you start.  I'd bet that they will at least give her Herceptin since you were HER2+.  I didn't have it but my friend did.  From what I understand it was a breeze compared to everything else.   Best wishes & stay positive!! Rachel",
      "MessageIndex": 1,
      "PostDate": "13/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737370",
      "Title": "anyone 40 Y.O. and having chemo? jennsdogs Lisa-Lisa"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Oct 30, 2008 09:16PM rferraris wrote: FYI...Komen's next round of national funding is for translational research (to the patient in 10 years of less). Re pancreatic cancer...My best friends father just passed away from pancreatic cancer two weeks after his diagnosis.  Pancreatic is the 4th leading cause of death and unfortunately, by the time you have a diagnosis it is to late.  There hasn't been any advances in pancreatic cancer is 30 years.  Think of how far we've come in 30 years with breast cancer research.",
      "MessageIndex": 22,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723236",
      "Title": "Breast Cancer hogging the spotlight Fitztwins magsandmattsmom"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Aug 16, 2008 05:16AM rferraris wrote: Each Komen affiliate (120+) grants money in their community based on needs.  25% of each race goes straight to National to fund research.  I would advice you to contact someone in your local affiliate about resources.   For more information on the grants that Susan G. Komen for the Cure funds please visit the Komen website (www.komen.org) and click on the grants tab.",
      "MessageIndex": 4,
      "PostDate": "16/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719571",
      "Title": "Is anyone getting help from Komen? pinkpig fire"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Aug 16, 2008 04:59PM rferraris wrote: Fla...Have you ever met anyone that takes Tamoxifan?  Herceptin?  Well, you've met people that have been helped by Komen.  Komen has funded more research than any other organization.  Also ladies, the name is Susan G. Komen for the Cure, not Komen foundation.  I don't intend to sound snappy but you might want to do a little research about the organization before you start complaining about what they \"don't\" do.  Do you know what Komen's mission statement is?  \"A world without breast cancer\" and we are doing everything possible to complete that goal!",
      "MessageIndex": 10,
      "PostDate": "16/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719571",
      "Title": "Is anyone getting help from Komen? pinkpig fire"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Mar 30, 2008 09:47PM rferraris wrote: FYI...the \"clot\" is really protein.  I am on my 6th set of JP drains and I got worried the first time I had them.  Yes they do go a long way!  I have two in my pubic area right now (reconstruction) and one of them goes all the way up in to my breast. Rachel",
      "MessageIndex": 18,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703036",
      "Title": "Drain tube broke!!! RJ62 RJ62"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "rferraris wrote: I had a bilateral tram 5 wks ago and now have swelling down my left arm (cancer side).  I will be starting Lyphedema therapy on Friday morning.  I've been told to keep my arm elevated above my heart as much as possible.  Any other advice? Rachel Dx 7/13/2006, IDC, 5cm, Stage IIIB, 13/25 nodes, mets, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/698666",
      "Title": "Newbie here rferraris rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Jan 21, 2008 05:33PM rferraris wrote: Saw the therapist and she says we have caught things very early.  I am going 3x a week for massage and have daily exercises.  On Wednesday she wants my husband to come so he can learn how to \"massage\" me on my off days with her.  I've been overcompensating from my recon on 12/11 so my shoulder is very tight.  I'm looking forward to my next session on Wednesday! Thanks ladies! Rachel",
      "MessageIndex": 5,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/698666",
      "Title": "Newbie here rferraris rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Aug 17, 2008 03:11AM rferraris wrote: What is a \"board state\"?",
      "MessageIndex": 15,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719571",
      "Title": "Is anyone getting help from Komen? pinkpig fire"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Aug 17, 2008 04:11AM rferraris wrote: Ann, I did not mean to be harsh, just couldn't understand the comment.",
      "MessageIndex": 17,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719571",
      "Title": "Is anyone getting help from Komen? pinkpig fire"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Aug 18, 2008 02:59AM rferraris wrote: Someone asked if I work for Komen and I do not. I do spend a large amount of my time volunteering in my local affiliate working health fairs, speaking to other survivors & newly diagnosed families, giving out educational material, etc. Another one of the hats that I wear with our affiliate is Public Policy chair. Komen has worked very hard in educating our National & State leaders on the importance of funding for access to equal treatment for all, early detection/screening & translational research (out of the lab and to the patient). I take it very personal when someone starts bashing Komen for what they \"haven't\" done without acknowledging what we have done. Do people not realize this organization started with a promise to a dying sister a little over 25 years ago to end breast cancer forever? Nancy Brinker started Komen for the Cure in her living room with $200 and a shoe box a names. Please read Nancy & Susan's story from the komen.org website. In the last 25 years Komen has funded more than $1 BILLION in research. Who else has done that? We've committed another $1 BILLION in the next 10 years. FlaLady I'm sorry that you feel like you were treated like a lab rat. Where you forced in to a clinical? Shame on the clinic where you received treatment if they did not inform you properly of all the risks. I recently met a girl my age who was diagnosed about the same time I was. Her Grandmother was in a clinical trail 20+ years ago for Adriamycian. Because of her Grandmother's unselfishness, she helped save her life and so many others, years before her Granddaughters diagnosis. My cancer was too advanced to do a clinical because of my young age (stage III @ 35) but I'd do anything in my power so that another young family doesn't have to face the battle that mine has been on for the last 2 years. Also, Komen's budget is nowhere near $40 billion. Komen has granted out $1 billion since 1982, and it's yearly budget is around $275 million. $200 million of that went to breast cancer research, breast cancer screening, and treatment. 75% of the money raised by the local affiliates stays in the local service area. But, before any money is granted, a grant request must be made and presented to the grant review board. If the grant review board agrees with the grant request, it is forwarded to the local Komen board for a vote. Sometimes, the board will turn down a request because there are additional questions that need to be addressed. But if your local affiliate is not spending the money that you see fit, then get involved with them. Don't just stand on the sidelines and point fingers. You can't just call a local Komen affiliate and ask for money. The affiliates want to make sure every dollar they spend is accounted for, and goes toward the mission. The process I detailed above ensures that. Again, I would encourage you to get involved with your local affiliate and help them make those decisions as to where the money is to be spent. By the way, there is no Komen \"state board\". Each affiliate is their own autonomous organization.",
      "MessageIndex": 30,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719571",
      "Title": "Is anyone getting help from Komen? pinkpig fire"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Jan 30, 2008 09:59PM rferraris wrote: I made it to the \"next\" level today and got my sleeve.  I wore it for 5 1/5 hours and realized my hand was HUGE.  Is this normal?  Ofcourse it was after hours so I couldn't call anyone. Tx Rachel",
      "MessageIndex": 9,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/698666",
      "Title": "Newbie here rferraris rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Jan 31, 2008 07:51PM rferraris wrote: I stopped by today so the therapist could look at it.  She didn't think it was swollen but it was very puffy to me.  She now recommends that I wear my sleeve a couple of hours every other day.  To make matters worse, I broke out in a fever again today.  I had a tram recon in December and have already completed three rounds of very strong antibiotics.  My PS is very concerned and got me in with an Infectious Disease Specialist at 9 in the morning.  When will this roller coaster ever end???",
      "MessageIndex": 14,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/698666",
      "Title": "Newbie here rferraris rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "Sep 26, 2006 04:17PM rferraris wrote:",
      "MessageIndex": 1,
      "PostDate": "26/09/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/431050",
      "Title": "The October 2 issue of People Magazine marymi rrs"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "May 28, 2009 06:24PM rferraris wrote: Beth, I haven't had any heart trouble except low blood pressure.  My clots are in my arm/under my port scar and they were due to multiple attempts putting in a PICC line. I have been tested for Factor V and do have it.  Thankfully I've gone through 15 surgeries in 3 years and those are the only blood clots that I've had.",
      "MessageIndex": 10,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734157",
      "Title": "severe leg pain rferraris rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "rferraris wrote: I am 37 and had stage III IVD in 2006 treated with mastectomy, 6 rounds of ACT, 33 rounds of radiation and so far 2 years of Tamoxifan. In 12/2007 I had a bilateral TRAM.   My question is this.  Does anyone else have pain in the back & legs?  Both legs hurt to the point that it feels like I've been beaten with a baseball bat.  I've asked about my legs and they aren't worried about it because the pain is equal in both legs.  They don't think it is the Tamox.  I'm so tired of being sick, tired & hurting. Dx 7/13/2006, IDC, 5cm, Stage IIIB, 13/25 nodes, mets, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/728996",
      "Title": "Pain all over rferraris sueps"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "May 14, 2009 07:41PM rferraris wrote: Thanks for your suggestions!  I am already under the care of a neurologist because the left side of my face went numb back in February.  I will be sure to bring my legs up to him when I see him in a couple of weeks.  Rachel",
      "MessageIndex": 5,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734157",
      "Title": "severe leg pain rferraris rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "rferraris wrote: Since I finished treatment early 2007 I have had extreme leg pain in both legs.  The pain is every day and at times it is hard for me to walk.  I've been on Tamoxifan for 2 1/2 years and have asked my oncocologist and a PA about it and no one can give me an answer.  They always say that if I was on AI it would make sense but not Tamoxifan.  Has anyone else experienced this?  Also, exercise and stretching has not made a difference. Dx 7/13/2006, IDC, 5cm, Stage IIIB, 13/25 nodes, mets, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734157",
      "Title": "severe leg pain rferraris rferraris"
    },
    {
      "AuthorID": "rferraris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31620/profile",
      "Content": "May 20, 2009 02:07PM rferraris wrote: I am going tomorrow for a doplar in my legs.  She is ordering this to be on the safe side because I have three blood clots (2 in rt arm and one under the scar of where my port was) but I know the pain has nothing to do with a blood clot.  Today I was volunteering for Komen at a health fair and the booth next to us had a bone density screening machine.  I am very close to osteopenia.  The radialogist that did the test didn't like my score because of my age (38) and that I am already taking 1000 IU of Calcium.  I will take that sheet with me tomorrow when I see my oncologist.  I have a feeling that a full bone density scan is in my near future.",
      "MessageIndex": 8,
      "PostDate": "20/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734157",
      "Title": "severe leg pain rferraris rferraris"
    }
  ]
}