{
  "AuthorID": "RhodyMMM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
  "Posts": [
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 1, 2014 01:15PM RhodyMMM wrote: Jojo, thanks so much for the encouragement!",
      "MessageIndex": 20044,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 20, 2014 07:48PM RhodyMMM wrote: Septmom, I finished Adriamycin/Cytoxan in November and then started weekly Taxol which I finished 2 1/2 weeks ago. I do have some hair growth on my head, it seems to be filling in from the sides up. The top used to be completely bald, but it is slowly filling in. I noticed 5 o'clock shadow for the eyebrows a week or two ago, and just this week I feel like I have tiny little mini eye lashes to put mascara on (instead of the rogue longer eyelash and sticking myself in the eye!)",
      "MessageIndex": 20167,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Apr 20, 2014 11:01AM RhodyMMM wrote: oranje_mama, I have been using Nioxin products since my hair started to come back in. Don't know if it really makes a difference or not. My hair seems very soft....I  use the shampoo and conditioner, and the scalp treatment too. It feels good on my scalp, a little tingly. It's expensive but I only need a tiny amount. I finished my A/C mid-November, and then finished Taxol on 2/28. I suppose any shampoo that is gentle and conditioning would be fine. The trick is to make the hair healthy from the inside out.....that's what the Biotin is for. I was taking Biotin for a while but have forgotten it lately....I take so many pills every day I feel like a pharmacy Martha",
      "MessageIndex": 20248,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "May 4, 2014 02:52PM RhodyMMM wrote: My nails also are a mess. My big toenails started going bad in October, about 6 weeks after I started Adriamycin. Then the Taxol took over. the big toe nails are starting to improve at the bases, but the middle to end is quite thick and misshapen. I am having trouble cutting them, so I am thinking it might be time to break down and go see a podiatrist. My fingernails have all lifted, and they are so brittle that they break very easily. I have never been a vain person, but I do notice people looking at them with odd expressions. Before they started coming apart from the nail bed they became discolored and I looked like I had tobacco stains on all my fingers! Kind of a funny hair story.....I met a woman the other day at a rowing class. I was wearing my ball cap and said something about my hair coming back in. She asked what it was from and I told her chemo. She said, \"oh I saw a woman the other day who was TOTALLY bald! You could see her entire scalp!\" I said that's how I was just a few months ago, and she said \"no I mean totally bald.\" I said that's what I mean, my husband used to comment on how shiny my head was. She just stared at me. I found it humorous. I think this week may be the week that I finally ditch the wig at work. Have a great week everyone!",
      "MessageIndex": 20263,
      "PostDate": "04/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 2, 2014 11:03AM RhodyMMM wrote: Timbek2, you look great! I love the short \"do\" on you! Your husband is right.....no one knows what we have been through. I see the hair regrowth as a sign of strength and perseverance. The chemo was brutal, I just finished on Friday. Never thought I would make it, had to work the whole time. I think I plan to stay short for a while when it gets to that point, although I have always had short hair. My hair was the longest in years before I lost it. Just long enough to tuck behind my ears.....so not long for many! Everyone tells me to style my hair like my wig, which is highlighted and a little longer on top than my usual, but we will see. I can't wait to go au naturel again (which I do at home now...). But I must admit that I am loving the no maintenance aspect........ Here's to all you gorgeous ladies out there.......your hair (or lack thereof) is a true badge of courage and honor. And I think we all give a knowing look to other women when we see the \"do.\" We all know what it means! Martha",
      "MessageIndex": 20056,
      "PostDate": "02/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jun 19, 2014 12:03PM - edited Jun 19, 2014 12:03PM by RhodyMMM Woohoo.......this morning my husband said I actually look like I have a hair style!",
      "MessageIndex": 20471,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 9, 2014 06:32PM RhodyMMM wrote: MaryFox, I can't speak for you, but it did bother me some when my eyebrows disappeared. It was even worse (just recently) when I realized that all of a sudden my eyelashes are gone. I think because it gives you the \"chemo look\" that makes it apparent to the rest of the world. It makes you look \"sick.\" At least that's how I feel. As far as the manicures, I was told to bring my own tools if I go because I had 18 lymph nodes removed on my right side, so I am at risk for lymphedema and infection. Martha ",
      "MessageIndex": 19850,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 10, 2014 09:58PM RhodyMMM wrote: Hi nursenadia, your post made me laugh and think back to when I was a kid. I have always had short hair, in fact I had just grown it a ittle bit longer (below my ears!) before I got the diagnosis and the chemo. You speak of looking like a male KGB agent. When I was a kid (about 12, before growing breasts) my younger brother and I would go to the local Woolworth's 5 and 10 store sometimes to have lunch at the lunch counter. The waitress would always say.....\"what can I get you boys?\" And every one told me that I looked like Bobby Orr, who was an NHL hockey player for the Boston Bruins. It just occurred to me that I could go out now with a hat and no hair, no foobs and be flat chested.......\"what can I get you boys?\" Somehow I'm not sure my husband would appreciate it if someone though he was out with another man........ I too will be glad to get rid of the wig. It's getting more and more itchy as the hair starts to come in. It is getting noticeably thicker along the sides but the top is quite sparse. When it came out it was primarily on the top. There was always some stubble on the sides and low back, I just kept shaving it to keep the itchiness down. But this morning I noticed that you can actually see the hair on the sides without a magnifying glass! ",
      "MessageIndex": 19863,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 4, 2014 06:51PM RhodyMMM wrote: I just noticed yesterday that I do have a 5 o'clock shadow at the eyebrows. Still not sure about the eye lashes. My hair is growing in length, and slowly filling in on top. I have been taking Biotin 5,000 mg; it seems to be a standard dose. Also trying to make sure that I am getting enough protein in my diet (I have been working on that all along as my total protein levels were low post-op and throughout my chemo). I believe that protein intake is critical.....topical solutions and shampoos don't feed the foundation, nutrition and diet are where it starts. All I know right now is that I can't stand having the wig on; as soon as I get home from work I take it off. As of yesterday I am keeping a hat in my car so that the hair can come off as soon as I get out of work and I can go without until I return to work. So itchy! The Look Good, Feel Better Program through ACS is great. It is a fun class, gives great tips, and free products. Also a chance to connect with others who are in the same boat.....",
      "MessageIndex": 20078,
      "PostDate": "04/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "May 29, 2014 07:08PM RhodyMMM wrote: aff, I think your hair is ADORABLE!",
      "MessageIndex": 20381,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 19, 2014 11:27AM RhodyMMM wrote: Carrol2, thanks for the picture timeline. That is very encouraging! You have a fabulous head of hair. If you don't count the first three weeks after my last A/C (cuz that's when it would fall out), then I am about 7 weeks out and finally starting to see some noticeable changes. DH checks it every day :). Hopefully before too long I will have more hair then he does! Have a great day! Martha",
      "MessageIndex": 19915,
      "PostDate": "19/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jun 17, 2014 01:30PM RhodyMMM wrote: My hair also started coming in from the sides and back upwards. I am finally really feeling some thickness/fullness on top. It is still very short, and I actually love it this way. I have complete strangers telling me they love my hair cut! I love the no-maintenance and will probably go just  a little longer on the top. The problem is, even though the majority of folks love it, my husband does not. I have always kept my hair on the short side, but it was the longest in years for my daughter's wedding last September, which was 5 days before I started chemo. Needless to say, two weeks later it was gone. I'm thinking the reason my hubby doesn't like it is that he is the one who buzzed it short after the chemo, and he has seen it all come out and then start coming back in and doesn't see the changes so much as those who only saw it after the wig came off. Mine is also salt and pepper, which makes me feel old, but I was going gray before. I will try to post pictures when I get home tonight, right now I am at work. Martha",
      "MessageIndex": 20462,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 4, 2014 04:36PM RhodyMMM wrote: Think I will jump in on this thread too. My last A/C was November 7, I started Taxol the day before Thanksgiving. I do have hair coming back, it started a couple of weeks ago I think, some of it is about 1/2\" but very thin and not sure of the color. Hubby says it's medium brown, I see a lot of white. I am unsure about the hair products...it would seem to me that a shampoo formula cannot change your base hair since it grows from within. The man who sold me my wig would be more that happy to sell me several products at $20 per bottle! I have generally had short hair my whole life, so I will be happy when it fills in and short is good. Ironically just before I started the chemo I had a longer \"do\" that I was happy with for my daughter's wedding. But c'est la vie! I haven't read all the posts in this thread, just the first page and the last two. I will have to meander my way through the others to see what info I can find. Just recently I noticed that my eye lashes are nearly gone, as are the eyebrows. I could tell the brows were thinning through the chemo, but all of a sudden one day they disappeared! Never used brow makeup before, but I do now! Martha",
      "MessageIndex": 19807,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 5, 2014 02:47PM RhodyMMM wrote: I cannot tell yet what color mine will come back in. Looks white right now but it's too early too tell. Part of me says to deal with what comes naturally.....it's a badge of courage after what we have all been through!",
      "MessageIndex": 19815,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 8, 2014 09:37PM RhodyMMM wrote: I worry about manicures....was told to be careful due to lymphedema risk/infection and neutropenia.... ",
      "MessageIndex": 19843,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 30, 2014 07:53PM RhodyMMM wrote: MaryFox, I'm with you...I never liked futzing with my hair either! I always kept it short, although just before chemo  I was wearing it in a slightly longer style that required more maintenance. I always preferred wash 'n wear. I have enjoyed the no maintenance hairless deal......real quick shower and done! But my regrowth is starting to come in, more on the sides and back, less on top. To me the hair growth is visual evidence that there is a \"return to life\".....a regrowth/regeneration of sorts. I think my hubby sees it the same way. Biggest problem right now.....it' so ITCHY! I can't wait to get home from work every night and take my \"hair\" off! Martha",
      "MessageIndex": 19963,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 31, 2014 08:28PM RhodyMMM wrote: I also started Biotin while I was still getting the Taxol, MO said it was fine since it's a supplement. I take 5,000 mcg, that seems to be the standard recommended dose. Not sure if it is helping, but I think the bases of my nails are starting to look more like normal. My hair is finally starting to fill in, but don't know if the biotin is making a difference or if it's just because I am now 4 months post-Red Devil (aka Adriamycin). I also try to make sure I get plenty of protein in my diet as I have had a low total protein level and low hemoglobin since I started chemo at Labor Day.",
      "MessageIndex": 20213,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "May 13, 2014 08:16PM RhodyMMM wrote: Haha lago and KAT. I grew up in Wellesley! Moved around quite a bit after getting married and now settled near Pittsburgh, PA",
      "MessageIndex": 20282,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Aug 13, 2013 08:44PM RhodyMMM wrote: Hi all, I am also waiting for results....but in a different way. I had a biopsy in May which showed DCIS. My surgery was in June, the post-op path report showed extensive DCIS along with IDC, two positive sentinel nodes, hormone status said ER+, PR+, HER2-. The medical oncologist wanted to get an oncotype screening which took nearly 4 weeks to get back. Last Friday she called with the results.....ER-, PR-, HER2- and a score of 57 which means high risk for recurrence. The complete opposite of the original pathology report. Can things change that much in a month? Or is one of them the wrong sample? Or was one of them not done correctly? So now they are sending tissues out again for a redo of both the pathology and the oncotype, as well as adding a test called a mammoprint...apparently something they have been doing in Europe but don't do so often here in the States.....So now I wait--AGAIN--for probably 3-4 weeks! It's now been over three months since my original biopsy, over two months since my surgery....thankfully my scans were clear (bone scan, CT of the chest, abdomen, and pelvis) but this waiting is completely unnerving. I would just like to know the plan and prognosis so I can move on in my journey! I'm 53 with two grown children, no grandkids yet but really want to! ROXANN......I live in Delmont! We're practically neighbors!",
      "MessageIndex": 4,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/809216",
      "Title": "The wait is the worst Hla76 alicki"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 15, 2014 07:51PM RhodyMMM wrote: Oh Mercedes, I know exactly what you mean! I am not looking forward to tomorrow when the pain will return with a vengeance. Today was not too bad but I can feel it starting to creep up. The neuropathy is terrible. The doctor gave me gabapentin but I have not started taking it yet, I really don't want to add any more drugs if I don't have to. But I have it if I need it. I know what you mean about the legs feeling heavy, too. Are you retaining fluid? Check your ankles and lower legs by pressing your finger tips in or checking at the top of your socks. If you see an indentation then you might need some Lasix. Especially if it is still there in the morning after laying down all night. I did ask my doc for some Lasix because I was really swelling up, it helped a lot. He gave it to me for three days to get the water off, and then refilled it so I have it if I need it. I actually lost 4 pounds! The Taxol and Decadron both cause fluid retention. It all stinks.....I was just thinking today that I really wish I could take the next three weeks off of work to get through the rest of this, but I need the paycheck. And there is lots going on at work right now that I need to be there. I've worked through all of this. As hard as it has been, it has also been a good diversion. Thankfully my boss is terrific, as are the CEO of the company. Helps a lot, and they know I give it my best. I do find that hot showers are awesome, and any time that I can find sunshine coming in a window I feel like a cat...just want to stretch out! Wishing you the best.......it's almost done! I keep telling myself (and everyone else) that the treatments really suck, but the alternative is NOT an option!",
      "MessageIndex": 2082,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 12, 2015 08:49PM RhodyMMM wrote: Thanks Jennie, I know that he is not afraid of hurting me because I never had any pain at the sites. I still have a fair amount of numbness. He did tell me that he knows I don't feel much there. I did notice last night that when we were in bed to sleep that his arm came a little higher up, maybe that's a bit of progress. I know that I will never have the sensual responses that I used to have, I just want the closeness. I hope that we will get there, but at the same time we are very close in many other ways. I do think it's time to get the antidepressant script filled. I would rather not but I know that my mood is also affecting him in a negative way. Need to start the spiral back upwards instead of continuing downwards! Thanks for the support ladies, it's so nice to have a place to go where there are people who truly understand! XOXO Martha",
      "MessageIndex": 29,
      "PostDate": "12/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/826432",
      "Title": "Body image concerns 5 years post bmx - feeling vulnerable beacon800 tsoebbin"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 15, 2014 05:21AM RhodyMMM wrote: Tarot, welcome, and good luck to you! So many decisions to make! I would suggest that you look on some other threads for input regarding which procedure to consider. I did not do reconstruction so I don't know which threads to suggest, but I'm sure others here did. If you find the right threads then you will get into some really good discussions that may help you. Have you spoken to the plastic surgeon to get all your information to help you! Mercedes, you and I are on very similar paths. I had Taxol #10 yesterday, 2 more to go. I started this part of the battle on 9/6 and with all the complications I have had, I never thought I would see the end in sight! I have had profound febrile neutropenia three times, another bout with severe neutropenia without fever after that, but my counts are finally slowly on the uphill climb. Had to skip Taxol twice to get them back up, which extended the length of the treatments, but doing better now. Counts are lowering, but not like they did with the Adriamycin/Cytoxan. The Taxol is very drying......I also have nosebleed every day. I have learned to NEVER blow my nose! Or Niagra Falls starts flowing! I take aspirin every day because there is strong family history of early heart disease, and I have been watching my platelet counts. I cut back from 2 baby aspirins (81 mg each) to one and that has helped a little. My PCP says that's okay to do. I was taking Claritin to try to open my sinuses because the Taxol seems to cause some nasal congestion for me, but the Claritin dried my sinuses out so much that I was having spontaneous nose bleeds for no reason at all. The air right now is do dry with the heat on....both at home, and more so at work. That does not help. Hopefully soon it will warm up and we can cut back on the dry heat! But my nose just keeps running, and every time I wipe it I get a pink/red reminder that nosebleeds are just waiting to happen. But if all goes according to plan then Taxol #12 will be on 2/28 and I can start looking forward a bit more. Of course then it's time to add the Arimidex. I see lots of people are taking Claritin to help with the bone pain.........at least when I start that it will be spring time and the heat will go off (but allergy season will be starting!)--yikes I can't win for losing!  :). For now it's early Saturday morning, the Decadron is doing it's work and I've been up since 3am. We are in the process of cleaning out some major junk from the house, so today I will have the restless energy to do it, but hubby is snoring peacefully right now and I don't want to wake him....he has been so good to me and he needs his rest. Have a great weekend everyone!",
      "MessageIndex": 2080,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Apr 26, 2015 05:26PM RhodyMMM wrote: Amy, I love your wine remedy! I find it works best when we both drink it! :) I did start the Prozac about a month ago and it has really helped my frame of mind. It doesn't change my situation but it helps my psyche. I have so much to be grateful for, I need to stop the pitty party because it's not fair to him. Martha",
      "MessageIndex": 35,
      "PostDate": "26/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/826432",
      "Title": "Body image concerns 5 years post bmx - feeling vulnerable beacon800 tsoebbin"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Aug 14, 2013 02:53AM RhodyMMM wrote: 5 minutes ago RhodyMMM wrote: Hi all, I am also waiting for results....but in a different way. I had a biopsy in May which showed DCIS. My surgery was in June, the post-op path report showed extensive DCIS along with IDC, two positive sentinel nodes, hormone status said ER+, PR+, HER2-. The medical oncologist wanted to get an oncotype screening which took nearly 4 weeks to get back. Last Friday she called with the results.....ER-, PR-, HER2- and a score of 57 which means high risk for recurrence. The complete opposite of the original pathology report. Can things change that much in a month? Or is one of them the wrong sample? Or was one of them not done correctly? So now they are sending tissues out again for a redo of both the pathology and the oncotype, as well as adding a test called a mammoprint...apparently something they have been doing in Europe but don't do so often here in the States.....So now I wait--AGAIN--for probably 3-4 weeks! It's now been over three months since my original biopsy, over two months since my surgery....thankfully my scans were clear (bone scan, CT of the chest, abdomen, and pelvis) but this waiting is completely unnerving. I would just like to know the plan and prognosis so I can move on in my journey! I'm 53 with two grown children, no grandkids yet.",
      "MessageIndex": 9,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/808993",
      "Title": "Oncotype test-waiting and waiting.... brown471 SpecialK"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 8, 2015 07:58PM RhodyMMM wrote: Hi ladies, time to post again. Ever since my BMX my hubby won't touch my chest wall. He will touch everywhere else but not there. I would so love for him to touch my chest; I consider my BMX scars my \"life lines\" and it's also where my heart is. This morning I asked him if my chest repulses him and he said \"no,\" but said that he is having a hard time dealing with it. I said \"that's where my heart is\" and he said \"I know.\" He has been so good to me, and I know he loves me. Later I asked him if he would have been happier if I did recon and he said \"no, it would be the same.\" He knows I have limited feeling in the chest area, and without nipples, well you know............I saw my PCP the other day for a routine follow up and he gave me a script for Prozac for \"reactive depression.\" Said it's not unusual for someone to go through surgery and chemo, etc. and focus on fighting, and then after the dust settles fall into a depression. I think that's where I am at right now. I hate to add any more meds but I think I need to. Adaptecss I agree that we are so much more than our breasts. I am finally OK without them (I miss them but have moved on) but I worry about my hubby. I had many complications during my surgery and subsequent chemo, and his focus was on taking care of me. But now we have settled into our new reality and we both are struggling. Ariom, to your previous post, my hubby does not like to talk, he never has. I did try to open the discussion a couple of times today  but it's hard for him. He's never been one to talk about what's bothering him. I broached the subject this morning and then again this afternoon. I asked him if he regretted that I did not have reconstruction, and he said absolutely not, the issues would be the same. Which I agree. I am very glad that I did not do recon. I guess that I am just having a pitty party right now.....thanks for listening! Martha",
      "MessageIndex": 23,
      "PostDate": "08/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/826432",
      "Title": "Body image concerns 5 years post bmx - feeling vulnerable beacon800 tsoebbin"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 9, 2015 09:40AM RhodyMMM wrote: Ariom, I knew you would be there for me! It's so hard; I feel bad being upset with him because I know he loves me. And I know it's hard for him too. He's never been one to talk about his feelings so I hate to keep asking. We did talk a little more last night. We will get through this as we have all the other trials of life. I definitely accept your hug from across the ocean! Martha",
      "MessageIndex": 25,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/826432",
      "Title": "Body image concerns 5 years post bmx - feeling vulnerable beacon800 tsoebbin"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 6, 2015 08:42PM RhodyMMM wrote: ThinkingPositive,  I had DCIS in the left, and IDC in the right so went for the BMX. Two sentinel nodes on the right were positive and she removed 16 more lymph nodes on the right and they were all negative. The two sentinel nodes on the left were negative. Personally, I would have done whatever the specialists recommended. I am fortunate that my docs are within a medical center that is world-renowned for cancer treatment (one of the top 5 in the country); and I am a former oncology nurse and know too much for my own good :). The RO said no radiation was necessary, he gave his reasons (the BMX, clear margins, etc.) and I was comfortable with that.",
      "MessageIndex": 2215,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 13, 2015 08:08PM RhodyMMM wrote: Hi Girls, I just found this thread today. Was searching for some answers and support for myself and came across it. Ariom, nice to see you here! I have found recently that I am having some body image issues too, especially around my hubby. The only time he really looked at my chest was the night after I came home from the hospital and I had a problem that put me back in the ER with an open incision and hemorrhage. Through my haze I can remember being hysterical and crying that I didn't want him to see it like that. But I don't show it to him now, either. I suppose I should talk with him about it, but I don't know how to start the conversation. When I was in treatment I tried to find ways to try to look \"sexy,\" but that didn't work. I've never considered myself to be sexy, so I think the attempt probably looked pathetic to him. I had BMX, so I either have two prostheses in for balance, or I am flat chested. I have not been in a position to be uncovered in front of other women (except my physical therapist and mastectomy bra fitter who are both professionals), so I can't speak to that. I have experimented with not wearing prostheses around close friends on the weekends and have noticed some odd looks, but that could be my imagination too. I find more that people probably don't even think about it because when we are with friends a lot of the guys make jokes about boobs, etc. which upsets me but I let it go. More than anything I miss the sensation, and I know that recon would not change that. My chest wall has been mostly numb since my BMX so there is nothing that can change that. Beacon, I too have buried my feelings about my self-image. I am comfortable with myself but I feel bad for my hubby. He said from the beginning that he has never been a \"boob\" man, but my breasts were a big part of my sexuality and now I feel like I have no sexuality anymore (the chemo and the hormone suppressant therapy certainly doesn't help!) HUGS to all of us. Martha",
      "MessageIndex": 19,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/826432",
      "Title": "Body image concerns 5 years post bmx - feeling vulnerable beacon800 tsoebbin"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 27, 2015 01:23PM RhodyMMM wrote: Still haven't started the Prozac yet but I might this weekend. I really appreciate all the tips from you ladies. Amy, good idea about the shower, I will have to think about that. Although we haven't taken a shower together in years! He is doing a much better job of caressing my back, etc. We'll get there, I know. I think that the reality of life has sunken in now that we are outside the daily fight for survival that came with surgery and then chemo. Maybe if I start the Prozac I will feel better, I do know that I am in the throes of depression these days. Trying to use natural remedies but ready to go \"chemical.\" Hugs to all of us! Martha",
      "MessageIndex": 33,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/826432",
      "Title": "Body image concerns 5 years post bmx - feeling vulnerable beacon800 tsoebbin"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 8, 2014 07:32AM RhodyMMM wrote: Warrior70, I too am looking forward to the post-chemo life.....salads and fresh fruit! Through my A/C I had serious problems with neutropenia and could eat very little fresh fruits or veggies. Now my bone marrow seems to have recovered; I am late into the Taxol, and eating salad nearly every day. I do still have to nag DH about washing it though......My new problem is that my tastes are funny and anything that is a bit tangy or sour is exaggerated. So blue cheese dressing tastes funky to me. So I try new dressings and tastes, and stay away from the ones that are offensive right now, because I don't want to end up not liking them later. Stay warm everyone! Martha",
      "MessageIndex": 2062,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 4, 2015 04:37PM RhodyMMM wrote: ThinkingPositive, I believe one of the determinants regarding radiation therapy is whether or not there were clear margins when the tumor(s) was removed. If you had done lumpectomy then you would likely have radiation, but after mastectomy it is different. I had bilateral mastectomy, my largest tumor was 1.4 cm, and my margins were clear. No radiation was recommended, but then I ended up with unexpected chemo. Good Luck! Martha",
      "MessageIndex": 2211,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 10, 2014 07:16PM RhodyMMM wrote: Mercedes, I also find that my tastes are strange with the Taxol. During A/C, I really didn't taste much. Now with the Taxol, anything sour or tangy seems exaggerated. I do love ranch dressing, though! And I have had a sweet tooth since the very beginning of chemo. They say Taxol gives you a metallic taste in your mouth, mine tastes like road salt (and we have plenty of that around here this winter!). I first noticed it one night when I went to brush my teeth--thought there was something wrong with the water. And then I noticed that I drank water from somewhere else, and it also tasted very salty. And then the bottled water tasted salty. So I knew it wasn't the water, but my taste buds. And now the dry mouth is getting worse, especially at night. So I have been using Biotene products, they are moisturizing.",
      "MessageIndex": 2073,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 23, 2014 10:35AM RhodyMMM wrote: Congratulations Mercedes! I love that you got to \"ring the bell......\" I will be done next Friday (as long as my counts hold up, they are on a downhill trend right now.\" I'm not sure if they do anything symbolically in the chemo clinic when someone finishes, but I will definitely ring the bell on our boat when we get home next Friday. By the way, my ship's bell is engraved \"The Good Ship Chaos,\" it came from my father's office in an old sea captain's house in Portsmouth, NH. LOL Good luck with your next steps. I had my surgery before chemo (at the time we did not know that I would need chemo). My next step will be Arimidex for 5 years......after a much-needed trip to the beach in early April! Need to treat my hubby (and me) to a much-needed retreat!",
      "MessageIndex": 2095,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 2, 2014 09:48AM - edited Mar 2, 2014 09:54AM by RhodyMMM Hi Mercedes, I am originally from Mass., but now live near Pittsburgh, PA. Did not ring the bell yet because we have been staying at our house the last few days....currently in the midst of another winter storm, so will get back to the boat probably Tuesday. I will send you a picture of the bell. Thank fully my counts were okay, a little bit down but still good enough for the last Taxol. The neuropathy is nearly unbearable, I think the doctor was hesitant to give me the last dose but I insisted. Now I get a month off to rest and then go back to talk to him about Arimidex. I have serious concerns about that after reading posts in the thread related to that--there is a serious history of heart disease in my family and I have had high blood pressure for a few years. Working on trying to lose some more weight and exercise to get the BP under control. Will also talk with my PCP about his thoughts...I will see him next month. To answer your question, I did have BMX and chose not to do reconstruction. I had the option of a single mastectomy on one side (had two sites there) and lumpectomy w/radiation on the other (one area of DCIS). I figured that if one was going and there was any chance with the other, then take them both. I never had any doubt for myself. It was my choice, the surgeon wanted to make sure that it was my own decision, but in the end she agreed. In the end I know it was the right decision because of mixups with pathology that later revealed new information. I keep asking DH if he is okay with that, and although he says that he is, I'm not completely sure. But my decision was based upon the following:1.  I have never been a particularly vain person, and my philosophy is that \"if they aren't mine, I don't want them.\" I have no problem with anyone who wants reconstruction, it's an individual decision. I have been the same way with coloring my hair.....take me as I am! Although I may change that tune when my hair comes back in. 2. I would rather look in the mirror and know that my cancer is GONE! And I have the battle scars to prove it. 3. I can choose whether or not to wear a bra and foobs....at home I take the weekends off --both from hair and foobs. If I had a  single mastectomy then I would probably have chosen recon for the balance. 3. I had so many complications through this journey, I just don't want to deal with any more. Post-op hemorrhage, multiple seromas, febrile neutropenia hospitalizations, etc. I read the threads related to reconstruction and all the complications and I just don't want to go there 4. DH can't tell me if he would like them or not, it's a pretty drastic move for \"what if?\" 5. Recon won't bring sensation back. 6. Insurance covers mastectomy bras every year.... So......that's how I made my decisions. But everyone is unique, you can find threads in this forum about those who chose to do reconstruction, and those who did not. Feel free to PM me if you (or anyone!) wants to talk more. I am always happy to get to know all of you better! For now, I will watch this (hopefully LAST!) winter storm that we have coming through. Up to 12\" of snow coming again.....hope everyone gets to work tomorrow! I figure that if I can make it in with all the chemo crap, they better be there too....or I will pick them up on the way! Martha",
      "MessageIndex": 2098,
      "PostDate": "02/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Aug 26, 2013 09:02PM RhodyMMM wrote: Thanks for the explanation Cougarlicious! Haha!",
      "MessageIndex": 1309,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 8, 2014 06:19AM RhodyMMM wrote: Soterio, that is great news! A few weeks ago I though I saw a lump on my right side near my axilla by the scar. Scared me to no end. But I went to physical therapy, they were continuing to stretch out the scars and the myofascial (muscle tissue on the chest wall), and viola it went away. Must have just been a tight area. I am trying to be very vigilant, but not paranoid. When my cancer was found on mammogram, no one felt anything.......",
      "MessageIndex": 1475,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Oct 1, 2013 05:41PM RhodyMMM wrote: TFPMurphy, good luck to you on your second chemo!",
      "MessageIndex": 1347,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Oct 14, 2013 05:33PM RhodyMMM wrote:",
      "MessageIndex": 1365,
      "PostDate": "14/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Feb 1, 2014 06:06AM RhodyMMM wrote: Bumping in February! Spring is on the way!",
      "MessageIndex": 1467,
      "PostDate": "01/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 4, 2014 06:44PM RhodyMMM wrote: I'm with iluv2scrub......going through chemo is rough but it IS doable. I finished 6 months on Friday. Cumulative side effects are rough but I am hoping they will start to lessen soon. Chemo does REALLY ugly things to your body but I look at the changes as \"battle scars.\" And I am proud of them. I will say Ditto about sending me a PM for those of you going through chemo. I would be happy to try to answer any questions/make suggestions for any of you facing it! My chemo regimen was 4 rounds of Adriamycin and Cytoxan, 3 weeks apart, followed by 12 weeks of weekly Taxol (with a one-week break after dose #3 and dose #6). Each part of the protocol has it's own challenges, I would be happy to share my tips for survival. For what it's worth, I did manage to work full-time through the entire 6 months, with a few days off here and there for the treatments and/or complications. It can be done!",
      "MessageIndex": 1506,
      "PostDate": "04/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Oct 20, 2013 08:06AM RhodyMMM wrote: Minus Two, I have just had my third round of A/C. I have not done any icing, want to make sure the poison gets everywhere it needs to be! I have noticed that my nails are more brittle, but that's about it. No trouble with mouth sores, I use Biotene toothpaste and Colgate Total, and faithfully use Peroxyl mouthwash several times a day. And I drink lots of water which keeps my mouth flushed out. Good luck to you!",
      "MessageIndex": 1372,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 10, 2014 08:49PM RhodyMMM wrote: Warrior woman, you are correct. It's the Adriamycin that is/was so brutal. I continue to have issues with neutropenia now that I am getting Taxol, but the MO says that is because my bone marrow is so beaten up from the Adriamycin (red devil). Good luck to you!",
      "MessageIndex": 1436,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 30, 2014 07:04PM RhodyMMM wrote: Njmom, I also have a Power Port. They put it in after my first chemo because I was getting 4 rounds of Adriamycin/Cytoxan and then 12 rounds of Taxol. I had multiple lymph nodes removed on my right side, so my left arm is the only on that could be used for blood draws/IVs. Two weeks after my first chemo I developed febrile neutropenia (low blood counts) and ended up in the hospital. At that time I did not have the Port and they used my arm for the IVs and blood draws. A week after the second chemo and the Port insertion I ended up in the hospital again. They were waiting for a nurse to come in to access the Port, and while waiting they tried to use my arm. But no success....I got stuck 9 times and finally the specialty nurse came in to access the Port. I am so glad that I have it! I keep the EMLA in my car so I have it anytime I might need it......going for labs/chemo or an unexpected trip to the ER/hospital. I will ask the MO next week how long they will leave it in after the chemo.....I was staged at Stage II but my case is complicated......all the doctors say it's \"interesting!\" I don't want to have it removed too soon just in case. I can deal with a monthly trip to get it flushed if necessary, since they cannot use my right arm for blood draws or IVs. Good luck to you! Martha",
      "MessageIndex": 1465,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Mar 7, 2015 04:34PM RhodyMMM wrote: Hi daynar, I agree that we are sorry you have to join us! When I was diagnosed I went for BMX without reconstruction. I did have some post-surgical complications but was back to work in about three weeks. I am a DON in an assisted living facility but do sometimes have to do some lifting. I made sure that if someone needed to be lifted (after a fall, etc., that I had help). I later found out that I had to go through chemo. I was fortunate that my employer is very caring and they were very flexible about my schedule. I scheduled my chemo treatments on Fridays so I could have the weekend to recover. I did have three hospitalizations for febrile neutropenia. As Maureen said, nurses have a very hard time taking care of themselves. I found that I did not do a good job of that while I was in treatment, but I think I am doing a little bit better at it now. I see that you were diagnosed in November? Did you have any kind of surgery yet or are you waiting to decide what to do? Hugs to you XOXO Martha",
      "MessageIndex": 815,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "May 13, 2015 07:45PM RhodyMMM wrote: I know exactly what you mean Tempy, I am also a former oncology nurse. In fact 25 years ago we did the clinical trials on the chemo regimen that I had to go through myself! That was scary for me because I knew way too much! When I first got the diagnosis the radiologist asked me if I wanted to schedule my initial appointment with the BS, etc., or did I want a nurse navigator to take care of it. I was so numb that I let them take care of getting everything started (my husband was out of town when I got the call and I decided to let the health care system do it's own job). Even with my knowledge base I could only retain so much information....it gave me a real appreciation for the importance of relaying clear information to patients who don't have a health care background. All of the doctors that I came in contact with did a wonderful job of explaining everything very thoroughly and clearly. I wish you all the best! Martha",
      "MessageIndex": 834,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "May 4, 2014 05:24PM RhodyMMM wrote: Cammychris, I know exactly where you are coming from. Reconstruction was never an option for me. Thankfully, my husband was very supportive in my decision. I made my decision on two reasons: first, I have always felt that \"if it's not mine then I don't want it.\" Second, I wanted to be sure that there would be nothing in the way to cover up or mask any recurrence (although my BS assured me that would not be an issue). I had my BMX last June with no recon. When I look in the mirror and see my scars and flat chest, all I think about is \"IT'S GONE!\" I consider them to be battle scars.....I intend to win this war! If you choose not to have reconstruction at your initial surgery, you can always rethink it later and do it then. Keep that in the back of your mind since you are young (I was 53 at diagnosis). There are inconveniences related to not doing recon, but they are offset by other positives. It's hard to find bathing suits, and they are expensive, but my insurance pays for my bras so I guess it balances out. I wish you all the best, and you will be in my thoughts and prayers on May 15. Please be sure to let us know how you make out, or feel free to PM me if you want. Martha",
      "MessageIndex": 6,
      "PostDate": "04/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/820794",
      "Title": "34 years old and do NOT want reconstruction. Cammychris matsgirlie"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Sep 29, 2013 08:21AM RhodyMMM wrote: TPFMurphy, I agree that the tips and suggestions were very helpful. When was your first chemo? I had my second round on Thursday. This time I was much more prepared thanks to the lists and to some of the other forums. First time around was a rush job so I didn't have quite as much time to prepare. Take care of yourself and I wish you well! Bump it to the top!!!!! Martha",
      "MessageIndex": 1343,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jun 16, 2013 11:51AM RhodyMMM wrote: That is fabulous news! Congratulations to all of you! I am relatively new to the whole cancer idea so I find happy news very encouraging right now. Best wishes to you on your bright future! Martha",
      "MessageIndex": 39,
      "PostDate": "16/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/806012",
      "Title": "In shock for a different reason - PREGNANT! Letlet kathleen1966"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Aug 20, 2013 05:16AM RhodyMMM wrote: OK I am new to this thread and there are lots of pages. What is the origin of the\"bump?\"",
      "MessageIndex": 1300,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 10, 2014 07:35PM RhodyMMM wrote: Warrior Woman, I keep part of my \"pharmacy\" in the car. Badger mentioned \"Murphy's Law of Chemo SE Management....\" Last fall I ended up in the hospital twice with febrile neutropenia (low blood counts). They had given me EMLA cream for whenever my port needed to be accessed, but I had it at home. I went to the ER straight from work, and they admitted me. I got stuck multiple times before they could get venous access. I really wished I had the cream with me! So after that I kept a little bag in my care. With the EMLA cream, hand sanitzer, toothbrush and toothpaste, nail file, chap stick, clean underwear, and slipper socks. That way, if I had to go again to the hospital unexpectedly, I had all the immediate needs covered until my hubby could bring what else I needed. I keep that in my \"chemo\" bag now, so I can put on the EMLA on the way to the MO office for chemo or if I need blood draws. I am working through all of this, so I find that helps me to have what I need right at my fingertips. I found that the premeds really help with the chemo effects such as nausea; I have never really had a problem with it. I have also found that with each round I have different food cravings/aversions. I would suggest that you have high protein foods available that are tasty to you (I like cheese, cottage cheese, yogurt....can put them all on crackers; and cereals). Initially I drank a lot of seltzer water but that does not work so well for me these days, the carbonation bothers my hypersensitive tongue. I have found Peroxyl mouthwash very helpful for helping to keep my mouth clean and prevent mouthsores. It can be a bit irritating but I personally think it is worth it. I ran out a few days ago and am now having some hypersensitivity on the sides of my tongue. Biotene mouth rinse helps too because it is moisturizing and soothing. When are you starting chemo and what will you be getting? Good luck to you! Martha",
      "MessageIndex": 1434,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 13, 2015 04:20PM RhodyMMM wrote: I have had two of the Amoena Performance sports bras, they were by far my favorite....so comfy I wore them nearly all the time. One eventually wore out and the other became too big as I lost weight. Next time I got bras I tried some other models out. I may get another Amoena or try the Trulife next time as I am getting in a lot more exercise than I was in the beginning. I can't speak to the best type of form because I had BMX so don't need to worry about evening out the weight. Early on I bought a pair of microbead forms that can  be worn in the water; I use those when I go exercising because they give me some shape but are very light and breatheable. My exercise consists of rowing (or using a rowing machine) and yoga. When we are rowing on the water, there is also a lot of lifting and carrying. So not running around, but definitely moving. Martha",
      "MessageIndex": 3,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827482",
      "Title": "Best sports bras/prothesis for tennis and jogging? flowers2 RhodyMMM"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jan 22, 2015 06:19PM - edited Jan 22, 2015 06:26PM by RhodyMMM I found the cup to be less full then in regular mastectomy bras....no padding in them. I just got (yesterday) a Trulife Sophia that I ordered recently, so I can't wait to try it out. I put the microbead foobs in and they seem to do okay (they are smaller than my silicone ones). The only problem I can see so far is that the front chest line is a little on the high side, but I think it was on the Amoena as well. Kind of peeked out above the V-neck in one of my workout shirts. I also have an Amoena sports tank that I use a lot....http://www.metromedicalonline.com/amoena1003.html#.VMGFNZV0ziM When I am exercising at home I don't put anything in (I had bmx), it lays mostly flat across my chest;  but when I go to the rowing club I can put in the microbead foobs so I don't look like a freak but they are lightweight and don't get too hot) By the way, if you had BMX you might be more comfortable with lightweight foobs for tennis/running. The ones I got arehttp://www.tlcdirect.org/Micro-Bead-Lightweight-Breast-Form-Mastectomy-Prosthesis-American-Cancer-Society-TLC-Direct?did=80 . They are so light, and you can also swim in them. And they are hand/gentle washable.......what I do is put them in the sports tank I posted above, and then after I exercise and sweat a lot I leave them in and run them through the gentle cycle in the washer and then hang to dry. I have had them for a year and a half and they are great! I can also take them out of the tank and hand wash them with gentle soap. I have worn them both in chlorine, salt water, and river water. Hope that helps! Martha ",
      "MessageIndex": 5,
      "PostDate": "22/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827482",
      "Title": "Best sports bras/prothesis for tennis and jogging? flowers2 RhodyMMM"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "May 13, 2015 07:23PM RhodyMMM wrote: Tempy, {{{hugs}}} to you! It's bad enough to have to deal with the diagnosis, tests, and appointments (and waiting!) but it's too bad that your employer can't be more supportive. As a nurse manager, I have learned that sometimes we need to bite the bullet and suck it up to support our staff when they need it, it often makes them more loyal and dedicated. But through my own journey I have also finally realized that you need to look out for \"No.1\" (which is something that is hard for so many nurses!). I see from your stats that you have a mixed diagnosis, I did too. Let us know what you decide for your treatment plan! Are you having surgery? Martha",
      "MessageIndex": 832,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "May 13, 2015 08:17PM RhodyMMM wrote: Oh Tempy, I am sorry the nurse navigator did that! Some just assume that we can handle everything, or maybe she just does a lousy job in general! You can be sure that you will be in my thoughts and prayers as you go through the next weeks with your appointments and decision-making! I also immediately chose BMX so feel free to PM me if you have specific questions that I might be able to help you with.",
      "MessageIndex": 836,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "RhodyMMM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179150/profile",
      "Content": "Jul 13, 2013 09:45AM RhodyMMM wrote: Are you milking the drains? Did they tell you to do that? It helps to move the sediment through and keep things flowing. I am on my second drain...had surgery 6/12; the drains came out almost three weeks later. One was ready, the other was no longer functioning so they pulled it. Two days later they aspirated 300cc, then 500 cc two more days later. Then the new drain was put in three days later and they got 500cc at that time. Drain has been in now for 5 days, averaging 100-125 cc per day continuously. Did you have axillary node dissection? My BS told me that when they take the axillary nodes there is more fluid production because the body's immune system kicks into high gear trying to understand and compensate for the lack of lymph nodes. I had 16 nodes removed from the side where I am having trouble with drainagee (I also had a second surgery on that side due to complications.....although the BS says that is irrelevant)",
      "MessageIndex": 1,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/807696",
      "Title": "Drainage/Seroma problems katiekabooom Solnitsa"
    }
  ]
}