{
  "AuthorID": "RhondaM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
  "Posts": [
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "RhondaM wrote: I have extensive DCIS in my right breast. Both ultrasounds that I have had under my right arm say that the lymph glands look ok. However, I am very tender there in one spot (have been since all this began)...and so it worries me. I'd like to know how many of you had a tender spot under your arm before surgery that made you nervous...as well as the outcome after surgery. I'd also like to know how many of you had ultrasounds that showed all clear for your lymph glands...but they ended up being positive....sentinel and/or others. Thanks, RhondaM. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725546",
      "Title": "worries about tenderness under arm... RhondaM sarahzxe"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "RhondaM wrote: I'm trying to breath. Ok ...after mammagram, ultrasound and ultrasound guided core biopsy I was diagnosed with  DCIS. But I was with my husband on a business trip so came back home to Texas in order ot go to MD Anderson Cancer treatment.  There was some confusion over what the orignial hospital had sent home with me so I opened the envelope to find out so they sent the rest of the right inforormation MD Anderson required. And I read the pathology report...and now I am freaking. It does not say I just have DCIS...but rather it says: Pre-Opertive Diagnosis: 10 cm extent of calcifications, distortion and 7mm nodule probably IDC plus DCIS. AND... Microscopic: Sections of core biopsy of breast tissue which show ductal carcinoma in situ and cancerization of lobules. The ducts show extensive necrosis with a residual ...yadda yadda..Other ducts show a micropapillary pattern, also with necrosis.....(mentions nothing invasive found in the material available for evaluation. Neoplastic cells are present within lobules.  and... Diagnosis: Right breast 9:00, ulstrsound guided core biopsy: Ductal Cancer In Situ, Intermediate nuclear grade, solid and micropapillary patterns with necrosis and calcifications. On page two: Histologic type: DCIS (they say this is an estimation) Architecture: Solid and Micropapillary Nuclear Grade: Intermediate Microcalcifications: Present within DCIS Stromal Invasion: Not present Lymphatic In vasion: Not identified Then some hormone stuff: estrogen receptor is LOW (5% strong, 5% weak) progesterone receptor is absent.  I hope this is not too technical. But this sounds to me like they think is may be IDC and with lobules involved. I've been hurting under my arms for weeks now...and I am feeling pretty darn scared. Husband went back to California but will be back as soon as possible, or when I have surgery, or if I tell him I have to have him here. I have to have him here now but won't tell him that. His business trip will be over in 6 weeks. Up until now all I was worried about was a mastectomy...but now...:sigh: NOW I am scared. Panic attacks are sort of the norm for me anyway...and xanax is not touching this. I am freaking out. And feeling like a huge baby too. :-( Rhonda Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723170",
      "Title": "Can someone please help me? Panic attack! RhondaM AlaskaDeb"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "Oct 21, 2008 07:35PM RhondaM wrote: Bessie, THANK YOU! Ok...I have known all along that once they did a mastectomy that there was a chance of them finding IDC...as well as finding it in lymph glands...but READING it just really set me off. I know that noone will really know anything until after surgery. But You have really calmed me down. I can focus on that now. Thanks so much. Rhonda",
      "MessageIndex": 4,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723170",
      "Title": "Can someone please help me? Panic attack! RhondaM AlaskaDeb"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "Oct 21, 2008 07:00PM RhondaM wrote: AlaskaDeb, Thanks. And yes, the waiting stinks. I've got to fax a release form to the hospital that diagnosed me so that they will mail the rest of the information to MD Anderson before MD Anderson will even give me an appointment to SEE anyone! I even have the pathology slides and the report...just not the mamogram and ultrasound pictures. You'd think based on what I have they'd at least see me and we could do SOMETHING! Atleast get the ball rolling!  I'll try not to borrow trouble. ..and be stoic and all. Ugh. Rhonda",
      "MessageIndex": 2,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723170",
      "Title": "Can someone please help me? Panic attack! RhondaM AlaskaDeb"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "RhondaM wrote: Friday I had a diagnostic mammogram, ultrasound and a core biopsy on my right breast. They also told me at the time that i had some calicifications in my left breast as well. Said lymph glands looked ok. (Yet they are tender, so we will see.) She told me the 'calcifications' in my right breast was 10 cm. Is there a difference between calcification and a tumor? So I got the call today with the DCIS.  Thursday I have to get a blood test to see if my kidney function is sufficient to handle the MRI (I only have one kidney due to renal cell carsinoma 8 years ago) which is scheduled for Friday. They will get a better look at left breast at this time as well. I suppose after that they will have more of a clear picture of things. Today I also got a call from someone wanting to give me a list of surgeons to pick from. (I was told I'd most likely have to have a masectomy due to size and location of the lump.) So here is where I am stumped...  We live in Texas but we are here in Orange County, California for my husband's business trip. We have been here since July and are due to leave the end of November, beginning of December. Will I have time to have all this done while here in California..or should I pack up and go home. Is it a bad idea to have surgery done here (if I have time) and radiation if needed back home? Or should it all be done in one place.  Thanks, Rhonda Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/722787",
      "Title": "Just diagnosed with DCIS RhondaM Beesie"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "RhondaM wrote:  I'm having a bilateral mastectomy w/ right SNB and DIEP reconstruction this Friday (God willing.) After the first week of recovery how much will I be able to move my arms? I bought a power recliner, but realize now I may not even be able to reach the buttons on it, as the buttons are down on the side of the thing. I bought a little table (that has wheels) to keep next to the recliner, but wonder if reaching for anything on the table will be a problem as well. Will it really be that bad? Or will I have more ROM than I'm thinking. Thanks, RhondaM. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727517",
      "Title": "ROM after bilat mx & DIEP?? RhondaM nobleanna007"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "Oct 14, 2008 07:00PM RhondaM wrote: Bessie.. You said that:  If you choose to have reconstruction, and particularly, immediate reconstruction, that will make it a bigger surgery and that will increase your recovery time.  And reconstruction, even \"immediate\" reconstruction, involves at least a couple of surgeries over many months.  So if you want to have reconstruction, this is something that you won't be able to complete before the end of November, but having a mastectomy alone should be no problem at all.  And if it turns out that more cancer is found and that radiation is necessary, I would imagine that having it back home should be no problem. Hope that helps! First of all everything you said was very helpful. Thank you! My question is: Couldn't I have a masectomy and reconstruction here in CA...then get any other surgeries involved with the reconstruction done back home? Or is it really necessary that one doctor do the entire thing?  Thanks again, Rhonda",
      "MessageIndex": 2,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/722787",
      "Title": "Just diagnosed with DCIS RhondaM Beesie"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "Dec 10, 2008 04:17PM RhondaM wrote: Thank you Cathi. Sounds like I just to get several of the camilsoles with the puffs to wear under my clothes for the first 6 weeks. In fact, maybe I can get away with that until restonstruction. Thanks again,  RhondaM.",
      "MessageIndex": 2,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/725705",
      "Title": "Questions about what to wear after bilat. RhondaM Mykidsmom"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "Jan 12, 2009 04:32PM RhondaM wrote: I won't be any help, but I've experienced something like this. I had all my mammograms and xrays done at MDA then decided to switch hospitals. When i did this I got all my reports from MDA to give to new doctors. When I was looking through them I saw that the x-ray had spotted a clip in my abdomen. Apparently it was left there from when I had my kidney out 8 years ago.  I asked th lady in pre-op about it and she didn't seem to think it was anything to worry about. She thought maybe it needed to be there. :shrugging: I have NO idea, but I am curious too. RhondaM.",
      "MessageIndex": 2,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727196",
      "Title": "Something left behind in surgery? Leisa1968 AlwaysHope"
    },
    {
      "AuthorID": "RhondaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73575/profile",
      "Content": "RhondaM wrote:  I'll be having a bilat on Dec. 30th but won't have my reconstruction until this summer. I need to know what to wear and how soon I can wear it until reconstruction. If I had decided not to reconstruct (very tempting actually) I would not mind going flat...but I am a private person and I just don't want the entire world seeing me go from normal to flat to reconstructed. This process is my business and I'd just rather leave everyone else in the dark. I go to church and would like to get back as soon as I am healed enough to go. I know that in the beginning I can wear the camisoles with the puffs. They will hold the tubes and all. But, how soon after my bilat can I start wearing something with breast forms or a prostheses or something? About how long does it take to heal?  And what exactly do you wear? A bra with forms inside? Should I shop now or is this something I need to do in person after surgery? Do I need a fitting or something? Thanks very much, RhondaM. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/725705",
      "Title": "Questions about what to wear after bilat. RhondaM Mykidsmom"
    }
  ]
}