{
  "AuthorID": "richellePH",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218435/profile",
  "Posts": [
    {
      "AuthorID": "richellePH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218435/profile",
      "Content": "richellePH wrote: Hi! I'm new here and I just want to share and ask opinions of you guys here. By the way I'm from Philippines. So I had a surgery under my breast of a benign lump of 2.50 in size. I was happy of the biopsy result because it wasn't cancerous. But then I am more curious about my body so I always examine my breast and as I was checking I notice a lump on both on my breast. So I went to the doctor and tell them about it. They request me to have an ultrasound and they found many lumps both left and right though they are small but they found one suspicious one about 1.60 in size on my right breast and ask me to have a second ultrasound because it was not really clear and my doctor was not convinced since he can't feel anything so I had my second ultrasound and mammogram. The second result on my ultrasound was the same, suspicious but based on my mammogram's result was clear. so the doctor said we will wait until 3 months to check if the lump is getting bigger. I didn't go back to my doctor yet but I just recently notice a small dimple under my breast. Now I am worried because I am continue reading about breast cancer and one of the symptoms is dimpling of the breast plus I always felt sudden pain on my right breast though not continuously feel it. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/833394",
      "Title": "Breast Lump richellePH richellePH"
    },
    {
      "AuthorID": "richellePH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218435/profile",
      "Content": "Jul 16, 2015 02:13AM richellePH wrote: Thank you so much. I will be seeing a breast specialist next week. I will keep you posted.",
      "MessageIndex": 3,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/833394",
      "Title": "Breast Lump richellePH richellePH"
    }
  ]
}