{
  "AuthorID": "RICHARDZON",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49314/profile",
  "Posts": [{
    "AuthorID": "RICHARDZON",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49314/profile",
    "Content": "Apr 14, 2007 05:56PM RICHARDZON wrote: 14 years ago I had a right side mastectomy with immediate reconstruction (latissimus dorsi flap) for microscopic pinprick sized calcifications. First I went through 2 partial mastectomies to try to get clean margins. I had the surgery done in Boston and it met my goal of looking normal in clothes. Now I have the same issue with my left breast, but I am looking at having the work done closer to my home in NH rather than traveling to Boston as I did before. My doctors are no longer there anyway. At first I was going to do a partial, but decided I didn't want to take the time to heal, only to do it again, and I didn't want to look like I had part of the stuffing taken out of me. So I will do a modified radical mastectomy. I am really concerned that it will not look or feel the same. I was told my saline implant would last 10 years or so. I would like to replace it when they do the other. My surgeon dodges any mention of a plastic surgeon and wants to schedule surgery. I feel I have to know which method will be used for immediate reconstruction and feel they should know also, having been through this before. So I set up my own appointment with a plastic surgeon. I don't know what to tell my employer about how long I will be out of work (I am a part-time temp and don't want to lose this job I've been doing for 4 years). I still have to meet with 3 doctors. Last time I dealt with all female doctors, this time they are all male. I want to stand up for myself but sometimes I get in the office and melt. I guess I want to know if anyone else has had mastectomy reconstruction followed many years later with another and how the reconstruction was done to balance the look. Thank you for listening.",
    "MessageIndex": 22,
    "PostDate": "14/04/2007",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/580715",
    "Title": "local recuurence 7 years after initial diagnosis kiwicaroline WendyInCalif"
  }]
}