{
  "AuthorID": "Ridley",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
  "Posts": [
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Mar 14, 2015 08:21AM Ridley wrote: I was told not to wax during the week before surgery",
      "MessageIndex": 5,
      "PostDate": "14/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/829489",
      "Title": "I've got a doozy question Cmo65 Kicks"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Dec 4, 2013 07:26AM - edited Dec 4, 2013 08:03AM by Ridley Hi Tam178. Sorry your results came back positive. Re your question about receptor tests, they did not do those for me until surgery (I'm in Toronto) I did know the grade of the cancer (or an estimate) from the biopsy based on how it was described (eg well differentiated is low grade, poorly differentiated is high grade, etc.). After surgery,if your receptors come back positive for estrogen and negative for HER2, they will probably send off for an oncotype test, which will tell you how your tumor responds to chemo. If you have a low score, often chemo is not recommended There are lots of threads on lumpectomy vs, mastectomy on the board, so I would encourage to read them as you think this through. Often women assume that they won't have radiation if they have a mastectomy and while that is often true, sometimes radiation is still required if your have lymph nodes involved or the tumor is close to the chest wall. There are lots of women from Ottawa on the boards. Post in the Calling all Canadians thread as a start to find them. Good luck. Post as you have questions/comments and someone will help. Hope your bruises from the fall feel better. One last thing -- if you are not in the habit of getting copies of your test results ( e.g. Pathology reports, etc), I would start now and put them all in a binder. Its easy to forget what the doc says and nice onto be able to go back and read the report of have it for another doc. Ridley",
      "MessageIndex": 1,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815331",
      "Title": "Invasive Ductal Carcinoma - age 36.... oh crap!! Tam178 AndreaJ50"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Aug 6, 2013 05:54PM Ridley wrote: Hi Jennylee, I just made this decision today (decided on lumpectomy), although I think I will reevaluate whether I want to do bilateral mastectomies with reconstruction once I am through the balance of my treatment. The reasons for my decision were: -- when I investigated reconstruction, the plastic surgeon I spoke to didn't think I would be a good candidate for implants (frame and girls are too large) so I need to investigate flap reconstruction. I won't be able to get into see a PS who does DIEP surgery for a few months, so I can't do immediate reconstruction -- the more I read about mastectomies, the more nervous I got about understanding the long term impacts (rate of chronic pain, etc.). Of course, if this was the recommended option, I would do it. -- if I have to have chemo, I thought that my body would be in better shape in recovering from a lumpectomy vs mastectomies The other side of the coin is that I will have to have radiation (but as someone said, that may be required in any case if lymph nodes are involved). Also, there is a risk that I won't have clean margins, and will have to have a mastectomy anyway (I have two confirmed tumours that are IDC, and another suspicious area that will be removed, so it's a fairly large area to remove). A couple of other things I found out along the way that I considered: - if you do flap reconstruction, you can only do that once (because they can't remove half your tummy flap), so if I end up there, I think I will do a bilateral mastectomy - I had a clean mammo and ultrasound callback last fall, which were \"clear\", so I will have to be closely followed from here on in with MRIs, etc. I thought about how I would handle six month scans and how much anxiety that would cause (I'm 46 so I would have a lot for years to continue to scan) I talked to my surgeon again today, and she is 100% supportive of my decision, which was really helpful for me to hear. She didn't think my decision was risky and said that I was not burning any bridges by going this route, At the end of the day, my advice is listen to your surgeons and your gut if you have a decision to make. Best of luck. This is a tough road to be on!",
      "MessageIndex": 10,
      "PostDate": "06/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808846",
      "Title": "How did you decide on lumpectomy or mastectomy/ livingwithit IrishDancingMom"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jun 20, 2015 10:31PM Ridley wrote: tshire -- I had a lumpectomy first and then had a bilat mastectomy with diep recon. I wanted some time to think through things, understand recon choices, etc.  As it turns out my pathology from the lumpectomy came back more complicated then expected, and a mastectomy was recommended for one side.  I chose to do both.    I'm 2 years out and finished with reconstructive surgery -- I'm happy with the results and would make the same decision again.  I'm also ok with going with a lumpectomy first -- got the cancer out and gave me some time to consider my longer term options. Good luck with your decision.  ",
      "MessageIndex": 14,
      "PostDate": "20/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832716",
      "Title": "difficult decisions- types of BMX surgery, experiences tshire MsVeryDenseBreasts"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jan 5, 2015 07:09PM Ridley wrote: Hi Texas -- the only real way to tell is to have the biopsy.  Do they have a cancellation list that you could be added to in case a spot comes up before the 22nd?   The waiting is awful.  re: the bleeding -- what does the MRI say about the right side -- anything suspicious.  I know that most of the time bleeding is from a papilloma -- mine wasn't -- was cancer.  So because that is my experience, I think its a good idea to run the source of bleeding to the ground. Are you at an NCI recognized cancer center -- if not, maybe time to investigate a second opinion at one as well.  You have a significant family history.  Have you been tested for BRCA 1/2? Hang in there, Ridley",
      "MessageIndex": 2,
      "PostDate": "05/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827381",
      "Title": "Still lost after 3 different imaging tests. BIRADS-4 TexasPonies wrenn"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jan 5, 2015 07:42PM Ridley wrote: I've also had an MRI biopsy (2) and didn't have to wait until a particular time in my cycle.  I was just starting perimenopause when diagnosed, so my schedule was irregular -- maybe that's why I didn't have to wait. You can google nci designated cancer centres and see if your hospital is one of them.",
      "MessageIndex": 6,
      "PostDate": "05/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827381",
      "Title": "Still lost after 3 different imaging tests. BIRADS-4 TexasPonies wrenn"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 15, 2013 06:11PM Ridley wrote:",
      "MessageIndex": 756,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Apr 13, 2015 05:45AM Ridley wrote: MrsS - have you had an appointment with your radiation oncologist? I had multiple areas of idc as well as Ilc and dcis, etc, on one side and my RO said there was not good data on the effectiveness of radiation in cases like mine. That along with some other factors led me to decide on a double mast. No regrets. I had diep reconstruction.",
      "MessageIndex": 2,
      "PostDate": "13/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830367",
      "Title": "Please Help- Double Mastectomy or Radiation MrsSooty grammakathy"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 7, 2013 07:50PM - edited Oct 7, 2013 07:59PM by Ridley Hi Shoppygirl, I also have multifocal breast cancer, and all of the information I have read seems to stage based on the size of the largest tumor. However, when I asked my medical oncologist, he encouraged me to not focus on staging, but on the biology of the cancer (e.g. Hormone status, grade, etc.) When we talked about recurrence risk and he took me through adjuvant online, he used the size of my largest tumor, but then toggled on the risk to give me a range, as mutifocal cancer does seem to have a higher risk of recurrence. Good luck, Ridley",
      "MessageIndex": 1,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/812454",
      "Title": "Multifocal Breast Cancer what stage am I shoppygirl Sugar8"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jan 9, 2016 04:12AM Ridley wrote: hey Ashley. - you are in the worst phase of this journey right now - having a cancer diagnosis without a treatment plan. It will get better. Re reconstruction, check out the info on this main site for a description of the options. If you want to read about experiences using your own fat, look for info on diep or free tram, which is where they use you own belly fat ( I had bilateral diep). I also has lots of tumours (10!), but they are all gone, as yours will be. I can't help on the nodes Q, but someone will be along who can. Hang in there",
      "MessageIndex": 52,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/839079",
      "Title": "I am scared Ashley46 msphil"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 30, 2013 06:06AM Ridley wrote: Grk1732 --  You could do a lumpectomy now and give yourself some time to think about whether you really want to do a mastectomy.  That's how I approached it because I wasn't sure.  Here are some of the factors that I considered (including factors from my team and a friend who is an oncologist) -- you can have a mastectomy after a lumpectomy, but not the reverse -- a lumpectomy is generally easier to recover from, so if you do need chemo (hopefully you won't) you may feel better starting that - my friend advised that if I was going to go the mast route, not to do the other side at the same time because of the risk of infection increasing doing a double and concern over that delaying chemo if that were required -- I needed to understand more about recon options and needed some time to do that I am going forward with a double mastectomy now, but don't regret doing a lumpectomy first.  There are a few great threads on this topic, so I would recommend spending some time reading those. Good luck with your decision -- its definitely a tough one.  ",
      "MessageIndex": 5,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813768",
      "Title": "Lumpectomy vs masectomy Grk1732 Beesie"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 26, 2013 10:07AM Ridley wrote: Leslie -- My oncotype was not automatic, as I had to sign for my hospital to release my tissue sample.  It was ordered at my first appointment with the medical oncologist.  Just an fyi if you haven't read much on the test, it is only used for certain types of breast cancer -- e.g. has to be ER+ and Her- I think and no node involvement or only microinvasion.  I had a hard time with the waiting -- had to go through what seemed like a hundred different tests and each involved waiting for it to be scheduled, waiting for it to be done, waiting for results.   Started to attend a support group, added a yoga class, and I have put hundreds of miles on my walking shoes with a number of my friends over the past several months.   Best of luck -- and I'm sorry again that you also dealing with your Mom's stage 4 diagnosis through this as well.  That totally sucks.  Both of my parents have had cancer (Dad is actually getting results of \"what I hope cannot possible be a 3rd cancer\" this afternoon.) Ridley",
      "MessageIndex": 4,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815020",
      "Title": "Waiting on path after LX lesliecusana lesliecusana"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 25, 2013 05:53PM Ridley wrote: Leslie. I'm so sorry that you and your mom are going through this at the same time. And yes, the waiting sucks! Chances are it may not end with the pathology report if you have an oncotype, etc. I wish you all the best in receiving only the best possible results from here on in. Ridley",
      "MessageIndex": 1,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815020",
      "Title": "Waiting on path after LX lesliecusana lesliecusana"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 26, 2013 07:27PM Ridley wrote: Leslie. I really didn't have any pain from the injection of radioactive dye. To me it just felt like the needle they give you when you have a biopsy. I know some ladies have pain from that, I did develop a bit of a hard lump under my snb scar, but it went away fairly quickly. I also had some pain halfway between my elbow and my shoulder on the inside of my arm. My surgeon said it was from moving nerves out of the way to get to the nodes. It resolved too, but came back earlier this week. Gone again now. Never was painful enough that I took anything for it, I never had any range of motion issues either, so lucky on that front. When do you have that surgery?",
      "MessageIndex": 8,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815020",
      "Title": "Waiting on path after LX lesliecusana lesliecusana"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 26, 2013 02:59PM Ridley wrote: Leslie -- that sucks!  I sort of got the same news today.  I'm having a double mastectomy in December and we needed to confirm that the \"non-cancer\" side was really \"non-cancer\" -- so had another MRI, which lead to another biopsy, which lead to a diagnosis of DCIS on that side this afternoon.  So now I have to have sentinel nodes removed on the \"non-cancer\" side to0 becase of the risk of microinvasion (since I'm having a mastectomy, we can't go back later). I'm so over this cancer stuff!!! Of course, there was some good news -- my Dad's biopsy came back negative -- just a benign polyp -- thank goodness!! I hope your sentinel nodes are clear.  I hope mine are too!",
      "MessageIndex": 6,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815020",
      "Title": "Waiting on path after LX lesliecusana lesliecusana"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 28, 2013 12:50PM Ridley wrote: Leslie -- good luck tomorrow -- I hope its smooth sailing for you. My Mom is 80 too -- she had breast cancer 9 years ago.  I'm so lucky that she is doing well and is able to help take care of me during my big upcoming surgery (I'm single and am moving in with them for a few weeks.)  My heart breaks that your Mom is having to do chemo.  I hope her care team is able to preempt any more side effects. Take care, Ridley",
      "MessageIndex": 12,
      "PostDate": "28/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815020",
      "Title": "Waiting on path after LX lesliecusana lesliecusana"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jul 5, 2014 01:33PM Ridley wrote: Robyn - sorry you are in wait and see mode. I hope your PET scan comes back clean.  In the meantime, I would take your surgeon up on the referral. As I'm sure you know, sometimes these \"findings\" can take a long time to wrestle to the ground.   Maybe the psychiatrist could provide some ideas on how to cope during the waiting period, whether that be medicinal or not.  Try to go back to livin' the dream. And as the saying goes, \"don't go there until you are there.\"  I hope you will never have to go there.",
      "MessageIndex": 5,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822519",
      "Title": "Lumps under right clavicle sheropesem Luvmydobies"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 16, 2013 02:18PM Ridley wrote: Hi SamU -- sorry your head is spinning. II would ask your surgeon how long you have to make the decision -- and if you have time and are not sure about a mastecomy, do the biopsy first.  Then you'll have a better idea of what you are dealing with.  He/She should be able to provide you with some guidance on how quickly they want to do surgery. Good luck -- the fog will clear -- just takes some time.",
      "MessageIndex": 3,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/812991",
      "Title": "It's been a week... Sam2U Cougarlicious"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 10, 2013 11:29AM Ridley wrote:",
      "MessageIndex": 11,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/812591",
      "Title": "45 yr old found a 3cmx1.5cm AnnieeC Janet456"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 19, 2015 01:23PM Ridley wrote: jblmom -- I recall from reading one of my surgical reports that they colour the sides with a dye so they know which margin comes from where -- that way they would know what area that they to remove additional tissue from -- good luck",
      "MessageIndex": 4,
      "PostDate": "19/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/836854",
      "Title": "Positive margins after bilateral mastectomy Jblmom Jblmom"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 28, 2014 01:56PM Ridley wrote: lindbry -- I've all all different types of biopsies -- the mri guided one wasn't more painful than the others.  They will freeze the area, and then you really shouldn't feel anything from the actual biopsy.   There was a lot of moving in and out of the machine to mark the spot, which I found a bit easier than the first MRI, when I was in the machine the whole time.  Definitely get the drugs you need to make the experience doable.  It sounds like you have an excellent tech, who knows you are nervous and will be there to talk you through it. Good luck -- I hope it turns out to be a big nothing -- remember that most biopsies do. Ridley    ",
      "MessageIndex": 2,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825799",
      "Title": "Can we talk about MRI guided biopsy? linzdbry Ridley"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 13, 2015 11:08PM Ridley wrote: etnasgrl -- you could also have a lumpectomy and then have a bilat mastectomy with reconstruction. That's what i did. I didn't have enough time to figure out reconstruction, and wanted to deal with the known cancer, so I went ahead with a lumpectomy. That gave me some time to figure out the reconstruction and understand whether I needed chemo. Since I didn't need chemo, instead of having radiation, I had a bilat mastectomy and immediate reconstruction using my own tissue (DIEP). I'm almost two years out from my recon surgery and am going great -- no restrictions from the surgery. You can't always avoid radiation by having a mastectomy, but can if there is no lymph node involvement, the tumor is far enough away from the chest wall, etc. My timeline was diagnosed at the end of June, lumpectomy at the end of August, mastectomies and recon in mid- December. Good luck with your decision -- nothing is easy about this.",
      "MessageIndex": 6,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/836713",
      "Title": "My next step - Question! etnasgrl dtad"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 15, 2014 04:02PM Ridley wrote: Kat - the process you are following sounds normal re: radiologist doing the biopsy.  I've had a number over the years and they have always been done by a radiologist because they have the expertise in diagnostic imaging and have to be able to read the images in order to biopsy the right place.  I didn't meet my oncologist until after I was diagnosed, so that makes sense as well. Don't forget that something like 80% of biopsies do not come back positive for cancer, so your odds are good that you will be in that group. I know it's really though not to think about the what ifs, but if I had to do it over again, I would try to keep myself distracted, and just deal with what I know now - or as some say \"don't go there until you get there\", which hopefully will be never! Best of luck with your biopsy",
      "MessageIndex": 5,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/824583",
      "Title": "Help needed - just got a biopsy recommendation & feel lost Kat_76 Moderators"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Aug 7, 2015 09:14AM Ridley wrote: Once I had a diagnosis, my entire body seemed to conjure up odd symptoms. I'm two years out and none of them amounted to anything, so I chaulked them up being overwhelmed/anxiety. I hope yours disappear soon.",
      "MessageIndex": 1,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/834016",
      "Title": "My worry while I'm waiting to see the BS CarolinaAmy cajunqueen15"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jul 27, 2015 04:06PM Ridley wrote:",
      "MessageIndex": 44,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833501",
      "Title": "Just scared like everyone else :( sbeddows SlowDeepBreaths"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 22, 2015 04:06PM Ridley wrote: etnasgrl - as others have mentioned, all of this is your choice, but that's especially true of the plastic surgery decision. I was a 38DD before surgery and my first surgery was a lumpectomy of the left side. My lumpectomy was huge - a quarter of my breast. My breast surgeon moved the tissue around so that you could not tell the outer upper quadrant was missing. In a bra, you really could not notice a difference in size. Undressed, you could. A friend who is an oncologist advised me not to have any surgery than what was necessary to begin with. She advised that because more surgery would increase the risk of a post op infection, which could end up delaying any additional treatment ( e.g. Radiation, chemo). I thought that was good advice. As it turns out, I ended up having more surgery, but do not regret starting out with a lumpectomy only. Good luck with your decision.   ",
      "MessageIndex": 10,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/836923",
      "Title": "Now I'm REALLY confused! Help please?! etnasgrl etnasgrl"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 17, 2015 12:24PM Ridley wrote:  I ended up with either 8 or 11 - two pathologists reviewed and it's somewhat judgmental re how to deal with the space between the lesions. Anyway all grade 1 except a teeny spot found during my mastectomy (had lumpectomy first). No spread to nodes and a low oncotype. Good luck - I thought the initial waiting until getting a treatment plan was the hardest. It got better after I knew what was coming.",
      "MessageIndex": 2,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835832",
      "Title": "Newly Diagnosed and Scared!! Kimm992 TikkasMom"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Aug 21, 2013 10:08PM Ridley wrote: Hi Madchooklady. I had an MRI post diagnosis with cancer (IDC). Like you, two areas were noted for follow up. Those two areas could not be seen on mammograms or ultrasounds, so I ended up having MRI guided biopsies on both sides (both done at the same time). I was told that MRIs identify a lot of areas that end of being nothing. In my case, one was nothing and one was another area of IDC. Sorry I can't be more helpful with the actual lingo. I couldn't really understand my report. Just focused on the recommendation for the biopsies. The MRI biopsies were not too bad-- just really long, because they had to do everything twice. Good luck. Hope they both come back b9.",
      "MessageIndex": 1,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/809691",
      "Title": "help with MRI results Madchooklady Madchooklady"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jan 16, 2017 07:59PM Ridley wrote: No specific advice re questions, but I encourage you to track down the cause. Spontaneous bleeding was my only symptom and while for most that symptom ends up being from a benign papilloma, mine didn't. Good luck",
      "MessageIndex": 1,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851909",
      "Title": "Bloody Discharge From Nipple Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 5, 2014 10:34AM Ridley wrote: Painterwoman -- just wanted to chime in that if you like to walk and be outside, don't let the snow stop you (ice is a different story and last year was a pain for ice.)  I started walking outside year-round about 5 years ago, and love being out in the snow.   I found that once I had the right gear (lightweight but warm), the right boots, hats and gloves, the cold doesn't bother me.  In fact, I'm usually too warm once I've been out for an hour.  Also -- if you like gadgets at all, and you don't have an electronic pedometer, think about getting one -- I have a fitbit and love it -- it definitely encourages me focus on getting steps in each day",
      "MessageIndex": 27,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/825836",
      "Title": "Stage 1-recurrance percentage % risk? DXat32 Ygammyyet"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jan 27, 2016 02:56AM Ridley wrote: farnad Have you met with a medical oncologist? That is who recommends chemo. Both Holloway and Leong are surgeons. Don't be afraid to ask one of Holloway or Leong why the difference. They know each other and can talk to one another - it's a small community.",
      "MessageIndex": 14,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/840461",
      "Title": "Princess Margaret or Sunnybrook for DCIS stage 2 surgery Farnad373 Ridley"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Apr 16, 2014 12:43AM Ridley wrote: hi elilacs -  no advice other than not to feel guilty.  I'm in the same spot, with one node removed on the right side and two on the left side.  I feel I made the best decision I could at the time, and I'm sure you did too.  I haven't had to have a blood draw or blood pressure done since my last surgery where they removed the node on the right side, so I'm not sure what I will do.  I have read to avoid using the machine for taking blood pressure.   I will be back to read what others advise. Ridley PS - found my cancer as a result of bloody discharge as well.  Had a mammo and ultrasound callback 8 months earlier that didn't find the invasive cancer on the discharge side or the DCIS on the other,",
      "MessageIndex": 1,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820213",
      "Title": "SLNB on both sides anneoftheforest inks"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 7, 2013 07:04PM - edited Nov 7, 2013 07:43PM by Ridley Hi toyung. I have found that sometimes the system moves fast and sometimes slow. I think in the diagnostic phase, they want to get things scheduled since they don't have a final diagnosis even if it may very well be nothing serious. Just an FYI on the birad score -- 0 means incomplete. Sounds like they want to see an MRI before they give you a final Birad score. Good luck with the MRI!",
      "MessageIndex": 1,
      "PostDate": "07/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814180",
      "Title": "Should I be concerned toyungforthis toyungforthis"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Apr 4, 2016 04:05AM Ridley wrote: Sarah - are you being treated at an NCI cancer center ( assuming you are in the US)? If no, I would highly recommend you find one that can take a look at everything you have going on. Re specific tests, when I was diagnosed, I had a bone scan, chest x-ray and abdominal ultrasound ( looking for bone, lung, and liver mets respectively). I also had a breast MRI. All of those probably make sense for you as well. I'm in Canada, and we don't have PET scans as frequently as they seem to in the US, so that might also be something to consider. Good luck. I hope you find some answers and more importantly, start to feel better. ",
      "MessageIndex": 3413,
      "PostDate": "04/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Feb 17, 2016 07:25AM Ridley wrote: Joy-Anna - sorry this happened to you. One additional thought is to ask your oncologist or surgeon about doing an MRI or a PET scan to check for any residual cancer. I suspect the chances are very low, but one of the checks pathology would do is on the margins of the tissue removed. Wishing you peace in resolving this situation.",
      "MessageIndex": 18,
      "PostDate": "17/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841284",
      "Title": "Hospital lost my cancer tissue. Desperate for support Joy-Anna Sugar8"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Dec 16, 2014 05:30PM Ridley wrote: Hopeful -- hang on -- I think the diagnostic process is the worst -- lots of anxiety producing procedures.  I hope you get the big B9 result. I too had \"busy breasts\" as one radiologist put it.  I had spontaneous discharge from one side, but they never did a ductogram -- just a biopsy and then a number of other imaging tests after that. I agree with getting a copy of every report -- I never did before this process began, but I think its a great idea and wish I had done that all along.   No one is more interested in your health but you, and I found that I would have to re-read the reports after the appointment to ensure I understood it all.  More than one I had a doc say something which made me think they had missed something in a report -- I was able to ask a question to ensure everything was clear to me and them.  I'm not trying to worry you with that last comment -- I just think that we are our own best advocates. Good luck!",
      "MessageIndex": 5,
      "PostDate": "16/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826364",
      "Title": "Having a ductogram in the morning - What should I be asking dr. HopefulonBay jen23"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Mar 3, 2016 12:33PM Ridley wrote: Me too - I had/have a similar pain/ache. Ended up having an x-ray which came back clear. I do have some back disc issues, so pcp thinks it could be referred pain. X-ray found some calcified bone thing on my other pelvic bone (that side doesn't hurt:)), so back I go for a couple of additional X-rays. My advice - get it checked out if it's bothering you - don't worry about what anyone thinks. Hope it's nothing",
      "MessageIndex": 3388,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jul 10, 2014 02:48PM Ridley wrote: Hi Nancy -- I'm sorry you are going through this -- I hope it turns out to be nothing.   Is there someone you can see to help you start processing the emotional side of this journey.  If not a psychiatrist/psychologist, perhaps a support group?  Of course, as others have said, this is always a great place to share your concerns, frustrations, etc., but maybe some additional support would also be helpful. I had a very long diagnostic process (MRI and mammo showed additional areas that needed to be biopsied, etc.), so upfront, my breast surgeon suggested I see a psychiatrist that worked with their program to manage the anxiety, etc.  I thought it was useful to talk to her, and at the first visit, her telling me that what I was going through and how I was processing things was \"normal\" was very helpful.  In retrospect, I probably should have seen her more frequently, as I ended up having a tough time with anxiety, focus, etc. for months.  Be gentle with yourself these days -- its a very overwhelming process, especially at the beginning. Come back often and let us know how you are doing.  Ridley    ",
      "MessageIndex": 21,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822644",
      "Title": "Unbelievable Nancy2581 Nancy2581"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jun 7, 2015 01:46PM Ridley wrote: I had either 8 or 11 areas depending on the pathology department. Both idc and ilc. All grade 1 except for a teeny spot of less than 2 mm that was removed with my subsequent mastectomies (which was grade 2). The staging was technically done on the largest tumor, but my oncologist told me it was more important to focus on the biology of the tumors vs the stage. He said my recurrence risk was higher than someone who had a single tumor, and at the same stage, but not as high as it would be if they added the sizes all together",
      "MessageIndex": 10,
      "PostDate": "07/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832354",
      "Title": "How is BC staged when you have multiple tumors? jmute Ridley"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 24, 2013 05:20PM Ridley wrote: So almost 3 hours of waiting later,and the pathology review wasn't ready. I'm 0 for 3 on reviewing path reports on the date they were supposed to be ready. Anyway, the rad onc said she would call me when it was ready and my oncotype was back. I figure another 2 weeks before I have a treatment plan for next steps. Liefie, what part of SA are you going to? I took 6 months off a few years ago and spent almost 6 weeks in SA - 3 weeks in CapeTown volunteering and then to Kruger for a safari, and up to Zimbabwe to see Vic Falls. Lots of day trips around as well. I had no idea that the country was so beautiful. I would go back in a heartbeat.",
      "MessageIndex": 4953,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 30, 2013 02:04PM Ridley wrote: Websister -- I am very sorry to hear about your Mom as well.   I hope your DH is back soon from his trip to LA, so he can be there with you during this tough period. Thank you for the \"no-chemo\" wishes. Ridley",
      "MessageIndex": 5009,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Dec 10, 2013 04:50PM Ridley wrote: Scalcott. Sorry about your friend. Re the recommendation -- they likely have an idea of the size of the lesion from the imaging, which is likely why they are recommending lumpectomy (small enough to get clean margins without taking so much of breast that there is not much left.) How old is your Mom? And is her health otherwise good? She could always start with a lumpectomy and see if they get clean margins. My mom had breast cancer 9 years ago at 71. Had a lumpectomy, radiation and took tamoxifen and then arimidex for 5 years. She is 80 and doing great! All the best with helping your Mom through this. I totally remember my Mom calling to tell me the news - one of those memories that has imprinted into my brain permanently.",
      "MessageIndex": 2,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/815606",
      "Title": "scared - advice needed Scalcott MsJAR"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 26, 2013 07:11PM Ridley wrote: Hi Kika -- so glad to hear you got a low score -- I have multifocal, but the largest area was 7 mm and similar to yours -- grade 1 (4 on the scale).  Med onc was not going to order oncotype (said I didn't need chemo), but said he would if I wanted him to.  I did, so he ordered.  I had 10 areas of IDC and ILC, so I wanted to make sure I didn't leave this stone unturned, since I seem to have a great ability to make these little suckers.  I don't have the results yet, but am keeping my fingers crossed for a low score.  I'll do chemo if need be, but hopefully won't have to.",
      "MessageIndex": 20,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/808731",
      "Title": "anyone not get an oncotype test? kika2013 Cathymck"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 9, 2017 09:23PM Ridley wrote: Hey Virgo, you are in the tough diagnosis stage. For most if us things get better once you have a treatment plan in place. Just a thought -- did you have biopsies of the additional spots found on the MRI? If not, they may not be cancer. I know you mentioned you are having a biopsy of your lymph node. If they are, my experience is that the genetic characteristics of the largest area will determine your treatment plan unless the areas look very different based on the pathology. I ended up with a lot of areas of cancer, but it was low grade. The many areas lead to a mastectomy, but the low grade (including the results of an oncotype), was key to the treatment decision re chemo (not recommended for me). Hang in there and ask any questions you have. Also, I recommend you get a copy of all your test results. For me, that meant I could read them after the appointment to see if I had any follow- up questions. Hoping for B9 results for you tomorrow.",
      "MessageIndex": 25,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859177",
      "Title": "I just got diagnosed with IDC/DCIS Virgo73 swg"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 20, 2015 12:06AM Ridley wrote:",
      "MessageIndex": 9,
      "PostDate": "20/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833263",
      "Title": "76 yr old mom just diagnosed mags20487 Ridley"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 24, 2013 01:42PM Ridley wrote: Momof2 -- you sound fantastic -- I'm keeping my fingers crossed that the biopsy comes back as \"nothing\"! Benny -- the picture of you is beautiful -- your short hair looks wonderful -- I read quite a few pages of the posts on this thread and from your picture you would never know you have been through such a journey.  Your photomate is quite handsome as well:) I'm sitting waiting to see my rad onc -- she wanted the pathology reviewed at her hospital, which is an academic centre.  Hopefully, if there are any changes they are in the right direction! Its a gorgeous fall day here -- was out walking last night with one friend and heading out with another tonight -- crisp and cool -- just how I like it.  Thank goodness I was a walker before all of this started -- it has really been key to maintaining the small sliver of sanity that I have managed to hang on to! Hope everyone else is have a great day",
      "MessageIndex": 4947,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 28, 2013 05:54PM Ridley wrote: Momof2, sorry to hear that your biopsy came back positive, and that you have go through the process again. I'm in the middle of finding out about recon now. I had a lumpectomy, but because of the pattern of lesions (10 low grade ones in the lumpectomy), the rad onc says there isn't good data to show effectiveness of radiation. So, I'm 90% sure I'm going to do a bi lat mast and recon. I have it to wait for the oncotype and a review of the pathology before I make the final decision. In any case, whatever you decide on recon will be the right decision for you, but agree with the others that I would encourage you to check out your options. Glad to hear you are able to get into your surgeon on Monday. The waiting part of this process is, as I know you know, such a grind. It's a glorious day here. Was out for breakfast with my walking group. We do a 60 km walk for the main cancer hospital here each year, and three out of 12 of us are now breast cancer survivors, so it's been a really great support group for me. A few of us did a walk after - only an hour today, but the leaves are starting to turn, and it was so pretty. Another friend and I are heading out to one of the national parks here tomorrow morning, for a couple of hours, which will be heavenly. Most of the walk is in the woods, which is my favourite part. Hope everyone is having a good day. Love the phrases, I'm picking up on this thread - caravans, and flags cracking! Who knew? Ridley",
      "MessageIndex": 4994,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 10, 2013 09:59AM Ridley wrote:",
      "MessageIndex": 5140,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 24, 2013 07:01AM Ridley wrote: Momof2 -- awesome news on clear nodes -- rest and dream (maybe about a river or a waterfall...) -- Ridley",
      "MessageIndex": 5395,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 20, 2013 07:34PM Ridley wrote: Jenifer. I am sorry to hear about chemo for you. 42 is supposed to be the answer to the ultimate question of life. So maybe this is your answer to kicking breast cancer out of your life forever. Will keep my fingers crossed that chemo is not too bad. Hi to everyone else -- Ridley PS. Hope you have a choc eclair or something equally tasty to have with your decaf coffee.",
      "MessageIndex": 5741,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 11, 2013 02:01PM Ridley wrote:",
      "MessageIndex": 15,
      "PostDate": "11/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/811969",
      "Title": "The Wait is the Worst Sam2U mermaid18"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Aug 25, 2013 09:57PM Ridley wrote: Hi hobbesla4, I'm not a Sept surg, bit did have a lumpectomy and sentinel node biopsy on Friday. I'm feeling pretty good. Was able to have a shower today and take all of the big bandages off. Just have the steri strips left. I was out for a couple of short walks yesterday and did an hour on the treadmill this morning (I'm a big walker and was itching to get going ). Pain has not been too bad. I'm glad to have surgery over. Now I'm nervous about the final pathology. I get those results the same day you have surgery. Good luck. Hope everything goes well for you. Ridley",
      "MessageIndex": 1,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jul 27, 2014 04:09PM Ridley wrote: Hey Darla - sorry you find yourself here.  This site is great though for any questions you have along the way, or just to vent to people who understand what you are going through, You may not have any more info until surgery - I didn't.   Once the surgical pathology comes back, all of the info you have noted above will be there, including lymph node status, as they will remove a couple during surgery to check, Standard of care with a lumpectomy is radiation, so I would start to get your head around that (if you have a mastectomy, sometimes you don't need radiation, but it also depends on the location of the cancer and whether you have positive lymph nodes.). Your surgeon should explain the options to you.",
      "MessageIndex": 9,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823106",
      "Title": "New to site, recently diagnosed DarlaJ DC197"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jul 29, 2014 06:00AM Ridley wrote: Darla, I'm so sorry about your brother.  Adding this to the mix has to be very difficult.  One thing to remember is that you don't have to be strong, you just have to show up.  Assemble a good medical team that you trust and let them guide you through.  I'm not saying not to be informed (I have my own little binder with all of my results, etc), but you don't have be strong all the time. I had a very long diagnostic process and found that the waiting was the worst time.  Once I had the final test results that confirmed my treatment plan, I could relax a little and the anxiety started to fade. I encourage you to make an appointment with the physician working with you re the depression.  They may be able to suggest something to help.  And these boards have been a lifesaver for me.  Hopefully they will be helpful to you as well. Take care of yourself.",
      "MessageIndex": 17,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823106",
      "Title": "New to site, recently diagnosed DarlaJ DC197"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Aug 8, 2013 02:30PM Ridley wrote: Lauren -- that's interesting re: no BIRADS score -- all of my mammogram/ultrasound/MRI reports have a BIRAD score at the bottom of the report.  My pathology report doesn't.  I'm from Ontario in case different provinces use a different system. Good luck with the biopsy Lolasimply",
      "MessageIndex": 13,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808938",
      "Title": "my cancer scare story.. long but i needed to get it out. sorry. lolasimply ericka5"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Aug 8, 2013 02:00PM Ridley wrote: Hi Emanderson, I did a lot of reading on intraductal papillomas, and from what I've read, they always take them out and the surgery does not seem to be that big of a deal.  I hope that's what it is (as I think that's the best outcome).  One of the website's that I spent some time reading is the \"Johns Hopkins Breast Ask the Expert\".  There is a whole forum devoted to intraductal papillomas (there is an RN who responds to the questions asked.)  I found it useful.  Deep breath!  Good luck!",
      "MessageIndex": 9,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808276",
      "Title": "Nipple discharge emanderson Momcat1962"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 1, 2013 08:34PM Ridley wrote: Hi DoRight, I dont have a suggestion re doctor, but would encourage you to ask about the risks and benefits of any treatments (e.g. If chemo decreased her risk of recurrence by 2%, then it may not be worth the risk.) About 10 years ago, my grandmother was diagnosed with breast cancer at 90. She had surgery (she lived in another province, but from what I understand, the tumour was growing, such that it had to be removed.). I was worried about anesthesia, but she was in good health otherwise and sailed through the operation. She had no other treatment. She lived until she was 94, and passed away from a stroke. Good luck with your decisions. Sorry she has to deal with it at this stage in life. Ridley",
      "MessageIndex": 1,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812045",
      "Title": "Best Doctor for 90 Year Old Patient DoRightByMom salspecs"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 16, 2013 10:57AM Ridley wrote: Nihahi -- thank you so much for responding -- I'm going to print out your response and read it through a few times.  Analysis paralysis fits the bill.  I've been reading the DIEP 2013 thread to understand more about the process and just wanted to say that that thread and this one have such a lovely, gentle, encouraging vibe to them -- beautifully done. I'm going to try to get back to work now! Ridley",
      "MessageIndex": 4875,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 16, 2013 06:40PM Ridley wrote: Thanks everyone for your kind responses.  I'll wear something with big pockets tomorrow for my appointments.  I think by the end of Wednesday I'll be one step closer to making some decisions, which should help. Thanks again -- you are a wonderful group! Ridley",
      "MessageIndex": 4880,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 18, 2013 06:43AM Ridley wrote: Jenifer, I'm so sorry you find yourself facing this battle again. So unfair. You have spent the last year making yourself stronger in losing weight, exercising and eating well, and are going into this fight well prepared. Please stay around and let us know how you are doing.",
      "MessageIndex": 4895,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 29, 2013 12:06PM Ridley wrote: Hi Scouser, I'm so jealous that you get to watch the new season of Dowton Abbey already. We have to wait until January! I have either chemo + hormone or just hormone therapy to come (waiting for oncotype) and radiation or more surgery (waiting for pathology review). It's looking like more surgery and hormone therapy, but will know (I hope) by mid October. Was in the woods with a friend for a couple of hours this morning. It was fantastic out. Now I'm off to do laundry and some work, and then out for dinner for my Aunt's birthday. She is my Mom's youngest sister, and was diagnosed with breast cancer earlier this Spring, so we are sort of going through this together. Something fun to share -- not!",
      "MessageIndex": 4997,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 17, 2013 05:56AM Ridley wrote: Benny I'm so sorry that you have to go through a biopsy. My fingers are crossed that it turns out to be nothing. I have had calcifications biopsied that turned out that way. Sending positive thoughts to be with you today.",
      "MessageIndex": 5230,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 22, 2013 04:22PM Ridley wrote: Momof2 -- I'll be thinking about you tomorrow - hope everything goes well and you feel a sense of calm when you awake. To all the Calgary women -- have a great meet-up at Timmies -- I'm sitting in one now in the airport in Toronto -- just had a pumpkin spice muffin -- had forgotten all about them until someone mentioned them on this thread.  Good thing they are only around for a month or so!   On my way to Ottawa where there is already a windchill in the air -- love Ottawa, but hate how cold it can get there. Edi -- I started back a yoga a couple of weeks ago -- I end up like those women in the picture and don't need any alcohol to get there. Movie -- if you walk across England and want one more to join, I'll do it.  Might go to Spain next year, but England is definitely on my list as well.  Not much movement on my front -- no surgery date yet -- met my new breast surgeon last week, who wants to do another MRI and ultrasound on the \"good side\" before surgery.  Then a CT scan to check for abdominal vessels.  Then my two surgeons are away for a few weeks working internationally to set up a cancer centre (was thinking of offering to go with them and and they use me as a demo!)  So, I expect it will be December or January.  Going to start on Tamox when I'm back from Ottawa since surgery won't be for at least a month or so. Take care all.    ",
      "MessageIndex": 5352,
      "PostDate": "22/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Dec 10, 2013 09:18AM Ridley wrote: Hey Bridge. I had spontaneous discharge that was a reddy brown colour. They thought it was a papilloma (most of the time it is), but in my case it was invasive cancer. Before I knew the result, the surgeon I saw said either way, they would remove the duct. I'm a bit confused as to why you saw a vascular surgeon instead of a breast surgeon ( or even a general surgeon who does lots of breast surgeries.). I would push to see a breast surgeon and get a copy of the pathology from the blood sample to take with you. As I said, the stats would support that the bleeding is caused by a benign papilloma or something else equally benign, but given there is a small chance that its something more serious, I would definitely follow it up. Good luck. Ridley",
      "MessageIndex": 1,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815585",
      "Title": "Referred to vascular surgeon for concerning symptom bridge5of7 Ridley"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 16, 2013 09:57AM Ridley wrote: Hi all, i'm not sure this is the right thread to post on, but I'm going to give it a whirl hoping that you might be able to help.  I'm not sure I'm still in stock, but I might be! I'm almost three months post diagnosis, and a month post surgery (lump + SNB).  I've been pretty lucky on the pathology front, except that I have multiple areas of invasive cancer (10 on the original pathology although my rad onc is having it redone at her hospital, so we'll see what comes back) and multiple types (IDC and ILC plus some DCIS and LCIS). I was given a choice for surgery -- we knew there were a couple of confirmed areas of IDC before surgery, but they were in the same quadrant, so lumpectomy was technically feasible.  I elected a lumpectomy even though I wasn't 100% sure because I wasn't able to meet with a plastic surgeon who did the type of reconstruction I was interested in (DIEP) at the time (I'm in Toronto -- there are only a handful of surgeons who do this surgery and I wasn't at one of those hospitals). So, I'm blessed with clean margins from surgery, but now the rad onc tells me that the studies done re: the effectiveness of radiation don't apply to me because of the widespead nature of my cancer (spread over the quadrant that was removed, which was large -- 15 cm x 14.5 cm x 3.5 cm).  So back to me to make a decision re: radiation or mastectomy.  Not sure all of that context is necessary, but maybe its the requirement for me to make these decisions that is causing me to be \"frozen\".  I think to the outside world, I'm sort of coping -- friends tell me I'm doing great.  I expect I project the appearance of being in control with my binder and research, but inside, I can't seem to get back engaged in work, and during the summer, I was a write-off at work.  Luckily our summer is slow, so I haven't missed any client deadlines yet (I'm in professional services), but things are starting to pick up, so I need to figure out a way to get reengaged, as I have a lot of responsibility at work. I see my med onc tomorrow, and I made arrangements to see one of the radiologists who read some of my imaging and did my wire locs tomorrow.  I want to talk to her about surveillance if I don't decide on mastectomy, as none of my cancer was picked up on the mammograms and ultrasounds that I had as recently as September 2012.  Then on Wednesday I meet with a plastic surgeon who does DIEP to talk about my reconstruction options. Maybe its all of the uncertainty that's still left (chemo or not, radiation or mastectomy, unilateral or bilateral mast, type of reconstruction, etc.), but I need some techniques to start functioning.  I could go on short term disability, but I'm not sure that's the answer as I think it might be worse to be at home where I could google all day long trying to determine what I should do (I'm single - 46 -  and don't kids, so it would be easy for me to go into full time hermit mode). So -- if you've read this far -- first -- bless you -- second -- what did you do?  How did you re-engage and stop being consumed with researching/reading/googling?  Any suggestions? Thanks all, Ridley",
      "MessageIndex": 4873,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Sep 17, 2013 06:21PM Ridley wrote: Hi all, Thanks for all the helpful comments re: your experiences in decision making, working through treatment, avoiding Dr. Google. I went walking with my one of my best friends last night, and had a good discussion with her.  We walked at 8:30 right after she put her kids to bed, so I got bonus hugs from an 8 and 5 year old, who are sweet.  It was a beautiful crisp night out, which is my favourite kind. Saw the medical oncologist today and spoke to a radiologist who has read some of my imaging.  Med onc doesn't think chemo will be appropriate, but is sending the oncotype to confirm.  I think I was fairly clear with him that I felt that the decision re: mastectomy vs. radiation was being left up to me to make on my own and I was struggling with that (analysis paralysis!).  He's going to have a chat with the rad onc, which hopefully will be helpful. The radiologist said we would follow with MRIs and mammograms every 6 months for 2 years, and then annually if I didn't do mast + recon, and that I could expect additional biopsies in my future due to the sensitivity of the MRI.  At the end of the day, I'm going to have to really listen to what my body/gut/spirit is telling me.  Right now, I'm still wavering.  I'm used to making risk decisions at work, but I have a level of expertise and lots of experience. I'm going to try to get back into meditating to help me with the stress and anxiety of the decision. I'm off to get some more steps in make it to 10,000.  Nihahi and Movie -- I read your threads and saw your pictures hiking -- looks fantastic.  I walk with a group every Saturday morning to train for a 60km walk we do every year for Princess Margaret Hospital (Weekend to End Womens Cancer) and 4 of us from the group went on a week-long walking tour of the Ring of Kerry in Ireland last year.  Was harder than we thought it was going to be, but awesome.   This year, we had booked to go to Cape Breton and the Cabot Trail (Nova Scotia) in Oct, but I had to cancel when I got diagnosed, as I had no idea where I would be in treatment.  My friends didn't want to go without me, so we're going to try and go next year.  I've been before a long time ago, and it is fantastic.  I hope we'll go again next fall, as I expect the colours will be gorgeous.   Thanks again for all of the support -- I'm hoping that I can reciprocate and get to know you better. Ridley",
      "MessageIndex": 4889,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 9, 2013 07:44PM - edited Oct 9, 2013 08:55PM by Ridley Hi Ladies, I have been reading along, but not posting for a while. I'm thinking of all of you and your anniversaries, struggles and just the day to day. I finally have some clarity on next steps, which is helpful, but scary at the same time. My oncotype came back at 8, so no chemo. My pathology review came back with fewer tumours, but larger in size. My radiation oncologist took the lead and talked to my medical oncologist and surgeon, and all have agreed my best next step in reducing my risk of recurrence is to have a mastectomy. I have already seen a plastic surgeon to discuss reconstruction and now have an appointment with a new breast surgeon who works with that PS. I'm planning on DIEP recon, so I will delurk on that thread soon (have learned most of what I know about the procedure from that thread and recognize some of you from there.). And finally, tamoxifen. Focusing at work is still a struggle, but I'm hoping now that I have a plan, I will be able to settle down. I just got back from my first yoga class in years, and the instructor is very focused on mindfulness, so I'm thinking that will also help. I have not noticed too much pinktober around, but certainly see what I do see in a whole new light. This experience is a good lesson in sensitivity training. Sweet dreams everyone, and to those celebrating Thanksgiving this weekend, Happy Thanksgiving! Ridley",
      "MessageIndex": 5127,
      "PostDate": "09/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 30, 2013 07:40PM Ridley wrote: Liefie. Thanks for letting me know re the tatoo artist, I will tuck that info away for later. Morwenna - just got back from yoga. We did a tree pose --- horizontally on the floor -- as soon as I knew where she was going with the pose, I thought of your picture. We will do it standing up one day! Hope everyone is feeling well/better. Ridley",
      "MessageIndex": 5468,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jan 20, 2016 04:04PM Ridley wrote: they are both regional cancer centres, and have programs that specialize in breast cancer. I had a second opinion at sunnybrook and my bilateral mastectomy and recon at pmh. I found both to be good. Dr Holloway was my aunt's surgeon and I think heads up their breast cancer program. You could always go for a second opinion at pmh after you have your full pathology from surgery. Good luck",
      "MessageIndex": 8,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/840461",
      "Title": "Princess Margaret or Sunnybrook for DCIS stage 2 surgery Farnad373 Ridley"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Apr 16, 2014 08:38PM Ridley wrote: Cinnamon -- sorry you ended up with LE in both arms and your trunk from SNBs -- you really beat the odds unfortunately. I think I'll do the same as Elilacs and get a referral to see an LE specialist so I can get better educated. I also think I'm going to have to be a better advocate for myself in this area.  I was at an appointment with an oral surgeon the other day, just for a consult, and his nurse wanted to take my bp.  I asked her if it was really necessary given what I was there for, and she got her back up a little and asked me if I had nodes removed on both sides (um -- yes -- otherwise, I would have let you take it). Ridley ",
      "MessageIndex": 6,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820213",
      "Title": "SLNB on both sides anneoftheforest inks"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Jul 1, 2015 12:29PM Ridley wrote: jk- I had bilateral mri guided biopsies. Compared to the first mri, there was a lot more in and out of the machine, and the radiologist and assistant were in the room every time I was out of the machine. I think I still had the contrast, but honestly can't remember. I agree that Xanax should definitely help!",
      "MessageIndex": 4,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/833091",
      "Title": "Terrified about MRI-guided biopsy jk2468 Beatmon"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 7, 2013 10:57PM Ridley wrote: Basinlady, my pathology report from my biopsy didn't have a grade either, but it did say \"well differentiated ductal invasive carcinoma\". When my rad onc read that, she said that means grade 1, which it was on the surgical pathology. I think grade 2 can be described as moderately differentiated, and grade 3 as poorly differentiated. Good luck, Ridley",
      "MessageIndex": 10,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/812421",
      "Title": "Grade of the cancer Basinlady5 Basinlady5"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Dec 4, 2013 07:53PM Ridley wrote: Tb90 - I would enourage you to ask your surgeon to provide you with a clinical recommendation, so at least you have that data point to consider. I had a hard time initially getting my team to do that. I had a lumpectomy and then my team recommended a mastectomy because of the results of my pathology. I had decided to do a bilat mast, but as it happens, I just had a biopsy that confirmed dcis on the other side anyway. I will have a bilateral mast with diep recon next week. A few things that I thought about in making my decision - may not be relevant to you - as everyone says its a very personal decision: - because I'm using my own tissue, I can only harvest tissue from a site once. So if I did one side now, and needed to do the other side later, I would have to pick another site or use an implant - I'm healthy now (except for this little cancer issue), and believe I will tolerate the surgery well and recover well. I know that complications can happen, but I believe I'm in the best position healthwise to minimize the risk of complications. Who knows about the future. - I have a great support system now. I'm single and will move I with my parents to recover. That might not be possible in the future. I don't have any sisters, and can't quite see my brother taking care of me. Friends would always be an option, but they all have full time jobs, kids, etc. - If I wanted to be symmetrical, I would have to do a reduction on the dcis side anyway, so some form of surgery would be required - this cancer diagnosis has played havoc with work. Everyone has been amazing in accommodating me and taking over serving my clients. But I know that I need to get back to operating at full capacity, and in my mind, doing a bilateral now gives me the best chance to not have to deal with a big surgery like this again in future (at least for breast cancer) - my team has told me that I would have to be watched very carefully in the future. I found the testing process very stressful (way more than I expected, or that with hindsight I feel was rational). Having said that, I reacted the way I did, and would like to minimize that stress going forward. Best of luck with your decision. Once you make it, don't look back. Ridley",
      "MessageIndex": 13,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815319",
      "Title": "How to decide to have the \"other\" breast removed. TB90 Stenokim"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Aug 29, 2013 08:37AM Ridley wrote: My grandmother was diagnosed with breast cancer at 90. Had a mastectomy and no other treatment. Lived to be 94 and didn't pass away from cancer (had a stroke.) She tolerated the surgery very well. She was living in a small seniors home at the time. All cases are different, so just wanted to provide one more experience. Best of luck with your decision. Ridley",
      "MessageIndex": 6,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/810087",
      "Title": "90 yo just diagnosed with IPC--what to do? bronxville Beesie"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Dec 10, 2013 10:41AM Ridley wrote: Hi Bridge - I saw my family doc the same day I called her, which was the day after I noticed the discharge. I didn't see a breast surgeon for a few weeks after that - I was traveling. I had discharge for about 10 days and then it stopped. I had one day of fairly significant discharge and then very minor. I didn't even notice for almost a week, which might sound odd. On the \"significant\" day, my pyjamas were so colorful, it all blended together and i only noticed it when I washed them! Good luck!",
      "MessageIndex": 3,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815585",
      "Title": "Referred to vascular surgeon for concerning symptom bridge5of7 Ridley"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Mar 24, 2015 02:38PM Ridley wrote: Hey Ainsleymom -- spontaneous bleeding can result from an intraductal papilloma, which is what they thought I had (like a wart in the duct).  An intraductal papilloma is benign, but my understanding is that they usually remove them, as they can hide more serious issues.  I'm not sure what else can cause spontaneous bleeding.  In my case, I was diagnosed with invasive cancer.  In a way, I was lucky to have noticed the bleeding, as I had a mammogram and an ultrasound callback about 8 months before, and was told everything was fine. Good luck -- I hope your symptoms turn out to be nothing.",
      "MessageIndex": 1,
      "PostDate": "24/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829833",
      "Title": "Blood from nipple Ainsleymom Ridley"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Oct 28, 2013 05:14PM Ridley wrote: Hey everyone -- pictures are lovely -- Morwenna -- that looks like a fabulous tree pose to me.  I started a yoga class a few weeks ago  and most of us are beginners.  We don't stand on one foot at all yet (I think the instructor is worried that we all might topple over).  Nihahi -- OMG -- I can't believe the snow you have.  I have to admit that I had to google map where Okotoks was -- when I saw that it was south of Calgary, I was more shocked.  I know you guys get some crazy weather out there, but snow before Halloween?  The pictures of your hiking treks look awesome and you and your hubby look very happy. Liefie -- I'll going to keep tuned to see if you end up going to the tatoo artist in Vancouver. If there is someone great in Vancouver when the time comes, maybe I'll head there for a tatoo-cation. Momof2 -- how are you doing? Thinking of you all as I read the posts. I'm off for a CT scan on Thursday to check for abdominal veins/arteries.  I've never had one before.   My only prep is not to drink or eat for 4 hours before the scan, and then I know I have to drink something (barium?)   Any tips? Take care all, Ridley",
      "MessageIndex": 5437,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "Ridley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184269/profile",
      "Content": "Nov 12, 2014 02:59PM Ridley wrote: Hi SPLD -- sorry you're here and have such an unusual issue.  Hang in there until they can definitely say its nothing (or nothing serious), which is what will hopefully and likely happen based on the odds, or have another answer for you. I think many would say that  period of diagnosis is definitely the worst regarding stress, so I wouldn't hesitate to call your primary care doc and have her/him prescribe Ativan or something similar if you can/would take that.  As far as imaging, I'm curious as to why you are refusing the mammo.  If nothing else you will have a baseline for the future.  During my diagnosis, I had mammos, ultrasounds and MRIs -- too many to count.  What I learned is that no form of diagnostic imaging is perfect, so often they use what they can see from different mediums to best determine what they are looking at. Good luck!  ",
      "MessageIndex": 1,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826216",
      "Title": "Ultrasound says lymph node or tumor Sweetpotatolemondrop Culturanta"
    }
  ]
}