{
  "AuthorID": "ripplesdf",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
  "Posts": [
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 10, 2007 11:48PM ripplesdf wrote: Thank you sooo much Lisa. I will also take this to dr. I've been \"googling\" for almost 2 hours and getting a lot of info. I'm really leaning in the direction of fibromyalgia b/c of the chronic pain I have. I'm going with my DD on Friday for my first therapeutic massage which my chiro has been suggesting. I can't wait. I will push this inflammation thing until I found out what is causing it. I cannot beleive that bring my triglycerides down so much did not even get mentioned by the doctor. I will be asking alot of questions next visit. Keepin' the faith...Dawn (At least this is keeping me a little more occupied instead of worrying about my abnormal breast thickening until next Friday)",
      "MessageIndex": 5,
      "PostDate": "10/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/581364",
      "Title": "High CRP/inflammation and BC ripplesdf ripplesdf"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 10, 2007 10:16PM ripplesdf wrote: I took Lipitor before and quit after <1 yr b/c my shoulders and legs ached. It went away, but my LDL skyrocketed from 140+ to 193 with this new test. I'm happy to say my HDL increased from 32 to 48 in 2 yrs. I've never heard of SED, but I will check into it. I do have chronic pain from an old shoulder injury 10 yrs ago. Disclocation. I have shoulder/neck/back muscle spasms and the only thing that helps is a chiropractor which compensation insurance covers 2x a months. Thank you so much for the info. I'll do some research. I really appreciate your input. Keepin' thefaith...Dawn",
      "MessageIndex": 2,
      "PostDate": "10/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/581364",
      "Title": "High CRP/inflammation and BC ripplesdf ripplesdf"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 10, 2007 11:13PM ripplesdf wrote: I failed to mention that my triglycerides have dropped drastically from 132 to 40 in two years. I did check out Sed rate on google and got some info. I will mention it to my dr. I also checked statins and women-whoa-information overload! I really am confused now whether to take Lipitor or not. How can doctors be so misinformed? Will have to figure it out for myself and hope for the best either way. Thanks again. Keepin' the faith...Dawn",
      "MessageIndex": 3,
      "PostDate": "10/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/581364",
      "Title": "High CRP/inflammation and BC ripplesdf ripplesdf"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "ripplesdf wrote: I just got back from my pcp and got results of blood tests from a few wks ago. High cholesterol(249)-great-going on Lipitor for that. But my CRP test for inflammation was very high-7.4 and it's supposed to be between 1-3. They told me I'm at high risk for \"cardiac event\"in the future. I HATE taking medicine. Don't like side effects, but I guess I have no choice at this point. My question is, has anyone ever heard of BC causing the inflammation. My dh & I have been being soooo good and so careful about eating well and exercising this past year trying to get back in shape. We're both 50 and ain't gettin' any younger LOL! The last time I had the blood tests a few yrs. ago my CRP was 4 and considered high. Now it's 7.4!!!! Something is going on in my body. I'm currently reading a book called Ultrametabolism by Dr. Mark Hyman and he has done a lot of research and is very easy to understand when he explains about diet,high fiber, good fats, etc. I just can't help but wonder if I'm doing everything right for so long, why is my inflammation so high. I know I should have asked more questions in the dr's office, but my \"old\" doc is leaving I just found out today so I was in so much shock I didn't have the brains to ask more questions of this new, young doc.I know infections can cause chronic inflammation, but does anyone know anything at all about this or know of a reputable website I could check out. I'm still waiting just to see the surgeon to have my mammos and u/s looked at next week. Boy... this waiting is killing me!!! So glad to have this wonderful bunch of caring people to confide in and ask questions. Thanks. Any help is appreciated. Keepin' the faith...Dawn Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/581364",
      "Title": "High CRP/inflammation and BC ripplesdf ripplesdf"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 25, 2007 10:46AM ripplesdf wrote: Prayers to all you wonderful ladies and your mother MB. Keepin' the faith...Dawn",
      "MessageIndex": 12,
      "PostDate": "25/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/585678",
      "Title": "Just Diagnosed Idamaria Idamaria"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 17, 2007 03:22PM ripplesdf wrote: Lots of (((((((HUGS))))))) and prayers. Keepin' the faith...Dawn",
      "MessageIndex": 6,
      "PostDate": "17/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/587394",
      "Title": "Just had stereotactic biopsy"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Mar 5, 2007 09:07AM ripplesdf wrote: I've never had a lumpectomy, but I recently had and abscess surgically opened and the adhesive from the bandaging made a very angry itchy rash under my breast. I agree you should call wherever you had it done to get some advice and maybe have it looked at. Good luck to you.",
      "MessageIndex": 2,
      "PostDate": "05/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/549582",
      "Title": "Breast 3 days after lumpectomy Bethsoda jodigirl"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "May 14, 2007 03:55AM ripplesdf wrote:",
      "MessageIndex": 10,
      "PostDate": "14/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/606992",
      "Title": "total excisional biopsy or another needle biopsy? missz Beesie"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "May 15, 2007 03:15PM ripplesdf wrote:",
      "MessageIndex": 17,
      "PostDate": "15/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/606992",
      "Title": "total excisional biopsy or another needle biopsy? missz Beesie"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 25, 2007 09:55AM ripplesdf wrote: Misty, I did the same thing last Friday. I went to a general surgeon to ask the very same question. I expected to have to tell the doctor I insist on either/or, but she very calmly gave me the option of and excisional biopsy to remove the whole lump or wait for 6 more months. She knew what I would opt for as this thickening in my breast has been there for 4 yrs. and the surgeon I saw then did not suggest a biopsy or mri. Good luck. I hope you get the answer you are seeking. Keepin' the faith...Dawn",
      "MessageIndex": 1,
      "PostDate": "25/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/593724",
      "Title": "Anxious about meeting with Doctor Misty0418 Misty0418"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "May 15, 2007 02:51PM ripplesdf wrote:",
      "MessageIndex": 15,
      "PostDate": "15/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/606992",
      "Title": "total excisional biopsy or another needle biopsy? missz Beesie"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "May 19, 2007 01:21PM ripplesdf wrote:",
      "MessageIndex": 20,
      "PostDate": "19/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/606992",
      "Title": "total excisional biopsy or another needle biopsy? missz Beesie"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 30, 2007 04:22PM ripplesdf wrote:",
      "MessageIndex": 8,
      "PostDate": "30/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/597940",
      "Title": "Wrong decision??? Hypochondriac?? Paranoid? TracyPlatt Indigoblue"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Jun 4, 2007 08:11AM ripplesdf wrote:",
      "MessageIndex": 9,
      "PostDate": "04/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/624418",
      "Title": "terrified windblown Weimarmom"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 14, 2007 10:35AM ripplesdf wrote: I too am awaiting tests-going for surgeon consultation on Fri.. I had mammos almost yearly since 35. I have fairly large breasts and I guess my gyno wanted me to start early. 4 yrs ago they found a \"thickening\" in my left breast so I had to go for a magnification and u/s. Nothing showed but the radiologist stopped in an area which was where the thickening is and had me put my fingers on it so I would know where it is when I do my BSE. Needless to say, I was sent to a breast surgeon and she assured me it was \"nothing\". I have had 2 mammos since and supposedly no changes, but I can feel a change. It feels harder in that area and does feel sore at times. I have been contemplating reduction surgery for over a year now, hopefully to relieve back and shoulder problems. Now I just want to get an \"all clear\" from the general surgeon to proceed going to the plastic surgeon next month. But something just keeps telling me to push this until I found out EXACTLY what it is. I'll be happy if it's just my old body turning \"lumpy\". IT is amazing to read some of the stories of how women found them and just kept pushing until they got answers-not always what they wanted to hear. UNBELIEVABLE!!! It has only made me much more aware of my body. By the way, when I went to my new gyno and pcp they both told me to go to the surgeon I went to 4 yrs ago. I called in Feb. to make an apptmt. GUESS WHEN? SEPTEMBER!! I could not believe it. I was so disgusted, I chose a general surgeon who lanced an abscess in Dec. for me under the same breast that's giving me problems. I can't help but wonder if this is related. Guess I'll just have to wait and worry until I see the doctor Friday. Oh the waiting game. I feel for every one of us who has to deal with this. Good luck to all of you. Keepin' the faith...Dawn",
      "MessageIndex": 46,
      "PostDate": "14/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/563887",
      "Title": "How were you diagnosed? Symptoms/Signs, etc? greenacres nelia48"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "ripplesdf wrote: Hi Samae. I posted in reply to you last week or so and haven't noticed if you have any news. Hoping everything went ok. I'm anxiously awaiting apptmt. with breast surgeon hopefully sometime soon. My new gyn felt the \"ridge\" I have been feeling and the pea size lump below it. I'm hoping to get this over with soon. Hoping to hear from you soon. Keepin' the faith...Dawn Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/543967",
      "Title": "Samae how are you? Any News? ripplesdf ripplesdf"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 25, 2007 11:10AM ripplesdf wrote: EXACTLY what happened with me. I loved the dr. She was very softspoken and listened to me and was very reassuring. I am having my preop appt. Fri. to go over my procedure pre testing and I will have my biopsy at an hospital outpatient clinic on Fri. May 4th. I don't know how I got so lucky to get in so soon, because the dr thought it would be at least 4 wks but I called the office yesterday to see when it would be and they gave me this date. It seems like this waiting is taking forever. So glad you have a great dr too from the sounds of it. Take care. Will keep in touch. Keepin' the faith...Dawn",
      "MessageIndex": 3,
      "PostDate": "25/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/593724",
      "Title": "Anxious about meeting with Doctor Misty0418 Misty0418"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 26, 2007 06:04AM ripplesdf wrote: Thanks Vicki. It's so good to finally find a dr. who is caring enough to listen. I appreciate your input so much. You are one of the \"veterans\" that I look up to. It is great that people like you with so much knowledge about these things takes the time to help us out who are trying to find our way so to speak in this journey. It's nice to know that we a shoulder to lean on. Thank you so much again for taking the time to reassure us. Keepin' the faith...Dawn- Misty hugs and prayers to you.",
      "MessageIndex": 6,
      "PostDate": "26/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/593724",
      "Title": "Anxious about meeting with Doctor Misty0418 Misty0418"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 26, 2007 11:43AM ripplesdf wrote: Misty yes it is a blessing to have this site. Don't know what I would have done without it these past few months. I probably would have been out of my mind. It is so helpful to come here and be able to share or just simply read. I have a really sweet husband and great kids (all grown). I just do not want to talk to them about my thoughts and feelings because I do not want to scare them. They are all very precious to me and I pray that this is B9 because I can't bear the thought of them worrying. I really am not scared-just anxious to get this over with. I know in my heart if it is \"c\" that I will get thru it ok. I'll worry more about my family than me. But it is great to have this site for support and help with questions. Thanks for the prayers. I'll be saying some for you too. Hopefully the 22nd will be here quickly. Take care. Keepin' the faith...Dawn",
      "MessageIndex": 8,
      "PostDate": "26/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/593724",
      "Title": "Anxious about meeting with Doctor Misty0418 Misty0418"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 3, 2007 09:57AM ripplesdf wrote: What a run around! It's hard enough to deal with all this stuff and then someone messing up can really throw a wrench in it.! Good luck tomorrow. Keepin' the faith...Dawn",
      "MessageIndex": 3,
      "PostDate": "03/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/575201",
      "Title": "SOME good news! alyssasmom badboob67"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 19, 2007 06:08PM ripplesdf wrote: WOOOOHOOOO!!! That is great. Go out and celebrate!!!",
      "MessageIndex": 3,
      "PostDate": "19/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/588965",
      "Title": "Good Results"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Mar 16, 2007 04:44PM ripplesdf wrote: Chris, I'm so glad you posted. Back in December I had the same thing, a bump about the same size under my left breast-right in the crease actually. It started to turn red however and I kept a close eye on it for about a week. Then it started to get more \"pimple\" like in nature but huge. It got SO sore that it hurt to wear a bra and b/c I'm big busted, it caused me more pain in more ways then one. It finally got so painful that I had to go to Er (on a weekend) b/c I couldn't see my dr. They said it wasn't \"ripe\" enough to lance it so referred me to a surgeon the following Tues. Needless to say, I had a hard time by then just breathing in and out it hurt that bad. I just kept putting heat packs on it like the Er told me to do. I had it lanced and it hurt getting stuck w/two needles to numb, but it was well worth it to have the fluid out. The dr told me to leave the packing in for 3 days and then I could take it out myself-yuck. It was like a shoelace and I could not believe how much was in there. They said after a week it was healing too quickly and tried to reopen with a swab with numbing solution-not fun. They told me if there was still a lump in a month or two to come back. Well its now been 3 months and it doesnt' have much of anything but a scar, but is very tender and the area beneath it on my ribs is VERY sore. IT hurts just to touch my ribs in that area below it. I have a dr appt. with the surgeon on Apr. 20th and am hoping she may have an answer as to why it hurts so bad underneath the incision. I've been researching on google and a lot of it seems to be something called costochronditis(sp?)-a sort of arthritic condition. But I also am having a lot of pain in that breast these past few months on the left side of it. Sometimes it feels like it is so full-like engorged like it was 20+ yrs ago when I breast fed. I had a mammo last month and nothing showed so I'm hoping this surgeon will do more testing to give me some answers. I have an \"irregular thickening\" on the upper side of that breast that my new gyn made note of and said it's probably just due to aging(I'm almost 50). So I'm hoping that's all it is and if not, I want it removed if nothing else so I can stop worrying. I hope you get to your doctor ASAP and get some answers. Maybe it's just a simple cyst/abscess and it can be removed and checked. Good luck to you. Keepin' the faith...Dawn",
      "MessageIndex": 2,
      "PostDate": "16/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/560018",
      "Title": "Question about a very small cyst chrisla roseg"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "May 10, 2007 06:12AM ripplesdf wrote:",
      "MessageIndex": 7,
      "PostDate": "10/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/605387",
      "Title": "Breast thickening sarsar sarsar"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Feb 10, 2007 04:50PM ripplesdf wrote: Laura...LOVE YOU RIGHT BACK!!! Thank you so much. Isn't this the greatest place? I am waiting for my \"annual\" mammo on Tues the 13th. I'm almost 50 and have been having mammos since I was 40. I did not go for 2 yrs. I've been \"in between\" gynos. My \"old\" gyno delivered all 3 of my children and I've seen him for 30 yrs. It's been very hard finding a new one that my ins. will cover. I somehow got lost in the shuffle and tried to make an appointment last Oct. and was told by my new gynos office that there was a 5 month wait!! Finally, I am going on the 26th. In 2001 I had my usual mammo and they found a suspicious area. Went for magnification and then went to breast surgeon. She felt it was ok. Ultrasound didn't show anything. Well, I hadn't checked lately like a fool and just took her \"diagnosis\" for granted. Now I think it has grown. It is oblong in shape and about 1-1 1/2 inches I think. I am having a hard time accepting that it may be a problem, but I am going to insist on having it removed. I'm hoping that it is in the ducts and is contained. I think I am going to let my DH know tonite. He will really be upset if there is something wrong and I did not tell him. I HATE to make him worry. We've had so many losses in our lives. We lost his mother to colon cancer just a few years ago. My mom and dad too in just the past 3 yrs. from CHF and emphysema. DH has lost 2 sisters and a brother thru the years to \"other\" causes and it pains me to even think of him worrying even a little bit. All I can say is thank God for our kids and his brothers kids. They are what has helped us thru this. I find this site such an inspiration. They helped me thru the tough times back in '01 while I was taking care of his mom so she could be at home in her last few months and I was worrying about my breast lump. This place has meant so much to me. I lost touch the last few years but I'm so glad to find it again. It is a place of peace for me to be able to read what others are going thru and know that anytime I need to vent you guys will always be here. Thank you again so much and God bless you for your beautiful words of comfort. I truly am praying for you and all these beautiful spirits on this board. I pray that all who suffer from this disease and from the worry of going thru tests, etc.I pray for those who have not found this place of comfort and peace, that they will somehow find us and know there are others here who care and can \"listen\" when they think that there is no one else they can \"talk\" to . Keepin' the faith...Dawn",
      "MessageIndex": 1,
      "PostDate": "10/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/529970",
      "Title": "just sending love to you all SecretAgentL rockvixen"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "May 9, 2007 07:05PM ripplesdf wrote:",
      "MessageIndex": 1,
      "PostDate": "09/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/605387",
      "Title": "Breast thickening sarsar sarsar"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "May 10, 2007 08:42AM ripplesdf wrote: Thanks ladies. Dh just got home about an hour ago from mowing and I told him the news. Needless to say, there were tears-he didn't let on before how worried he was and we have finished of the bottle of wine! LOL!! I told him how much you ladies have meant to me and his eyes just welled up when I told him how much I learned about BC. And most of all how many friends I have made thru this. If not for all of you here, I would have absolutely had a nervous breakdown. Thank you again so much for your advice and caring. I wish I could embrace each one of you with a hug, but this will have to do for now....((((((((((HUGS))))))))) Love ya lots. Love, hugs and prayers to all. Keepin' the faith...Dawn",
      "MessageIndex": 10,
      "PostDate": "10/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/605387",
      "Title": "Breast thickening sarsar sarsar"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Jun 4, 2007 08:42AM ripplesdf wrote: Panny I thank God that you finally got the courage to go to the dr and have taken your first steps to feeling better. These wonderful souls on this site helped me so much. I started my journey in Feb. and finally on May 4th I had my excisional biopsy and it was B9. Just know we are all here for you praying that you can get thru this one step at a time. We will be here for you every step of the way. Try not to think so far ahead. I know it's so very hard, but I found if I just got thru day by day, hour by hour and didn't think about next month or next year, it was a lot easier to deal with. You are in my prayers everyday. May God and your guardian angels surround you with their healing, loving light and help you thru this journey. Keep up the good work girl and before you know it you will be feeling better. Love, hugs and prayers. Keepin' the faith...Dawn",
      "MessageIndex": 95,
      "PostDate": "04/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602729",
      "Title": "Panny : are you out there? moogie Weimarmom"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Mar 16, 2007 10:10AM ripplesdf wrote: Lots of prayers and gentle (((((((((hugs))))))))) go out to both you and your daughter. Just keep the faith that you both will get through this together and you have all of us here to help you. I truly will keep both of you in my prayers daily. Keepin' the faith...Dawn",
      "MessageIndex": 1,
      "PostDate": "16/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/559738",
      "Title": "Ultrasound report tumblemom mahamc"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Mar 28, 2007 08:32AM ripplesdf wrote: Tammi, I too had a breast \"specialist\" tell me it was nothing after looking at my mammos and u/s 4 years ago. She said she was sure it was B9. I was so naieve back then. I should have asked more questions and insisted on a biopsy. I had a mammo 6 months later like they told me to and then told to go back to having them yearly.I did but I hadn't been in 2 years and really hadn't given it another thought like a fool until about 4 months ago when I was feeling like the lump was slightly larger and that there is a thickening about 1 inch above it. I tried to get into the same dr but was told I'd have to wait until SEPTEMBER!!! I let the receptionist know I was not happy and that both my gyn and my pcp said I needed one. Needless to say I'm having to wait until Apr. 20th to see a general surgeon in another city. I live in the Catskill Mtns of upstate NY and dr's of any kind are few and far between. At this point I am counting on my pcp and gyn and this surgeon to get me thru this. I AM insisting that both areas be biopsied. I try not to worry and realize that most of the wonderful people here are the unfortunate 20% and I pray for all of them as well as the ones who haven't found this reassuring site. It's the only thing getting me thru this wait. I really am glad you are pursuing this. This experience and the experience's of others on this board has made me realize that WE are our own keepers and that we can't rely on \"professionals\" to ALWAYS be looking out for us. I realize there are a lot of wonderful drs out there, but for some of us they are very hard to find. I wish you good news and will be praying for you. Keep us posted. Keepin' the faith...Dawn",
      "MessageIndex": 10,
      "PostDate": "28/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/569206",
      "Title": "need advice, anyone online??? tammi86 tammi86"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "May 7, 2007 09:20AM ripplesdf wrote:",
      "MessageIndex": 4,
      "PostDate": "07/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/603727",
      "Title": "burning pain MsReba MsReba"
    },
    {
      "AuthorID": "ripplesdf",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44611/profile",
      "Content": "Apr 22, 2007 05:40PM ripplesdf wrote: WHAT AN IDIOT!!!!!",
      "MessageIndex": 5,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/591258",
      "Title": "Wearing of a Bra is a major Risk for Breast Cancer *DELETED* author stacey2930"
    }
  ]
}