{
  "AuthorID": "RLoveC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277118/profile",
  "Posts": [
    {
      "AuthorID": "RLoveC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277118/profile",
      "Content": "RLoveC wrote: Hi all, I am 36yo and was diagnosed with invasive ductal carcinoma last week, and am awaiting the specific tests and a treatment plan later this week. It is in at least 1 but probably 3 lymph nodes... So best guess is stage IIB or IIIA... The immediate problem is that it came at a horrible time for my family (well, when is a good time for cancer, haha). We were planning to move to a big city where I would work fulltime and my husband would focus on grad school. Now those plans are up in the air and dependent on my treatment plan. We also have a 1 and 3 year old who require a lot of energy when not at daycare! We are already accepting that he will need to seek a normal job so that I can scale back on work for awhile. And get help from our parents with the kids. My main question is... assuming that I will get a good combo of surgery, radiation, and chemo... Will I be laid out and unable to deal with the high-energy demands of a small apartment in the middle of a big city? Should we scrap this move and build life in a more low-key relaxing environment where we can spread out in a big house? I wish we had all the time in the world to consider and then make a new plan designed around my treatment schedule... but of course the world continues to move and we need to make a few decisions now. Even though I don't have all the details of my diagnosis and treatment, any tips from survivors would be wonderful Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865924",
      "Title": "IDC mothering during treatment RLoveC msphil"
    },
    {
      "AuthorID": "RLoveC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277118/profile",
      "Content": "Jul 17, 2018 05:53PM RLoveC wrote: Thanks to all of you. It is so reassuring to send out a question into the ether and have women who have actually lived it chime in. Even if it is such a big question that there is no right answer. None of my friends or living family have been through this so I cannot express how nice it is to find this online community. No decisions will be made until after my treatment plan is set. Thanks for reiterating that point! Yes my treatment is our famiily's top priority. Based on your responses we had a few talks about our family/friends support system in the different locations. I had probably been underestimating that. It is important and will be the next factor when making the decision. I am one of those people who thrive on the new and challenging! Today I feel optimistic and ready to start my fight! Cannot wait to get this plan in place with my oncologists tomorrow.",
      "MessageIndex": 5,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865924",
      "Title": "IDC mothering during treatment RLoveC msphil"
    }
  ]
}