{
  "AuthorID": "robink",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
  "Posts": [
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 12, 2008 10:33AM robink wrote: This is what I have learned so far in this unexpected journey: 1.  Except for inflammatory breast cancer, breast cancer is not a medical emergency.  (Even though it feels that way to you).  It can take weeks to get all the pieces of your diagnosis together so deal with this one day at a time. 2.  Breast cancer is treatable with a high rate of success! 3.  Do not focus on all the what ifs, instead make your decisions based on what you know regarding specifics of your diagnosis when you receive them. 4.  Call a friend who can be with you this weekend 5.  Take time to review the wealth of information contained within this web site. 6.  You are NOT alone.  It's OK to be scared, many of us are at different times. Praying for you...",
      "MessageIndex": 2,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/703866",
      "Title": "im scared jacqdan sueper13"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 21, 2008 05:20AM - edited Apr 21, 2008 06:47AM by robink Craig, One thing at a time.   It is good that she found the lump, even better that she is seeking medical advise.  Her first test will be a mammogram (breast x-ray).  There are others tests but they are done sequentially if a previous test is abnormal. Have her ask her doctor about continuing the pills as birth control pills do cause changes within the breast. You are right - waiting is horrible.  God will give her, and you strength and peace to get through this one day at a time. You came to a terrific site, there is a wealth of information.  Just try not to scare each other into a diagnosis.  Deal with what you know. Blessings",
      "MessageIndex": 2,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/704335",
      "Title": "22 year old girlfriend found a lump ega04cmd Sassa"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 9, 2008 08:45PM - edited Apr 10, 2008 10:18AM by robink Hi.  This is my first post but have been encouraged by what I have read on this site.  April 7 I had a left mastectomy, also an infusaport was placed.  This was my 2nd surgery, March 18 I had a lumpectomy but the margins weren't clean. I am so glad to have the surgery behind me!  Reconstruction will come later this year or even in 2009.  This afternoon I'll see my surgeon, dressing change, wound check, etc.  While I am very curious as to what I look like now, I am apprehensive.  My husband has attended all appointments and been in on all discussions but I don't know if I want him to see me this way today.  How did any of you handle this?",
      "MessageIndex": 95,
      "PostDate": "09/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702931",
      "Title": "Anyone having surgery in April?? ottawagirl wahine"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 8, 2008 08:53AM robink wrote: Teton - sounds like my circumstance was different than yours.  By the time I saw my BS the screening mammo, the diagnostic mammo and the biopsy have already been done and my cancer diagnosis had already been given to me. Once at the appt. with the BS she looked at my chart, films, me.  Spend a lot of time explaining what we knew and outlining things that needed to happen and choices I needed to make.  She was kind and compassionate - just the right doc for me.  If you have not had any tests than that's something your BS will ordered.  No doc can make a diagnosis without certain information. I hope you've done some reading on this site.  There is a wealth of information for women in all stages of this journey. Oh - and I do understand how dizzy all this can make you feel, so much so fast.  I am glad you were able to be seen so quickly. Best wishes for you today.",
      "MessageIndex": 1,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/705212",
      "Title": "What Can I Expect at the Breast Surgeon Appt? Tetonview RedWeasel"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 13, 2009 02:43PM robink wrote: Sable - I am in the process of deciding which Deva products to start with.  Our cat sleeps on my pillow and I'll be curious if she messes with my hair when I use it. Otter, Sable - when I had my 1st mammo post surgical in January there was a young radiology student observing.  The tech was being very kind, as discreet as possible.  I said I think you need to see what your patients have dealt with and opened my gown.  The tech pointed out the scars from the port, mastectomy and reduction on my right breast.  The student spoke not a word. Roxi - Have a wonderful vaca!  Recon this summer?  I looking toward early fall for mine but currently don't have time for all the extra appts. ranD - It was good to hear your trip for the xray ended up uneventful.  I'm a chocolate lover also! Every one else - Hi! This evening I work 6 hours at the nurse advise center for my hospital.  It's a nice break from the hectic pace at my regular job (Urgent Care).  Finally this morning I began the tedious process of sorting through 3 bags of stuff for tax purposes.  There were a lot of copays for so many things relating to me but I don't think it will total up to enough to make a tax difference for us. This weekend I think I'll do our college aged daughter's taxes on Turbo Tax.  Ours - think the account can deal with that. Gracie - how's your grandaughter? Love to all...",
      "MessageIndex": 5362,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 14, 2009 07:23PM robink wrote: Oh Julie - My sincerest sympathies to you and your family. Where does your aunt live? Karin - way to go with that post.  So tech savvy. DH and I made a few color selections, not as bold as it would like but there is one more room and it's going to make a statement. It's been a delightful day but haven't done much of anything (except the home depot trip and lunch with DH). Better go feed the dogs.",
      "MessageIndex": 5392,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 19, 2009 12:26PM robink wrote: rand- for the longest time since my mastectomy last April I was certain I did not want to go through the reconstructive process.  Over the past 2 months my mind set has changed and I want to be equalized.  One mile stone for me was having my mammo in January and learning my right breast was OK.  There is no sense of urgency here, just the knowledge of wanting to get it done.  Simply don't have the time for an 8 week recovery so maybe in the fall.",
      "MessageIndex": 5444,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 22, 2009 08:14AM robink wrote: My cancer detecting mammo was Jan. 28, Official diagnosis Feb. 14, Lump out of there but didn't get it all ectomy March 18.  It wasn't until my mastectomy was decided that I revealed this problem to people beyond my inner circle.  How wonderfully supportive many people were!  In an old shoe box now named \"Robin's Blessings Box\" I have kept all the cards and notes and verses\", none more special than another. Happy Anniversary to Karin and Julie for what today means.  Happy Life to all of us! Happy no chemo to Randie! Happy 8 hours sleep to Kerry! And Happy whatever the heck you need it for to everyone! I'm at work so I'd better get back to what I'm being paid for. RK",
      "MessageIndex": 5476,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 26, 2009 04:15PM robink wrote:  My Song for the CD: ABBA  \"I have a dream\" I have a dream, a song to sing To help me cope with anything If you see the wonder of a fairy tale You can take the future even if you fail I believe in angels Something good in everything I see I believe in angels When I know the time is right for me I'll cross the stream - I have a dream I have a dream, a fantasy To help me through reality And my destination makes it worth the while Pushing through the darkness still another mile I believe in angels Something good in everything I see I believe in angels When I know the time is right for me I'll cross the stream - I have a dream I'll cross the stream - I have a dream I have a dream, a song to sing To help me cope with anything If you see the wonder of a fairy tale You can take the future even if you fail I believe in angels Something good in everything I see I believe in angels When I know the time is right for me I'll cross the stream - I have a dream I'll cross the stream - I have a dream As a woman with a strong faith in Jesus Christ I would have to say first and foremost that it was the strength and peace given me in Christ that permitted me go through the cancer journey and emerge a better person.  Any number of praise and worship songs, or comforting hymns would fit nicely into the compilation but for now that is not my choice.  I don't know if any of you remember about my DD spending her hard earned money from her 2008 summer job to fly my sister out to be with me.  During my sister's visit we saw \"Mama Mia\", dragging DD with, much to her dismay.  Respectfully DD sat there trying not to puke or roll her eyes while Sister and I laughed throughout the movie and sang with many of the songs. Clearly DD didn't care much for the movie.  Well, along comes Christmas 2008 and what should DD give her mother as a gift but the DVD \"Mama Mia\". Anxious to watch it with me this time around she too laughed and later I learned got the sound track from itunes. Over her Christmas break from college she watched that movie numberous times to the point of memorizing songs and lines. I worship the creator of the Angels.  He blessed me with many angels that ministered to me throughout this past year and there is not enough room in this posting to name them all.  DD and Beloved Sister are only two. DH has been the man I needed time and again, however if you would have asked me prior to this if I thought he'd be strong enough I probably would have said no.  The 19 of you May Chemo Sister's provided comfort, support and understanding that most others were unable to because you all understood something they had not experienced. I am truly sorry that each of us had to go through this but remain firmly convinced that we all somehow better, changed persons...Dear Angels thank you for crossing my path RK",
      "MessageIndex": 5558,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 10, 2009 06:47PM robink wrote: Have Mercy oh God, Have Mercy.  Please bring Jackie back home to her family and her beautiful lilac bush. RK Jen - send my love and prayers to her husband when you talk with him next.",
      "MessageIndex": 5764,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 28, 2009 09:32PM robink wrote: Belgian Waffles for breakfast - warm syrup.  Randie, what type of juice would you like?  Oh yeah-there will be fresh strawberries! Will someone bring some butter?",
      "MessageIndex": 6053,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 9, 2008 08:24AM robink wrote: Rock - you make me laugh.  I'll give you my appraisal for the class tomorrow.  I am 52, have never worn a lot of make up, but since i'll be losing some of all of my lashes i wanted to learn after all these years to put on eye liner.  may be simple for some but i'm challenged with that technique.  And if i get a nice lunch and a few laughs then all the better. Robin ",
      "MessageIndex": 793,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 13, 2008 04:02AM robink wrote: Greeting from poolside! Lab values were good so the infusions were ordered and started in a timely manner. Benadryl, Pepcid, Taxotere, Zofran are in.  Cytoxan has just started but should be done in about an hour. Best wishes to all being dosed today.  And good wishes for minimal SE to all others.",
      "MessageIndex": 880,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 19, 2008 02:42AM robink wrote: For anyone:  back to the Nioxin subject.  I am confused about which \"system\" to try #1, #2, #3  which one? My brain is sooooooooo foggy I can't get it figured out. Robin",
      "MessageIndex": 988,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 21, 2008 01:43AM robink wrote: Ladies, I must tell you what my 18 year old dd has done for me.  It requires a bit of back ground info.  Columbus, ohio is where I grew up but moved to Colorado in 1981.  My entire family resides in Columbus.  One of my sister's was going to come to spend time with me in July, after my last chemo.  Her husband lost his job last week and the trip to Colorado was not going to happen.   This past week I've had a very difficult time with round 3, physically and emotionally so I was quite upset about not being able to see my sis. Yesterday my dd (who works two jobs) informed me that she has arranged for my sis to fly out for a visit, paid for it with her hard earned money but is keeping the arrival date a secret. Today I am still awed by the depth of her love and her desire to do such a special thing for my sis and I. I am blessed. ",
      "MessageIndex": 1015,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 21, 2008 02:52PM robink wrote: Rock: re holding our shit together too well.   Earlier this week I posted my melt down (don't remember now if it was on this thread or the taxotere/cytoxan thread).  I had worked very hard on staying positive for me and everyone else but Monday I allowed myself to feel what I've been stuffing inside, allowed myself to speak the words.  It was quite therapeutic.  A dear friend who has been a sounding board for me told me she was glad to hear I had finally gotten pissed off, that it was about time. I didn't need anyone's permission to fall apart but it sure felt good to have someone give me a pat on the back for being human and vulnerable.  My friend reminded me to keep the big picture in mind, one sucky year that will eventually be behind me, that I am enduring this to assure many wonderful years ahead of me. where was i going with this????  Oh yeah...it's OK for us to break down but we can't stay down,  we all have futures and wonderful years ahead and must tell ourselves this is doable!!!!!!!!!!!!!!!!!!!! ",
      "MessageIndex": 1024,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 29, 2009 08:53PM - edited Apr 29, 2009 08:58PM by robink WooHoo Sue! You are beeuteefull!  Blue is your color - nice Ta-Ta's! Randie-we're each holding our bottles of talcum powder praying for a successful talcing of your lung.  Here's to the formation of scar tissue and no development of pleural fluid. (May '08 sisters tap bottles of powder in a toast to you) The bedhead pictures are comical - promise not to post them on FB",
      "MessageIndex": 6071,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 5, 2009 09:54AM robink wrote: Greeting from Columbus Ohio to all my dear May 08 friends/sisters. It is wonderful to be here with the family, to help with my parents. Tomorrow is the day Jen and I will get together. Jen - hope that nasty indigestion has gone away.  Cracker Barrell does have comfort food. I have some pepcid ac in my purse. To everyone - love you and have a terrific Tuesday.",
      "MessageIndex": 6122,
      "PostDate": "05/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 5, 2009 12:45PM robink wrote: Noelle - 20th high school reunion, basement floods, mohawk hair cuts, bath bombs over the border, ears clogged with wax...it all sounds like a blast!  How long will you be in Vermont? You could have some real fun and irrigate your ear with a 1/2 strength peroxide solution.  The sound would given you crazier than you feel right now.  I know traveling can be quite hectic but I hope the \"break\" provides some relief for you. Rock - Thank you for getting yourself taken care of while away from home.  It's so easy to let things wait, to put them on the back burner or sweep it under the rug.  You are very important and highly valued.  You have so much more to accomplish and so much more to contribute. It must have been very helpful to have your friend, the doctor, explain things and provide you with advice along the way. It made me sad to know the Mr. Dickwad had hurt you, to know that you went through those procedures so far from home, to have you crying for those that you love and to miss them so deeply  BUT I am very happy to know that you feel enough to have a crush again, to get flushed and feel the giddyness of anticipation; I am glad to know that you get angry and just don't wear the mask of resignation; and I am thrilled for all those that cause you to feel love and joy! What did you do for your birthday?????????????????? Are you feeling better now, and how about your sisters and their surgeries? BTW - HAPPY BIRTHDAY!!!!!!!!!!!!",
      "MessageIndex": 6357,
      "PostDate": "05/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 5, 2009 03:43AM - edited Jul 5, 2009 03:44AM by robink I agree re: May 2008 instead of bc.org.  We have all been rather candid at times, sharing things that we would prefer others not read.  It would never be Randie's intent or ours to cause added pain to loved ones already hurting due to our absence. Good thought - thanks. Don't send any money yet as we need to decide part 2 (personal cards and monetary gift). RK",
      "MessageIndex": 6574,
      "PostDate": "05/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 6, 2009 06:39AM robink wrote: Friends - the flower order has been placed.  As for the money owed please donate what you would have sent me to the monetary gift we will send Randie's family. Love, Robin",
      "MessageIndex": 6587,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 10, 2009 11:54AM robink wrote: Julie - I sent you a PM",
      "MessageIndex": 6626,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 10, 2009 12:39PM - edited Jul 10, 2009 12:40PM by robink Oh Jen- thank you for letting us know about your conversation with Randie's hubby.  What is his first name? Mary - is the infection in the drain site, in the incision, with in the new breast tissue of what?  How frustrating and worrisome this must be. Cris - dental pain sucks, guess you don't have a choice but to deal with it but it still sucks. Otter- whose idea was this unimproved fishing location vacation? Kristy and Noelle - what is a relaxation basket?  Sounds wonderful even though I have seen one. Kerry - how cold do your winters get?  Randie's song!  Why are there so many songs about rainbows And what's on the other side? Rainbows are visions, but only illusions, And rainbows have nothing to hide. So we've been told and some choose to believe it I know they're wrong, wait and see. Someday we'll find it, the rainbow connection, The lovers, the dreamers and me.",
      "MessageIndex": 6627,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 5, 2009 11:38PM robink wrote: WooHoo!!!!  Another Otter postcard!  I love it! Otter - my son will be living in Kalispell, MT Aug. 29 - Feb. 13.  It is in the northwest portion of the state.  Luke works with YWAM, is currently working in St. Croix, USVI and has been there for a year.  This winter will be much colder for him.  Back to your Montana trip- I love the interent, was able to find Ennis,MT to get an idea of where your travel has taken you.  What is next?",
      "MessageIndex": 6749,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 6, 2009 01:07AM robink wrote: Dana - I read your response to Rock's special note to you on FB.  Good to hear from you! What the heck is Gemzar? I liked that term you used - a Heart Hangover.  Talk about it hear if you feel safe with that.",
      "MessageIndex": 6751,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 29, 2009 08:41AM robink wrote: Greeting Friends!   Today is a beautiful, sunny, warm late summer day here in Colorado.  A great day for recovering - yesterday I had a tissue expander inserted in preparation for my reconstruction that will hopefully take place by years's end.  This lopsided boobie that I now have is comical but it brings me hope knowing what will eventually be there in it's place.  Last Sunday DH and I moved DD back to Glenwood Springs, CO for college.  I do miss her but we have quite a lot to keep us busy with me recovering, DH and I in the midst of house rehab (carpet, paint, tile), me starting college courses again (RN-BSN), and myself interviewing for two different positions at the hospital (interventional radiology and out-patient oncology). Prior to posting my update I read through the previous 3 weeks and have made notes - unfortunately I can't read them very well (could be the Vicodin) so I trust you'll forgive me if they make little sense. Karin- I didn't see posts from you here but have read a few things on FB.  How's the training going?  Best wishes for a wonderful year in your new position. Otter - How much longer will you be on the road? I reread the post about the pink pen.  It has been interesting to me how I too shyed aware from BC items but find myself now looking at them in appreciation.  Gracie - sounds as if you've been putting in a lot of hours at the hospital.  Don't those long shifts do you in? Adrienne - Seems as if I missed your post.  How are things for you and yours? Julie - 33 chemo treatments then rads with two busy daughters, a summer where you had little down time and now the school year rat race to run again...I can see why you are run down and that it must be frustrating for you. Kristy - Amoxil is so much gentler than chemo and the army of drugs that comes with it.  So pleased that you've had a year for good health other than the dental issue. Sue - cheers to your new headlights! and may your scars be minimal.  The Chrysalis Foundation was aptly named.  I too need the group encouragment of exercise.  Three times a week is just right Noelle - what a rough summer for you but you are tougher than all these obstacles.  Thank you for the loving effort put into Dana's basket. Jen - I understand you being selfish with the prospect of an Otter hug, won't even blame it on your headaches. How did your scan go?  Is your son back in school? Tell me about your homemade foob.  With this expander I have to figure out something different. Jean -  happy one year out!  to you and others.  I admire your determination with your running.  5 miles - a 5km walk kicks my butt.  Your reunion story made me smile Kerry -  your chooks are laying, your are smelling newly mown grass, meeting new friends with like back ground and booking trips to Thailand!  You are living life in the exact moment. Mary -  how's your dad and your sis?  Wow - what a summer for your family, Fairest of the Fair and a Champion Tom Turkey.  You are the Qween Mum Roxi -  so good to learn your bone scan was clear.  Yay for negative on the BRCA.  How are your backaches? Eddie -  you've traveled a lot this summer also.  Neg BRCA, lower cholesterol, clear colonoscopy?  HipHip Hooray! Did you find out about Randie'sbox?  It took me three time or reading before I understood what a deportation surgery was. Cris - What sensation do you get with the compression sleeve?  Tell the inmates it has bionic super powers and they best not mess with you. Dana - I saw on FB you got you goodie basket today!  We all are smiling in our hearts knowing your were pleased!  Heather - how's your mother?  Did you have your repeat mammo? Linda - It's been enjoyable reading about your trips this summer and the marathons you've been running.  That is truly impressive! Ladies - it's been great catching up with you!  Having two weeks off work I'll be poking my head in the door here more often. Love to all! Robin",
      "MessageIndex": 6825,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 14, 2009 11:14AM robink wrote: Hey Sue - if when they revise that nip again, where will the tissue come from? Too early for me to decide if I'm going to add the headlight to my new boob when it is restored.  And I agreed about the reunion - hope it happens also.  Turns out DD is hoping to complete her schooling a semester early so a college graduation may be in the works mid May 2010. Eddie - when I googled circle of friends it came up with a number of sites and I'm too lazy to read throught them all to determine which one you are referencing.  Please give a link to the site for myself and other who would like to click and have the site appear.  Thanks! Today I will be putting the finishing touches on my paper and getting it submitted to my instructor.  Yesterday the book for the next class arrived - it's about nursing research.  This afternoon I meet with a rep from the college network as I am planning to go through them to prepare for co-requiste courses.  I can study the necessary materials, test out of the courses, obtain the credits and save a butt load of money.  WOO_HOO! Keri - tell me about spring/or summer what ever you have going.  The EARLY cold snap (18 degrees) over the weekend leaves me longing for the summer we never really had so I desire to live vicariously through you! Besides, I love reading every thing you write. Friends - have a wonderful Wednesday. Kristy - I think it was you I saw with a recent BD on FB.  HAPPY BD!  Hope it was good. Robin",
      "MessageIndex": 6989,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 17, 2009 05:20PM robink wrote: Happy 44th Jeano!  Have a most excellent dinner! It's nice here today, big improvement over 18 degrees and icy roads last weekend.  The dog and I took a leisurely  two mile walk.  I admire you stamina and ability to run - all of you who can.",
      "MessageIndex": 7001,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 23, 2009 12:13PM robink wrote: Rock- I am a Registered Nurse with an Associates Degree.  23 years after graduation I have once again stepped into the academic world by enrolling with Regis University in the RN-BSN (Bachelor of Science in Nursing) program.  My courses are online, 8 weeks in length.  The first began Aug. 24 (Professional Role Development), the 2nd began Monday of this week (Introduction to Nursing Research - Evidence Based Practice).  I ended the 1st class with a 98%!!!!!!!!!  There are 10 nursing courses, I think I'll be able to complete the program in 2 years.  As for the sociology course - it is one of 7 modules I will complete through the college network.  They provide the student with the study materials that prepare for testing out of the course and recieving college equivalency credits. Testing is DANTES or CLEP.  The author of the study materials for sociology is Kevin D. Everett, associate professor at Radford University. So that was a long answer to your question... Angels - I hear you about Mom+packrat+small house.  My folks should be in a senior living apartment at the very least, they were looking at apartments, Mom didn't like any of them but did a lot of purging in their small home.  Well, they (she) decided they would stay in their home.  The purging has stopped and the spending has begun again.  Keep in mind she had 2 stokes that have impaired her in many ways But she can still pick up the phone to order from catologs!  My poor Dad, handicapped himself after a massive stroke in 1986, keeps cancelling the catalogs, Mom keeps ordering and the cycle repeats itself. Glad you had your brother to help you with the job.  What an accomplishment!  Too bad ya didn't find money stashed under the mattress. Otter- 81 degrees huh? I am happy for you.  The melt off began today.  The wild thing is we live 10 miles NE of Colorado Springs, about 500 feet higher in elevation, enough to make a world of difference.  Many times we will have blizzard like conditions or heavy snow fall but the city will be minimally impacted. 10 miles away but a different world in the winter.  There has been a rare halloween without snow since I moved here in 1982.  So I always expect it by Oct. 31 but come on - 2 wintery blasts before that date.  NO NO NO NO NO.  HaHa - as if I have control over the weather. Today I had a follow up appointment with my plastic surgeon.  Restoration scheduled for Jan. 11, 2010.  Odd to think I am excited about surgery but I am looking forward to this!  The expander is taking some getting used to, it's stiff, way too perky - in fact I have to hike the other side of my bra much higher than normal AND pad it to match.  This is not a complaint - just the way it is. Jen- DH and I went to Cracker Barrell for breakfast today, fondly recalled our meeting at a Cracker Barrell.  Hope it works out for you and Jean to get together while she's in Columbus. Love ya'll",
      "MessageIndex": 7016,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Dec 8, 2009 05:02PM robink wrote: Jen - thanks for the cookie ideas.  I will try that with round 2. I have the day off Wed. so make room for me on that bus.  Won't the technicians gawk when they see 18women walking in with you.  Makes me laugh just to think of it.  Then again - we could put on our cloak of invisibility... Just saw my PS today - surgery is a go for Jan. 11",
      "MessageIndex": 7150,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Dec 9, 2009 07:47PM robink wrote: Just finished the last batch of cookies - will send them to family in Ohio tomorrow.  Mom can't bake anymore, a sister has just taken in her daughter and 2 grandsons, oldest sis is chronically ill and the rest of the fam simply likes cookies. And yes - I send the old shapped ones also. They taste the same! Julie - we have had bitter cold but snow was minimal.   Jen - glad with squishing is over. Otter - have all the cookies you want!  When do you leave for your Christma trip? - never mind.  I just reread your post.  DH wants to make a fruit cake - think he just wants to soak it in rum or brandy or something with alcohol.  Fannie Farmer, huh?  I'll see if I can find it on the internet.",
      "MessageIndex": 7157,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 6, 2010 06:26PM robink wrote: Oh Jen - what an ordeal this has been. 15 days of H E double lockey sticks. To think of another procedure to fix the popped internal suture isn't what you or DH want to have to deal with. Glad for the few slowly healing spots. Going your way is healing prayers through God, cyberspace, slo motion through the atmosphere - how ever you can reach for them. Robin",
      "MessageIndex": 7273,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Feb 25, 2010 11:01AM robink wrote: I am sorry for what you are going through, Cris. So glad your Sis, Mom and friends are near and holding you up. I'll be with you in thoughts and prayers. Robin",
      "MessageIndex": 7436,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 24, 2010 03:06PM robink wrote: Jen, Good news about a clear Mammo! Cracks me up about the techs checking out your trammy boob. If they would have said no, I'd worry about their desire to learn.  I agree with your hubby concerning getting the lipo done, take advantage of the opportunity.  And your comment about just wanting to be done...I'm right there with you. Robin",
      "MessageIndex": 7536,
      "PostDate": "24/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 20, 2008 04:39AM robink wrote: Angels, All things are pointing to the start of T/C (4 cycles every 21 days) in early May.  Next week I have a 1 1/2 hours chemo teaching session and base line labs, also will meet with someone about complementary therapys.  Then Tueday the 29th a final meeting with the onc or his NP to be sure we understand everything before my 1st treatment.  So that puts me into the 1st week of May. Will you be working during your chemo?  It had been my desire to work part time after sessions 2,3,4 but don't know if that will be possible.  I am a nurse at a very busy clinic that deals with a lot of sick people.  Since I've been out on FMLA the clinic has been \"restructured\" and our call center eliminated.  With the call center gone, there goes my opportunity to distance myself from patients who could jepordize my health. Therefore an extended medical leave is most likely my next best option to cover my position after FMLA expires. ",
      "MessageIndex": 9,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 28, 2008 08:52AM robink wrote: Hello Corky, Welcome to this thread.  I hope you are holding up with what's ahead of you.  My 1st treatment will be Thursday, May 1.  Already have my port and will be given Taxotere and Cytoxin.  Can't say I'm looking forward to it but I want this behind me so I am ready to proceed.  There is a T/C thread you might check into. Keep in touch as your treatment moves forward...",
      "MessageIndex": 36,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 30, 2008 02:31PM robink wrote: Otter - that wording is the only way insurance will pay for your wig.  I just realized I have misplaced my Rx.  Yikes!  Since you are in a rural location, will you be able to get to a shop with a large selection of wigs?  Colorado Springs has 2 large shops and several smallers boutiques.  The smaller stores were able to give more personal service but every place I've walked into has had respectful, pleasant employees.  It's still a bit too painful to accept that my unruly hair will not be around to bother me anymore.  At least that's one thing that will come back! ",
      "MessageIndex": 67,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 8, 2008 12:37AM robink wrote: Wow Roxi - I hadn't paid much attention before to the length of treatment for the herceptin.  I am HER2- so I tended to focus on my specific schedule with T/C then an AI. Today I had my hair cut quite short, it's curly so it looks crazy but it's short enough I can play around with the wig - see if I can pass it off as my hair.  I am considering the LGFB class for next week. As for working-I'm on medical leave until recovery from the final chemo.  My job puts me face to face with sick people all day long and the risk to my health isn't worth the worry.  If I had needed to work the biggest concern to me would have been my lack of mental clarity -chemo brain? Rocket - I hope all those antinausea meds and a little ativan sprinkled in helps you sleep well during your 1st chemo night. All others - best to you in your journey Angels-I had my port put it the same day as my mastectomy.  It has never bothered me.  Tomorrow it will be accessed for the 2nd time for lab work.  I remember the waiting \"for the other shoe to drop\" after my 1st treatment last Thursday.  Good news is I was never bedridden with all the possibilities, bad news there were a few days I just felt crappy, kinda like flu symptoms.  I am hoping it's all minimal for you!",
      "MessageIndex": 164,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 12, 2008 11:53AM robink wrote: Has anyone experienced a change in their vision?  I've had one treatment T/C and I definatley do not see as well.  I wear progressive lenses and it's a chore to find that visual center.  And when I take them off, my near vision is worse than it was before chemo.  Can hardly see to put on makeup. Robin",
      "MessageIndex": 222,
      "PostDate": "12/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 14, 2008 10:34AM robink wrote: Cristine : waiting in limbo is sooooooo hard.  I've just prayed for peace during this time. In the meantime find things to enjoy before chemo takes the normal out of your life (temporarily) Robin K",
      "MessageIndex": 255,
      "PostDate": "14/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 14, 2008 10:35PM robink wrote: Rock:  $40 for a wig?  no way... The wigs shops I've gone to are pricey.  I ordered a couple Paula Young wigs, just for fun.  Went to the American Cancer Society and they would have given me a wig but they were eithe too blonde, too long or to old lady like. Glad it worked out for you the way it it. Robin",
      "MessageIndex": 265,
      "PostDate": "14/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 18, 2008 12:01PM - edited May 18, 2008 12:03PM by robink Tina -  call your breast surgeon.  Tonight to let whoever is on call know what's going on.  I would imagine our doc will want to see you on Monday but perhaps someone should check you tomorrow to make sure you don't have an infection.  If you put any dressing on it make it loose and be carful with the tape so you don't irritate your already fragile skin. I can't speak for your onc and delaying your treatment.  Call them Monday also.  Better to delay treatment then to put yourself at risk if you aren't well healed. I don't believe in luck, I do believe in prayer and I just prayed for this situation.",
      "MessageIndex": 307,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 23, 2008 01:24PM robink wrote: KKing - my onco only gives the Neulasta IF the blood counts justify the need.  Perhaps you could ask for reconsideration.  Have them check your CBC one week after chemo and/or if you show signs of illness.  My white count dropped to 2.1, low but not dangerously so.  It came back up to 5.2 on it's own.  it was therefore decided that CBC's would not be checked inbetween treatments unless I developed mouth sores or fevers or other signs of illness. $550 is a lot of money if you don't really need the med. It can't hurt to talk to the office.  This is YOUR treatment. Robin",
      "MessageIndex": 437,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 4, 2009 10:55PM robink wrote: Hello Ladies, It has been so long since I've come here that I forgot both my user name and password.  Having skimmed through just 2 pages of recent posts I see familar names and remember fondly the support you gave me - the strength given by sharing with others who knew what I was going through.  Wanting to take the time to \"catch up\" I'll post my update another day.  Robin",
      "MessageIndex": 5207,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 8, 2009 08:51AM robink wrote: Kerry - Ambien CR is a sleeping pill (supposed to help you go to sleep more quickly and stay alseep). I usually get 7 hours with it.  Ativan is for anxiety, it's a controlled substance, it helps me sleep better that the Ambien and I wake up without a \"hang over\" effect. I was given many refills for both after diagnosis and chemo but now that is over they think I should be coming off this meds.  The Femara has caused a significant number of side effects whic I am combating with supplements such as Tumeric/Cucurmin for joint/muscle pain (make help you with walking) and sleep aids.  So if my Onco wants me to stay on Femara for 5 years he will prescribe me these meds of 5 years.  Seems fair enough to me. Gotta get ready for my shift. Good Day to all",
      "MessageIndex": 5254,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 8, 2009 09:12PM robink wrote: Eddie and Adrienne - I am so happy you had the opportunity to meet. There is something about the picture in the mirror I especially like.  This week I am going to get a map, put pins at each of your locations and dream of a road trip. ",
      "MessageIndex": 5262,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 8, 2009 10:50PM robink wrote: Sable, my home town is Columbus, OH.  I was just there 3 weeks ago.  Will be going back in June. maybe earlier if Mom needs extra help after her hip fracture/surgery/rehab.",
      "MessageIndex": 5265,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 10, 2009 02:44PM robink wrote: Jen - my family is Columbus is thrilled with the warmers temps. What is scared 2? Good news for me from home - Mom came home from rehab today.  She is a 3 year breast cancer survior, no rads or chemo but had 2 strokes in her immediate postoperative period.  Anyway, she fell 4 weeks ago, fractured her hip, required surgery and some weeks in rehab.  Way to go Mama! Happy day from Colorado where it was 16 degrees any snowing this morning.",
      "MessageIndex": 5298,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 10, 2009 06:48PM robink wrote: Karin - Vent as you need to.  Isn't it harder at times to parent children as adults then when they were little. And to have DH on a different wave length? I imagine we feel the pain in either circumstance, helping vs standing back.  It's OK to let them stumble, fall, even fail.  So cry with her, offer your hand to help her stand and trust she learns from mistakes of the past. So sorry for the pain all of you are going through.  I'm glad your grandson has you and DH to help them.",
      "MessageIndex": 5308,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 14, 2009 11:31AM robink wrote: Karin - Love the pic. Thanks for putting it up. Sue - Happy retirement.  Who is doing your DIEP? My PS doesn't do that procedure but I want to find someone in CO that does.  Enjoyed your ramble. Rock - your friend sounds REAL. Too bad she found her way into the sisterhood of breast cancer. Not glad for the BRCA results in your family but glad they are being tested.  My family is dragging their feet even though mom, oldest sis and myself have one remaining breast. Rand- here's to a fun BBQ.  I'm looking forward to your summary of comments Gracie - thanks for the update Kerry - the rain sounds so refreshing.  It is sooooo dry here in Colorado, high fire danger.  March is supposed to be our snowyest month. Thus far we've had 2 dustings, just enough to make the roads icy for morning commutes. Kristy - glad you treatment went well Hello to all and wishes for a good weekend. RK",
      "MessageIndex": 5377,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 15, 2009 04:51PM robink wrote: Linda - stipping off all that wallpaper doesn't sound like a task I'd care to tackle.  Glad most of it's behind you. Just took a look at the color we painted in part of the kitchen.  \"Earthern Red\" It was supposed to be red clay color but that it not what it looked like once we started painting.  Guess it has a hint of purple in certain light.  DH and I were pleased with the unplanned color change. Today we went to a beauty supply store that is supposed to carry Deva products, was looking for the smaller bottles of Low Poo and Angel but the shelves were empty.  Asked a store clerk to check the store room but there was none to be had.  Guess I'll be ordering from the internet. Otter - did soak your hair in the olive oil help? Noelle- enjoy your 3 days off. More later...",
      "MessageIndex": 5403,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 19, 2009 09:38AM robink wrote: Sue - where are you getting your diep done?  that's what I want. My PS does the TRAM.  I think I'd have to go to denver for DIEP. RK",
      "MessageIndex": 5439,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 27, 2009 10:29AM - edited Mar 27, 2009 11:53AM by robink a new topic:  will one of you explain to me how my winter gear (goggles, mittens, hand warmers) seem to diasppear after our children have left our home? Those items would come in handy this morning as DH and I need to use the snow thrower to clear out effects of our spring blizzard. He's working on the dog yard 1st so they will have a place (instead of my house) to relieve themselves.  Problem is it's 8 degrees and they don't want to go out. 0950 update: 13 degress, sun looks like its trying to come out, the driveway is clear for DD to come home today (had to stay with roomie in Denver last night due to hazardous road conditions).  The delemnia may be her Toyota Corolla getting high centered on our un plowed dirt road.  DH will run the truck a few times to make her a path. No complaints here about the snow!",
      "MessageIndex": 5568,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 4, 2009 09:31PM robink wrote: Oh Sue!!!  Your news is the greatest!  Thank you for letting us know. Karin - you told us what you did because we needed to hear it.  Glad you followed your prompting and typed away. Rock - enlighten me to \"Burma Shave\". Glad to learn the butterfly made it into your hands.  My insurance company paid for my BRCA (results negative but I'm not sure I believe it since my mother, sister, aunt, cousins, and maternal grandmother had breast cancer). My daughter is soon to be 20 years old.  I will counsel her and leave the decision up to her as to having genetic testing done. http://www.cancer.gov/cancertopics/factsheet/Risk/BRCA Jean - what type of recon have you decided to have done? I haven't begun talks with my PS yet about mine.  It's only been the past month or so that I have become aware that I \"need\" to have the procedure done, although I must have know eventually I'd have one as I asked my breast surgeon to leave whatever skin she could. Roxi - enjoy your spa day.  It sounds lovely. When will your daughter start school? Kerry - your Easter trip is coming at a good time for you.  Take pictures and post them on FB.  Are those chooks giving you eggs yet?  I have to say I had never heard the word chook before, figured you were talking about chickens as you were frustrated with their lack of laying.  http://www.worldwidewords.org/qa/qa-cho2.htm   What about your new boobs? What procedure are you going with?  And about taking a break from the boards - we all understand.  As you know I stayed away for 8 months. FB is appealing because there is minimal to no cancer talk there. Oh yeah, I was happy to read about a butterfly lighting in your mail box! Eddie - Congrats on marking your first year after diagnosis. Isn't it good to be at a point that you can say you are beginning to look back on all of this?  It is true that each of us needs to move on.  It's also true that each of us will accomplish that 20 different ways.  How nice to know that we can have this support system as we yo-yo through the days -weeks - months that will eventually become year 2-3-4-and 5!!! OK - question for any purple juice users.  What are the floaters in the bottle? I can't shake them away, no way I'm drinking it without knowing for sure what it is. It does look like a very small berry but it is slimy. I have found the taste to be better than the other product I was using but I don't discern a difference in how I feel. Perhaps because I have been drinking the other stuff for several months. It has been snowing here all day, not much accumulation but very very windy and cold. DH, DD and I attended an impressive production \"The Thorn\" at a local church, had a nice lunch in town then came home.  I'm being lazy this evening - writing to you, eating handfulls of Frosted Flakes and watching DD pack for her return to school. My hair has taken on a life of it's on and I love it!  It's different evey day.  DD took a picture at Christmas time and it is so much thicker and longer now. The only thing I'm not crazy about is all the gray so I may put a semi-permanent color on it for a change of pace. Guess I've gone on enough so I'll just say good night. ",
      "MessageIndex": 5694,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 7, 2009 10:31AM robink wrote: Noelle- I know that song! Cracks me up each time I hear it (which isn't too often).  I had a good laugh last night and this morning - while following along with the yoga dvd routine my dogs decide it's a great time to take advantage of \"mom\". An 80+ pound black lab squirming next to me while I'm supposed to be concentrating on my breathing and performing a full body stretch, a 10 pound maltese mix staring at me - licking my hands-climbing up my chest does relieve tension as it makes me laugh.  Certainly not the way the instructor of this video invisioned - none the less I felt better then when I started. No snow for us today, sunny and in the 60's.  I need to get my birdfeeders filled, cover new holes in the wood siding started by woodpeckers, get my car washed and ??? Wishing all of you a wonderful day!",
      "MessageIndex": 5724,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 12, 2009 05:11PM robink wrote: Rock you inspired the writer in me... In my Easter Bonnet With all the snow upon it I'll be the coldest lady In the Easter Parade BURMA SHAVE",
      "MessageIndex": 5800,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 22, 2009 11:22AM robink wrote: anji111 and gmw- you may need to start a \"starting chemo in May 2009\" thread.  Kristy started this thread for us and it has been such a lifesaver.  I wish you well through this journey.  It certainly is frightening and unpleasant at times but there will come a day when you will be able to look back and say \"I did it!\"",
      "MessageIndex": 5938,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 22, 2009 11:49AM robink wrote: Jeano and Otter - what a fantastic picture! How wonderful you were able to meet. Both of you look great!  Rock - how long will you be in South Africa? I saw your update on FB about not posting publicly re: your crush.  Quite understandable.  I'm happy for you that you've found this guy. Jackie, Sue, Randie - good to read that each of you are recovering well. Everyone else - I'm been keeping up on what you've posted but have gotten behind on replies. My step-dad is doing well! I have planned a trip to Ohio May 2-10 and am excited to be able to be going \"home\" again so soon. Word from my sister is Mom and Don are looking into assisted living facilities.  If they do move it needs to be their decision. 31 days ago I started a drug holiday from Femara.  I had acquired a nasty cold, ended up feeling as bad as I did during chemo days and decided to stop the Femara to see if my \"complaints\" would lessen in severity.  Within 4-5 days I felt as if I had been given my life back.  Guess I didn't realize how poorly I was feeling until this drug was no longer in my body. I've been praying about going back on it for prevention purposes but I don't have a strong indication about starting it up again.  No- my onco doesn't know.  For me it's a quality of life issue. The easiest way for me to describe this to you is it feels as if a veil has been lifted, I feel alive, I feel hope, I am able to laugh out loud again. Yesterday I trudged out in my snow boots to refill the bird feeders.  We got 18+ inches of snow last weekend.  The great melt off has begun and it's rather sloppy on our property. I love the birds that flitter to and fro, have seen a few blue birds (something rare) and some robins. Here's wishing all of you a great Wednesday!",
      "MessageIndex": 5942,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 25, 2009 10:59AM robink wrote: I love you all...",
      "MessageIndex": 5981,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 26, 2009 07:34PM - edited Apr 26, 2009 07:50PM by robink Randie- I'll stand sentry, permit vital signs only when you are awake. The poems are wonderful! Keep them coming. Final work won't be published until June giving a full month for reflection and creativity.",
      "MessageIndex": 6015,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 2, 2008 10:43PM robink wrote: Rock:  my family is totally dysfunctional when it comes to breast cancer(grandmother, aunt, cousin, mother, sister) and my BRCA 1 and 2 came back negative. We were all shocked.  My onco said my family definitely had problems regardless of the result of the genetic study. IF you come back positive would you do anything different?  I don't remember what surgery you had. Robin",
      "MessageIndex": 674,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 4, 2008 10:47AM robink wrote: SharonF:  the list is on page 18.  It only has start dates, not nearly as organized as otter's list on the t/c thread.  Robin",
      "MessageIndex": 707,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 4, 2008 10:53AM robink wrote: Eddie: I have a port that has been accessed twice.  1st time subcutaneous lidocaine was used, the lido stings but is effective with pain control.  2nd time a spray was used (makes the skin very cold and therefore numbs it) which I found rather ineffective, I didn't feel the initial puncture but felt a good deal of pressure.  Next time I'd like to try EMLA cream.",
      "MessageIndex": 708,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 6, 2008 10:16PM robink wrote: wow otter:  let me have that cheescake recipe!  cheesecakefactory.com?  Darn, have to drive to denver for that.  It will give me something to look forward to for my July BD!  (3 weeks after my last chemo so my taste should be normalized again.)   Rock, when are you going for some - cheesecake?  It looks so gooooooooooooooood.  I did make those brownies and darned if they don't taste good to me.  My family, however, will love your BD brownies! Oh, I ordered two beaubeaus (www.4women.com), received them yesterday and now wish I have never wasted money on any thing else (wigs, turbans, skullcaps, bandanas).  The other items will make nice donations to the American Cancer Society.",
      "MessageIndex": 761,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 9, 2008 11:40AM robink wrote: Roxi,  I'm signed up for my third trip to chemo world Thursday",
      "MessageIndex": 800,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 27, 2008 01:01PM robink wrote: tomatojouic - hope you will be satisfied with whoever takes over you care. Cristine - glad you finally got your treatment.  Not that I wish this kind of stuff on people but dragging the end of this saga out is not something I want for any of us. Rock - you and your TMI alert made me laugh out loud!  Hope your _____ is healing. About the podiatrist, I've considered going to one as I have this funky big toenail that just keeps getting funkier.  I am actually hoping the chemo will kill off whatever is making it grow wierd.  Maybe that will be a good side effect!  I don't like the NO barefoot thing. Roxi - hurray for being done! RanD - sorry you've had two crappy weeks but good to know your sone is doing better. Otter - I wasn't familiar with Traci's thread so I checked it out.  Think I'll post here with my friends when I need to vent. Well, I'm off to bed.  Gotta take the 21 year old ds to the greyhound station at 4:30 am, he's headed to montana for 6 weeks.  $300 roundtrip compared to a $700 flight so needless to say the bus won. Robin",
      "MessageIndex": 1106,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 3, 2008 10:01PM robink wrote: I'm with you ewesterman...DONE DONE DONE DONE DONE, relieved yes but more so next week when the worst of my se's will be over.  I am hoping that this cycle mimics #2 which seems to be a piece of cake!  Aiming for chocolate.  Rock, I'm with Otter.  You were/are and awesome substitute chemo professor. Dark chocolate curing everything?  don't know about curing everything but I enjoy eating it, Ya know, it is counted  amoung the good belly fat foods as it contains MUFA (monounsaturated fatty acid).  I don't think they intend me to eat the amount that I do.",
      "MessageIndex": 1218,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 4, 2008 11:20AM robink wrote: Eddie - I'm DONE DONE DONE with any toxic chemicals being infused into my blood stream.  Three weeks from now my onco and I will discuss what's next - anti hormal therapy. Robin",
      "MessageIndex": 1226,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 25, 2008 09:51AM - edited May 25, 2008 09:52AM by robink Rock:  May your day with your friend, cupcakes, clippers, Airedale be everything you need it to be.  I am praying you will eventually find some peace with this situation that is currently out our your control.  Your trip today shows you are not letting it control you and that is reason for hope!  On another thread I came across how you took your screen name and believe you will find the courage to \"Rockthebald\"! Blessings",
      "MessageIndex": 479,
      "PostDate": "25/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 25, 2008 12:25PM robink wrote: Otter:  you were not supposed to shave your head unless you wanted to take that step.  So hang on to those frontal strands and celebrate them.  It would be awesome if those hairs hung in there with you throughout the entire \"experience\".  They are yours keep them forever if you want !!!!!! Interesting title for that book by Jarvis.  It's not about the hair.  Just what was it about?  I just got on Amazon to read comments about the book and didn't find words that would prompt me to purchase the book.  Did you see the one titled \"It's not about the boobs.  Finding humor in healing.\"  and \"Crazy Sexy Cancer Tips\"  Maybe someday I'll find some interest in reading things like that but for me now it's my own story that is daily being written. ",
      "MessageIndex": 483,
      "PostDate": "25/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 30, 2008 07:59AM - edited May 30, 2008 07:59AM by robink Ladies:  I made the requested changes to the \"Big List\".  You'll find it on page 18 of this thread.  Consider printing it for reference purposes.  As you can see it's simply the start dates of our chemo journeys so don't hesitate to remind us when your next treatment is (although Cristine seems to be following that part and doing a weekly reminder). Debbiem425:  I got my 1st laugh of the day when I read your psot.  Thanks for that! Roxi:  Did you know that as a cancer patient your have some protection under the Americans with Disabilities Act.  Mention that casually in conversation with your manager.  \"Reasonable accomodation\" is expected, if you even needed accomodation but to accomodate you out the door...not OK. I personally understand your anxiety.  While I've been on medical LOA the clinic where I am employeed has restructured and has too many nurses.  My manager was told me she'll hold my position but the hospital is \"encouraging\" my co-workers to find another unit they would like to transfer to otherwise human resources gets involved and helps a few staff members make decisions.  Right now there are two of us out on leave and it's when we come back \"someone\" will no longer be on staff. We just don't know who.",
      "MessageIndex": 594,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 7, 2008 05:26PM robink wrote: eddie - it's your hair (for how ever long you keep it) and you need to do what you are most comfortable with.  I liked it when my hair was only 1/2 inch long!",
      "MessageIndex": 768,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 9, 2008 03:12AM robink wrote: I'm going to the Look Good Feel Better class Monday,also and am looking forward to it. What I really want to learn is how to apply eyeliner (with pencil) so I hope they teach that.  Today I went to church sporting one of my new BeauBeaus and felt more comfortable and natural than if I had been wearing my wig.  Figured going baldbald would have been too much to all to deal with, and besides it's cooler again today.  Did get compliments from my gal friends and that made me feel great. Otter, glad things are starting out better for you this time. Roxi, hope all goes well tomorrow. Rock, don't you just hate that fog that seems to envelop your brain.  My 2nd treatment it cleared sooner than 1st.  Woops....it's starting to rain, better get our dogs in. TTFN ",
      "MessageIndex": 787,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 9, 2008 05:22PM robink wrote: Look Good Feel Better: hummmmmmmmmmmmmm There was a nice spread, fresh fruit, chesses,crackers, dessert bars, water and joice.  Yummmmmmmmmm. A nice mix of complimentary cosmetics in the bag.  Maybe I'll wear a few of the items.  The foundation was so dark it was quite unnatural.  No problem!  I brought my own makeup bag!  I can't say I learned anything new except that I am happy with my current routine (minimal) and will continue what I've been doing. I was the youngest attendee (52 yrs old).  Several of the older ladies came in with a minimal working knowledge of how to apply makeup and looked suberb when the session was over.  Those same ladies also received wigs and it did wonders for their out look. What did me the most good besides the interaction with everyone was seeing how important it was for the volunteers to want to help those of us in the room AND seeing the smiles emerge from the ladies who were transformed by this event. If you have not gone but want to give it a shot - go for it but take your own makeup if you have sensitive skin or are picky.  You just might have a good time.  And if not, maybe you'll be some tasty snacks!",
      "MessageIndex": 827,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 12, 2008 01:05PM robink wrote: Ok Girls,  it's #3 for me tomorrow at 9:30.  In my mind I see this pie chart divided in fourths, half is now colored in, tomorrow I can begin to color part 3.  Cycle #2 wasn't too bad for me and I am praying #3 will be the same. Talk to you on the other side.... ",
      "MessageIndex": 871,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 6, 2008 05:29PM robink wrote:                                         HAPPY BIRTHDAY ROCK!!!!!!!!!!!!!!!!   Due to your bravery and acceptance of your new reality (bald bald) I had every intention of following your lead and going to my appts. topless yesterday but it was too darn cold here.  In the 40's.  There is new snow on Pikes Peak.  So today, while I did sport the wig while driving to town for a new appt, I took off the wig while on the treatment table.  It felt soooooooooooo good.  Didn't hurt that the fellow was bald himself.  Says his line is \"I volunteer my time at the cancer center because everyone's hair grows back\".  Just doesn't happen to be true for him. I'm going now to make some brownies and will tell my family it's in honor of your birthday!",
      "MessageIndex": 754,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 1, 2008 01:52PM robink wrote: Rock...I'm sorry you are scared of the Taxol coming at you Wed.  Being on Taxotere/Cytoxin I don't know how to advise you.  How often do you go for those treatments and for how long?  It looks like our receptor status is the same but one of your nodes had the nerve to be possible, mine were negative.  Remind me what your were on initially.  I recall being frightened with my 1st chemo but found it all to be anti-climatic.  What I am now dreading is not my next and LAST treatment Thursday but possible crap my body will go through following Thursday.  Well, whatever my reaction is this time it all must be over by day day 7 since DD college visit/registration is days 8 and 9.  Just drug me up with Ativan and put me in a wagon. On Wed. this week I have two job interviews and think I'll suck it up and wear the wig.  My biggest concern is not anyone detecting fake hair but flexing my start date when they learn my leave of absence isn't over until July 31.  I'd consider having my onco sign my release to return to work early but my DD paid for my sister to come visit me and that trip is the last week of July.  Don't think my sis or dd would understand if I said welcome to town, now I have to leave for a new job.  I'm babbling here but am hoping you'll still read...",
      "MessageIndex": 1164,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 5, 2008 05:18PM robink wrote: http://www.cancerandcareers.org/ Janice:  check out this site, it may have some information you find useful",
      "MessageIndex": 735,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 24, 2008 10:29PM robink wrote: Beachmom - I'm done next Thursday.  I hate that it's almost time but to know there won't be any more trips to the pool, bar, beach, exotic destination and be served up my toxic cocktail...woohoo!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! So come on July 3rd.  Get r' done. I'll jump on board where ever you'd like to go.",
      "MessageIndex": 1071,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 7, 2009 09:55PM robink wrote: Hello all - I think I have discovered what brought me back. cancerversary Which one really counts?  The day I had the 1st mammo with the suspicious lesion?  The day the words came out of my GYN NP's mouth or the day I met with the breast surgeon?  Or lumpectomy day or three weeks later on mastectomy day?  How about the anniversary of the first day I found this website and YOU!  I like that one!",
      "MessageIndex": 5250,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 7, 2009 10:19PM robink wrote: Kerry - where did you get that term \"FECK\"?  I kinda like it but I am worked the other \"F\" word would end up falling out of my mouth. Noelle - tell me about this DEVA stuff.  I checked the products out online.  The containers are a pretty green color but what do they really do for you?  Do you personally use any of them? You hair looks so perfect in your pics. The gray in my hair at times makes it as unruly as a brillo pad/ Otter - I remember the Chcken Fat song.  Did you post a link and I missed it? Gracie - the flashbacks must have been hell.  I understand the moving quickly and send you prayers across the miles. My Power Juice is made my Nature's Way.  Tell me about Mona Vie. Roxi - how did the haircut and highlight go?  Did you end up with a lot of gray after chemo?  I am so nervous to commit to perment color as the roots would always need touch up. ranD - what is eissac tea? julieC - did your PCP refill your Ativan?  I alternate between Ativan and Ambien CR.  Four times I have tried to come off the sleep aides but it didn't work. I'll stay on Femara - they refill the sleep aides. Everyone else - hope your weekend is going well REMEMBER THE TIME CHANGE",
      "MessageIndex": 5252,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 9, 2009 11:29PM robink wrote: Are any of you using any of the Power Juice products?  I started with pure Acai berry juice (tastes nasty) and am currently using a product from Nature's Way that is a combo of 4 super fruits with high anti oxidant properties.  The reason I mention this is I've lost 5 pounds since drinking only one ounce daily - well most days anyway. Another benefit is I'm not as DAT as before. Otter, after beginning Femara in October I felt crappy on so many different levels but now feel as if I just may be able to take this stuff for 5 years. Guess I should mention that in addition to the Power Juice I get accupunture treatments, take Lexapro and Synthroid and some type of sleep aids nightly. Almost forgot, am in yoga classes too. Ellenoire - how much longer do you have to take Herceptin? FB chats - I agree with the others and don't think there are any particular rules.  Guess people are fortunate if they can complete a chat without getting booted off the program. Rock - how long will you be in South Africa? Here's wishing you all a good night, Robin",
      "MessageIndex": 5286,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 10, 2009 01:45PM robink wrote: Never mind Otter, I found the answer when I looked her up on the member list.  Thanks anyway.",
      "MessageIndex": 5296,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 11, 2009 11:58AM robink wrote: Holy Cow - there's a lot that's happened since I was here yesterday!  Am LOL with some, feeling sad or angry or shuddering with others. Gracie - I just prayed for Karli and you and your family. Kristy- enjoy that new patio.  Are you on one of the AI's in addition to the Herceptin? Jen - I've seen that product you mentioned at Sam's club.  Do you feel better since taking it? Roxi - we have a deck also.  They can be a PIA to maintain. Randie- so do you get to keep the laptop?  Noelle - I am interested in trying the Mona Vie. The product I currently take I dilute with OJ and that masks the taste.  Just check out your store web site and will go back there when I have more time.  Here's hoping your week improves! Eddie - what now for you if you are training someone to take your place? Julie - hope you are able to get outside this year as often as you would like! Otter - my DD will be in Birmingham the last weekend of April, a whirlwind trip, there for a wedding on the Saturday then flying back to CO Sunday, college finals begin Monday. About my mother - that's for the thoughts and concerns for her.  She lives with my step father, who is hanidcapped also due to a stroke in 1986.  He is able to help he some but can't pick her up if she falls.  I have four siblings who live in the Columbus area.  They help Mom a lot but the all work full time and that is when out patient therapy takes places.  My folks have some friends who can provide transportation.  They also signed up for a bus service that caters to seniors and handicapped persons.  The biggest hurdle will be getting my folks to allow someone to come into the home once or twice a week to help with cleaning and other chores. To Everyone: Happy Wednesday!",
      "MessageIndex": 5325,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 14, 2009 11:14AM robink wrote: Last year, BC, while our kids were both out of the house for a number of months DH and I rehabed (sp) the kitchen, powder room, mudroom and DD bathroom.  Now it's March 2009, AC, and we are planning the same fate for three rooms in the finished basement.  Today we go to Home Depot to check out paint colors.  All my life I have been so safe, so colorless, Origami White on all the walls. BC with the 1st rehab effort we cautiously added color one room at a time. The further we got, the bolder the color!  Yay ME! Now AC, caution out the window - it's my (our) house, I'll paint the colors I want.  So the downstairs bath gets it first and the decor is scarlet and gray for the OSU Buckeyes!  GO BUCKS! ",
      "MessageIndex": 5376,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 17, 2009 10:10AM robink wrote: WooHoo - ordered my Deva products from Amazon, cheaper than I could get them here in town.  They have been shipped.  I'm looking forward to playing with my hair later this week when the package arrives. Gotta get to Noelle's Mona Vie site for the next purchase of goodies. Today I see my onco.  Nothing wrong, it's a 3 month follow up visit.  He'll ask how I'm doing on the Femara and I will give my list of complaints. Then I'll stay on it until I can't stand it anymore. Meet a lovely lady at the clinic where I am a nurse, she was so sick with the nasty respiratory virus that is making its way around here.  She is a breast cancer sister and we had a lovely conversation.  It makes me feel good to be able to offer support and encouragement to others along the way. Turns out we have the same onco and both have appts. today - maybe I'll run into her there. Blessings to each of you for a Terrific Tuesday and if it's not a good day the Grace to get through it. RK",
      "MessageIndex": 5421,
      "PostDate": "17/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 23, 2009 10:31PM robink wrote: Hello to all... Dana - this wonderful group of  18 women welcomed me back after an 8 month absence.  July 4, 2008 was the day after my final chemo.  I didn't post after that date until May 4 2009.  During July I read the postings occasionally, stopped in August when I went back to work. The reflection of my multiple anniversaries brought me back here and we became 19 strong. Now you've brought us to 20. Just for kicks check out this link with trivia about the number twenty!  http://en.wikipedia.org/wiki/Twenty Julie - DD attends Colorado Mountain College and is studying professional photography. No big plans for her break.  Kristy's day with her DD sounds much like something we would enjoy.  Food, movie, massage. The talk about planting and landscaping leaves me thinking of what needs to be done outside.  Around here the rule of thumb in to wait until after Mother's Day to plant. After living in our home 15 years and getting most of the patchy areas reseeded with natural grasses last fall we had to have significant excavation which ruined years of work. This all calls for another landscaping plan and you would think I could have accomplished that over the winter. DH and I purchased an 18 pack of solar garden lights from Sams Club.  He put 6 in the ground over the weekend and they look like stars in my yard at night. I suppose that is a start. The delivery of my Deva products came today and I am looking forward to playing with my hair in the morning. Would have done that after work today but I felt crappy, think I'm coming down with a cold. Here's a question for anyone...how often do you follow up with your breast surgeon? Last I saw mine was early August for my port removal. Was supposed to have gone a week later for her to cut the knot on the suture, instead one of my co-workers clipped it for me.  My mother and sis go twice a year.  They are 3 and 2 years post mastectomy respectively.  Some on bc.org have mentioned seeing their surgeon annually. My Jan. mammo was clear, my onco gave me a thorough exam last week.  The reasonable thing to do would be to call her office and ask her preference.  Jen- that pendant is very nice and the words of encouragement very appropriate. Rock - your words were well spoken.  Thank you from all of us.",
      "MessageIndex": 5513,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 25, 2009 02:01PM robink wrote: Adrienne - I hate that you had to endure that lack of responsivness today. Anxiety hit me also prior to my first mammo after diagnosis. Any chance of calling your ordering doc and asking them for a quicker read? Mini was ordered diagnostic like Otter's.",
      "MessageIndex": 5538,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 30, 2009 03:39PM robink wrote: Greetings to all but especially to Jackie. Wishing you well and praying you an uneventful recovery. It's been wonderful to DH and I having DD home for here spring break.  She brings joy to us when she is around. I've enjoyed reading the comments about the shovel brigade and had some hearty laughs while learning new terminology. Need to prep fpr an early morning so I bid you all good night.",
      "MessageIndex": 5612,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 5, 2009 08:35PM robink wrote: http://en.wikipedia.org/wiki/Burma-Shave",
      "MessageIndex": 5711,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 8, 2009 08:06PM robink wrote: Another anniversary day for me - 1 year from my first posting! The weather has been sunny, warm, slightly breezy.  I sunbathed - in my tank top and undies (we have a 5 acre lot in a heavily treed area so no worries about exciting my neighbors.  I felt so FREE! and got some color on my skin, pretended I was in Mexico on vacation. An important phone call was made by me - to schedule an appt. with my plastic surgeon to discuss reconstruction. Gracie - wonderful pathology news! Randie - how are you breathing today? TTFN",
      "MessageIndex": 5743,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 15, 2009 06:11PM - edited Apr 15, 2009 06:13PM by robink MY NEW FAVORITE CD...\"MAY 08\" Jeano, the CD arrived today. When I realized what was in the envelope there were a mixture of emotions - goose bumps, speechless, teary, loved.  I love the selection of song, am listening to it now afterwhich I'm going to load it onto my ipod.  Thank you for putting it together.  Randie will breath better listening to it (and getting that fluid off her lungs), Sue will be more relaxed in her post op recovery hearing the music and knowing what it represents. WE ARE BLESSED TO HAVE ONE ANOTHER! Arnie - thank you for the kind thoughts. I'm glad you found this site and hope you'll find the same support we have. Randie and Sue - let us know how you are doing when you are able. Jackie - how are you doing today? To Everyone - love ya!",
      "MessageIndex": 5829,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 22, 2009 07:04PM robink wrote: Tex - good to hear from you.  I sent you a PM re:facebook and addresses",
      "MessageIndex": 5950,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 24, 2009 08:35AM robink wrote: How about we all write a poem to help \"celebrate\" our chemo May 08 anniversary. I'll start... HAPPY ANNIVERSARY TO US CHEMO MAKE US CUSS THERE WERE DAYS WE DIDN'T THINK WE COULD DO IT BUT WE HELPED EACH OTHER GET THROUGH IT (think I'll keep my day job in nursing)",
      "MessageIndex": 5966,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 29, 2009 04:23AM robink wrote: pssssssssssst....anyone else awake?  Sorry but I need to use the powder room. Oh - I have my camera for a group bedhead picture in the morning. ",
      "MessageIndex": 6060,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 1, 2009 01:29PM robink wrote: Jen and I are meeting next week!",
      "MessageIndex": 6087,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 6, 2009 11:21AM robink wrote: It's wonderful crazy - I feel as if I am preparing for a first date. Will my hair look ok (or will it frizz in the Ohio humidity), stand in front of the closet with minimal options (only brought one suitcase) and worried about which outfit to wear, making sure the camera is ready, checked the proper exit from the interstate 3 times, calculated driving times over and over, what if we don't know what to talk about ( this person understands more about what I've been through this last year that most of the people in my inner circle) Oh Robin - you silly girl - it will be fine! Headed to meet up with Jen this afternoon and wishing we 20 could be together! We will post pictures, after we take them!",
      "MessageIndex": 6132,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 14, 2009 09:55PM robink wrote:  Dearest Sisters - It has been wonderful keeping up with your comments.  During my visit to Ohio and since returning home (Mother's Day) I've been reading daily.  Please forgive my silence and thank you for understanding. There were many precious moments during the Ohio trip.  The two I will mention that were especially dear to my heart was getting to meet Sable and sitting in church with my mother Mother's Day morning prior to returning to Colorado. I encourage each of you to act on any opportunity to meet one another! Today I had a consultation with my plastic surgeon to discuss reconstruction. My hope was for a free TRAM flap.  No one does that procedure or the DIEP here in Colorado Springs. There is a pair of surgeons ~ 1 hour from here that does the DIEP however my PS reommended going to the Mayo clinic. Long story short, he recommeded a subcutaneous expander (my breast surgeon has left some extra skin) in preperation for which ever procedure I choose. The pedicle TRAM is the procedure he would perform for me here or gladly make the necessary phone calls to Mayo. Noelle, I appreciate you sharing your recent blog posting with us. Your love, your pain, your hope radiated from your words.  ...Just prayed for all of you... Love, Robin",
      "MessageIndex": 6204,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 4, 2009 11:16AM - edited Jun 4, 2009 12:54PM by robink Hello again! Gracie- How many days a week are you pulling those 12 hour shifts? What type of unit do you work on? I work at an Urgent Care that is usually very busy, the 12's kicked my butt.  I'm part time, do a combo of 8, 9, 10 hour shifts.  Management has been very flexible. All those strawberries - 24 quarts, did you get them all, freeze some, make jam? That reminds me, I am almost out of strawberry jam so that needs to get on my grocery list. How many weeks post op are you?  And how's it working out having the oldest DD/Granddaughter there?  Is this the DD that gets on DH's computer all the time? Sable - You could slowly get back into biking by getting a \"comfort bike\".  That's more my speed.  Is the Effexor the thing that's doing the job in contolling the HF? I think I mentioned to you before accupuncture, how it helped so dramatically. If you can get past the needles in your skin (it does not hurt) the time on the table is relaxing and the outcome far exceeded my expectations. How's summer break starting out for your little guy?  Enjoy the extra time with him! My trip back to Columbus is June 23-July 1. DH has only been there with me once in our 20+ years together and has agreed to join me.  DD will come also but for a shorter period of time as she she commitments here at home. The main event is my niece's wedding however the days are rapidly filling up with things to do and family to visit.  That being said, I am not going to be able to get together with you this time. I'm sorry :( Adrienne- Hurray for your wonderful husband, and for your garden!  What did you eat?  Around here the liliacs just bloomed last week.  It's been rainy and cold.  The tomato seeds have sprouted (inside).  If we are lucky we'll have tomatoes in 60-90 days. How close to Eddie do you live that you were able to see her on the news?  That blog article was wonderful re:Eddie and Adam. I saw you \"just for fun\" photos on FB.  The rock with with smile - Did you keep it?  Immediately I thought of our CD, especially \"Don't worry, be happy\" and Kermit singing about Rainbows.",
      "MessageIndex": 6350,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 6, 2009 01:23AM robink wrote: Eddie - Every time I read able what Adam and you team is accomplishing I feel very proud!  Amber's \"The Journey\" was very touching.  Thank her for all of us.  And the global bra - love it!  I am glad my ta'ta's ...correct that to say ta-ta is not that big.  About your new AI, what symptoms were too much for you on Femera and which one are you now on.  After 6 weeks off, and not regretting the decision, I tried the Femara again.  6 days later I had the same symptoms and relalized I am not will to put up with feeling that way for anothe 4 1/2 years. Will you run/walk in the Komen event in your area this weekend?  Sept. 13 is the race in Colorado Springs.  I definately don't run but have walked several other 5 k's.  I need to sign up for this! Karin - Happy Belated Birthday!!!!!! Hope all is well for you.  How have things gone with Jeckel/Hyde?  And what have you learned about getting that full time para-pro postion in the Autism program?  Your last post was May 18th, my 20th wedding anniversay. Are you and DD riding a lot?  Bet she is enjoying her Honda rebel and you enjoying her company.  Does DH ride?",
      "MessageIndex": 6363,
      "PostDate": "06/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 4, 2009 09:58AM - edited Jul 4, 2009 03:13PM by robink http://www.teleflora.com/flowercolors.asp http://www.proflowers.com/flowerguide/rosemeanings/default.aspx?linklocation=NavBar I like the idea of 19 yellow/1white roses.  We don't know for sure Randie disliked flowers.  The idea is to bring comfort to her family - the knowledge that Randie touched the lives of people they don't know would help them. ...just spoke with teleflora...take a look at this basket http://www.teleflora.com/funeral-flowers/sympathy-flower-arrangement/basket-of-light-34905p.asp they can make it so the spray of roses has 19 yellow, 1 white.  the larkspur and the carnations add simple beauty.  The rep said the premium price would cover this request. We can send it to Randie's home or the funeral home.  I am happy to place this order but would like directions on what is to be place on the card. Love - Robin K",
      "MessageIndex": 6553,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 9, 2009 01:27PM robink wrote: Julie- how ya hanging in there with the girls gone? Noelle - I am so sorry about your kitty.  I am sad for you. Jeano- certification in what? Linda - make the check out to Eddie. Kerry - do you winter months occuer during our summer (July - August - September)?  For us here in Colorado it was the hottest day of the year so far and no rain today. Kristy - Not being familiar with MUGA scans I looked it up on the internet to see what it is that you and some of the others have gone through.  Glad the results were good.  How often will you need to have that testing? Gracie - YAY for no bone mets!  How is work going for you? Rock = thanks for letting us know what Shari had told you.  How was your day today Today DD, my nephew who is visiting from Ohio and I had a wonderful day being Colorado tourists!  We went to the Garden of the Gods and then to Royal Gorge.  We've been to the Air Force Academy, spent hours at a mining museum.  Tomorrow DH and I will take Michael to Pikes Peak on the cog railway. It is so good having him visit.  Michael has Ausberger's Syndrome and doesn't get many opportunities like this.  My heart smiles to be able to help him do things most of us take for granted. Good night...",
      "MessageIndex": 6616,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 10, 2009 09:36PM robink wrote: Eddie - I purchased the flowers and do not want to be reimbursed.  It is my preference that the money be used to bring some joy to Randie's family. Reservations?  Just tell me when.  The Broadmoor is beautiful, can get quite costly.  In our travels with my nephew we passed a set of cottages on the west side of town that seemed so relaxing and inviting.  I thought it would be fun to stay there. Swine flu - 15 cadets at the Air Force Academy have been diagnosed recently, 80+ cadets are sick with flu like symptoms. Kerry - I loved the penpal story. ",
      "MessageIndex": 6635,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 11, 2009 11:06AM - edited Jul 11, 2009 11:30AM by robink Rock - Let the words flow.  Be childish, 7 years old, rant, be silly, be angry, be what ever. Let the thoughts rush forth.  I wish I could give her back to her family, to you, to our group but I can't.  All the things we say when a person dies \"She is in a better place\" She is at peace\"  \"She can breath now\"  \"She is no longer in pain\"  \"She is with Jesus now\"  I believe all those words but also know that many thimes those words don't help those left behind.  Only time will heal the emptiness you feel - and God's grace.  Rock - I don't think Randie would want her physical absence to stifle you.  So let it rip - gush - let those words fly through your fingers on the keyboard.  We can't be Randie for you but we can be here for you. Special love to you today Rock. RK ",
      "MessageIndex": 6641,
      "PostDate": "11/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 1, 2009 04:14AM robink wrote: Dana - summer of 06, 08 an 09 with chemo?  Yea - I think I'd be thinking WTF also.  But ya know what - I am glad you are here and fighting!  As the others have mentioned, come and go as you need to but check your apologies at the door as they are not needed. Noelle - I need to tell you that I understand what you are going through 1st hand.  My DH is a pediatrician, has had a busy productive practice since 1973, about 6 years ago he and his partners stopped leasing office space and built a private office building.  The wives of the 3 partners signed on the loan for the building.  This economic down turn has effected the practice negatively, like many other businesses.  Parents are more inclined to ride out illnesses of their children at home instead of coming to the doctor, many who come say they don't have the money for copays, the families don't have the spare cash to send the kids to summer camps or get them involved in summer sports so they don't need physicals from their doctor...and the reasons continue.  The two part time nurse practitioners are not needed currently.  All of this results in reduction of income, medicaid does pay what it costs to break even and insurances come up with more and more ways to delay payments.  DH and partners barely have the funds to pay the mortgage loan and all the other expenses so they have taken pay cuts.  For him it's like watching a child die - this has been his work/life for 36 years.  It is so deeply discouraging.  I understand your delimna.  No way around it - it sucks.  But we wake up every morning, glad to be alive and looking for opportunities to make a difference ...just like you.  Noelle, you are a fighter - just like Dana, just like Randie was, just like the rest of us.  The end result may not be how you envisoned it but you will survive this. Ladies - I have enjoyed so reading of your summer adventures. Keep sharing! Eddie - I've pm'd you As for me, I have had an enjoyable summer (although some days it has felt like winter - wet and cold).  There have been 2 trips to Ohio and both times no one was injured or in the hospital.  DH, DD and I attended my nieces wedding late June - what a wonderful event!  I've been working 3 days a week at an Urgent Care clinic.  We are always busy as we draw a large indigent clientle (sp?) the ranks of whom grow daily.  After the 2nd trip \"home\" my 22 year old nephew came back with us for 2 weeks.  Michael has Ausberger's syndrome, a form of Autism.  He enjoyed himself and I was so pleased to have a part in broadening his world.  We are in the process of refinancing our home so we can proceed with some home improvement projects.  I will have part one of my reconstructive surgery August 27 - it will be the placement of a skin expander.  This will pave the way for a tram or diep.  For the diep I'd have to travel to MAYO and the thought of recovering somewhere other than my home is not thrilling to me in the least.My chemo curls are finally gone.  Over the past 2 months I have had three unsatisfactory haircuts. I couldn't figure out what the problem was and this week I tackled my hair and got it back to a style I am satisfied with.  It is so odd, prior to chemo my hair was curly but soft and manegable.  The hair that grew in was coarse, very grey, with cork screw curls.  It took me a while but I learned how to work with and style the \"new hair\".  Now that my \"old hair\" is back I realize that I've forgotten how to work with it and spend much more time in front of the mirror than I care to admit.  What I have realized is that I very much liked the shorter hair, and how freeing it was to put some gel in my hair, brush it and let it dry any way it wanted to.  So I think I'll keep it short and try to come up with some way to become untethered to my hair dryer and styling brush.  (Rock - I've seen what I think are a few new pics of you on FB and LOVE your hair!). OK...I think I'm done. Love to all - Robin K",
      "MessageIndex": 6731,
      "PostDate": "01/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Sep 4, 2009 10:59AM robink wrote: Cresent rolls...  Today I had my 1 week post op appt. with my plastic surgeon.  Everything is healing well, drain got pulled, he thinks it won't take too long to fill the expander to the desired volume.  I just didn't understand how the thing was actually postioned in my chest so I asked him to explain it to me.  Then he liked it to a cresent roll...It was a good analogy, he got the point across but now when I see those cans of Pilsbury Cresent Rolls in the refrigerated section of the grocery ...hahahahahahahahaha.....it just won't be the same. Happy 25th Angels! Happy Period Rock! Happy no cancer Dottie! Happy De-port-ta-tion Jen! And Happy NO MORE HERCEPTIN!!!! Eddie - is your deported site feeling better?  Darn scar tissue. Geez, I forgot this is a holiday weekend.  Guess I'd better figure out something to put of the BBQ. Love to all.............................",
      "MessageIndex": 6846,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Dec 11, 2009 12:42PM robink wrote: Julie - prayers just went up for you! patience, wisdom, strength, knowing when to speak and when to keep slilent.  Hope the Christmas concert was enjoyable and took your mind of \"things\" for a while. Otter - www.zappos.com  Beautiful card!  Many thanks! Happy Joyful Blessed Hannaka  to Eddie and anyone else who celebrates this Featival of Lights. Jen - try to keep Christmas preps to a minimum.  Focus on your little guy only.  What a blessing you have family and friends to help you out.  Have sent prayers on your behalf. Paige is home! Have her here for 3-4 weeks.  Yay! Going shopping - TTFN",
      "MessageIndex": 7168,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Dec 27, 2009 01:49PM robink wrote: Merry Christmas to all, and Happy Bar Mitzvahs to the 30 (or 300)young persons Eddie. Jen - so good that you are feeling up to posting, better for the drains to be filling up then inside you.  How many did you end up with? And are you about to stand any straighter today? Had to laugh when I read about the specially picked cards that remain in the box, I did get 2/3 of my cards sent, even picked up oanother box or two to send to the remaining 1/3 BUT those cards never got sent.  SO - do I send those people 2 cards next year?  Send them a News Years card instead, wait till Easter? So many decisions. Christmas was quiet with DD, DH and myself.  Went to a friend's for dinner. Great conversation, food, played some games then went home to watch Peter Sellers Pink Panther. I am working today, phones aren't too busy - which can make the day go by slower ( and give me a chance to post here). There are times when I wonder how long I'll be able to be happy at a desk job, as I am used to being on the go constantly BUT this is a perfect place to return to after my TRAM. Rock - how's the packing going?  Are you going to have to ship things you've acquired over the past year?  What do you think you will miss the most when you leave SA? Guess I'd better sign off. Love to you all.",
      "MessageIndex": 7217,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 6, 2010 06:39PM robink wrote: Tomorrow I have my annual mammogram, have come to realize they will all be of the diagnostic variety due to my \"history\". Just want to make sure it is clear before venturing into the body resculpting theater Monday. Saw a podiatrist today for plantar fasciitis, a funky toenail and a possible hammertoe. Came homw with a night splint for my feet, alternate shoe suggestions, 1/2 big toenail removed for a fungal culture and an appt for followup in 3 weeks (if I can drive by then) Had a physical yesterday, fasting labs tomorrow. Not expecting any problems, just wanting to be sure. A good friend is having a lumpectomy and bilat breast redcuctions tomorrow, going to hang out with he hubby and son while they wait. She is very against rads or chemo, won't do either without evidence there is no other way. Her DH in the oxygen business, acquired a home hyperbaric chamber, she has done 21 treatments in prep for tomorrow, plans to hop in as soon as they return home. They are encouraging me to take advantage of the hyperbaric therapy for increased wound healing and minimizing infection risk and I am considering it. (Come over Jen - we'll have an oxygen party).  DD in her 4th post op day, appendectomy Jan.2. Improving daily but really wiped out today. See her surgeon Friday, DH and I will need to take her back to college Sunday, don't see her being ready for a 4 hour drive across Colorado.",
      "MessageIndex": 7274,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 16, 2010 04:38PM robink wrote: Jen - ya know what pisses me off? That you've had problems with the new girl for at least 2 weeks (excessive swelling, unexplained skin blisters, persistant fever) What caused your PS to finally culture that new breast? Hurray for your body spewing out that nasty stuff that has no business taking up residence inside you. Never - I have never likes rollycoasters! Don't like much waves of emotion either. Funny story - I over heard two of the surgery center nurses talking about the breast reconstruction case done 1/11. How they kept hearing giggles, whispers, and a fart or two but there is no way that could have happened because it was just the two of them setting up the room for my case.  I kept you secret girls! So glad you made it! Today is my 5th post op day and I'm not feeling so great. Did sleep well during the night, was trying to keep my feet elevated on a pillow which required sleeping on the bed. Well, sleeping on the bed requires a lot of mucsle strain from muscles already insulted by the TRAM. After the 3rd failed attempt to get comfortable I went back to the recliner.  Have been nausous all day, think I still have a fever (DH out right now picking up a thermometer). My belly hurts much more today but I'm blaming that on insisting on trying to sleep in a bed last night. My dear friend, Debi, had her lumpectomy/bilat reduction 1/7 has learned the margins were not \"all clear\". Think she is opting for a mastectomy with immediate recon.  After seeing what I am going through (didn't tell her about your saga Jen) she wants nothing to do with the TRAM, is leaning toward a micro surgery. Problem we gals here in Colorado Springs face is there are only 2 in the state that perform these delicate procedures. She is willing to go to Denver, to NOLA for the top dogs to operate on her. Back in '08 when I had the same decision to make my PS said that he couldn't recommended the 2 in the Denver area, he would be willing to send me to Mayo.  I just did not want to recover away from home so the topic was not discussed again. Tummy upset - gotta go. Love to all",
      "MessageIndex": 7317,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Feb 28, 2010 09:36PM robink wrote: Cris - I want to say something that may help, something eloquent and deep but I can't see to find the words. So instead I'll simply offer support and encouragement from afar.  Love to you, Kelly and Katie.  And to Cris's Mom and Sis, and local friends...thanks for being there for her and the girls.",
      "MessageIndex": 7445,
      "PostDate": "28/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 11, 2010 10:05PM robink wrote: Otter: Virtual Valium on its way. Check the transporter room.  Only take one as I replicated the super charged variety. Hope it helps. ",
      "MessageIndex": 7468,
      "PostDate": "11/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 8, 2010 10:14PM robink wrote: Oh Rock! I am sad you are going through this rocky road currently. I wish something as simple as the beauty, the wonder, and the inspiration of your photos that your share with us on FB will somehow boost your spirits. Cris - don't really know what to say except you inspire me by your strength and your refusal to let this situation drag you down.  Thanks for showing us how to move through a shitty circumstance with dignity and hope. I have decided to have my surgery done at the University of Colorado in Denver. There is no indication that my local PS did anything wrong. I guess I just can't get over him not seeming to take this as seriously as I am, telling me he would prefer to get me through this with some \"hand holding\" - to try to wait another 3 months and see what happens - hoping for the best. That probably isn't a bad thing - just not a good enough thing. The game plan is to remove the hard, necrotic tissue and to remove the abdominal muscle. Into the pocket a silicone implant will be placed. She will place some internal sutures to form a breast fold.  This isn't an emergency but I want it done as soon as they can get me on the schedule.",
      "MessageIndex": 7510,
      "PostDate": "08/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 30, 2008 02:52AM - edited May 2, 2008 06:02AM by robink welcome eak, I look forward to getting to know you.  Please come over the a duplicate thread where there are more May starters.  It was started by KristyAnn, same name, same date.  I've alerted the moderators and hope the threads can be merged so we are all working off the same one. Blessings",
      "MessageIndex": 51,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 1, 2008 09:14AM robink wrote: clg: Welcome to our May group.  Tomorrow is my 1st treatment, I'm getting 4 cycles Taxotere/Cytoxin every 3 weeks.  I wish you well during your treatments.  It was good to read that you are doing well thus far, now that the headaches have subsided.  I have one wig, am going to the local American Cancer Society to check out their options, and may try the Paula Young wigs mentioned by beachmom.  I had a melt down several time, most recently about my hair and now I feel better.  I can't change what is going to happen and while I do not want chemo, I look at it as giving myself the best chance and I won't wonder if I should have done more cause there will be no more to do. Look forward to getting to know you.",
      "MessageIndex": 76,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 8, 2008 09:07AM robink wrote: Oh My Kristy, Sounds like and unpleasant experience with the low counts and hospitalization.  So sorry it happened that way for you.  Did you know your counts were low from follow up labs and they had you go to the ER, or did you become symptomatic and you sought treatment?  Guess it doesn't matter.  You are home now. **DING DING**  there's your round one bell",
      "MessageIndex": 169,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 12, 2008 11:49AM robink wrote: Hi Karen, Welcome to the group.  I had my 1st treatment May 1 (TC x 4). You will be taught about the SE particular to the chemo you will be getting.  From what I've read on this site, and on a site specific to Taxotere/Cytoxan each person responds individually.  What bother one person may not be a problem for you.  In other words, your experience will be your own.  You will however gain much insight and advice from both threads.  Take your time reading the T/C thread, it's lenghty but helpful. My onc gave a very adequate amount of Ativan, with refills.  Depression was discussed and I was encouraged to speak up if I felt it was a problem.  They do not want this getting the better of any of their patients and I am sure your onc feels the same.  Be bold and talk to them. The actual first time \"in the chair\" was no big deal for me, and for most of the group.  The infusions are smooth, usually uneventful.  I was so anxious it was almost anti-climatic. OK...I've babbled enough. Come back as often as you need and be sure to join the T/C thread. Robin",
      "MessageIndex": 221,
      "PostDate": "12/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 13, 2008 08:44PM robink wrote: tomatojuice, susanblues and danismom:  I added you to \"the list\".  Anyone needing to check it out can refer back to page 8 on this thread. ````````````````````````````````````````````````````` Reading the comments about moms I wanted to tell my Mom's story.  She is 80 years old, birthed 5 children, lost my dad to cancer when I was 12 years old, worked full time to keep a roof over our head, remarried 3 years later to a bachelor willing to take on a fiesty woman and 3 teen girls still at home.  The older she got the more active she became...until...2 years ago when she was diagnosed with breast cancer.  She figured a mastecomy would take care of the problem, didn't need chemo but didn't have time to be bothered with radiation therapy.  The day she came home from the hospital she suffered a stroke and on the day she was moved to the rehab unit she had a 2nd stroke on the other side of her brain.  By the time it was over she was severly impaired on her right side and half blind in her left eye. Two years later she attempts to stay as active as possible.  Works in her garden, loves to cook, takes walks daily unless the weather is bad, travels regularly with a senior citizen group.  It broke her heart to be unable to come be with me when I had my surgeries (she lives in Ohio and I'm in Colorado) but she prays for me everyday and loves me deeply.  I miss her terribly and sometimes wish I could have run home to Mama but God keeps us connected across the miles.  Her name is Rosemary.",
      "MessageIndex": 252,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 17, 2008 12:55AM - edited May 17, 2008 06:21AM by robink Family:  Glad you are feeling good.  Here's to a great weekend! Rock:  Those links are great!  I think I'll ordered from that 1st site, even the Crazy B skullcap for days I actually feel that way.  Hat, ball caps, turbans and scarves have not thrilled me too much but I think I'd actually wear the skullcaps. Danismom:  Hope your shingles are healing and your pain at least controllable.  I have one wig and have ordered two less costly wigs from the paula young web site, just for fun.  Taking them to a hairdresser is an excellent idea. Wondering:  Welcome and good luck with you 1st swim in the chemo pool.  I was very nervous 1st time and found it to be no big deal.  #2 is the 22nd.  DH and I hope to see a movie after I'm done. Haykat:  I don't get those shots so I'm no help to you.  I read that you are better this morning and am glad for that.  Do you have any extra Vicodin or some narcotic left over from surgery if the pain gets bad again?  Re: flareup you should call your doc for some Valtrex and or the antiviral cream to put on the area.  And wash your hand very well after tending to yourself. Advil is an NSAID. Otter:  You are so incredible!  Friend, Room mother, Professor and comic.  Thanks for you! Cristine:  are you handing in there OK while playing the waiting game? cbme123:  Will you be able to rest over the weekend?  And can you delegate responsibilities at work if necessary?  I'm sad for you and you Dad for the loss of your mother.  Take comfort and find joy in your memories. nmjohn:  welcome to the club and I wish you a smooth dive into the chemo pool. To everyone:  here's wishing you a trouble free weekend! Robin K",
      "MessageIndex": 297,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 21, 2012 09:17AM robink wrote: Bump**************************** On behalf of all 20 of my May 08 sisters I greet you and wish you a Tremendous Tuesday. 2 of our ladies are completely through with their cancer battle and now walk with Jesus in heaven. Two of our ladies have suffered a single metastasis and are undergoing treatment. It has been 4 years and 3 months since we met in this forum and will be friends for life.  I write this to encourage any who may stumble upon it to persevere. Many times on this forum and now on facebook we have been a life line for one another. Find and establish that support system. We love each other and we love you.",
      "MessageIndex": 7607,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 4, 2009 11:56PM robink wrote: A song I find appropriate today to honor Randie... http://www.youtube.com/watch?v=CEk4e75l26I Praise the God she loved and worshipped that she is truly free! Happy Independence Day dear friends.  Be happy and find something to laugh about today.",
      "MessageIndex": 6559,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 5, 2009 02:24AM robink wrote: OK Ladies - I am going to take the liberty to order the arrangement I gave you the link for, with specifications of 19 yellow and one white rose. The card will read \"Randie - we are honored to have been blessed with your friendship.  With love from your bco.org friends...(I will list all of our first names) Unless I get corrections/objections/additions to the note for the card I will call teleflora this afternoon.  The flowers will be delivered to Randies home. Love to you all",
      "MessageIndex": 6567,
      "PostDate": "05/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 8, 2009 12:52AM robink wrote: Two years ago I sowed some wild flowers seeds in an open area behind our house.  For two years I waited and waited to see if they had germinated, and if I would ever get the flowers I was hoping for.  What a surprise to see upon from return from Ohio - I have wildflowers!  Tall, beautiful wildflowers!  Gracie - I think these flowers were at the edge of the woods in which you and Kerry were walking.  When I look at them I feel joy and contentment.  It is good to know your felt peace when you woke. Love to all...RK",
      "MessageIndex": 6609,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 1, 2009 07:09AM robink wrote: Eddie - I did reply via PM but will just post the answer here so all of you know.  I have $100 to donate to BCO and will do it on behalf of our group.  Please tell me Randie's husband's first name as I want him to recieve a notification of the donation in honor/memory of his wife.",
      "MessageIndex": 6733,
      "PostDate": "01/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 2, 2009 12:00AM robink wrote: Does anyone know Mr. Cipperly's 1st name?  Jen - you've spoken with him, haven't you?  As soon as I know that missing piece of info I will make the donation to BCO. Thanks Robin",
      "MessageIndex": 6736,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 12, 2009 10:51PM robink wrote: Jean-thanks for the expander info. I feel better knowing these changes were experienced by someone else, and are temporary.  Can't imagine keeping this time in for a year - at times it feels like a foob that's out of place, I get the urge to pull it down into place an remember it's in internal foob and it's stuck it place. 3 inches of snow, huh?  The ice that covered C. Springs over the weekend melted off today, our week is supposed to be warmer also. Cristine - we make a copy (legal copy) of office 2007. I'm using 2003 on my PC.  We bought 07 for our college student daughter.  No one thought Mom would be needing one of licensed copies. The new bimester starts next week so I'll get it installed over the weekend.  Thanks for jogging my memory about something I already own.",
      "MessageIndex": 6986,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 17, 2009 05:21PM - edited Oct 17, 2009 05:22PM by robink",
      "MessageIndex": 7002,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 27, 2009 06:48AM robink wrote: Angels- glad you made it home safely.  I understand the treaterous nature of mountain passes in the winter (and it's only fall).  Pink is not for Pepto Bismol (or something like that).  A thread in the recovery forum created by Rock.",
      "MessageIndex": 7024,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Dec 11, 2009 08:36PM robink wrote: Angels - or any one celebrating Boxing Day. Please explain the significance.  This is in addition to Christmas, right? Thanks!",
      "MessageIndex": 7170,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 4, 2010 10:59PM robink wrote: Jen - what's going on today? We're concerned about you!",
      "MessageIndex": 7264,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 15, 2010 05:52PM robink wrote: Home from the surgical center Thursday afternoon. 3 drains in - 2 belly, 1 breast, The heavy dark blood has ceased, replaced with blood tinged yellow fluid. The breast drain doesn't fill up so according to Dr. Robin, that drain should be pulled next Tuesday at my first post op appt. So, when I need a thermometer at my home, there is not one to be found. Today I've been using tried and true techniques to determine if I have a fever today, flushed cheeks, headace, chills, low back ache. Yes, Yes, yes, yes and yes for all 4. The incisions look fine (don't pay attention to the swelling and bruising). Jen my doctor used suture, no staples.  I am curious about the \"new\" (old) belly button, lotsof dried blood on it, cleansing the area twice daily with 1/2 strength peroxide solution. Both legs are swollen from toes up to my thighs. Looks like the remaining hours of this day will be spent elavating my legs above the level of my heart. Slept in a recliner last night, reducing the belly pain. Pain is well contolled with Oxycontin and Percocet.   Jackie - remind me why your DS is in China? Your nursing advice is sound - I heard that regularly while still in the surgery center. The doc(worried about the fever and low blood pressure) insisted on increasing the IV fluid rate until my time of DC. I need to take an afternoon nap, before I give myself whiplash from nodding off. TTFN",
      "MessageIndex": 7314,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 17, 2010 09:43AM robink wrote: Sue's Porch - check Kerry's summer weather - check an end to suckiness for all - check gentle hugs - check our awesome children doing awesome things - check being alive and feeling the recovery burn from restoration surgery - check Much love to each of you............",
      "MessageIndex": 7322,
      "PostDate": "17/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 18, 2010 05:27AM - edited Jan 18, 2010 12:01PM by robink Jen - no OMG, WTF did I do this for, yet.  Although it did cross my mind wether or not I should be so concerned with my body image as to subject myself to something like this. YES was my answer so I dropped it. Due to your exteneded recovery, infections and delayed healing I certainly understand why that topic enters you mind. I'll try to call you tomorrow. Julie, from what I read on here and FB, all of us have remarkable children!. Have fun with the4 H venture! Congrats to your BIL! Cris - not sure what emotion the wii mii experience would have provoked in me. \"Santa\" brought our family a Wii for Christmas. 20 yr old DD made my Mii, keeping the glasses I acquired after turning 50 but ditching the chemo induced grey hair. No complaints from me. DD was a little mother while I was undergoing toxic hell, always an encourager whether I be bald, wigged or curly gray 1/4\" long. Jen - thanks for the many post op suggestions to make recovery easier. The multiple pillows on the bed have made sleeping much more comfortable.  It's 3:35 am, needed to use the girls room and to empty my drains. Figured there is no time like the present to post but can't make this any longer cause the eyes are nodding off. TO ALL - have a Marvelous Monday!",
      "MessageIndex": 7326,
      "PostDate": "18/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 25, 2010 06:54PM robink wrote: Today I recieved a beautiful, fragrant flower arrangement - roses, lilies, carnations. What a great way to celebrate 2 weeks post op. Thank you Julie. My pattern seems to be one iffy day followed by a good day, and each good day is better than the one preceding it. The landscape of my restored body seems to be a little different daily, as well. The new breast is an interesting shade of green, drain site just stopped oozing, incision healing well. The transplanted tissue is firm and feels a little heavy. That worries me but I have to remind myself of the progression I was to expect told to us by my PS last week. My is getting softer each day, and the tenderness more tolerable, the swelling there is gradually receding showing love handles on the sides that will need lipo eventually (I have lost 5 lbs from my presurgical weight, and if I lose another 5 the handles will be smaller yet). The two belly drains will be removed tomorrow - not a moment too soon, either. yesterday one of them was causing such discomfort I was ready for DH to snip the suture causing be pain, instead he propped up the offending drain and defused the situation. The above mentioned flowers were delivered just after I had stepped into the shower. My barking doorbells alerted me to a presence at the door. well, on the best of days I don't get out of the shower for anyone, and I certainly didn't today (besides, if I'd have rushed I would have frightened the poor deliver person, looking like a borg (from star trek) with the incisions, bruises and drains. So, 1/2 hour later after getting dried and dressed I was thrilled to find the arrangement nestled safely on the back stoop! Blessings and love to each of you!",
      "MessageIndex": 7348,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 4, 2010 08:08PM robink wrote: Hello Dear Friends! Cruise? Divine, Relaxing. Gourmet food. Pampered. Reconnected with favorite Sis. Reconnected with hubby. Basked in the Caribbean sun. Toured Belize City Mayan ruins (Altun Ha). Spontaneous call from DS night before embarking on our journey. Spontaneous laughter. Mask off - real Robin emerged. We flew to Miami, meeting up with Sis and BIL, stayed at a lovely hotel. It was raining that night and into the following morning. Mid day the clouds began to part, hints of sun emerged and my the time we set sail the sun was shining. We had a stateroom with a balcony. It was like a studio apt. minus cooking area. Unfortunately, two cold fronts moved through the Caribbean during our cruise leaving it windy and too cool to spent much time on the balcony. It was a lovely view.  The water is a deep, comforting, indescribable shade of aqua blue. When the water churned by the movement of the ship, the color would turn to sky blue then slowly darken. There were many activities - we could be as active and sedentary as we chose to be. Two days were filled with land excursions (Cozumel and Belize City). In the evenings there were shows (ice dancing, song and dance, comedians...), multiple options for live entertainment from a rowdy pub to a low keyed jazz bistro. Twice we stayed up past Midnight, but were content to turn in earlier the other nights. I could go on and on but I won't hog the page. Let me just say the experience and the trip was exactly what we needed. Thanks for letting me share.",
      "MessageIndex": 7501,
      "PostDate": "04/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 24, 2009 09:41PM robink wrote:  May 08 Ladies - I will compile all our poetry, print it and send it out to each of you.  ",
      "MessageIndex": 5984,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 26, 2009 08:54PM robink wrote: Jen - my family informed me they have plans for me on May 7th so will Wed. May 6th work?  Springfield will be a good place to meet.  My parents live in the middle of Columbus and my siblings are spread all over the city.  I told my mom and sis that I'd be meeting with one of my BC sisters - they are excited for us.",
      "MessageIndex": 6017,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 4, 2009 05:52AM - edited Jun 4, 2009 10:12AM by robink Hello Friends!  I've not been gone, just reading you posts but not ready to write.  So tonight at 3:24a.m. I am being what will be the 1st of several multiple posts.  I'm going through it in an odd way, pulling up the name of a sister and reading recent comments then responding to her.  It may take a day or two to complete this way, but who cares??? Cris- Thanks for that link for Eddie/Adam. I loved reading it, particularly Adam's letter. I still have numbness and tingling in my left upper chest, no true pain but it's at time a nuisance.  The pec muscle get very tight at time, so much so that it affects my left arm.  The is a stretching routine I do once or twice daily (when I remember) and it seems to help keep these sensations at a minimum. Cris -  you mentioned being DAT...I've been that way this week and thinks it's due to the dreary, colder weather.  Now that I have stopped the Femara with constant feeling of exhaustion has gone away.  HOORAY! Glad to know you have a year behind you from the start of chemo.  Remind me, are you on any preventatives? You had mentioned a vacation ofter the last recitals and a KD graduation.  Where are you headed?  It's it great to be able to vaca with your gang this year and not have treatments disrupting you plans?  The budget is tight all over the country but sounds particularly bleak for the state of California.  How do this personaly affect you/your family?  Do you vote on the newest tax or is it imposed on all of you? Hasn't Cali taken a big hit with the funding of support of illegals? Gracie  What are you doing up so late?  Just saw you post 20 minutes ago.  I'l reading throught your latest comments now but will need to delay my replies until later, my vision is getting blurry and my head is fuzzy, guess I should try to sleep morw. TTFN",
      "MessageIndex": 6347,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 4, 2009 06:52PM robink wrote: Jeano- Glad you are recovering well and are pleased with the results! Was your procedure an exchange (expander for implant)? With you being a runner you probably don't have much extra fat to make a new boob. How uncomfortable was the expander experience?  I'll be having a tissue expander then a tram, however my PS will peel back the skin and fashion my new leftie with my excess abd. adipose tissue.  I am not very tall but have more than enough tummy fat. Your trip to Colorado for the Bolder Boulder, was that a 1st for you?  I hear about that annually but that's the extent of my involvement.  The only places a run to is from the store to my car if it's raining. Back to the expander issue...During the several months of fill time, how did you adjust for the inequality?  I have a foob but don't imagine it will fit after my skin starts growing to accomodate the implant. Julie - did I miss it?  When do you leave for vacation and when are you going?  Virginia, right?  I am sorry for not getting the infor to you about the Yoga DVDs.  As it turns out all 3 are beginner level and are in some ways repetative , that being said I will send one to you and give the other to my DD. How do you wean yourself from sleeping?  Don't you hate it when you need a vacation to recovery from a vacation?  What did you decide about staying in a hotel?  At least it's your room and can come and go as you please. If this is to celebrate YOU then do what you want to do. Will your girls be going to any summer camps? or are they too old for that?  Congrats on the new baseline normal for the mammo mid May and to every 4 month onco visits. Randi - The only thing I know to do for you and your panic attacks is to pray for you and that is what I just did.  Ativan - I loved that stuff, it worked wonders to turn off my mind at night.  I am glad your doc finally realized you needed something more than a \"bandaid\" for where you are right now.  And you should know there is no reason to apologize for anything.  Do what you have to do to get through this.  Wouldn't it be nice if there were some Mafia boss to take care of just this kind of shit? Roxi - 9 1/2 hours of surgery.  Exactly what did they do?  Bilat DIEP?  And why are your incisions open?  I'll bet it's wonderful to feel sensation again.  I am trying to imagine it.  Hooray for new boobs and tummy tucks! How did that dinner for your close friends go before your surgery?  Sounded like a great idea.  Now just focus on healing.  You are off work for how many weeks?  How are you tolerating standing up so far? You are much stronger than I am, going through this with only Tylenol. I'll be praying for you.",
      "MessageIndex": 6351,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 8, 2009 03:24PM robink wrote: Gee - everyone must have been busy today.  The thread is quite. For clarification - please send the contribution for the flowers and monetary gift to Eddie.  She will send the monetary gift along with the cards/notes/letters/ Randie-isms to Randie's family. The cost of the flowers was $80.  Do not send any money to me, just include it along with whatever gift you were giving Randie's family. RK",
      "MessageIndex": 6610,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 4, 2009 07:10PM robink wrote:",
      "MessageIndex": 6352,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 31, 2009 03:25PM robink wrote: Simplifying my life?  You'd think that what I should be doing.  But noooooooooooooo,  Tissue expander insertion on the 27th, began an online college class the 24th, getting some painting done Monday so we spend most of the weekend prepping for the painters arrival. And I need to be in bed but the pain meds have my sleep schedule all messed up. Otter, DS is back in Lakeside, Montana.  Arrived there Sunday - well it's still Sunday for about 20 more minutes.  He'll be on staff at the YWAM base for 5 months then go back to St. Croix. Anyone with expander expereince please tell me what I can expect and how long this procedure takes to stretch and grow the skin on my chest.  I have a little boobie that looks almost upside down.  Kind of comical actually. And be honest, does it hurt much when it is filled with more fluid? Eddie  DE-POR-TA-TION.  Still cracks me up that I didn't understand what the heck you were talking about.  Jen - you'll be saying the same thing soon.  Out with the port!  Out with the port! Sue - how did the flipple procedure go?  Hope you are feeling good now and pleased with the appearance of you new headlights. Getting drowsy to I'll try to sleep. Night Ladies",
      "MessageIndex": 6830,
      "PostDate": "31/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Sep 1, 2009 08:53AM robink wrote: Since the Cipperly kids are on FB, what about sending a PM to their inbox stating that friends of Grandma Randie sent them a gift box and flowers and wanted to be sure they had recieved it.",
      "MessageIndex": 6834,
      "PostDate": "01/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 21, 2008 01:35AM robink wrote: Angels, We two \"kids\" son 21, daughter 18.  He works full time, she's trying to figure out what to do with her life.  Just returned from 7 months away (germany then africa with an organization called YWAM).  My husband has been very supportive from the start and I appreciate him so much!  He works 3 days a week which gives him an opportunity to think of something besides my cancer, surgeries, recoveries and up coming chemo. With short term disability available to me, financially we'll be OK with me not working.  It's my emotional well being that is of concern to me but I certainly don't want to put anyone I take care of put at risk because of \"chemo brain\".  Well, I'm going to take a walk!  It's breezy here today, but warmer and sunny.  Enjoy your Sunday.",
      "MessageIndex": 11,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 25, 2008 10:31AM robink wrote: May 1st That is when my 1st treatment has been scheduled.  I am far from thrilled but just want to get this behind me.  My brain feels about as numb as my chest right now.  Think I'd better rest. More later",
      "MessageIndex": 21,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 25, 2008 02:43PM robink wrote: Hi Melissa, I have decided not to work during chemo as my job puts me at risk for illness, so yes - I'm taking the day off :)  It was suggested that the weekend might be rough (fatigue) due to coming of the Decadron.  Sounds like you'd be wise to take it easy over the weekend, also. The antinausea med I've been instructed to take Thursday, Friday and Saturday is Zofran.  I've also been given Compazine and Ativan for break through nausea. As for wigs, I don't have a clue.  I thinking of taking a drive to Denver to a highly recommended shop.  My insurance will pay so I want to chose well.  Once I begin accepting the impending loss of my hair I'll try to make the best of it and by a few extra wigs.  Might as well have fun! Enjoy your weekend",
      "MessageIndex": 24,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 30, 2008 02:57AM robink wrote: Help....there is an idential thread started same day that is beginning to have new posts.  I am encouraging the newbies to join and post on this thread, have also contacted the moderators.  Other than that, any suggestions? Robin",
      "MessageIndex": 52,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 4, 2009 10:24AM - edited Jul 4, 2009 03:10PM by robink Note cards sent as a bundle...yes Randie-ism's...yes Money for the family to use as they see fit...yes I will send the flowers if you direct me to what the card should read.  And where should I send them ...to Randies home or the funeral home? The flowers should go out soon, then the personal cards/notes send together later. RK",
      "MessageIndex": 6554,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 11, 2009 11:15PM robink wrote: Hello to ALL...and greeting from a flipping cold Colorado Springs.  Yesterday and today the temps have been in the high teens.  Just a little snow but enough to cause black ice and a 60 car pile up on the only interstate that runs through the Springs.  We always have snow by Halloween but this is ridiculous.  So today I stayed in my flannel jammies, had the fireplace going since 7 am, knocked out a paper for my class that is due next Sunday (boy do I hate APA style). Gals, I've been reading regularly but not posting, obviously.  Transferring to a new position 4 weeks ago, starting college classes to advance my degree, having the house painted and carpet replaced have left little spare time.  I've been pleased to see the progression back to normal lives for most.   Dana - great \"seeing\" you again. Eddie - thanks for posting the note from Zach. I have a question for those of you who have had expanders (Jean and Roxi and who ever else).  While your expander was inplace did you have decreased range of motion of the surgical side?  It took a long time after my mastectomy but the. ROM had 90% normal, minimal tightness.  It has been 6 weeks since the expander was placed and I still have significant discomfort and tightness in my chest resulting inwhat I think is a moderate decrease in the ability to move my left arm in certain positions.  The expander now has 500ml in it.  I'm thinking that will be enough.  Now it's perkier than my real boob - so much so that I'm contemplating getting a push up insert for the right side. Don't get me wrong, this isn't a complaint.  It will just take some time getting used to.  Funny because I almost got used to the lonely boob, crooked scar, numb chest and fake migrating boobs. What's the latest on the gathering at Sue's porch?  Guess I need to get back on FB also. Great catching up with everyone! Love, Robin",
      "MessageIndex": 6983,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 22, 2009 10:27AM robink wrote: Hummmmmmmmmmmm...aint it great that we aren't here everyday? It's been snowing all day, I haven't gotten out of my jammies and its wonderful.  DH bringing home pizza, got my homework finished today in my new research course, tomorrow I'll work on my sociology.  Hope all is well with each of ya'll",
      "MessageIndex": 7009,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jul 11, 2009 10:55PM robink wrote: Otter= your post card arrived today.  Thank you, it was a very pleasant surprise. Robin",
      "MessageIndex": 6643,
      "PostDate": "11/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Dec 8, 2009 04:48PM robink wrote: OK..~~~whispering~~~ HAPPY BIRTHDAY JULIE (I was whispering in my head - typing in a loud voice)",
      "MessageIndex": 7149,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 3, 2009 08:02AM robink wrote: Friends - the donation to BCO in honor and memory of Randie has been made, $100.  Her DH will be notified by BCO.  I created a new topic under the donation forum. Love  - Robink",
      "MessageIndex": 6743,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 6, 2009 12:17AM robink wrote: Dana - please let us know when you have your treatments so be can \"be with you\", \"hover\", have shovels ready, tell you jokes, take care of you, hold your hand or sit in a corner and keep quiet guard over you.  And let us know how things are going in the inbetween days so we know how to help... Love ya!",
      "MessageIndex": 6750,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Aug 17, 2009 02:07PM robink wrote: Fairplay, Colorado???  Just a few hours from me - I imagine you are long gone from there now RK",
      "MessageIndex": 6781,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 2, 2010 06:20AM robink wrote: So I've had my 1st trial of 2010 - wrote a lengthy post (over several hours coming and going from the computer) only to find it gone after clicking the submit link, having to sign in again.  Oh well - so DD and I just went on a nice walk and I'm now sitting  here trying to remember what I wrote. Eddie - Your Adam sounds like a remarkable young man. Congrats to him on his bar mitzvah Jan 9. What's with the 300?  Sounds like quite a massive under taking. Looking forward to reading about your day spa adventure. Have you had any SE from Aromasin? Adrienne - Emergency Broadcast System, good idea.  I get reception here in Colorado! No periods for me since 2001 (hysterectomy, all parts gone). Sometimes I wonder if the 7 years of HRT contributed to the development of my ER+ BC, but I don't dwell on it cause I can't change it, just haven't taken the HRT in almost 2 years. Linda - what is that CYP??? test you were referring to? Guess I'm too lazy to look it up. (Otter this is where you weigh in with you research). When offered the option of the oncotype testing I declined, sometimes wise I would have pursued the option but this is another thing I can't change so I don't worry about it. Julie - any poo for FIL? I'll need to keep the recipe you mentioned in mind for keeping things rolling after my TRAM. Do you still have all your hari? Haven't pulled it out deeling with MIL and FIL? Will he go to his home when discharged from the hospital? Jen - reshaping the tum-boob for why? Cause it's bigger than the other one? or what? My PS mentioned he may have trouble getting the new one large enough to match the existing one. Don't get me wrong, I am niether large chested or skinny, I just happen to have the majority of my belly fat above where the fat harvesting needs to take place. Not thrilled with the idea one making Girl #1 smaller. (It's funny - to me - sometimes I'll stand in front of the mirrow and play around ith repositioning the fat, trying to flatten my belly to envision how it will look.) Yay for having poo, and yay for having two! Great to be minus 2 drains, I'm excited for you that #3 will be out in a few days. Thanks for the reminder about frequent emptying.  Drain pain, I remember that with little fondness. Jackie - Good to \"see\" you! Hope your weekend shifts go well, and that you and your patients will be blessed by one another. Cris - anothe flu? How many times have you been sick? Is this a respiratory version? The H1N1 and seasonal flu around here has subsided, however there is a nasty GI bug that is going around. Hope no one else in the family got sick. Jean - heel spurs, very painful. I was just reading that one year of conservative treatment is felt necessary before surgical intervention ofr heel spurs or plantar fasciitis. Let me know if you consider accupunture for your pain.  I felt it to be helpful with hot flashes after chemo/ Femera. Great picture!  Otter - Cold From Hell and Great Frozen Land of the North, what a combo.  Glad the waiting card were soothing for you. DH wants to live some place warm, after 3 months of snow an cold so far this year I would almost consider it. I vote no on posting on another site, them we wouldn't have seen it and been deprived. Heather - did son #2 make it home safely?  I envy you, DS hasn't been home for Thnaksgiving, Christmas, New Years for the past 3 years. Currently he is in Taiwan. We did get to talk to him yesterday and was thrilled about that! Enjoy and savor the time with both your sons! Julie - loving the full blue moon also! Like Fievel sang - Some where out there, beneath the pale moon light, some one's thinking of you, and loving you tonight! Happy New year to each of you, to your family and friends as well. May you be blessed with the things you need.  And when you are blessed with the things you want, savor those moments as well.",
      "MessageIndex": 7246,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 8, 2010 01:20PM robink wrote: Eddie - how's the BM preps going? Rock - no urea yet, waiting until the podiatrist gets the culture back - although she seems certain it was a fungus. The funky nail has been with me for more than a year so waiting 2 more weeks won't matter. How long did it take for your nail to clear? Kerry - Marathon of my making but it keeps me busy and not obsessing about next week. Forgot my passport had expired so this afternnon have to get a photo taken, go to the post office to turn in the application. Good thing I had my hair cut yesterday (any way - can't go into my body resculpting venture with crazy hair) Adrienne - have I missed something? Why are you worried about your onco visits? Aren't these just routine, no new problems???Are you looking forward to the Florida trip? Hope it will provide pleasure and now just be an obligation. Linda - the last 2 nights I've slept with a night splint on my right foot, took it off half way through due to irritation to the top of my foot. Have to say that even with interupted night therapy my foot didn't cripple me in the morning. yesterday I had a session of Extra Corporeal Shock Wave Theraphy to the right foot, it hurt during, only mildly achey today. 1-2 more sessions possible but that will have to wait until I can drive again. Jen - no more new leaks I hope, and using fewer diapers. Hey - what about those blisters? What did your doc say was the cause of those? Seriously - ask him about would care centers if yo don't make progress soon. (When DH had 3 vessel bypass surgery 4 years ago, his leg incisons split open cuz the doc fluid overloaded him. The wounds wouldn't heal, DH asked for a referral to wound care, arrogant surgeon says \"I'm the only second opinion you need\", we left the office and walked down the hall to the wound care center. DH and asshole surgeon parted less than friends). Is you pain getting better? Kristy - remind me why now you are in the clinical trial. Hope it didn't ravage you like Gemzar did to Dana. Kerry - Karin posts on FB from what I see. Whn you find the answer to the waitline growth question, pass it on. Since my diagnosis 2 years ago, going off HRT, surgeries, 6 months of Femara, and taking a more sedentary job cause I couldn't deal with the pace at the other one my weight and waistline have suffered. Going to take before and after photos and measurements. Better get on with my day!  Love to all.",
      "MessageIndex": 7283,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 9, 2010 06:26PM robink wrote: Good ideas Jen, thank you! Tell me more about the binder - oh wait...I can be surprised on Monday! No - just tell me! Like when you started wearing it, how bid is it and stuff like that. Poor Rock...the NYC germs got you already, or perhaps the freezing temps compared to SA.  Feel better soon!",
      "MessageIndex": 7290,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 29, 2008 04:52PM robink wrote: Ewesterman - as familyrocks mentioned, you are on the list.  Glad you are feeling better today.  I had my 2nd dip in the chemo pool the 22nd. When you add a comment, take a slow deep breath while it loads.  If you hit the submit button more than once it will post that many comments.  Don't worry, I won't change you to starting chemo 5 times.  That would just be wrong. Welcome to the club.  Keep in touch with us - this band of chemo sisters.  You'll be better for it. Robin",
      "MessageIndex": 570,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 14, 2009 09:45PM - edited Oct 17, 2009 05:25PM by robink Sue and Dana ---Very glad you talked!!!  When are you getting together? I just read here on BCO that the Taxanes/ Taxotere doesn't have any effect on the type of tumor I had.  Not happy.  Went through that shit thinking it would provide some insurance against recurrence.  For what?? Hair loss, chemo brain, muscle pains etc, etc.  I know I was offered and accepted the recommendations thought best for me at that point in time.  And I know I can't change it now, and I have my hair back and I don't have cancer now.  But crap...it just upsets me.  And I think of what drugs like Gemzar did to Dana and I am getting pissed off.  But Dana - you should that nasty beast who was boss, and you've talked to Sue recently so I shouldn't even be complaining. Just had to get this off my chest.",
      "MessageIndex": 6991,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jun 1, 2008 01:39PM robink wrote: Julie - welcome and I'm sorry your 1st trip to the chemo bar left you feeling so lousy.  What anti nausea meds does your onco have you on? Many of us take something (Zofran for me) around the clock for the 1st 3 days and also have another medication for break through nausea. As for the pain from the taxotere, my onco says take ibuprofen several times daily and take percocet if the pain gets severe.  He also advises L-carnitine (an amino acid) 500 mg twice daily for 7 days starting chemo day.  This is to help prevent or reduce muscle/joint pain and peripheral neuropathy. Otter - I'm getting those bumps on the back of my head.  Yesterday I wore a wig most of the day and wonder if it irritated the stubble on my scalp. Roxi - I liked it when my hair was 1/2 inch long.  It was kinda fun, in an odd sort of way.  My dh and I went out for margaritas and chimichangas last night.  It all tasted good!  My onco didn't completely restrict alcohol but advised minimal. Rock - way to rock the bald!  Between chronic health issues for dh and my current situation sex hasn't been happening here for a while.  I say go for it!!!",
      "MessageIndex": 637,
      "PostDate": "01/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 17, 2009 11:11AM robink wrote: Otter - Ever the friend and teacher!  Thank you for that clarification.  I posted in anger, never a good thing.  Kerri Lamb - I am sorry for causing a little trip up for you, and will take the BCO analysis with a grain of salt until I've further researched the matter.  It was the first time in months I had read any of their info. Kerry - on the move on the mower!  Wonderful news! DH is preping our tractor for winter storage and pulling out the snow blower.  The blower is a walk behind, takes a lot of work but without it we would have been stranded multiple times. Love to all and wishes for a great weekend. Robin",
      "MessageIndex": 6997,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Dec 6, 2009 09:24PM - edited Dec 6, 2009 11:58PM by robink Julie - it always struck me  funny how grade school boys and girls think they can be \"going out\".  Where do they go?  To the monkey bars?  And the class bad boy?  Was DD flattered or creepy out? I'm sorry to read about your FIL diagnosis - hopefully MIL will take her eyes off herself and realize she has someone nearby who understands more than most and can offer insight. Jackie - have you fought against lymphedema this entire time?  Will your be going to therapy for this, wearing a compression sleeve or ??? Eddie - Fabulous picture!  Rock - when do you come home? Are you ready or wishing for more time? Jen - hurray for the upcoming TRAM.  Mine is scheduled for Jan. 11.  How long will you be in the hospital? And how long did your surgeon say you'd be out of commission? Let us know how the Christmas lights appear through the drug altered vision. Everyone else - I've been reading, not posting.  (is that similar to long time listener-1st time caller - I don't think so as those call in shows don't care about each other the way my May sisters do) It's good to keep up with the happening in your lives through this site and FB.  The past two days DH and I have been baking cookies - first time doing this together in 20 years of marriage. The experience was enjoyable!  Initially he was driving me nuts, he hates messes so he would clean up as we went and I couldn't find some things when looking for them as they were washed dried and put away. In the end it was a real treat because he left minimal for the big clean up.The sugar cookies didn't turn out very well - tried a new recip, cookies didn't hold their shape, candy canes morphed into saxaphones and snowmen into blobs of odd shapes. They do taste quite good though. My classes have gone well.  I'm just finishing the 2nd 8 week block.  Proud to say so far I am an A student! DS, still working with YWAM is co-leading a 2 month outreach to Taiwan and an undisclosed location.  He has matured late in life and I'm astounded with the change in him.  God is going a good work both in him and through him. DD will be home for Christmas break this Friday.  Looks like she'll complete her schooling in two more semesters.  Three weekends ago we met in Denver, saw a play, talked, and walked around downtown Denver.  It was a priceless weekend.  Don't know what I enjoyed more - seeing the play myself or witnessing her reaction. (As I'm writing this I am thinking perhaps I already shared this with you - but since I took the time to type it I'm leaving it in this post) I have a dear friend who has been recently diagnosed with Stage I BC, scheduled for lumpectomy early January.  At this point she is refusing radiation.  Instead she is eating an alkaline diet, and will be taking home hyperbaric Oxygen treatments (her DH rented a chamber and will be setting it up in their living room). My instinct want to shake her and say take the damn radiation BUT this is HER journey, not mine. I've learned on our blog and on BCO that women handle this \"darkness\" many different ways.  The chosen way has to be the one that the woman can live with. After 6 months of hellacious Femara treatment I stopped taking it, instead taking supplements that I believe will make a difference in the long run. Several of you felt I made the wrong choice, voiced it lovingly and then let it go.  I am go grateful that we accept each other and our decisions. There are still a few cookies to be iced so I'll sign off for now. Love to all! Robin",
      "MessageIndex": 7135,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 3, 2010 05:44PM robink wrote: Jen- how long did it take for the tum - boob to swell like that? Is your flap OK, healthy color and temp? And the \"stuff\" pouring out of your tummy incision, did that come after the drain was removed? Is it clear or looking infected? And why is it that the old boob seam is splitting? Why is there even swelling on that side?  Maybe I missed something, did he do a resizing on that side?Write down EVERY ISSUE, refuse to leave until each are addressed. Did you see this guy's before and after work? With all that edema and drainage you will certainly have wound healing issues. Is there a wound care clinic at your hospital?  If so, make an appointment. And you don't have to worry about me being freaked out. I already am. Just don't have a lot of time to dwell on it. Ben working part time. Yesterday spent the day at the hopsital, DD had appendicitis= surgery = now recovering before need to return to college Thursday. I know a few nurses at the surgery center wheremy TRAM will be done. They tell me my PS work is very good, I liked the before and after photos. Mine will be slightly different in that I will NOT have a flap, there was enough skin preserved to place the skin expander to make room for the fat transplant. My body better behave in its recovery cause in late March DH and I, Sister ans BIL are taking a cruise! About the canyon, how about a squirt bottle for cleaning and a fan or a blow dryer? :) Otter - Jan 11 is my day for body resculpting.",
      "MessageIndex": 7260,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 5, 2010 09:14AM robink wrote: Jen - I second what Julie said! Ya'll otta check out that bottom buddy toilet aid, ya never know when you can't reach your own canyon, or just to lazy to reach :)  (Good find Rock)",
      "MessageIndex": 7266,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 9, 2010 09:36PM robink wrote: Looks like a trip to Walmart for a sports bra with front closure may be inorder - have no idea when I can do that before monday. My resculpting will be will be done at a surgery center, 3 short stay rooms, a nurse and medical assistant provides care - hoping the night noise as found in a hospital will be minimal. A nurse friend tells me patients who are \"done\" at that center do quite well. Guess I'll be the judge of that :)",
      "MessageIndex": 7292,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Jan 19, 2010 05:51PM robink wrote: Hello May Ladies, Today I had my 1 week post op visit with my PS. Breast drain removed. Both incisions healing well.  Jen, I understand completely about the swelling of the TRAM breast. The day of surgery I can vaguely recall touching my new breast and feeling amazed at how close to \"normal\" it felt. Over the next few days it became larger than the other and firm to touch. Doc says it won't swell anymore at this point. Also says somewhere in the 6-8 wk point post op the swelling recedes, says most of the swelling is gone ~ 3months post op. (interesting tid bit of info: an MRI tech who had had a tummy tuck was followed monthly with MRI for close to a year; intra-abdominal swelling was evidenced through 8 months following the procedure; the TRAM is much more invasive a procedure) I asked about a binder. He doesn't use them with the TRAM for the risk of interfering with blood supply of the flap. If I wanted to wear a panty girdle for abdominal support he thought that was fine. Then he proceeded to tell DH and I that my abd. is at its weakest point in the recovery, how it is held together by three strategically placed sutures(and a few other things), and how crucial it is NOT to over do it even if I am feeling better. Think I'll check out the selection of girdles at JC Penney online, otta be fun using that with two drains.  HAHAHA...shape wear is what they are called. Perhaps I should get one with padding for the behind! Guess I'll post this now and wish you all a good day.",
      "MessageIndex": 7332,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Feb 5, 2010 11:42AM robink wrote: Holy Smokes:  a lot on this page! Young and old with cancer.  Mush for brains.  In law's and parents.  Canyons and problems down there.  Birthdays.  Meltdowns.  Olympic Torches and curling. and other things... Jen, so glad your recovery is finally going well.  I hear you about having a bed alone.   The first three weeks I slept in DD queen bed, actually have found it more comfortable that out sleep number bed.  Have tired several times to sleep with DH but that's not going so well. About that real bra, how did that work on the tram side?  when I've put one on the muscle bulge makes it rest oddly on my chest.  Thinking of checking out camisoles.  Bigger problem for me is clothing, pants still hurt at my none existant waist, and then they fit strangley.  With the lower belly fat gone it's all flat below the incision,  Above the abd incision it's flatter but straight, no waistline.  Hoping that comes back when the residual swelling continues to subside.  (any of you resonstructed ladies want to weigh in on how long your body took to get to it's final post surgical shape) Rock - thanks for living your life so fully and sharing it on FB.  I so enjoy your pics, your insights.  Love  you on this side of the threads also! To everyone - have a great weekend no matter where you are and what you are doing. Love to all.",
      "MessageIndex": 7380,
      "PostDate": "05/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Feb 5, 2010 06:26PM robink wrote: Oh Dearest Otter - you must be physically and emotionally exhausted.  Cold from HE double hockey sticks, MIL issues, father concerns (how is he currently?), and loss of friend to canuck.  Remind me, where you have the flight to the frozen northland and why?  I scrolled back a page or two but my brain couldn't piece it together.  How did that cough syrup Mr. Otter brought home work for ya?",
      "MessageIndex": 7382,
      "PostDate": "05/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Feb 18, 2010 02:54PM robink wrote: Julie - book reports!  OMG I am so glad those days are behind me!!!!!!!!!!!!  Haha, what am I saying, I'll have my own reports and papers to write when I get my butt back in school.  Somewhere along the way I missed that your DH had been to the ED, chest pain I am guessing based on what you wrote.  That's so frightening.  As if you haven't had enough crap with sick kids, in laws, parents, root canals, and life in general. Rovk and Linda - I am thrilled that you could meet!  Hoping it was refreshing for both of you.  Did I miss pictures here or FB? Otter - great insights in your weekly learning Cris - any more signs in your neighbors windows? Kristy - wishing for a smooth transition to sales and marketing IT Anyone - word about Dana? This week is my 5th post op week, started back to work last week, doing pretty well. No pain pills except at night.  See my PS next Tuesday.  The new boob seems to be getting used to its new place in my body. The 4 weeks of firmness bothered me but now there are progresing areas of softness, far from jiggly though. Scars healing well, new belly button not so well. Tummy still very senstive, tender with some edema, don't have many clothes that I can wear without increasing my discomfort. Happiest in my jammies, can't wear those to work and church. DH and I crusing in 33 days!  Meeting up with my fave sister and BIL. Kids are great.  DD is now a RA, recovered well from her new years day appendectomy, actually enjoying her college math class and loving taking photos.  DS now living in Montana, still with YWAM.  He was co-leader of a group of 10 students to Taiwan and China for two months. Two years out from BC diagnosis. Keep putting off the next appt with my Onco.  Simply don't want to walk in the office again. OK...there was more but I think someone pushed the delete button in my brain. Love to all of you!",
      "MessageIndex": 7404,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 10, 2010 06:33PM robink wrote: I'm with you Kerry, itching wasn't much of a problem for me either, although I rarely wore the wig.  Yes, I remember being bald - in fact ran across pictures taken my DD the day DH shaved my head. Geez, so glad that is behind me. Wow Cris, what a whirl wind! 8 weeks post op!  Am doing very well. Although 3 days ago when the tram boob was quite swollen and hard I was certain the flap had died, it would have to be cut off and all this was for nothing. Next morning there was a bit more softening on the sides.  At least it is 75% hard now instead of 100%.  Last week I bought normal bras! Very got a red one! Cruising the Caribbean in 12 days! Found a lovely swim suit at JC Penney that makes me feel and look good.",
      "MessageIndex": 7464,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 6, 2010 12:29AM robink wrote: Hi Kristy - sounds like a good weekend. I know exactly what you mean about no one mentioning BC. Isn't it a relief?! Otter - I have my 2 year check up the middle of this month.  Guess I am delinquent, haven't been in almost a year - had an appt the same day as my TRAM, so you know which appt got cancelled. I'm remembering a sense of panic rising in the moments before the epidural was placed. I can still recall the plan to hop over the bed railing, run down the hall, dart through the exit door to the left...then I would be safe.  Linda - Thank you! Eddie - Greetings and Happy Spring from Colorado",
      "MessageIndex": 7507,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 20, 2010 09:03PM robink wrote: Cris - where are you and how's \"things\" Jen - WTF??  Leave the poor kid alone. Drives me crazy, often kids who need the help can't get it for what ever reason, now a kid who is doing quite well and has overcome obstacles is being interfere with. Julie - I had to look up the neurofeedback. Still can't say I get it but hope it provides relief or a regulation of your disorganized state. Rock - hope the assistance provided to P was encouraging and uplifting to you. Glad you could spend the time with the sweet baby, then had him back over to his mother. What's the scoop with your ovaries? Angels - jump rope competition? Which child is doing this?  And almost a year for BRCA results?  Did they lose your specimen?  That's ridiculous. Lunda- where are you headed your next road trip? I enjoy following them on FB. Jeano - couldn't remember why you are sporting a cast, read back through your posts. You have 2 or 3 more weeks with it? Is it hurting less? You still running with it on?  How about the plantar fasciitis? Kerry - well spoken from the heart, as usual. Today I had my pre op visit with the new PS. May 6 I'll be having the bad TRAM remove, a Mentor silicone implant placed. It helped to actually hold one. I think it will fit well under my skin. A nice pocket has been formed first by the TE then the TRAM flap. Sucky way to end up with an implant, talk about taking the long road. Noelle - hope your trip to NYC was enjoyable and productive. Love to all",
      "MessageIndex": 7522,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 28, 2010 01:11PM robink wrote: Julie - woo hoo for new windows. We have soooo many here, hard to keep clean, now looking toward doing repairs to some sills with water damage in prep for selling out house. I hope them let the sun shine in brighter! That Green Day song, \"Wake me when Septemeber ends\", I learned about through my daughter when she was having a difficult patch in her life several years ago, she was in Germany, told me about the song, I found it on itunes, could play it, feel come connection across the world. Good Luck to Riley, hoping she has fun with it and those who know Green Day will get lost in their own memories and be appreciative of her presentation!",
      "MessageIndex": 7552,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 19, 2008 05:15AM robink wrote: Hi Kristy, Looks like I'll be in the May group.  Like Otter I'll be getting 4 cycles Taxotere/Cytoxan every 3 weeks.  Next two weeks for me include further recovery from left mastectomy (4/7/08), chemo teaching, baseline labs, preparing myself physically, emotionally, spiritually for what these next months hold for me.  Also want to get the house cleaned to my statisfaction and pay someone to come clean the many windows in our house. It's too bad we met this way but it is good to have someone who know 1st hand what I will be going through. Robin K.",
      "MessageIndex": 2,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 24, 2008 10:45PM robink wrote: Welcome Cristine, None of us starting out knows what to expect - and that's what makes this site so beneficial.  Once a specific treatment plan has been tailored to meet your needs then you can find more info on this site, and all over the internet.  Have you had your surgery yet?  If so I hope you are healing well. Today I go for a teaching session regarding my chemo and will discuss a start date. Keep in touch...",
      "MessageIndex": 19,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 25, 2008 02:51PM robink wrote: Hi Lani, I'm sorry you're having to go through this but look at your future!  4 children!  Do you have help, someone to care for them on days when you're feeling poorly? Keep in touch.  Hope your weekend is warm and happy.",
      "MessageIndex": 25,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 29, 2008 10:52PM - edited Apr 29, 2008 10:52PM by robink Hello All, It must have been the time for haircuts - I had mine taken shorter last Friday.  Then on Saturday my daughter drove with me to a wig shop in Denver , almost had fun playing with some of the styles and I bought one, wore it around for the day just for kicks.  When I came home my dh thought I had done something different with my existing hair (styled and colored the shorter cut), could have pulled it off until a few of my unruly gray curls poked out from unde the wig.  A funny moment! Other Half , Roxi, EyeOTex, familyrox, and rocketthebald: WELCOME! There is a strength in sharing this journey with fellow travelers. My husband has been with me every step of the way, attending appointments, missing work, giving up days off to care for me, taking over household chores and holding it together fairly well.  I think he copes by doing the things I would ordinarily have done.  This gives him a great sense of purpose as we have gone through each segment of this adventure.  He is very private with his feeling and I think the book mentioned above, \"Breast Cancer Husband\" by Mark Silver would be beneficial. Today I don't feel so well, headache and scratchy throat.  DH had a cold and in spite of precautions I think I've picked it up.  Usually I take mega doses of Vitamin C and knock these things out in a few day.  But, at Chemo University I learned the chemo releases free radicals and the Vit C (an anti oxidant) combats free radicals so none is to be taken the week before and after chemo.  I've got through Thursday morning to beat this thing.   I don't believe in luck but believe in prayer!  So if you think of me send my name God's way. Blessings on your day",
      "MessageIndex": 45,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 30, 2008 02:34AM - edited May 2, 2008 06:02AM by robink SanDeeLou, There is a duplicate of this thread to with May chemo starters have been posting.  Come overthere with us.  I start May 1. ~~~perhaps the moderators can merge this two threads~~~",
      "MessageIndex": 48,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 2, 2008 05:14PM robink wrote: Otter- Thanks for being concerned about me.  The infusion part went ok.  DH and I were bored but apprehensive not knowing what to expect nut truly not problems at the infusion center.  Staff was delightful, kind.  I have a port which made venous access a breeze for them and me! I ate without event several small amounts last evening but nothing really tasted good, just eating to eating before the drop of appetite and nausea might kick in. Problem I am currently having (it's 1:43 AM) is the continuous flushed, sweaty then clammy feeling and my skin is itchy.  Makes it difficult to sleep.  I took my evening ativan at 10 pm so it's not quite time to load up on something else.  I've read about the positive effects of effexot on the T/C site and should call my onc's office in the am (office hours am) Night!",
      "MessageIndex": 97,
      "PostDate": "02/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 8, 2008 12:57AM robink wrote: Steph - send your Mom our way.  if she isn't comfortable posting she can learning a great deal from reading what others have shared.  Sorry she's on this safari with us but also glad she is not alone.  There is definitely strength in numbers and power in prayer!",
      "MessageIndex": 165,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 11, 2008 09:45AM - edited May 11, 2008 09:45AM by robink Angels and Carla - I wishing minimal SE for you this week end and managable fatigue when it hits.  Let others help you.  That funky mouth thing - drove me crazy.  It finally went away today ( 10 days after 1st chemo), I was diligent with the baking soda/salt mouth wash.  Maybe that helped.  No mouth sores! Kristy - you hung onto your hair an extra day or 2!  Have you recovered from the hospitalization?  Hope you are taking it easy this weekend. Rockthebald - I found the walks helped me feel better with leg aches and energy, hope the same for you.  Enjoy the quiches!  Sounds yummy. Cristine - I can't remember, when do you start treatments? Roxi - will you be starting Monday? Gogators - you'll be glad for the port.  It's a simple procedure and and I wish you well.  My onc doesn't give the Neulasta automatically, only if the wbc drops too low, says the taxotere causes enough muscle/bone pain and doesn't want to worsen it without cause. Accept help from family/friends with meals or caring for your boys during treatments. family and beachmom - how are you this weekend? I know there are others but I'm getting lost on the page so happy mother's day to all!  Robin",
      "MessageIndex": 204,
      "PostDate": "11/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 13, 2008 12:55AM - edited May 14, 2008 09:54AM by robink Ladies:  I have read back through all posts and have compiled a list of start dates.  Please check the list below and let me know if I missed anybody or got dates wrong.  Hope this helps in keeping track of one another. March 27:  LorenaB April 3:    Otter April 14:  susanblues April 22:  angie27 April 23:  Beachmom April 24:  Kristy April 25:  clg47, tiff2008, annie39 April 28:  The Other Half May 1:     RobinK, mpellot2004 May 2:     eyesotex May 5:     eak2863, craftygal May 7:     familyroks, rockthebald May 8:     Angels, cbme123, haykat57 May 13:   Roxi May 14:   cstock39, tomatojuice May 15:   Diane0803 May 16:   dsub May19:    collector May 22:   rogam, gogators May 27:   karebear43, danismom ~~~no dates noted for Laureg, drcrisc, Lani, corkyandme, Sandeelou, Becky--IL, Kpopperwell, Stepeliz (for mom), flyrzfan~~ To all who start today/this week I hope your bartender is friendly, and your lifeguard cute! Robin",
      "MessageIndex": 232,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 13, 2008 01:00AM robink wrote: Kat - that's a heavy burden you described.  All i know is that when this is over (chemo) for me I will know I did everything I could to give myself a good shot at long term survival and greatly decrease my chance of recurrence.  You'll be able to say the same. How are you feeling today??  Hope you weekend was uneventful. Robin",
      "MessageIndex": 233,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 22, 2008 01:51PM robink wrote: Hello All.  I'm writing this while in the chair poolside.  Please forgive me if the posting gets a bit wordy. Tina - too bad we can't see who is on-line when we are.  I was up in the wee hours of the morning also, thinking Decadron to be the culprit.  Wishing you well across the miles for a smooth treatment #1 today, and that all the SE you are fearful of are nonexistent.  Angels - my scalp started itching day 10 then a few days later my scalp became very tender.  I have always had short hair so I don't know the tight pony tail feeling.  Day 17 a number of hairs began to drop and by day 19 I had my dh buzz cut my hair to 1/2 inch.  Yes, I cried but in the privacy of my home.  Doing the buzz cut helped me come to accept the inevitable.  Now it's day 22, I have just a little stubble and I am OK.  Much better than I thought I'd be.  And getting ready is so much quicker!  No hair to dry and style.  You will manage this and come to accept your new look - in your own way.  I think each of us come to grips with this individually, just like how our SE are unique to each of us. rock - my onco said no vit C 7 days before and 7 days after chemo.  Never heard about the never ever.  I use mega doses when I am getting a cold and would hate to give that up (after chemo is a has been) Leeayn - Welcome!  Sorry you are on this journey but hope you find this thread, and the website to be helpful and a lifeline. Craftygal - It was good to read that you liked the way your wig was styled.  Currently I have two wigs, one human hair and I can style that one myself.  It looks very similar to my pre-chemo hair (without the gray).  The Raquel Welch wig I purchased is attractive bu seems a little ratty.  The is a salon in town that cleans and styles wigs for free so I may take advantage of their service before I banish it back to the box.  Yesterday I tried on a Noriko wig and loved the silky feel, the cap felt secure without being too tight. Your wig should not slip as much or at all when your hair is gone.  The wig hugger sounds like a good idea!  Is your wig adjustable?  That will help if it is. Cristine - I am glad you now have a game plan!  I understand the need to get it underway, we all do. Well, I'll close for now.  I have about 2 more hours here so I may be back before they boot me out of the pool. Robin",
      "MessageIndex": 400,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 22, 2008 03:25PM robink wrote: Rock - that's good to know about the Vitamin C.  If I ever have any other cancer cells in my body I sure as _____ don't want them stablized, want them dead and gone.",
      "MessageIndex": 402,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 24, 2008 12:00AM robink wrote: Otter:  what is YMMV? and I love your descriptions of your GI issues.  Sure am glad the worms didn't visit me.  Sorry about your feet.  Hope the Aquaphor helps. (Think I read about that on another thread). Wishing you all a peaceful weekend",
      "MessageIndex": 447,
      "PostDate": "24/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 29, 2008 11:26AM - edited May 30, 2008 07:44AM by robink  ~~~This is an updated start date list that I posted originally back on page 7 or 8 of this thread.  Please check the list below and let me know if I have missed anyone or have your date wrong.  Cristine seems to be keeping track of where people are weekly -thanks for that. Hope this helps in keeping track of one another. March 27: LorenaB April 3: Otter April 14: susanblues April 22: angie27 April 23: Beachmom April 24: Kristy, lewing April 25: clg47, tiff2008, annie39 April 28: The Other Half May 1: RobinK, mpellot2004, Leeayn May 2: eyesotex May 5: eak2863, crafty gal May 6: sharonf May 7: familyroks, rockthebald May 8: Angels, cbme123, haykat57 May 9: lilwebb May 13: Roxi May 14: cstock39, tomato juice, Lenny May 15: Diane0803 May 16: dsub, nmjohn May19: collector May 20: wondering7 May 21: Jeano 77 May 22: rogam, gogators, KinAZ, LisaLA, jule, ewesterman, May 24: beergirl May 27: karebear43, danismom May 28: Gracie713, MsKarin, Becky--IL May 29: flyrzfan, 2grace, ranD, drcrisc May 30: Desi NJ June 4: Kking ~~~no dates noted for Laureg, Lani, corkyandme, Sandeelou, Kpopperwell, Stepeliz (for mom)",
      "MessageIndex": 555,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 29, 2008 11:42AM robink wrote: It's been a while since I've posted personal responses but wanted to welcome out newest club members.  I also want to wish minimal SE for those bellying up to the bar this week. Otter - you seem to be having a rougher time of it and I'm sorry for that.  Thanks again for being our research professor. Susanblues - congrats on the completion of \"phase 1\" Craftygal - what a drag concerning the brakes on your car.  So glad you came to a safe stop and the dx is assisting you. Roxi - so the moon is shining bright in WI???  Your kids are funny.  ````````````````````````````````````````````````````` Finally I am feeling less traumatized with my bald head.  There is a wig I like , sort of, and am wearing it out more often.  Initally I was certain each person looking at me was thinking \"Nice wig Lady\", I just knew they knew it wasn't my hair.  Yesterday at Sam's club, feeling more confident I kept my head up and watched people's eyes, expressions and realized that no one gave a flip what my hair was like.  Then later in the day I ran into someone whose opinion is important to me and she gave me the kindest compliment!  What an ego boost.  So when I got home I ordered another wig that I've been admiring and am excited for it's arrival.  Enough about that.   Blessings for each of you today!",
      "MessageIndex": 557,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 21, 2008 11:49PM robink wrote: Kristy, With your node status 0/3 what would purpose would the axillary node dissection have served?  I am glad for you for the conversation you were able to have with the expert.  It's wonderful you won't be having another surgery! About decision making: there have been times throughout this journey that my husband and I have felt overwhelmed with all the information given us and the variety of choices.  It is good to be empowered with knowledge but once or twice I/we wished someone would have told us exactly what we should do.  More than once I have 2nd guessed my final decisions.  At the end of the day I rest in the confidence that I made the best decision I could at the time and trusted that if God didn't want me to take a certain path He would somehow lead me down another. So, if you are going to get a jump start on chemo will you be starting now in April?  There aren't a lot of gals on this May 08 thread yet, but suspect more will be joining. I didn't know much about YWAM except for a few persons at out little church who had participated in a DTS (discipleship training school) then our daughter requested permission to attend a session in Germany, delay her college entry by one year.  Permission was granted and she was gone for 7 months.  Shortly after her departure our son decided he would participate, same program, different location - left in October and was gone for 5 months.  It was a tremendous experience for both.  Then they came back to what is happening with me.  Perhaps what they learned will aide them in this journey that does affect every person in a family.",
      "MessageIndex": 14,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 3, 2008 02:14AM robink wrote: Kristy - sorry for your experience with your nurse yesterday.  Yesterday was my 1st treatment, dealt with 4 different nurses, 2 primarys and each was delightful.  I am fortunate and have a port.  I love it and am only getting 4 treatments.  Tood bad you didn't opt for one with the frequency of your treatments. Certainly advocate fo your self next time.  Don't hesitate to talk to the nurse manager if a problem persists.  I'm an RN and would like to think we are all good at what we do but sometimes that isn't the case.  She could have been having an off day when it came to your IV sticks but you have one good arm with good viens, let's work on keeping it that way! Pray over her or whoever before the next time (even if it's a prayer in your mind between you and God).  You need prayers for your successful treatment and your care givers need them too! Have a great Friday.",
      "MessageIndex": 100,
      "PostDate": "03/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 7, 2008 11:45PM robink wrote: To Family and Rock: I've just prayed for your \"time in the chair\" and the days that follow.  Here's hoping for minimal SE!  I remember the apprehension prior to #1 (last Thursday) and was glad it was short lived.  Today,day7, I feel almost normal.  I have a PT appt. and may get my hair trimmed (to look good for the remaining week I actually have hair) Otter:  you are awesome to keep track of everyone.  Thanks Good Wednesday to all!",
      "MessageIndex": 145,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 17, 2008 10:58PM robink wrote: Carla-where did you buy your turban? Ihave been looking at a few extra wigs, just for fun and there is a link on the T/C web site for skullcaps with terrific patterns.  Things I actually though I would wear. To All:  have a terrific weekend regardless of your place in your treatment cycle.",
      "MessageIndex": 302,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 21, 2008 07:22PM robink wrote: Happy Wednesday to all! I have my ticket to...not Hawaii or Mexico but for four courses at the infusion bar, arrival 9 am Thursday.  Appetizer:  Benadryl  1st course: Taxotere  To Cleanse my palate:  Zofran  Grand Finale:  Cytoxin Since I'm taken this trip once before I'm not very apprehensive.  If I'm not too drowsy from the Benadryl my dh and I may go see a movie, otherwise renting \"National Treasure\" sounds like a plan. My best to all of you. See you on the other side!",
      "MessageIndex": 384,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 6, 2009 10:56AM robink wrote: Karin, Before chemo my hair was wavy/curly, salt and pepper, soft to the touch.  Now it's curly-curly, very gray and a bit coarse to the touch.  I've had two cuts with an gal who does will with curly hair.  The first cut I was very pleased with, not so much with the 2nd.  The problem is not with the stylist but my hair seems to be still changing.  It has been so easy to care for, towel:dry, a little gel and off I go.  As it fills in completly I'm increasingly looking as if I have an Afro. Otter - I do get on Facebook.  Is there a group which you have all joined?  And yes, I'll be #19!  I'll send you a PM with my info, add me as a friend then I'll find the group.  There is life beyond chemo/cancer and I am glad will be glad to learn about what's happening with everyone there.",
      "MessageIndex": 5228,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 9, 2009 07:45AM robink wrote: Up at 5 am to have my devos, enjoy a cup of coffee, do my stretches before needing to leave at 6:30 to get to work.  Trusting each of you will have a good day and a peaceful week. TTFN",
      "MessageIndex": 5274,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 10, 2009 01:41PM robink wrote: Otter, speaking of sisters who haven't posted in a while - I saw on FB your pictures dedicated to Alaska Deb.  When I first started on this thread I think I recall her moving on to rads but it sounds like she's moved on from this life.  Is that correct?",
      "MessageIndex": 5295,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 10, 2009 03:16PM - edited Mar 10, 2009 03:17PM by robink Jen-when I was back in Columbus when Mom got injured it was COLD and wet the entire time.  I grew up in Ohio and know the pleasure of those warmer winter days.",
      "MessageIndex": 5300,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 19, 2009 01:48AM - edited Mar 19, 2009 03:51AM by robink Good morning All, My appt. with my onco went well, don't have to return for 4 months. He said the good news about muscular and joint pain caused by Femara is research indications decreased risk of recurrance for those with higher side effects. For now the Femara stays in my daily routine and Ativan at bed time. The yoga DVDs were delivered yesterday but I didn't have time to preview any of them.  I worked the 5-10 shift, left the clinic at 11:30 pm, got home after midnight. Too tired to give a rip.  Later today I'll put one in the DVD player. So I asked my onco about what he considers the one year mark.  He counts from the date of invertention (surgery).  Based on that thinking today is my one year point.  March 18, 2007 I had my lumpectomy/breast reduction.  Of course, had I know what was to come in the final pathology report I would have gone for the mastectomy and not messed with the other.  No celebrations here, just the recognition of what has past.  I will celebrate at the 5 year point. Those of you who drink the purple juice, do you get the original or the active?",
      "MessageIndex": 5434,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 20, 2009 02:24AM robink wrote: Gracie - Sounds like a lovely day of fishing.  Makes me hungry for some Rainbow Trout. DH and I go to some of the mountain streams about an hour from our place.  It is so relaxing to me. Last year I didn't have the strength and am looking forward to getting my 2009 fishing permit and heading out. Kerry - GoGoGoAway UTI Be Gone.  My onco tried me on Effexor for the hot flashes, the med made me nauseous. Accunpuncture made a big difference - the heat waves are almost gone!  I am still on Lexapro, the med he switched me to after failure on Effexor.  Today is our appt. with the CPA.  Used Turbo Tax for DD/DS but ours is a bit too complex for us to deal with.",
      "MessageIndex": 5449,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 22, 2009 10:24PM robink wrote: Hi Gals, Today is my 3rd shift of 4 then I have 6 days off.  DD coming home Thursday for her college Spring Break!  DH and I had a lovely dinner at Texas Roadhouse after work, now I've got my feet up and am catching up on the posts. Eddie- I started Femara in Oct.  Initially I experienced crippling fatigue and generalized muscle/joint pain.  The fatigue gradually cleared (or maybe I got used to it). The joint pain has settled in my leg knee/hip. It never goes away but is manageable when I take Tumeric daily, sometimes Ibuprofen 800 mg is needed but not every day. Lately I've been experiencing left thumb pain, it's a burning in the joint and it is swollen, Glad I'm not a leftie. The rain/snow/monsoon sounds wonderful.  Our forecast shows a possibility of rain Moday, snow later in the week. Randie - I can't remember if I woohooed you re: low counts and no more chemo, if not woo double hoo!  Short term memory issues...it is a function of long term chemo brain?  At 53 I don't see myself as old, although sometimes I move like my 82 year old mother. RK",
      "MessageIndex": 5491,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 22, 2009 11:23PM robink wrote: Jen - seriously look into accupunture.  I was very sceptical (sp?) but it worked and I have very few now. RK",
      "MessageIndex": 5493,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 6, 2009 08:38AM robink wrote: I remember Chatty Kathy - one of my sister's had her. Karin you are so right about the catching up - I see it would take many days to do that and probably not get too far anyway. For me it's been 1 year since my diagnosis.  The anniversaries of my surgeries are upcoming.  The celebration will be in the joys discovered during this journey.  I'll mark the days similar to how I mark my children's height on the wall and move forward.  There is no more anger for me, just reflection. Currently my treatment includes Femara, Lexapro, Synthroid and sleep aids.  I've added supplements of Tumeric, Vit. C, and a power juice (Acai, Mangosteen, Pomegrante,Goji).  Complementary therapies include Accupuncture (a significant decrease in hot flashes with this), Yoga (helping very painful tight muscles), and massage (have always loved this before and after cancer). After a 5 month LOA I returned to work August of 2008.  At first the exhaustion was crippling.  I remain regularly tired out of proportion to the events of the day but figure this is just the way it will be. Working part time is what I need. My relationship with my DH is better than it has ever been.  He has been so kind and accepting of me in every stage of this adventure.  One more revelation is the treasures in family, friends and life that were uncovered by me over this past year.Truly I am blessed! That doesn't mean there haven't been bad days-there certainly have.  But just like during chemo when I thought I wouldn't get through, I was wrong!  I look forward to this time with you all again!",
      "MessageIndex": 5222,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 27, 2009 05:31PM - edited Mar 27, 2009 05:45PM by robink Karin. Rock, Angels, Kerry : Be on the look out for something in the mail. Everyone else: I'm glad it brought a smile to you Except for you Tex (don't have your address) ------------------------------------------------------------------------------------------------------------------------------------------ HUGS to you Otter. We do understand. Happy 25th Angels. Karin: a friend sent me an email with the bear pole dance.  Quite funny. Kerry: is the new boy friend working out for you? Cristine: I have that cold you've been fighting off.  Hope you've managed to keep it away. Rock: you'll have to set aside several days to read/watch all the interesting forwards/emails  you couldn't pull up in South Africa, once you return to NYC. Julie: glad things seem to be improving for your father. Anyone: explain the shovels to me. Everyone: Happy Weekend. DD is home for her spring break, the snow from the blizzard is melting, we are going out to dinner, the wash machine is going nonstop as she plows through her mounds of laundry and I am happy. Love, RK",
      "MessageIndex": 5578,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 3, 2009 10:15PM - edited Apr 3, 2009 10:15PM by robink There's been some good stuff and shitty things on the posts this week. I haven't known what to say to anything so I've kept my cyber mouth shut. However - I have LOVED having DD home this week.  We've had wonderful times with movies, eating too much, massages, chats, and simply \"hangin out\" in peaceful silence. I will miss her more than ever after she goes back to college Sunday but my heart is full with love for her. SUE, FAMILYROKS, JEANO, EDDIE, ROCK, LEWING, ANGELS, GRACIE, OTTER, KRISTY, JEN, JULIE, CRIS, RAND, KARIN, KERRY, ROXI, ELLENOIRE, TEX...been thinking of all of you more than ever this week. Love, Robin K",
      "MessageIndex": 5672,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 12, 2009 11:36AM robink wrote: Good Morning to all of you - Just wanting to wish all of you a grand day. RK",
      "MessageIndex": 5346,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 5, 2009 09:08PM - edited Apr 5, 2009 09:21PM by robink Julie - I was clueless about Burma Shave, googled it and wanted to share my find with you.  Rock is the creative one. I didn't realize Rock's last post was a link.  Thanks Rock. I've just read all the jingles from 1955, the year of my birth. The experience put a number of smiles on my face.",
      "MessageIndex": 5713,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 20, 2009 07:40AM robink wrote: Karin - 20 mg Lexapro.  For the past 2 weeks I cut myself back to 10mg.  Realized the past few days I have been weepy, sad, brain scatter and now that I think back on it an mild increase in the heat waves..  The self weaning process was the only change to I went back to 20 mg today.  Think I'll try again when I can be busier outside and enjoying spring/summer. Otter - good news about EyesOTex. Gotta go get our taxes done.",
      "MessageIndex": 5452,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 20, 2009 12:11PM robink wrote: Hi Girls, Today I bought myself the pair of slippers that didn't get checked off on my presurgical check list last year. They are cummfy. RK",
      "MessageIndex": 5454,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 12, 2009 10:53AM robink wrote: Jackie - you are our Easter miracle!  Thank you God. Otter - I could smell the lilacs My step-father, a saint who takes care of my mother who has had 2 strokes and is recovering from a broken hip, a man who had a stoke in 1986 and has limitations due to that stroke, was attacked from behind on Friday.  The asshole knocked him to the ground twice, stole his wallet then ran off.  A stranger found my dad and helped him home.  A neighbor found his wallet near a sewer opening, the only thing missing was $30. Although he is VERY sore, he has no serious injury and his wounds are healing well.  The attacker took something that can not easily be recovered: peace of mind.  Don is afraid the man will be waiting for him, fearful that the man knows where they live and will come for him. My mother is so worried that they will have to move.  Truth is they do need help that the family can completely give. Pride stands in the way of accepting outside help such as a home health aide. As always by one brother and three sisters  have circled the wagons and handled this current crisis.  Living so far away is terrible for me.  My folks weren't supposed to get old. Every other week I have 6 days off in a row so I'm planning a trip home ASAP. DH is supportive. The weather here for Easter weekend is usual.  Today we have seen snow, fog, rain, sun and wind. DH and I are greeters at church in the morning. Think I'll stand away from the doors so my toes stay warm. A Blessed Easter to all RK",
      "MessageIndex": 5791,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 22, 2009 09:05AM - edited Mar 22, 2009 09:27AM by robink Krin - nose hairs and pesky little chin hairs.  Need the big bad wolf to scare them away.  The hair all over my body was coming in strong until Femara was added to my diet.  For a while I used biotin and noticed an improvement, ran out and have been too lazy to walk down that isle at the store.  This past week I noticed the hairs \"down under\" to be sparse and sgraggly so yesterday I gave them a trimmy trim trim. Wonder how Deva products help there? Somebody tell me about the Group CD...",
      "MessageIndex": 5477,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 26, 2009 05:22PM robink wrote: Dana- one for us two for you, one for us two for you ...xanax that's what I'm referring to.  I checked out your daughters web site. She has some nice photographs. Jen - my favorite styling product is a Paul Mitchel moose, yep doesn't take much.  I rub it through with my hands and tossle my hair. Always have to do something with the pesky curls on my forhead that won't behave. Noelle - I bought the devacurl products, like the loopoo (I'm very oily) and the one condition.  Don't care for the lack of hold the Angel product has.  I've used little, medium and large amounts. The end result is the same.",
      "MessageIndex": 5561,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 22, 2009 12:49PM robink wrote: Jen - I'll be in Columbus.  That's where I was born and grew up, moved to Colorado in 1981.",
      "MessageIndex": 5946,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 22, 2009 06:31PM robink wrote: Jen- I will make the time to get together with you! Right now it's looking like May 6 or 7 will be best. Check your planner to see if one of those days works for you. I'll PM my cell phone number.",
      "MessageIndex": 5948,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 26, 2009 08:15PM robink wrote: Don't ask me why but today I felt the need to go through the notebooks I had been given during my cancer year.  Catharsis I guess. Read through the paper copies of my pathology reports, reviewing the statistics from my onco re: recurrance, looking back over the list of options given me then and wondering what I would do differently.  But in things like thing there are no do overs and I am satisfied that each decision I made was the best for ME at the time. Anyway, during the reread of my 2008 cancer notebooks many thought flooded my mind on many levels.  One rambling thought is below.  See you next year. Sorry -You need to come back for a diagnostic- I don't like the way it looks- It's cancer. The MRI can't be done for at least two weeks- Stop using your HRT immediately; Call this doctor ASAP;  Breast Cancer is not an emergency - you have time to think through your decisions rationally.I'm sorry ma'am we can't see you for two weeks; The surgery went well...I think I got it all.  Mom - I have to talk to you - I have breast cancer, too. You need another surgery; It's like you're pregnant with cancers waiting to be born. Oncotype; Hormone Therapy; Chemotherapy; Lumpectomy; Breast Reduction; Physical - emotional - spiritual pain.  Mom, isn't there another way? Mastectomy; Only one drain; Misshapen and bruised;  Portacath; Infusion Center; Taxotere; Cytoxan; FMLA; LOA;  Call Center Closing; You're not protected anymore; Zofran; Decadron; Compazine; Ambien; Ativan;  Mouth Sores; Magic Mouth Wash; Germophobic; Don't stand to close; Don't shake my hand; Hair on pillow; Hair in hand; Wig on a stand; Headcovers.com; Dangling earrings; Why did she cut her hair so short and dye her hair gray?; Looks of pity; Looks of relief; You remind me of my mother and it is hard to look at you;  Chemo Brain; Fatigue; Muscle and Joint Pain; Out of control emotions; Unable to feel emotions; Blood counts good; Why do I feel so crappy?; Aromatase Inhibitors: Hot Flashes, Old lady skin, Thinning hair -I just got it back, muscle and joint pain, fatigue, it's only for 5 years; 1st mammogram looks clear- See you next year.",
      "MessageIndex": 6016,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 6, 2009 11:23PM robink wrote: Oh Jen, you didn't seem nervous.  I enjoyed all of our conversation! Thanks for posting the picture.  The one I have is identical so no point it adding it to this site. We look wonderful! Julie, while we would not have purposely chosen to join this group I am so very glad we found each other.  We have 20 different yet similar stories - each intertwined with like experiences, each progressing at different levels - each filled with hope for a future apart from this disease - each strengthened by one another.  It is humbling to represent our delegation with Jen in Ohio. Happy BD Adrienne! Randie-I read an interesting article about plueral effusion and the prodedure you had on the plane ride to Ohio. You seem to be coming along better than the average pt. described. Yay for you! Jen - did you actually return the Jag? It's so easy to get spoiled. The truck driver comment stil makes me chuckle. Could you imagine someone falsely posting on a site like this and then arranging to meet with one of us? Definately would call for the shovel brigade. DD gets her wisdom teeth out in the AM, DH has to take care of her.  The appt. was made before my Ohio trip was planned. She doesn't have a high pain threshold so DH should just keep her drugged over the next few days. Night all - sleep well",
      "MessageIndex": 6142,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 7, 2009 09:39AM robink wrote: Noelle - here's the truth for me.  I use the lo-poo and the one condition, like the products, only \"shampoo every 3 days using the conditioner on the other days. Have used the an-gel but do not like the way it leaves my hair feeling, and it takes my hair hours to dry when I use it (large, medium or small amounts of product). I agree that if I had it with me here in Ohio there would be no frizz but it's not and I'm spraying my hair with firm hold spray my sister has. Yesterday the humidity took my forehead curls to the stage they were trying to curl toward the center. There was a little girl who had a little curl right in the middle of her forehead. When she was good she was very very good, but when she was bad she was horrid.",
      "MessageIndex": 6146,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 7, 2009 10:38AM robink wrote: Jen, I like the idea of meeting up in June. The dates that will work (since it's a wedding trip) is June 29 or 30. Perhaps if we find a meeting point Julie or Jackie could join us.  It would be a longer road trip so you'll need to borrow that Jag again Today I take Mom to a procedure where her back will be injected with steroids/pain killers.  It will be done under sedation. Tonight all the sisters, nieces and the matriarch of our family will go out for dinner. Let's hope Mother will be awake enough to participate. Originally her procedure was scheduled for 9 am, it's now being done at 2.  Certainly it will be interesting. She will be so disappointed if she is too out of it to join us. Max and Erma's - woo hoo!",
      "MessageIndex": 6147,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 26, 2009 03:54AM robink wrote: Hello Friends/Sisiters/Fellow Soldiers Today is Memorial Day - a time set aside for remembering the sacrifices made by members of the armed forces.  I salute each one - living or dead - from the Army, Air Force, Navy, Marines, Coast Guard - and I thank them.  I also thank the families and friends who have supported the service members. Today I also think of us as soldiers in the fight against breast cancer - remembering that for some of us the battlefield is behind us and we are moving on, yet others are still fighting actively.  I remember each of you and commemorate the sacrifices made.  A heartfelt gratitude goes out to the friends and family members who have been our supporters! Love to you all, Robin K",
      "MessageIndex": 6264,
      "PostDate": "26/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Oct 12, 2012 12:42AM robink wrote: Otter, Tell me about the Genie bra. My ears perked up when you mentioned a pocket. I am tired of being uncomfortable and am curious if you would recommend that product. RK",
      "MessageIndex": 7613,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 11, 2008 05:16PM robink wrote: You can and will get through this- because you have to.  You will be the same person, just with different landscape.  Surround yourself with a good support system.  Allow yourself to feel the loss but do not let it consume you.  I've just prayed for you and trust you'll be filled with peace and calm.  You are giving yourself the gift of your future!",
      "MessageIndex": 1,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703818",
      "Title": "surgery scheduled for next Friday kaye45 southernchick"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 11, 2008 05:29PM robink wrote: Being scared doesn't make you a failure.  Thank God you found a site such as this and had to courage to share how you feel.  Know you are not alone. ",
      "MessageIndex": 3,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703818",
      "Title": "surgery scheduled for next Friday kaye45 southernchick"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 12, 2008 09:09AM robink wrote: Good Morning Kaye, I was just thinking of you, hope you rested well last night and that your Saturday will bring you joy in some way.  Blessings...",
      "MessageIndex": 5,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703818",
      "Title": "surgery scheduled for next Friday kaye45 southernchick"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "May 23, 2008 11:01AM robink wrote: My luck with Paula Young was not as good as yours LAG.  The shippment came in yesterday.  One of them I got the color completly wrong and the other was \"just not me\". I am glad for their liberal return policy. Before I lost my hair I purchased a Raquel Welch wig that is attractive but a bit too poofy on top.  There is a local salon that cleans and styles wigs for free so though I'd give them a try.  It will either help or I'll donate it to the American Cancer Society. I did have a human hair wig fashioned for me and it is very similar to my pre-bald days.  Biggest difference is the lack of gray.  Guess if it bothers me that much I can have some subtle highlights put in it.  Insurance paid for this (but not the highlights of course.  Vainty and pickiness comes out of my wallet) This week I tried on a Noriko wig, loved the silkyness of the hair and the feel of the wig cap. May try that just for fun.",
      "MessageIndex": 11,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705965",
      "Title": "wigs and hair loss mizz jdg1"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Mar 4, 2009 09:56PM robink wrote: priz- way to jump back in with both feet.  At Urgent Care we've been swamped with RSV, flu, over low from Peak Vista - many record setting days.  Since I returned to work last August (4 weeks after my last treatment) I have never stopped being tired but it has gotten better.  The exhaustion at first was almost incapacitating.  In October I started taking Femara which presented another set of side effects for me but I am coping.  I join you in applauding those who continued to work during chemo.  Hello to all the other gals on this thread.  I think I may have posted here long ago but had to make a clean break for a while, so much so that I forgot my user name and password.  My 1st anniversary as far as diagnosis has past, surgical anniversaries up coming.  Reflection is my state of mind right now and I'm grateful for my life.  Not that I would want to relive the past year however I have been blessed in many ways and uncovered many treasures that I may not have recognized if it weren't for this journey. Rest well tonight",
      "MessageIndex": 195,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 16, 2008 03:28AM robink wrote: My surgery was April 7th and I think the worst of the pain has been as a result of the drain.  Glad it is only one.  Fortunately the output is low and it will come out Thursday!  I've been advised to take a pain pill prior to the appointment but have been reassured by what I've read on this site and am expecting no discomfort.",
      "MessageIndex": 30,
      "PostDate": "16/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696011",
      "Title": "How Long Was Your Drainage Tube In? SueB46 Tina337"
    },
    {
      "AuthorID": "robink",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65365/profile",
      "Content": "Apr 18, 2008 10:08AM robink wrote: It's gone!  After 10 days my beloved drain is in a biohazard bag in my doc's office.  As advised, I took Percocet before the appointment and my dh was holding my hand for support - a little tug - an odd awareness of something moving within my chest - and it was gone!  No Pain - no need for anxiety. Just one more step forward. WooHoo! ",
      "MessageIndex": 33,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/696011",
      "Title": "How Long Was Your Drainage Tube In? SueB46 Tina337"
    }
  ]
}