{
  "AuthorID": "Robin_Brook…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
  "Posts": [
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Dec 29, 2012 11:10AM Robin_Brooke wrote: You can get the signature through your profile I believe",
      "MessageIndex": 2,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 24, 2013 08:11AM Robin_Brooke wrote: I was given 100% aloe by my RO and so far so good at 9/28 treatments. Can't beat free. Carolyn I had to laugh at the SE paranoia, I've had/got it too, lol. Sometimes I just need to breathe and relax and quit psyching myself out!",
      "MessageIndex": 47,
      "PostDate": "24/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 28, 2013 07:53AM Robin_Brooke wrote: Right now I'm at 12/28 rads and only using aloe vera 3x a day and getting pretty pink. I try not to wear any sort of bra and use a cami with shelf bra when needed. I'm a D so it's not the best arrangement but I don't like the rubbing against the skin where the rads are hitting. Does calendula help take some of the heat out? Whats the purpose behind it? Sita, I am left side as well. Breath hold is especially helpful for us to pull the heart down and out of the way. If they didn't teach you how to do it ask. I take a super deep breath and hold it while the machine runs then let it out and repeat for the next one. It doesn't spare your heart completely but does lessen how much gets hit. I hope this helps.",
      "MessageIndex": 55,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Jan 11, 2013 09:52AM Robin_Brooke wrote: I haven't heard from anyone on the Calypso system but from reading up on it looks pretty damn impressive! I'm happy you finally have dates for your rads. I just want to get this next treatment portion rolling. I started tamoxifen on the 9th reluctantly. Reading about the se's on this drug kinda flip me out but we'll see how it goes...keep ya posted. My MO offered to have me wait but after explaining many of the common se's and realizing I already am having many of them I figured if I waited I might end up feeling normal (ish) and never go on it.",
      "MessageIndex": 8,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Jan 29, 2013 07:10AM Robin_Brooke wrote: Did my simulation and got my tattoos yesterday. I should find out what my plan is in the next week or so, but she told me to expect about 5.5 weeks. I will be doing breath hold and my RO was very pleased with how that looked on the scans. Side effects down the road worry me more than the immediate but I guess I'll cross that bridge when I have to. Hope you all are well.",
      "MessageIndex": 13,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 1, 2013 05:49PM Robin_Brooke wrote: Hot flashes have been better on tamoxifen for me, although moods still seem to be out of whack. I sure miss feeling somewhat \"normal\"!!!",
      "MessageIndex": 16,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 15, 2013 06:51PM Robin_Brooke wrote: Carolyn, I think I'm spelling it wrong and I looked for it too, but I know that's what they call it. Looks like a mesh rectangle that covers the area to be treated so it gets super radiated. It was explained to me as to how it works, but when I go back Tuesday I will try to remember to ask about the spelling. My RO did tell me yesterday to be sure and use the aloe behind my shoulder as far as I could reach because there will likely be exit burns eventually from the clavicle area being radiated...passes right through. Lovely stuff!",
      "MessageIndex": 34,
      "PostDate": "15/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 21, 2013 06:11AM Robin_Brooke wrote: Sorry Shianne, that has to be feeling very stressful. Hopefully they will be good at monitoring your skin but it sounds like you're doing everything you can to prepare. I asked my rad team about the bolus again. In regular medicine a bolus is a delivery system for medicine. What the term means at SCCA is a little different. She told me that radiation likes to penetrate to a certain depth, by laying the bolus over me it \"tricks\" the radiation into staying more surface. So it's laid on me during my first two zaps and then taken off when they do my collar bone area. As an example, if radiation would normally penetrate two inches with the bolus it penetrates 1/3 of that distance.",
      "MessageIndex": 38,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 21, 2013 09:09AM Robin_Brooke wrote: I think it may be specific to SCCA and using the Calypso system they pioneered. They also use GPS sensors on my chest during the treatment to monitor my breath hold.",
      "MessageIndex": 40,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 5, 2013 04:16AM Robin_Brooke wrote: Wow! Congrats to you on the book Sickofpink! Very cool. I've also heard any SE are cumulative and depending on many factors, such as activity level and skin readiness, some women hardly have a problem or often not until the end or even after. Here is to hoping we all come through with flying colors. Carolyn, I would ask your RO but I've gone through some of the other posts in the rads section here and there are some really good suggestions. I think personally I will try to use as much chemical free as possible like aloe or coconut oil. My sister in law went through rads a couple years ago and what felt great for her (very light skinned) was to use a cold pack or small bag of veggies as soon after as possible to draw the heat out. Probably will try that too.",
      "MessageIndex": 22,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Jan 11, 2013 05:47AM Robin_Brooke wrote: Queenkong you are going back on chemo or getting ready to start it? Swgeewi how did you scans go? Rads all set up?",
      "MessageIndex": 5,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 8, 2013 06:03AM Robin_Brooke wrote: I got the call from the scheduler yesterday afternoon and am starting radiation today. I'm a little nervous because its an unknown, but I'm sure it will all go fine. 28 days with a possibility of 5 boosts. How are the rest of you doing? Anyone doing the breath hold technique?",
      "MessageIndex": 23,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Feb 13, 2013 07:44PM Robin_Brooke wrote: Breath hold technique is used to pull the heart down and out of the way during radiation. How it works here is you go to a simulation where they take X-rays both holding your breath and not to see the positioning of the heart, some people's hearts are already sort of out of the way. They but GPS transponders on your chest and take latitude, longitude, and lateral measurements at each treatment to precisely fix the beam of radiation and lessen the risk of any collateral damage. Pretty nifty really. They're also using a bollus (sp?) to maximize the radiation on 2/3 areas targeted.",
      "MessageIndex": 28,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Mar 4, 2013 06:27AM Robin_Brooke wrote: Sita, I was told not to use anything with alcohol in it and as great as it is Aquaphor has alcohol. I was given 100% aloe gel to use and if things go south they will give me a steroid cream to use. I think the Aloe is by Nature's Garden brand but I'm sure there are others available. You should ask your rad techs about breath hold, mine do the markings during one before they start so they know when I am correctly matched up and they can start the beam. Mine is dose dense too though, maybe yours isn't and that's why they weren't as concerned?",
      "MessageIndex": 58,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Jan 14, 2013 11:54PM Robin_Brooke wrote: Hi Josie and spookiest mom, I hadn't heard that about rads. I have not gotten a flu shot, although I did ask my MO about it in the fall to see if I should have one. She said it was up to me but not more necessary for me than anyone else. Have you asked your RO or MO about getting the flu shot?",
      "MessageIndex": 11,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Robin_Brook…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166162/profile",
      "Content": "Jan 8, 2013 01:26AM Robin_Brooke wrote: I could see stress as just one more component or factor, maybe a catalyst too though. Stress does hinder our immune systems from working effectively. I could see stress wreaking enough havoc on our systems that allows those cells to go nuts, but it would all have to coincide with other potentially unknown factors as well. I've done genetic testing for BRCA 1 & 2, also the lessor known link that hits Askenhazi Jewish and Native American women, and additionally participated in a study that looks at 25 more possible genes and ALL of them came back negative. This tells me my BC is more environmental than genetic but I still think there has to be a bit of both...a perfect storm for it to grow.",
      "MessageIndex": 17,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798481",
      "Title": "Did having a stressfull life cause your breast cancer? new2bc Bren-2007"
    }
  ]
}