{
  "AuthorID": "Robin-Kaye",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
  "Posts": [
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Dec 1, 2010 04:21PM Robin-Kaye wrote: Paula- Please keep us posted on the Eribulin. As a next step for many of us your info willl be valuable to us all. So happy you got some good from the Ixempra, hoping Eribulin is gentler on you. Much love.",
      "MessageIndex": 20,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761223",
      "Title": "On to Eribulin PJB K-Lo"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Oct 20, 2010 07:45AM Robin-Kaye wrote: I take one Senna at night before bed and when I get up in the morning I'm ready to \"go.\" I do this regularly now since having severe bowel lock from the narcotics I take daily. After that experience, I'd rather have a little cramp in the morning before going and be done with it. Oh the shit we deal with ;)",
      "MessageIndex": 11,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759610",
      "Title": "Bowel Blues bopeep bopeep"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Feb 9, 2011 07:17PM Robin-Kaye wrote: Hello Halaven ladies, I'm having horrible liver pain and had a CT scan yesterday which I'm certain will show growth and that Ixempra's stopped working for me. Halaven was going to be my next tx. I haven't had Adriamycin this time around and was wondering if anyone thought I should try that first or if you have a lot of confidence in Halaven? Thank you for any information.",
      "MessageIndex": 195,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Feb 10, 2011 10:21PM Robin-Kaye wrote: Well, it's official. Scans showed liver tumors doubled in size so I'm done with Ixempra and start Halaven Wednesday. I asked my onc about other chemo choices but she has the most confidence in Halaven, which gives me some confidence too. Although it's hard to feel much hopefulness after getting bad scan results. I'm so grateful for your posts and have read them thoroughly. Hoping for positive results for all. Love and hugs.",
      "MessageIndex": 197,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Dec 11, 2009 04:40AM Robin-Kaye wrote: What a wonderful Christmas gift for you and your family! Thanks for sharing!",
      "MessageIndex": 15,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745179",
      "Title": "good news from CT scan jmar19 Robin-Kaye"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Sep 23, 2010 05:20PM Robin-Kaye wrote: So happy for you! The words we all hope to hear...I'm celebrating for you :)",
      "MessageIndex": 24,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758405",
      "Title": "Happy Me ....... NED!!!!!!!!!!!!!!! JeninMichigan clemson93"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Robin-Kaye wrote: I'm new to this board or any board. Since my original dx 5 years ago I haven't felt comfortable enough at any site to post questions, but I feel very at home here after reading many, many of your posts. Since my mets and stage IV dx, I have so many questions and am hoping some of you may be able to help. I'm having a really hard time right now, really scared and depressed. I just had my 3rd taxol/avastin and my hair is coming out in clumps. It sounds ridiculous with everything else, but being bald again really depresses me. My oncologist told me I would stay on this treatment (if it's working) until it stops working so I guess that means bald is the way I'll stay. I was on tamoxifen then femara prior to my mets and obviously they stopped working so that isn't an option for me anymore. I'm most worried right now that this treatment isn't working. My oncologist told me after 2 to 3 weeks I should feel excruciating pain in my liver area if it's working. Well, I haven't, so that's sent me into extreme fear mode. It seems like most of the positive reactions to treatment are women who are HER2+, which I'm not. Has anyone had a good response to this treatment who is HER2-, ER+ PR+? I'm on LTD and just confirmed a trip to Africa with my daughter for November and now I'm worrying this chemo isn't working...any information would be so appreciated.  Dx 8/16/2009, IDC, 2cm, Stage IV, Grade 3, 3/15 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741157",
      "Title": "Liver, lung, bone mets treatment questions Robin-Kaye mthomp2020"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Sep 30, 2009 02:19PM Robin-Kaye wrote: Thank you for your responses. I feel so much better today after reading them. I'm normally pretty positive, but the fear does get me every now and then. My daughter and I have wanted to take this trip for so long so it means a lot to both of us. I will share pictures when we return. Thank you again for the support. I'm glad to have found this board!",
      "MessageIndex": 6,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741157",
      "Title": "Liver, lung, bone mets treatment questions Robin-Kaye mthomp2020"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Robin-Kaye wrote: From everything I've read here and elsewhere, I was expecting a smooth ride with Gemzar with few to no side effects. I tolerated Taxol well, with fatigue the only side effect, but it stopped working, so yesterday was my first Gemzar and it was awful. I felt almost as bad as I did on Adriamycin my first time around. I'm not sure how I feel yet today, but I already have the headache and my body feels like I ran a marathon yesterday. Anyone else out there have negative se's with Gemzar? Dx 8/16/2009, IDC, 2cm, Stage IV, Grade 3, 3/15 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749384",
      "Title": "Feeling terrible after Gemzar Robin-Kaye PJB"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Mar 6, 2010 10:29AM Robin-Kaye wrote: I did get the decadron pre-med, but none of the others. I will definitely talk to my onc about this. Thanks so much for the information!",
      "MessageIndex": 3,
      "PostDate": "06/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749384",
      "Title": "Feeling terrible after Gemzar Robin-Kaye PJB"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Oct 12, 2009 09:15AM Robin-Kaye wrote: Hi, I'm fairly new to this forum so this is probably a silly question, but what is A/C? I had adriamycin my first go round with bc if that's what it stands for. I'm just wondering because I, too, am hormone positive and HER2-, and my onc started me on taxol and avastin for my mets. I'm wondering why an onc chooses one tx over another. When I hear something is working for someone I wonder why I'm not on that? Any information is appreciated.  ",
      "MessageIndex": 13,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741751",
      "Title": "Want to hear from Stg IV BC re: Plan of Care activern activern"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Feb 19, 2010 12:48AM Robin-Kaye wrote: When I first asked my oncologist to do her part for the accelerated death benefit, I had just had a good scan and she was hesitant, I asked her to just write something general like, \"mets to the liver have an average life expectancy of 1 year,\" and to put down my stage IV status. I received my benefit and bought my 21-year old daughter a small house so she will always have a home and not have to worry about where she'll live and how she'll afford it, since I live with my fiance and don't have a home for her. This has given me such peace of mind. My most recent scan was not good, so I'm glad I did it now and have one less stressor on my plate. I also cashed in my 401K and paid normal taxes for it as if it were additional income on my tax return this year. The accelerated death benefit according to the IRS agent I spoke with is not taxable. Best wishes.",
      "MessageIndex": 46,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Oct 30, 2009 08:51AM Robin-Kaye wrote: 34 Stage 2 39 Stage 4",
      "MessageIndex": 311,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Sep 22, 2010 12:20PM - edited Aug 20, 2013 05:47AM by Robin-Kaye 34 at original dx, and 39 when dx Stage IV. I have a 21 year old daughter and she was told to start getting mammograms 5 years prior to my original dx. Praying she does. Hoping I'm here to remind her :)",
      "MessageIndex": 555,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Feb 23, 2010 12:51AM Robin-Kaye wrote: My policy was a private policy through Aflac, not through work. I can no longer get my work life-insurance since I'm not working and probably won't return.",
      "MessageIndex": 50,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Nov 28, 2009 01:30PM Robin-Kaye wrote: I'm sorry to hear you're going through a rough patch. You have a great, fighting attitude; hang in there! I don't know anything about lxempra, but I was wondering how long Taxol worked for you? Thanks, and best wishes.",
      "MessageIndex": 1,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/744611",
      "Title": "Starting Ixempra Squirrel62 Squirrel62"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Apr 15, 2010 11:00AM Robin-Kaye wrote: I had mild constant pain under my right rib, and intermittent severe pain in what I assumed was my gall bladder which turned out to be mets to my liver. Best wishes.",
      "MessageIndex": 2,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751309",
      "Title": "question for all with liver mets. skigrl Wally333"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Mar 26, 2010 01:50AM Robin-Kaye wrote: I had a CT scan recently to check the status of mets to my lungs and liver, and nothing else showed up. I was having neck pain, so my onc sent me for an MRI which showed mets to my spine and neck. MRI's show more than scans. The pain in my neck from the mets varies, one day it's awful and the next it's barely there. I hope it's not mets to your spine, but this is the only relatable situation I can share with you. Hugs and hope to you.",
      "MessageIndex": 1,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/750290",
      "Title": "question about metastatic lesions on spine Mercedes57 33skidoo"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Oct 6, 2010 04:06PM Robin-Kaye wrote: I get this pain and it is debilitating. I have to stay in bed for about a week and keep myself heavily medicated even resorting to Morphine. My oncologist told me mine was known as a \"liver-bleed\" due to the tumors in my liver. I also have severe right shoulder pain when this happens which is an indicator of internal bleeding. After my last liver-bleed my CT showed growth in my liver tumors. I certainly hope this isn't the case for you, but I believe you said your scans were clear. Best wishes for relief soon.",
      "MessageIndex": 11,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758802",
      "Title": "Unusual Pain GoldenEyes SunDiego"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Sep 15, 2010 10:51AM Robin-Kaye wrote: Small world...I have a friend in Georgia who is also friends with Kelly and asked me to vote for her last week, which I did. Hope she wins, she was ahead last week when I voted. :)",
      "MessageIndex": 10,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757992",
      "Title": "friend with cancer...look! kduling clemson93"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Oct 11, 2009 09:04AM Robin-Kaye wrote: I come to this forum for information on other's treatments and experiences and have found it very helpful and informative. I also come to this forum when I'm scared or having a bad day because I know that there's no one that understands my feelings like the women on this board. There are other forums that may not be as depressing for you, or maybe you could start one for positive comments only. I don't want to feel bad if I have medical questions that honestly many women here answer better than my doctor! Or if I'm having negative feelings and just need some support, which honestly is when I come here. On my good days I'm usually enjoying life and not sitting on this computer!  I find great comfort here and just wanted to thank everyone for this forum.",
      "MessageIndex": 6,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741900",
      "Title": "get together on this zeeka71 allalone"
    },
    {
      "AuthorID": "Robin-Kaye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90076/profile",
      "Content": "Oct 20, 2010 03:38PM Robin-Kaye wrote: So happy the Ixempra did its job for your wife! Enjoy and celebrate this wonderful news! Wishes for a long journey with NED :)",
      "MessageIndex": 21,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759591",
      "Title": "NED! SeanE texasrose361"
    }
  ]
}