{
  "AuthorID": "Robyn_S",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
  "Posts": [
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jan 15, 2012 01:52PM Robyn_S wrote: Hi Veronica, I had 3XFEC then 3XTaxotere from May 2011. The FEC part is nauseating and it helps to take all the anti-nausea meds on schedhule rather than waiting to feel sick. The Emend works quite well and the whole 3 treatments I did not throw up. A headache is common with Emend and constipation can be a common problem - eat very lightly before Tx so the gastro block feeling is not too bad. After the first FEC Tx I followed a fasting protocol before and after Tx and never had the gastro block problem again. Taste and smell issues were also a problem that resolved after the first week.  Drinking plenty of fluids after Tx is also important to flush the chemicals out. Using warm water to rinse down below for the first week after toileting will prevent soreness -especially important after Taxotere which is very irritating! I took L-acetyl Carnitine (3X1000mg daily) to help prevent peripheral neuropathy from taxotere and it worked for me - no tingling or numbness and did not have any nail issues. Taxotere is very fatiguing  - you will feel like you have flu aches and pains from day 2/3  after Tx for about 5 days. But not as nauseating as FEC and I did not have Emend with that  - maxolon was enough to keep the tummy settled. I am lucky as I have recovered well - 2 inches of hair and most of my energy back! But importantly no side effects lingering on- I was paranoid about neuropathy as it was not really pointed out how common this SE is with  the Taxanes. I kept well away from sick people - use alcohol hand wash a lot! Never had an illness and blood counts were all close to normal all through Tx.  Good Luck! :) Robyn",
      "MessageIndex": 4,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781036",
      "Title": "Have you had the FEC -D protocol? VeronicaX VeronicaX"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 16, 2011 07:14PM - edited Aug 16, 2011 07:16PM by Robyn_S Hi everyone - I researched what is available to prevent chemo induced peripheral neuropathy before starting taxotere (~70% of patients may experience CIPN on taxotere/taxanes) which has a reputation for causing the numbness, tingling etc (CIPN) that in a smaller percentage of cases can be permanent. I have just completed 3/3 taxotere (3 weekly) and have been taking 3 X 1000mg Acetyl L carnitine since day 1 (though I do cut down to 2X 1000 mg day in the last week before chemo as it can be a bit nauseating at high doses). I have had absolutely no neuropathy and will continue to take it at least 4 weeks post my last taxotere (yesterday!!! yay!!). Maybe I am in the lucky 30%, but  the pilot research into ALC has strongly suggested that it can both prevent and relieve CIPN and is now in randomised clinical trials in the USA to determine exactly this.(check clinical trial.gov -search acetyl L carnitine & neuropathy). It is a natural amino acid available at any health food store. Research into L-glutamine showed it was not effective at preventing CIPN and B6 can cause neuropathy at high doses. ((Hope this helps)) - Robyn",
      "MessageIndex": 3,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770973",
      "Title": "Strange sensations. Carola32 Carola32"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 18, 2011 03:42AM Robyn_S wrote: Hi Winterpeg- That is annoying for you - here in australia we can access ALC in health food shops without a problem. These are some links below - just off a google scholar search. I hope it helps! It is in clinical trial so included the number for your MO to check. There are no apparent safety issues noted with the treatment with ALC. So glad to finish chemo - next research is on radiation as I have 25 to come :( then reconstruction. ((Good luck with your treatment!)) Cheers Robyn http://www.tumorionline.it/allegati/00221_2005_02/fulltext/06-Maestri%20(135-138).pdf http://www.sciencedirect.com/science/article/pii/S0959804905004296 http://www.sciencedirect.com/science/article/pii/S030439590700303X Clinical Trial No# NCT00775645",
      "MessageIndex": 6,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770973",
      "Title": "Strange sensations. Carola32 Carola32"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Mar 16, 2011 04:52PM Robyn_S wrote: Thank you very much for the welcome! I must say that I didnt know how many lovely people were around until you start getting hugs from helpful strangers and flowers from unexpected visitors! Quiet week this week - the MRI is tomorrow and then a carefree weekend to prepare mentally for the clinic meeting with the surgeons and nurses on Monday. I am getting a siamese kitten which is a +ve .....it seems that BC was the leverage to get it over the emotional line with my 'cant be bothered with pets arent you busy enough?'  husband! The 12yo daughter is ecstatic! and I am just waiting for the breeder to have a lil chocolate point boy desexed for us...the new addition is to be named Maeko. One day at a time! :)",
      "MessageIndex": 39,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Apr 30, 2011 09:29AM Robyn_S wrote: Hi ladies, it is 1 month post BMX and I am feeling human again! The first three weeks were a trial with underarm swelling where the drains had been, but that finally eased with some days of total rest while I had a nasty flu type virus. Rest rest and more rest eased the pain & swelling that was depressing me no end and stretching religiously (aka housework!) has gradually untied the knots in my chest and armpits! I am now looking forward to going back to work on Monday... But starting chemo On Tuesday and less enthusiastic about that!!! I hope everyone is looking forward as I am to the final goal of being fully healthy again and enjoying life! Hanging out mostly in the May chemo lounge now so sending out healing thoughts to all April girls!! There is light at the end of the tunnel- patience!!! :)",
      "MessageIndex": 181,
      "PostDate": "30/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Mar 31, 2011 11:34PM Robyn_S wrote: Hello ladies, All done with the BMX .. Feels a little like a truck has parked on my chest but the surgeons had a long 5 hour surgery to relieve me of my 2 lb breasts! still groggy and playing with the pain meds Just do glad that bit is over! I have a month to recover before rads n chemo if the oncotedt says so. The first shower today was heavenly! Running warm water is a balm for the body! Take care ladies!",
      "MessageIndex": 66,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Apr 14, 2011 06:40AM Robyn_S wrote: Hello Ladies,It has been great to hear how everyone has been emerging from the fear and anxiety post -op like warrior women - I recall a myth that the amazons who used to remove their breasts on the sword swing side to better fight their foe! Hoping that someone has some tips on relieving post op swelling - I am being patient and trying not to do too much but it seems to be taking a long time to go down! (14 days post BMX) Most days by the evening I fell like I have bean bags under each armpit at the end of each scar site. This was not unexpected but trying massage which helps a little. Any hints - tips appreciated! Thank you!!",
      "MessageIndex": 122,
      "PostDate": "14/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Mar 14, 2011 11:57PM Robyn_S wrote: Hello Ladies, I will be having a Mx in April as well...dont know the date as yet or whether it will be bilateral. I am having an MRI on the good one this Friday and will take it from there..I am still thinking that I want a BMx. I have ILC -large 8+cm  and ILC tends to recur in the other breast. curiously I am a medical researcher as well working in a childrens hospital. This has all been in the last month since finding the lump so still in a whirl and trying to make good decisions. Surgery is my first stop and then we will see with chemo after the nodes are checked and I get the oncotest number back. Feeling positive so far looking forward to a long and cancer free life! Cheers Robyn",
      "MessageIndex": 27,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Apr 2, 2011 01:53AM Robyn_S wrote: Hello ladies! Thank you for all your well wishes! I had a BMX work TEs in and all healing well now 3 days on. Pain is well controlled prefer to be comfortable than brave! Surgery was long 5+ hours so been feeling so groggy getting over that! Drains are in and doing their jobs -not uncomfortable so prefer them in and doing their job! So far so good - no infection or undue swelling so should be out in a couple of days feeling better all the time! Looking forward to healing and getting the next treatment phase over. Recovery is easier without a parade of visitors- I asked my DH to tell the family they are welcome when I get home -it is so difficult to be sociable when all you want to do is sleep! Much easier to make a 5 minute phone call to thank people! I am a grandma too- I was a young mum@ 19 and now my elder daughter 27 has a wonderful lil 4 month old son! And my step- daughter as well has a gorgeous lil 6 week old baby boy so am a nanna twice over so far! It is great at 46 to have babies around to cuddle! tho limited with the cuddles at the moment!",
      "MessageIndex": 73,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Apr 6, 2011 04:29AM Robyn_S wrote: Good luck Winterpeg and Nancy! Wishing you trouble free surgeries and a load of nausea free pain relief! So glad to be home today! The nurses and doctors are wonderful but nothing beats snuggling into own bed! Pain is under control with paracetamol and codeine and arm movement is great. If I do too much then my poor stretched chest muscles start to scream loudly. I received the results of the SNB where I had 5 nodes removed in total with 1 positive for metastasis. The debate by the team of doctors here was the axillary clearance vS no further axillary surgery. I feel lucky that I have no I'll effects from the SNB and will opt for no further surgery. The latest research supports this as posing no decreased risk to survival so feel comfortable with the decision which was up to me as the doctors were evenly split on this point for further treatment. But will be meeting the medical & radio oncologists next week to discuss chemo and then rads. I was planning a work OS trip in July so not sure about how that will fit in! It was scheduled for Japan and now this- the signs are saying no! Lol Happy thoughts to Lifelover and Eaglesara- this is a very busy week!- the first step to being cancer free! Yay. !!!!",
      "MessageIndex": 86,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Mar 23, 2011 12:59AM Robyn_S wrote: Happy Wednesday, I have a date for my surgery - 30/3/11 which will put me in the March group - but I would like to stay put here! It is a bit of a whirl but after the MRI which seems to be clear for the left breast, I have opted for a BMX . The usual reasons  -a very large ILC (with its higher rate of bilateral occurence) and tendency to be invisible on imaging, cosmetic - easier to keep symetrical and the absolute determination to go through all this only once in this lifetime! I am having an oncotest so will have a better idea about chemo in a couple of weeks, but radiation for sure when healed. I am going to have TEs  and implants to reconstruct and will be looking forward to getting a perky C cup after toting around DDs for far too long! it will be Lovely to get some new sexy bras to replace my old grey comfy ones!  Gotta take the positives when they appear! - clear CT and bone scans and a low grade 1 cancer - what else could a girl wish for!  -.....might have to cut back on the anti-depressants! lol",
      "MessageIndex": 44,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Apr 13, 2011 04:41AM Robyn_S wrote: Hey ladies! Now 2 weeks post BMX and looking ahead to the next phase of treatment with chemo due to start on 3/5/11. Still sore but healing slowly-i had a skin sparing mastectomy which i will appreciate when expanding but atm my poor armpits are still swollen and sore- if I do too much I pay big time! Not looking forward to chemo- 3 x FEC and 3 x taxotere but indulging in some scarf shopping - big earrings too! I am looking forward to a few days in the tropics before then visiting my brother and relaxing by the pool- love love love a good buffet breakfast and no housework!! I must admire all the tough April sisters who are l getting on with the daily business of being strong women and kicking their cancer to the kerb!!",
      "MessageIndex": 114,
      "PostDate": "13/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Nov 5, 2011 06:58AM Robyn_S wrote: I finished 25 rads three weeks ago. The first 4 weeks of tx were a piece of cake. However I had a torrid time too from the last week as the underarm area quickly progressed from red, sore and weeping. Over the next two weeks after rads it worsened (my RO did warn me) and spread over the ex breast and underneath which is the most painful. I have TEs in - not filled yet and it feels as if the radiated muscled has shrink wrapped around the TE- just when I thought TEs couldn't be any more uncomfortable!! But it has closed over quickly and using wet get dressings helped to ease and soft dressings changed regularly to cushion and soak up the ooze from raw areas. Glad that doing that again is now not an option. Everyone is different and it is impossible to predict rad response. The RO seems quite happy with the outcome so glad it is over- ((((good luck))))",
      "MessageIndex": 30,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777460",
      "Title": "\"Easy\" part of treatment? MY A**! BlueCowgirl Tazzy"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Nov 11, 2011 09:14PM Robyn_S wrote: Thx blucowgirl- it can get worse and I am still in hospital -getting operated on in the morning to try to clear out the infection and hopefully save the TE on that side. it had all been fine before the rad burns - it has just been one thing after another since, but I have good drs here including the PS who is going to do the reconstruction with what is left of the boob. The lesson learned is to be sooo careful with radiated boobs and respect them while healing!! Kid gloves!!!!",
      "MessageIndex": 47,
      "PostDate": "11/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777460",
      "Title": "\"Easy\" part of treatment? MY A**! BlueCowgirl Tazzy"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Sep 25, 2011 07:32AM Robyn_S wrote: Hi rabbit, the SEs you are experiencing are par for the course with taxotere. I had sore nail beds the first tx but that faded over a week and I did not have any further pain with the next 2 tx and kept all my nails with no other issues. The heartburn/acid reflux at night esp was kept at bay with antacid tablets. The flu like muscle and bone aches are preditable from day 3 - day 6 and get a little tougher over tx as the effects accumulate. The fatigue I found most debilitating but all in all it is easier than FEC! After 3 taxotere it took about 3 weeks to recovery my energy and feel healthy again but you will feel healthy again! Keep up with the acetyl l carnitine- I credit it with keeping the neuropathy at bay- never had a tingle or numbness!! Sending you strength(((hugs))) Robyn",
      "MessageIndex": 73,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772325",
      "Title": "Docetaxel/Taxotere question rabbit Trisha-Anne"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Nov 9, 2011 08:55AM Robyn_S wrote: Hi ladies- another thing that is mentioned is that rads will increase chances of LE in radiated area- be aware of the complications of this and be very kind to your sore spots even when they seem fully healed over! I am typing this from a hospital bed as I developed the boob of death aka breast cellulitis. I had a bout of influenza(bad enough in itself) a week ago which can leave you susceptible to bacterial infections - my rad boob was just healed but it suddenly became swollen hit and inflamed and fever. The result is a week on iv abs and pain relief in hospital hopefully out by the weekend but just want the pain to go- all nerve ending not already angry are sending off zingers all the time. ahhh BC the gift that keeps on giving....",
      "MessageIndex": 42,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777460",
      "Title": "\"Easy\" part of treatment? MY A**! BlueCowgirl Tazzy"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Nov 19, 2012 04:31AM Robyn_S wrote: Ciabatta that is not unusual with ILC- my excisional biopsy of a 2 cm mass uncovered an 8.9cm tumour which needed a further mastectomy which found another 1.6 cm tumour. ILC does not image well leading to its common calling as a sneaky cancer ! The multifocal LCIS in the other breast was not seen on MRI but found in pathology post mx.",
      "MessageIndex": 375,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Robyn_S wrote: Still waiting for a diagnosis .three weeks .US Birads 5..mammogram shows the mass & distortion....I really think that being patient about what I am dealing with is the hardest part of this all.  I have had the lumpectomy three days ago - wide excisional and  blind as the biopsy reports were not helpful - the core biopsy returned only a few tiny fragments of fibrous tissue with no epithelial tissue at all....the FNA was mostly blood and no ductal tissue at all. I read a post where the writers 'radiographer had commented that breast cancers often tend to be very dense -' like passing a needle through an unripe pear'. This was my experience at biopsy - the radiographer struggled to pass the needle into the firm lump.... and wasnt sure whether it meant anything -it certainly seemed to make the taking of any sample very difficult. Has anyone else has a difficult time in gaining a clear biopsy report? Has anyone else experienced this. Age 46 @ Dx, BMX, FEC/T, Rads, Tamoxifen, Femara, DIEP 2012 ( the works!!) Dx 3/8/2011, ILC, 6cm+, Stage IIIA, Grade 1, 1/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765776",
      "Title": "Unhelpful biopsies Robyn_S Lisa1962"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 28, 2011 08:07PM Robyn_S wrote: Hi Rabbit, after 3X FEC the taxotere has been a breeze! I have had 2 Tx with one more to go and the relief of no nausea after tx compared to FEC makes up for the other SEs that taxotere has. The main ones I have had have been fatigue and flu like muscle aches and pains about day 3-5, but they are easily relieved with OTC painkillers. Taxotere (docetaxal)  and taxol (paclitaxel) are taxanes- the treatment is often abbreviated - FEC-D or FEC-T. Good luck with your treatment! I definitely found the taxotere to be much easier to live with! A bit of advice -Research supplements to prevent neuropathy SEs - I take Acetyl carnitine (an amino acid) and have had no numbness or tingling at all (it is in clinical trial for prevention of chemo induced neuropathy) ask your MO! Cheers Robyn",
      "MessageIndex": 1,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772325",
      "Title": "Docetaxel/Taxotere question rabbit Trisha-Anne"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Mar 5, 2011 09:08PM Robyn_S wrote: Thanks for the kind thoughts! I have had the lump removed and will get the pathology results soon - I have an appointment with the BS on Thursday. I will get hold of the path report before then in the next couple of days,  as soon as it is reported - one advantage to working in a connected hospital! ;) Robyn",
      "MessageIndex": 3,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765776",
      "Title": "Unhelpful biopsies Robyn_S Lisa1962"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Feb 12, 2012 11:35AM Robyn_S wrote: I breastfed my daughter 1998-2000 and had extreme problems with blocked milk ducts and mastitis all along. I thought it was just part and parcel of being an older mother - I was 35. So different to my experience with my first daughter 14 years earlier - breast feeding was a breeze. Now I think that was an early warning sign of the cancer. The mastitis was in the cancer side too but I had blocked ducts o. Both sides all the time. I had a BMX and the non cancer side - cleared by MRI so prophylactic, was examined and found to contain multifocal LCIS. The signs are easy to see in hindsight! I also had for the last couple of years pre dx, a deep tingling itchy feeling in the cancer side on occasion - no other signs till I found the fibrosed thickened area this time last year.",
      "MessageIndex": 192,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Mar 7, 2011 07:18PM Robyn_S wrote: Thanks for the kind thoughts...the results have returned as ILC with a bit of DCIS and some Pagets for good luck! Not the best news but sort of expected...at lease I know what to expect and which discussion rooms to head to now! I will be heading for a mastectomy and SNB as that was not done at the lumpectomy...positive thoughts only!",
      "MessageIndex": 5,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765776",
      "Title": "Unhelpful biopsies Robyn_S Lisa1962"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 22, 2012 02:21AM Robyn_S wrote: Good on you Kathy for a clear scan!!! Such a relief!! I got the all clear after my follow up CT so feeling fantastic! No reason not to feel healthy now!!! Hi Damazon! I was offered an ALND after the sentinel returned positive but I the research before shows that it would not improve survival rate and I was going to need chemo regardless. I had to stand my ground a bit on that one as the board was 50/50 on ALND. LE is not a trifling issue for me and the SN gave me the information we needed for TX. All clear scans - yahoo!! I am 100% cancer free Till next year !!! :)",
      "MessageIndex": 27,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792059",
      "Title": "Hi ho, hi ho...it's off to scan I go! jennyboog damazon"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 20, 2012 05:53AM Robyn_S wrote: Hi Damazon- I noticed that you and I were diagnosed on the same day with almost identical stats ( my ILC is Prog +) curious! I am in a study and get yearly CT and bone scans which give peace of mind for a year if they show nothing! My first ones were three months ago and the Ct showed up a PE ( lung blood clot) a liver thingy? ? and a ground glass opacity in the lung .... I was feeling great until then!! Now on warfarin having regular blood clotting tests and waiting for CT scan results to see if the opacity is smaller or growing... And this was my first year! The liver thing was ultrasound examined - clear! I really get the whole scanxiety thing now! The bone scan was clear so I am positive that it will all be fine- but I will be going through this next year for every lump and bump to be checked and rechecked. I thought that being in the trial would give me peace of mind by being vigilant. I feel healthy now so will consider myself that until proven otherwise!!!",
      "MessageIndex": 22,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/792059",
      "Title": "Hi ho, hi ho...it's off to scan I go! jennyboog damazon"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 17, 2011 12:44AM Robyn_S wrote: Txladysara- the rash may be an irritation from the taxol on elimination- I started to get an itchy reaction even though rinsing well with warm water- I used a nappy rash powder (zinc oxide- curash powder) to dry and soothe and it worked brilliantly giving immediate relief from the itch and helping to heal. Taxotere is a doozy- itchy dry eyes (lubricating drops work) and sore dry nose (saline rinse helps) at the moment and not much of an appetite. But would still take it any day over FEC or AC!! No nausea !",
      "MessageIndex": 1616,
      "PostDate": "17/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 4, 2011 07:25PM Robyn_S wrote: Happy Friday everyone! It is good to see everyone hanging in there and keeping out of hospital for the most part! It is good to look ahead at growing hair and eyelashes - i have a fuzz of salt and pepper growing more on top than on the sides so envisioning a bit of a mullet style in time if I dont buzz it even! Eyebrows are regrowing.. sparse - they thinned but never completely dropped out and kept most of the eyelashes. Have one more taxotere to go so feel like I have a headstart hairwise back to normal! I just wish the fatigue would lift a little- very debilitating at the moment - I am totally useless if I dont sleep 12 hours at night.  I have my rad-fitting appointment next week- I am so looking forward to leaving chemo behind - never want to this again! Blondelawyer- cancelling your Hawaii trip sucks but know how you feel! I had to give up a paid conference trip to Japan which was last week- I had been looking forward to it for 2 years and had some good work accepted to present- others did that for me. Now must wait another 2 years for the next meeting :( BC really is the gift that keeps on giving!",
      "MessageIndex": 1776,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 11, 2011 08:22PM Robyn_S wrote: Blondelawyer and Bak - I feel for you both looking ahead to your BMX surgery. It can be emotional but there are positives - symmetry in reconstruction and the reduction of risk. You can choose how you want your new Foobs to look - and they will be perky when you are not feeling perky! You dont have to wear a bra if you dont want to!! I had large DDs and was so relieved to lose the problems they caused! I meet with my PS next month to plan reconstruction and hope to have implants done ASAP. I have expanders in now since the BMX in April and will be glad to lose them for something softer. Not expanded yet as I have 25 rads to do first. What did help me emotionally was seeing other womens reconstruction journeys in the pictures forum as the results can be fantastic and better than you imagine. good to check out for reassurance before you make decisions! hope you are feeling better blondelawyer! Beaglesgirl - glad that the taxol is treating you better than the AC! Good luck for your chemo tomorrow Bak!",
      "MessageIndex": 1816,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 13, 2011 10:47PM Robyn_S wrote: Hello everyone- it has been very quiet in here, I think you are right BAK and lots are moving onto rads. I had my appointment this week to get my mapping and tats done for rads which will start in about 3-4 weeks time after my last taxotere this Tuesday. I will not be sorry to leave chemo behind, hopefully it will have done it's job! The taxotere has been okay. Apart from the fatigue and dry eyes I have not had too many SEs. Avoided the neuropathy and nail issues so count myself lucky! I am glad the abraxane tx is treating you well BAK.",
      "MessageIndex": 1823,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 18, 2011 07:09PM Robyn_S wrote: Blondelawyer- so glad that you have that nasty ol tumour out! Great news on the SNB pathology too. Wishing you a speedy recovery and pain free days! Candice- you are doing great too!! It is so good to see the group here overcoming what hurdles are placed in front of them. Everyone has been so inspiring and motivating to me and others I am sure, in speaking out loud of their personal battles against this disease! ((Have a great weekend everyone)) Robyn",
      "MessageIndex": 1845,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 29, 2011 09:01PM Robyn_S wrote: Hi Twistedsteel - check out Acetyl l carnitine supplements for neuropathy. It is in clinical trials in the US for prevention of taxane induced neuropathy and there is research strongly suggesting that it is effective in preventing and relieving chemo induced peripheral neuropathy (CIPN). I took Acetyl L Carnitine capsules during my taxatere tx and luckily did not have any neuropathy at all. (3 X 1000mg per day). It is available in health food stores and is a natural amino acid. I had no nail issues at all either. Hope this helps ((take care)) Robyn",
      "MessageIndex": 1902,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 3, 2011 04:35AM - edited May 3, 2011 04:46AM by Robyn_S Hello girls - I had my first chemo  (FEC x3, Taxotere x 3) today and feeling fine- nothing that is not normal for a 5am start -I went to work before the appt at 11 am  - I got the meds at 3 and no nausea  or headaches at all so far -so the meds are keeping it all at bay! I had a cup of tea and toast when I got home at 6.  I was so anxious about this but will take it one day at a time now -expecting the worst will be over the weekend! The nerves were kept in check by a lovely nurse Aaron who orientated me very professionally and with care through all the procedural steps - why, when and kept it simple when needed and emphasized that I only need to concentrate on 3 things *1 - keep up water/fluids, *2 - take temperature morning & night and seek attention if over 38oC and *3 - treat yourself as a BABY (think skin, sun aware, gentleness and keeping away from sick people) - simple is good!! So far so good, Only 5 more to go! At least I will still have hair for mother's day this weekend! Oh! and I was invited to join a trial (RCT) which compares Denosumab an antibody which is proposed to help prevent bone metastasis. 50/50 placebo or treatment but is over 5 years and does include yearly bone, CT & MRI scans which would give peace of mind. As a medical researcher I appreciate that every treatment we have has been examined for effectiveness in a research setting so I am very inclined to enter the trial. Is anyone else in any cancer trial or study? Take care ladies! Robyn",
      "MessageIndex": 80,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 17, 2011 02:52AM Robyn_S wrote: Welcome sunshinyday! I think it is part and parcel to be scared of the unknown! Chemo is Not fun but rarely as bad as you imagine it will be! getting prepared is a great coping mechanism, I lived at my local pharmacy before my first treatment ! Day 14 for me and my hair is hanging on for a little bit longer- I am doing scarves n hats as it is winter and doesn't look out of place now! I am seeing the MO for checkup after 1st chemo and will run the pre chemo fasting idea past him for next chemo next week. I have a few extra pounds so dont think that weight loss will be a drama and would like to reduce dependency on drugs for control of post infusion SEs- the nausea, constipation and gastro shock was my main gripe! I PMed windlass who had posted that she was fasting pre 1st chemo ( with MO approval). she reported that fasting for 48 hours pre/ 24 post dramatically reduced SEs- she had 2 rounds of fasting pre treatment first and 1 round chemo without fasting for comparison. Update- discussed the pre chemo fasting the oncology fellow and she was very open to it given that in my situation there are no other health issues! I will post with the outcome - next treatment is 24/5/11 and I will want my birthday cake 5 days later! Good luck to sunshinyday and Ruthii for tomorrow! Cyborg- hope you are turning a corner for the better! What day post chemo did you start losing hair? Happy Tuesday everyone!",
      "MessageIndex": 383,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 21, 2011 05:53PM Robyn_S wrote: The fasting is for 62 hours pre and 24 hours post chemo. There is a thread in this forum about this but basically there is research by Dr Valter Longo of USC which in a series of case reports found that chemo SEs are lessened by fasting. The theory is that during fasting low glucose levels trigger a protective mode in healthy cells like hibernation, while cancer cells do not listen to these signals and continue to do their thing. The effect during chemo means that healthy cells are much less affected by the chemo drugs while the cancer cells are still targeted effectively. The result is less damage which we feel as reduced SEs, to healthy cells. I have discussed this with my MO last week and she was happy for me to try this. There are a number of clinical trials- one at the Mayo clinic is due to finish next 2012 which will be too late for our treatments, but I have read the research and would qualify for inclusion based on BMI and general health. I have contacted windlass who has done treatments with and without the fasting nag reported dramatic differences. Again, would not do this without my MOs knowledge and approval. The fasting bit is easy- no calories for 62 hours pre and 24 hours post infusion. Keep up fluids! - black tea. Water, diet soda, black coffee. The mayo clinic trial is doing 4 interventional arms with 24 hours fast pre chemo tx; 48 pre; 48 pre/24 post and control no fast. If you search for ' Nutra / Valter Longo' you will find his company web site which has his research papers conveniently available in PDF. My motivation as I am missing my breakfast is simply to keep as healthy as possible both during and after chemo- the knowledge that the drugs will affect the heart muscle and leave an increased risk of leukemia is motivation enough to do something to protect the healthy cells that have to carry me to an old age!! I have had one treatment without fasting so it will be interesting to contrast with fasting intervention! Another windy day here in Oz so the rest of the hair is in the garden! Hats n scarves from now on! Time to cook Sunday dinner for the crew- chicken and potato bake. Happy Sunday everyone!",
      "MessageIndex": 513,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 22, 2011 12:58AM Robyn_S wrote: Cyborg- I am doing FEC and get steroids via infusion and dexmethasone tablets for 2 days after. You would need to discuss with your MO if you have medication that needs to be taken with food :)",
      "MessageIndex": 519,
      "PostDate": "22/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 24, 2011 10:35PM Robyn_S wrote: {{{{{Candice}}}}} you are a strong woman and stay so positive that you inspire us all! Positive thoughts and well wishes sent to you for a smooth journey back to a cancer free life! Following a 62 hour fast I had my 2nd FEC infusion yesterday which was earlier appt and quicker this time round so home by 2 pm and feeling pretty nauseas by 6 pm which was the same as last time. I ended up taking a sleepy pain killer for the emend headache and in bed by 9.30. Slept like a baby and woke feel really good today with the nausea subsiding to treatable levels. I felt energetic enough to wander around the new local hardware store for an hour and broke my fast at 12 (24 hrs post tx) with a homemade chicken soup and bread roll- delicious! Last time I had the worst changes to my sense of smell and taste that only the blandest food tasted ok- this time my smell and taste is unchanged so far so I hope it stays that way! Another plus so far compared to last tx is that I don't have the crampy, brick like feeling in my gastro tract like last time. ( I call it gastro shock) Advised to have 3 liters of fluid daily to flush system out which helps- water with lemon, lime or mandarins slices and a little sugar is my favorite! My hair at day 22 is thin all over but happy not to cut buzz shorter as I have a bit to poke out under the hats that looks less cancer patient like! I brush the loose hair out each day with a soft rubber pet brush in the garden and use it on the clothes, the furniture etc lol. The sore scalp has passed and it feels okay now- gently does it! Cyborg- how are you doing with the fast and your treatment symptoms? Hope you are finding it easier and helping with the SEs. Hoping everyone is coping well and the SEs are manageable - one step closer to cancer free!",
      "MessageIndex": 643,
      "PostDate": "24/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 29, 2011 06:23AM Robyn_S wrote: Hey cyborg! It is sooo understandable to have low spots with what we are going through! It us hard work to keep it all together for everyone around us. I too was feeling a bit overwhelmed today realizing that I have another 4 tx to go before I will be done with chemo- and then the joys of daily rads for 5 more weeks. I had pictured that I would be joyfully spending my recuperation from each chemo doing some writing for my phd but have been so chemo brained that now I feel guilty for not attending to business! This time next year will be better and we all have to focus on our post cancer dreams and goals! Let's be kind to ourselves and pamper ourselves a little - or a lot! we deserve that! (((hugs)))",
      "MessageIndex": 763,
      "PostDate": "29/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jan 5, 2012 10:30AM Robyn_S wrote: Hello ladies! I found my lump myself - that strange sensation where your fingers just brush over the spot as though suddenly drawn to that spot out of the blue like a magnet. It was a small lump only 2.5cm on the ultrasound, invisible on mammo, but when having the lumpectomy / biopsy it turned out to be over 8 cm like a fried egg. Lobular grows like a web. I had BMX and found another 1.6cm tumour in that breast and a 'healthy' breast full of LCIS. Chemo, rads, tamoxifen and crossed fingers now. I had TEs in but lost one to infection caused by radiation burns- I think that implants following radiation was being a bit over optimistic- the chest was well cooked and the pec muscle scarred and unyielding even without being inflated. Now I am looking at DIEP this year. I didnt realise how much i liked the TEs til i lost one and hate the lopssided look I have now. The PS had been nudging me towards a DIEP before the infection, i would rather have had implants but DIEP is the only option now and I would rather that than the scarred mess I have now. Welcome Ductal, you have been through so much , I am glad that you have found your way to these forums- the support of women going through exactly what you are helps bolster the soul especially in low times when you need to talk to someone who understands. It has certainly saved my sanity over the last year! Cheers Robyn",
      "MessageIndex": 42,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Oct 3, 2014 05:46AM Robyn_S wrote: Hi Gretta, I used Acetyl L Carnitine to prevent neuropathy while having taxotere. I took 1 gram three times a day over my treatment course and never had any neuropathy at all ( nails were fine as well). There have been quite a few clinical trials investigating Acetyl L Carnitine (which is a naturally occurring amino acid ) in the prevention  and treatment of peripheral neuropathy.  I decided to combine this amino acid supplement with fasting pre and post chemo and credit this regimen with emerging from treatment with no lasting ill effects at all. I hope this helps ((( hugs)))",
      "MessageIndex": 2,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825072",
      "Title": "Advice needed for preventing neuropathy & nail care. Gretta april25"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jun 21, 2011 09:31PM Robyn_S wrote: Surgery options are such an individual decision with the amount of risk we are wlling to live such a very personal choice. Before Dx I first had an excisional lumpectomy which came back without clear margins which gave me time to think. In my cace a mastectomy was really the only appropriate choice with a large tumour and after weighing up the risk of bilateral BC (higher with ILC) as well as wanting symmetry for cosmetic reasons I decided to have a BMX. Pre surgery I had an MRI which cleared the healthy breast, but really could not ease my mind to living with the higher risks of BC which with lobular is difficult to image (mammogram did not detect ILC only US did). After surgery the PBX side returned a path report showing multifocal LCIS through the breast tissue which confirmed that I made the right decision. Sometimes it is just a gut feeling or intuition about what is right for you. I really would never want to do Tx again...Once is really enough and I will do everything to achieve that and live a long disease free life. To this end I am also having a wider field of rad Tx as well (to include axilla with the chest wall and SC nodes)  - there was a recent study which suggests that this significantly increases survival rates. Esp as rads are a once only tx. ((take care evryone!))",
      "MessageIndex": 1270,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 4, 2011 03:16AM Robyn_S wrote: I am girding the loins for my first round of taxotere tomorrow. So relieved to be all done with the FEC that I am almost welcoming a new set of SEs rather than the nausea . It was getting worse with each round so coming into the last 3 taxotere from a much lower base level of fitness. Worried about losing nails as the cancer centre does not ice, but have applied nail strengthener and am fasting to reduce the SEs like nausea and neuropathy. Hope it works! Chemo brain is a pain! I make notes and lists and put timers on to keep the mind on track - and play lots of scrabble. The worst is that I struggle at time to find the right words verbally - my oral presentations during chemo have been hilarious! - lucky only to small groups! the days after tx are the worst. Mentally doing fine during tx - i worry about the time that all treatments are over and I start thinking about recurrance. It sems easier when you are doing something, no matter how unpleasant, to fight this disease. I will not do well psychologically with finding that it hasnt cleared everything  everywhere. I had a BMX so it would be distal mets that I worry about. My sis in law is 5 years out and I have seen how that fear tends to play out at every lump or pain. After treatment I plan on focussing on the healthiest lifestyle possible.... diet....and sigh...exercise. Only 3 months of treatment to go till I can get my new foobies!  Take care everyone!!!! Robyn",
      "MessageIndex": 1443,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 6, 2011 12:08AM Robyn_S wrote: Happy wednesday everyone! I had my first of 3 taxotere yesterday and feeling sooo much better now after doing the FEC first! No nausea.. A bit tired but can live with that. Did I say no nausea!!! :) hopefully I will bypass some of the other SEs and sail through to rads in 10 or so weeks! I met with the radiologist and set up a plan to get my plastics referral and reconstruction plan in place so feel like progress is being made to be finished with all tx by the end of the year! Yay !! Hope everyone is feeling better than last week! It's a long road but we are all still getting through it! (((hugs))) Robyn",
      "MessageIndex": 1456,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 22, 2011 04:11AM Robyn_S wrote: Hello May ladies! The 3 weeks come around quickly and I am back in for another taxotere early next week. Still so much better than FEC though the fatigue keeps me flat. Laureen  - are you taking anything for the neuropathy? I am taking daily 3 x 1 gram dose of L-Acetyl -Carnitine which is a natural amino acid-  it is in clinical trials for prevention and treatment of chemotherapy induced neuropathy. So far I have had nothing at all after taxotere # 1-which may be lucky but I have heard enough stories about long term problems with taxanes to not  want to take the risk. There is research out there about the problem. I hope everyone is having a peaceful weekend! ;) Robyn",
      "MessageIndex": 1670,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Apr 30, 2011 02:01AM Robyn_S wrote: Hi everyone! This week was the first relatively pain free week post BMX a month ago! It has been lively having all the swelling go down and scars start to pale away! Now for the fun stuff! I am healthy enough to feel optimistic that chemo will not be as bad as I have anticipated. I start on Tuesday 3/5 with FEC x 3 & taxotere x 3. I have been following the march 2011 forum and find the advice and camaraderie to be uplifting to the spirit! I am planning on working during treatment and if well enough maybe wangle in an OS conference that I have been looking forward to all year before this inconvenient BC business! Life is too short to let pass by without enjoying the moments! Stocked up on Scarves and hats- not a wig woman! Like the idea of fooling around with false eyelashes- though not experienced in using them- will possibly end up looking more than slightly demented lol ! Looking forward to the end of the year with all of this behind - have 25 rads after the chemo- the perky new foobies better be spectacular! Good luck to all our May club members!",
      "MessageIndex": 47,
      "PostDate": "30/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 2, 2011 04:22AM Robyn_S wrote: Thanks Lorenar for your very timely advice for us first timers! I go for number 1 tomorrow and I am more apprehensive of this round of treatment than the BMX a month ago!! A good nights sleep will be a good start- I started back to work today and will get a couple of distracting hours of work in tomorrow b4 the chemo appointment- I work a childrens hospital just a short stroll from my treating hospital - very convenient for the many BC related appointments. Good luck to all chemo starters this week- I know that quite a few are beginning early this month-fingers crossed that all the meds do what they are supposed to!!!",
      "MessageIndex": 70,
      "PostDate": "02/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 3, 2011 07:14PM Robyn_S wrote: Hello to all the May newcomers! Day 2 post Chemo#1 and feeling good which is pleasantly suprising . I was up every hour or so last night peeing like a racehorse which I welcomed as I figure that will be less side effects to cope with as the anti-nausea meds scale dowm. I am taking emend for the first three days, with onsetron morning and night to overlap that and feel no nausea at all -no appetite but my figure can cope with a few pounds off! A slight headache from the meds that panadol (tylenol) cand take care of - so far so good! Counting down the days till the hair goes (14)  - I have shoulder length hair so I will do a short cut as soon as the shedding gets annoying. if all does not fall out I would like a few strands to get a headstart on growing back!  I don,t know what the bowels are planning but keeping up with daily metamucil soluble fibre- in another big glass of water! and mixing up the water intake with electrolyte supplements ( salvital in water) which make me feel really good in the tummy as well. Maybe a chicken soup for tea if I can escape the clutches of my DH -very protective! and go to the market for some fresh chicken! I sometimes have to remind myself how difficult it is for the our carers - my DH has rarely left my side since I found the lump in Feb which was a bad week!  he was by my side all day yesterday even though he is needle phobic - he is a real hero to me and could not do it without him (though there are times....!!) Take care girl and be gentle on yourselves - i really think the anticipation of taking the first step into chemo is worse than actually doing it (insert picture of plump 46yo in non flattering bikini on diving board at the deep end !!!)  After the plunge I found that the water is warmer than you think!  Cheers - Robyn",
      "MessageIndex": 90,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 6, 2011 05:06AM Robyn_S wrote: Hello girls! Day 4 post chemo #1 and have been fairly tired and napping today with no steroids on board. Nausea is diminishing but must say that the taste buds and strange sense of smell is the most annoying thing do far! Mashed potatoes, chicken and sweet tea are what I crave - fruit juice which I keep up to keep things moving below all tastes as though made from plastic! Blah! I made a chicken soup that tasted only of celery and garlic to me but was apparently quite tasty to non chemo-poisoned! I might have to stick to tried n true recipes to feed the family! I love raw healthy salads and especially since dx have developed a real aversion to processed foods preferring to make fresh casseroles and soups- wintertime here in oz! What have you girls found to help the nausea and funny taste after chemo? Suggestions welcomed!!! Robyn",
      "MessageIndex": 140,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 10, 2011 06:52PM Robyn_S wrote: Helo ladies, welcome Margie - I have found so much support and knowledge here- it is comforting to know that all of us here know exactly what you are going through - I find it empowering to know what is to come and prepare mentally for each step we face! Day 8 post first FEC and feeling tired but more normal! I can condense it in my mind now to One week feeling poisoned, one week feeling tired and hopefully one week feeling good! anything improving on that is a bonus ! It is easy when you feel blah nauseous (even with all the meds emend-zofran steroids) and sick to feel down but if you can trust that next week you will feel better then it feels more like a tunnel rather than a brick wall! Sense of Smell is returning to normal rather than everything having a chemical mouldy citrus tang. Much better for the appetite! Food is tasting better! The poisoned week was a challenge - light breakfast cereal (high protein/lots of sugar) , mashed potatoes, cheese, crackers, cold chicken was good  - the white diet seems to be popular here! Water with lemon, lime slices and a tsp sugar by the side all the times and helped to keep up fluid intake to flush out toxins and funny tastes! Scalp is tingly/crawly so know that I may not be a medical miracle and retain the tresses. I am not a hat person but even less of a wig woman! I did but four nice silky lined caps and knits yesterday for the style - now I can see them sliding right off.....lol Have a great day ladies - one day at a time!  Robyn",
      "MessageIndex": 219,
      "PostDate": "10/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 21, 2011 03:07AM - edited May 21, 2011 03:07AM by Robyn_S",
      "MessageIndex": 501,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 24, 2011 12:46AM Robyn_S wrote: Hi cyborg - well done on your fast! I have just climbed out of the chair so am heading home for a rest. I will be looking forward to lunch tomorrow!! Post chemo was a steady diet of mashed potato, chicken and cheese n crackers and that all sounds so delicious at the moment! Candice- fingers crossed for your scan results, the not knowing is the worst but being a brave strong woman you will endure this and triumph no matter what! BKJ66 - I have a seriously tender scalp too so hoping that will pass, I did not shave the pixie cut and still have a fair bit hanging on- just thinning all over, hats n scarves are taking a bit if getting used to but better than the alternative! I use a disposable scrub hat as a hairnet at night to keep my bedding hairfree. Hope everyone is keeping their SEs at bay and recovering well!",
      "MessageIndex": 585,
      "PostDate": "24/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 25, 2011 07:06AM Robyn_S wrote: Hi Steff, there are quite a few in our group here that have ILC and personally my oncotest number was a low 10 which I indicates that recurrence risk is low and chemo is not indicated. Treatment plans all come down to the individual. I have full trust in my doctors and they have listened to my concerns and feelings. My prophylactic mastecomy (had BMX) returned multifocal LCIS even after being cleared by MRI. I refused axillary clearance even after the SNB returned a positive met in 1/5 as the latest research showed that it would not make a difference in 5 year survival. And chemo was recommended by my doctors based upon tumor size- 8.9 cm & 1.6 cm, age 46 and being premenopausal as well as the decision to not clear all lymph nodes. I spoke to the radiologist and suggested that the axilla should be radiated as well as the chest wall and she was positive about that especially as you only have one go at radiation. It all comes down to being aware of risk verses benefit in each treatment option and the level of risk is based on each patients individual and unique clinical presentation. Too much research can send you loopy! There is so much information and it can grind you down trying to learn everything there is to our disease! Looking forward to a life beyond cancer keeps me focused! Well that and the kids and grandchildren! One day at a time! ((hugs))",
      "MessageIndex": 649,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jun 16, 2011 08:27AM Robyn_S wrote: Hello everyone, Great news Bkj66 that's the way to kick it to the kerb! It gives a boost to hear the success stories and shows that doing this s$&;y tx can make a difference! It seems like everyone is battling the different SE demons this week. Day 3 post tx, mine are nausea and fatigue but not too bad and brain fog abating. It was the last FEC and onto taxotere in 3 weeks so will appreciate any advice from those that have gone before. I am particularly worried about losing fingernails. They don't advocate icing nails at my centre so wondering if anyone has any thoughts on that. I haven't lost my eyebrows or lashes yet so maybe should feel lucky so far! I have reason to fight hard and celebrate as I found out that I am to be a grandmother for the third time! I have a 6 month old grandson, nanna to my fiances 3 month old grandson and my daughter (mum of 6 mo) is just expecting again after having a dream baby who just sleeps, eats and smiles. By the end of the year I will have my hands full and treatment over! That will be something to aim for past all this! The light at the end of the tunnel! Goodnight everyone! One day at a time! Robyn",
      "MessageIndex": 1167,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jun 18, 2011 09:09AM Robyn_S wrote: Hi BJK66- I had a nasty computer virus that made me tear my hair out until I came across a tip- with windows 7 I found that I could boot up in safe mode and restore to a previous update which was pre virus- do if you know when you got the bug you can restore your system to a previous system save pre dating the virus. It worked for me with a nasty bug that disabled my anti virus and saved me having to wipe the system. worth a try. Hope everyone is having a SE free weekend. This week seems to be an emotional one for many of us - there are so many strong women here that I take strength from in each of your stories! take whatever helping hands offer and do something nice for yourself each day!! (((hugs)))",
      "MessageIndex": 1214,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jun 22, 2011 11:34PM Robyn_S wrote: Patriotic and MamaV - thsnk you for the detailed list of Taxol SEs  - it helps so much to know what to maybe expect. I have done with FEC and now looking ahead to 3X taxotere. As the main SE that bothered me on FEC was the nausea and gastro shock - i will like the change of scenery! I cannot take aspirin or ibuprofen so am a bit concerned about managing bone pain as that seems to be a common SE of the taxanes. Did your bone pain need any analgesia? Laureen  - it seems as tho we are on the same chemo regimen timetable! I also have 25 rads after chemo to look forward to before I start getting expanded and reconstructed hopefully by the end of the year! I know what I want santa to put in my stocking! New soft foobies! I had a BMX with expanders put in (March 31) and have to wait to get expanded after rads. Is anyone else putting up with expanders and looking forward to reconstruction? I shouldnt complain too much as I have had no infections or problems - but aargh they are uncomfortable! It is very hard to feel attractive or sexy during chemo even without stiff weird plastic things clasping your chest muscles complete with hard folded bits under the skin and skin ripples!! My BS thinks that they look great..sigh.",
      "MessageIndex": 1303,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 2, 2012 04:32AM Robyn_S wrote: How sad! So young... .Blondelawyer had such sadness within her after losing her husband. I hope that she has found peace now.",
      "MessageIndex": 2330,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Aug 15, 2011 05:36PM Robyn_S wrote: Happy Tuesday everyone! In the chair for my last chemo today taxotere and hopefully the last for good! I am moving onto rads in 3-4 weeks so will be hanging around those boards to find what to expect over tx. I am set with my rad tats - I did ask about alternative could have had sharpie marks but covered with tegaderm (allergy) to preserve them for 4 weeks - figured that tats were safer and I suppose a souvenir of the BC journey! It seems like everyone is nearing the end of chemo - it has been wonderful to have so much support from everyone here for the last 5 months- sooooo long!!! I have read every post and chemo has been such a trial for everyone at one time or another. I will not miss the itchy dry eyes, constipation , nausea, bone aches and fatigue etc!! my hair is now about 1/2 inch long a big step back to normal. Wishing everyone a SE free week (((hugs))) Robyn",
      "MessageIndex": 1836,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Oct 19, 2011 05:35AM Robyn_S wrote: Hello ladies, I have not posted in a long while- have been mired in the routine of work ..rads...work...rads...appointments..etc.. And have finally reached the end of treatment! Wish I had the energy for a riotous party or even a solid wooo hoooo! Congratulations to those that have finished chemo! The breast cancer treatment merry go round is such a marathon and so many of us are crossing one finish line or another! I did 25 rads over 5 weeks and finished last week. As a graduating present my eyebrows suddenly grew back so thrilled with that!! -so over the cancer patient alien look! Hair is totally silver and one inch long so have thrown off the scarf and hats and going topless! Just in time for summer here. Still not long enough to comb. All I need is boobies and I will be good as new! I have TEs and am tossing up between implants or DIEP as the surgeon thinks that would be a good option for me. Still undecided. At the moment just need to recover - I have a nasty burnt area under my armpit that is oozy and painful and physically exhausted but that's the worst of it after being under constant treatment since March- BMX, chemo, rads. Time now to heal !! Wishing everyone a healthy week! (((take care))) Robyn",
      "MessageIndex": 2101,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Nov 13, 2011 02:06PM Robyn_S wrote: Hello everyone thank you for your healing thoughts! After a week of IV abs and some very ordinary hospital food the expander is leaving the building this morning! The PS assured me that options are still open for reconstruction at a later date- probably DIEP as I have plenty of material to work with. So tired of the pain- it seems that this boob ( not even a boob!!) has been pain central for 5 weeks! The other one has been so well behaved- only a little bit of cancer -LCIS and no zingers! I can relate to the grey hair - mine is about an inch and a half all over and steel grey. I haven't been natural for 20 years so waiting to see what it looks like with length before coloring again. Been topless a month now- first day felt weird and I kept a hat close by for comfort, but it soon feels liberating to not cover up. Happy Monday everyone- I hope you all have a healthy week x x",
      "MessageIndex": 2168,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 15, 2011 12:11AM Robyn_S wrote: Txladysara- hi I am doing FEC had first tx 5/3 so 11 days out now - keep on top of the constipation and take aid sooner rather than later! the gastro tract goes into chemo shock and much better to use a laxative prophylactically! Candice - thinking of you and sending positive thoughts your way!!! BKJ66 - the whole treatment process is overwhelming at times and it helps me if I keep the image of a tunnel in my mind whenever I seem to hit a mental brick wall! That said, antidepressants can help- I have a clinical depression ( came out if the blue 4 years ago) which is hormonally related and have found medication to be very beneficial- it will also have the side benefit of reducing the hot flash side effect when I start tamoxifen!! Gotta find an up-side! Day 11 post 1st treatment and feeling great! I had my hair cut short pixie style and it suits so will enjoy it for a week or so before it all falls out ! Spent the day pruning in the garden and while I get puffed out quick am feeling healthy and energetic! So far the only side effect has been the nausea gastro upsets for the first 7 days. I am going to speak to the oncologist about fasting before chemo to reduce chemo side effects. a study detailing 10 case reports seems quite promising. I would rather take less medication if the nausea can be controlled without it. I will see what the MO says. Good Luck to all those in the chair this week! Robyn",
      "MessageIndex": 318,
      "PostDate": "15/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Apr 5, 2012 06:47AM Robyn_S wrote: Hello everyone! It has been a while but after an infection after rads when I lost the TE it took a time to get back to feeling normal. Now I am preparing for a bilateral DIEP at the End of April. Not fair just when feeling healthy after a year of TX. But as a public patient I am grateful to get reconstruction without it costing thousands. It is lovely to see everyone recovering and growing hair!!! I had my first haircut last week - very grey and artisty looking short do - it seemed a shame after spending so long growing it!! Love having eyebrows now, never did get the hang of drawing them on naturally!! And one always seemed to rub off and give me the crazy woman look so common to BC ladies lol. Cancerversarys all round. I have had this TE in for 12 months now- it is half inflated but very uncomfortable not looking forward to next weeks expansion. :( ((hugs)) to everyone - Robyn almost a year for our May chemo group!",
      "MessageIndex": 2304,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 22, 2011 10:44PM Robyn_S wrote: Bjk66 - on taxotere but weight is steady- I eat healthy- if making my own pizza can be counted!! The steroids are supposed to help with fluid retention. The acetyl carnitine is supposed to aid metabolism and is used as a weight loss aid - maybe that is keeping the weight steady ! I still fast over treatments but don't lose more than a kilo which soon goes back on!! BUT a big boost is that my hair is growing back!!! I have peach fuzz and a five o'clock shadow all over the scalp!! I have done 3/3 FEC and 1/3 taxotere with my next due on Tuesday - not ready to ditch the scarf yet but this Christmas is looking good!! And feeling good at the moment! Has anyone else noticed any regrowth yet???",
      "MessageIndex": 1679,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 25, 2011 09:36PM Robyn_S wrote: Happy Tuesday girls! Yes agree it's too quiet here! I hope it means that everyone is toobusy enjoying some fresh air and sunshine and taking long summer evening strolls! I am in the chair for my second last chemo and counting down! I have a clean house thx to the steroids and after 62 hours of fasting a huge appetite so sitting and planning my breakfast for tomorrow!!! And lunch and dinner! Mmmm full English breakfast, Miso soup with dumplings and pasta and a fresh green salad for dinner. I haven't lost weight but not convinced that it's due to the steroids! Got a clean bill of health - bloods all good and no SEs. Well done on your walk BAK! Next mothers day in May I will do the BC walk here- it is wonderful to feel the support & camaraderie to a cause that affects so many women and families.",
      "MessageIndex": 1691,
      "PostDate": "25/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Sep 27, 2011 07:09AM Robyn_S wrote: Hi ladysara, glad to see you have finished chemo too! I am also in a study D-Care which is a randomized controlled trial so I have a 50/50 chance of having xygeva or placebo. It is testing the effectiveness of xygeva at preventing bone metastases. I take the view that everything we take for granted .. Yes the chemo.. Has been tested by trial for efficacy in the past and we benefit from studies done by brave women battling cancer as we are. Happy Tuesday everyone!",
      "MessageIndex": 2014,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Nov 9, 2011 06:09AM Robyn_S wrote: Hello girls! I started tamoxifen 1 week before finishing rads so have had over 5 weeks on them now. I have not had any noticeable effects and I was premenopausal before chemo. I take a. Antidepressant which can help with hot flashes but that really has not been a bother! I have recovered from rads burns, flu and now in hospital 3 days so far with breast cellulitis - I am starting to think that chemo was the easy bit!!!! Lol So good to see many moving onto surgery and thinking of reconstruction- I have unfilled BTEs since April and with this infection am relying on the surgeons optimism that the current angry boob will be okay with time- and I thought they were uncomfortable before!!",
      "MessageIndex": 2156,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jun 13, 2011 06:55AM Robyn_S wrote: Happy Monday everyone! I have been naughtily stalking rather than posting lately - after #2 Tx I had a virus - sore throat and cough which knocked the stuffing out of me but luckily fought it off with a bit rest and antibiotics. Week 3 was spent working hard to make up for lost time! Now have # 3 FEC tomorrow. My blood counts were very low on friday so have to test again before Tx tomorrow- fingers crossed it is better- I don't fancy any delays ! Plils & twistedsteel- I am hoping to cover my mastecomy scars with a pair of tats - no choice with the scars but it takes back a little control about how the battle wounds look! I have never considered a tattoo before this time -I am a grandmother working on my Phd! I am after ideas!! I like your \"fight like a girl\" image Plils! I did a Look Good feel Good workshop here in oz last week- it was great for ideas on makeup- esp the hints on how to draw eyebrows - that was a complete mystery to me before!! Lol without the workshop there would have been one very surprised clown running around town! Plus scarf ideas and a bag full of makeup goodies helps to make you feel pampered! So many stories here to draw courage from! So many different paths along the same journey! It helps so much to know that you are not alone! Good luck to everyone this week! (((Take care ))) Robyn",
      "MessageIndex": 1113,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jun 17, 2011 02:53AM Robyn_S wrote: Great wig Blondelawyer! It brings a smile! Twisted steel - I like your attitude- we always need someone to take turns being a B+ cheerleader person to buck us up out of our various chemo side effect funks! My cat is helping me write my paper and is making more sense than my input today!! Off the steroids and having a bad dose of chemo brain now, left my phone out visiting, left the eggs on the fridge, forgetting every second word- shopping is a nightmare and so time-consuming even if I dont forget my list ! aaargh!! I feel like I need a babysitter! So tired today! Winter cold here with a cold wind blowing-dreaming of a tropical holiday now - still missing my bc interrupted trip to japan that would have been next month- it will be a while before I can cross that off my to do list now :( maybe Vietnam or USA next year :) Love to travel! Any others here with the travel bug?? and planning trips ? (((everyone))) Robyn",
      "MessageIndex": 1188,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jun 17, 2011 05:25AM Robyn_S wrote: Hi Candice! I hope you are feeling better after your er trip. It is never too late to dream- I have done everything backwards. Married at 17 mum at 19, casual work for years in bars, divorce @ 36, started college @36, finished degree @ 40, repartnered @ 41 and research work and now doing a phd so still a student. I travel for conferences every 2 years and to SE Asia as it is so close and cheap to visit from Australia. I had a visit to Boston. NY and LA 2 years ago and loved it- I can't wait to take the youngest (13yo) to the US and visit Disneyland! We have only really travelled the last 6 years but covered a lot if ground - Europe, Thailand, Bali, Malaysia, USA, Fiji. Making up for a long time without holidays all those years when young. Glad I have done that now that BC has reared its ugly head. One thing reinforced by a bit of BC introspection is that our life is the here and now, and the journey is made joyful in knowing that we are traveling toward our goals that are purposeful, productive and unselfish. I think the maxalon is working :) !!! The mind races while the body droops! X x x",
      "MessageIndex": 1190,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 14, 2011 05:46AM Robyn_S wrote: Hello May ladies! I am in envy of your chat of hot weather there! It is so cold here in oz that even the occaisonal hot flash is a bonus! Lifelover I had the first taxotere last week after doing 3 FEC and it is a breeze compared to FEC! I had a bit of fatigue and flu like aches and pains around day 3-5 but that eased and feeling very normal now. But best of all- no real nausea at all! Tummy is fine too so different to FEC!! I was cautious and used warm water to rinse the nether regions ESP first 2 days as taxotere is irritating on exit! I am also taking L acetyl carnitine to prevent neuropathy and have not had any tingling or numbness in my hands or feet so far. Has anyone else here experienced any neuropathy so far on T or TC tx? I heard about glutamine and researched before deciding to take LAC as there is a trial ATM looking at using l actyl carnitine i prevention of CIPN. Robyn",
      "MessageIndex": 1571,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Jul 31, 2011 09:00PM Robyn_S wrote: TXladysara - the irritated eyes are a SE  -less allergy and more due to dry eye - it  will make them itchy swollen and watery. I use a lubricating eye drop several times a day to help and it works better than using an anti-allergy eye drop. The taxotere last week kept me very low this weekend -  fatigue is still easier than nausea although everything tasts a bit off at the moment. Cannot believe how much a person can sleep and still feel tired! At least the aches are easing! It is annoying to be so puffed out over little things! Glad I only have one more to go and then 25 rads....in the home stretch now! Laureen - fingers crossed for a healthy test result! - the taxanes are powerful lil drugs -  just think what it is doing to the bad cells! For reference I had a small wart on my arm before chemo that has all but disappeared like magic! so I just imagine that any stray  BC cells have met a similar fate!",
      "MessageIndex": 1729,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Sep 24, 2011 07:07AM Robyn_S wrote: Hello girls! I had my last taxotere on august 16th and have done 10/25 rads and it is so much easier than chemo! The fatigue after chemo gas finally abated in time for the rads fatigue to set in!! But all in all feeling so much healthier now - the taxotears have gone at last and nails are okay and sporting a healthy 1 inch crop of salt and pepper fuzz! I feel as though I have run a marathon with chemo! 3 more weeks of tx then tamoxifen then exchange surgery... Should be all finished in time for my first cancerversary! I pop in to see how everyone is doing, it is heartening to see others finish treatment- congratulations MamaV and Cyborg! And others almost there too. It is hard when everything aches but there is an end and I never thought that I would feel so good after feeling so ordinary for so long but it does come to be at an end and you all will recover from this! Wishing everyone strength and energy to continue through!! (((hugs))) Robyn",
      "MessageIndex": 2004,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "Nov 11, 2011 06:34AM Robyn_S wrote: Hello everyone - hi bak69- I had the TEs in immediately foll the BMX but they were not filled apart from 100ml or so at surgery. The RO didn't want filling to try to get a good angle on the chest wall for rads where the tumor was at 1 o'clock. Made sense at the time and I am prepared to be patient with reconstruction. Don't know when that will be now- after 5 days on IV abs I am having surgery in the morning to try to clear out the infection and try to save the TE. The boob of death erupted today and ruined a perfectly good pair of pajamas and gave the surgeons some especially painful points to prod at while shaking their heads (never a good sign!). Anyway they are calling in the PS and another professor rather than rush anything during surgery- I feel very safe in their hands. Just want to go home! Congrats Loviesmum on finishing rads !!! Look after yourself Laura- I hope that you get to be all finished for Christmas!! (((take care))) Robyn",
      "MessageIndex": 2162,
      "PostDate": "11/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 4, 2011 08:47PM Robyn_S wrote: Welcome Mccrimmon324! As has been said before we are sorry that you have to join our group, but I am sure that the support and camaraderie that comes with knowing that everyone here knows exactly how you feel will help you on you own journey! It is a whirlwind in the first month but reading what has been experienced by others for each step of your treatment is helpful and purposely taking one day at a time is great advice that I was given by others here! (((((HUGS))))) take care! Robyn",
      "MessageIndex": 99,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 9, 2011 01:56PM Robyn_S wrote: Happy Tuesday ladies! It has been one week since my first FEC and feeling much betterby the hour! It pretty much went to plan with nausea under control the first three days with emended &zofran etc and then tolerated for the next four with maxalon. Tired now and had a very quiet sleepy weekend but am back at work on short days- I am a phd student/ scientist so it is flexible as my workplace is a childrens hospital with wonderful supportive colleagues. I take public transport to work and go very early avoiding peak times (germs) and get home early to rest a bit. It is do good to think about something other than cancer!! I must say after this week I finally feel as though the body has caught up to the dx - never felt like a cancer patient until chemo!! Even with no boobs and grim head shaking doctors!! Looking forward to two 'healthy' weeks til next tx. Hair is staying put so far - day 7 .... Counting down! The upside is that it is winter in oz so hats n scarves won't be too hot to handle- having it cut this week tho- maybe time to experiment with a short cut I have never tried before - my daughter is a hairdresser so have given her free rein to make over momma! (((hugs)))) for those in the chair this week!!!",
      "MessageIndex": 202,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 21, 2011 11:12PM Robyn_S wrote: Cyborg- The theory behind fasting is to give a push for the natural protective mechanisms that healthy cells possess and cancer cells don't due to the oncogenes being jammed in the on position. The body has to be stressed to switch to famine mode which is induced by low blood glucose levels. This initiates the protective pathways. BKJ66- The mayo clinic trial also looks at shorter periods (24 hours) of fasting but I would not count on a light diet producing the protective effect. the 62 hours pre/24 post comes from Dr Longos research and what he has advised Windlass who has communicated with him. I have been lucky in that my appetite is somewhat diminished and being not too enthused looking ahead to the next week after feeling so good for the last 10 days! Only 5 more to go!!!!",
      "MessageIndex": 517,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 22, 2011 04:57PM Robyn_S wrote: Hi marybe! Keeping up your strength is important and doing a fast ONLY with the knowledge and ok from your MO is vital. The research found that while patients lost weight over the fast, they gained it back very quickly, more importantly blood counts in the patients recorded were much better with fasting which of course is protective against disease. Protecting healthy cells is my motivation as at 46yo I need to use them for a long time! That is why trials are being done now as pilot data is very promising- as a scientist I appreciate seeing theory and solid research being translated to something practical! Too often good research does not get used unless there is money to be made by a drug company! You have to keep up liquids so dry heaves are not a problem! The nausea was awful for me last time without fasting and lasted 10 days with meds to keep everything down and then the anti nausea cause constipation and headaches so I take more meds for those SEs..... Ugh! I was ill and rattling! First day at work in a scarf to cover the poor sore scalp- feel quite shy but I am sure will get used to it over the next 6 months! ((((hugs))))) to all those in the chair this week!",
      "MessageIndex": 531,
      "PostDate": "22/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 21, 2011 02:55AM Robyn_S wrote: Well the hair has decided to depart at day 19 post FEC and luckily it was a sunny, windy day - I sat in the sun and had a great scratching session- bliss without the clean up as my long suffering strands decorated the garden lol. I start my fast tomorrow in preparation for chemo no# 2 on Tuesday. That will be hard as I have been enjoying my food now my sense of taste and smell is back to normal. Funny but I think that chemo has cured my Samters syndrome. I rarely have a functioning sense of smell or taste as I have chronic inflammation of upper airways, asthma and react badly to aspirin or NSAIDs. I have been working with only a couple of days off. I took a month off after the BMX and that was vital to recovering enough to tackle chemo. I hope everyone is having a restful weekend and not feeling too blah!",
      "MessageIndex": 500,
      "PostDate": "21/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 23, 2011 04:52AM Robyn_S wrote: Candice- you poor thing! I hope that you get some relief from the pain in your sore spots soon! Welcome to Barb in BR! You have lots of company in the chair on Tuesday! (Mental image of lots if strange women holding hands around the world!!!!) Cyborg- I think that the steroids are the best part of the chemo- it cures the asthma problem I have, the respiratory specialist will only prescribe a short term course on special occasions to get my sense of smell working! unfortunately the chemo means everything will smell like mouldy chemical oranges for 10 days!!! Win some lose some! I am glad you have a positive MO - it gives confidence when the people looking after you are research receptive! My doctors are all involved in clinical research st the centre here- I am starting a clinical trial and will get an extra injection tomorrow which is part of the D-CARE trial into denosumab. It is a double blind RCT which means that neither me or the doctors will know if I receive the antibody or the placebo. The upside is that I will have bone scans and CT for the next 5 years which will hopefully give peace of mind. As a researcher and patient I appreciate that every treatment we have has been tested in one study or another on brave women long ago. Best wishes everyone! Robyn",
      "MessageIndex": 548,
      "PostDate": "23/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "Robyn_S",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121847/profile",
      "Content": "May 25, 2011 07:07AM - edited May 25, 2011 07:09AM by Robyn_S",
      "MessageIndex": 650,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    }
  ]
}