{
  "AuthorID": "Robynmummy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
  "Posts": [
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Robynmummy wrote: I had a second mammogram in late November, and the...radiologist?  said he needed to schedule me for a core biopsy.  He said there were two sites that were \"not classically benign, but not classically cancer.\" Yesterday, I had my biopsy.  It was clear the...doctor?  Radiologist? didn't think the sites were of concern.  He said the one looked benign to him, and the other one he decided not to biopsy, saying it was too close to the skin surface to get a sample.  The one site he biopsied, he wasn't sure if he got a sample, as it is not a lump but a cluster of calcifications. I was happy and reassured yesterday with his comments, but now I'm a little less so.  If one doctor thought further testing was needed, and the other didn't...well, that's not reassuring, if the test results are inconclusive (as they will be, since one site wasn't biopsied, and the other was likely not succesfully done).  The radiologist told me it's largely a matter of opinion when looking at mammograms.  Again, not reassuring, as I have no way of knowing whose opinion is correct! I go in for the results in two weeks.  Can people offer advice as to what questions I should be asking the doctor? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763047",
      "Title": "Not sure how to interpret yesterday's biopsy experience Robynmummy Robynmummy"
    },
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Jan 8, 2011 04:53AM Robynmummy wrote: Thank you!  Oh my goodness, that was helpful.  I've been googling online (a dangerous sport, I know!), trying to figure out how to interpret yesterday's event....but your insights are by far the most helpful. My gut feeling was that I didn't have an all clear, but rather a \"not enough information.\"  You've given me the language for asking for that more information.  I'm grateful!",
      "MessageIndex": 2,
      "PostDate": "08/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763047",
      "Title": "Not sure how to interpret yesterday's biopsy experience Robynmummy Robynmummy"
    },
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Jan 17, 2011 10:02AM Robynmummy wrote: LISAMG - I had a core biopsy done of one site but they don't think they got a sample of the calcs; the other site they didn't even attempt because it was so close to the skin.  The other one was near the chest wall and they were having a hard time marking it.  Truthfully, I don't know if the surgeon is going to recommend monitoring by mammo or an excisional biopsy - I find out Thursday.  My GP, who looked at the reports, told me to expect an excisional.  So, I want to be ready to ask questions in case that's what the surgeon recommends. lolaUPhere - I sent you a PM  ",
      "MessageIndex": 3,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763434",
      "Title": "Any questions I should be asking about an excisional biopsy? Robynmummy Robynmummy"
    },
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Robynmummy wrote: My GP told me to expect this as a possibility at my follow-up appointment next week. If my surgeon recommends this, what questions should I be asking?  Or what should I ask for?  And how soon should I reasonably expect this to be done? Thanks in advance for any advice you can offer, -Robyn Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763434",
      "Title": "Any questions I should be asking about an excisional biopsy? Robynmummy Robynmummy"
    },
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Jan 18, 2011 03:24PM Robynmummy wrote: That's helpful!  So, only two days off work, right?",
      "MessageIndex": 5,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763434",
      "Title": "Any questions I should be asking about an excisional biopsy? Robynmummy Robynmummy"
    },
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Jan 18, 2011 10:07PM Robynmummy wrote: Eloise, those are excellent questions.  Thank you.  I'm going to include them with the list I'm compiling. Very glad I put the question to this board; I wouldn't have thought of asking half ot these.",
      "MessageIndex": 8,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763434",
      "Title": "Any questions I should be asking about an excisional biopsy? Robynmummy Robynmummy"
    },
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Jan 15, 2011 08:12PM Robynmummy wrote: Thanks everyone.  I think I am going to ask a friend to come.  I have a friend in mind - we've been through a lot together.  If she can't make it I'll ask my MIL, who also lives close by.  She's a bit of a Negative Nelly, however she loves me, is supportive and an RN to boot. I'll be sure to let you all know the outcome.  I'm grateful for all the advice and support.",
      "MessageIndex": 10,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763371",
      "Title": "Going to follow-up appt on biopsy alone: crazy? Robynmummy Robynmummy"
    },
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Feb 2, 2011 01:54PM Robynmummy wrote: Wonderful, wonderful news! I'm hoping I'll be able to come here in a few more weeks with similarly good news. Rejoicing with you.",
      "MessageIndex": 6,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/764248",
      "Title": "Finally! lolaUPhere SarahsMom"
    },
    {
      "AuthorID": "Robynmummy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118324/profile",
      "Content": "Robynmummy wrote: I had a core biopsy done last week, and go for my follow-up appt on the 20th.  I expect the results will be inconclusive, as one they couldn't biopsy because it was too close to the skin, and the other site was so close to the chest wall, the doctor is pretty sure he didn't get a good sample. So, I'm expecting they'll be either recommending an excisional biopsy or keeping an eye on the sites by mammogram.  My husband has a long-scheduled conference on the 20th, but because it is highly likely to be a \"No News\" kind of meeting, I told him not to cancel. Am I crazy to be going to this alone?  Should I ask a friend along?  I'll feel pretty lame if it turns out to be benign or inconclusive, as I expect it will be... Man.  Waiting is so hard! -Robyn Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763371",
      "Title": "Going to follow-up appt on biopsy alone: crazy? Robynmummy Robynmummy"
    }
  ]
}