{
  "AuthorID": "Robyn78",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267772/profile",
  "Posts": [
    {
      "AuthorID": "Robyn78",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267772/profile",
      "Content": "Robyn78 wrote: Hello everyone, I had my diagnostic mammogram (I'm 41), and unfortunately, they found one small (12mm) mass in my left breast that is not a cyst because it is solid. They can't feel it, though I'm pretty busty. While the doctor said she's not overly concerned, they do want to biopsy it next Thursday and see what it is. I don't have any other info yet besides the dimensions. My question as I get ready for 10 days of stress, is what will the biopsy show if it is cancer? Would the next steps be more biopsies around the area and/or lymph nodes to see if it has spread? Or does that require an MRI? They can tell at that point what type of cancer it is? I know the odds are it's benign, but I already failed the statistics that said the odds of needing a biopsy after a diagnostic mammogram were small, so I'm trying to prepare for the worst. (And for some reason, they added a letter to my patient portal that said congrats, the results of my recent mammogram were normal and benign, ha. I'll have to correct them on that.) Thanks for any info! ETA: I know we all get this news when life is crazy, but I almost have to laugh. I have a midterm in class next week, and a potential job interview tomorrow. I'm not sure how I'll concentrate on either one! UGH. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862193",
      "Title": "Scheduled for biopsy for 1 mass Robyn78 dventi"
    },
    {
      "AuthorID": "Robyn78",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267772/profile",
      "Content": "Feb 2, 2018 07:33PM Robyn78 wrote: Thank you both for your replies! Bethelysa, I'm crossing my fingers we both get good news! Thank you, Georgia1 - I haven't seen a copy of my ultrasound report, and maybe that's a good thing so I don't obsess over any terminology. I'm assuming the BiRads score would be a 4a or 4b, only based on what I was told so far, which wasn't much. The radiologist just said (when I asked her if she was leaning one way or another) that it was indeterminate. They didn't do any kind of an additional physical yet, and I'm not sure if I'd even know if a lymph node was swollen myself. I'll try to take a deep breath (many of them!) over the next 10 days or so, and I'm very appreciative that the results are within 2-3 days of the biopsy, but just unfortunate scheduling timing has me waiting out a weekend before I'll get the report. ACK.",
      "MessageIndex": 3,
      "PostDate": "02/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862193",
      "Title": "Scheduled for biopsy for 1 mass Robyn78 dventi"
    },
    {
      "AuthorID": "Robyn78",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267772/profile",
      "Content": "Feb 12, 2018 03:14PM Robyn78 wrote: Thank you momto3sons!",
      "MessageIndex": 5,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862428",
      "Title": "Biopsy results in - benign! Robyn78 Robyn78"
    },
    {
      "AuthorID": "Robyn78",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267772/profile",
      "Content": "Robyn78 wrote: Hello all, I had posted here recently and just wanted to share my results for anyone with a similar process. I went in for a screening mammogram (I was a bit late, I'll be 42 in a couple of weeks) but have had mammograms and ultrasounds in the past for various things. I was called back for what they called a focal nodule asymmetry. Waiting for the diagnostic mammogram was the worst! I had it, and they still saw the mass so onto US I went. They said it was a 12mm x 6mm x 10mm mass (I think). The radiologist wasn't \"super concerned\" but was able to tell it wasn't a cyst so it needed to be biopsied. Got in for the biopsy a week later, which was relatively painless, and just got my results today - a fibroadenoma. I wanted to share because I'm another person with this benign result who isn't in the most common age group for it. Maybe I've had it for awhile? I'm not sure. But I was worried that it wouldn't be this because I'm a bit older. So hopefully this is reassuring news for anyone with a similar issue. This is a great community and I'm so glad I was able to post here while I was waiting. Thank you everyone, and I'm hoping for the best news for us all, today and in the future. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862428",
      "Title": "Biopsy results in - benign! Robyn78 Robyn78"
    },
    {
      "AuthorID": "Robyn78",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267772/profile",
      "Content": "Feb 12, 2018 02:31PM Robyn78 wrote: Thank you Silbar! Hi doon8457, sorry, I have not had those particular symptoms. My mass wasn't felt, but I know many benign masses can be. I would definitely check with your doctor and see what they say, and my fingers are crossed that it is nothing serious! Any noticeable changes are certainly worth getting checked out.",
      "MessageIndex": 3,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862428",
      "Title": "Biopsy results in - benign! Robyn78 Robyn78"
    },
    {
      "AuthorID": "Robyn78",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267772/profile",
      "Content": "Feb 13, 2018 01:49PM Robyn78 wrote: Hi Nikki444, I wish I had an answer! Unfortunately, I never even saw my ultrasound report, so I didn't get any terms that might have described my mass. And I didn't have an indent. Just the mass that first showed as \"asymmetry\" and then they determined it was a solid mass, so not a cyst. All I got was the dimensions. I think you can post your questions to djmammo in one of the forums - I believe he's a retired radiologist who can help with questions about terminology, etc. I hope you get good news!",
      "MessageIndex": 8,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862428",
      "Title": "Biopsy results in - benign! Robyn78 Robyn78"
    }
  ]
}