{
  "AuthorID": "Rockerwife",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
  "Posts": [
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Rockerwife wrote: Just diagnosed with Triple Neg Breast Cancer. Still in shock.....My lumpectomy is scheduled for Feb. 20th. I am not sure what the treatment plan is for sure. I will know more after surgery. This all happened so fast. I am really scared. Thank you for listening. It is the Season of Life Dx 2/11/2015, IDC, 1cm, Stage IB, Grade 3, 0/1 nodes, ER-/PR-, HER2- Surgery 2/19/2015 Lumpectomy: Left; Lymph node removal: Left, Sentinel Surgery 2/20/2015 Lumpectomy: Left; Lymph node removal Chemotherapy 4/6/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828397",
      "Title": "What is the prognosis for TNBC Rockerwife Nancy2581"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 27, 2015 06:58PM Rockerwife wrote: Stephmoen- The same thing happened to me. I had a fever, sore throat and WBC was .8. The also pumped me full of saline and antibiotics. While I was there they gave me Neupogen and that helped bring by counts up. It is so frustrating that we have to end up going to the ER and then get hospitalized for the Oncs to realize we need the shot. I get my second treatment on Wednesday the 29th and I am for sure getting the Neupogen shot. I am a little more apprehensive this time even though I will have the Neupogen because I got so sick so fast. I feel like I need to be hermit, just to stay away from germs. Making me paranoid because I don't want to end up at the hospital again.",
      "MessageIndex": 910,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 28, 2015 09:45PM - edited Apr 28, 2015 09:46PM by Rockerwife lovlilynne- I am going for TC # 2 tomorrow. On a 3 week schedule Positive - spirit my night sweats began the second week after TC #1, They have continued since with intermittent severity. Some nights soak the sheets other nights I just wake up before it soaked through. It is gross and even with 2 fans it continues . It is forcing menopause on our bodies. I was premenopausal before and never had night sweats like this. I was always freezing cold. I did get my period right on schedule during my first round. I doubt it will show this second one",
      "MessageIndex": 970,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 10, 2015 12:26PM Rockerwife wrote: The doctor agreed to discharge me even though the Echocardiogram results were not in yet. I still have to go back for a treadmill stress test this week. I have a sneaky suspicion that the Neupogen is still the cause. Making my bone marrow work overtime to produce those 23,000 Neutrophils had to have put strain on my heart making it work harder. I certainly do not want to go through that again. So, no one knows anything or why this happened. Glad to be home and thank you for all the prayers. Happy Mother's Day Ladies.💜😘",
      "MessageIndex": 1301,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 16, 2015 08:21PM Rockerwife wrote: So it's my turn to be in the ER yay. Started running a fever today and have a horrible sore throat. Doc thinks I have a sore by my lymph nodes. I can't swallow with out it hurting. I will know more when all the labs come back",
      "MessageIndex": 521,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 20, 2015 11:33AM Rockerwife wrote: Chemoflage for TC# 3",
      "MessageIndex": 1568,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 20, 2015 09:24PM Rockerwife wrote: Rpayton and ankledolphin- they are called chemo beanies. I ordered them on Amazon. I love them because they slip right on and are comfy. Chemo beanies were created by two sisters that both had breast cancer five years apart . When the second sister lost her hair nothing fit. So they created chemo beanies .",
      "MessageIndex": 1577,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 1, 2015 02:39PM Rockerwife wrote: Littleblueflowers- That post was amazingly powerful. Every word you wrote had incredible deep meaning. Seriously, it was so moving and poetic . Thank you for sharing. I Couldn't agree more. Lisa",
      "MessageIndex": 1083,
      "PostDate": "01/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 9, 2015 08:36AM - edited May 9, 2015 08:42AM by Rockerwife I wrote a postwith the pic and IDK where it went ? Sorry. There is a funny spelling mistake in the pic. Can you see it? They decided to keep me over night because they ran three Tropopnin tests and 1/3 had elevated levels that meant possibly something wrong with my heart. The other two were perfect. I am on a heart monitor, had an echo done. I still think it was a reaction to the massive rise in WBC counts from 7 days worth of Neupogen that caused my heart to race and me to get dizzy and lightheaded . I doubt my Onc will buy that. I track everything and I know that after shot four I had heart palpitations . It continued with each shot and then the lightheadness kicked it. Neupogen can cause heart racing in rare cases. I will see what the dr on duty today says about my theory. Oh and the want me to do a treadmill stress test. It is the weekend and they don't do that until Monday . I hope they let me go home and then do out patient for that. I don't wan to stay here until Monday",
      "MessageIndex": 1279,
      "PostDate": "09/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 21, 2015 10:07AM Rockerwife wrote: For those that were inquiring about the Chemo Beanies.",
      "MessageIndex": 1595,
      "PostDate": "21/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 25, 2015 11:10PM Rockerwife wrote: Headed to Sandiego with the family for the weekend. Hoping to get some real rest. Today is day 15 PFC and I am still dragging and having heart palpitations. I start Radiation on July 1st. Ksusan the sims and tattoo is not bad . I pushed and got all that done prior to TC 3 so that could start radiation on July 1st. I wanted to be done before I have to teach in August . Littleblue the hiking trip sounds awesome.. Lynn enjoy your vacation. Kbee you are a very strong woman. The leader and power behind this group. I just want to get done and move on. It that is possible. I try not to dwell too much. My focus is to get rads going and see if I am strong enough and not having heart palpitations, so I can get back to the gym. I am so weak now. I will probably have to start back at 8 lb weights. My gym is circuit training so it is a mix of cardio and strength. Both of which I no longer have the endurance for. I will basically be staring from scratch. Ironically my whole body is staring over. Have a great day and weekend. Remember like my tag says\" Tis the season of life\" This has been a hard season of life for all of us sisters! Lisa",
      "MessageIndex": 2657,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 21, 2015 09:59PM - edited Apr 21, 2015 11:21PM by Rockerwife Today is day 14 and on day 12 I had the husband buzz my head to a number 2. If I lightly pull on the hair on my head it will come out easily.Same with the hair in in other places",
      "MessageIndex": 681,
      "PostDate": "21/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 28, 2015 09:12PM - edited May 28, 2015 09:14PM by Rockerwife Yay Steph glad they got it going. Addie your wig looks beautiful I would've never known. As for me, I'm waiting to see if my counts rise on their own.yesterday my neutrophil count was 1000. I did four out of the five neupogen shots on days one through four after chemo. Only did four because of the reaction last time and the doctor was fine with that. I called the doctors office to see if I can go ahead and use the fifth shot and no one has gotten back to me since yesterday.. I also emailed the doctor yesterday and asked him the same question with no response. So ladies, do you think I should go ahead and use the one extra shot I have left to help raise my neutrophils? Today is day 8",
      "MessageIndex": 1833,
      "PostDate": "28/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 28, 2015 07:47PM Rockerwife wrote: Lbf- thank you. I am wearing a chemo beanie. I love them. The company was founded by two sisters that both had breast cancer. They slip right on and are comfy. I do wear a light cotton cap under for more coverage. This one is a little see through and it gets super windy here.",
      "MessageIndex": 959,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 8, 2015 10:52PM - edited May 9, 2015 08:06AM by Rockerwife",
      "MessageIndex": 1272,
      "PostDate": "08/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 26, 2015 11:28PM Rockerwife wrote: Yes. Littleblue I definitely had weird symptoms and have often wondered if it was related to BC. I had a tooth go bad and I got a root canal on my left side . BC side. Following this I had a chronic headache for a month that no pain pill could touch. Also. My mood swings were iratic and I often got upset for no reason . The night I found my tumor I had a stupid freak out sessions on my husband because I couldn't wrap my head around what to do for dinner. I was fuming mad an emotion wreck over something so trivial. I remember I went to the gym and worked out pissed off. When I took off my sports bra before my shower I noticed I had a bruise on my right rib where the underwire hits. I thought that is strange let me check the left side . Ribs on the left were good but WTF is that on my boob? Yes I could see see the shitty tumor. Welcome to the world of. CANCER",
      "MessageIndex": 2694,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 7, 2015 10:19PM Rockerwife wrote: Nice wig Littleblue. Ksusan I am right behind you on finishing TC. Wednesday is last one. The day before last chemo I get my Tattoos for radiation which will start on July 1st.",
      "MessageIndex": 2146,
      "PostDate": "07/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jul 23, 2015 10:26PM Rockerwife wrote: Hi everyone I haven't posted in a few weeks so I thought I would give you all an update. I finished chemo June 10 and 3 weeks later started radiation . Time flies I have 4 boosts left and I am done with this shit. On a work related note, I got a text from my assistant principal asking if I wanted boarders up in my new room. WTF they moved my class and no one told me. They assumed that I new. Oh well",
      "MessageIndex": 3464,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Mar 26, 2015 10:45PM Rockerwife wrote: Littleblueflowers I think our chemos are different based on how agrressive the Oncologist needs them to be. It might have to do with the size of the tumor and if there was any lymph nodes involved. I know AC+T was presented to me, but he felt in my case TC was the better choice. Oh I got my BRCA results and I am negative",
      "MessageIndex": 63,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Mar 29, 2015 12:03AM Rockerwife wrote: Littleblue I don't think it would interfere. I was on my period when I had my lumpectomy and that was surgery",
      "MessageIndex": 72,
      "PostDate": "29/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 3, 2015 12:11AM Rockerwife wrote: Vanmama I am glad they got it under control. How scary for you. I cut my hair being that I start on the 7th. Top is before. I am making a goofy face. Below is after.",
      "MessageIndex": 171,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 8, 2015 10:57AM Rockerwife wrote: Had my first TC yesterday, April 7th. Doing okay so far. Keeping on top of nausea by taking of zofran on time. Last day of steroids is today. I have always had a little acid reflux and that is acting up so I am taking Zantac. Also taking a probiotic to keep my gut in order. Oh yea, I took miralax the night before chemo and the night of. So far still constipated from Zofran. I am keeping a journal and wrote down a lot of notes. It was a long process yesterday.",
      "MessageIndex": 257,
      "PostDate": "08/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jul 23, 2015 10:28PM Rockerwife wrote: ",
      "MessageIndex": 3465,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 8, 2015 08:03PM Rockerwife wrote: Littleblue I have a vitamix and drank a protein shake a few hours before my first chemo and drank about 4 cups of water. I was so hydrated and I know that helped. So with all that fluid including the saline, I had to take my IV cart to the bathroom about four times during my session. I was trying to keep my sense of humor and asked other patients if they wanted to race. It lightened the mood and some laughed and others didn't get it. I went for an hour walk with my Sis today and that felt good. Like KBee said fatigue will come in play and I want to do what I can before I go down. I was working out 5 days a week before all this cancer fun. I will get back there in a few a months",
      "MessageIndex": 270,
      "PostDate": "08/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 28, 2015 12:28AM Rockerwife wrote: Ksusan- I agree with your #19. Me too",
      "MessageIndex": 2735,
      "PostDate": "28/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 10, 2015 07:56PM Rockerwife wrote: Today is day three past first Chemo and everything hurts from my head to my toes. I went to check the mail and felt like I needed a walker. How many days does the discomfort last? Even my scalp hurts",
      "MessageIndex": 344,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 16, 2015 08:17PM Rockerwife wrote: So it's my turn to be in the ER yay. Started running a fever today and have a horrible sore throat. Doc thinks I have a sore by my lymph nodes. I can't swallow with out it hurting. I will know more when all the labs come back",
      "MessageIndex": 520,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Aug 15, 2015 07:26PM Rockerwife wrote: Littleblue I sweated during rads. I went to the gym every morning during rads and I was fine. I never had too much fatigue since the morning exercise gave me energy. By the afternoon I would feel it more and nap if needed",
      "MessageIndex": 3986,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jul 29, 2015 08:38PM Rockerwife wrote: Just popping in to say hello. Today was my last day of radiation. I am really red and very itchy. The doctor said it could get worse before it gets better, but it should be healed in about two weeks. That's good because I don't want to accidentally forget and scratch my boob in front of my 5th graders. I went into my new classroom and put it back together. One of my parents that finished treatment for breast cancer two years ago, came in. She is so creative and basically put up all my bulletin boards in less than three hours. She is so creative! I am lucky to have great parents that are able to help. It will good to get back in the swing of things and teach, Congrats to Lynn Happy B day- KSusan",
      "MessageIndex": 3585,
      "PostDate": "29/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Aug 15, 2015 06:34AM Rockerwife wrote: Hi everyone just checking in. I finished the first week of school with my new class of 5th graders. On day one I did an activity in which they got to tell me what they already knew about me. So they knew my son is also in 5th, but in another class and a few other things. Then one student stated, we also know that you always wear that thing on your head. So I said,\" do you know why?\" Jokingly I told them it is a brain warmer. Of course, they all said, \"no it's not.\" We know you went through cancer,but we didn't want to say because we thought it would be mean. They were too funny. One of my boys told me he liked it and that I look like a gypsy especially with my hoop earrings. I said thank you that was the look I was going for. Meanwhile I have no bottom lashes and only a few top ones. About 1/4 of my left eyebrow and maybe 3/4 of my right. My hair is coming in super gray. No more super smooth lady bits. That stuff is growing faster than the hair on my head. All healed up from Rads. I used an organic aloe by Aubrey and medical barrier cream by Epionce. Seemed to really helped. I did get super red and itchy. Also had the stiffness and a rash that KSusuan wrote about. It took 2 weeks to feel better. Good to be back at work and not focusing every second on cancer crap. Just trying to get back to normal. Have a great weekend. Lisa",
      "MessageIndex": 3975,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Aug 15, 2015 05:05PM Rockerwife wrote: Thank you Littleblue! The video was hilarious! Especially the \"sperm\" shaped eyebrows. I think I might've drawn those. Opps",
      "MessageIndex": 3984,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Mar 31, 2015 01:27AM Rockerwife wrote: Littleblue happy to hear your scan and markers looked good. Positive vibes and thoughts to the survivor of the helicopter crash.",
      "MessageIndex": 126,
      "PostDate": "31/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 7, 2015 03:15AM - edited Apr 7, 2015 03:15AM by Rockerwife Tomorrow is my first infusion-4-7-15. Can't sleep from the steroids andit is past midnight. I thought Xanax would knock me out. It's not working and my DH snores like a machine. I will post details tomorrow. I am keeping a log as Kbeee suggested. Also took Miralax as suggested from my Dr. Friend that just finished her Third cycle of TC.",
      "MessageIndex": 229,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 13, 2015 03:44AM - edited Apr 13, 2015 03:49AM by Rockerwife Mamajen- so good to feel normal Ali- I don't have a port",
      "MessageIndex": 388,
      "PostDate": "13/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 17, 2015 08:07AM Rockerwife wrote: Thanks for the good vibes ladies, however they ended up admitting me for neutropenic fever. WBC were 80 and 500 Is considered normal . I have some sort of throat infection and it is so frigin painful to swallow. They are throwing everything at it, since they are still waiting on some jabs and cultures . On two different iv antibiotics.They even gave me Tamiflu. Encase you are wondering , I never had the Nuelasta. Why do these Oncs play Russian Roulet with our bodies. I know the shot isn't always successful, but they wait until we get hospitalized to do it the next cycle . I don't even know if he will even give it? Have all my sisters who received the shot stayed out of the hospital ?",
      "MessageIndex": 530,
      "PostDate": "17/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 28, 2015 07:32PM - edited Apr 28, 2015 07:35PM by Rockerwife Ksusan- thanks you look hot too. I hope I look as good as you post TC # 2 tomorrow. Oh I am sleeping in a Buff. Still getting so sweaty. This chemo has made me have awful night sweats . Anyone else???",
      "MessageIndex": 956,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 29, 2015 11:09PM Rockerwife wrote:  Had TC # 2 today. Sent me home with 7 days worth of Neupogen. My Onc said it might be over kill, but he feels this will help prevent me from getting hospitalized. Although nothing is a guarentee, it worked to bring my WBC up in the hospital. Had mild chest pains when they started the Taxotere. So they stopped and gave me more Benedryl. I was good after that. Here are some goofy selfies of my sister and I at chemo.",
      "MessageIndex": 1029,
      "PostDate": "29/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 19, 2015 04:38PM Rockerwife wrote: I just had my follow up from my last hospital stay and echocardiogram gram looks good and so does the treadmill stress test. Yay for Ksusan and I on that one. My liver fiction test is still high. I have TC #3 tomorrow. I see Onc before chemo wonder what he will do about that? Lower my chemo? Also I have the neupogen thing to discuss. I know that it was the neupogen that landed me in the hospital with dizziness and palpitations. I don't want 7 day course of it. I'll do 4 but spread out. I should have some say right ? I will post bio when I get on my laptop later",
      "MessageIndex": 1542,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 19, 2015 06:53PM Rockerwife wrote: Lynn, I am doing Neupogen and he had me do 7 shots starting the day after chemo. It was after the 4th shot that I started having dizziness and heart palpitations. So I am concerned about doing another 7 days . If I only did 4 and he spaced them out, I might be okay with that.",
      "MessageIndex": 1548,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 19, 2015 10:18PM Rockerwife wrote: Here is my very overdue bio. This is the very condensed version. I am 46 years old and have one son that is 10. I also have two step sons, one is 14 and the other 17. We only have them every other weekend if that. I grew up in Miami Florida and went to school at University of South Fl in Tampa. I got my Bachelors in Sociology. Moved to Southern Ca when I was 26 because my family came out here. I entered into a teaching credential program because there is not much you can do with just a BA in Sociology.I took a long time finishing that program due to certain requirements that forced me take extra classes. So I began teaching at 31. I married my first husband at 29 and divorced him at 42 in 2011. We have one son as I mentioned before and share 50/50 custody. Soon after, I met my current husband. Married him March 2014. We had only been married a year when I got diagnosed. He is my rock, my soulmate, and my best friend. I would not have been able to get through this with out his support.   My Husband's best friend married us. In CA you can deputy commission someone for one day to perform a wedding. He had on clown shoes and at the end gave us clown noses to remind us to always laugh.",
      "MessageIndex": 1556,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 20, 2015 08:14PM Rockerwife wrote: Thank you for the positive feedback on my pic. I don't have plans to get a wig. I really like these chemo beanies . I just match them up to my outfit for the day. Chemo # 3 went smoothly. Oncologist still wants me on neupogen. I told him I would do four and not seven. Even though last time it was after the fourth that I got reaction. If I don't take it I will end up neutopedic. At a cross roads at this point",
      "MessageIndex": 1573,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 27, 2015 04:28PM - edited May 27, 2015 04:46PM by Rockerwife I don't get it? Last cycle I had seven neupogen shots and my counts skyrockets to 25,000. I had a racing heart with palpitations. Blood work before tc #3 were 10,000. So I went in with strong counts. Here we are at day sevenpast #3 and I did four neupogen shots instead of seven due to reaction and my counts tanked to 1000 neutrophils. I don't get it? Pissed.",
      "MessageIndex": 1794,
      "PostDate": "27/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 28, 2015 09:29PM Rockerwife wrote: As soon as I posted, the Onc finally emailedand said to use the remaining shot. Wish me luck that it does something.",
      "MessageIndex": 1834,
      "PostDate": "28/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 29, 2015 05:12PM - edited May 29, 2015 05:13PM by Rockerwife I am pretty sure the shot is working because I've been having awful back pain since last night. When I did the four shots days 1-4 post chemo, I had no pain from the shot. Just SE from chemo. Wonder why I feel the single shot and nothing from the four in a row?I won't know how high of ANC until June 9. Last tc June 10. Appt on June 2 with RO. Ksusan- love the comeback . That is classic ! ",
      "MessageIndex": 1875,
      "PostDate": "29/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 6, 2015 03:54PM Rockerwife wrote: Please tell me if I am over reacting. While in the grocery store a little bit ago my son (10) points out a lady that is very obviously on chemo. She even had a mask. So, I said okay thank you I see her. Then what really pissed me off is about a fewsec later my husband directs my attention to her. I was so mad that I told them that was disrespectful and just as bad as pointing out someone with a missing limb. I think what is eating at me is the disrespect and I wouldn't want people pointing me out? I am still irritated! Am I crazy to feel like this?",
      "MessageIndex": 2116,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 10, 2015 02:42PM - edited Jun 10, 2015 02:46PM by Rockerwife Headed to Last TC in a bit. I think Lynne asked abou getting set up for Rads. At my 3rd TC I asked Onc to put referral for radiation Onc. I met with her in between TC 3 and 4. Then rad Onc set me up for mapping where they mark you with sharpie where tattoos go. Tomorrow, day after chemo, to get the tattoos. I am starting rads 3 weeks after last chemo. I have 20 sessions with boosts that will just focus to on the incision. Probably because the tumor was so close to the skin. I was pushing to get started because I wanted to be done before school starts. I have to be back Ist week in August and didn't want to drive an hour plus in traffic after school to finish rads. The sex question. Yes I have done it just not as frequently as before chemo or cancer. Too many changes down there. Honestly, my nerves shut down due to chemo and I don't have sensitivity back until around day 12 after chemo. Plus it hurts and it never did. Even with lube. Thank you chemo. I was a nymph always the one attacking DH. Now he gets to be the instigator . I want my sex drive back. Oh yes water retention here and weight gain. I eat healthy and walk 3 miles almost every day up and down hills. I look preggers. Makes me mad! Gained 10",
      "MessageIndex": 2252,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 30, 2015 01:22PM - edited Jun 30, 2015 01:23PM by Rockerwife I am also TN but just did TC. Taxotere and cytoxan. Maybe it has to do with tumor size and whether there was node involvement. I chose to do a lumpectomy after research and surgeon confirmed that lumpectomy + chemo + radiation = mastectomy. Plus I didn't have node involvement. The nurse at my preop kept questioning my choice as she thought it was not aggressive enough. Who knows what the answer to this evil puzzle is? I did receive the highest dose for all four infusions. I think I hit it aggressively ! Seems like even the number of radiation sessions differs too. I start tomorrow July 1st and will get 15 and 5 boosts directly at my incision.",
      "MessageIndex": 2785,
      "PostDate": "30/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jul 1, 2015 12:04AM - edited Jul 1, 2015 12:05AM by Rockerwife Here is conference that I just listened to. A panel of six at MD Anderson discuss their individual battles with cancer. Some are doctors and others researchers. I thought it was interesting . This is the link: http://www3.mdanderson.org/streams/FullVideoPlayer... ",
      "MessageIndex": 2805,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Mar 26, 2015 01:15AM - edited Mar 26, 2015 01:15AM by Rockerwife Hi Littlebluefowers nice to meet another Tnbc. Are you going to be doing TC as well? I get my BRCA results tomorrow at my appointment with the genetics counselor. On Friday, I have one last meeting before chemo with my oncologist and an appointment following with the chemo nurse.",
      "MessageIndex": 52,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Mar 31, 2015 08:00PM - edited Mar 31, 2015 08:02PM by Rockerwife Kbeee thank you for theawesome comment !",
      "MessageIndex": 144,
      "PostDate": "31/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 10, 2015 08:57PM Rockerwife wrote: Sounds like my discomfort will pass in a few days Kbeee. You have a really positive attitude about your job. That is awesome Ali - no I didn't get the Nuestela shot",
      "MessageIndex": 347,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 11, 2015 08:25PM - edited Apr 11, 2015 08:25PM by Rockerwife Hi everyone - still having quite a bit ofjoint / muscle pain. I took Xanax to sleep last night. Today, I have slept on and off for a few hours. As far as the nausea meds, my nurse gave me a triple dose of Zofran at the infusion. I took another 6 hours later for the next day. Then I found I could stretch it out to 10 hrs and then finally 12 hrs. The last Zofran I took was Friday Morn. Never took the Compezine. The Zofran is highly constipating",
      "MessageIndex": 363,
      "PostDate": "11/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 19, 2015 05:39PM Rockerwife wrote: Hi everyone- I finally got released late yesterday afternoon. My WBC counts started to come up on their own, but not enough so they gave me the neupogen shot on Friday and by Saturday they were at an acceptable level. My fever went down and I wanted to get the heck out of there. I got the shot again Saturday a few hours before they discharged me. When my Onc visited me he said for sure I would be getting the neupogen next cycle . The bone pain is not fun,but didn't last too long. I hope this neutropenia stays away. LBF- I had a sore throat starting around day 4 after chemo and it can be part of the chemo according to all my paperwork . So I just kept rinsing with salt/baking soda.When mine persisted I still thought it's the chemo. Then my fever spiked on day 9 and I knew something was wrong. The ER got me right in when I told them I was on chemo and had a fever. It was fast! Then they did labs and sure enough my WBC was super low and my sore throat was infected.If your not running a fever, then you are probably okay. Go with your gut. Even when I called my Drs the assistant said , \"Oh it sounds like a common cold.\" I told her I don't think so and I am going to the ER. Glad I didn't listen to her.",
      "MessageIndex": 602,
      "PostDate": "19/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 28, 2015 07:22PM Rockerwife wrote: Stephmoen- I am sorry that the neupogen isn't working faster to get you back home. Good thing your counts are going up though. Once the infection is at bay the counts will shoot up. They even sent me home with antibiotics. Ksusan- My Onc just basically said I won't give that shot unless you need it. Well, I needed it. Did my pre chemo labs today and all is good. Higher than when I started.. WBC total 8000 and absolute neutophils 7600 yes! I wonder if my Onc will do labs during the Nadir to monitor. Good question for tomorrow. Lbf- I am shedding prickles too. My DH cut it to a number one last weekend and it hurt so bad that this past Sunday I had him take off the guard. ",
      "MessageIndex": 954,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 28, 2015 10:23PM Rockerwife wrote: Thank youl lovlilynne Yes I did start on a Tuesday,but some how they are all Wednesday's now. The chemo beanies are exspensive, but I am not getting a wig. Too hot here in summer. Over 100 degrees on most days.",
      "MessageIndex": 973,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "May 8, 2015 04:28PM Rockerwife wrote: What is it with me and day 9 after chemo? Let's see day 9 of TC #1 I went to the ER and had low neutrophils and was admitted. Now it is day 9 of TC #2 and I am here again , this time because I have been light headed and have had heart palpitations. Oh and my neutrophils are not low, they are crazy high from the neupogen. Like 23,000 high and not anemic. hemoglobin numbers are good. They drew a lot of blood and my Troponin levels are elevated. That is an enzyme that is released when the heart may have been damaged. Waiting for Echocardigram and more blood work. Did the Neupogen cause this by making my body work so hard or is it the chemo? I hope my heart is not damaged or they find I had a heart attack. I am irritated by this. I was perfectly healthy before cancer decided to come along for the ride uninvited. I worked out 5 days a week and was muscular. Now I am a floppy vegetable that wants to be a beast. I was walking and now can't even do that consistently. Sorry for the vent",
      "MessageIndex": 1259,
      "PostDate": "08/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 26, 2015 02:57PM Rockerwife wrote: Gingerchi- I am happy that you got released from the hospital. You will heal better at home in your own bed. Before cancer I hadn't been in the hospital except to give birth . The two hospitalization during my TX were not fun. You had to be there a week. So glad you are home",
      "MessageIndex": 2680,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Jun 27, 2015 04:55PM - edited Jun 27, 2015 04:56PM by Rockerwife How could I forget the most significant symptom of of all? For a few months prior to finding the lump, I would experience intermittent pain when I lifted my left breast to plop it into my bra. When I went for appt prior to surgery the nurse said that the pain was the tumor coming out of the milk duct. Must've been because once I had found the lump the intermitant pain ceased.",
      "MessageIndex": 2710,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Mar 25, 2015 11:14PM Rockerwife wrote: Hello April Chemo Crew I am starting my first round of TC on April 7th. I am very nervous as what to expect.",
      "MessageIndex": 49,
      "PostDate": "25/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Mar 31, 2015 01:21AM Rockerwife wrote: Not chemo related, but I wanted to share. I teach 5th grade and today my principal and I told my class that this Friday, April 3rd is my last day because I start chemo for breast cancer next week. My class took it pretty well and asked a lot of awesome questions which led to a science lesson on cells. One of my more challenging students got really emotional and was crying. It's been tough love with that kid and boy does he have a heart . So from classroom to chemo chair I go knowing that I have made an awesome connection with my students.",
      "MessageIndex": 125,
      "PostDate": "31/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Mar 31, 2015 07:19PM - edited Mar 31, 2015 07:42PM by Rockerwife GingerChi- Thank you for your positive comments about my class. They are one of my best groups. I will miss them. Littleblue- Thank you. They are a special class. Sheshe3- Yes, we have great communication. They are very bright 5th graders. Wow! Kbeee cool hair! SpriteB- I am a teacher and I chose to take the rest of the year off. I had enough sick time to cover. My principal didn't even question my decision. My MO really said it was up to me. I feel as though I won't know how chemo will affect me and in my job in order to take a sick day I need to leave sub plans. I didn't want to risk thinking I would be okay and then finding out that I couldn't make it through the day. I had unexpected complications with the lumpectomy and went back only to have to take the next day off. It was difficult to be there one day and out the next. I want my class to have consistency. Make the decision that is best for you.",
      "MessageIndex": 142,
      "PostDate": "31/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 3, 2015 09:45PM Rockerwife wrote: Thank you for all the positive comments about my hair. I haven't had it this short since the 80's when I was in high school. Going on a camping trip this weekend as a my last hurrah before chemo on thie 7th. My last day of schol was today and it was a tearjerker. The parents made a video full of pictures of my kids and me. They put it to the music \"Hero\" by Whitney Houston. It was so special. Have a great Easter weekend ladies.",
      "MessageIndex": 183,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Rockerwife",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211305/profile",
      "Content": "Apr 13, 2015 04:33AM Rockerwife wrote: LittleBlueflowers- YOU really do look amazing!!! I have only cut mine short. I keep running my fingers through it looking for hair. I think sometime this week I will surrender as well.",
      "MessageIndex": 395,
      "PostDate": "13/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    }
  ]
}