{
  "AuthorID": "rockinmommy…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165553/profile",
  "Posts": [
    {
      "AuthorID": "rockinmommy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165553/profile",
      "Content": "Jan 4, 2013 06:36PM rockinmommy wrote: Kind of in the same situation, however the ultrasound tech did the area slightly lower than the lump and found some cycsts. My PCP sent me to the breast surgeon and he gave me wto choices, watch it or test it and know for sure what it is. I have opted to know for sure what it is and go on the 9th. Good luck.",
      "MessageIndex": 3,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798392",
      "Title": "Lump felt , but not visible on mammogram or ultrasound jabnee Maddog23"
    },
    {
      "AuthorID": "rockinmommy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165553/profile",
      "Content": "Dec 12, 2012 08:27PM rockinmommy wrote: I got reschedules...kinda knew it was going to happen. I asked the scheduler about the days the surgeon was taking off and she looked at me clueless and said he wasn't taking any off...yeah. Now i get to wait until January cause he is full now.. :(",
      "MessageIndex": 4,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797315",
      "Title": "Trying not to let the worry get me rockinmommy rockinmommy"
    },
    {
      "AuthorID": "rockinmommy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165553/profile",
      "Content": "Jan 4, 2013 09:38PM rockinmommy wrote: Few more days until I go in. Anxiety is begining to get the best of me.",
      "MessageIndex": 7,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797315",
      "Title": "Trying not to let the worry get me rockinmommy rockinmommy"
    },
    {
      "AuthorID": "rockinmommy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165553/profile",
      "Content": "Dec 21, 2012 09:39PM rockinmommy wrote: I'll survive...even better just found i tested positive for AMA, thankfully my appointment with a another dr is the day before my breast biopsy, however this appointment will likely end up in a scheduling of another biopsy of a different body part...geez when it rains it poors...",
      "MessageIndex": 6,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797315",
      "Title": "Trying not to let the worry get me rockinmommy rockinmommy"
    },
    {
      "AuthorID": "rockinmommy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165553/profile",
      "Content": "Jan 4, 2013 10:10PM rockinmommy wrote: Thank you EmD...two potentially life alterting appointments back to back has my head swimming, my thoughts muddled, and my fears and anxiety sky rocketing. I cannot decide which is worse the biopsy appointment and the potential it carries or the other appointment and the potential it carries....have to remember to remember that until I know for sure with either one there is not much that I can do except to swim",
      "MessageIndex": 9,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797315",
      "Title": "Trying not to let the worry get me rockinmommy rockinmommy"
    },
    {
      "AuthorID": "rockinmommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165553/profile",
      "Content": "rockinmommy wrote: Noticed a lump long time ago, never thought anything of it until a close family friend was diagnosed with BC. Decided to keep an eye on it for a few months to see if it changed and it never changed with cycles so i went in to my Dr. He felt it said it was definately there and wanted me to have a mamogram and ultrasound. I had the Mamogram a few days later, Mamogram showed nothing except that I very dense tissue. Ultrasound showed I had three very small cycsts at the 3 o clock position (Ironically just a little to the side of the actual lump), however they never did check the lump,I probably should have said something to them at the time but my mind was focused on \"yes it's just cysts\". Dr said he wanted me to see a breast surgeon to go over my options on what to do with the cysts. I had that appointment earlier this week. He said that my cysts and lump are NOT the same thing and is frustrated they didn't check the lump-- that they saw the cysts and called it good. Said the cysts are NOT causing the lump, combined my cysts don't total 1mm (or ml) but there is definately a lump and the lump is not \"normal\". Said the cysts are to tiny to do much to but the lump he is concerned about and He doesn't like it, along with all the other things that have been going on-the itchy breast, the occassionaly dishcharge, weightloss, loss of appetite, fatigue, and a host of other things ( I just started seeing an internal medicine dr irronically the same day as my appt with the surgeon to rule out other issues)..he gave the choice of watch and see (which he said he would prefer i did not do this but had to give the option) or open biopsy I know I am going to have a scar but I can live with a scar when the other option is unknown. I chose open biopsy cause well i would rather know for sure if this funky lump (not round,not smooth) is well lets face it cancer or not. I know that most come back B9, I do have breast cancer in my family, although my mom does not have it she has had a lump removed that was neither normal nor cancerous. Just worried and i know not worrying is easier said than done, this on top of all my other appointments. I forgot to ask how long I have to wait for my results. I have been a bit scattered brained the last few months. On average how long are biopsy result waits? I know it can vary greatly but having a time frame even if its longer than the one i end up with let me know how long i am going to be stressed out for. My biopsy is being done the 17th since I am being sedated, the lump goes from the 12 position to 3 position and is shaped like a giant grain of rice and very bumpy (i scheduled it for my family to be here and so my husband does not have to take time off of work) just keep swimming, just keep swimming, just...keep....swimming Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797315",
      "Title": "Trying not to let the worry get me rockinmommy rockinmommy"
    },
    {
      "AuthorID": "rockinmommy…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165553/profile",
      "Content": "Dec 6, 2012 03:38PM rockinmommy wrote: Thank you cheryl. I hope it only takes two days to find out, but if it goes to the longer end I won't be to surprised either. I hope it is also B9.",
      "MessageIndex": 2,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797315",
      "Title": "Trying not to let the worry get me rockinmommy rockinmommy"
    }
  ]
}