{
  "AuthorID": "rodeogirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205879/profile",
  "Posts": [
    {
      "AuthorID": "rodeogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205879/profile",
      "Content": "rodeogirl wrote: hi just thought id share my black tounge experience- it scared the crap out of me- dont worry if it happens your tounge wont fall off- thats what i thought when i first saw it scary lol -thank god it goes away- cheers Dx 9/11/2014, IDC, 6cm+, Grade 2, 13/20 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/844080",
      "Title": "Anyone else get a black tounge on a/c rodeogirl rodeogirl"
    },
    {
      "AuthorID": "rodeogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205879/profile",
      "Content": "Apr 11, 2016 06:30PM rodeogirl wrote: when people are saying high liver enzymes- how high- 2-3 times higher than normal ? or more",
      "MessageIndex": 3160,
      "PostDate": "11/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "rodeogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205879/profile",
      "Content": "Feb 6, 2015 04:03PM rodeogirl wrote: Hi i had a patch of psoriasis which started above my angle 5 years ago, it slowly grow over the last 5 years. i just had mastectomy for idc 8cm tumour and 13 nodes positive. its a low ki67 5% cancer. i refused chemo because i know it doesnt work on slow dividing cells. Just stopped tamoxifen because my vision was blurring and my eyesight deterorating over 3 weeks use with terrible aching. appointment monday to find out about raiation, thinking stuff that too and going alternative. of interest my psorasis has nearly dissapeared since the mastectomy, i believe there is a link to the cancer, i also believe it appeared the same time the cancer did. now i will wait to see if the psorasisis flares up again",
      "MessageIndex": 74,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701178",
      "Title": "How many with BC and autoimmune diseases like LUPUS, RA, ? badboob67 wintersocks"
    },
    {
      "AuthorID": "rodeogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205879/profile",
      "Content": "May 7, 2016 03:42AM - edited May 7, 2016 03:42AM by rodeogirl ARG some of us nausea medication dosent work- the best thing are the disposable sick bags you get in hospital- they are awsome and you can put in them in the bed and hold it close - they dont spill at easily too - good luck <3",
      "MessageIndex": 1747,
      "PostDate": "07/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    }
  ]
}