{
  "AuthorID": "roopanrk",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255045/profile",
  "Posts": [
    {
      "AuthorID": "roopanrk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255045/profile",
      "Content": "Jul 3, 2017 01:44PM roopanrk wrote: Hey MTwoman, Thanks for the reply. The BIRADS rating is what is confusing. Mamography said BIRADS 4 and Ultrasound says BIRADS 5. Biposy is done and the results says the following : - Infiltrating ductal carcinoma - grade 2 - Moderate desmoplasia seen Focal necrosis seen - DCIS/Lympho-vascular emboli are not seen in these sections. Have now given the samples for Harmone receptor tests. Met the Medical oncologist today - she only suggested the PETSCAN and nothing more. Not even a word on the status of her health, I dont know should i be bothering about the doctors behaviour?? ",
      "MessageIndex": 2,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856551",
      "Title": "MammogrampyBIRADS4 UltrasoundBIRADS5 BIOPSY done roopanrk roopanrk"
    },
    {
      "AuthorID": "roopanrk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255045/profile",
      "Content": "Jul 4, 2017 06:21AM roopanrk wrote: Thanks Kira1234, Its mixed reactions and sentiments running down the spine. My Mother is 62. Got her Harmone receptor test report all parameters are tested positive with a high Ki67 labelling index We are done with the pet scan this morning and have a followup with the oncologist is lined up for tommorrow. Lets see what she says Thanks again, Roopa",
      "MessageIndex": 4,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856551",
      "Title": "MammogrampyBIRADS4 UltrasoundBIRADS5 BIOPSY done roopanrk roopanrk"
    },
    {
      "AuthorID": "roopanrk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255045/profile",
      "Content": "roopanrk wrote: There was feeling of Lymph on my mothers right breast - gyneac physical examination said no lump - suggested Momogram - result BIRADS 4 and reported BIRADS 5 with multiple lymp nodes enlargement with loss of fatty hilum. As we wait for the BIPOSY result i am feel anxious with each moment. If proven Malignancy - any idea what is the life expectancy? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856551",
      "Title": "MammogrampyBIRADS4 UltrasoundBIRADS5 BIOPSY done roopanrk roopanrk"
    }
  ]
}