{
  "AuthorID": "Rose_NJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150648/profile",
  "Posts": [
    {
      "AuthorID": "Rose_NJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150648/profile",
      "Content": "May 22, 2012 10:35AM Rose_NJ wrote: Yes I am prepared for this biopsy. I had the same type of wire needle localization biopsy 15 years ago and it was no big deal for me at all. Its just waiting for the test results that is emotionally draining. My surgeon said it will take about 5 days to get the results back.",
      "MessageIndex": 7,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787840",
      "Title": "1st biopsy failed now going for a 2nd one on Wednesday Rose_NJ Blessings2011"
    },
    {
      "AuthorID": "Rose_NJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150648/profile",
      "Content": "May 22, 2012 09:33AM Rose_NJ wrote: Thanks ladies for taking the time to answer my first post and alleviating some of my fears.You are a wonderful group of women here. I do think I am jumping the gun with worries and reading too much about BC now.",
      "MessageIndex": 5,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787840",
      "Title": "1st biopsy failed now going for a 2nd one on Wednesday Rose_NJ Blessings2011"
    },
    {
      "AuthorID": "Rose_NJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150648/profile",
      "Content": "Rose_NJ wrote: Last week I was scheduled to have a stereotactic biopsy in the hospital. I went for my appointment, got undressed, layed on the table with my breast hanging through the hole while the Radiologist tried to plot the mammogram coordinates  for the biopsy needle.He tried numerous times to locate the lump in my breast with the mammogram machine but it was too close to my breastbone to show up . So they sent me home. Now my surgeon has scheduled a 2nd incisional biopsy with needle wire localization for this coming Wednesday, May 23rd. I have now been waiting three weeks to get my biopsy completed and a diagnosis. I am a nervous wreck. I trying to prepare myself for possible bad news by reading everything I can about breast cancer on the internet. Maybe I shouldn't be doing this but I want to know what questions to ask my doctor in case the lump turns out cancerous. I'm glad I found a BC forum were I can get information, vent my frustrations and return to if I get bad news next week. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787840",
      "Title": "1st biopsy failed now going for a 2nd one on Wednesday Rose_NJ Blessings2011"
    }
  ]
}