{
  "AuthorID": "RoseBowl16",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244662/profile",
  "Posts": [
    {
      "AuthorID": "RoseBowl16",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244662/profile",
      "Content": "Jan 4, 2017 02:13AM RoseBowl16 wrote: would love to be added to the list. January 11 double mastectomy with expanders... Lots of anxiety and fear. Trying to not let my mind wander to the worst case scenarios and focus on my amazing team of doctors and friends who support me",
      "MessageIndex": 195,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "RoseBowl16",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244662/profile",
      "Content": "Feb 17, 2017 02:29AM RoseBowl16 wrote: I had a reduction pattern double mastectomy and had issues with necrosis at the inverted T incision. It was disappointing 2 weeks ago, finally got my last two drains out but had to have 100cc removed from each tissue expander and the dead skin removed and sewn up again! So I am 5 weeks out from surgery and still healing at incisions. Trying to stay positive even though my boobs are now deflated. All of this is very hard mentally. I figured by now I would well be on my way with fills and planning my exchange surgery. Instead I just want to heal up and get the \"new\" stitches out. I also couldn't keep my nipples so everything has been an adjustment. I keep telling myself that I will be okay. I'll get new nipples. I am blessed I don't need chemo. But I am still struggling. I think my friends don't understand why my recovery is taking so long. Ha, maybe I don't either! The pain isn't bad but the expanders are very uncomfortable. I feel them thru my saggy deflated skin now. It's creepy. Not to be too paranoid, but does anyone else get worried about infection? I think with my skin set back, I am now afraid I will get an infection and have to get my expanders out! Ugh, I just want to fast forward 5 months and have my implants. Or at the very least change my frame of mind. Sorry to be a downer. Just venting. Please let me know if anyone else worries about infection",
      "MessageIndex": 2166,
      "PostDate": "17/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "RoseBowl16",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244662/profile",
      "Content": "Jan 3, 2017 07:07PM RoseBowl16 wrote: January 11 bilateral mastectomy with tissue expanders",
      "MessageIndex": 181,
      "PostDate": "03/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}