{
  "AuthorID": "rossie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67401/profile",
  "Posts": [
    {
      "AuthorID": "rossie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67401/profile",
      "Content": "May 27, 2008 12:03PM rossie wrote: Hi Gabi, I was diagnosed with breast cancer stage1 last December. I found out the results of my genetic testing few weeks after the lumpectomy, And to everyone's surprise I was positive for BRAC 2. Breast cancer has not expressed in many of my female relatives, I guess I was one of the unlucky ones. After a visit with the genetic counselors, seeing the stats and explanations of my risks, I decided to go for double mastectomy and also to have my ovaries removed. I am 42 years old with 2 college kids, so the decision was \"easier\", I think. On the other hand, given the situation of being younger with no children it would have been more difficult and my heart goes to these women who are facing this. But even in situations like that one, you will be surprised to find out that they are not alone, that there are women with similar stories liketheirs, yours or ours. I  researched in different forums to get an idea of what other women in this situation have done. I found that everyone's decision was personal and yet difficult. But the majority felt that it was much better to get their life's back with no more worries. And that they did whatever it took to get it!!!! It is difficult, but you will find the answer soon with no pressure. You will get there and when you do, you will choose the one you can live with. When I made my decisions,  I went through each procedure with a positive attitude, always sure that I was doing the right thing.  I will have my implants in about 2 months and this whole thing will be another chapter of my life. Everybody's situation is different and that is why you should ask questions and explore all your options. Good luck and I hope this helps.",
      "MessageIndex": 3,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706229",
      "Title": "BRCA2 positive and now what??? seoulite tweekerbeeker"
    },
    {
      "AuthorID": "rossie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67401/profile",
      "Content": "May 28, 2008 09:09AM rossie wrote: Hi Gabi, I am glad you are preparing yourself and writing your questions. It is your body, your decision and every question should be answered. In reference to the mastectomy, I chose the reconstruction immediately. Expanders were placed under the muscle to stretch the skin in order to give room for my implants, which will be inserted in about 2 months. My nipples were saved :) They are looking pretty good and the scars sit right underneath my breasts, so they will be hiding. I can't complain, my breast surgeon and plastic surgeon are doing a great job! I am very happy! :) ",
      "MessageIndex": 11,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706229",
      "Title": "BRCA2 positive and now what??? seoulite tweekerbeeker"
    },
    {
      "AuthorID": "rossie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67401/profile",
      "Content": "May 29, 2008 07:20PM rossie wrote: Hi Gabi, About your questions, my surgeon told me that they could save my nipples. Breast reconstruction surgeries has changed a lot in the last five years or so. The surgeon and plastic surgeon told me that it is possible now (although every case is different) and it is done frequently. I go every 2 weeks to get saline injected into the expanders and then I will get the implants. About the check-ups, I need to see the surgeon in few months and then I will be done with that. I am not taking any hormones. My symptoms after my oopherectomy are very mild,  with an ocassional hot flash and not strong at all. I am taking vitamins, extra calcium and BiOmega, since I read somewhere that it would help me.  Good luck and all the best!  :) ",
      "MessageIndex": 21,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706229",
      "Title": "BRCA2 positive and now what??? seoulite tweekerbeeker"
    },
    {
      "AuthorID": "rossie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67401/profile",
      "Content": "Jun 3, 2008 09:05AM rossie wrote: Hi Gabi, The expanders were inserted at the time of the mastectomy and depending on how quick you heal, you can start the saline injections within weeks. Once you reach the desired size, usually a bit more of saline is injected to give room for the implants. I just reached my desired size YESTERDAY!!!! :) The plastic surgeon  suggest waiting a month before inserting the implants. Because of my doctor's vacations and other committments I will have to wait 2 months. But that's okay, I can wait, there is no rush!!  The expanders don't hurt at all. I noticed a bit of back pain right after the injections, probably because the muscles are being strecthed. Remember that the expanders are under your chest muscles and that is where your implanst will go. About the vitamins, I've been taking them for years. After the oophorectomy, my OBG-YN advised me to take extra calcium. I also read about BiOmega and I added that also not only because it is good for you but because I read it might alleviate some menopausal symptoms. I am not experiencing severe symptoms, thank goodness!! Only a bit hot at times and restless at night. I take Simply sleep by Tylenol. It is working like a charm :) My email address is rbsaez@optonline.net  Let me know how you are doing :) ",
      "MessageIndex": 23,
      "PostDate": "03/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706229",
      "Title": "BRCA2 positive and now what??? seoulite tweekerbeeker"
    }
  ]
}