{
  "AuthorID": "Rowan47",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
  "Posts": [
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Aug 11, 2011 12:49PM Rowan47 wrote: Please add me to the list....My name is Rowan, New Zealand, and I am having BMX - without recon on August 18th (invasive papillary carcinoma, grade 3). Am feeling nervous, but after reading these posts it is comforing to know others understand and feel the same. Love to you all, brave women.",
      "MessageIndex": 118,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Aug 11, 2011 10:35PM Rowan47 wrote: Stcc, I agree with blondelawyer. The decision has to be yours, and you have to feel comfortable with it. My cancer was in right breast (2.5cm, grade 3). My decision was to have BMX (scheduled for next Thursday, 18th August). Although there is no evidence of anything suspicious in my left breast, I am not prepared to go through the trauma of biopsy/lumpectomy(x2)/chemo again if anything does develop. I have chosen to not reconstruct - again, this is a personal decision and one that I am very comfortable with. I am so sorry you have such a strict timeframe to make a decision...try not to stress. Hugs and best wishes to you xx",
      "MessageIndex": 122,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Oct 12, 2011 08:49PM Rowan47 wrote: Hi to all of my August buddies, good to read everyones updates. I am doing really well. My scars have healed nicely, and can roll over/lay on sides etc in bed now. Have started running 3.5km each day. So much easier without the boobs flapping around!! Hair is about 2cm long now, so have gone \"topless\" for a few weeks now. So liberating not to have to cover up with scarves etc. Feeling really healthy again, however....have a lump near where my original tumour was...had US and BS thinks it is just fat necrosis. If still there next month will need biopsy....bloody hell!!!! It had better disappear!!! That was a few weeks ago, and it is unchanged...hoping for the best. Sure it will be ok....hugs to you all.",
      "MessageIndex": 732,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Aug 21, 2011 12:38PM Rowan47 wrote:",
      "MessageIndex": 250,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Nov 22, 2014 01:41PM Rowan47 wrote: Hi sweetie, I, too, have fast growing hair....I think it took a month or more for my hair to really take off and grow again, after my last AC treatment. My hair had been almost waist length b4 chemo, so quite a shock to be bald! It came back quite curly, but now, after 3 years, it is just as lush and thick as it always was. Don't despair....it will grow again!",
      "MessageIndex": 2,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826475",
      "Title": "Hair growth after AC Akevia Akevia"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Sep 15, 2011 03:02PM Rowan47 wrote:",
      "MessageIndex": 63,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774106",
      "Title": "Radiation Treatment NOW 3 months after Surgery pil barbe1958"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Sep 17, 2011 01:33AM Rowan47 wrote: Hey Pil and Barbe, I gained about 10lbs during chemo. Since BMX I have gone back to being vegetarian (started eating meat again during chemo as thought I probably needed the extra iron etc). I am now down to 140lbs, so slowly getting there!! I am used to using kilograms as measurement, so am about 65kilos at the mo. Want to get back to around 60kilos. Walking 4km every day, and hope to keep this up! Also changed my diet to include more salad and vegetables. Really hard to manage diet with 4 children and husband who eat EVERYTHING!",
      "MessageIndex": 70,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774106",
      "Title": "Radiation Treatment NOW 3 months after Surgery pil barbe1958"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Sep 15, 2011 03:55AM Rowan47 wrote: Hi pil, I too was dx with papillary carcinoma. After lumpectomy it was found to be grade 3 and invasive..my bs said it was quite unusual, given my age (47) and the tumour's aggression. Had second lumpectomy (to get clear margins), then 4 rounds of AC. I then decided on BMX (double mastectomy) so as to avoid further chemo and rads. I also did not want to risk any damage to heart/lungs/whatever from the rads. I am 4 weeks out from BMX and am feeling great!! It was sooo much easier than I thought, very little pain, very neat scar and great ROM. Am not interested in reconstruction, so continue on my happy way with new \"flat\" look!",
      "MessageIndex": 60,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774106",
      "Title": "Radiation Treatment NOW 3 months after Surgery pil barbe1958"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Sep 17, 2011 03:29PM Rowan47 wrote: Barbe, you eat healthier than I do! Yes, you are right. You are doing all the right things re food. What a bugger that you have mobility problems. Hope you have a lovely 50inch tv screen in your bedroom!! I find that helps if I need to take a rest! You have a lot to deal with, I know. but you are such a positive and bright lady. Love reading your posts!",
      "MessageIndex": 72,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774106",
      "Title": "Radiation Treatment NOW 3 months after Surgery pil barbe1958"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Dec 29, 2012 01:22PM Rowan47 wrote: So interesting to read these posts. I thought it was just me!! I did 4 rounds of AC last year and it is only now that I am having problems. My left achilles tendon is stiff every time I stand up. Very sore, but comes right when I walk around. Will it go away on its own?? I am also having shortness of breath and slightly swollen hands and feet. Using a diuretic at the mo and that helps. Worrying about chemo-induced congestive heart failure......seriously, just when you think the worst is over?! I hope you are all feeling better, and the pain is going. So interesting to know others have same issue.",
      "MessageIndex": 7,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/758960",
      "Title": "Achilles Tendonitis post chemo - anyone else? suefg shawashi1030"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Dec 3, 2015 04:24AM Rowan47 wrote: Michele, I had the same issue after having Adriamycin!! Had ECG and my EF was lower than before....cardiologist said it was due to slight damage of my left ventricle due to the chemo. He didn't prescribe me anything, just told me not to run any marathons !!",
      "MessageIndex": 3233,
      "PostDate": "03/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Mar 25, 2013 01:05AM Rowan47 wrote: I would also like to add my thanks for the time and caring that chrissyb and co give us. I often lurk on this thread and have always found it extremely informative and helpful. Now....just a quick question! I have had shortness of breath for past 8 months, and now have some rib/back pain. Had my (first) CT scan last week and results show no evidence of mets. Great news, but just wondering how accurate this type of scan is? My BS said that if SOB still there in month or so that she wants me to have bone scan. R these better than CT's? I know that it is very unlikely that I have developed mets, due to being node negative, but this SOB is really annoying and a bit worrying! Any advice appreciated. Thanks for your time.",
      "MessageIndex": 1157,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Mar 25, 2013 01:46AM Rowan47 wrote: Thanks chrissy for your quick response. No, I declined rads and chose BMX instead. Also declined tamoxifen due to side effects. I decided the risks outweighed the benefits...hope I'm right! I just feel so tired with this breathing issue; always yawning as I try and get enough air in. I read up on bone scans and they sound quite long and involved. I just want to get to the bottom of it. I just feel that all is not right. I felt great after BMX and chemo finished for about a year afterwards, then quite suddenly the SOB started. I think I may just leave it for a few months and see if it clears up.",
      "MessageIndex": 1159,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Mar 25, 2013 02:40AM Rowan47 wrote: Hi Chrissy, yes I went to see cardiologist in January. He did ECG that showed a bit of damage (from chemo) to my left ventricle, but doesn't think it would be the reason for the SOB. Oh, I don't know, it's all so frustrating! Thank you for your thoughts, and I may post again in a while if breathing no better. Sorry, one last question, did you have symptoms with your mets? Are they bone mets? Sorry, you have probably posted that info before, but I haven't stumbled upon it yet.",
      "MessageIndex": 1161,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Mar 25, 2013 05:39PM Rowan47 wrote: Hi Linda, thanks so much for the advice. My first thought was also cardiotoxicity as possible (probable?) cause for my symptoms. I am not under the care of any Cancer centre; just have 6 monthly check-ups with BS (I think this is standard protocol here in New Zealand). My onc doesn't want to see me again unless problems arise. He is under the opinion (like many doctors) that it doesn't matter if mets are caught early or late, the treatment will be the same. I still have trouble getting my head around that.....I may just \"self-refer\" to a lung specialist. There is definately something amiss, whether it be small or large. Thanks so much for your time and advice etc. I really appreciate both you and Chrissy taking the time...x",
      "MessageIndex": 1167,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Apr 11, 2013 02:42PM Rowan47 wrote: Hear hear, Scuttlers! Like Macyhen111, I too am hesitant to post here. It is a huge distraction to have someone like Wayne upsetting these fine ladies.",
      "MessageIndex": 1300,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Mar 5, 2014 08:48AM Rowan47 wrote: {{{AlyonA}}}",
      "MessageIndex": 2158,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Dec 3, 2015 10:58PM Rowan47 wrote: Oh, Michele, how awful! Hope you're healed up after that fall :)",
      "MessageIndex": 3240,
      "PostDate": "03/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "May 4, 2013 06:01PM Rowan47 wrote: Hi ladies, I had BMX (no recon) 18 months ago and can honestly say that I had hardly any pain! Didn't need any heavy drugs, just had a couple of panadol the next day. Having the drains in was more annoying than painful. Had drains out after a couple of weeks and was back doing cartwheels with the children a few weeks after that. Honestly, it was so much easier than I ever imagined. I love my flat chest, and am so comfortable now that I don't need a bra. All the best, and try not to stress! x",
      "MessageIndex": 5,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/804176",
      "Title": "BMX no recon -- how much pain really ? bamboogirl MMSS"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Jul 19, 2011 01:28AM Rowan47 wrote: I have just found this thread and am SO glad!!! I too have decided to have BMX without recon, so really great to hear you lovely ladies talking about it. I have had 4 lots of AC (disgusting!!) and was due to start taxol today for 12 weeks, then rads for 5 weeks. Saw my onc yesterday and said that I do not want any more chemo/rads and that BMX was the way to go for me. I am SO over the worry and pain of stupid BC, and just want to feel \"normal\" again. My onc agreed with me and was happy with my decision. Am off to see BS next week. Reading these threads has given me extra strength and determination. Thank you, my dears, you have all helped me without even knowing it, PS Barbe, you really make me laugh!!! And Erica, I ADORE the BreastFree site. Extremely positive and helpful.",
      "MessageIndex": 359,
      "PostDate": "19/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Aug 21, 2011 03:49PM Rowan47 wrote: Hello ladies. Had BMX last Thursday and feel fantastic!! Stayed in hospital 3 nights (private, great service!). Home now with 2 drains, but hopefully out later today. Pretty much no pain, have just been having panadol twice a day. I am feeling very calm and serene at the moment...the best I have all year. Quite enjoying the flat look! Scars are very tidy, and I have great ROM. Sooo glad surgery over and can now concentrate on living well again. Hugs to you all..xx",
      "MessageIndex": 445,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Aug 21, 2011 11:39PM Rowan47 wrote:",
      "MessageIndex": 449,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Sep 17, 2011 12:21PM Rowan47 wrote: I am so with you!! My BS (lovely Dutch lady) also pushed for me to reconstruct. Don't think she believed me that I was HAPPY to be flat. She gave me name of PS, but I never bothered making appt. I must have convinced her though, because she told me she took extra time during surgery to ensure no \"dogears\" (hate that term!) were left under my arms.  However, she then told me I would probably want to get fitted for foobs a.s.a.p. so that I could go out in public with confidence..I feel bloody confident flat!!! It is just not a big deal, is it?? I have better things to think about and am still feeling GREAT....I am sure some of my friends are waiting for me to break down and cry over the loss (?). I have recently started jogging every morning, and what a relief to have no bouncing boobs to slow me down!!",
      "MessageIndex": 517,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Dec 5, 2011 01:31PM Rowan47 wrote: Gosh, Christy, so sorry you have through such an ordeal!!! What a nightmare for you.....I had BMX in August and have NEVER looked back. Went from a D-cup to flat, so quite a change. My surgeon also never really believed that I didn't want recon. Had to nag her into removing as much skin as possible and leave no \"dogears\". I am 47, married with 4 children...and I feel great again!! Feel slimmer, lighter and just as sexy :) I am having fun with new wardrobe; love qypsy tops and chiffon-type clothes (floaty, light, pretty). All the best with your decision. Love from a member of \"Flat and Fabulous\"  club.  Lol. xxx",
      "MessageIndex": 376,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/737036",
      "Title": "Wardrobe pics for boobless days mom2two ShadePink"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Feb 5, 2013 08:25PM Rowan47 wrote: Oh Cinnamon, I am so very very sorry that you are living in this situation. Not sure what to suggest.....sounds like he really could use a good counsellor though. You sound like an extremely strong, kind and caring young woman. {{{{hugs}}}",
      "MessageIndex": 133,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/786580",
      "Title": "What does your husband/loved one think about your flatness? otter otter"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Jun 1, 2012 10:00PM Rowan47 wrote:",
      "MessageIndex": 110,
      "PostDate": "01/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/786580",
      "Title": "What does your husband/loved one think about your flatness? otter otter"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Sep 4, 2011 09:59PM Rowan47 wrote: Hello all, haven't visited for a while. Hope you are all well and on the recovery road...I am feeling GREAT!! Had drains out day 6, driving since day 8. hardly any pain and great ROM. Having fun buying new clothes to suit my new flat look. I haven't felt this good all year; my only consistent worry is about our continuing earthquakes!! Still scary....",
      "MessageIndex": 483,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Oct 15, 2011 12:51PM Rowan47 wrote:",
      "MessageIndex": 580,
      "PostDate": "15/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Feb 20, 2013 01:28AM Rowan47 wrote: What a lovely post, Ariom. I totally agree with you that many of our DH's still love the way we look.",
      "MessageIndex": 146,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/786580",
      "Title": "What does your husband/loved one think about your flatness? otter otter"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Sep 5, 2011 11:36PM Rowan47 wrote:",
      "MessageIndex": 487,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Rowan47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127834/profile",
      "Content": "Nov 19, 2011 02:30PM Rowan47 wrote: Hi MellyT, I love your post. It reflects my opinion EXACTLY.  I am 47 and had double mastectomy in August. I, too, feel very strong and comfortable in my body. My husband still adores me, and is thrilled to have his confident attractive wife back :)",
      "MessageIndex": 611,
      "PostDate": "19/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    }
  ]
}