{
  "AuthorID": "Roxanne1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
  "Posts": [
    {
      "AuthorID": "Roxanne1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
      "Content": "Oct 12, 2007 04:33PM Roxanne1 wrote: Your puppies are beautiful!! What fun and joy you must be having.  My new baby labrodoodle is coming home tomorrow!  His name is Duncan, he's black with a little brown markings.  I needed something to make me smile, and since I'm home all day what could be better than a puppy? BC (before children, not cancer) we had a lab who was around to teach my kids to walk while holding on to him, where eyes, nose, and ears were by having fingers stuck in them...the funniest and most gentle dog every. After he died and my son developed asthma, we were dogless for a couple of years.  Then we got a Standard Poodle for hypoallergenic reasons and fell in love with another wonderful breed. I did have 2, but now have a 13 year old boy to be a big brother to Duncan. Imagine my joy at finding them combined! I know what you mean, even in the middle of all this life and death drama, and endless treatments, and not feeling well, it is important to find things that make you smile.  And there is nothing like a puppy to do that! Susan NJ",
      "MessageIndex": 5,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693698",
      "Title": "New puppy pictures ForTheMoment Kasey"
    },
    {
      "AuthorID": "Roxanne1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
      "Content": "Jul 20, 2009 03:41PM Roxanne1 wrote: My mother died at 42 from breast cancer. I started having mammos at 35, and a few FNAs that were neg. I also had MRIs of the breast since I am \"dense\". I was diagnosised 6/06 when my liver was the size of a watermelon, and had mets thoughout my spine, sternum, pelvis and femur. After searching for the primary, my liver was biopsed and I had Breast Cancer, E&P +, Her2 neg.  During the work up I had another mammo and breast MRI, both of which were neg. I had all my films and MRI reviewed by the oncology center's radiologists which they did at a group meeting. Nothing was identified. I have had PET scans and nothing lights up in the breast or the axillary. I am also BRAC 1&2 neg. Go figure. My onc has tried to explain this to me, I've tried to look it up, but I still don't get it. How is this possible?  I'm glad it's breast cancer, at least there are lots of drugs to use. Would have been worse as primary liver. Life is crazy! Sue in NJ",
      "MessageIndex": 12,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737406",
      "Title": "How many of us have mets but clean breast vivo Roxanne1"
    },
    {
      "AuthorID": "Roxanne1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
      "Content": "Jul 10, 2008 08:46PM Roxanne1 wrote: I have been on Avastin for more than 2 years.  I also have a history of sinus problems and had sinus surgery to treat it.  My sinus always act up with the Avastin; burning, pain and recurrent infections that feel like someone put cement in my head.  I went back to my ENT guy who did the surgery.  He looked up my nose at the sinus cavity and couldn't believe how red and raw it was.  He suggested antibiotics for 3 days with each Avastin treatment. What a difference!  I was on Levaquin 500 and just saw him again because of 2 bouts of sinus infections back to back.  It was a year to the day that I had seen him last.  He switched the antibiotics and I am again doing 3 days with each Avastin dose.  It really helps.  I also use a neti pot, saline spray, and singulair for allergies. Susan in NJ",
      "MessageIndex": 8,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708351",
      "Title": "Avastin Side Effect: Sinus Problems LindaAtWork LuAnnH"
    },
    {
      "AuthorID": "Roxanne1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
      "Content": "Roxanne1 wrote: I was diagnosised in 6/06 with many mets to the liver and bone. So I began this journey stage IV. I have responded well to chemo and have done better than anyone expected. After 6 months on Navelbene, I had a scan with increased activity in my liver. Soooooo my onc wants to change me to CMF.  For any of you who have been on CMF, how are the side effects?  My first chemo in 06 was Taxatere and Carboplatin which almost killed me. I couldn't even lift my head from the pillow, was hospitalized 3 times, and had neuropathy so bad I couldn't walk.  I obviously don't want that again. I'm working part time and have a wild puppy. I want to continue living a descent life. Any advice or personal experiences would be appreciated. Sue in NJ Dx 6/6/2006, Stage IV, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735745",
      "Title": "New Chemo - CMF Roxanne1 jeanne46"
    },
    {
      "AuthorID": "Roxanne1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
      "Content": "Apr 26, 2008 11:40AM Roxanne1 wrote: My platelets drop with Gemzar, I have been as low as 19,000 but usually around 70-80,000. I can't get Gemzar unless my count is above 100,000. Since it is rarely that high, I get Gemzar sporadically instead of regularly. Prednisone does help to raise the platelet count.  I am very sensitive to the side effects, but every one is different.  I started with 40mg twice a day for a week, have also had a good response on 30mg twice a day for a week.  By the end my platelets were up.  You may want to discuss this with your onc. My onc also told me not to worry, although I was bruised, it seems the body makes a platelet like substance, so that you do stop bleeding if cut. Susan from NJ",
      "MessageIndex": 2,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704616",
      "Title": "Low platelet question liz35 Roxanne1"
    },
    {
      "AuthorID": "Roxanne1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
      "Content": "Mar 19, 2008 09:16AM Roxanne1 wrote: Dear Tracy, Vitamin B6 is suppose to help. I take 200mg twice a day.  I still have some left over nuropothy (sp?) from Taxatere, but the xeloda does set it off.  I have also read about using L-glutamine for hand and foot, although I'm still trying to figure out the dose.  This is an amino acid, so maybe you can find some additional info on this. Of course cream on your feet is essential....Bag Balm, Udder Cream, etc.  I've used cold packs and that's helped. Susan",
      "MessageIndex": 1,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702499",
      "Title": "sore feet Tracy1964 zarowny9"
    },
    {
      "AuthorID": "Roxanne1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
      "Content": "Mar 31, 2008 07:24PM Roxanne1 wrote: Roxanne, I live in NJ, and had no problems with disability.  If you are stage 4 and your onc says you are permently disabled that's it.  I wouldn't waste $ on a lawyer unless you have a problem.  I filled out the inital application on line, went to the office in Hacensack, the only info they requested was from my onc, had a check in a matter of weeks. Good luck, Susan in NJ",
      "MessageIndex": 5,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703149",
      "Title": "Stage IV Mestastic Breast and Disability RoxanneNJ31 RoxanneNJ31"
    },
    {
      "AuthorID": "Roxanne1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31778/profile",
      "Content": "Dec 4, 2007 07:05AM Roxanne1 wrote: I have just the opposite problem.  I want to have sex, feel alive, feel close, desired, attractive and loved, but my fiance had no interest.  I do think he was in a deep depression and this effected his drive.  He wouldn't go for help or discuss it with his PCP, but in one year after I was diagnosised we had sex 2 times.  Not good. The frequency not the sex.  With lube, I found the sex good and not painful even with all the chemo. We have since broken up after 8 years together.  Some men just can't do it.  He felt I didn't appreciate what he did for me and I felt he wasn't there for me, and sex was a part of it. Susan in NJ",
      "MessageIndex": 6,
      "PostDate": "04/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696373",
      "Title": "sex angelaw miss-di"
    }
  ]
}