{
  "AuthorID": "Rrobin0200",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
  "Posts": [
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Dec 1, 2017 03:31PM Rrobin0200 wrote: bowser... of course you are more than welcome here. Of course, I would rather you not be here under the circumstances, but... here we are. The waiting is torturous. It utterly is the worst thing about this process. Just because she had 5 biopsies, doesn't necessarily mean anything bad. The docs are just trying to be precautious. I had three biopsies done, and only one spot was abnormal. So again, try not to let it overwhelm you. Easier said than done, yes. Did they indicate when her biopsy results should be back? Will they call you or do you have to have an appointment? That's definitely something to find out. That way, you don't have to guess and if you need an appointment, you can get one hopefully asap. This is something that both of you will get through... its tough, yes. But one day it will all be a distant memory.  I wish all of you the best of luck.",
      "MessageIndex": 51,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860291",
      "Title": "Biopsies the week after Thanksgiving anyone? DagnyT DagnyT"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "May 26, 2018 10:50AM Rrobin0200 wrote: as stated above, yes, it’s true that 2 pathologists have to look at the slide. It stinks, especially since it’s a holiday weekend. But, try no to dwell on the negative. You don’t know anything yet, so try and enjoy yourself. Advocate for yourself. Call on Tuesday to see if they can you provide you with something, anything. Best of luck.",
      "MessageIndex": 5,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864857",
      "Title": "BiRads5/Second opinion ByTheSea2 Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Dec 20, 2017 07:08AM Rrobin0200 wrote: I am a firm believer in positive thinking. Hard as hell, yes. But dwelling on the negative only adds fuel to the cancer. Damn, I wish I could heed my own advice. Sending lots of positive vibes, a little bit of pink pixie dust, and well wishes you way. We'be got this in the bag!!",
      "MessageIndex": 6,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860998",
      "Title": "Ready to kick it! MHerzberg Georgia1"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Nov 30, 2017 09:02PM Rrobin0200 wrote: hi all... Even though my biopsy, diagnosis and treatment were all back in March, I browse through this site frequently and came across this forum. I know all too well the agony all of you are going through right now. The waiting, the anxiety, the what if's... they're horrible and is hands down, the worst part of this terrible journey we find ourselves on. Nothing I can say or do will make this better for anyone at this moment. But, know that you have found the BEST site to obtain knowledge and insight. Once your biopsy results come in, whether positive or negative, a plan will be put into place. And once that treatment plan, If needed, is set in stone, you will feel much, much better. I will keep all of you near and dear to my hearts and prayers. I don't wish any of this on my worst enemy.  Ps... piece of advice, if i may..... do NOT google anything. Dr Google does not have a medical degree. If you are looking for answers to your questions, want to vent, or otherwise just socialize, come to this BC site.",
      "MessageIndex": 40,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/860291",
      "Title": "Biopsies the week after Thanksgiving anyone? DagnyT DagnyT"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "May 15, 2019 07:20AM Rrobin0200 wrote: can you post the results of the mammogram? What was your Birads score?",
      "MessageIndex": 6,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871533",
      "Title": "It has been a LONG week so far... jenni0102 moth"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 26, 2017 04:03AM - edited Aug 19, 2017 11:31AM by I had my BMX on 3/31. Surgery was 9 hours, which included reconstruction (direct implants) I didn't qualify for DIEP flap surgery (too thin) but will be having stage 2 surgery in the fall which consists of fat grafting. Any insight to this fat grafting? They will take a little fat from stomach, thighs and butt areas.",
      "MessageIndex": 966,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 12, 2018 09:06AM Rrobin0200 wrote: for peace of mind, I would seek a second opinion. Why not?",
      "MessageIndex": 8,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863836",
      "Title": "New symptoms, IBC seems way too likely now Hbee93 Hbee93"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Sep 4, 2018 06:39PM Rrobin0200 wrote: djmammo... in your opinion, what is better? An ultrasound or a Mammo for finding small abnormalities? If one exam depicts something that the other doesn’t, then how do we know which exam is better for finding recurrences, etc.?",
      "MessageIndex": 2,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867002",
      "Title": "Breast Pain and CAT Scan estrella90 Jons_girl"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Sep 5, 2018 06:17PM Rrobin0200 wrote: thank you djmammo for your response! Greatly appreciated",
      "MessageIndex": 6,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867002",
      "Title": "Breast Pain and CAT Scan estrella90 Jons_girl"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jul 4, 2018 02:22PM Rrobin0200 wrote: I feel your anxiety. I think we all do. This is the worst part of it all. The waiting. The what if’s. The results of additional testing. It’s been said before, but it’s so true. Once you have a treatment plan in place, you’ll feel more in control. Right now you have nothing definitive... and that is anxiety at it’s highest. I would suggest asking your doctors for an anti-anxiety med. believe me, it’s worth it. Do not google. Rely on your doctors. I googled in the beginning, and everything I read was a death sentence. I wish I knew then what I know now. Dr. Google doesn’t have a real M.D. make sure you fully trust your docs. You’ll be fine. Wishing you all the best.",
      "MessageIndex": 10,
      "PostDate": "04/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865638",
      "Title": "I cant do this. Careninnj Laurenrw"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Oct 30, 2017 10:34AM Rrobin0200 wrote: nothing too bad. More like a pinch. It's over before you know it. Don't watch the doc pull it out.. turn your head the other way. Wishing you zero pain!",
      "MessageIndex": 6,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/859773",
      "Title": "Drain removal....prepare me Kahnartist Momine"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jul 20, 2017 08:40AM - edited Aug 19, 2017 02:31AM by it could be an emergency if there is nodal involvement. You have to be your own advocate. I most definitely would be calling to request an earlier appointment and/or put my name on the cancellation list.",
      "MessageIndex": 11,
      "PostDate": "20/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857080",
      "Title": "Scared and alone Jennmommi nikmar"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Rrobin0200 wrote: I had my bmx 1.5 years ago with immediate, direct to implant reconstruction . A few months later I had fat grafting to even out the ripples that the implants caused. My results are amazing. However, I just had a follow up appointment today with my breast surgeon. An ultrasound was completed, and two cysts were found in both breasts, exactly where my PS did the fat graft. My BS told me that this is 💯 normal. I trust her fully. Anyone else have these cysts after a surgery Appear? Why now, 7 months post fat transfer surgery? she said that they were perfectly round, consisted of fluid, no shadowing. Dx 3/6/2017, DCIS, Left, 1cm, Stage 0, Grade 3, 0/4 nodes, ER-/PR- Surgery 3/31/2017 Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865791",
      "Title": "Cysts after surgery? Rrobin0200 Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 6, 2018 05:48AM Rrobin0200 wrote: thank you for your reply. Although I hate that anyone of us has to have this, I feel comfort that I'm not alone.",
      "MessageIndex": 2,
      "PostDate": "06/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/863767",
      "Title": "Periodic spontaneous pain Rrobin0200 Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Rrobin0200 wrote: hi all, DX left breast DCIS 3/6/17. BMX 3/31/17 with immediate direct implant reconstruction. Small fat grafting done in September to even out a few ripples. Results are amazing. However, I periodically get shooting pains in the breast that had DCIS. To the point where I demanded an ultrasound. Us indicated scar tissue and nerve damage. Anyone else? I feel like I'm getting stabbed sometimes... it takes my breath away. Dx 3/6/2017, DCIS, Left, 1cm, Stage 0, Grade 3, 0/4 nodes, ER-/PR- Surgery 3/31/2017 Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/863767",
      "Title": "Periodic spontaneous pain Rrobin0200 Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Nov 27, 2017 10:19AM Rrobin0200 wrote: definitely switch surgeons. You have to be your own advocate. Trust your inruirion",
      "MessageIndex": 1,
      "PostDate": "27/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860437",
      "Title": "Not sure what to do NannaKay Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Rrobin0200 wrote: I accidentally blocked someone on here when I hit “send\" when replying to a private message. HOw do I unblock? Dx 3/6/2017, DCIS, Left, 1cm, Stage 0, Grade 3, 0/4 nodes, ER-/PR- Surgery 3/31/2017 Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866546",
      "Title": "How to unblock someone?!? Rrobin0200 Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 18, 2017 08:59PM - edited Aug 19, 2017 04:31AM by Rrobin0200 So sorry you have found yourself here. It's s club no one wants to join, but you've definitely come to the right place. I, too, was dx with DCIS in March of this year. I decided on a bilateral mastectomy, (w/reconstruction) which I had approximately 2.5 weeks after diagnosis. I know many people on here that have had lumpectomies as their choice of treatment. My DCIS was a grade 3, so I personally wanted it out of me ASAP. Radiation is a must after a LX, but not after a BMX. (Per my understanding) May I ask why you don't want treatment right away?",
      "MessageIndex": 1,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858034",
      "Title": "How quickly do treatments progress? AngelaJL AngelaJL"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 12, 2018 04:08PM Rrobin0200 wrote: thank you, moth!",
      "MessageIndex": 2,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866546",
      "Title": "How to unblock someone?!? Rrobin0200 Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 23, 2017 06:58PM - edited Aug 19, 2017 10:31AM by I wholeheartedly agree with MTwoman. You MUST break up with Dr. Google. He is not good for your health and well being. Take our advice, please. I wish I would have. I googled and googled until I literally almost put myself in the hospital. I was worried so much. Every ache and pain, I attributed to my diagnosis. Stick to the support here on this website. Everyone that I've met is extremely knowledgeable, professional, and such a great source of support. Don't think about tomorrow. Take it one day at a time. That's the best advice I can give you. It will help both you and your child. Exercise. Read a book. Go on a quick get away. Listen to your doctors. Now, if I can heed my own advice..",
      "MessageIndex": 4,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856380",
      "Title": "Diagnosed 1 week ago with IDC Mykidsmom65 lrwells50"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 30, 2019 06:41PM - edited Apr 30, 2019 06:42PM by Rrobin0200 I totally agree, beesy. Although my Birads was a 4, my radiologist definitely prepared me. She said she was 90% sure it was something. I hated her at the time. Looking back, I hatedher bc I didn't like what she had to say. And hate is such a strong word. Now I love her.. her honesty, in retrospect, got me through it. I wrote her a thank you letter! Melmatt, Birads 5 is definitely scary.. but.. I have seen a few on this board that have come back saying their Birads 5 was NOT cancer. It's slim, but it has happened. We are here for you.",
      "MessageIndex": 14,
      "PostDate": "30/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/871288",
      "Title": "BiRads 5–could this be anything besides cancer? Melmatt DogMomRunner"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "May 21, 2017 01:25PM - edited Aug 19, 2017 10:31AM by Any lump needs to be checked out. It could be anything.... but you'll only know through the mammo/US/biopsy. Sending positive thoughts and many prayers your way.",
      "MessageIndex": 1,
      "PostDate": "21/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855313",
      "Title": "Found a lump concerned Missvan Kicks"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Nov 29, 2017 09:21AM Rrobin0200 wrote: BMX here after DCIS dx. ZERO regret. Reconstruction same day and couldn't be happier. That's just me though",
      "MessageIndex": 10,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860474",
      "Title": "DCIS 0 high grade and opting for Bilateral mastectomy Shakes561 Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 12, 2018 10:58PM Rrobin0200 wrote: I had my mammo/ultrasound AND biopsy done all within a 5 hr time frame. The radiologist and her techs rearranged their own lunch schedule to fit me in. Unfortunately, it's not the norm, but it can be done. They suspected DCIS and when the results came in, I was notified immediately.",
      "MessageIndex": 9,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863913",
      "Title": "Everything is happening so fast Taddyallen mommakat"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Mar 13, 2019 03:10AM - edited Mar 13, 2019 03:13AM by Rrobin0200 without a doubt, I knew I wanted a double mastectomy. A lumpectomy didn't even cross my mind. I know that the recurrence rates for Lx vs Mx are the same, but IN MY MIND I wanted to take the most aggressive approach... I've never looked back, never regretted it. But as you said, it's a personal opinion. There's absolutely no right or wrong. Let your doctors guide you, but definitely listen to your instincts as well. Best of luck.",
      "MessageIndex": 1,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870338",
      "Title": "Lumpectomy vs mastectomy how did you decide? April0315 April0315"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jul 20, 2018 12:15PM Rrobin0200 wrote: I had a cluster of microcalcifications, no mass. DCIS was my diagnosis. Caught the SOB dead in its tracks. Like your BS said, IF it’s anything, it was caught way early. Best of luck and let us know.",
      "MessageIndex": 1,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866026",
      "Title": "Micro calcifications with no mass? Kerri-on-cloud9 Sunshine1970"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jul 28, 2017 10:10AM - edited Aug 19, 2017 05:31AM by I agree with everything ChiSandy said",
      "MessageIndex": 11,
      "PostDate": "28/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/856546",
      "Title": "Grade 3 and scared Kimhf Jeremiah29-11"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 16, 2017 02:17PM - edited Aug 19, 2017 05:31AM by the anxiety is debilitating. Day time is ok as I have things to take my mind off of bc. But nighttime? A totally different story. My mind goes to dark places! I've talked to a therapist, honestly to no avail. The support group that ive joined Is helpful; but I've only been twice. They only offer it the first Thursday of the month.",
      "MessageIndex": 94,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Sep 10, 2017 07:07PM Rrobin0200 wrote: well said, notverybrave. \" There really is no \"good\" decision.. they all suck.\" Never has anyone spoken truer words. It truly is what you can personally handle. I too was a perfect candidate for LX with rads, but to me, a BMX was the right decision for me. I do not regret it, and am totally loving my reconstruction.",
      "MessageIndex": 9,
      "PostDate": "10/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858554",
      "Title": "Radiation vs Mastectomy cece424 pollicakes"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Dec 24, 2017 07:06PM Rrobin0200 wrote: merriest of Christmas to all of you!!",
      "MessageIndex": 3,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/861083",
      "Title": "Merry Christmas n Happy Holidays. msphil Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 25, 2017 03:38PM - edited Aug 19, 2017 05:31AM by I wholeheartedly agree with everything you just posted. It is so overwhelming in the beginning, but once a plan is in place, you have more control. Waiting was the worst part for me. Once I decided to have my double mastectomy, there was no going back. It was way easier than I anticipated, and I am enjoying my reconstruction!",
      "MessageIndex": 18,
      "PostDate": "25/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853971",
      "Title": "Diagnosed yesterday with IDC and I'm feeling overwhelmed Kmbrll54 Msjackiefan"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 11, 2019 09:32PM Rrobin0200 wrote: sassa.. the sprung?!?! That doesn’t sound good! What the heck is that?!! Thanks everyone for their responses!",
      "MessageIndex": 5,
      "PostDate": "11/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/870947",
      "Title": "Zingers..??? Rrobin0200 Rah2464"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 12, 2019 10:38PM Rrobin0200 wrote: ah, yes. The infamous cording. I did experience that. No fun. The sound is disgusting!",
      "MessageIndex": 7,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/870947",
      "Title": "Zingers..??? Rrobin0200 Rah2464"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Rrobin0200 wrote: I'm two years out this past March. Occasionally, I will get zaps throughout the breast. Is this still normal? I know everyone said that in the beginning this would happen bc of the nerves regenerating, but still? Had a bmx with reconstruction on 3/31/17 for DCIS, grade 3. Had my two year follow up last week with an U/s, and everything looked fine. Except.. a suture granuloma? WTH is that? Radiologist and breast surgeon said nothing to worry about. Birads 2. Dx 3/6/2017, DCIS, Left, 1cm, Stage 0, Grade 3, 0/4 nodes, ER-/PR- Surgery 3/31/2017 Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/870947",
      "Title": "Zingers..??? Rrobin0200 Rah2464"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Dec 12, 2017 02:58PM Rrobin0200 wrote: LBoyMom... it's paralyzingly, isn't it? The waiting, THE CALL, the telling your loved ones. It all sucks. No other words to describe the fear. BUT... you will get through it. Here I am, 9 months out, and I'm telling you this. When people told me that it would get easier, I rolled my eyes at them. Yeah right.. easier? But it does. It will. Life will go on. Albeit a bit different, but none the less, it will go on. Hang in there. Make sure you try to distract yourself. Have loved ones go to appointments with you. You can't do this alone. You have your appointment already set up... that's awesome. Take it one day at a time. Trust your doctors. Like your doctors. You will be with them for quite some time.  Breathe. I promise you, it will get easier.",
      "MessageIndex": 11,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860791",
      "Title": "Just got the call LBoyMom claireinaz"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Dec 12, 2017 03:02PM Rrobin0200 wrote: LBoyMom... it's paralyzingly, isn't it? The waiting, THE CALL, the telling your loved ones. It all sucks. No other words to describe the fear. BUT... you will get through it. Here I am, 9 months out, and I'm telling you this. When people told me that it would get easier, I rolled my eyes at them. Yeah right.. easier? But it does. It will. Life will go on. Albeit a bit different, but none the less, it will go on. Hang in there. Make sure you try to distract yourself. Have loved ones go to appointments with you. You can't do this alone. You have your appointment already set up... that's awesome. Take it one day at a time. Trust your doctors. Like your doctors. You will be with them for quite some time.  Breathe. I promise you, it will get easier.",
      "MessageIndex": 12,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860791",
      "Title": "Just got the call LBoyMom claireinaz"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 13, 2018 10:47PM - edited Aug 13, 2018 10:48PM by Rrobin0200 you tell them how, Where and when, and especially WHEN you feel comfortable. This is up to you. I was obviously in your shoes once. I told my family... some in person, some over the phone. There's no right or wrong way. There will be no easy way but it has to happen. Don't feel guilty.. this was not your fault. Will they be upset? Of course, because they love you. But believe me, you will need to lean on them. So, IMO, I say the quicker they know, the better. Best of luck to you. Will be thinking of you.",
      "MessageIndex": 1,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/866574",
      "Title": "Advice on telling family Dani444 WC3"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 29, 2018 10:12PM - edited Aug 29, 2018 10:14PM by Rrobin0200 I was diagnosed on 3/6 and had my surgery on 3/31 (of last year) It normally takes a few weeks for scheduling, prep, etc. So, don’t stress. I think you will be just fine. ",
      "MessageIndex": 15,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866867",
      "Title": "Recently diagnosed awaiting operation date tlw0818 Nigoha"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Mar 21, 2019 02:53AM - edited Mar 21, 2019 01:21PM by Rrobin0200 hi there. I'm sorry that you find yourself here. Did the radiologist give you a Birad rating after your mammogram? Do you have a copy of the report? Remember, nothing is known until the biopsy report comes back. The waiting is torture.. try your best to focus elsewhwre. You're on the right path. Wishing you all the best.",
      "MessageIndex": 1,
      "PostDate": "21/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870465",
      "Title": "New and terrified Mumoftwo416 KBeee"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 6, 2018 11:05AM Rrobin0200 wrote: when is your mammo and us? Keeping you in my thoughts and prayers. I've had two miscarriages. I know the agony of that, plus the agony of the dreaded BC. Please keep us posted.",
      "MessageIndex": 4,
      "PostDate": "06/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863723",
      "Title": "Afraid of IBC Hbee93 Hbee93"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 15, 2018 11:09PM Rrobin0200 wrote: how insensitive, unprofessional and unethical this nurse is. I'm glad you reported her. Imagine how many other patients have had to deal with her",
      "MessageIndex": 8,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863772",
      "Title": "Nurse mocked me - I KID YOU NOT Jeremiah29-11 Lula73"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 17, 2017 12:31PM - edited Aug 19, 2017 07:01PM by Artista... yes, I had mild lymphedema in my non cancerous arm. It was painful, but after several sessions with the PT, it has diminished significantly.",
      "MessageIndex": 4197,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 21, 2019 09:39PM Rrobin0200 wrote: you won’t be able to lift your arms above your head, so definitely have your husband help wash and dry. Tbh, you won’t want to move your arms above your head... it’s just too complicated with the drains. Make sure everything is at arms reach...",
      "MessageIndex": 3,
      "PostDate": "21/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871142",
      "Title": "How do you Wash Hair after a Double Mastectomy? Christene502 Christene502"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Dec 13, 2017 10:21PM Rrobin0200 wrote: I wish there was a \"like\" button for Beatmon's reply. So simple, yet so true,",
      "MessageIndex": 5,
      "PostDate": "13/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860812",
      "Title": "Just starting this fight Mamatwoboys PVM"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Oct 17, 2018 10:19PM Rrobin0200 wrote: lula, you took the words RIGHT out of my mouth. Couldn’t have said it better.",
      "MessageIndex": 21,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867604",
      "Title": "Uni or double Samnjb MCBaker"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 25, 2017 12:04AM - edited Aug 19, 2017 11:31AM by Rrobin0200 better to be safe than sorry. I would have ran to my gyno as well. You are so incredibly lucky that you were seen within a 10 min timeframe. Sending well wishes, positive vibes, lots of prayers, and a little bit of pink pixie dust your way. Hoping for B9 report.",
      "MessageIndex": 3,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856410",
      "Title": "Worried and Wondering FXS Kicks"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Sep 11, 2018 12:26PM Rrobin0200 wrote: me. Diagnosed 2017. The initial shock is debilitating. But, now that I’ve “been there, done that” I can tell you that it’s not the end. Believe me. I know you’re feeling like that. But once you get s plan In place, you’ll undergo treatment and will get on with your life. Trust me.",
      "MessageIndex": 1,
      "PostDate": "11/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867117",
      "Title": "Left breast Rainny aragoncl"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 21, 2018 09:58PM Rrobin0200 wrote: so incredibly sorry you’ve found yourself here, but remember, you’re not an official member of the “club” until the biopsy path report comes back positive. As stated above, a birads 5 has a 95% probability of being malignant, but a 5% chance of being benign. You just never know. Hopefully, Like a few of our fellow members, you’ll find yourself in that 5%. But if not.. BC is not a definitive death sentence. You will get through this. This waiting period is the worst... absolute torture. Once you get results, get a team together and get a treatment plan (if needed) in place, you will feel so much better. You’ve got this. And we have your back.",
      "MessageIndex": 7,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865363",
      "Title": "World Upside Down and looking for some hope KK2018 Canavaro"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "May 2, 2017 11:02AM - edited Aug 19, 2017 03:31AM by as MT indicated, I'm not quite sure what questions need to be asked during this initial exam, except, should a mammo/us/MRI be conducted? And I'm quite sure that your physician will order one anyway without you even asking. From there, you can ask when the results will be ready and if the results will be given to you via phone call or an actual appt. Many blessings being sent your way .",
      "MessageIndex": 2,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854706",
      "Title": "Dimpling, going to dr. What Qs should I ask? Lavande Lavande"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Nov 27, 2017 01:30PM Rrobin0200 wrote: honestly, I was so happy to get them off. Since the lefty was misbehaving, she set the tone for both of them. I'm now in love with my newly reconstructed breasts. No goodbye parties for me... it was actually a good riddance!",
      "MessageIndex": 5,
      "PostDate": "27/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860414",
      "Title": "Mastectomy Sisters How did u celebrate/remember your breasts? sm627 sm627"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jul 1, 2018 11:31PM Rrobin0200 wrote: kk2018... been thinking of you. How’s it going?",
      "MessageIndex": 12,
      "PostDate": "01/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865363",
      "Title": "World Upside Down and looking for some hope KK2018 Canavaro"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jan 10, 2019 02:35PM Rrobin0200 wrote: there could be a multitude of reasons why you are experiencing these symptoms. Easier said than done, but please try To remain calm about it. Wishing you althe best and please let us know the results. We are here for you should you continue to need us",
      "MessageIndex": 5,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869271",
      "Title": "Worried/scared but trying not to be... dmerri18 dmerri18"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 26, 2017 05:50AM Rrobin0200 wrote: hoping and praying for a B9 result. The waiting is torture. Forgive me for sounding ignorant, but what is the difference between a birad 4a and 4c? My radiologist just gave me a 4. No letter behind it. Insight?",
      "MessageIndex": 7,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857943",
      "Title": "Wrong Bi-rad Lmcnz MTwoman"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 19, 2017 11:53AM - edited Aug 19, 2017 07:01PM by Rrobin0200 ouch, ouch, ouch. Did I say ouch?! Yes, I had the same pain. Had BMX 3/31/17. The shoulder pain and under arm pain was more like a burning sensation... and it lasted for weeks, I'm sad to say. Nothing much helped, unfortunately. It will eventually go away. In the meantime, maybe ice packs? Are you still on your pain meds?",
      "MessageIndex": 6,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858020",
      "Title": "Shoulder blade and under arm pain after mastectomy??? GreenEyes81 Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Mar 25, 2019 12:29PM Rrobin0200 wrote: mum, so happy you have a biopsy date. Tuesday will be here before you know it. Make sure to grab a copy of that report though... it’s rightfully yours to keep.",
      "MessageIndex": 14,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870465",
      "Title": "New and terrified Mumoftwo416 KBeee"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 20, 2017 08:58PM Rrobin0200 wrote: I was able to go back to work after my biopsy, so I'm guessing that you will be able to as well. Being alone with your thoughts is awful. If you're allowed to, I definitely suggest going back to work. It will keep your mind (somewhat) off the biopsy results and will pass the time. Make sure toask when they expect the results to be in. Will they call you, or will the doctor call you? Knowing these things helped the anxiety a bit for me. Hoping for B9 results. Please Let us know.",
      "MessageIndex": 11,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857902",
      "Title": "Breast mass completely ignored by radiologist for 6 YEARS Hafdozen Hafdozen"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Aug 15, 2017 09:15AM - edited Aug 19, 2017 05:31AM by I personally think that's absurd. My Dx was 3/6/17, and my bmx with reconstruction was 3/31/17. I would define felt keep \"bugging\" then to up your appointments or at least put you on a cancellation list.",
      "MessageIndex": 6,
      "PostDate": "15/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/857898",
      "Title": "Diagnosed six months ago and still no treatment jewellsflight Falconer"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 5, 2018 09:34PM Rrobin0200 wrote: the ptsd is surely a legit issue... it definitely was for me. It took almost a full year.. and anti anxiety meds.. to help out. Hell, this is a life changing event. A piece of our womanhood was cut from our body. Even though I had reconstruction the same day, I couldn't get over the fact of what I had been through. It's still a tough pill to swallow.",
      "MessageIndex": 3,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/863762",
      "Title": "PTSD After Mastectomy? Engine104 Engine104"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Sep 9, 2018 10:03PM Rrobin0200 wrote: point blank, the waiting sucks. Sorry for being so blunt. But, you’re doing the right thing. You have to have it checked. It simply could be nothing. In the meantime, find something to take your mind off of it. Exercise, movies, working in the yard, etc etc. Maybe even try calling to see if you could get bumped up in the event another patient cancels. Don’t waste your time worrying. It truly will not do any good. Plus, the stress is even worse for you. But one thing... do not google!!! That is the detrimental to your mental health. Half of the stuff that you read onlineis not even legitimate info. Let us know how it goes. We’re here, either way. Best of luck, positive vibes your way.",
      "MessageIndex": 1,
      "PostDate": "09/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/867095",
      "Title": "Diagnostic Mammogram Thursday jmb27 jmb27"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jul 3, 2018 10:15PM Rrobin0200 wrote: kk2018... bummer. But, now you know. And now it’s time to get in fight mode. Go on your vacation, ENJOY yourself, and then come back ready! You’ve got this. Do they have a stage yet?",
      "MessageIndex": 17,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865363",
      "Title": "World Upside Down and looking for some hope KK2018 Canavaro"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Nov 26, 2017 09:39PM Rrobin0200 wrote: vitamin c is a must. I took extra pre surgery and post surgery. Healing time was definitely cutbin hakd",
      "MessageIndex": 5,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860368",
      "Title": "Pre- and Post-surgery supplements, vitamins and foods swg Rrobin0200"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Dec 24, 2017 07:09PM Rrobin0200 wrote: I agree with Chloe, even though I don't have expanders. I had direct implant. But still... be very, very careful. Light, light upper body work for at least a year, per my surgeon.",
      "MessageIndex": 13,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 18, 2018 12:22AM Rrobin0200 wrote: SunnyDee, I am so sorry you find yourself here. It’s not a club we wish to join, but one that you will find comfort and extremely valuable information. Take a look at this forum that I found on this site. It’s very informative about Bi-rads 5 rating. Remember, nothing is proven until your pathology results are in your hands. I’ve seen some, albeit not many, bi-rads 5 scores come back benign. Breast cancer treatment has come a long way. We are here for you, should you need us. Best wishes. https://community.breastcancer.org/forum/62/topics... ",
      "MessageIndex": 51,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865124",
      "Title": "Highly suspicious of malignancy Nicole1966 Nicole1966"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 4, 2018 10:48PM Rrobin0200 wrote: I don’t think you’re weird or crazy. Everyone reacts differently; I was a complete basket case. Intuition and positivity plays a huge role.. if your intuition says that you will beat this, and you go forth with a positive attitude all while listening to your docs (and your intuition) during treatment, you are way ahead of the game. Best wishes.",
      "MessageIndex": 11,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865035",
      "Title": "Newly diagnosed-but not worried...Am I crazy?? Cherylf star2017"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Oct 16, 2018 03:11AM Rrobin0200 wrote: my radiologist was 95% sure it was cancer. She was right",
      "MessageIndex": 16,
      "PostDate": "16/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/867754",
      "Title": "Radiologist predict the outcome? Lauraak JaBoo"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "May 2, 2017 01:16PM - edited Aug 19, 2017 05:31AM by \"I'm so sorry, runnermom, that you have found yourself here. It stinks, but this is the best forum to be a member. The initial shock... wow... are there really any words? I, Like you, am a marathon runner, exercise loving fool. I was downright angry. How could my body do this to me? I treated it so well with exercise and organic foods/products. I'm a devout Catholic. BUT, none of us are invincible. So, once I finally \"accepted\" the diagnosis and had a plan in place, I hit the ground running (no pun intended😂!). My advice to you: do not search the internet. Listen to your doctors and the women and men on this forum. The internet is a very scary place, and it will bring you to dark places. You owe yourself the time to grieve, but know that you have many many people right behind you cheering you on. This is your body, you can do it!!!! ❤❤",
      "MessageIndex": 14,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/854513",
      "Title": "IlC JUST DIAGNOSED Runnermum Runnermum"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 2, 2017 03:38AM - edited Aug 19, 2017 10:31AM by 37",
      "MessageIndex": 729,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 18, 2018 09:50PM Rrobin0200 wrote: I would like the link as well, please?",
      "MessageIndex": 5,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/865224",
      "Title": "Tamoxifen and Weight Runnergurl exercise_guru"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Sep 5, 2018 09:55PM Rrobin0200 wrote: my bmx was 1.5 years ago. To date, I still have occasional zaps that take my breath away. I know the feeling all too well. I wish I could say that it gets better, but I can’t. Just know that it happens occasionally.. not every day.",
      "MessageIndex": 3,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/867014",
      "Title": "Nerve Pain?? Pink24 Pink24"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 2, 2017 03:29AM - edited Aug 19, 2017 10:31AM by I'm assuming it's because of dense breast tissue? To my knowledge, an US is better at deciphering between normal vs abnormal. However, only a biopsy will be accurate in B9 vs malignant.",
      "MessageIndex": 1,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855696",
      "Title": "question about ultrasounds/repeated mammograms momand2kids LonesomeDove"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 26, 2017 06:59PM - edited Aug 19, 2017 05:31AM by nervous, I had practically the same mammo results as you, but my calcifications were a tad larger. After the biopsy revealed dcis, I opted to go the route of double mastectomy with complete reconstruction. I do not regret it. However, my dcis was high grade, therefore I wanted the most radical approach. I faired well after the surgery and am super happy with my new girls. Try not to freak out. It's easier said than done, I know. But IF it is anything, you caught it early. Best wishes to you. Pls let us know the results. Btw, were the calcifications clustered? pleomorohic?",
      "MessageIndex": 5,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/854520",
      "Title": "waiting on stereotactic biolsy results nervousnelly456 YazMar74"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Sep 1, 2017 10:49PM Rrobin0200 wrote: waiting is torture. I swear, they need to invent something that gives a positive or a negative resultASAP. I received a call from the nurse practitioner, but I asked her to phone me when the results were in. I had to know, asap. I wanted to prepare myself prior to the appointment.",
      "MessageIndex": 4,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858348",
      "Title": "How would you rather receive your results? FarAwayToo Susug"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "May 1, 2017 11:34AM - edited Aug 19, 2017 03:31AM by I will be saying prayers for you throughout the day and sending positive vibes and pink pixie dust your way. What time is you appt tmrw with your dr.?  Waiting is the absolute worst. But for today, get a message, get a mani and a pedi, have a nice lunch, and before you know it, tmrw will be here. Don't worry about what may or may not happen... it's useless anyway. Sending love",
      "MessageIndex": 20,
      "PostDate": "01/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854449",
      "Title": "Really looking for hope Adelozier purple32"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jan 13, 2019 09:01PM Rrobin0200 wrote: that’s correct.. only a biopsy can prove a malignancy. The radiologist can offer his/her expert advice, but nothing is certain until the path report comes back. Best of luck",
      "MessageIndex": 3,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869327",
      "Title": "Mammogram Ultrasound biopsy Karmic108 Karmic108"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Mar 17, 2018 12:49PM Rrobin0200 wrote: yes. It will take a little while, but it will definitely go away. Mine lasted about 3-4 weeks. My surgeons said that it was almost definitely nerves regenerating. I'm almost 1 year post (march 31) and I still get little \"zaps\" from time to time. Hang in there.",
      "MessageIndex": 1,
      "PostDate": "17/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863276",
      "Title": "Post mastectomy sunburn feeling aweate bluepearl"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jun 28, 2018 08:53PM Rrobin0200 wrote: heck no. No way I would risk it. My bmx recovery was smooth sailing (no pun intended) but it was within the comfort of my own home. You most probably will still have the drains, which are a pain in the a$$. Infections and viruses can run rampant on those cruise ships. Please rethink.",
      "MessageIndex": 10,
      "PostDate": "28/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865493",
      "Title": "Travel after double mastectomy Musikjunki32 exbrnxgrl"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Jan 10, 2018 09:21PM Rrobin0200 wrote: if my math is correct, .9mm equates to less than 1cm... small. Try not to panic. Let us know if you have any further questions. We're here for you. This site is incredible!! Prayers for B9 results.",
      "MessageIndex": 1,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861519",
      "Title": "Birad4 Kathryn1894 momto3sons"
    },
    {
      "AuthorID": "Rrobin0200",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250133/profile",
      "Content": "Apr 13, 2019 03:38PM - edited Apr 13, 2019 03:38PM by Rrobin0200 I drove two weeks after my BMX. I had just gotten my drains out the day prior. Thus, the decision to drive wasn't the smartest. I was in a great amount of pain.",
      "MessageIndex": 7,
      "PostDate": "13/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870967",
      "Title": "Driving After Bilateral Mastectomy hodgepodge hodgepodge"
    }
  ]
}