{
  "AuthorID": "Rufhewn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
  "Posts": [
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 15, 2016 10:07PM Rufhewn wrote: Jen, since your doctor ordered the mammogram vs. a routine mammogram screening, you likely will get some information tomorrow. A mammogram is not painful, some pressure and it's awkward to get situated for the exam (several different positions) but it will be over in less than ten minutes. It's kind of like an x-Ray at your dentists but of your breasts. An ultrasound is not at all uncomfortable. A biopsy can be a bit painful depending what type of biopsy they do. It should all be over before you know it. Tell them how anxious you are and that you'd really like to find out whatever you can asap. The radiologist may talk to you about the findings. A biopsy is sent out and can take a few days for results. Call the Doctor who ordered the mammogram and ask to have a prescription of Ativan waiting for you which will help you through the anxiety we all know too well. Put one foot in front of the other and whatever the news, which could be nothing serious, you will get through this. Let us know how it goes. Will be holding your hand in spirit. Pam",
      "MessageIndex": 12,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845161",
      "Title": "Freaking Out! Jen77 cuddyclothes"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 14, 2016 09:45PM Rufhewn wrote: Am so sorry you have much on your plate, scary stuff. But things have a way of working out and if by a small chance you do have BC, it is a very treatable disease. It's not easy but admittedly after some dark hours, the light came out and life went back to pre-BC with some emotional roller coaster stuff thrown in. And the odds are in your favour so try to focus on that and yes, stay off google. A dear friend who was diagnosed 18 years ago with Bc called me recently with a similar scare like you describe and was convinced her cancer had recurred. Turned out it was an infection in her breast. Hang in there.",
      "MessageIndex": 7,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845161",
      "Title": "Freaking Out! Jen77 cuddyclothes"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 15, 2016 10:08PM Rufhewn wrote: I had to schedule my biopsy but every breast Center may be different. ",
      "MessageIndex": 13,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845161",
      "Title": "Freaking Out! Jen77 cuddyclothes"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 14, 2016 01:08AM Rufhewn wrote: You are right, you will get through this and life will get back to where it was before your dx. My darkest days were right after diagnosis, then the journey began. My advice, take one day at a time and lean on loved ones, friends and this forum to make it easier. Good luck, sending positive thoughts that all the upcoming information on your situation will be the best news possible (mine was).",
      "MessageIndex": 7,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 26, 2017 07:24AM Rufhewn wrote: So sorry for your anxiety, that is very difficult. I would just point out that many women have multiple risk factors and never get breast cancer while women with zero or low risk factors are diagnosed. Sending you good thoughts that you are and continue to stay BC free. Being close to a loved one going through a diagnosis/treatment can also put our minds in overdrive too.",
      "MessageIndex": 2,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856428",
      "Title": "Risk factors piling up and I'm trying not to stress too much. Kerri_Oz Kerri_Oz"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 6, 2016 05:58PM Rufhewn wrote: Hi, I was 58.",
      "MessageIndex": 615,
      "PostDate": "06/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 16, 2016 01:33AM Rufhewn wrote: The sooner you start chemo, the sooner it will be over! I had chemo first, then surgery, followed by radiation. By the time I finished radiation, my hair was growing back and I was feeling life getting back to normal. Take one day at a time and trust this is just a huge yucky bump in the road. And there's always wine.",
      "MessageIndex": 9,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 23, 2014 01:54AM Rufhewn wrote: Hi Kalina, we are starting is journey very close together having just been diagnosed June 20th.  A am almost 59 in August.  Glad you had a recent mammogram which should bode well for your lymph node involvement.  I let mine go a long time seriously regret it.   My tumor is very small (under 1 cm)  but I have some enlarged nodes that have been that way for awhile.  Haven't talked to any doctors yet but need to soon as the anxiety is killing me.  Like you, have a wonderful husband and support system.  Oh, and I am HER2 positive which adds tremendously to my anxiety.  Hanging barely. Pam",
      "MessageIndex": 6,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822210",
      "Title": "The Biggest Challenge is here now... waiting for the details. Kalina Nancy2581"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 15, 2017 02:20AM Rufhewn wrote: Nnasmom, glad you will get results very soon. I have a great MO but found the nurse practitioners to be very knowledgeable and compassionate. They always are able to take more time to explain things. Sending you a hug and hoping to hear all is fine or if the news isn't what you hope for, it will be easily treatable. One day at a time. ❤ Pam   ",
      "MessageIndex": 36,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856023",
      "Title": "Anyone else expecting results next week? Mins_Mum Sweet_Pea"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 14, 2017 02:21AM - edited Jun 14, 2017 02:22AM by Rufhewn Ninasmom, sorry the communication from your medical team isn't clearer. The anxiety is tough enough but having to guess at what is going on is justplain not fair. One day at a time which is easier said than done.",
      "MessageIndex": 27,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856023",
      "Title": "Anyone else expecting results next week? Mins_Mum Sweet_Pea"
    },
    {
      "AuthorID": "Rufhewn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201855/profile",
      "Content": "Jun 23, 2014 01:46AM Rufhewn wrote: Just joining after being diagnosed on Friday, June.  Needless to say, it's been a horrible weekend in spite of so much love and support from family and friends.  Today started out a bit better until I happened to notice a small enlargement on my neck.  Sent me into a major whirlwind.  Anxious to get appointments going.  They gave me the pathology report and sent me home to interpret some very frightening stuff.  Worst weekend of my life.  I am 58, hadn't had a mammogram in years.  Feeling great but went in for a very late routine mammogram when it all started to unfold.  Glad this forum is here.  ",
      "MessageIndex": 5,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822210",
      "Title": "The Biggest Challenge is here now... waiting for the details. Kalina Nancy2581"
    }
  ]
}