{
  "AuthorID": "ruthiewilso…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183460/profile",
  "Posts": [
    {
      "AuthorID": "ruthiewilso…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183460/profile",
      "Content": "Jul 22, 2013 08:06PM ruthiewilson9 wrote: Thanks so much for the reassurance guys! I've been reading and MRI guided biopsy does seem like a prudent path. Anyone have insight into how much pain I should feel afterward and for how long? Will I be going braless for a few days? Thank you!",
      "MessageIndex": 3,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808028",
      "Title": "MRI Guided Biopsy - is that the right path? ruthiewilson9 MelissaDallas"
    },
    {
      "AuthorID": "ruthiewilso…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183460/profile",
      "Content": "Jul 17, 2013 12:31AM ruthiewilson9 wrote: Thank you for your prayers. Truly.",
      "MessageIndex": 2,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/807858",
      "Title": "MRI today. Missed call from doc. Bad sign? ruthiewilson9 Jestea"
    },
    {
      "AuthorID": "ruthiewilso…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183460/profile",
      "Content": "Jul 17, 2013 08:44AM ruthiewilson9 wrote: Thanks to everyone who posted. I was able to speak to the doctor at 8 a.m. this morning (so grateful that she was already in the office and at the same location today). Bad news is that the MRI confirmed that there is something there, so now I need to go the MRI biopsy route (I don't know all the terminology yet). The good news is I'm geting this dealt with. As I've read time and again on here it's the unknown and waiting that will undo you! Having concrete information and a next step is helpful. They couldn't schedule me until 10 days from now. Of course I hate the thought of waiting but so grateful to have a plan. Doctor says in a nutshell that we're likely looking at radial scarring or a cancer. Can anyone point me to data that tells me how often this sort of thing is benign v. cancer? Guess that's pointless because this is ME, no a study, but I'd like to know what the liklihood is based on stats.",
      "MessageIndex": 7,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/807858",
      "Title": "MRI today. Missed call from doc. Bad sign? ruthiewilson9 Jestea"
    },
    {
      "AuthorID": "ruthiewilso…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183460/profile",
      "Content": "Jul 17, 2013 12:39AM ruthiewilson9 wrote: Ariom, I think I love you. Thank you for the thoughtful and kind reply. I'll try to get some sleep and will be on the phone at 8 am when they open tomorrow.",
      "MessageIndex": 4,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/807858",
      "Title": "MRI today. Missed call from doc. Bad sign? ruthiewilson9 Jestea"
    }
  ]
}