{
  "AuthorID": "RuxiBul",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285067/profile",
  "Posts": [
    {
      "AuthorID": "RuxiBul",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285067/profile",
      "Content": "Feb 6, 2019 12:54AM - edited Feb 6, 2019 01:07AM by RuxiBul I have been in a slightly similar situation a couple of years ago when I was 33. A highly suspicious for malignancy lump was found in my left breast. I have seen 3 different doctors, all told me the same thing: \"This is most likely cancer! I'm so sorry for you, you're so young!\"It took some days in between running to different doctors who all did ultrasounds and one mammogram ( I did not want to repeat the mammogram). I cried rivers of tears in matters of days and was unable to function. I saw all my ultrasound reports and whatever was in my breast had spiculations, was taller than wide, has posterior enhancement, high Tsukuba score. Every feature pointed towards malignancy and none towards benign. Due to the position of this lump (close to pectoralis muscle), I was advised to go for excisional biopsy which I did. I had a ultrasound guided wire insertion (I was so terrified I had breast cancer that no physical pain was evident - I cannot recall if the insertion of that wire in my breast was painful). I went straight to the OR and nearly died of post-op complications.Through God's grace I was spared and the doctors stabilized me. The wait was long and during those 3 weeks, I lived as if I had cancer. I cried and prayed every day. When I got the call it felt like a dream: \"It is good, it's not cancer!\" I asked the doctor to repeat the news a few times. It was sclerosing adenosis. They also did immunohistochemistry tests to make sure it was sclerosing adenosis. In the lumpectomy site I developed an oil cyst due to fat necrosis resulted from sx. Today I live with fear and I go for check-ups every 6 months. I have developed a very specific health anxiety related to BC since my last scare. I think doctors need to learn to communicate very gently and to not make pre-diagnoses based on imaging alone when something is very suspicious. There are a few benign breast conditions that mimick malignancy and there are breast cancers who look benign on imaging. Until a biopsy nothing is definitive and even a biopsy is not 100% guarantee. While I think most doctors are right most of the time, there are instances in which looking at images will not tell the entire story. Had my doctors told me:\"This looks concerning, but we cannot say it's cancer until biopsy is done!\", I would have had some hope. When you hear:\"I'm sorry, this is 95% cancer!\" that is all you focus on. The 95% not the 5%. Sclerosing adenosis, although it is considered a benign breast disease, it increases the risk of breast cancer slightly. There is conflicting evidence. In some studies it was found to increase the risk, while in others it wasn't. I'll go with the fact that since there is evidence to support this claim, I will consider it's true and my risk is increased. I did not have atypia in my report, but whether sclerosing adenosis is found with atipia or not does not seem to matter. It increases the risk and that's all there is to me. I actually did an entire paper on this for my Anatomy & Physiology course, that's how much I wanted to know my risks. I am not happy that I had sclerosing adenosis, but I am happy it wasn't cancer. I have zero family history. Actually no one in either side of family had any breast/ovarian issues. I am very “special\" this way. Because no family history I do not qualify for any prophylactic surgery, even though I can afford and I am willing to pay. In Canada I cannot see a breast surgeon just because I have fibrocystic breasts and all kinds of weird lumps. In a way I wish I lived in US. It seems like there is some fluidity in the system and women see gynecologists and breast specialists. I cannot see a gynecologist unless I have something going on. There isn't such thing as I want to go for a check-up to make sure I'm fine.",
      "MessageIndex": 9,
      "PostDate": "06/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/833508",
      "Title": "Sclerosing Adenosis - very difficult to diagnose olivetree RuxiBul"
    },
    {
      "AuthorID": "RuxiBul",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285067/profile",
      "Content": "Feb 6, 2019 12:40AM - edited Feb 6, 2019 12:54AM by RuxiBul",
      "MessageIndex": 8,
      "PostDate": "06/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/833508",
      "Title": "Sclerosing Adenosis - very difficult to diagnose olivetree RuxiBul"
    }
  ]
}