{
  "AuthorID": "rwiley4529",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
  "Posts": [
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Oct 21, 2015 08:04PM rwiley4529 wrote: Thanks for all your input! DH and I are going away this weekend for our anniversary, there's a hot tub at the resort. I'm thinking I may just go ahead and get in, but keep my arm out, and don't stay in very long. I'll hang out *by* the hot tub as long as dh wants to stay in. :-) Ramona",
      "MessageIndex": 7,
      "PostDate": "21/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/835930",
      "Title": "Lymphedema and hot tubs rwiley4529 Outfield"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "rwiley4529 wrote: Here's my situation. Left arm and hand lymphedema. It's \"managed\" pretty well with a sleeve and glove. I've heard conflicting information about hot tubs and lymphedema. Some say never get in a hot tub, some say it's okay if I keep my arm out of the water. Now I'm asking the experts--what say you? :-) I don't have regular access to a hot tub, this would only be on vacation, perhaps a few times a year. Thanks! Ramona in CO Dx 7/3/2014, IDC, Left, 2cm, Stage IIIA, Grade 2, 4/20 nodes, ER+/PR+, HER2- Surgery 7/23/2014 Lumpectomy: Left; Lymph node removal: Sentinel, Underarm/Axillary; Prophylactic mastectomy: Left, Right Chemotherapy 8/20/2014 AC + T (Taxol) Radiation Therapy 1/13/2015 Whole-breast: Breast, Lymph nodes Hormonal Therapy Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/835930",
      "Title": "Lymphedema and hot tubs rwiley4529 Outfield"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Nov 13, 2015 03:29AM rwiley4529 wrote: Thank you BayouBabe, I'll look into it!",
      "MessageIndex": 2,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836702",
      "Title": "Help me understand BRCA1 rwiley4529 rwiley4529"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Nov 16, 2015 06:58PM rwiley4529 wrote: Thanks for the info. I was confused because when I looked up chromosome 17, it seemed to tie it to the BRCA1 gene. ",
      "MessageIndex": 6,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836702",
      "Title": "Help me understand BRCA1 rwiley4529 rwiley4529"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "rwiley4529 wrote: A year and a half past diagnosis, and now I'm starting to go through all the info and try to understand more about my diagnosis. Here's the part I need help with: \"Average number of chromosome 17 per cell: 2.5\" I googled chromosome 17 and learned that it's BRCA1. But I haven't been able to find out what the significance is for 2.5. Thanks for your help! Ramona in CO Dx 7/3/2014, IDC, Left, 2cm, Stage IIIA, Grade 2, 4/20 nodes, ER+/PR+, HER2- Surgery 7/23/2014 Lumpectomy: Left; Lymph node removal: Sentinel, Underarm/Axillary; Prophylactic mastectomy: Left, Right Chemotherapy 8/20/2014 AC + T (Taxol) Radiation Therapy 1/13/2015 Whole-breast: Breast, Lymph nodes Hormonal Therapy Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836702",
      "Title": "Help me understand BRCA1 rwiley4529 rwiley4529"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "rwiley4529 wrote: UCSF (University of California at San Francisco) is currently conducting a study to learn more about breast cancer treatment related lymphedema. They are looking for more participants. It requires filling out an online questionnaire, and a one-time 3 hour study visit at the UCSF campus. It pays $150. http://lymphaticnetwork.org/treating-lymphedema/clinical-trials/ It's the second one down. Even though I live in Colorado (meaning my time and travel would be worth more than $150), I decided to participate. Research is important—even if I am not helped by anything they learn, I have already been helped by the women and men who have gone before me on the breast cancer path. I was raised in the Silicon Valley, so I was eager to make a trip to San Francisco. I made my study appointment for a Friday morning. I flew into SFO on Thursday evening, and rode BART into San Francisco to my hotel. On Friday morning I went to the campus, and then I had the rest of the day Friday and all day Saturday to explore. Two sisters and one brother-in-law were able to join me on Saturday and we had a BLAST. Perhaps that's not workable for many of you. But for any who ARE able to participate, please consider it very seriously. I'll be happy to answer any questions that I can! (Also on that page, lower down, is a study being done by Stanford regarding lymph node transfer for arm lymphedema.) Ramona in CO Dx 7/3/2014, IDC, Left, 2cm, Stage IIIA, Grade 2, 4/20 nodes, ER+/PR+, HER2- Surgery 7/23/2014 Lumpectomy: Left; Lymph node removal: Sentinel, Underarm/Axillary; Prophylactic mastectomy: Left, Right Chemotherapy 8/20/2014 AC + T (Taxol) Radiation Therapy 1/13/2015 Whole-breast: Breast, Lymph nodes Hormonal Therapy Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/854705",
      "Title": "Participants needed for lymphedema research rwiley4529 Kicks"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Dec 31, 2015 09:47AM rwiley4529 wrote: I'm sorry you've had to join this sorority, but you've come to the best place there is! Try to remember to breathe... As hard as it can be to remember, the cancer didn't just show up a few weeks ago when you found it, so if you need to take some time to get second opinions, do research, change doctors, or whatever, it won't cause any harm.",
      "MessageIndex": 1,
      "PostDate": "31/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/839143",
      "Title": "Just diagnosed and overwhelmed Kdettwiller Kdettwiller"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Dec 25, 2015 02:04PM rwiley4529 wrote: I haven't had an experience like that, but I wanted to let you know someone has seen this. Hopefully someone will chime in to help! ",
      "MessageIndex": 2,
      "PostDate": "25/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838937",
      "Title": "worried onyxsadomas painterfarmchick"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Nov 3, 2015 10:33PM rwiley4529 wrote: Marijen: My LE is not that bad. At least I don't think it is. For me, actually the worst thing about it is that it is on my left side. That means that I can't wear my wedding ring; either my hand is swollen, or I'm wearing a glove. When it first presented, I didn't think it was LE--I didn't really notice any swelling. What I noticed was a tightening in my forearm and bicep. I was sure it was muscle related, and I mentioned it to my RO on my Wed appt thinking he'd refer me to regular physical therapy. I almost laughed when he mentioned LE right out of the gate; I was sure he was wrong, but I humored him. I saw the LE therapist on Friday, and by then I could see some swelling. On Monday I got fitted for a sleeve, and started wearing it every day. On Sunday night, I was putting some glasses away in the cupboard, and noticed that my arm didn't feel tight or hurt when I did that. And I thought \"hmmm...I guess the RO *did* know what he was talking about. As I understand it, the radiation is to go after any cancer cells that *may* have escaped. In my case, 4 out of the 20 nodes that were removed were cancerous. At my treatment center (and I would guess this is a common practice elsewhere), they have a \"tumor board\". It consists of surgeons, MOs, ROs, pathologists, and I'm not sure who else. So it's not just one person looking at my situation and deciding on a course of treatment, it's a group of people. And there are \"standard protocols\" that they follow.",
      "MessageIndex": 1730,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Nov 5, 2015 08:53PM rwiley4529 wrote: Yesterday I got my first LympheDIVAs glove. It is more comfortable than the Juzo glove; I'm not feeling any discomfort at all in between my fingers, even the place where there's a sore from the Juzo glove. I think I will probably have to add a little padding on the back of my hand to ensure even compression, but it won't be as much as I have to do with the Juzo. And best part of all, it matches my sleeve!",
      "MessageIndex": 1760,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Nov 3, 2015 10:06PM rwiley4529 wrote: Marijen: Your mileage may vary. :-) I had a total of 20 lymph nodes removed. When I had radiation, it was my whole breast, plus they went after the lymph nodes in the clavicle area. *My* theory is that my body was managing \"okay\" for awhile, and then the added load of radiation was just too much for it. I never thought about quitting radiation. My mantra was and continues to be: \"Lymphedema or cancer? I'll take the lymphedema.\" That doesn't mean I like it, just that I will continue to learn to deal/live with it. The LE remained pretty stable from when it started in February until July 4. That is the day I walked a 5k (my first since being treated for breast cancer). My hand swelled up, and I've been dealing with it ever since. The arm has remained pretty stable, but the hand is definitely my problem area.",
      "MessageIndex": 1728,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Nov 3, 2015 11:14PM rwiley4529 wrote: Class 1 for both sleeve and glove.",
      "MessageIndex": 1737,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Feb 27, 2016 01:25PM rwiley4529 wrote: I had a lumpectomy on my left breast in 2014. The tumor was close to my chest wall. My surgeon made the incision around my areola. One and a half years later, it's hard to find the scar. Obviously, because tissue was removed from my breast, it is now smaller than the non-surgical breast. In my case, it's not real noticeable, so I have not opted for any kind of prosthetic, but they are available if you need/want to go that route. My full treatment plan consisted of lumpectomy, chemo, radiation, and Arimidex. I recently met with a plastic surgeon to discuss reconstruction. The plan is to do some fat transfer from my belly to my left breast. Radiation causes the breast tissue to firm up, so he will also do a lift on the non-surgical side. In the plastic surgeon's words \"your right nipple is heading south\".  It took me awhile to think about reconstruction, and there is no right or wrong decision regarding it... only what is right for YOU. Since your cancer is estrogen and progesterone receptor positive, what that means is that those hormones feed the tumor. Your doctor will probably want you to take a medicine that will suppress production of those hormones in your body. There are a few different kinds of meds, with different applications and different side effects. You'll need to discuss all this with your oncologist.",
      "MessageIndex": 2,
      "PostDate": "27/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841704",
      "Title": "Lumptecomy on Friday some questions please advise rosierosie rosierosie"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Nov 3, 2015 08:30PM rwiley4529 wrote: LE started for me about halfway through radiation, and it was only in my arm initially, and I started wearing a sleeve every day. It has since migrated to my hand, so I now I wear a sleeve and a glove. I wear them during the day, but not at night. The glove is a Juzo, and although the seams are flat, I've developed a sore in the area between my ring finger and middle finger. How do I get that to heal without going without my glove?",
      "MessageIndex": 1723,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Nov 3, 2015 11:02PM rwiley4529 wrote: Kicks: Thanks for the info. It is a Juzo, not custom. I think my fitter does a great job, Juzo, not so much. She measured my hand, and chose a glove according to the measurements. I put it on, and within 5 minutes (or less) my fingers were going numb. So we moved to a larger size. The fingers don't go numb, but because it is bigger, it doesn't provide enough compression through the main part of my hand; everything was pooling on the back of my hand between my wrist and the base of my fingers. So the therapist suggested putting a foam pad in the glove, on the back of my hand. That provides an even compression, but the seam is causing a problem. :-( I wear LympheDIVA sleeves, and yesterday I ordered one of their new gloves. I'm really hoping that since it's seamless, it won't cause any sores. In the meantime, I'm trying to get the sore healed up.",
      "MessageIndex": 1733,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "rwiley4529",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202582/profile",
      "Content": "Jan 12, 2016 03:08PM rwiley4529 wrote: First, welcome, breastcancer.org is the best place for information! I don't remember the specifics of grade, I think is has to do with how fast the cancer cells grow/reproduce. But don't quote me on that. ER+ means estrogen receptor positive--that means that estrogen feeds the cancer that you have. PR- means that the cancer you have is *not* fed by progesterone. HER2- that one I don't remember, either. With the ER+, it means that one form of treatment that you will probably have is some kind of med to stop your body from producing estrogen. In my case, I was post-menopausal when I was diagnosed, so I am taking Arimidex. I'm sure others will chime in with more/better information soon!",
      "MessageIndex": 1,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/839886",
      "Title": "Pathology findings Logang Logang"
    }
  ]
}