{
  "AuthorID": "S3K5",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
  "Posts": [
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Apr 30, 2018 02:32PM S3K5 wrote: I was asked by the nurse to use lanolin cream and aquaphor immediately after radiation sessions. These helped me a lot. Talk to your doc first.",
      "MessageIndex": 9,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/722794",
      "Title": "Best oil to protect skin during rads? Drea S3K5"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "May 30, 2008 02:45AM S3K5 wrote: Hi Grandma, I am sorry to read your diagnosis. But with your aggressive chemo, I am sure you'll come out fine (the cancer cells are sure to go away for ever!) I have similar diagnosis except there were only 5 of 10 nodes positive. I will be starting chemo tomorrow (4 cycles of AC every two weeks and then Taxol for 12 weeks) After chemo I'll have radiation too. I had the surgery on April 18th (lumpectomy with axillary node dissection). I am enrolled in a clinical trial for Avastin. Check with your dr about this; This is a drug that has been approved for metastatic breast cancer but not for stage III (hence the trial). This might be helpful to you. Yes, it is hard to stay positive but I try to look at 'light at end of the tunnel'. It has helped me so far.  Good luck, Desi. ",
      "MessageIndex": 18,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/705460",
      "Title": "Newcomer of Breast Cancer at stage III JoyMia7 apple"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Nov 12, 2008 09:00AM S3K5 wrote: Hi Bethany, I noticed you had a different treatment plan than I did. But that is also equally tiring! You are right about the radiation - how can we be MORE tired than the chemo? I guess the worst is behind us! I am trying to regain my muscle strength and stamina. Since I lost all sense of taste, I couldn't eat much. I lost about ten pounds (no regrets about that!) I only hope I don't regain it quickly! I was in the clinical trial with Avastin which has given me sinus problems. So due to this, I don't get enough sleep (which contributes to my fatigue). I like your positive attitude about focusing on feeling better every day! Take care, Desi. ",
      "MessageIndex": 59,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Nov 23, 2008 03:24PM S3K5 wrote: Hi Ladies, Just an update - finished 10 of 33 rads. Okay so far.. TJW, sorry to know you are having such a hard time with rads. May be the fatigue is due to your cold,cough and radiation. I hope the antibiotics work soon. Are you getting blood work done every week? I get a finger test done for CBC and the white cells have dropped a litte after two weeks. I finished the same regimen of chemo as you did, on oct 10th. Started radiation on 10th Nov.  We seem to be on the same schedule for rads. Keep in touch and take care, Desi. ",
      "MessageIndex": 91,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Nov 11, 2008 10:01AM S3K5 wrote: Hi Everyone, I am starting radiation today, so I'll be in the November rads group. I had lumpectomy in April followed by four rounds of dose dense AC+Avastin and then 12 weekly Taxol.Finished chemo in october and moving on to rads. I'll be getting 28 whole breast radiation with 5 boosts (33 total). For skin care, the nurse recommended a lanolin based cream (Lansinoh) - has anyone used this? I haven't come accross this in the discussons. I still have fatigue from the chemo. I hope I can get thru this radiation!! Take care, Desi. ",
      "MessageIndex": 57,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "May 21, 2013 06:54PM S3K5 wrote: Good luck! I hope they don't find anything serious! I know, waiting for the results, going back for more tests can be very stressful. When I was going through this phase, I tried to distract myself and took ambien to sleep at nights. ",
      "MessageIndex": 1,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/805008",
      "Title": "confused and scared annika12 msphil"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "S3K5 wrote: Hello,  I haven't come across this topic on this forum recently - I have a question to all of you who have had radiation six months ago or earlier. Did anyone have rib fractures on radiation side? I had two rib fractures six month ago and they have not healed yet. Latest CT last week showed 2 more fractures. This causes a lot of pain and discomfort, every time I move my arm. Mets have been ruled out by PET/CT and bone scan - all the uptake was only on ribs -at the site of radiation. Any advice about how to deal with this will be appreciated. I am curious to know if this is a common side effect. Desi. S3K5 Chemotherapy 4/15/2008 AC + T (Taxol) Dx 4/19/2013, IDC, 3cm, Stage IV, metastasized to bone/liver, Grade 2, mets, ER+/PR+, HER2- Hormonal Therapy 9/6/2016 Faslodex (fulvestrant) Chemotherapy 10/1/2016 Other Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/747280",
      "Title": "Rib fractures one year after radiation S3K5 chaparrita1"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jun 6, 2008 01:43PM S3K5 wrote: Annie, I am so glad you started this topic. I had my first chemo on 30th May and since two days I have been having severe dry cough. The doctor said that even minor allergies can get worse during the chemo. I have night time cough medicine which helped me for a few hours. Desi. ",
      "MessageIndex": 8,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706676",
      "Title": "Mets during chemo? HeatherBLocklear heatherpalmerton"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "May 4, 2009 08:35AM S3K5 wrote: Hi Enthused, Where are you located? Does your mom have access to a bigger cancer treatment facility? Usually, when a suspicious 'spot' is seen, a biopsy is done. Once it comes out positive for cancer, a MRI is recommended. MRI can detect even smallest spots. Based on this, the patient undergoes either a lumpectomy or a masectomy (depending on the tumor location,grade, etc). One day before the surgery, a dye is injected to locate the nodes (within the breast area). If these come out positive, then the II level of nodes are taken out (under the arm). In my case, I had one biopsy, MRI and then all lymph nodes under the arm were taken out during the same surgery (lumpectomy). Some patients will have to go a second time for lymph node surgery. If you don't get convincing answers, then please change the doctor. They have to explain everything before the procedure is done. I am in the medical field, hence it was easier for me to follow, but then I had a great surgeon too! Good luck with everything, Desi.",
      "MessageIndex": 1,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733605",
      "Title": "Need some help understanding.... enthused stateofgrace33"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jun 13, 2013 09:33AM S3K5 wrote:  Stellaratovsky, I hope your PET scan shows good results. I can totally relate to you - I have been living with pain since March (3.5 months); Had SBRT treatment for mets in cervical spine, which didn't help at all. My oncologist has been changing pain medicines every few days to see what works. I have not tolerated morphine or oxycodine (extreme nausea, sick all the time). So my options are limited. The only medicine that has made my pain tolerable was an anti-inflammatory medicine called Toradol - but I could take it for five days only.  What pain medicines are you on? Please let me know what works for you. Good luck. Desi.",
      "MessageIndex": 17,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806030",
      "Title": "Uncontrolled pain stellaratovsky stellaratovsky"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "May 19, 2017 11:10AM S3K5 wrote: Hi Sarah, I started on Kisqali/Letrozole combination on 1st April and so far it has been okay. For me, Letrozole is the nasty drug! Joint pain and low back pain is getting worse by the day. Now I am taking it on alternate days and hoping to recover from these aches and pains! I have had multiple mets to the spine (Cervical, thoracic area) and so far I have been on Ibrance, Affinitor and Xeloda. Kisqali seems to be the easiest of all! Hope you will post your experience with this new drug. I have started a new sub-forum for Kisqali/Letrozole users under \"Stage IV Metastatic Breast Cancer ONLY\" . S3K5.",
      "MessageIndex": 20,
      "PostDate": "19/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/844929",
      "Title": "Remission - What Worked For Me hawksfansarah LucyAnn68"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jan 22, 2014 07:25PM S3K5 wrote: Australia,sorry to know your pain is back and you have liver progression. Hope your oncologist starts you on a different treatment plan. In the meanwhile, pain meds are our only solace. I have spine mets and the pain was totally in control for the past 9 months (had cyberknife radiation). Now slowly, the pain is coming back. Recent MRI (two months ago) showed everything was 'stable'. I don't know why my pain is coming back. I was wondering if anyone had 'stable' scans and still in pain? Desi",
      "MessageIndex": 9,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/812520",
      "Title": "Pain with mets Hopefaith11 Rose07"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jun 24, 2013 02:39PM S3K5 wrote: Hi Caryn, I have a lymphedema sleeve that I wear during daytime. This definitely helps with the swelling. My doctor and the lymphedema nurse recommended the sleeve during air travel. I don't know if you can get a sleeve at a short notice. Can you buy it at any surgical supply pharmacy? They may ask for a prescription from you doctor. My insurance covers the cost of the sleeve, but it is not too expensive to buy (about $60).  Please feel free to send me a PM. Desi.",
      "MessageIndex": 1,
      "PostDate": "24/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/806652",
      "Title": "Need advice ASAP for flight tomorrow exbrnxgrl hugz4u"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Nov 15, 2013 01:24PM S3K5 wrote: Naturegirl2, I can relate to you regarding constipation. My constipation is due to the pain medications. The pain specialist has advised me to take laxative/stool softener everyday. Rzxcd, my calcium level has never been checked, even though I started Xgeva and Faslodex about six months ago. The MO orders blood test for kidney and liver panel, every other month.  I have to go for the shots today - I'll ask her about the ca levels. Thanks for bring this up - we learn new things every day from this forum discussions! Desi.",
      "MessageIndex": 70,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804931",
      "Title": "Xgeva users - step up naturegirl2 Suesbooby2"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "May 31, 2017 09:12AM S3K5 wrote: I have been managing to work full time in a pharmaceutical company due to my wonderful boss! I am allowed to work from home when I am too tired to drive, have flex hours which definitely makes it easy. Talpha1, I can totally relate to your situation. When I was on Ibrance, the doctor switched me to Faslodex shots and for me, it was more bearable than Letrozole. Is this an option for you to try? I was on short term disability in 2008 when I was undergoing IV chemo. At that time, the health insurance and all other benefits continued. Is this an option for you to explore? Or could you take sick days whenever it seems too much to cope? Hope you find some work-life-health balance. Take a lot of rest when you can! You and all of us need this!",
      "MessageIndex": 22,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/855380",
      "Title": "Is anyone working full time still, after met diagnosis? talpha1 Lumpie"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "S3K5 wrote: Hello, I had partial mastectomy with AND last week and the path report says the posterior margin is positive; 5 out of 10 lymph node positive; Extensive Lymphatic vascular invasion. Future treaments will include chemo,radiation, tamoxifen  My question to the group - has anyone had all these with IDC (stage III)? Does this mean I have a high chance of recurrence? I know everyone is different but I was wondering if this is common. Can chemo and radiation take care of positive margins? Thanks for your support, Desi in NJ Dx 3/21/08; IDC; 3 cm; stage III; 5/10 LN;ER/PR+;Her2 neg; S3K5 Chemotherapy 4/15/2008 AC + T (Taxol) Dx 4/19/2013, IDC, 3cm, Stage IV, metastasized to bone/liver, Grade 2, mets, ER+/PR+, HER2- Hormonal Therapy 9/6/2016 Faslodex (fulvestrant) Chemotherapy 10/1/2016 Other Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704769",
      "Title": "Question about my path report S3K5 SpunkyGirl"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Apr 30, 2008 06:34AM S3K5 wrote: Thnaks for the reply. No, the doc cannot do anything more since she had reached the chest wall. No more tissue left for excision.",
      "MessageIndex": 3,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704769",
      "Title": "Question about my path report S3K5 SpunkyGirl"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "May 5, 2013 06:14PM S3K5 wrote: I feel the same way, Reality. I no longer have patience for small talk! I just want to get it over with and go home!",
      "MessageIndex": 655,
      "PostDate": "05/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Apr 30, 2008 06:58AM S3K5 wrote: I will be seeing the Oncologist on friday. Don't know about the chest wall involvement. The path report doesn't say anything about this. Thanks for the reply. Desi_NJ",
      "MessageIndex": 5,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704769",
      "Title": "Question about my path report S3K5 SpunkyGirl"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Apr 30, 2008 11:04AM S3K5 wrote: Gitane, You are right, I have a lot of questions to ask my oncologist on friday. I lived in southern california (S.CA) before moving to NJ. Right now I am dealing with infection in the surgical site with lots of fluid build up! I am on antibiotics and will be going in to doc's office to get the fluid drained tomorrow. Desi.",
      "MessageIndex": 9,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704769",
      "Title": "Question about my path report S3K5 SpunkyGirl"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Apr 30, 2008 07:18AM S3K5 wrote: Formygirls, I had MRI before the surgery - nothing about the chest wall. I'll ask for the doctor's surgical report tomorrow. Yes, I am Indian- lived in S.CA for more than 12 years! Desi_NJ.",
      "MessageIndex": 7,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704769",
      "Title": "Question about my path report S3K5 SpunkyGirl"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "12 hours ago S3K5 wrote: Who would be a candidate for RFA, or other local procedures for liver mets? My MO has never mentioned any local procedures even though the scans showed 3+ liver mets of which 2 are more than 2 cms in diameter. Has anyone done only systemic therapy and achieved regression in liver mets? I also have multiple bone mets which are being treated by chemo alone (Taxol for now). Hjertemor, your English is perfect! I am sure someone will come by and respond to your question about RFA.",
      "MessageIndex": 11332,
      "PostDate": "04/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jun 5, 2008 10:48AM S3K5 wrote: Hi, Thanks to everyone who responded. I felt a little better yesterday - no nausea or dizziness. Thought I could work for a few hours today. But then I started coughing by evening. By 10 pm I couldn't breathe.. ribs hurt from coughing like crazy.Was up the whole night coughing. Called the doctor today.. seeing him at 1 pm. Hope it is not some kind of infection. I don't know if 'Avastin' is causing these extra side effects (I am on the clinical trial). Any one have any experience with this? Thanks for all the support and 'hope' from you all. I know I can do it... Desi. ",
      "MessageIndex": 731,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jun 4, 2008 11:33AM S3K5 wrote: Hi, I had my first chemo on 30th may (last friday). I don't know if this is normal, but I am having a lot of dizziness (due to the anti-nausea medicines?) Today I am going to avoid all meds and see if it helps. I also have a lot of body ache (may be due to neulasta shot). I don't know how long this is supposed to last! Aleve helps a little. I haven't gone to work since monday! I feel so tired and shaky. Any ideas as to what I can do to get back my energy? Thanks a lot for your support and advice, Desi. ",
      "MessageIndex": 712,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "May 29, 2008 08:59PM S3K5 wrote: Hi I have been reading all the posts about the 'first' experience.It has been very helpful. I will be starting chemo tomorrow (4 cycles of AC- every two weeks). Can someone add me to the 'May 2008' list? Desi. ",
      "MessageIndex": 577,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Apr 12, 2017 10:15PM S3K5 wrote: Hi, it is interesting to see that the oncologists downplay the side effects of the medications! Mine does it too! Painful joints is a side effect of aromasin inhibitors. We feel like we are 90 years old😄  ",
      "MessageIndex": 2,
      "PostDate": "12/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/854159",
      "Title": "Pain related to Letrozole hlaoroo Tess1962"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jul 2, 2013 03:58PM S3K5 wrote: Sarah,  I know it can be frightening when you find a lump, but as others have pointed out, it could be totally benign.  As soon as I was diagnosed, our family doctor advised my daughter to get off the birth control pills (she was taking it for irregular periods). There isn't enough evidence that they cause breast cancer, but with a family history of BC, we didn't want to risk it. I don't know why you are taking the pills, but maybe your doctor can recommend some alternatives? Good luck with the testing - keep us posted. ",
      "MessageIndex": 7,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806986",
      "Title": "20 years old and waiting for tests sarah321 sarah321"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "May 1, 2008 04:10AM S3K5 wrote: Annie, Glad to know such positive news. I will be going to Overlook hospital for treatments. Dx 3/24/08 with stage IIIa IDC; 5/10 positive lymph nodes and ER/PR+. I just had a lumpectomy last week. Will start chemo soon and then Rad. Who was your medical oncologist? Anyone you can recommend? Take care. Desi. ",
      "MessageIndex": 11,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704077",
      "Title": "Still NED Annie62 S3K5"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Apr 6, 2019 10:08AM S3K5 wrote: Hi, This is a great site for information for people facing Chemo and the side effects. I have gone through ACT in 2008 and now I am back with mets in bones and liver. After trying a few oral chemo regimens, I just started weekly Taxol. My oncologist/nurses at MSKCC were very helpful in educating me about dealing with side effects - the most important to me was avoiding complete hair loss and neuropathy. I thought I would add my experience here. MSKCC has a cooling system call PAXMAN from where I ordered the cooling cap and cover. The onco nurse helped me put it on and hooked me up to a cooling machine so I didn't have to change the cap every 20 mins. I am sure there are other cooling scalp methods that you could use instead of Paxman system, which is kind of expensive. By the way, these tips are available on 'Weekly Taxol\" forum too: https://community.breastcancer.org/forum/69/topics/788735?page=356#post_5382385. For hands and feet they provided disposable ice paks over my fingers and toes (put on a pair of disposable gloves to keep them in place). Hopefully this will help minimize nail issues and neuropathy. I will find out if these cooling methods work for me in about 6 weeks. Everyone is different. According to my onco, it works for 50% of women in her care. Please keep this posting bumped up and please add any tips you may find to deal with this monster disease and the treatment side effects ",
      "MessageIndex": 1884,
      "PostDate": "06/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Mar 30, 2009 05:28PM S3K5 wrote: Minnegirl1, I have the same symptoms - I finished radiation treatments on Dec 30,2008. Lot of edema and rib pain on the surgery/radiation side. The oncologist said that it will gradually subside and nothing to worry about. The scar tissue becomes rigid, hence the pain. I am planning on getting scar massage and lymphedema therapy. Hopefully, this should help. Hope you feel better soon. Desi.",
      "MessageIndex": 2,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/731621",
      "Title": "Soreness and Pain after Radiation Minnegirl1 Shirlann"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jun 12, 2013 04:06PM S3K5 wrote: I am sorry to hear this, Marsha. Hope there is another treatment that can help you. Best wishes.",
      "MessageIndex": 7,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806021",
      "Title": "out of options onedayatatime NickyJ"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jun 12, 2008 09:51AM S3K5 wrote: LuAnn, I had sent a message to your email about the name and address to who I should write the check to. Please let me know asap. I would like to pitch in my few $$ for this great cause. You can send me a pm. Thank you. Desi.",
      "MessageIndex": 115,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706936",
      "Title": "helping a sister in need LuAnnH whoopsiedoodles"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jul 2, 2013 05:34PM S3K5 wrote: Judie, I can understand what you are going through - I have painful cervical mets along with some spots in thoracic area.  I hope you get some pain relief with radiation treatments. Praying for your pain free days. Desi.",
      "MessageIndex": 33,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806951",
      "Title": "Delay in Chemo and 20 Rads sessions justjudie pajim"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Jul 29, 2009 01:24PM S3K5 wrote: Hi Karen and Didit, I had a very similar dx as both of you, but only one year earlier. I am done with surgery,chemo and radiation - now on Femara since 6 months. I was also in a clinical trial for Avastin - are you both in this trial? I have heard good prognosis with Avastin. If you are in this trial, then there is one more forum for women in this trial, under \"help me get through the treatment\"; if not, may be you can ask your oncologist about it. I had dose dense AC (every two weeks) and then Taxol and 36 sessions of rads. AC was harder than Taxol. But it went by fast!! I found it was bearable to have flavoured drinks (chilled). The more I drank, the less was my nausea. Ofcourse, sweet things tasted gross!! But.. we survived and so will you.. there are so many meds to deal with the SE's - all you need to do is tell your oncologist. Do keep us posted.. there are lot of ladies here who can advise you... great support group...Good luck with everything.. Desi.",
      "MessageIndex": 46,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737408",
      "Title": "New Comer AsiaYM victoriasecret"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Aug 5, 2009 11:38AM S3K5 wrote: Hi Karen, Glad to know your tumor is shrinking! This is one of the advantages of having chemo before surgery. Atleast you know the chemo is working! I had surgery before chemo - no idea if the chemo worked!! My oncologist just ordered a six month PET/CT and it came out clean - that's a relief! I had positive nodes, hence the fear of distant mets is always there. But for now, I am NED!!! Did you have a MRI or any other scan before chemo, to see if there are any nodes involved? I am curious as to how the oncologist would stage a person who has undergone neoadjuvant chemo....did you ask your oncologist about this? Take care, Desi.",
      "MessageIndex": 52,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737408",
      "Title": "New Comer AsiaYM victoriasecret"
    },
    {
      "AuthorID": "S3K5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66276/profile",
      "Content": "Aug 5, 2009 11:29AM S3K5 wrote: Hi Di Di, I am taking Femara because I am ER+/PR+ .Femara is an anti-hormone tab, to reduce the amount of hormones our body makes,  thus preventing recurrence. Some women go on other AI's and Tamoxifen. These do the same thing. Avastin is a blockbuster drug made by Genentech. This has been FDA approved for a lot of stage IV cancers, with good results. Now the trial is to see if it benefits earlier stage cancers (like stage I-III breast cancer). Your oncologist may have more information regarding this trial. Avastin is not a small molecule drug like other chemo drugs - it is protein based and given along with either AC or Taxol. Hope this helps. Glad to know you are doing well on AC. I had surgery before chemo and rads. Good luck, Desi.",
      "MessageIndex": 51,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737408",
      "Title": "New Comer AsiaYM victoriasecret"
    }
  ]
}