{
  "AuthorID": "SAAdvocate",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270623/profile",
  "Posts": [
    {
      "AuthorID": "SAAdvocate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270623/profile",
      "Content": "Mar 12, 2018 12:44PM SAAdvocate wrote: Welp, here I am. My co-workers would likely feel that this won't help me maintain a positive outlook, but sometimes you just need to connect with people that really do \"get it.\" I've been having yearly mammograms since I was 25, as my mom had a very aggressive breast cancer when she was 40 and the doctors recommended early screenings for her daughters. Well, a couple weeks ago my screening mammo found some calcifications. I had a diagnostic mammo done a few days later and the doctor recommended we do biopsies - given how the calcifcations presented and the family history. I had the biopsies done last Wednesday (wow! That was anxiety inducing) and Friday I got my results. I have ADH.. and will be referred to a surgeon at our local Breast Center. I'm trying to focus on the fact that it's not cancer. But it's hard knowing it's *so close* to cancer. My mom actually had ADH years before cancer showed up. I'm just a little freaked out, and thought it might be beneficial to get connected to people who understand my fears.",
      "MessageIndex": 913,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "SAAdvocate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270623/profile",
      "Content": "Mar 15, 2018 02:55PM SAAdvocate wrote: How common is it after the needle biopsy showing only ADH that the larger surgical excision shows DCIS? I have my surgery consult on Monday...",
      "MessageIndex": 927,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "SAAdvocate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270623/profile",
      "Content": "Mar 12, 2018 01:33PM SAAdvocate wrote: Thank you Carolyn! You're right, I'm sure everyone has the best of intentions, but sometimes you don't need people to be overly sunny and optimistic. Sometimes you just need people to acknowledge that it sucks. Part of me is like, \"sweet, we caught things early now we can 'do better' in life and try to reduce risk\" and the other part of me feels such resignation to such a high likelihood that I'll develop cancer. It's an odd feeling, being stuck between the two.",
      "MessageIndex": 915,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "SAAdvocate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270623/profile",
      "Content": "Apr 16, 2018 03:53PM SAAdvocate wrote: Incision site is doing much better. Emotionally still not back to normal yet. The results of the excisional biopsy were good -- good enough all considered. ADH will clear margins. So nothing more serious than what they found in the needle biopsy. I've been having a bit of bloody-ish discharge from the nipple though. Thinking maybe it's just from the duct being cut?? Anyone have similar experience?",
      "MessageIndex": 950,
      "PostDate": "16/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "SAAdvocate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270623/profile",
      "Content": "Mar 29, 2018 02:05PM SAAdvocate wrote: Just had my excisional biopsy done on Tuesday. A little concerned about the surgical site as my breast is super swollen, red, and hot. I'm not running a fever, and it doesn't seem to be seeping at all. The pain meds are making me super cranky. I just wish this would stop. I've been so checked out emotionally, that I'm not sure where all my stress and fear is going, but it certainly isn't be processed.",
      "MessageIndex": 938,
      "PostDate": "29/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    }
  ]
}