{
  "AuthorID": "Sabrina46",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252777/profile",
  "Posts": [
    {
      "AuthorID": "Sabrina46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252777/profile",
      "Content": "May 25, 2017 03:55PM Sabrina46 wrote: MtWoman...thank you but I am dreading this. Here at work not sure what will be in that mailbox when I reach home. You are really kind to respond and I already know the been there and done that so you totally understand. As I said you all are very strong, and I as well. The supv in mammo told me by Friday. So I am trying to wait and shut up! Also , I meant to say earlier I am sorry about your experience and joyful a soul like yours is still here to talk about it and help other folks👏😇",
      "MessageIndex": 28,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853058",
      "Title": "Too scared to function.... Panacea2112 ---faithhopelove---"
    },
    {
      "AuthorID": "Sabrina46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252777/profile",
      "Content": "May 25, 2017 10:47PM Sabrina46 wrote: MtWOman you are totally well informed and so reassuring. I was looking at folks in a similar situation as mine....and you could not be any clearer on your belief in distraction! Mailbox was empty, and yes I may call tomorrow. Dental Appt in morning, and gym after. So strange to worry about such a thing I have absolutely no control over! But I am worried. Bad or good results for me, take some load off. At least I will know. I am unmarried and most of my family is passed. Alone as I am, I faced these fears as best I could over the years. Same time this thing has taken too many women I know. I see that you read the fear of people so much, knowing that if you have breasts and some hx it is something we must do our best to face! Again thank you for responding and no matter what happens, I will be checking in!",
      "MessageIndex": 29,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853058",
      "Title": "Too scared to function.... Panacea2112 ---faithhopelove---"
    },
    {
      "AuthorID": "Sabrina46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252777/profile",
      "Content": "May 23, 2017 10:27PM Sabrina46 wrote: Hello, I am new to this site but following for years....all the time scared myself. Really had to sign up and let it be known that every story rips at me but also shows the strength and love in all of you. I cry inside when I see how the worry from family dogs at you. I have had abnormal mammos for years, but bodybuilding always kept the worry at bay till reasons show up again . I am 46 with hx of lumpy breasts and the latest report was asymmetries with no mass or calcification 😶....what now...what in the world is that? Fatty areas are being looked at it and I am now literally sickened from confusion! Negative for the gene but mom had breast ca...keep thinking why all the issues every mammogram and sono! Waiting for results. Tests were done Friday...breast compression mammogram and sono. I am embarrassed to say I have told no one of my worry....except you all. Really need to get head on straight. Ca is horrible, but women in here are truly superwomen and help me realize ish happens and must be dealt with! Thank you ladies for being you. ",
      "MessageIndex": 24,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853058",
      "Title": "Too scared to function.... Panacea2112 ---faithhopelove---"
    },
    {
      "AuthorID": "Sabrina46",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252777/profile",
      "Content": "May 25, 2017 11:19AM Sabrina46 wrote: MT Woman ....thank you so much for your response! I am truly grateful. Dread that mailbox after long day of work. Awful feeling and how bout at the same time these worries burden you, all kinds of other weird things happening. Rash on the breast, and tingling too. Lol! I am like what next? Wayment....you don't want to know what is next Lol! Feel awful for saying I have death traps sitting on my chest! Thank you again for listening and I will keep talking😳....Big hug👏😇",
      "MessageIndex": 26,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853058",
      "Title": "Too scared to function.... Panacea2112 ---faithhopelove---"
    }
  ]
}