{
  "AuthorID": "Sago",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183564/profile",
  "Posts": [
    {
      "AuthorID": "Sago",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183564/profile",
      "Content": "Jul 30, 2013 08:58PM Sago wrote: I'm not sure if this has been asked before and apologies if it has - my mother was recently diagnosed with breast cancer, and when doing her staging tests her abdominal CT scans showed activity that was 'compatible with metastasis' (as quoted on the report) on her hips The doctors recommended doing chemo and radiotherapy right after her breast mastectomy on her hip, without doing any further biopsies beforehand. They are saying that surgery will be needed to do further testing because the location is too deep for a needle. Has anyone had a similar situation like this - going straight into treatment without confirming that it is indeed bone mets ? I know the doctors have a lot of experience and can probably tell what is what by looking at the scans, but there's just a small part of me hoping 'what if that part is actually benign?', and wondering exactly why they mean when they say 'compatible' - does that mean maybe or definite? Sorry for all the questions, still taking baby steps in learning everything Thanks & many hugs :)",
      "MessageIndex": 1623,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Sago",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183564/profile",
      "Content": "Sago wrote: hello, I’m the daughter of a stage IV fighter, mom recently changed medication to aromasin and is currently undergoing radiotherapy for new spots on her spine (four new spots on the most recent scan - argh!). I’ve recently noticed that she seems more tired, sleeping a lot. She’s also complained about some hip and back pain (from the mets maybe ?) and sometimes feels nauseous. She’s also been burping a lot - but it sounds more like a deep gurgling sound to me. Not sure if these are side effects from her new treatments, have any ladies here experienced anything similar? The burping and fatigue worries me most since it could symptoms of liver mets, or that she is reaching the end of her fight. Scans 2 months ago show mets to other organs but i will mention it to her onc. next week. Oh and she also developed a low grade fever today, hopefully it’s just something she caught from me /visiting the hospital everyday for her treatments. Sorry for the semi rant- but I do feel better now after getting this all out !! Dx 7/2013, Right, Stage IV, metastasized to bone, 3/10 nodes, ER+/PR+, HER2- Radiation Therapy 10/30/2017 Bone Hormonal Therapy Aromasin (exemestane) Hormonal Therapy Femara (letrozole) Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy Balloon-catheter: Breast, Bone Chemotherapy Other Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/860013",
      "Title": "Aromasin & radiotherapy Sago Sago"
    },
    {
      "AuthorID": "Sago",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183564/profile",
      "Content": "Nov 12, 2017 05:09AM Sago wrote: Thank you Kayrnic and HLB for sharing your experiences, Makes me a little less worried! All the best for your treatments!",
      "MessageIndex": 3,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/860013",
      "Title": "Aromasin & radiotherapy Sago Sago"
    },
    {
      "AuthorID": "Sago",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183564/profile",
      "Content": "Sago wrote: I rarely make posts here (I'm a lurker) but I always find myself here when I'm at my saddest, when that tunnel feels long and never-ending. Reading through everyone's positive posts and advice is always so uplifting. So I felt that I should give back by posting some good news :) Posting on my mom's behalf - she was diagnosed stage IV from the get go, and last month reached her 5 year milestone! We had a few blessed years of NED, then her cancer went a bit crazy and new spots showed up along her spines, and more continued to show despite changing meds and radiotherapy. Thankfully her current treatment is working. We just got her blood work back showing reduced cancer markers, and chest xrays / stomach ultrasound to check for other organs came back clear as well! No bone scans till later this year so fingers crossed! 5 years ago I would've never imagined that I would be making a happy post such as this - and now I hope to make more happy posts year after year! Dx 7/2013, Right, Stage IV, metastasized to bone, 3/10 nodes, ER+/PR+, HER2- Radiation Therapy 10/30/2017 Bone Hormonal Therapy Aromasin (exemestane) Hormonal Therapy Femara (letrozole) Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy Balloon-catheter: Breast, Bone Chemotherapy Other Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866336",
      "Title": "5 years! Sago RonnieKay"
    }
  ]
}