{
  "AuthorID": "Saighin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260492/profile",
  "Posts": [{
    "AuthorID": "Saighin",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260492/profile",
    "Content": "Saighin wrote: Core biopsies on two masses this past Tuesday, they told me today that they'd hopefully know tomorrow. The waiting is absolutely the worst part right now. Funny enough, the lump I found that sent me in is most likely a perfectly innocuous fibroadenoma...but in getting that checked out, the diagnostic mammogram a week ago detected a nearby highly concerning non-palpable amorphous cluster of microcalcifications, and _that_ accompanying lesion picked up on ultrasound was, well, considerably less than confidence-inspiring. In my case, having seen my ultrasound, I know there's only a slim chance mine is benign (among other things, ill-defined margins that show marked spiculation then \"blur\" as it descends deeper into the tissue, hypervascularization...and, well, watching the expressions change on the faces of the radiologist & his tech spoke about a thousand words). While what's showing appears to be very small, imaging of the second mass is birads 5. I guess, while I'm not trying to be pessimistic, I've somewhat already come to terms with a high likelihood of bad news. The part driving me crazy is waiting to know how bad. It is still _possible_ that it's benign. But if it's not, I'm hopeful that if it is malignant, we've likely caught it early? But I'm a planner & I'm going completely out of my mind not knowing yet what comes next. Difficult time focusing at work & almost impossible time focusing on school (already tanked an exam from lack of ability to focus). I just want my pathology results to come back, even if they suck, just to know what happens next instead of waiting for the shoe to drop. Not really looking for advice, I guess, just...really needed to vent to people who have been there. So thank you for listening. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "29/09/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858999",
    "Title": "Right now, waiting is the hardest part... Saighin robbiesgurl"
  }]
}