{
  "AuthorID": "sailorgirl1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84137/profile",
  "Posts": [
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84137/profile",
      "Content": "Aug 9, 2009 01:29PM sailorgirl1 wrote: Hi Swimangel72 - Just wanted you to know I'm hopeful our drain output remains low and you can have them removed!  I think you'll be fine.  Make sure you get plenty of rest and fluids between now and then to make sure you get ultimate healing.  I know this is exceptionally hard with packing for vaca.  but you need to put yourself first too.  I made the mistake of overdoing it the day I had my drain removed and was in bed the whole next day!  Just make sure to pace yourself and you'll be fine. It's so hard for us to put some of this on the shelf so we can let go and enjoy other things in life. But, when we can the experience is even more rewarding. Good luck!!",
      "MessageIndex": 8,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Feb 11, 2016 03:38PM sailorgirl15 wrote: Lindy - I have 6 left out of 28 (and then 7 boosts) and I have taste issues too. I kept thinking the nausea feeling and bad taste and inability to really enjoy food was a SE from chemo but then I was reading another board and the ladies were saying they had taste and nausea issues which they realized are from rads! My RO asks if I've had nausea but only seems concerned about whether I've thrown up - I haven't but feel like I could a lot of the time! I am going to ask more tomorrow and be more insistent about what elseI can do. I'm so glad that others are experiencing this (well, I don't wish it on anyone but at least I know I'm not crazy and it most probably is the rads not a SE from chemo!) Re: skin issues - My RO recommends coconut oil which I've been using as well as Bag Balm and aquifor, etc. My chest is getting really red and tight. Thanks everyone for your posts - I have been catching up with all the info and news. I will start taking my Ativan again to help with the way my stomach feels! Good idea I learned from your posts.",
      "MessageIndex": 1227,
      "PostDate": "11/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Feb 13, 2016 07:40PM sailorgirl15 wrote: I wish I could respond to individual post with a like or a comment just to that person. I get lost as I scroll down and can't remember who said what! Suz-Q I agree!",
      "MessageIndex": 1304,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Jan 11, 2016 03:14AM - edited Jan 11, 2016 05:04AM by sailorgirl15 Hello everyone! I am 11 days PFC and had my first rad set up appt last Monday. I start rads on Tuesday, Jan 12th.Thanks for setting up this group Mary! All your posts are so helpful as were the Sept chemo ladies' posts. Great to have lots of real time help and advice.",
      "MessageIndex": 507,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Jun 2, 2015 09:50AM sailorgirl15 wrote: I still cannot believe I am discussing breast cancer either. I retired last week from teaching and found out I have breast cancer! I am so mad! Yes, I am worried and sick about it but it makes me angry too! It has to be early because I have had mammo's every year, but they biopsied a lymph node and it was positive, so I already am stressing about that. I will let you know what I find out and hang in there - Nancy2581 makes it seem doable.",
      "MessageIndex": 11,
      "PostDate": "02/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832186",
      "Title": "Just diagnosed with IDC, age 61. Nance1953 Nance1953"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Feb 12, 2016 10:21AM sailorgirl15 wrote: Hi Ladies, Just back from today's rads. I saw the RO and was very specific about my stomach issues, the pit in my throat I sometimes feel when I swallow, and not being able to eat. The nurse asks the same questions as she does each week. Today I got more aggressive with my answers. N-Do you have pain? Me - a little N - On a scale of 1 - 10 how bad is it? Me - I show her my red sore chest. \"It hurts and it bothers me. I have a very high pain tolerance. I birthed my three babies without ANY pain meds and my 2 boys were 9 lbs! So for me the pain is about a 4 but for many it might be an 8.\" N - any nausea? Me - yes. I feel nausea a lot. My stomach feels crummy and I am burping a lot. N - Have you thrown up? Me - NO, but I am not someone who throws up. I feel like I could throw up but I do not. I have hardly ever thrown up. I still feel nauseated. I have burped a lot and a few times and thrown up in my throat. I am 6 weeks past last chemo and I thought this was from that but my stomach is feeling worse and it seems to hit a few hours after rad treatment. I am not as bad on the weekend and actually better by Sunday. I have a pretty iron stomach...so this is really discouraging. She trots off and in come RO. RO- I hear you are having some problems. YESSSSSSSS! Guess what!! He said that all these symptoms are from the rads!!! Since I am having whole breast treatment stray rads are hitting my stomach and esophagus and that is what is causing this. THANK GOD! I AM NOT CRAZY!! So, bottom line, he went to get his physicist who listened to my symptoms. (She was about 28 years old - I guess she is really smart!!) She agreed that these SE's are from the rads and she will re-write the program to avoid more of my stomach and esophagus. Meanwhile, I will do the 7 boosts which are just to the small area where they did the lumpectomy. This is less intense and will give my chest skin and my stomach a chance to recover. They were going to do the boosts at the end, but this keeps me on schedule and I will still finish on the 29th. I did take the Ativan this morning and he thought that was a good thing to do. It seems to be helping. I am not really that fatigued and I teach half time, so it has not really affected my life - just my eating!! I have lost about 11 lbs which is a good thing but I would like to be able to enjoy my food and eat more than 3 bites without feeling sick!! Bottom line - be aggressive with reporting your symptoms. Do not feel like a wimp. It is all very scary and really makes me upset to think my stomach and esophagus were getting zapped even though he said they wrote the program to avoid my lungs and heart...guess I didn't ask about the stomach and throat!! UGH!!! I only have 5 more whole breast (and whatever else the strays are hitting left). Hang in there ladies. I hope you are all doing good! Looking forward to the weekend!!!  ",
      "MessageIndex": 1249,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Mar 1, 2016 02:17PM sailorgirl15 wrote: Lovely ladies - hang in there! My last (of 35) rads is tomorrow!! Woohoo! I am so ready to be done with this. I will say that if you have an issue, make sure you complain loudly! I was feeling nausea 6 weeks after chemo and well into rads and I finally made a big stink about it and they admitted that with whole breast rads it can hit the stomach and esophagus!!!! So, they rewrote the program and I did the 7 boosts to get a break. I felt better! Then I went back to the last 5 whole breast and the nausea came back!! So, when they say it's not from rads, I'd be skeptical. I never threw up but my stomach was always upset. I have an iron stomach and high pain tolerance, so when I felt lousy for several weeks, I decided to make that known! I lost about 12 pounds, which is a lot when you are post menopausal! My chest/shoulder blade area also was burnt and hurt like hell. I used all the creams I could and the candula cream (which is in miaderm) helped. One thing that I used was coconut oil - my RO swore by it. He also finally prescribed a steroid cream for the itching, which is in full force as the burnt skin heals. You are all amazing and it will soon be over!! Hugs to all! I will be celebrating tomorrow night!! I plan on taking a spring break vacationweek and will not start the arimidex until I get back! Now, if only my hair would start growing faster!",
      "MessageIndex": 1747,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Dec 9, 2015 05:49PM sailorgirl15 wrote: Hello! Please add me to your group. I finish chemo (two more to go!) and have my sim and scan Jan 4th. Will start soon after that. Here's to a better 2016 for all of us!",
      "MessageIndex": 178,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Jan 13, 2016 02:20AM sailorgirl15 wrote: Yay Shopgal! Hope you are all ready to go!",
      "MessageIndex": 550,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Jun 2, 2015 08:09AM sailorgirl15 wrote: Hi, I am also 61 and just got diagnosed with IDC. I meet with the surgeon tomorrow so I will know more. I sure hope it is stress because I have some of that kind of thing going on. I also feel like I got punched in the stomach!! I am glad that I found this forum and will have many more questions tomorrow.",
      "MessageIndex": 6,
      "PostDate": "02/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832186",
      "Title": "Just diagnosed with IDC, age 61. Nance1953 Nance1953"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216412/profile",
      "Content": "Feb 16, 2016 01:37AM sailorgirl15 wrote: It seems we are all being told to just hydrate. I sure wish there was something that helped the skin heal! Marijen - if your nausea does not subside make a stink about it! I see you are having whole breast - my RO finally listened and is rewriting the code because he said the nausea was definitely from stray rads hitting my stomach (and in my case, esophagus!). I was glad I got aggressive about reporting my SE's but it took me 4 weeks!!! Do not wait that long!! It is a SE and he said it should not be happening! We all hate to complain or make a stink and think we can handle this, but this is a time to get selfish and take the initiative to speak up. All my RO says to use is coconut oil and aquaphor. I keep searching for something else but it all just hydrates. The cabbage leaves help! My chest/shoulder area is bad. I'd post a picture but I don't want to upset anyone! It stings now and then....ugh! The other insult to injury is that this weekend, 6 weeks after last Taxol, I lost all eyebrows and most lashes. I'm a mess....no hair regrowth and now no brows or lashes and a burnt chest! I keep waiting to start the climb out of this abyss....it's gotta be soon! Hang in there ladies!! You are all my lifeline!",
      "MessageIndex": 1340,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "sailorgirl1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84137/profile",
      "Content": "Aug 9, 2009 01:37PM sailorgirl1 wrote: I am a master's student and had my stereotactic biopsy done mid-day and went to a 3-hour class that afternoon then drove an hour and a half home.  My only restictions were the no bathing thing, I think.  The used dermabond (??) or some other sort of glue on the area that was biopsied.  That worked really well.  I too had a good sized hematoma which showed up on my MRI about a week later.  I had very little pain and it was not a big deal.  You should be okay but just listen to your body.  I wouldn't work out with weights for several days.  Talk to the radiologist to see what they suggest. Good luck!  I know biopsies can cause a lot of anxiety, particularly waiting for the results. We've all been there",
      "MessageIndex": 5,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738671",
      "Title": "Activity after Stereotactic biopsy pmb0602 pkb143"
    }
  ]
}