{
  "AuthorID": "Salamandra",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
  "Posts": [
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 3, 2019 02:33PM Salamandra wrote: I finished! It was a lovely day. Clear weather for my bike ride. I was in a great mood and chatted with people, exchanged numbers with one lady I'd spoken with a couple of times previously, rang the bell, traded a thank-you Pokemon to the receptionist who plays, took myself for pizza after, biked home, took a nap, and now eating nutella. I'd been very stingy on the steroid creams and lotions through the boosts because I needed to preserve the weak-ass vegetable dye marking, but I bought a big tub of the cream I fell in love in with (Cerave healing ointment, fragrance and lanolin free, vaseline-based with hyalauronic acids and ceramides) and have been slathering it on. I'm trying to start psyching myself up for returning to work soon, and I'm glad I still have some time off before then. The fatigue has been shocking and enduring. Tomorrow, it's my cat's turn to go to the doctor! hahaha!! (just an annual, she is fine). I just need to find her carrier. I'm sure it's around somewhere...",
      "MessageIndex": 10,
      "PostDate": "03/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 4, 2019 09:05AM Salamandra wrote: My doctors office prescribed mometasone steroid cream to me, that I used daily and up to twice a day. I think it helped a lot. I didn't ask for it, it just came standard. Then they said to use any cream that was fragrance free and lanolin free. I found Cerave ointment, which is so nice and creamy and I love it and I'll probably keep buying it for general use. My skin turned red practically right away and stayed red. It felt very warm to hot throughout the whole time. Towards the end it started feeling heavier and a bit harder too. The nipple turned a bit darker and got more sensitive. My breast got a bit uncomfortable though never painful. I found the \"radiadres\" gel pads they gave me really nice, seemed to cool things off, draw out the heat or something (though it was terrible at sticking). For me the feeling was less like a headache and sort of more like a cut that's starting to scar and heal, how that can get all hot and sensitive. Anything I wore left lines/markes on me and it was much nicer without a bra. But it never got worse than that, my skin never broke or anything. I freaked out a bit because the redness and fatigue came on so fast and hard, but it stayed pretty constant. ",
      "MessageIndex": 19,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 10, 2019 05:54AM Salamandra wrote: Hey HPFULL, I felt like I had a shockingly hard time getting a doctors note for rads. None of the oncologists seemed interested. My guess is that if I had pushed, they would have done what I wanted. But I ended up getting a note from the psychiatrist at the center at that was fine. A lot of women do work through rads, but I don't think it's a little deal at all. To be honest, if it were men getting this treatment on their secondary sex characteristics, I doubt people would be so nonchalant about sending us to work! That said, for some women, they barely have any side effects, and/or have pretty comfortable jobs, and/or find a lot of psychological value in going to work every day, and/or financially really need to work. So much respect and more power to them! I have a pretty physically and emotionally demanding job where going braless would be unadvisable (teaching high school). On a pure time basis I could have handled the logistics but I think it would have destroyed my emotional health and probably future capacity to do the job, at least for a while. I also started getting the fatigue and skin sensitivity side effects after the second day of treatment. Don't let anyone push you into what's 'no big deal' or not! Lots of people want to minimize everything to do with this stuff because it makes them feel psychologically more comfortable. For me, taking time off work made a world a difference to my quality of life and mental/emotional health. If YOU feel like you would benefit from time off, trust yourself. I argued with myself for weeks. Was I just being a slacker? etc etc. Screw that. If I can't be a slacker about goddamn breast cancer what can I be a slacker about? What break has my years of responsible adult-ing and hard work and conscientious care taking of myself and others earned me, if not to take this time off? So I'd say, listen to your gut. Be ready to pressure your doctors (if I'd have had to fight, I would have recruited my brother or another male friend to pressure the male radiation oncologist, or made another appointment and brought the paperwork to his female resident, whom I liked so much), and make sure you check and make sure that your health insurance coverage will not be impacted by your leave.",
      "MessageIndex": 55,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 16, 2019 03:41AM Salamandra wrote: Aww DeeDee, that sucks. I'm two weeks out now and have these painful areas of irritation/blistering under my breast. I forgot to get more bacitracin for it. Ugh. But I'm back to work so wearing a bra over a chemise. The fatigue is still there. I wish I could have taken more time. I wish people took radiation more seriously as a treatment. I get that for some people it's very mild but not for all of us! And not all jobs are the same either. I wish I'd had the option of stickers instead of tattoos! I never had any tattoos and no plans for them and I don't love that now I've got these permanent dots on skin that I otherwise really liked (clear, etc). I didn't find them painful at all, really, it was such quick pokes. I don't know. I'm going to just live with it for now but I read that some people get them colored over in their skin color, and I'm thinking of that. Also wondering whether removal is possible for such tiny things. Or who knows, maybe get them enlarged into some kind of designs. I have four of them.",
      "MessageIndex": 117,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 17, 2019 04:08AM Salamandra wrote: Dani444, Thank you!! Great find, and they are in my city! It looks like I need a note from my RO and then just contact the practitioners directly. The return to work has been HARD. People have been so nice but my energy is just not there. The first day started off great but at noon I hit a wall. By Wednesday I needed to take a car service to work. Today... well let's just say I'm eating dinner for breakfast and hoping that it actually gives me energy to make it through. It feels like a long day and there's no great place for me to just sit quietly and recharge during my prep periods, and I need to use them to plan anyway since by the end of the day my brain is more or less useless. I'm determined to make it through tomorrow and then at least we have a 3 day weekend and then a week of testing with much lighter duties. But oh it was so tempting to call out today! Also at least three different people, when I mentioned how tired I was and how I'd have to recover and rebuild my stamina, compared it to coming back after summer break. NO, NO it's NOT like that. I didn't really mind, cause they're trying to connect, except when it came from my supervisor...",
      "MessageIndex": 135,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 18, 2019 04:47PM Salamandra wrote: Yay DeeDee!! I got the blistering a couple of days after my last treatment. My doc said to use bacitracin and I had bacitracin zinc so I just used that. But I used it up and bought regular bacitracin and it seems to help so much better. So... guess I shoulda clarified! DeeDee might that be a possibility for you? I hope you won't need it though. I made it through the first work week!!!!!!!!! Thank goodness it was the final week of the term - today was barely a real day at all. But still. HUGE RELIEF. Last night, I had a 'cold flash', I think from the tamoxifen. I was taking a super hot shower. I swear I could not for the life of me remember whether I had already soaped or not. In such a tired blur! Sending and support to all!",
      "MessageIndex": 157,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 25, 2019 03:19AM Salamandra wrote: TC73, congrats!! OTMom and Parhessia, thank you for helping me think it through a little deeper. I actually did the drugs for egg freezing as well, a couple of years ago. Before my diagnosis - when I knew I was getting older, really thought I wanted children but wouldn't be able to afford it for a while and was still hoping to find a partner. I had a low dose but I cycled through many times (because of low AMH levels, it took me so many extractions just to get a lower than recommended number of eggs). I have wondered if that contributed. My oncologist seemed dismissive of that idea, though I don't remember if it was more like a 'probably not' or more like a 'we don't really know and it doesn't matter at this stage anyway'. Ironically I still haven't found a partner, now I'll be on tamoxifen for years and a pregnancy would be even higher risk, and I'm more on the fence about having children than ever. Still paying for the egg storage for eggs that I don't even if if they'll work or not even if I decide I want them. Sign...",
      "MessageIndex": 222,
      "PostDate": "25/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 4, 2019 05:29AM Salamandra wrote: Thank you!! OTMom, I am not a parent, but I also felt overwhelmed at the idea of handling treatment and work. (I'm a teacher, so a very 'on' job that requires a lot of planning and work after hours too). I really wanted to work through because I haven't been in the system that long and don't have that much paid leave, and really liked the idea of preserving it. But it was really messing with my mind to try to work. The two or so weeks I went back after surgery before taking off again were an ordeal. Now I'm really nervous about going back. And I have to remind myself that I really liked my job before all of this started! Trying to force myself to work through was a mistake. Mental/emotional health is health too, and I think that this diagnosis does have a large mental/emotional component that I feel gets really neglected by most doctors. I'm really lucky that I was able to (after multiple tries and advocacy) see a psychiatrist through the cancer center who was willing to write me a note for work when both the surgeon's office and the radiator's office were being very cagey about the whole thing. Like it would mess up their stats or something. That said, I know that plenty of women have worked through radiation, and you may not be in the position of having a choice at all. Try to take good care of yourself and don't feel like you have to pretend that everything is ok or 'act like normal', which is advice I got from a lot of well meaning people. That's just gas-lighting yourself and adds extra stress, in my unhumble opinion :) Good luck!! Where in the country are you?",
      "MessageIndex": 13,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 6, 2019 12:36PM Salamandra wrote: Thank you thank you! ",
      "MessageIndex": 34,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 10, 2019 07:46AM Salamandra wrote: Hey Heather, I totally think you'll be able to keep working out, especially if you can be flexible about timing. (Eg., if you're exhausted in the morning, being able to go in the evening instead). The one caveat I'd say is that by basically the third day I did NOT want to wear a bra any more, and my skin got more and more sensitive to any pressure against it. If you have, or can find, a really soft work out top that still holds you in enough to do the exercise you want, that might make all the difference.",
      "MessageIndex": 59,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 8, 2019 08:34AM Salamandra wrote: Kerlyn, that is so sweet about your daughter! Carebearzz, I'm sorry you're having so much pain! That really sucks :( I just wanted to say that lanolin (and fragrance) was one of the things that my radiation oncologist office said to make sure was NOT in cream, and that matches with what is in the MSK radiation treatment guide. I have no idea why or whether other treatment center would agree, and but maybe just run it by your MDs just in case it's important? As for me - I'm on my 5th day after my last treatment. And I'm SO TIRED still. I have dreams about being tired, dreams about falling asleep, dreams about being asleep. AGH. I really hoped I'd start bouncing back quicker and be able to make better use of this week of recovery. I'm supposed to go back to work on Monday and I really hope I'll be a lot less tired by then.",
      "MessageIndex": 44,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 27, 2019 10:09AM Salamandra wrote: Thank you so much for the info!! I feel a lot better now. I will try to be conscientious about stretching it for a while.",
      "MessageIndex": 240,
      "PostDate": "27/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 24, 2019 01:14PM Salamandra wrote: DeeDee that sucks! And don't feel bad about sharing, that's what we are here for. Plus it'll be more helpful for anyone else who comes along with something similar. I wonder if you could bug your cancer team to refer you to a dermatologist who might be able to work with you to find something that will help your skin and pain without aggravating your allergies? Parrhesia (love the name), I'm glad you're off to a good start! That was a really interesting summary. Because... our tumors could be twins. I also had 1.3cm and grade two and I'm 38. BUT my biopsy did not test for k67 and I got no number for that. When my margins and nodes came back clear, my doc sent the oncotype. They all seemed completely unsurprised that it came back low (9), said it was all concordant with my pathology, and never mentioned chemo again. If my lab *had* tested for k67, who knows how things could have happened differently? I had not heard of a 'light chemo' before. I wonder where are you located/getting treated? I'm thinking about asking my MO about it at the next appointment. I feel a little unsettled now. LPLibraryGirl, I was thinking about the teacher thing. Actually, I doubt that it's that we get more cancer. My guess would be that we're more attracted to text-based forums like this, and also more likely to have decent health insurance (though I realize that's changing in some states...) to catch it at an earlier stage and get this kind of treatment. God I wish I were retired. My job is stressing me out now. It's not always easy to remember that I like teaching. Just now I kind of wish I had some kind of desk job where the temperature is predictable and I can go to the bathroom whenever I want.",
      "MessageIndex": 216,
      "PostDate": "24/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 26, 2019 04:38PM Salamandra wrote: Hey all, I started feeling some sort of muscle tightness in my cancer-side elbow and upper arm. The numbness/nerviness is still a little there from the lumpectomy, but this felt new. I reached up for something and was like, 'whoah.' I finished radiation almost 3 weeks ago now. Could it be related? Is this possible LE, or am I just freaking myself out and should take some advil and stretch it? AGH.",
      "MessageIndex": 233,
      "PostDate": "26/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 29, 2018 03:48PM Salamandra wrote: Thanks for posting this egregious! Also I've been meaning to tell you I love your user name and I wonder if there's a good story behind it? I'm continuing on from December. January 3rd should be my last day of treatment. Soooo close. For people starting - I'll say that one thing that surprised me is that I'd read that for a lot of people the fatigue and redness don't really kick in until part or even most of the way through. I got both very red and very fatigued by the middle of my third day of treatment. I freaked out a bit that it was a bad sign. But in the end it didn't get worse, so it was just annoying. So basically, don't panic if the symptoms hit you sooner, it doesn't necessarily mean they'll hit you harder.",
      "MessageIndex": 1,
      "PostDate": "29/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 13, 2019 04:50PM Salamandra wrote: I'm 39 and I did the hypo fractionated. I had 16+4 days boost. The radiation oncologist didn't offer any other options. This is at Sloan Kettering and they have a good reputation and seem to be very by the book, so I'm kind of surprised to hear it's officially only for older women, at least in the states. I started side effects FAST (fatigue and redness from day 2.5) but they didn't get worse than they started off, so it wasn't too bad. Except now that it's done I have some little burns in a very annoying spot on the underside of my breast. Heading back to work tomorrow. EEEEEK.",
      "MessageIndex": 94,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 18, 2019 04:29AM - edited Jan 18, 2019 04:35AM by Salamandra Thank you so much for the support. It's so heartening! Yesterday was the first day I felt like myself at the end of the school day, though I still came home and basically crashed. Today it's taken me a full hour and a half to slowly get myself ready for work, that's without showering or make up and I haven't brushed my teeth yet. But it should be an easy day because grades are in already and I'm psyching myself up. (ETA I have NO idea how you all with children are managing. HUGE respect). Now I'm thinking about how the vegetable dye for the boosts washed off my skin so fast and the radiation gel patches barely stuck at all. Maybe my skin is bad at sticking and I'd have ended up with tattoos no matter what. That thought does make me feel a little better. Has anyone seen my get-up-and-go? I swear I left it around here somewhere! 😛 ",
      "MessageIndex": 146,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 22, 2019 03:27AM Salamandra wrote: Welcome/hi to all! MissCommunication (love the name) - I got blisters after the end of treatment and my RO told me to use bacitracin. I started with bacitracin zinc, but actually plain bacitracin worked much better. He said if the skin broke then he would recommend something else. My hospital recommended against creams that have lanolin, which Aquaphor does, though I know a lot of medical teams recommend it. I got Cerave ointment, though that's petroleum based. It's rich and creamy and I love it. I also got the Dove Dermaseries Body Lotion. You might like that. It's fragrance free and lanolin free and not petroleum based. It's not quite as creamy as the petroleum based creams but maybe that's better for you. I love how it feels and will probably keep buying it after. Reporting that my first week back to work after radiation was HARD but I MADE IT, and was able to DO THREE things on a Saturday when I didn't even have to do a single one, so I think the fatigue is starting to lift. It's still there, but so much better. My breast is still off a bit in color and sensitive (still wearing the bra over a camisole) but much better too, and the blistering is all healing up now.",
      "MessageIndex": 181,
      "PostDate": "22/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 14, 2018 03:06PM Salamandra wrote: It sent me for a loop too. I feel like the breast surgeon was all about the positive results, and then the less positive info come trickling in after. As far as I can tell, my 15 year survival rate is %85-91, depending on treatment. That really threw me. 15 years just isn't that long (even without a spouse and kids). But what I'm trying to focus on is that my 5 year survival rate is actually really high. And who knows what kind of new technology we'll have within 5 years! Let alone within 15, and further down the line. That thought comforts me as much as the thought that actually 85% is a lot more likely than not that I'll be fine.",
      "MessageIndex": 7,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/866769",
      "Title": "Initial Meeting with Oncologist Lilac17 Wised"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 28, 2019 12:37AM Salamandra wrote: Hey jrjr3, Aging and hormonal changes and random chance can all cause changes in your breasts. It's protocol to follow up, and it's good your imaging center did that. Sometimes the follow up mammogram and ultrasound alone can rule out cancer, sometimes they may need to send you for a biopsy. That's because cancer cannot be confirmed by imaging. So don't panic if they send you for a biopsy either. On the other hand, almost all breast cancer diagnosed by routine screening mammograms (as yours would be if it does turn out to be cancer) is early stage cancer - very treatable with excellent short term and good long term prognosis. That said, the waiting sucks. Hang in there!",
      "MessageIndex": 3,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871753",
      "Title": "Waiting for Diagnostic Mammogram and Ultrasound jrjr_3 Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 26, 2019 07:32AM Salamandra wrote: Congrats on making it through the biopsy! Next Tuesday afternoon may feel like forever, but you will get there. I think it's great that you are getting the follow up results at an appointment. If it's not cancer, he'll be able to give you advice as to next steps if it's something that needs dealing with. If it is, he should be able to at least give you some context about it. I had to wait until my surgical oncology appointment for someone to definitively tell me that everything about it screamed early stage, and I wanted to cry with relief. Big pats on the back to you for handling this! Keep us posted and sending supportive thoughts! I found semi-mindless phone games very helpful :)",
      "MessageIndex": 3,
      "PostDate": "26/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869522",
      "Title": "Nervous for core biopsy in the morning Dee930 Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 9, 2019 05:53PM Salamandra wrote: Thank you JoyTx! FaceForward, that is such a sweet story. I have to say, there have been moments of beautiful human connection and support.  Wouldn't you think SHE was the one tuckered out from radiation and recovery!",
      "MessageIndex": 53,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 30, 2019 02:04PM Salamandra wrote: Hey suzyshacklechick, Even when all other indications about a tumor are favorable, it's still possible for the oncotype test to come back saying it is a high risk tumor, genetically speaking. It's unlikely but possible. In that situation, a doctor who would otherwise have avoided chemo might recommend it. Different doctors have different standards for when they even order the test. If you know that no matter how it came back, you'd not want chemo, and you'd rather not know, I think it's fair to trust that. It's really great that medicaid is covering it, though.",
      "MessageIndex": 258,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869066",
      "Title": "Radiation January 2019 egregious egregious"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 25, 2019 03:13AM Salamandra wrote: Dee930, Of course you're nervous! It's a nerve wracking thing. In fact, going through this process is so nerve wracking that for years, doctors wouldn't even send young women for mammograms/biopsies, because the chance of cancer is so low that they thought the negative experience of further imaging wasn't worth the stress. DUMB. Because although it's very rare, it's super important to catch it early when it happens, and because women can handle it. You can handle it, you will handle it, you *are* handling it. There is a thread here called \"Interpreting your report\" where one of the members who is a radiologist very generously will help us understand our reports. But unless you have questions about yours that your doctor didn't answer, in your position, with the biopsy so soon, I'm not sure that will really be helpful. The point of a biopsy is that they can't definitively rule cancer either in or out with the ultrasound alone. If you can, try not to read too much into the doctor's face. You never know what's going on in someone's head. Maybe he just remembered he forgot to sign his kid's permission slip form or something. Or someone talked to him recently about being more empathetic to patients and he thinks that means putting on a concerned face that he hasn't finely tuned enough yet. Waiting for results SUCKS and it always will suck. Do what you can to get through to the other end. I will say that it sounds like chances are this is nothing concerning and you have a good medical team for being so prudent, and if it is cancer, chances are it early and very treatable (most cancer found based on a lump alone are still early stage) and you will find the strength the get through (and the boards will help). Hang in there!",
      "MessageIndex": 1,
      "PostDate": "25/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869522",
      "Title": "Nervous for core biopsy in the morning Dee930 Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 20, 2018 11:58AM Salamandra wrote: I'm so sorry. This really sucks. I too lost my mother to breast cancer when I was pretty young (20). I will say, try not to borrow trouble or spend too much time thinking about how you will or won't deal later. That is for future you to worry about. Present you has enough on her hands. Take care of yourself, be supportive of your mom, spend the time with her you can, and deal with each thing at its time. None of us knows the future. Hopefully she will live a long time yet.",
      "MessageIndex": 3,
      "PostDate": "20/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868938",
      "Title": "Mom just got diagnosed with Breast cancer. Jenniferstrong Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 21, 2019 03:16PM Salamandra wrote: I posted on Facebook the night before my biopsy. I was feeling scared. I'm single and independent, and I knew my friends would be a great source of comfort and support for me. I got an outpouring of kindness on that post. When I got the malignant results about two weeks later, I texted my father, my siblings and my two closest friends. I also commented on the FB post to let others know. For me, I can't imagine going through this in a secretive way. It would have have added a ton of stress for me. On the other hand, for other women, it's the opposite way around. Being private with the information is much less stressful for them. You should do whatever feels right to you. The only thing to be careful with, I think, is speaking with children or teenagers (if you have them). I don't think that means waiting until a particular time, necessarily (depending on their age too) but just in how you frame it and the emotional tenor of your conversations with them. You can't trust the size too much on the imaging, you only get an idea from the mammography/biopsy/MRI. 6ish centimeters would be considered large. If it is cancer, then depending on the profile of the tumor (which the biopsy will give you information about), you are more likely to be recommended chemotherapy before surgery to shrink it. Depending on the size of your breasts, the area/location of the cancer, and how much it shrinks, it's possible you'll be recommended a mastectomy instead of a lumpectomy. But all of that is things you'll have to discuss with your oncologists, after they get the information from the biopsy. The enlarged lymph node could be cancer or not. Either way, they will probably check more of your lymph nodes for cancer to get an idea of whether they should treat your lymph nodes for cancer too (either remove them or radiate them). In general, a larger tumor and lymph node involvement would indicate a higher (though still likely early) stage than a smaller tumor without lymph node involvement. But so very much depends on the characteristics of the tumor (determined initially by biopsy and sometimes revised after surgery) and what they find when they biopsy your lymph nodes. Whatever the biopsy reveals, they have so many different treatments and approaches. The important thing will be to find an oncology team that you have confidence in. Now would be a great time to start doing legwork to getting your file to an NCI Cancer Center for either your first or second opinion. It's usually some phone calls and paperwork to make sure they get everything they need. Call them first, they'll likely have an intake number listed, and they'll tell you what to do. It might also be a good time to research your work medical accommodation options and your health insurance coverage. Now is also a really good time to be very kind to yourself, cut yourself as many breaks as you can, lean on friends and family for whatever support feels right to you, and distract yourself when necessary by any means that works for you. I mean, now is probably not the time to take up smoking for stress relief, but if Oreos every day helps you get through, or dumb but addictive phone games, or binge watching reality tv, do it and don't feel guilty. How did the ultrasound go? They told me right after my ultrasound (which was right after my diagnostic mammogram) that I should schedule a biopsy. They didn't tell me and I didn't know to ask that my mammogram/ultrasound rating was Birads 5. That means that they believe it *is* cancer, but they need to biopsy it to be sure. (Even Birads 5 has false positives). I had no inkling how serious it was, and I really didn't get spooked until the night before my biopsy. In retrospect, I think ignorance might have been bliss. On the other hand, I wish that I'd had someone to tell me after my biopsy that my malignant results didn't mean I should start planning my funeral. I was too scared to look on anything on the internet. It was my first meeting with an oncologist that really calmed my mind. It is so good you have found BCO. This is a great place for information and support. You can also send your family or friends here to read and research either to help you or to help them understand how to be supportive of you, or what's going on with you without needing to ask you questions you don't necessarily want to deal with. If it is cancer, you will be opening a whole new book of learning. Tons of new vocabulary and acronyms. It's not really possible to know it all at once. Trust that you'll learn what you need when you need it. Some people are into becoming experts on it as fast as they can, other people would rather just ask their doctors what they feel they need to know. Both ways are fine. We each have to do this our own way. Sending you",
      "MessageIndex": 4,
      "PostDate": "21/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870491",
      "Title": "Confused Sfllr Elephant"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 4, 2019 09:04AM Salamandra wrote: I asked my radiology fellow about this when I was trying to decide whether to go through with radiation - I had read that if they radiate an area once, they can't do it again, and I was concerned about sentencing myself to a mastectomy in case of a local recurrence. For a whole bunch of very good reasons, I followed through with the radiation, which is excellent and well-proven treatment to prevent recurrence. But it did help that she told me that no, mastectomy after lumpectomy is not a guarantee. She said that it had been the convention of care for a while, but it is not because of the radiation. The dose they give the breast is far lower than the lifetime maximum, so they *can* generally radiate again. She told me that more and more, doctors are offering second or even third lumpectomies, with general success. She said that of course it depends on the exact nature of the recurrence and the history of the patient. She said that cosmetic impact had also often been a concern, but [some] doctors are now willing to be more open to the idea that some women might prefer asymmetrical breasts/differently shaped breasts to completely losing her breasts. I don't know really anything at all about your new diagnosis. I had pretty bog standard IDC with about 4cm of DCIS. But based on that conversation it seems to me that if your doctor can't give you a compelling understanding of why he would prefer a mastectomy (and he may be able to!) then it would be worthwhile seeking a second opinion.",
      "MessageIndex": 5,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/870159",
      "Title": "Is mastectomy always the option after lumpectomy? tovahsmom Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 11, 2019 03:08AM Salamandra wrote: Motheroftwo, That makes me furious! 'more excuses than a woman' - that is pure misogyny. UGH There may not be much your husband can do about it but he should write down what he remembers of the interaction, with the date noted and as many 'quotes' as he can be confident of remembering. It may some day be useful - either to protect himself from retaliation or to support a coworker who sues for discrimination.",
      "MessageIndex": 14,
      "PostDate": "11/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869779",
      "Title": "Age 32 and Large mass in right breast Motheroftwo36 Marymc86"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 30, 2019 02:11AM Salamandra wrote: Hey Jenni, First, that's (relatively) great news! And it's still scary! That is totally normal, especially while you are still waiting on test results. Second, you will be able to deal with the financial aspects of this. Hopefully your insurance covers more than you expect, but either way, there is a lot of financial aid available for women with breast cancer. This Susan J. Komen page is not a bad place to start. You can also talk to your medical center billing office and/or social worker. There is help for covering copays, groceries, rent, transportation, etc. You will not ruin your family. A lot of the financial aid will require paperwork, and watching rolling deadlines. If that kind of organization is not your forte, it is a great thing to ask a helpful friend or family to support you on. The hospital/cancer center will do surgery first and bill you after. You will not be denied surgery over a copay. Sending hugs and support! You can and will get through this, even if it's a horrendous hassle.",
      "MessageIndex": 22,
      "PostDate": "30/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871533",
      "Title": "It has been a LONG week so far... jenni0102 moth"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 26, 2019 05:26AM Salamandra wrote: Hi jean2100, I had a friend I really wanted to be there with me but who couldn't be there in person. My doctors have been fine with me calling her in on FaceTime/Skype etc. I wonder if that could work as a way for you to join your mom? Hopefully your mom is right, and this is either benign or early stage cancer. But it's completely understandable that you're spooked by what happened to your cousin. Hoping for the best for her! ",
      "MessageIndex": 3,
      "PostDate": "26/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871719",
      "Title": "Referred to surgeon after ultrasound jean2100 Mymomsgirl"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 28, 2018 09:28AM Salamandra wrote: I'm not sure why but my experience has also been that doctors have a really hard time explaining radiation. The evidence for radiation significantly reducing local recurrence is very strong. The evidence is also consistent that this makes a real life saving impact for at least a subset of women. But you know, I suspect that the medicine doesn't fully understand how/why radiation works? We have almost a century of evidence that it does, but it's all experimental. I was very interested why it seems so important to do radiation right after surgery. Surgery is kind of arbitrary, right? It doesn't have to do with the age of the cancer, just when you happen to discover it. The doctor couldn't really explain. But there are studies that show that delaying more than a certain account increases recurrences. It's kind of unsatisfying. On the other hand, experimental data is the best data right?",
      "MessageIndex": 8,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868572",
      "Title": "Radiation confusion Dreamer54540 viewfinder"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 30, 2018 07:09AM Salamandra wrote: yarn, that's super frustrating. Especially when you know they'd be yelling at you if you were the one cancelling/missing the appointments. It does seem like missing appointments has an impact: Missed Radiation Therapy Sessions Increase Risk of Cancer Recurrence. Can you ask them to schedule you somewhere else for treatment or get an urgent second opinion? It feels like they are skating on thin ice with this broken machine thing and jeopardizing your treatment. I'd be really pissed.",
      "MessageIndex": 14,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868572",
      "Title": "Radiation confusion Dreamer54540 viewfinder"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 8, 2018 10:59AM Salamandra wrote: That's good news! How did your ER/PR/Her turn out? I went to get a flu shot today and one of the questions on the questionnaire was \"do you have cancer\". I already had my lumpectomy. I answered, \"I don't know.\" I mean, they think probably there's still microscopic stuff in there, right, which is why they're recommending radiation & maybe chemo. But they don't know, do they? And I don't know. How strange is that...",
      "MessageIndex": 10,
      "PostDate": "08/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868170",
      "Title": "Waiting for MRI and other tests...dark thoughts! Wigging2000 Wigging2000"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 9, 2018 09:48AM Salamandra wrote: I know exactly what you mean about the puzzle. And then the more I learn, the more questions I know how to ask. The pharmacist didn't say anything about the question! Given the pharmacy, I think there's a reasonable chance she didn't look at it... I know that next Friday I meet my radiation oncologist and my medical oncologist for the first time. That's all I know! Also by then I should have the oncotype test back, so there should be at least an idea of whether I'll get a chemo recommendation. Now I've been thinking about the actual differences in mortality achieved by radiation and chemo and hormonal therapy. I really hope the medical oncologist I've been assigned has the time and willingness to talk this all through with me. The genetics test you're waiting for is BRCA?",
      "MessageIndex": 12,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868170",
      "Title": "Waiting for MRI and other tests...dark thoughts! Wigging2000 Wigging2000"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 18, 2018 01:31PM Salamandra wrote: Robyn, I cried too. It is big news and a big shift. Nothing wrong with crying. I'm glad your meeting with the surgeon is so soon. I found it a big relief. What's calamitous to me was ever so run of the mill to her. I am still struggling emotionally. In some ways I'm doing much better, in other ways I'm doing worse. However you are feeling is just fine. ",
      "MessageIndex": 20,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868400",
      "Title": "Anxioy and overwhelmed Love83 msphil"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 17, 2018 01:44PM Salamandra wrote: I think that getting that initial DX is such a blow and feels so unlikely and unlucky that it's hard to believe that anything will turn out lucky after that. I know at every step on my way to diagnosis, all I heard was, 'it's probably fine, most lumps are nothing.' 'It's probably fine, most biopsies are negative,' etc etc. And of course for me, each one was not. So how am I supposed to respond to the breast surgeon saying, 'it's probably fine, I don't feel anything in your lymph nodes'? But of course it's a whole new ball game, and actually, my breast surgeon was right. Of course there are times when they are not, and they know it too and rarely make promises, but like claireinaz said, they've seen a lot and aren't basing the reassurance on hope and statistics only, but on their experience and examination of you. But the fear is real and terrible and normal. Do what you need to do to get yourself through the days! At the beginning, I threw myself into work and tried to lose myself. Eventually got on lexapro to help with the anxiety. Now that I have my diagnosis and treatment plan, the work thing isn't 'working' any more and that's become a big source of stress. So I'll be taking some time off even though physically I probably could keep working - mental health is health too. Take care and keep posting and sharing if it's helping!",
      "MessageIndex": 9,
      "PostDate": "17/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868400",
      "Title": "Anxioy and overwhelmed Love83 msphil"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 10, 2019 10:59AM Salamandra wrote: This is my lay understanding, I hope it helps and that someone corrects anything that's off. Generally, the doctors assume that if you're not having symptoms elsewhere, then the cancer they are treating is only in your breast. Especially if it has not spread at least as far as the lymph nodes. Basically, you're in a position that the doctors do not suspect active metastatic cancer, and are not looking for it. That's a good thing! They trust that most likely they have identified all the cancer to be treated, and that they will be able to pick up based on future symptoms if there is cause to look for metastasis in the future, and that there is nothing different they could/would do for you medically right this second even if scans did pick up something. On the other hand, the breast MRI could lead to them doing something differently *now*, so they are doing it now. For example, they might recommend a mastectomy or a double mastectomy, instead of a lumpectomy or single one; they might do a lumpectomy for a larger area; they might do a biopsy of a different area while they are in there anyway; they might be more suspicious of lymph nodes; etc. Medical understanding of the metastasis process is changing, so now doctors think that it's actually possible that certain cancer cells *do* leave the breast early and find hiding spots in other parts of the body where they can lie dormant for years or forever. Right now, we don't have great ways of finding those cells, and no special ways of neutralizing them even if they were found. That is a pretty active area of research that I hope they will make progress on. One of the things they think that ongoing hormonal treatment, like tamoxifen for ER+ cancer, does, is to help keep dormant cells anywhere in the body dormant. I agree with Bella2013. One of the hardest things of wrapping my head around this whole cancer thing is that it is actually a long process. I wanted to deal with everything at once and get it over with, but it's not like that. You are constantly waiting. Waiting for the mammogram, waiting for the biopsy, waiting for the pathology, waiting for the surgery, waiting for the results, waiting for the oncotype, waiting for the appointment, waiting for the scan, etc. And it all feels so incredibly urgent to US, but most of it, most of the time, is not that medically urgent. So now, it's not considered medically urgent at all to have a full body scan for possible metastasis, because the overwhelming likelihood is that it's not there, and there will be plenty of time to scan later if and when it's indicated and could have an impact on treatment. I'm sorry about your diagnosis, and I'm glad you're on the Boards. Hang in there! It's a SLOG.",
      "MessageIndex": 2,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/869269",
      "Title": "just diagnosed MRI tomorrow Toyamjj bella2013"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 16, 2019 08:29AM Salamandra wrote: Hi Joy239, As you can see, my diagnosis turned out to be malignant. I didn't know (or even know to ask at the time), but my mammogram and US had both been Birads 5, so if I'd been a little more educated, I'd have seen it coming. I do feel like I'm reaching a new equilibrium. I'm done with the active treatment now and adjusting to side effects from the anti-hormonals. It's a pain in the butt, but doable. Overall, my actual experience with cancer so far is so much better and so much easier than the intense fear I felt at the beginning.",
      "MessageIndex": 25,
      "PostDate": "16/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870042",
      "Title": "New to all this Trishmariep Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 13, 2019 04:03AM Salamandra wrote: That's so great Trishmariep!",
      "MessageIndex": 17,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870042",
      "Title": "New to all this Trishmariep Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Apr 7, 2019 06:06AM Salamandra wrote: Hi Isabellasharon, I'm so sorry you have to deal with this. Try not to jump ahead! Back pain and rib pain can be caused by SO many things. Cancer discovered via scheduled scanning is unlikely to be stage IV. IF the biopsy comes back malignant (with 5 there's a good chance it will but it may not), and IF the doctors think there's a chance that it's spread, then they'll order yet more scans, and you'll have to wait for those results to know for sure. No matter what, you have more waiting ahead for you. The waiting is excruciating and terrible. We are here for you. Do whatever you need to get through the days, including asking for pharmaceutical help from your doctor if you are open to it. No matter what the results, and there is an excellent chance they will be much less dire than our fears naturally go to, you will feel better when you *know* and have a plan.  ",
      "MessageIndex": 29,
      "PostDate": "07/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870042",
      "Title": "New to all this Trishmariep Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 28, 2018 11:34AM Salamandra wrote: That is a great post djmammo than you for linking. I'll second that for me, pharmaceutical intervention plus bicycling for transportation made/makes a huge difference. Since it sounds like there's an element of this anxiety that's chronic for you, I strongly recommend having mental health team - therapist+psychiatrist - that you trust and like and have confidence in",
      "MessageIndex": 7,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868479",
      "Title": "Found Two Lumps cruzer57 cruzer57"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 18, 2018 01:52PM Salamandra wrote: Aw, Lauralee, the waiting is so hard. I don't know if this context will help, but just in case. I think the background is that too many doctors would completely poo-poo young women's breast concerns because of how rare breast cancer is for them. The plus side is that young women didn't have to go through these scary weeks that you are going through. The downside is that while breast cancer is young women is very rare, it can happen and when it does, it makes a big difference to catch it early. Some good doctors have started actually treating these issues more seriously. It sounds like you have a good doctor who is being prudent with your health. But it's *still* extremely unlikely that it's cancer.",
      "MessageIndex": 2,
      "PostDate": "18/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868898",
      "Title": "Core biopsy tommorow so scared 😬 LauraLea27 CrisL"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 19, 2019 07:48AM Salamandra wrote: If you haven't had genetic testing, that seems like a really good thing to do now.",
      "MessageIndex": 3,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869424",
      "Title": "Should I get a second opinion? B055W0man B055W0man"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 8, 2019 05:11AM - edited Feb 8, 2019 05:13AM by Salamandra I'm younger than you and had what sounds like a larger tumor than you and I went for a lumpectomy. The oncologists strongly recommended it. Some of their points were: the survival/disease-free rates are just as good or better than mastectomy; more women report better quality of life after a lumpectomy; more surgical procedures (e.g. if you have reconstruction) each carry their own set of small and larger risks. Some other factors that pushed me in that direction was thinking that if I was going to have a recurrence, I'd much rather have it in my breast than in my chest wall. Which is more or less where you get recurrences with a mastectomy. Also, my surgeon was on board with doing more intense screening if I wanted it (and hopefully insurance covers it) - so every six months I'd have either an MRI or a mammogram. That would maximize the chance that a recurrence would be caught early enough that it would just be a hassle but not be life threatening. Finally, the MRI my surgeon had me do before the surgery did not show any other incipient areas of concern - sometimes they could reveal something in the other breast that could be DCIS, or more potential areas of concern within the affected breast - that often tips women towards MX/BMX. Also, I realized that I was feeling really sad about not having my breasts any more. I also think that a person's financial/insurance situation can play in. For example, if someone has good health insurance now but is concerned they won't have it down the line, I can see how a BMX could be a prudent move. That said, I think every woman has a different relationship with her health, her breasts, etc. There is no objectively right or wrong decision, only a well informed and thoughtful decision.",
      "MessageIndex": 2,
      "PostDate": "08/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869749",
      "Title": "Just diagnosed Buzzandmax Mncteach"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 7, 2019 06:41PM Salamandra wrote: Good news! And good information to have about your body. Hopefully knowing that will help you and your doctors take good care of you in the future.",
      "MessageIndex": 3,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870174",
      "Title": "I found a mass and I'm scared ocicat2 Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 20, 2018 07:30AM Salamandra wrote: Hiya! Do you feel like you have strong confidence in your oncology team? Are you in a position to get a second opinion? That could help with the process. It seems to me that this new article from February about the spread of breast cancer calls into question the universal usefulness of axillary nod dissection. In your position, it's something I'd want to at least ask my doctors about and see if they had a thoughtful answer. I know more about IDC, since that's my diagnosis. With 1c, which I think means it hasn't spread to lymph nodes, lumpectomy+radiation seems to have not only equivalent but actually ever-so-slightly better outcomes to mastectomy. Again, not a professional and no personal experience with ILC. So take it for what it's worth. I think I'd definitely want a sentinel node biopsy (only takes a couple of lymph nodes) to verify whether the cancer has spread out of the breast at all, before committing to a mastectomy, and I'd be wary of the axillary dissection in either case. Also, as far as I know, mastectomy is always an option later. Like, they do a lumpectomy and then a bit down the line you realize you'd have preferred a mastectomy, or they find something that indicates it. You can go back and do it. If you're far enough out from the cancer, you may even be able to do the mastectomy and reconstruction all in one shot, instead of months of wait in between, which I think could be easier on an emotional level and maybe on a physical one too. Definitely something to at least speak with your doctors about. Good luck! Keep us posted.",
      "MessageIndex": 1,
      "PostDate": "20/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868442",
      "Title": "Diagnosed Bilateral R:ILC+DCIS, L:IDC+DCIS GattinaBella GattinaBella"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 1, 2019 03:57AM Salamandra wrote: At my treatment center (MSK), the Sentinel Node Biopsy - where they remove some nodes and do pathology on them - was presented as a standard part of the care even though I didn't show any physical symptoms of lymph node involvement and my doctor suspected there was none (and pathology eventually proved her right). They do it just in case. For me it has definitely been the hardest part of the surgery in terms of recovery, pain, etc. In retrospect... if I had to do it over again, I might think twice about it. I would probably go through with it again because I think I would have a harder time knowing that there was some potentially pertinent information I didn't have and that my prognosis was not based on as much information as it could have been. But I would have considered more carefully. Almost 5 months later, I still have numbness in my right arm, still have some fluid/mis-shapenness around the scar, still have some discomfort. I'm pretty sure none of it is LE, but I will still be asking my doc about it on follow up. I've read on here about a woman who opted against the SNB. From what I recall, she had to go back and forth with her docs on it a bit, but they have to respect it and eventually they were willing to things her way. But yes, everything you've written sounds extremely correct standard of care. (I had a radioactive seed put in the day before).",
      "MessageIndex": 3,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870093",
      "Title": "My lumpectomy plan Karmic108 Karmic108"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 23, 2018 04:55PM Salamandra wrote: It is very encouraging that everything says non-suspicious and normal appearing! I think there is an excellent chance this really is nothing. That said, you are completely justified to be concerned! This is your health. In your shoes, I think I would want to really understand what the doctor thinks these lumps are, if not cancer, what he expects to happen or not happen after 6 months that would give a hint in one direction or another, the potential adverse consequences of waiting - if it turns out to have been cancer, and what next steps you could take now to rule out cancer. In my experience, it can be aggravatingly difficult to find a doctor who will take a woman's questions, and especially a young woman's questions, seriously. If you have a doctor who does, that is wonderful! go to them and keep asking until you feel like you understand and can make an informed decision about your healthcare (i.e., whether to put it on wait and watch mode, investigate further now, do genetic testing for possible cancer-related mutations, etc). If your doctor isn't taking your concerns seriously, don't take it personally. It's not you, it's them. Look for another doctor or be the squeaky wheel until they engage with you, whichever you think has a better chance of working. When you feel like you've got enough information and understanding to make a decision, make the best decision you can and make the best of it. That's all any of us can do. No matter which way you go now, there will be more nerve-wracking waiting (whether it's for the next 6 month ultrasound, or for the genetic test results, or the biopsy results, etc). It's hard to live with it for anybody, check out so many of the threads on this board. But all you can do is be your own best advocate and take care of yourself as well as you can (and can chat here or to your support system when you need some extra help)!",
      "MessageIndex": 1,
      "PostDate": "23/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868487",
      "Title": "Worried J96 JaKris24"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 13, 2018 08:08PM Salamandra wrote: Perez, I am so so sorry about your mother. It is terrible to lose that bond and support. I have found solidarity and help from the Motherless Daughters books and Facebook group. Hang in there.",
      "MessageIndex": 21,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868140",
      "Title": "Path Report, Just diagnosed, Metastic Carcinoma in Lymph Node emilyisme CaliKelly"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 30, 2019 02:47AM Salamandra wrote: Agreed on the second opinion. Many doctors are too quick to tell women to live in pain. Even if they are sure it's not cancer, they owe it to you to actually diagnose and treat you for whatever it is.",
      "MessageIndex": 3,
      "PostDate": "30/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871812",
      "Title": "abnormal cells - worried KarenV djmammo"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 22, 2018 10:43PM Salamandra wrote: All the time between tests and waiting for appointments... and now you have this question to chew on that could be completely moot! I wonder whether you could arrange for a second opinion to coincide with the mammaprint results? You could always cancel if the mammaprint comes out high. But if it's intermediate, maybe it could be useful to have a second opinion? Or maybe in that case get the oncotype, either from your doc or second opinion doctor",
      "MessageIndex": 6,
      "PostDate": "22/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868422",
      "Title": "Mammaprint - should I believe a low score LillianGish LillianGish"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Apr 19, 2019 06:16PM Salamandra wrote: I think it can happen that Birads 5 comes back benign, but they would not expect it too. I'm sorry. It's hard news to receive. It sounds like it was caught early and hopefully will be as smooth a road forward for you as possible!",
      "MessageIndex": 1,
      "PostDate": "19/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/871118",
      "Title": "I got a bad feeling about this.. DogMomRunner DogMomRunner"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 14, 2019 03:01AM Salamandra wrote: My thoughts would be to get a second opinion from someone who has a lot of experience with patients your mother's age. Maybe a third opinion even. I'd also want to know about the option of prophylactic radiation to the axillary nodes, which I believe has been shown to be comparable in efficacy to dissection. I would want to ask about options for conservative treatment plans. Get the tumor out, check the genomic characteristics (oncotype). If it's aggressive, re-visit, but if it's low risk, consider that the whole picture (small HR+ tumor in a woman 80+) is likely to be not aggressive, and go with that. TBH, I might even want to revisit the mastectomy part. Lumpectomy is much less invasive and lower recovery time than a mastectomy, and unless it's in an unusual location or there are other complicating factors, lumpectomy should be an option. Second opinion from an NCI-designated facility! Worth the time and trouble.",
      "MessageIndex": 1,
      "PostDate": "14/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871514",
      "Title": "if sentinal node cant be found-? HereToHelpMyMom HereToHelpMyMom"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 13, 2019 02:53AM Salamandra wrote: Hey Alice, I would feel differently if the OP hadn't included language about praying in her topic line. Once she does that, I think that other believers can fairly infer that writing about praying would be welcome or comforting to her. It always jars me a little when I see it, and in a thread where the OP didn't mention it I think it *would* be rude of posters to assume it was welcome. But in a thread like this where the focus is the anxiety of the poster and they have made clear that prayer is a comforting framework for them... I figure maybe I'm not the best one to rpovide advice/comfort, but I'm happy that other people are. Also this is a birad4 situation where there is a strong possibility it will be benign in any case, and it will be one of the many hundreds of threads like this that come and go without majorly impacting the life/culture of the site. At least, that's my impression.",
      "MessageIndex": 15,
      "PostDate": "13/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/871492",
      "Title": "I am concerned but praying the best mml123 JO-5"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 14, 2019 02:28PM Salamandra wrote: Best of luck!",
      "MessageIndex": 3,
      "PostDate": "14/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871514",
      "Title": "if sentinal node cant be found-? HereToHelpMyMom HereToHelpMyMom"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 11, 2019 04:20AM Salamandra wrote: Hey Gardentool, You've earned your anger. We are all entitled to doctors who give us information but respect our own decision-making processes. I'm so sorry you're dealing with this. There is a 'forum' here especially for people with Stage IV (early stagers not permitted to post in most threads), I bet you could find some good commiseration and support there. Not to chase you away from here! Just in case it might be more meaningful for you to be in conversation with other people who can really empathize. ",
      "MessageIndex": 11,
      "PostDate": "11/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870271",
      "Title": "New here April0315 April0315"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Apr 20, 2019 04:39AM Salamandra wrote: You're in that weird time where you know something is going on but you don't know what. It's incredibly stressful. Don't worry about under or over reacting now, whatever reaction you are having, that's the reaction you're having. I'll just say - ",
      "MessageIndex": 2,
      "PostDate": "20/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871114",
      "Title": "46 year old freaking out G1973 G1973"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 26, 2019 05:55AM Salamandra wrote: Hi Bethar, It is very hard to be without your mom at a time like this. I also went through it without my mother, and single no children. (Though I lost my mother much younger and was more used to going through things without her). I'm guessing that your experience of this is compounded by your very fresh grief, and maybe shock if it was a sudden stroke. That makes it so hard. Do you have any family or friends you could go stay with for a couple of days, or who could come stay with you? It might feel better just to not be alone. If you don't have a therapist, now would be a great time to set one up. Losing one's mother is a BFD. From the cancer perspective, I'll say that my story started out a lot like yours, and for me it did turn out to be cancer. That doesn't mean it will for you! But it also turned out to be early stage cancer, which yours most likely would as well. It's treatable and I've done the active treatment and now I'm struggling with the side effects of the hormonal treatment. It's annoying as hell but it's not doom and gloom. I have many friends with one kind of chronic illness or another, and now I have my own version of it too. On the mother front, I'll say that especially in the beginning, I used to light a candle that smelled good and write letters to my mother in a journal I bought for that purpose and sob. Mostly they were just sad and repetitive, but they helped me feel the feelings and I needed to. When I was cried out, I'd take a shower and usually go to sleep. If researching the lump is feeling comforting to you, go for it. But if not, find something else that is, or do what you need to do to feel the feelings. Being scared is ok. Missing mom is ok. Feeling alone is ok. Feeling not ok is also ok. ",
      "MessageIndex": 3,
      "PostDate": "26/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870586",
      "Title": "Tests tomorrow with health anxiety bethar bethar"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "23 hours ago Salamandra wrote: I think being assertive is a good plan. It might also be worth asking your doctor's office to follow up too, and make sure that the imaging center has official notice of your family history, from your GP.",
      "MessageIndex": 7,
      "PostDate": "04/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871866",
      "Title": "Waiting on biopsy appointment Mzbillieb76 Fairydragonfly"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 24, 2019 09:05AM - edited Mar 25, 2019 06:49AM by Salamandra I'm so sorry you are facing this and so young. Here are some things I wish people would have told me during that excruciating period between getting the malignant biopsy result and meeting my surgical oncologist:  Some other things that might be helpful:  Wow, I've written a novella here. I hope some of it is helpful either now or down the road.  TLDR; You will be ok. You can handle this. Based on how you found it, your prognosis will most likely be excellent. This is a marathon not a sprint. Take care of yourself and cut yourself a break.  Do what you can to get through this excruciating time. Ask a doctor for something for the anxiety if you think it will help. Eat cake if that's your thing, ride bicycles if that's your thing, go on a last minute beach vacation; throw yourself into your work; binge on romance novels or dumb tv shows; go visit your best friend across the country; light a candle and cry into your journal; whatever gets you through!  We are here for you.",
      "MessageIndex": 6,
      "PostDate": "24/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870542",
      "Title": "Just diagnosed MathCampNerd MathCampNerd"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 8, 2018 06:26PM Salamandra wrote: I also didn't get a KI-67 number. Which pathology report does that come with, and is it possible some of us just don't get it? Thanks for the info about radiation. I wish I understood cancer better. I have so many questions! Like, wouldn't a reoccurrence in the breast be better than a reoccurrence in the breast wall? Are they completely unconnected? No one I mentioned it to yet has been very distressed by my new lower life expectancy. I don't really know what to do with this information. I mean, I'll keep saving for retirement. I feel like my breast surgeon really glossed over the long term mortality part. Is that a surgeon thing? She really made it sound like cut and radiate and done, back to normal life. She also didn't warn me about the nerve pain from the lymph node biopsy procedure. But apparently she's really good at the cutting, so hopefully it's for the best.",
      "MessageIndex": 15522,
      "PostDate": "08/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 19, 2018 08:16PM Salamandra wrote: I put in my leave request for starting tomorrow. I so much respect those of you who worked/are working through radiation. I just haven't got it in me to be working right now. Every day was a huge fight with myself, and every day my work got worse. It felt like a hostage situation where I was both sides! The diagnosis process has definitely exacerbating my existing mental health issues (ADHD and depression/anxiety). I'm hoping that taking this time off will let me keep my whole self as healthy as possible and leave me in decent shape when I get through to the other end of this so I can actually go back to work and finish out the school year. It does feel so very strange though.",
      "MessageIndex": 15573,
      "PostDate": "19/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 20, 2018 10:15AM Salamandra wrote: Thank you DWisely, TaRenee, Pi-Xi. I really appreciate the support. It feels like there's such a culture of 'flight-through' both in cancer but even more so just in general US culture - don't be a wimp, work through, work is healthy, etc. I'm really having to try to peel back a lot of layers of cultural conditioning to feel ok following my gut here. And also feeling very lucky that I am in a job where I can do this and keep my health insurance and return to it, even if I do end up losing some wages. It looks like I may have about a week before starting radiation with no doctor's appointments. I am kind of thinking of finding some cheap last minute beach vacation within a 3 hours flight and soaking up sun and salt water for a few days. I haven't had a vacation like that in ages. I'd be going by myself (single) and I hope that wouldn't be awkward, and that's a kind of vacation I haven't done solo before. It's more of a fantasy now than a plan, but maybe...",
      "MessageIndex": 15578,
      "PostDate": "20/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 17, 2019 05:35PM Salamandra wrote: I happily use pills for help but because you said you were looking for non-pill methods here is a thing that I read about that has been somewhat helpful for calming me and putting me in sleep mode. It's a word game for sleep. Also, SantaBarbara, I'm interested in the melatonin. I didn't realize that the dose was that high for the anti-metastatic properties. I will try to do some more reading but if you have links handy, I would love to see. My sleep is bad enough that the idea of a combination sleep+anti-cancer drug is super attractive. Eegads007, thank you so much for linking about the magnesium. I'm interested in trying that too. ",
      "MessageIndex": 13,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869375",
      "Title": "Need some advice with sleeping, anxiety, etc kec1972 lyzzysmom"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 9, 2019 05:28PM Salamandra wrote: At my post op, the nurse practitioner checked my scars to see that everything was healing properly, and went over with me the results of the pathology, briefly, and got my consent to send for the oncotype test. She didn't really discuss what would come, because it was the surgical oncologist's office doing the post-op, and it would be the medical oncologist and the radiation oncologist making the next set of decisions/recommendations. She referred me to those people and her office set up those appointments for me. It would be a good time to ask more questions about every part of the pathology report that you want more info about. Some they'll probably be able to answer better, and some the medical oncologist will. It's also a great time to ask any questions about physical or cosmetic recovery from the surgery. At my center, it is the surgeon who manages follow-up surveillance. If it's the same for you, you can make sure you understand what they recommend in terms fo timing and frequency of future imaging/exams and follow up appointments. I hope it goes all right! Keep us posted.",
      "MessageIndex": 44,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 3, 2019 08:55AM Salamandra wrote: So glad you feel at peace and ready to go with the plan, and glad to hear that it's all curable!",
      "MessageIndex": 91,
      "PostDate": "03/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 24, 2019 10:56AM Salamandra wrote: Great news!",
      "MessageIndex": 9,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871672",
      "Title": "Another scared and worried here Traej Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 29, 2019 06:25AM Salamandra wrote: Nida_123, You can go to either a primary care physician or a gynecologist. I'd probably recommend a gynecologist and they might be better able to understand and explain normal changes in breast, but really a good PCP ought to also be able to do it, and to order appropriate next steps if necessary. I'll say that the longer I live in a woman's body, the more I'm surprised by the changes and variability that no one ever warned me about. I thought you grew up and had a status quo and that was pretty much it, but no. Anyway at your age especially, a lot of breast changes and lumps are completely developmentally normal! Still, it is never too young to build up a good relationship with a gynecologist and understanding of your health. Is health insurance/costs an issue for you? Planned Parenthood should definitely be able to help you on this. Good luck!",
      "MessageIndex": 2,
      "PostDate": "29/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869582",
      "Title": "Worried and have questions? Nida_123 Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 28, 2018 12:15PM Salamandra wrote: I did post on Facebook and for me it was a very good move. I didn't have to deal with telling most people individually. I got a lot of support and encouragement from my communities. And maybe most importantly, people I'd never known had themselves had breast cancer shared that with me and were really helpful in terms of information and just hope, of knowing people who went through this ahead of me. I also got a secondhand strong endorsement of my breast surgeon, which helped with peace of mind. I completely support everyone doing works for them. I just want to say, there's nothing wrong with putting it out there on Facebook or social media. It's your friends/feed, you have an idea of how they'd respond and whether it would be fortifying or stressful for you. For me, lucky to have wonderful extended community on Facebook, without a spouse or moms or local extended family, sharing was really helpful.",
      "MessageIndex": 14,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868555",
      "Title": "Who do I tell? Suzyshacklechick AliceBastable"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 4, 2018 03:25AM Salamandra wrote: What a great article. I wish that science and medical journalism were better resourced so that places weren't just copying press releases. And I wish that negative-results were celebrated as much as positive ones, so 'reputable' places wouldn't feel like they need to put so much spin. How is it that there seems to be such an impact for heart attacks, but overall no impact for the broader category of 'cardiac events'? What does that mean? That seems like it would be a really important thing for the press release and the journalism to explore and explain. I started taking high dose vitamin d a couple of years ago when there were all those articles about how we're all deficient. My numbers on blood tests are much higher now but I don't actually feel any different. Now I just take one big does every couple of days, especially in winter. I figure I'll use up this bottle at least...",
      "MessageIndex": 2,
      "PostDate": "04/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868672",
      "Title": "Going Beyond the Headlines - Fish Oil and Vitamin D Studies MelissaDallas AliceBastable"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 12, 2019 12:21AM Salamandra wrote: Great news HPFULL and Cjzach10! Especially after all the stressful waiting!",
      "MessageIndex": 76,
      "PostDate": "12/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868774",
      "Title": "High Ki-67, but low grade and stage? evily Renee9487"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 28, 2019 06:21AM Salamandra wrote: Hey artisto101, Whether you are Jewish or not, Sharsheret can at least help you get started on understanding and exploring some of the genetics issues. I found their social worker and genetics counselor really helpful for me at the beginning of my journey. The genetic counselor can do a telephone/facetime appointment with you to talk about genetic testing, what it can't and can tell you, understand your mom's results better, make suggestions about follow up for you, etc. They have the most expertise about genetic situations more common in the Jewish community but their mission specifically includes everyone, and I'm confident that if they think they don't have the expertise to help you, they would help you find someone who could. Don't feel silly about calling. Their social worker might also help you think through talking about it with your mother. Which I think could be really useful and good for your relationship at some point when you're ready. I also had a genetic variant of uncertain meaning. That means they've identified that it's unusual but they don't have a grasp on what it does - does it increase my risk for certain things? Lower it? They have no idea. What fun and useful information! (not). So I'm storing that knowledge away and getting on with things. In the end, life gives us what it gives us. It's great that your mom knows about this situation now.",
      "MessageIndex": 7,
      "PostDate": "28/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870673",
      "Title": "Gene Mutation and anxiety artisto101 vlnrph"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 7, 2019 07:04AM Salamandra wrote: I hadn't seen the Magee calculator before. I never got a ki-67, but I do already know my oncotype score (9). I was wondering if I could 'backwards engineer' the ki-67 that way. Playing around with the info from my pathology report (100% strong estrogen, 90% moderate progesterone, grade 6 Nottingham), it is impossible to come close to my oncotype score even if I put the ki-67 at 0.01%. The 3 equations go 12 (eq3, which ignores the Nottingham),14 (Eq1, which uses everything), and 16 (eq 3, which ignores the ki-67 - and is the only one I could calculate without entering a ki-67). So I don't think ki-67 can really be determinative. On the one hand, these are all too high. On the other hand, 18 and under is considered low risk, and they are all low risk, so for practical purposes of deciding chemo or not, it would have got me to the exact same place. They don't send the whole tumor to oncotype... so oncotype is getting, I think, more of a biopsy sized part of the tumor. My biopsy pathology was definitely more favorable than my lumpectomy pathology - it was higher PR and only grade 1. So I was a bit worried that oncotype could also be deceptively favorable. On the other hand, DNA is DNA. Right?? I wish I had more science background now. But my DNA from the tiniest sample or a large sample should be the same, is that accurate?",
      "MessageIndex": 63,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868774",
      "Title": "High Ki-67, but low grade and stage? evily Renee9487"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 27, 2018 10:31AM Salamandra wrote: I told everybody. It's such a personal decision. But I would say, the way to think about protecting others is in how you tell them and how you interact with them about it, not whether to tell them. For whether to tell them, think about you and what will be comforting and comfortable to you. Then if you decide you want to tell, you can be thoughtful about how. So for children for example, you can be careful to be composed, not show panic, share whatever positives (with my students I told them that it is a very common type of cancer, doctors deal with it all the time, and I'm getting great care) you have. With some people you might explicitly tell them you don't want to make it the focus of the holidays and you'd rather they not being it up unless you do first. People (at least the ones it's worth being considerate of) will follow your lead if you give it.",
      "MessageIndex": 1,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868555",
      "Title": "Who do I tell? Suzyshacklechick AliceBastable"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 30, 2019 09:24PM Salamandra wrote: Great news!!",
      "MessageIndex": 15,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869465",
      "Title": "Ultrasound guided biopsy question FLFishing49 Dani444"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 22, 2018 11:30AM Salamandra wrote: Thank you for opening this section and answering some questions. I was wondering how much impact the location of mets has on prognosis. I get the impression that a lot of the very long term survivors started with and mostly stayed with bone mets. My mother died of de novo stage IV, however about 20 years ago, and it had already metastasized to the brain by the time she caught it. She survived less than two years from diagnosis. Is there anything to this impression I've got? As I learn more, I am sort of constantly surprised by how diverse breast cancer is. I guess I wonder how is stage IV kind of subdivided (like we get a's and b's in the earlier stages now) and how much it has to do with location of mets, versus hormonal/genetic components of metastatic tumors, etc.",
      "MessageIndex": 4715,
      "PostDate": "22/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 4, 2019 05:21PM Salamandra wrote: Waiting for results is scary. With a birad of 4, the majority of biopsies come back benign. But whatever it comes back as, you will handle it and we will be there for you. Do what you need to get yourself through the days!",
      "MessageIndex": 1,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870160",
      "Title": "Waiting for biopsy Lynn721 Chloe2"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 13, 2018 09:00PM Salamandra wrote: 4-5mm is very small! It sounds like you have a great medical team and a good plan. I'm so glad you had and have good doctors who are taking your health seriously and being prudent! You mentioned you lost your dad young. I think a lot of this stuff can sort of be re-traumatizing for us. I was 19 when my mom was diagnosed with breast cancer, 20 when she died. When I got diagnosed... I did a lot of 'time travel'. Part of me was shocked, part of me felt it was inevitable and my progression would be just like hers. Now I know I caught it earlier (and am younger than she was) and technology is better and I have good chances. Still.. the past is in my thoughts so much. Please get all the emotional support you can. This is so hard. That said, I'm confident you will be around for your child and husband, and add so much love to the world!",
      "MessageIndex": 11,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868275",
      "Title": "Scared, Pregnant, and newly diagnosed bbfromkentucky1 Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 25, 2019 06:09AM Salamandra wrote: Hey stephyyoung, The good news is that there are all kinds of things that can cause what you're describing that are not breast cancer, especially in younger women. The other good news is that you are getting it checked out by a doctor, which is the right thing to do. Thinking cancer is a bit like hearing hoofbeats and thinking zebras instead of horses, but I understand that's where our minds go. Now is a good time to bust out your self-soothing and self-distracting techniques. If the doctor thinks it is even a little suspicious, they may order follow up testing just to be prudent - not because it's likely cancer, but because even if the chance is small it's important to find out for sure as early as possible). Hang in there.",
      "MessageIndex": 1,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870570",
      "Title": "Not Diagnosed but very concerned stephyyoung stephyyoung"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 23, 2019 10:02PM Salamandra wrote: The chances of this being anything is slim! It's not none though, so that's why it's good you're following up. I will say that I was in a similar boat. Grandmother survived BC, mother died from it, I have no known mutations, and the doctor found a lump at 38. For me, it did turn out to be cancer. It's been, and continues to be, a huge pain in the butt. But it hasn't actually been a catastrophe. I am getting through, and, if you need to, so will you. The waiting time is very hard. Distract yourself or absorb yourself in whatever works for you. Ask for an rx for valium or Ativan from your doc if you really need it. You can do this!",
      "MessageIndex": 2,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871695",
      "Title": "Non-hereditary breast cancer under 40... statistics Ndth86 Spoonie77"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 5, 2019 10:00PM Salamandra wrote: Hey creaturekeeper, I think it's a good idea to write up what happened and send it to the owner/manager of the lab - maybe also cc your cancer center. That shows the lab that they will get a reputation that could impact referrals. My general method is to keep the write up as factual and concise as possible. Include the exact date and time especially if you don't know the name of the office worker. At the end, write how you felt. If you want them to get back to you, say so explicitly. If you can do it snail mail, that tends to be taken more seriously in my experience. But electronic is fine too. I'm so sorry you had to deal with that. Ugh.",
      "MessageIndex": 1,
      "PostDate": "05/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/871377",
      "Title": "Upset with local health center & my weekly blood testing CreatureKeeper ipenelope"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 26, 2018 10:49PM Salamandra wrote: Sorry to hear that. When is your biopsy scheduled? You can ask about the birads number if you want an indication of risk. Not sure if it's actually helpful or not though, you know? No matter what you're still waiting and it suck. Have you had genetic testing? Your gynecologist may be able to prescribe while you're waiting, based on family history. Hoping for good news for you!",
      "MessageIndex": 4,
      "PostDate": "26/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868510",
      "Title": "Mammogram scheduled Jmora22 Dani444"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 27, 2018 10:19AM - edited Nov 27, 2018 10:20AM by Salamandra Birads is their way of saying where it strikes them on the spectrum from 'this looks like nothing alarming to us but we're not 100% sure without a biopsy' to 'this looks just like cancer to is but we're not 100% sure without a biopsy'. So in that sense it's hard for it to be wrong, but it might not be so helpful. You could have a low birads score but it's cancer or a high birads score and it's not cancer. I think that's why they'll use it for deciding whether to schedule a biopsy or whether to tell the patient to watch and wait and rescan in x months, but not necessarily share with patients. I didn't know about them until after my biopsy confirmed cancer. Then I looked back and yup, my birads was a 5 - the highest you can get without clinically confirmed cancer. But I couldn't really have done anything differently in the meantime anyway. Maybe set up an alternate doctor with a more reliable fax system to get the results sent to. So that's why I'm not sure whether it's good or bad to have the score. Based on some posts see here, lower scores don't actually relieve women of worrying. Tomorrow would be great! I had about a week between them and then over a week to wait for results of the biopsy. I hate waiting.",
      "MessageIndex": 6,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868510",
      "Title": "Mammogram scheduled Jmora22 Dani444"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 30, 2018 08:13PM Salamandra wrote: I'm so sorry to hear that Jmora. That really sucks.",
      "MessageIndex": 20,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868510",
      "Title": "Mammogram scheduled Jmora22 Dani444"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 5, 2019 11:28PM Salamandra wrote: Great news!",
      "MessageIndex": 8,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870075",
      "Title": "Doctor found a lump on friday... scoops Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 17, 2018 10:56AM Salamandra wrote: Hiya, My mother also died of cancer, and my own diagnosis and starting treatment processes has been full of... I don't know if they are technically flashbacks, but some sort of time travel anyway. It's definitely pushing many emotional buttons for me, and it's been really hard. I seem to have got lucky and caught it quite early, and it has favorable prognostic markers. The doctors have been as reassuring as I think they can. But I think this background makes it harder for me to believe them. And of course, now I am also facing all fo this without the help and support of my mother (and largely on my own - single no kids). I'm so impressed by how fast things have moved for you so far. I had almost 3 weeks between when the lump was found and the mammogram/ultrasounds, then another ten days before the biopsy, and then about 10 days after that to get the results. I didn't really start getting scared until before the biopsy but I think that's because I didn't see or understand the birads results from the mammogram. So, bonus? If you didn't already have genetic testing for mutations that are known to impact breast cancer, I guess that you will be getting them soon. Maybe worth asking if your gynecologist can prescribe them while you are waiting. One warning is that my insurance (after the fact) told me it wouldn't cover them without accompanied genetic counseling, so just to look into. This is so hard. A friend just shared this article with me that's about current cancer patients facing anxiety waiting for test results, but honestly I think it applies also to those of us with the trauma of it in our immediate family. Maybe it will be helpful a bit for you: NYT: Tackling Cancer Anxiety (if paywall is an issue, apparently an incognito/private window may help). Do what you need to do to take care of you. If this is cancer, it will be a marathon and not a sprint and you'll need all the rest nd mental/emotional bandwidth you can manage. If it's not, and hopefully it isn't - 4 isn't 5), then it'll be over pretty soon. Hang in there!",
      "MessageIndex": 4,
      "PostDate": "17/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868393",
      "Title": "Birads 4c- waiting on biopsy results. Glueck Moderators"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 27, 2019 06:39AM Salamandra wrote: Google is a double edged sword for sure. But I see so many new posters here driving themselves crazy trying to determine their odds of malignancy. It's an impossible task, when even doctors would not diagnose without the scans and biopsies. I agree that this post should be pinned - and maybe even flagged for new members who identify themselves as waiting for a diagnosis. But I'd add a couple of things: ",
      "MessageIndex": 16,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870630",
      "Title": "Things to know about Dr. Google. Number 75 will shock you !! djmammo kber"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 10, 2019 03:29PM Salamandra wrote: I'm pretty nervous/scared.... Mostly I think because she thought I should be seen so soon. It sounds like either this doctor is your friend, or you got the appointment via the help of a friend who is a doctor. The speed could very easily be a professional courtesy thing. Or they just had the appointment open, and offices would rather have filled slots than open ones. Try not to read too much into it! For all you know, she isn't worried much at all but is thinking that you might be freaking out and thinks she's doing you a favor by rushing you in so soon!",
      "MessageIndex": 6,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869271",
      "Title": "Worried/scared but trying not to be... dmerri18 dmerri18"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 7, 2019 05:21PM - edited Jan 7, 2019 05:21PM by Salamandra Hey Justme, Congrats on getting done with surgery! I think palpable means that they are feeling something in the nodes that might be cancer. They will send everything for pathology and then you will have the full report. Even after that, the doctor might send for an oncotype or mamma print test which would take more time to get the results. The waiting time sucks so much. Nothing to be done really, plow through however works for you. If they do find cancer in the nodes, it still doesn't necessarily mean chemo. And if they don't find cancer, it doesn't necessarily mean no chemo. My medical oncologist sends for oncotype even if someone is node negative and small tumor, and will do chemo if it comes back high. So you really still don't know. Hang on and take care of yourself!",
      "MessageIndex": 33,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 27, 2019 11:56PM Salamandra wrote: It could be scar tissue! It probably is scar tissue. But... it could be cancer! Or... it could be something else that is neither scar tissue nor cancer! This part, the waiting and not knowing, is hard and difficult. No one knows right now, not you and not the doctor. The follow up tests should help give more information. It's better to be safe than sorry. If it is scar tissue or something else benign, they can mark it in your medical file so they know for the future. If it is cancer, then your doctor found it nice and early and you can get the right follow up treatment. Can you try to call them and nudge them? If you have the time and energy for it, sometimes a squeaky wheel gets the grease. Or you could see what other options there are in your area for a mammogram that you could schedule yourself.",
      "MessageIndex": 2,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870075",
      "Title": "Doctor found a lump on friday... scoops Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 6, 2018 08:55AM Salamandra wrote: Sending calming thoughts! Bodies are strange and keep surprising us! This could be hepatitis, a variation on a regular cold/flu/stomach virus, or some other new and interesting and yet not dire thing your body is throwing at you. Maybe something related to your surgery, which was so recent! Chances for liver mets so soon after a 1A ER+/PR+ diagnosis are super low, and lots of other highly improbable explanations are still way more probable. Whatever it is, you will deal with it! As far as I'm concerned, this is the time for Boggle/Candy Crush/Civilization/Tetris, whatever mindless games you have handy that absorb you and make the time go by. Good vibes!",
      "MessageIndex": 1,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868718",
      "Title": "Meeting the Onc today/PET scan CHB87 KerLyn"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Apr 19, 2019 07:35PM Salamandra wrote: Hey DaisyK, As others have said, there are is good evidence/science to back up the approach your doctor is recommending. That said, it can be very helpful/reassuring to get a second opinion. It's recommended especially if your first opinion isn't at an NCI designated center. Health insurance companies cover this and often encourage patients to get one. They may even have a navigator to help you set it up, if it's something you're interested in.",
      "MessageIndex": 6,
      "PostDate": "19/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/871089",
      "Title": "Hello, new here. DaisyK DaisyK"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 28, 2019 05:36AM Salamandra wrote: Our bodies change all the time and in my thirties I felt I was still learning about all the new and disconcerting things my body could do (that were still almost always normal and not a problem). At your age, even more so! It's good to learn more about your health and body and to pay attention, and it's good that you have solid health insurance that is letting you get a doctor's perspective on it. But overall, if you can internalize the message that hoofbeats is probably horses and not zebras, it will help your peace of mind long term! Sometimes the obvious cause of anxiety is not actually the underlying cause. I wonder if there might be other things going on in your life that your are anxious about, and these breast changes have become a sort of focal point for it? That kind of mis-triangulation is definitely something that can happen. Taking some time to think about other possible causes could be very rewarding. All that said, finding a change that concerns you and bringing it to the doctor is exactly the kind of self-care that we should be doing, and don't let anyone make you feel guilty or alarmist for it. It's almost always better to just see a doctor that you trust, rather than going down the rabbit hole of googling and self-diagnosis. If your doctor makes you feel guilty for asking them questions, they are not helping.",
      "MessageIndex": 3,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871768",
      "Title": "I’m worried I have IBC CodyCat Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 28, 2018 05:46PM - edited Nov 28, 2018 05:47PM by Salamandra 39, lump found literally on my birthday (at the gynecologist appointment where a new hormonal IUD was my present to myself - that IUD feels kind of like a lucky charm now",
      "MessageIndex": 939,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 8, 2019 10:58AM - edited Jan 8, 2019 11:01AM by Salamandra I'm so glad you're getting a second opinion! FWIW, I'm being treated at MSK and I've been very impressed. Based on my reading, it seems like the trend is away from surgical removal (they call it axillary dissection) for positive nodes and towards radiation only. The evidence shows that it's equally effective with much fewer side effects. So it does make me nervous that your doctor is assuming that surgery would be the next step. I'm sure there are cases where it's warranted, but I think a second opinion on ALL of it is a really good idea, and keep asking questions and making them explain until you are really confident you understand and they make sense. I got a little frustrated with my breast surgeon too. She gave me the impression that I would only need the oncotype if I had positive nodes, and if not, I would get no chemo without the oncotype. Later the oncologist said no, either she spoke badly or I misunderstood, and if I had had positive nodes my oncologist might have skipped the oncotype and gone straight to chemo (I'm young for breast cancer) but with negative nodes she always sends for oncotype. Well you know what - I did not misunderstand. The surgeon was clear. Me, my friend in the room, and my friend on the phone taking notes (who is an MD) all heard and understood the same thing. I think that it's a division of labor thing. The surgeon is the expert at surgery and screening, not at decision making about genetic testing and chemo. For whatever reason, the protocol seems to be that the surgeon is the gateway into cancer treatment, the first doctor many of us see, who gives us the first explanations and introductions. My surgeon gave her best understanding and guess about what would happen after she was done with her initial role, but she didn't *know* and it's not her job to know. She sounded super confident and sure because... well, I think because that's how surgeons are.... Yep, everything *can* change after the surgery pathology comes back. Usually it doesn't, and if it does change, it doesn't change very much. But it *can.* My surgeon definitely didn't really prepare me for that. And in my case, it wouldn't have mattered because for me it actually didn't change. But because I'd been doing my own reading and education, I learned from other sources that it could have, and that undermined my trust in her. But I get it, they can't tell us everything they learned from years of school and practice and experience in a two hour initial consult, they have to pick and choose and focus on what they think is most important at the time. Don't feel like you're doing anything wrong. I feel like the doctors aren't really trained in the art of educating patients and the psychology of it. If you're not understanding, it's likely more on your doctor than on you. And I don't say that to blame them. They get thrust into that role, but probably ideally there would be educator specialists with a deep cancer knowledge who would be part of the initial process and first appointments. It's OKAY for surgeons not to be great at that part of the job as long as they're great at the medical/surgical part. But we still have to make sense of things. I've found these boards super helpful for that. (From my understanding, what medicine thinks about positive nodes is changing too. Now it understands that nodes is only one way the cancer *can* spread, finding it in nodes doesn't necessarily mean it *has* spread beyond the nodes, and not finding it nodes doesn't mean it *hasn't* already spread to be waiting dormant in other parts of the body. They treat the nodes (whether dissection or radiation) to keep it from spreading *from* the nodes, but it doesn't mean they were wrong about your tumor being low risk. You can have multiple positive nodes and a very low oncotype/mammaprint). Anyway, like I said, I'm really glad about the second opinion, and keep pushing as much as you need to, to understand. Don't let yourself feel rushed or pressured. Keep asking questions here and try to do what you need to do to get through this objectively head-spinning time - whether that's distracting yourself or immersing yourself deeper in cancer scholarship. Do you mind if I ask, are you located in the NYC area? There are a lot of really good hospitals around here.",
      "MessageIndex": 35,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 13, 2018 05:51PM Salamandra wrote: Hi CHB87, That all sounds like good news! I was a wreck waiting for my tumor & sentinel node pathology to come back, but in the end it confirmed my surgeon's clinical diagnosis. The tumor was larger than indicated on previous imaging, but still came in under 2cm, which is the magic cut off for Stage 1. This stuff... some of it seems so arbitrary! Good luck with your surgery and keep us posted :)",
      "MessageIndex": 15539,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 17, 2018 11:12AM Salamandra wrote: DWisely, I agree, I was so pissed at him but didn't feel like putting in the emotional energy to confront. I'm a high school teacher. I can get through the day all right but when it comes to planning... and trying to teach without planning is just a shit show for everyone involved. I'm lucky that my insurance will cover a break and my job will be held, I know that's a huge deal in this day and age. On the other hand, I only have about 12 days of paid leave left. I also have the best self-contained class I can possibly imagine and I hate the idea of abandoning them right at the end of their first semester of high school. But it is what it is, right. Right now I'm fighting with myself about whether I can stick it out until Thanksgiving break. Are you pretty committed to working through radiation? I'm 39, so I guess somewhere along the 10 years I could need to transition from tamoxifen to AI, depending on menopause timing.",
      "MessageIndex": 15566,
      "PostDate": "17/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 9, 2018 06:32PM Salamandra wrote: I went into my surgical appointment thinking I'd be getting a mastectomy (half to treat, half preventative) and came out feeling much better about the lumpectomy route. The long term outcomes are equally good statistically (at least for my particular configuration of cancer). I'm 39, single, no kids. I'm sure that affected things. The healing on my breast has been very easy, but the healing from the sentinel lymph node biopsy has been a pain in the ass. I was able to go back to work after a week, so not terrible, just uncomfortable. One thing I'm thinking about is that I can always get a mastectomy later. My impression is also that it can sometimes be easier to do the mastectomy and reconstruction together when it's not at the same time as other cancer treatments (radiation, chemo). But I haven't asked a doctor about that, and need to. That's based on the experience of a friend who had stage 3, double mastectomy, and was told to wait until she fully recovered from side effects of other treatment before reconstruction.",
      "MessageIndex": 6,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868244",
      "Title": "Surgery soon... lumpectomy or dbl mastectomy? Oya80 HopeBry"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 12, 2019 06:07AM Salamandra wrote: Hi Cindr, I'm glad it was helpful! I did the hypofractionated schedule. I think it's becoming more and more common, so people don't always mention it specifically. It's what my doctors recommended, and from what I could tell, for that they actually do have research that medical and cosmetic outcomes are equivalent to the long schedule, and compliance is higher so the benefit is greater overall.",
      "MessageIndex": 15768,
      "PostDate": "12/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 13, 2018 11:24AM Salamandra wrote: Things that I wish I'd known sooner than I did: They don't really know the stage until after surgery and pathology - they're making informed guesses. Your stage can go down based on pathology. I was freaked out waiting. Knowing that I think might have helped. What is the estimated size of your tumor? Even if it's larger, if there is no node involvement and your oncotype/mammaprint score comes back low, your stage could still be 1a. No matter what your grade is, you never know if you're 'cured' until it either comes back or you die of something different. Most women die of something different. The treatment is a slog and you really can't know what side effects you'll have except by trying the treatments. It's easy to get freaked out because people with bad experiences are more likely to post. But a lot of women either have minimal or very treatable side effects.",
      "MessageIndex": 7,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 10, 2019 01:12PM - edited Jan 10, 2019 01:13PM by Salamandra justme1964, I think that's a great thing to know about yourself and a completely fair plan! I think you will feel a lot better once you have doctors that you have confidence in telling you the plan and explaining your situation in a consistent way. I agree that removing the drain will help. I had to wear a veronique for a while after surgery because of a seratoma that didn't want to go down, and I really really hated the reminder. I hope you can get rid of it soon!",
      "MessageIndex": 50,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 27, 2019 09:38PM Salamandra wrote: Hey wity-pity, I think many of us who were diagnosed at relatively younger ages have similar stories. My doctor found a lump, and sent me for further exams 'just in case.' Thank goodness our doctors were prudent! I will say that early stage cancer turned out to be much more manageable so far than I ever expected. The hardest part was the beginning, waiting for all the test results, and then waiting for more. But this board has been an incredible support. This part is so hard. Do what you need to get through. Therapy? Ativan? Exercise? Rest? Vacation? Work? Whatever helps you through the day. One thing I wish I understood better at the beginning was how incredibly unlikely it was that I would have metastasis (when the lump was discovered without any other symptoms and still pretty small) and how good the prognostic rates are for early stage cancer. It will be a tough haul, if it is cancer, but you will find your equilibrium and get through. You are not doing this 'to' your daughters, there are so many things in life we can't control and cancer is definitely one of them! You can set them an example of how one can face something scary, act through the fear, and stay loving and open. That can be a precious gift too.",
      "MessageIndex": 4,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870090",
      "Title": "Can’t handle all the waiting wity-pity wity-pity"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 7, 2018 07:57PM Salamandra wrote: I just got diagnosed maybe six weeks ago now. I already had my lumpectomy, waiting to hear whether radiation or chemo is next. I love that the 5 year survival rates are so high for stage 1. But I can't help but look at the 15 year survival rates, and they're not so high. And I can't find anything about 20+. I haven't met my medical or radiation oncologist yet. I feel like the information is very clear that radiation reduces the rate of recurrence in the same location, but it's not so obvious to me how much it actually improves mortality/extends life. I was so freaked out at first I went along with everything the surgeon said. But now I've had time to read and think more. It's so hard to wrap my mind around. I'm trying to work through this time to conserve my paid sick leave for chemo/radiation, but my focus has been terrible.",
      "MessageIndex": 15509,
      "PostDate": "07/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 13, 2018 08:47PM Salamandra wrote: We all deal differently. I'm sorry you didn't get more support from work though, if you wanted it. My bill said \"partial mastectomy\", not lumpectomy. I did a double take at first. In retrospect, yeah, it makes sense. And I think I would have felt more comfortable taking more time to come to work, if I had thought of it that way. I don't think I lost so much of my breast, or at least it doesn't appear that way so far. But the healing from the lymph node biopsy has been a slog. I had to get a seroma drained twice. I went back a third time, they couldn't get anything. Nurse thinks maybe it's clotting. She's not worried but there's nothing to do but live with the discomfort, and a 'veronique' band that constantly reminds me of the cancer.",
      "MessageIndex": 15541,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 10, 2018 02:24PM Salamandra wrote: I've never tried to have biological children so I don't know how my fertility is. I did go through a bunch of rounds of hormones for egg freezing for 'fertility preservation', about two or three years before I was diagnosed. I asked my surgeon at my first oncology appointment whether those hormones could have contributed to the cancer and she said they don't have evidence for that. Other than that I had about 3-4 years on a Mirena IUD, which I took out before the egg freezing. Getting a new one (Liletta) back in is actually when the gyn found my cancer lump. I fought to keep it. I don't blame the Mirena, which is very low dose and not estrogen. My mother never spent any time on hormones and had no fertility issues and breast fed. She still died of breast cancer twenty years ago. I don't know. I think humans look for patterns. But life can be frustratingly unfair and arbitrary.",
      "MessageIndex": 15659,
      "PostDate": "10/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 28, 2019 06:15AM Salamandra wrote: Hi Sparklekitty, First, it's infuriating how doctors treat women's issues, especially young women. I'm so so sorry that you had to deal with that. It sounds like you have been in a very difficult and stressful road, and I'm sure that having a young child amplifies it all. I'm so glad you are going to a different care center. Do you have someone you can call on to get your pain meds for you? If not, then NSAIDS (Advil, aleve type drugs) are often helpful for that kind of pain, and you can take a pretty high dose. I was sent home after oral surgery with 800mg pills. If nothing helps, do you have a friend you can FaceTime with? I found that the most distracting when I was in pain I needed help from. That or putting on an audiobook that I'd read a bunch of times before and loved, just enough to draw my mind a bit away from the pain but not too demanding of attention. I'm so so so sorry you are dealing with this. I hope it's not cancer. But for heaven's sakes, even if it's not cancer, it's something they should have been so on top of years ago! It's disrupting your life! You should not have to be dealing with it like this. Please call on anybody close by who can help you with logistics, babysitting, fetching meds from the pharmacy, etc. They want to help. Post here if we can be helpful for support. Ask for your new medical centers social worker and patient support resources. ",
      "MessageIndex": 2,
      "PostDate": "28/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870675",
      "Title": "Nobody took me seriously. SparkleKitty Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 21, 2019 07:57AM Salamandra wrote: Please don't beat yourself up! There's a good chance it emerged very fast, and sometimes it's not so easy to notice changes. Also take all prognoses with a grain of salt. For one thing, the long term ones are, of necessity, based on people who got diagnosed and treated a long time ago. Treatment has come a long way. For another thing, if it *is* cancer there is still lots more info waiting to come out before you can even know which prognoses charts to look at it that really match your cancer. And finally, statistics just don't mean that much for any individual outcome. People with the smallest lowest grade cancer can end up on the wrong side of the odds and people with the most aggressive advanced cancer can live a very long time. The waiting part that you're in now is truly excruciating. I hope you get results fast and a fast appointment with an oncologist if they come back malignant. In the mean time, cut yourself as many breaks as you can, do whatever works for you for stress relief, even if it's eating cake and reading romance novels, and hang in there.",
      "MessageIndex": 4,
      "PostDate": "21/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870465",
      "Title": "New and terrified Mumoftwo416 KBeee"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 22, 2019 11:57PM Salamandra wrote: Hi Traej, Try not to blame yourself. Each of us can only do the best we can. You found a lump and you're following up now. For all you know, a mammogram might not even have found it - mammograms aren't perfect, and lumps grow at different speeds. I think the fear and anxiety are normal. Hang in there - do what works for you in terms of distracting yourself/absorbing yourself. Even if it's not cancer, you might have a few hoops to jump through before you can confirm that. If it is cancer, you'll deal with whatever gets put in front of you and we will be here to support you.",
      "MessageIndex": 3,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871672",
      "Title": "Another scared and worried here Traej Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 16, 2018 09:35PM Salamandra wrote: Finally had my appointments today! My oncotype score is 9. The medical oncologist said no chemo recommended - Tamoxifen only, ten years. I think she sent the prescription already. I liked her a lot. The radiation oncologist was wildly positive about my outcomes. He also said there will be 0 radiation to the lungs and heart. He spent a lot of time with his phone in his hand or his laptop in his lap or looking at his smartwatch, and seemed overall pretty bored by my case. He seems to be very respected and participates in cutting edge research and I *liked* the content of what he was saying about all the 'good' things about my cancer. But wow. Hopefully he is really good at what he does and I won't have to deal with him much I generally find speaking with women doctors much less stressful/annoying. I loved his resident, who spoke with me first and actually thoughtfully addressed all my questions. But it turns out she will be rotating out by the time I really get started. I want to just start everything already, but it sounds like simulation next week and probably not actually starting treatment until December. I'm trying to decide what to do in terms of taking time off from work. Mentally I've had it, and I wish I could take off starting next week. I'm already fatigued from the surgery and stress. But physically it sounds like it will really start taking its toll after the first week or two. The resident said most women feel completely back to normal about two weeks after it ends. I gotta weigh the mental health and the loss of wages.",
      "MessageIndex": 15563,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 9, 2019 03:58PM Salamandra wrote: I was not offered partial breast irradiation, I believe because of my age. I considered asking about it, just on the principle that the minimal effective invasive treatment seems like a good idea. But from what I could tell from my own research, external partial breast irradiation often has worst cosmetic results and has not been proven to have equivalent medical results, let alone better ones. My radiation oncologist also assured me very seriously that there would be no radiation to my heart or lungs. Now, your tumor is much smaller than mine, and in your left breast. And you may have other health issues that are impacting treatment. But I guess in your place the first thing I'd want to know is whether the radiation oncologist was confident he could do whole breast radiation without hitting my lungs and heart. Then, I'd want to hear whether and why they would consider partial breast irradiation an equivalent alternative to whole breast. If they can't explain to your satisfaction, I think that would be a good enough reason to for me to go with the tried and true whole breast radiation option. (Disclaimer - I'm just another layperson). (To me partial breast irradiation seems like the worst of both worlds - the drawbacks of the limited treatment area associated with intraoperative partial breast irradiation but the hassle and side effects of the regular whole breast radiation. Unless there is concern about radiation to hearts or lungs, I would be pretty wary of it. But I am a complete layperson and this is only my impression, and I'm very glad to read other opinions and experiences).",
      "MessageIndex": 15759,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 28, 2019 11:19PM Salamandra wrote: Great, so glad you could get that on the calendar! I actually had about 3 weeks between finding the lump and the mammogram. My doctor did not really seem concerned it was cancer and said she was just being cautious with the mammogram. Good thing she was! I went into the mammogram basically unworried.. The waiting time is tough on our heads, but it shouldn't make any difference at all in terms of the treatment/cancer.",
      "MessageIndex": 6,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870075",
      "Title": "Doctor found a lump on friday... scoops Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 13, 2019 07:00AM Salamandra wrote: Hey FrenchPorsche, Totally normal to be stressed and worried! Do what you can for yourself intellectually (e.g., keep reminding yourself how many biopsies are benign, how very early you would have caught it if it is cancer, etc. But I find what helps most for me is less in my head. Addicting phone games, intense exercise, interacting with teenagers/children - something that takes you out of yourself for a bit. Hang in there!",
      "MessageIndex": 1,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870341",
      "Title": "Results today (hopefully) FrenchPorsche FrenchPorsche"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 28, 2019 05:16PM Salamandra wrote: That's basically my stats! Do you know your hormone receptors? That will make a big impact for treatment. For me the next step was to meet with a surgical oncologist at a Cancer Center in my city. It was a bit of legwork to get all my test results to her and also I had to wait almost two weeks for the appointment because I preferred a female doctor. That's great that you only have to wait a week. At that appointment, she was like the gateway doctor - she spent a lot of time explaining the diagnosis to me and the most likely treatment and prognoses. She recommended a lumpectomy+radiation for me, and said that the survival outcomes are statistically slightly more favorable with L+R in a case like mine than with mastectomy. For me that was a huge relief - but different women have different feelings. If I had been interested in a mastectomy she would have explored that option with me too. ",
      "MessageIndex": 14,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870090",
      "Title": "Can’t handle all the waiting wity-pity wity-pity"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 1, 2018 09:18PM Salamandra wrote: That is a little odd to me because I know that with certain large cancerous tumors, they would use chemo to shrink them before surgery. They'd want to know before surgery what's going on with the tumor so they know whether to check for spreading and what types of other treatment to give. I definitely don't know enough to say that this is wrong. But I would think it worth asking for a second opinion.",
      "MessageIndex": 3,
      "PostDate": "01/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868651",
      "Title": "Scheduling surgery Emast26 Emast26"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 5, 2019 09:43AM Salamandra wrote: I think it's super individual. I was pretty healthy and active before and during (I bicycled about 18 miles round trip to radiation most days). But I still got hit with the fatigue hard. Most days, I could do the radiation plus one other thing, I got very tired around 3 or 4pm, and focused concentration was hard. I think the RO was surprised by how much I felt impacted by fatigue. I feel really lucky I was able to be off work.",
      "MessageIndex": 4,
      "PostDate": "05/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869684",
      "Title": "How Fatigued were you during rads treatment? kec1972 Carol2018"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 8, 2018 07:13AM Salamandra wrote: JulesSM59 - I so get what you mean about people thinking everything is good, and inside I'm like what NO! I was SO relieved when I learned it was stage 1 initially. I kind of wish I hadn't shared that with people now. I mean, stage 1 is better than later stages, and I wasn't wrong to be relieved. But it's not like an ear infection and you take surgery/radiation and it's gone. Some people are saying, oh it's six months of terrible and then it's fine! And I think they mean well, and it's either ignorance or wanting not to dwell on bad things, but it's getting irritating. People say ER+ and especially both ER+ and PR+ are good types because they are more responsive to hormone therapy. From what I can see, they have better early outcomes, i.e. we are less likely to die in the first 5-10 years. Which is good! But whoever survives the first 10 years, regardless of tumor pathology, at that point the chances sort of even out. And it's possible to have an initial cancer that's hormone receptor positive, take care of it, have it never come back, but then have a new occurrence that's triple negative, or triple positive, or just Her+. I don't want to borrow trouble, and I'm so glad I have a place to talk about it with other stage 1 people, because I'm sure that to more advanced stage people it seems like a great problem to have. But I still have to wrap my mind around it somehow. My surgeon also didn't send my samples to the oncotype lab until after my first follow up. Initially my surgeon was being very confident that I wouldn't need chemo, but then apparently they decided to send it off. My surgeon came recommended and I think it's possible she was a really great surgeon, but there are definitely things in her office communication that I wish were better. And her office is also telling me she won't write a medical note for me once the initial surgery recovery is done, even though it's weeks until I meet my next doctor, which feels like BS to me. Cancer is a global thing, not just a surgical thing, and theoretically it's all under the same hospital and a treatment team, no? But then, I haven't actually got to speak to the surgeon since before the surgery - follow up was with her NP. Which also feels like BS. I think I need to be more insistent, but who has the energy/time for that! It's taking everything I've got to keep showing up for work! Wow, I haven't even realized how much I've been needing to vent. Thank you for reading!",
      "MessageIndex": 15515,
      "PostDate": "08/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 8, 2018 07:25AM Salamandra wrote: Kathy, Playing with it, for me it says: 85% survival with surgery only, 88% with surgery+hormones, 90-91% with surgery+hormones+chemo. That's as opposed to 96% survival for the average woman of my age with no breast cancer. But I'm not seeing where that calculator considers radiation, or if it's included with surgery only? I don't have to time to play with other calculators just now but I will later. But you have to put your own numbers into it. I'm 39 (young-ish) and my tumor is 1.8cm (large-ish for stage 1). And I don't know about the oncotype yet to see whether chemo will actually be recommended. It looks like your tumor is smaller and your numbers will be better. I can't wait to meet with my medical oncologist. These numbers, they're hard to digest. Is a 3% improvement rate worth 5-10 years of hormone altering drugs? I mean, yes if there are no side effects, and some women have no side effects. But, if I have side effects?",
      "MessageIndex": 15516,
      "PostDate": "08/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 10, 2018 02:27PM Salamandra wrote: CeliaC, My breast surgeon was also incredibly unempathetic with time off. It makes me wonder whether there are stats collected that count against them or something. Fair enough if I also had the option of a medical oncologist to turn to. But Sloan Kettering set it up so I only met my MO a full month after my lumpectomy. And yeah, part of the delay is due to waiting for oncotype results that my surgeon initially said would not be needed if my lymph nodes were clear, and then the office didn't even send out until after my follow up appointment with the surgeon's nurse practitioner. I have another week to wait. In the mean time I'm reading a lot about radiation and starting to read about tamoxifen. And Monday likely going for a third time to get a seratoma drained at the site of the lymph node biopsy.",
      "MessageIndex": 15528,
      "PostDate": "10/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 22, 2018 10:33AM Salamandra wrote: Hi stage 1 sisters, I'm thinking about the marginal impact of tamoxifen. The online calculators I tried give me at 15 years 85% survival with, 88% survival without. I know those aren't perfectly customized, and my docs have been really positive about my particular situation. 3% improvement isn't nothing, but it's not a hell of a lot either, is it? I'm definitely trying the tamoxifen, and if the side effects are livable, I'm happy to take it. But it does mean giving up an antidepressant that has worked well for me for years, and sticking with it come what may just doesn't feel as obvious as I thought it would. I'm thinking I will try to speak with my medical oncologist about it more at my next follow up. But i wonder how other people are squaring this math? Also she wants me to take out my hormonal IUD. Not because of any studies that show it's harmful, but just because it's hormonal and so is my cancer. And I've been pushing back. So I'm guessing she won't be thrilled to hear this from me! But anyone else in this boat with the IUD? I've read that some oncologists actually recommend keeping them because they can help with the endometrial lining issues that tamoxifen sometimes causes and reduce ovarian cancer risk.",
      "MessageIndex": 15585,
      "PostDate": "22/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 23, 2018 11:21AM Salamandra wrote: Hi farmerlucy, Thank you, I really hadn't thought about that part of it - the emotional impact of not taking the tamoxifen. I am a worrier by nature, so that seems very relevant!",
      "MessageIndex": 15588,
      "PostDate": "23/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 9, 2018 07:00PM - edited Dec 9, 2018 07:03PM by Salamandra I also had birthday cancer! I got myself a hormonal IUD for a 39th birthday present. It was kind of aspirational - I do hope to have a sex life again at some point... in the mean time at least it should give me the gift of no periods. I went to a new gyn to get it inserted, pretty randomly, someone in my neighborhood who took my insurance and had availability. She offered to do a breast exam and found a lump. The ultrasound radiologist and the breast surgeon both gave her kudos on that 'pick up' so I guess she now has a loyal patient in me, even though I don't like the rest of the practice. I'm more or less on my own. My biological mother died of breast cancer when I was 20 (yes, it has made this whole thing traumatic on a whole other level) and my co-mother had very debilitating dementia for years before she passed away about six months before I was diagnosed. My siblings live halfway across the country. Most of the time I'm not lonely. I'm so lucky to have truly wonderful friends. One of them made me a radiation care package with a little gift for every single day of treatment!  I did take off of work. I changed careers into teaching a few years ago (high school special education) and though I like it and I'm so grateful for the health insurance it is providing me, I didn't have the physical/logistical/emotional capacity to deal with the treatment and the intensity of the workload at the same time. Treatment is about fifty minutes to an hour in the opposite direction of my school, no car. (Live and work in Brooklyn, go to MSK in Manhattan). I'd started bicycle commuting to work this fall and now I'm bicycle commuting to radiation. I have a scaredy cat who nevertheless makes life more interesting. Friday I had the door open for her and a raccoon came in and sat on my bathroom mat. My neighbors dubbed it Moisheh the Hannukah Raccoon.  I've been reading a lot about breast cancer and trying to take care of my mental and emotional health too. It's been quite a year. I really hope I'll be in shape to not hate going back to work when it's time. And I still hope I'll be able to put my IUD to it's proper use at some point! Even if dating isn't something I have much energy for lately :) My doctors wanted me to remove it since it's hormonal and my cancer was HR+. But it was more on general principle than specific data. I feel like somehow it represents my sometimes tenuous connection to normalcy, and also a good luck charm because it's responsible for my cancer being found now rather than until whenever I started regular mammograms (which should have been at 40 but who knows if I'd have actually done it promptly). So I'm keeping the damn IUD. I did the surgeries, I'm doing the tamoxifen and radiation, but I'm not going to have periods too if I can help it. Anyone else play Pokemon Go, and want to be friends? Or Boggle? ",
      "MessageIndex": 15652,
      "PostDate": "09/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 6, 2019 03:51PM Salamandra wrote: Hi dolcevita, I think those are really valid questions, and I wish there were more fine grained sorting of risk factors. It seems to me the data must be out there, but I suppose it takes a lot of labor and resources to calculate it. I think doctors and insurance companies consider radiation and tamoxifen/AI to be relatively very low risk/impact interventions with strong evidence of *general* efficacy (i.e. across stage 1 in general), so they aren't necessarily motivated to push so hard on getting women out of it. The furthest they've gone is to suggest that women 70 and up *might* skip radiation. Local recurrence rates with lumpectomy alone are pretty high, even for low risk. The evidence for radiation preventing local recurrence is very good. Is it worth it just for that? At first I didn't think so, since the evidence shows that the benefit for overall survival is real, but not very high. But then, has all been such a pain in the neck. I feel lucky that my surgery went well cosmetically, but how many times do I want to risk that? And the recovery from the SNB is still annoying. Plus who knows whether my health insurance will be as good in the future, and how stressful this would be to try to deal with, if I had crappy health insurance. Even if it were 'only' a local recurrence. (I also suspect, as letsgogolf said, that the high risk of local recurrence is at least somewhat related to issues with needle biopsies, and I wish there were more straightforward information on that). The tamoxifen, it's so similar. The doctor says 50% reduction in risk. Also says my risk is low anyway. It made it hard to get motivated to take it, especially reading about some of the bad side effects people have. But I also read/heard of plenty of people having no or very mild side effects, so I figured I should at least try it for a while. Pushing on me I also have that my mother died of estrogen positive breast cancer. I also notice whenever someone on the boards who didn't take ant-estrogen drugs at all, or for just a short time, has recurrence. Is that statistically meaningful? Probably not. It's likely intense confirmation bias, because who comes back to the boards after all. But it helps me feel better about the decision to try the tamoxifen. In the end I think it's just what we can live with. Doctors see lots of patients who all have different health situations and risk tolerances, and it's much simpler/safer for them to push the 'safest' known route. It took a LOT of studies and validation before doctors felt safe enough to rely on a low oncotype score to skip chemo, and compliance is still not universal. Hopefully in the future we'll get tests similar to oncotype to pre-determine efficacy of radiation and hormone treatment. But for now... ",
      "MessageIndex": 15715,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 24, 2018 08:00PM Salamandra wrote: It's so hard waiting for the doctors appointments! There is a ton of good information on this site. I also really liked this site: https://breast-cancer.ca It looks silly (with the moose) but I found the explanations to be both thorough and accessible. I don't know that much and you didn't really ask a question, but in case it's helpful, this is my understanding? ER+ means that you will almost certainly get prescribed something to suppress estrogen (probably tamoxifen if you are premenstrual, AI if post). You take it long term to reduce the likelihood of that kind of cancer coming back. Now they are saying 10 years. ER+ HER- means that there's a chance you may not have to do chemo. At least that's my understanding, that basically everyone with HER+ or with triple negative gets chemo. But if you are hormone receptor positive, then depending on the characteristics of your tumor, you may or may not be recommended chemo. That may be a pretty long wait to know for sure - for me it was the very last piece of the puzzle after the surgery. What kind of oncologist are you meeting next week, do you know if it's a medical oncologist or breast surgeon? Do you know anything more about the size/grade of your tumor?",
      "MessageIndex": 2,
      "PostDate": "24/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868516",
      "Title": "Er+ Pr- Her2- Tagevans Murfy"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 16, 2019 02:23PM Salamandra wrote: Hi TaRenee! So glad you are finally done with surgeries. I think I had a simpler path than you but I am now five months out from surgery and 2.5 months out from radiation and surprised by how tired I continue to be. It's pretty frustrating and not good for my work. Cindr, good luck with your decision! I really believe the doctors would not offer you the choice unless they believed they were both good options, and if they didn't see an easy way to choose between them, no wonder it's a hard choice for the patient who has so much less knowledge and experience with cancer! Whatever you choose, it will be the right option. Love the graphics!",
      "MessageIndex": 15774,
      "PostDate": "16/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jun 3, 2019 06:21AM Salamandra wrote: That sounds like my protocol. Through my surgeon's office, I also have imaging every 6 months (hopefully, we are trying to get the insurance to cover rotating MRI and mammogram).",
      "MessageIndex": 2,
      "PostDate": "03/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/871869",
      "Title": "Is my oncologist doing everything possible LBG10 exbrnxgrl"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Dec 30, 2018 07:55PM Salamandra wrote: Was your ultrasound before or after the biopsy? I was told that the biopsy can make the tumor look bigger. My biopsy called my tumor 1.3cm, and on the MRI it looked more like 3-4cm. Surgery found 1.8cm. The surgeon said that she does not trust post-biopsy imaging for size. And of course the biopsy wasn't quite accurate either. I think you can't really know until they take it out.",
      "MessageIndex": 1,
      "PostDate": "30/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/869080",
      "Title": "Size difference in tumor between ultrasound and MRI... kec1972 mammalou"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 24, 2018 09:01PM Salamandra wrote: It sounds like you have a really good team on the job. That's so important. There is a lot of good community, support, and information here. If you find an old thread that seems relevant to your situation or questions, you can post on it and it will come to the top again, so people will see it even though it may have been dormant for a while. ",
      "MessageIndex": 4,
      "PostDate": "24/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868516",
      "Title": "Er+ Pr- Her2- Tagevans Murfy"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 15, 2019 05:45AM Salamandra wrote: I have seen people find it useful to get multiple opinions from multiple plastic surgeons. Another question I would have is whether it might make sense to do just the lumpectomy and radiation now and revisit the plastic surgery after recovery - a year or so down the road. This could be especially good if you end up dealing with any surprises from the pathology, re-excisions, etc. Then the plastic surgeon could deal with the reality of the impact of lumpectomy and radiation on her breast, instead of guessing and anticipating.",
      "MessageIndex": 6,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871545",
      "Title": "Lumpectomy + Oncoplastic Surgery (Reduction & Lift Both Breasts) Aragorn Aragorn"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 11, 2019 09:00PM Salamandra wrote: That sounds great justme1964. When is your appointment at MSK? That is where I'm being treated and I've been very happy with them. My tips for you are that the hot chocolate from the machines is surprisingly good, and that their patient portal/app is great and totally worth the time to set up.",
      "MessageIndex": 64,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 22, 2019 02:54PM Salamandra wrote: Good luck with your appointment tomorrow Just me!",
      "MessageIndex": 82,
      "PostDate": "22/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Feb 7, 2019 04:39PM Salamandra wrote: I was pretty nervous. Before the lumpectomy/SNB, I had never had surgery before or been put under. Are you having a lumpectomy or a mastectomy? For me the surgery ended up going exactly as planned, and everyone was really nice. The recovery (from the SNB mainly) has been annoying but totally bearable. And it turns out I loved being sedated (I'm a terrible sleeper) which is a little weird but w/e! My surgeon gave me a print out with all the instructions on it and it was helpful to me to read it over and be sure of what I was doing. Also it might help to remind yourself how incredibly effective surgery is at treating cancer. Like huge. And so effective they do it for 80+ year olds. Hang in there! If the anxiety is interfering with your life in an unmanageable way, you can ask for a prescription for Ativan or something similar. I think it's pretty common.",
      "MessageIndex": 1,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869739",
      "Title": "Starting to get very nervous bam320 applejuice"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 19, 2018 05:42PM Salamandra wrote: That's great that you could get the surgery so fast! I hope it all goes smoothly and well! The waiting is so hard, and there's really not much to do. I got some anxiety meds from my doctor that definitely helped. For a while, throwing myself into work helped. Venting to my friends, etc. It felt like ages waiting for the pathology to come back. Do what you can to take your mind off things and come chat with us here when you can't! Hopefully you'll at least get a couple restful days in surgery recovery.",
      "MessageIndex": 4,
      "PostDate": "19/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868434",
      "Title": "Diagnosed last week, operation tomorrow, feeling scared. WorryThePooh WorryThePooh"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 18, 2019 10:14PM Salamandra wrote: Great news!",
      "MessageIndex": 4,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870160",
      "Title": "Waiting for biopsy Lynn721 Chloe2"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 27, 2019 10:56AM Salamandra wrote: Hey Deb65, Sorry to hear that! Yes, it is so hard, the stage you're in. You know something, but it feels like the stuff you don't know is the most important. And that's true. I also remember feeling like I couldn't wrap my head around it. What I will say to you that I wish someone had said to me when I was at your stage is:",
      "MessageIndex": 4,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870634",
      "Title": "Today is the day Deb65 pingpong1953"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 4, 2019 11:34AM Salamandra wrote: Waiting for results is so hard. Next Tuesday, do you mean the 8th? I hope it comes with lots of good news! If it says 9mm tumor, it sounds to me like that was the actual tumor size. But you may have to wait for final pathology to know for sure. In any case, under 1cm and under 2cm are both considered early stage, so it would not change her staging. Usually women get 'neoadjuvant' - meaning before surgery - chemo if the tumor is very large or if it has certain hormonal properties. I could be wrong but I think this is most likely for triple negative cancer, where ER, PR, and HER are all negative. For hormone positive cancer, especially as early as your mom's, there's a good chance she won't need chemo at all, and they need to take out the tumor and test it to check. Staging can definitely change after surgery but it can also stay the same. Mine stayed exactly the same - my surgeon made an accurate prediction. In some cases, staging can actually get better after surgery and more testing. For example, if someone has a large tumor (I think up to 5cm) but surgery shows clear lymph nodes and their oncotype score comes back 10 or lower, then under the new guidelines they would be stage Ia, even though before surgery a tumor that size would be at least stage II. Remember that staging is prognostic. It's predicting what may happen in the future. So even if staging goes up, it doesn't have any certainties. Similarly, even if it stays the same, it's no guarantee that your mom will be safe forever. This brush with mortality is hard for us to wrap our heads around. But it sounds like your mom is absolutely early stage. She isn't dying now. Eventually she will, we all do. Enjoy each other in the mean time! Hang in there!",
      "MessageIndex": 2,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869150",
      "Title": "Does the staging change often after surgery??? (Mastectomy) Juleseyes Juleseyes"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Mar 28, 2019 06:02AM Salamandra wrote: I think that if you've read through Beesie's amazing post about lumpectomy and mastectomy considerations, you've informed yourself about the risks and benefits, and your heart wants a mastectomy, you should do a mastectomy. We women have all different kinds of relationships with our bodies, with our breasts, with illness. Hearing about others' experiences can be helpful but it only takes you so far. I suspected I would have a genetic mutation before I got genetic testing ten years ago. I suspected the doctor would recommend mastectomy to me (completely unfounded) when I was diagnosed this year. At both times I thought I had mentally and emotionally prepared myself to lose my breasts. And maybe I had done as much as a I could. But both times, when the doctor said I could keep them without additional risk, what I felt was great relief. That tells me that my heart didn't want a mastectomy if it could be avoided. Even if it meant extra stress and hassle with screening. The science around breast cancer is pretty good now but it is not perfect. We still have to make hard choices with uncertain outcomes, that we will pay for one way or another. I think that the head plays a vital role in gathering and evaluating information and evidence. But ultimately it has to be the heart's decision. Because your whole body has to live with the outcome. I guess that a prophylactic mastectomy is probably a bigger deal than a prophylactic tonsillectomy or appendectomy. But to be honest, I wonder how much surgically and medically the risks differ from something like a face lift or facial cosmetic surgery - like, an elective operation directly on a person's face! That many people do voluntarily. And there is so much more *health* justification for mastectomy. Anyway I guess that is all kind of a long way of saying, use your brain but listen to your heart.",
      "MessageIndex": 14,
      "PostDate": "28/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/870640",
      "Title": "Would you seek a Prophylactic bilateral mastectomy if...? Martha615 Dm39"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 18, 2019 07:08AM Salamandra wrote: That approach sounds deeply strange to me. AFAIK, it is generally considered very helpful for radiologists to have access to prior records to make comparisons and to know what/where they are looking for. A very small lump can still be cancer, so it makes sense to be concerned and to follow the appropriate steps for confirming or (more likely) excluding cancer. To me, that would include making sure the radiologists doing the mammogram and review have as complete information as possible to screen it...",
      "MessageIndex": 1,
      "PostDate": "18/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871602",
      "Title": "Am I going about this the right way? dannysgirl djmammo"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Apr 2, 2019 01:38PM Salamandra wrote: Hey cecyc, Sounds like grief and survivor's guilt to me. The waiting is terrible and will bring out anything else that's lurking in your psyche. Take care fo yourself and let yourself feel how you feel. No way out but through.",
      "MessageIndex": 11,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870751",
      "Title": "How do you cope? cecyc cecyc"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Jan 14, 2019 08:56PM Salamandra wrote: I'm so sorry you have to deal with this on top of health insurance issues. Are you covered again now? Might you be able to get in for an appointment sooner with an ob/gyn? They are usually considered 'primary care' by insurers and are a great first step for breast exam and referral. Try not to make yourself crazy worrying. Our bodies are so much more complex than we are ever taught.",
      "MessageIndex": 2,
      "PostDate": "14/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869346",
      "Title": "New here benni benni"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Apr 28, 2019 11:19AM Salamandra wrote: Hi Emmeline, Can you get into your family doctor, obgyn, or a dermatologist? If they think what they see is suspicious for IBC, they should be able to get you in for a punch biopsy quickly. If not, they should be able to calm your mind and suggest alternative diagnosis and treatment. Try not to worry too much. We get to a certain age and think we know and understand our bodies. But actually with our hormones and aging, we are always changing, and our bodies can spring unpleasant but also not serious surprises on us. Whatever is going on with your breast, it is worth following up because it is impacting your quality of life. But chances are it is something much less serious/dire than IBC.",
      "MessageIndex": 5,
      "PostDate": "28/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871242",
      "Title": "Clear mammo and ultrasound but new symptoms - worried Emmeline Salamandra"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 14, 2019 05:47AM Salamandra wrote: Hey Sam183, I think breasts do a lot of strange and surprising things that are not actually dangerous, and also that it's good that you have your biopsy coming up anyway. I think in your shoes I would make a very clear note of when and exactly where you are seeing the symptoms, and share it with your doctors with the question of whether this could be related to the lump that's being biopsied or whether it should have a new initial exam/US to make sure it gets evaluated. Good luck! The waiting part is so hard!",
      "MessageIndex": 3,
      "PostDate": "14/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871506",
      "Title": "Worried but trying to relax Sam183 Sam183"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "Nov 7, 2018 07:36PM Salamandra wrote: I'm so glad you're advocating for yourself. Follow all the leads you get, including the ones you're skeptical of. I hope they are completely correct and it's something much less serious. But don't give up until *you're* satisfied on your suspicions. Healthcare for women can be terrible, and for women of size even more so.",
      "MessageIndex": 11,
      "PostDate": "07/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868172",
      "Title": "Purple splotches, young and fat, IBC?? BbyPop BbyPop"
    },
    {
      "AuthorID": "Salamandra",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281631/profile",
      "Content": "May 21, 2019 07:01PM Salamandra wrote: Hi ik0106, You just got news no one wants to hear. It's ok to take some time to be wrecked about it. Cancer sucks, even in the best case scenario. Thank goodness, you got a good case scenario. I bet you'll feel better after meeting with the surgeon and learning your next steps. It will be a haul and a slog and a pain, but you will manage and you will find your new equilibrium. Are you all right with health insurance and sick leave?",
      "MessageIndex": 2,
      "PostDate": "21/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/871656",
      "Title": "Just Diagnosed and very scared ik0106 Sofiejo"
    }
  ]
}