{
  "AuthorID": "Sam13",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
  "Posts": [
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 6, 2016 10:21PM Sam13 wrote:  Welcome to all the newcomers. Sorry that you are going through this, but this is a great place for support! Emily & I went to her chemo class this morning. She starts chemo tomorrow. I'm really concerned she'll have an allergic reaction to all the meds because she has a lot of food allergies. Fingers crossed on that. Looks like it'll be an all-day ordeal. They told us to expect to be there from 08:30-3:30. She'll also get the neulasta injector patch along with imodium, compazine, aprepitant, and more decadron. The nurse gave us a link to a handy side effects tracker in case any of you are interested: http://www.cancer.org/treatment/treatmentsandsidee... Bagsharon - she got the same instructions as you for the dexamethasone tablets. Think happy thoughts!",
      "MessageIndex": 312,
      "PostDate": "06/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 9, 2016 05:31AM Sam13 wrote: Day 3 since Emily's 1st round with no real side effects yet. The Neulasta patch worked as advertised and injected the medication right on schedule last night. Still taking Claritin 24 to head off the expected bone pain. Hopefully that works. She'll take her last round of Decadron this afternoon. She's drinking tons of water, eating oatmeal, prunes, probiotic yogurt, and taking Colace to stay regular and flush out the chemo. It appears to be working. We are anticipating the worst to start this weekend based on what I've read in last year's Sept 15 thread (and elsewhere). If you have the time, I'd recommend following along with that thread from a year ago. It appears to mirror how things are progressing with this group. And it is encouraging to see how those ladies supported each other through the process and then emerged triumphant at the end as I know you all will too. Healing thoughts to all!",
      "MessageIndex": 390,
      "PostDate": "09/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 18, 2016 05:13AM Sam13 wrote: Our daughter sent this link this morning. You've probably read most of this before, but it is good dieting advice. http://www.webmd.com/cancer/common-cancers-16/lung... Hope you all are well this morning.",
      "MessageIndex": 582,
      "PostDate": "18/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 25, 2016 04:48PM - edited Sep 25, 2016 08:01PM by Sam13 Good morning, I haven't posted in a while, so I thought I'd check in. Welcome to all our newcomers, sorry we're meeting this way. We're here for you! Emily shares your hair loss grief. She wanted me to post a picture of her scalp 19 days post 1st chemo, so here you go:  Not too bad, but it is coming out more and more every day. After she showered this morning, it looked like a squirrel had built a nest in there. We picked up another wig and a couple of do-rag looking thingys yesterday. She wore the wig out of the shop and around town while we made several stops. Completely rocked it! 2nd round of chemo is Wednesday, labs on Tuesday. It'll be interesting to see if the SEs follow the same pattern. Hope so, because we're little better prepared this time. Emily has been feeling pretty \"normal\" for about the last week, minus the shedding of course. She never really had a lot of the taste bud issues some of you have had. I wonder if that is because she sucked on ice chips the whole time she was doing the Carboplatin. I know she plans to do that again. She lost a little weight early on, but regained it once the SEs subsided. A couple of you had mentioned having heartburn problems earlier. One of the things Emily & I did at the advice of a doctor (a couple of years ago) was to lift the head of our bed off the floor about 4 inches, so that we sleep on a bit of an incline (we just used a couple of scrap pieces of 2X4 lumber). It has really helped a lot. Seq - so glad you had a better port experience this time! ACS - your husband is right, this will all be just a memory before you know it. Have you noticed how time seem to go by faster the older you get? I sure have. Bcrohde - Emily has not noticed any nail problems yet. She is using the tea tree oil. Not sure if that is really why, because she has not been using it consistently (doesn't like the smell). She bought some baby oil yesterday to cut it with to see if that helps. misslil - sending positive vibes your way. We're watching you close since you're on the same regimen and a bit ahead of Em. Hope your SEs are easier this go around. Welp, I could sit here all day and write a novel, but that yard work isn't going to do itself. Our garden has turned into a jungle since all this started. Wishing all a great day and mild SEs going forward! Stay strong! ",
      "MessageIndex": 708,
      "PostDate": "25/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 6, 2016 09:13PM - edited Oct 7, 2016 01:08AM by Sam13 Day 9 after Emily's second chemo round and she is doing really good. The SEs pretty-much have followed the same pattern as the first round, except her taste went south earlier and she hasn't been as fatigued or had much D to speak of. Let's hope the rest of them go this well! GonnaBePoz - Emily's doctors prescribe Decadron the day before, and 2 days after her infusions. So far, she hasn't had any reactions during her chemo sessions. Hope you all experience minimal SEs in the days ahead and have a great weekend! Are any of you in the path of that hurricane? We were, but it looks like it's going to miss us now. Whew!",
      "MessageIndex": 902,
      "PostDate": "06/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 19, 2016 11:56PM - edited Oct 19, 2016 11:57PM by Sam13 Emily completed #3 of 6 today (half way there, woo hoo!). It was kind of a long day, which was a bit unexpected. The nurse told us they had to remix her meds to increase the dosage, but It wasn't clear why. We see her onc on Friday, so we'll get clarification then. Otherwise, everything went smooth. Her port worked like a champ. I totally agree with our visitor above. If you aren't using numbing cream for your port prior to them sticking you, you should be. I see lots of talk about head gear. Emily has really preferred to just go with a frilly do-rag thing she got from the wig store, even though she has several different options to choose from. It doesn't matter much to me as long as she's comfortable. Once the weather gets a little cooler, I suspect she'll opt for the wigs more. Time to print out another SE tracker. Time marches on, stay strong!",
      "MessageIndex": 1038,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Nov 10, 2016 04:29PM Sam13 wrote: Emily completed her 4th treatment yesterday. She has felt pretty good for the last week, just like previous rounds. They added a 2-hour infusion of magnesium because they said her numbers were slightly off from her labs the day before. They also gave her a prescription for it for the remainder of her treatments. I looked up the effects of having low magnesium levels and two of the SEs are muscle twitching and cramps in the feet and toes, both of which she has had. Her Dr said one of the possible SE's of adding magnesium supplements is the big D, so we'll be watching that closely this round. Hahlyn - Emily's 3d round followed the same pattern as the first two. Some D & C between days 5-10, and issues with neuropathy, but overall, pretty manageable. Today is a great day. Our daughter and two granddaughters arrived from Colorado earlier. We met our newest granddaughter for the first time. She is the mellowest baby you could ever ask for! Congrats to all of you who are finishing the first segment in your treatment. Let's hope the the hardest part is behind you! Stay strong and have a wonderful Veterans Day weekend. I know we will!",
      "MessageIndex": 1206,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 18, 2016 03:18PM Sam13 wrote: Lynn - Emily is getting her 3rd TCHP infusion tomorrow (blood draw today). The 2nd one's SEs were similar to the first, maybe a bit easier. The first time around, she had a few days with pretty bad stomach pain with C & D. This time, very little pain, no C, and almost no D. We were told the fatigue would be cumulative with each session, but that didn't happen after the 2nd one. The main thing she is dealing with is her scalp started breaking out pretty bad after her hair fell out. She got that under control with an antibiotic cream prescribed by one of her nurses. That has healed up pretty good, but her scalp is really itchy now. She's going to try Argan oil to try to counter that. Hope your 2nd one goes well for you!",
      "MessageIndex": 1019,
      "PostDate": "18/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Dec 1, 2016 12:28AM - edited Dec 1, 2016 12:29AM by Sam13 TCHP #5 was today and all went smoothly. We spoke to Emily's MO about the neuropathy about 10 days ago and he recommended stopping the B6 supplement. In some cases, extra B6 can actually make it worse. Emily stopped, and within just a couple of days, she saw significant improvement. Coincidence? Maybe, but we'll take it. Em has felt pretty good for that last week and Thanksgiving was great. Stay strong ladies! One more to go!",
      "MessageIndex": 1310,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Dec 10, 2016 01:15AM Sam13 wrote: Ditto for Emily. She gets all 4 through 6 treatments, then continues Herceptin every 3 weeks until next August. She is already almost back to \"normal\" at day 10 after her 5th round, so she should finish on schedule on the 21st. As far as the eye twitching, it may be caused by a magnesium deficiency. Before Em was told her levels were low (round 4) and got a prescription, she had bad eye twitching. Now she takes 400 mg twice a day and the twitching is gone. Might want to ask your MOs. Can't remember which chemical strips your body of magnesium, but it's most likely the taxotere or carboplatin. Have a great SE-free weekend!",
      "MessageIndex": 1350,
      "PostDate": "10/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Dec 21, 2016 04:01PM Sam13 wrote:   Last chemo done today!",
      "MessageIndex": 1419,
      "PostDate": "21/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Apr 28, 2017 10:58AM Sam13 wrote: Good afternoon, Emily & I went in for her 3-month follow-up with her MO on Tuesday. She also had her annual physical last week, so they did lots of blood tests. Her MO said everything looks good and to come back in 90 days. She is still doing the Herceptin of course, so he ordered a MUGA scan to check heart function. She is also doing a bone density scan on the same day, which was ordered as part of her physical. So far, everything is going great. Her hair is long enough to where she has put all the head gear away, she's feeling much better, the neuropathy appears to be fading, and her surgery scars are healing surprisingly well. She is spending more time in the garden too! Hoping you all are feeling better. I know some of you are still dealing with some significant challenges. Have a blessed weekend! Sam",
      "MessageIndex": 1751,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Aug 29, 2016 07:10PM Sam13 wrote: Just got off the phone with the hospital. Looks like Emily will have the CT scan tomorrow and a port placed on Friday.",
      "MessageIndex": 130,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 7, 2016 11:22PM - edited Sep 7, 2016 11:39PM by Sam13 This is Emily.  We went in this morning for chemo day 1. Everything went very well and she had no reactions to the meds. They plugged into her port at around 09:30 and we finished about 4. They said it would go much quicker next time. Emily sucked on ice during the Taxotere in the hopes it'll spare her tastebuds a bit. They installed the neulasta patch and gave us the anti-SE meds before we left. Now we wait and watch. 1 of 6 done! Stay strong!",
      "MessageIndex": 340,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 9, 2016 09:54AM Sam13 wrote: Angela - Emily was given the choice of having the surgery after the chemo, but she was adamant she wanted the tumor removed as soon as possible, so that's the route we took. I've seen many posts on this site where the chemo went first and the ladies were able to see the tumor shrink and/or disappear during a follow-up mamo. Have a great weekend!",
      "MessageIndex": 396,
      "PostDate": "09/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 17, 2016 06:57AM Sam13 wrote: Good morning! It's day 11. Emily is doing well and continues to improve with a few exceptions. About 3 days ago she noticed she was experiencing burning urination. We went to the MO and they had her tested for a UTI (which came back positive). She is now on antibiotics for 3 days to clear that up. She's also developed an annoying runny nose, she's detected a bit of neuropathy in her fingertips, and still has the D (and some fatigue) intermittantly. Her taste is returning to normal and she is sleeping well. No shedding yet. She is in a very good mood this morning. We're headed to Raleigh this afternoon to look at wigs. Welcome to our new friends. Sorry you are going through this, but you are definitely in the right place for support/info. Lmencken - Thank you for your kind words. I could do nothing less. I figure I need to do everything I can to reduce Emily's stress levels so she can concentrate on getting better. seq24 - Emily hasn't experienced severe depression (or even cried), but from all the reading I've done about BC and treatment, this is such an individualized struggle. I read that one good way to fight bouts of depression is to keep yourself very busy. It seems it is during the quiet times, or when we are alone, we tend to focus on the what-ifs. That is such a dark place. Emily and I just try to focus on knowing she will get through this. All of you will. Any negative thinking is simply counterproductive. Losing one's hair is so traumatic. It is interesting how so much of our identity is tied to self-image. Don't worry, your hair will grow back. This is all temporary. Angela - Sorry to hear of your SEs. Hope you are feeling better today. Have your taste buds returned to normal? Smilethrupain - Ditto to you. Have you taken any Claritan for the bone pain? Emily started taking it before her first infusion and stopped taking it last night. That was one SE she was really hoping not to get. CC2016 - Emily is still gargling with Biotene & a baking soda/water rinse. So far, no mouth sores or thrush. She'll continue that all the way through treatment. Bagsharon - Laughed at your Milk of Magnesia story, glad it turned out ok. Emily does a lot of walking and works in the garden as much as possible. It helps with so many aspects of this process. MFalabella - ACS74 is right, take it one day at a time and focus on the good things in your life. Everyone is going to get through this. misslil - Hoping your port issues smooth out. I know they flushed out Emily's after her infusion, but now I'm wondering if she'll have to deal with something like that down the road. Lizbeth - You are a wealth of information. Keep it coming! Ware - Glad to hear your SEs have been minimal. I didn't know the compazine caused the brain-fog effect. Emily has a script for that, but hasn't had to use it, yay! GonnaBePoz - Emily has been drinking tons of water too. I really think that has kept her SEs to a minimum. Welcome again to the group. Sorry for this being a bit long, but I haven't been on for a while and this board moves fast! Wishing you all light SE's and that everyone enjoys the weekend! Keep thinking positive thoughts!!",
      "MessageIndex": 568,
      "PostDate": "17/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 27, 2016 11:32PM Sam13 wrote: Here you go OceanSky:",
      "MessageIndex": 738,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 2, 2016 11:21PM Sam13 wrote: Emily took the plunge today. This is a shot of her after the first shave, but she decided she wanted it even shorter because of the bald patches, so I ended up taking more off. She's taking it all in stride, but I have to say, it was a totally surreal experience for me. Having said that, I think I may have missed my calling as a barber.  She is still feeling pretty good after infusion 2/day 5. We spent the morning working in the garden and I think I was more tired afterwards than she was. Hope you all have a great evening and an even better week ahead!",
      "MessageIndex": 832,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 8, 2016 04:53PM - edited Oct 8, 2016 04:55PM by Sam13 We are fine so far. There has been a ton of rain but we don't live in a flood zone. I'm more concerned about trees coming down in the wind. They are forecasting 50 mph gusts as the storm moves out of the area. Combined with the waterlogged ground, there is a good chance more will come down. Thanks for thinking about us!",
      "MessageIndex": 944,
      "PostDate": "08/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 17, 2016 01:02PM Sam13 wrote: Good morning! Hope you all had a good weekend. We sure did. Have any of you noticed any changes in your fingernails? Emily goes in for her 3rd round on Wednesday and hasn't had any problems with that yet. Maybe it depends on which regimen you're on.",
      "MessageIndex": 1012,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Nov 14, 2016 02:42PM Sam13 wrote: Neuropathy seems to be the biggest problem Emily is dealing with. She is at day 5 after her 4th treatment, and it is already bad in her feet and hands. The L-Glutamine & B-6 don't appear to be helping. I'm worried this could end up being a long-term or permanent thing for her. We see her MO on Friday, so we'll bring it up again and see if they should adjust her schedule. She wants to stay on track, but I've read that delaying treatment might help. ",
      "MessageIndex": 1225,
      "PostDate": "14/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Feb 2, 2017 05:39PM - edited Feb 2, 2017 05:40PM by Sam13 Emily will keep her port in for 2-3 years per her MO's recommendation. He said if her cancer comes back, it'll most likely be within 2 years after she completes the herceptin. Emily doesn't mind because it really doesn't bother her that much. If there is a reoccurrence, at least she wont have to go through the install again... and her port has been working well. Sam",
      "MessageIndex": 1592,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Mar 29, 2017 05:03PM Sam13 wrote:  Hi all, Emily wanted me to show you a current picture of her hair 3 months post-chemo. Today was the first time she went out in public without any type of head cover. It is coming in nicely and is softer and finer than it was before. She finished radiation about 3 weeks ago. She had some pretty bad burns, but it has mostly healed now and the discoloration is fading. She used Aquaphor for moisturizing at first, but was prescribed Silvadene after the burns got worse. She is back to Aquaphor now. Her biggest complaint is still the neuropathy in her feet. Her hands are back to normal. She is just down to Herceptin every three weeks till August now. Stay strong, stay positive! Sam",
      "MessageIndex": 1746,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 11, 2017 11:54AM - edited Sep 11, 2017 04:28PM by Sam13  Good afternoon, This is Emily with our oldest granddaughter from a trip we took to Vermont in June. She finished her last Herceptin treatment last week and now only has to go back every 6 weeks for a port flush. She'll be keeping that in for at least two years. Given her aggressive form of cancer, her MO recommended it. He reiterated at her last appointment that if the cancer is going to come back, it'll most likely happen within that time frame. During her MO visit, she mentioned to her doctor that she was having pain in her rib cage below the right breast and he was concerned enough about it to order a scan. She had that done the following week and it came back normal. Whew! She also had both breasts mammo'd a couple of weeks ago and all the tests came back normal for that too. Her hair has grown out nicely and people are always complimenting her on how nice it looks. So, for now, she is back to normal. That seems weird to say after all she (and you all) went through over the past year. We're headed to Colorado Springs the first 2 weeks of next month to visit our youngest daughter and son-in-law. We plan to do lots of exploring as neither of us have ever been there. Of course, seeing two more of our grandchildren is an awesome bonus! Hugs to all! Sam",
      "MessageIndex": 1813,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 31, 2017 05:51PM - edited Oct 31, 2017 06:09PM by Sam13  Good evening everyone, I just wanted to pop in and let you know I'm thinking about you, especially those who are struggling with unknowns or have received difficult news. Stay strong! Emily continues to improve as we celebrate each new sunrise. We were told by our youngest daughter yesterday that they are expecting their 3rd child and our 5th grandchild. This is a picture from our trip to Colorado to visit them 2 weeks ago (Emily is holding Amelia with Isabelle standing next to her). We had such a great time! We both know, no matter what lies ahead, we have been blessed many times over. May God hold you in his embrace. Hugs to all! Sam ",
      "MessageIndex": 1839,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Aug 27, 2016 02:03AM - edited Aug 27, 2016 02:04AM by Sam13 Hello. Would you all mind if I join your group? My wife of 30+ years starts chemo 7 Sept. English is a second language for her, so I've been doing all the research and a good bit of the communicating for her. I discovered this website shortly after her dx and have found a wealth of information here. I started lurking a couple of weeks ago on the ladies who started their journey in Sept 15 (a couple of them posted above), because I wanted to see what the next year (and beyond) will hold for us. The strength, humor, and perseverance displayed by that group has been absolutely inspiring and has given me much hope for my wife's future. I wish the very best for each of you as we travel this difficult road together.",
      "MessageIndex": 87,
      "PostDate": "27/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Aug 28, 2016 04:52PM Sam13 wrote: When my wife (Emily) and I met with her oncologist last Friday, we heard pretty-much what we expected with some exceptions; she'll have 6 rounds of chemo (we were hoping for 4), they recommended keeping her port in 2-3 years after her last targeted therapy infusion, the Herceptin treatments would last until next year at this time, and that she'll be getting a CT scan. We debated the pros/cons of the scan, because it isn't routinely performed in Emily's situation, but we figured if there is something else out there, we'd rather know early. We went to the wig shop again yesterday and picked up some scarves, hats, and one halo wig. Once we get approval from our insurance, we'll pick up another halo and a hat (with built-in hair) we ordered, and a couple of really nice wigs. It is amazing how realistic they look. They did a great job of matching up hair color, style, and fit. Oh, I forgot to mention, Emily cut her hair very short on Friday (it was shoulder length) in anticipation of losing it. She is taking it all in stride, hasn't cried once yet. I suspect that'll happen soon enough though. I love her so much! nayda - love the commentary, sorry for your difficulties! misslil - looks like your second regimen is similar to my wife's. MF - here's to hoping your port starts feeling better, Emily's goes in next week.  Prayers to everyone for smooth treatments and minimal SE's!",
      "MessageIndex": 107,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 2, 2016 06:38PM Sam13 wrote: Emily had her port installed this morning. The procedure went pretty smoothly minus her having some slight nausea afterward. While we were there they told us her CT scan came back clean, YAY!! Chemo starts Wednesday. Have a great weekend all!",
      "MessageIndex": 220,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 26, 2016 09:26PM Sam13 wrote: Hahlyn - Totally agree with Bcrohde. You should feel better in a couple of days and progressively improve until you're back to your usual routine. By the time you do your next infusion, you should feel \"normal\". Emily has definitely regained her strength and is ready for her next one on Wednesday. Then the rollercoaster will start all over again. But just keep remembering; the end is in sight! Hope you feel better! ",
      "MessageIndex": 716,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 28, 2016 10:00PM - edited Sep 29, 2016 10:50AM by Sam13 Emily completed round 2 today. Everything went smoothly. Here she is having a mango Italian ice during the Carboplatin:  Couple of things I want to share: During our discussion with the MO, we told him about Emily's issues with the D and how she had some pretty severe stomach pain during it. He told us the stomach pain may be a SE all on its own and may be caused by chemo-induced Colitis. He said if it happens this time around, he wants a call, and that (TMI alert) she may need to bring in a sample. He also said severe Colitis can be life-threatening, which is why I bring it up to you all. We just thought her pain was caused by the D because the Imodium helped relieve it and it went away about day10. We were also visited by a dietician while we were there. She gave us a couple of nice resources for fighting SEs by eating certain foods. The first is a book called, \"Eating Well Through Cancer\". It is full of great recipes for countering D, C, low WBC, and mouth sores/pain. It is available on Amazon for free. All you pay for is shipping. Just make sure you click on the \"other sellers\" tab. The dietician also gave us a 68-page printout called, \"Eating Hints - Before, During, and After Cancer Treatment\". It is available as a free downloadable .pdf/Kindle/ePub at the National Cancer Institute's website here: https://www.cancer.gov/publications/patient-educat... It provides information about dealing with SEs, recipes, and helpful websites. It is laid out in a easy-to-understand format that will point you to ways to fight your specific side effects. Sorry to read about the difficulties a couple of you have had, but glad everything turned out ok! Bagsharon - you look marvelous! Smilethrupain - Emily got this from her nurse for dry skin:  She says it works great! It is available online for about $5. Good luck to everyone who will be starting chemo soon and those of you who are into round 2 (or 3?)! Take each day as it comes and stay positive! Think MILD SEs!",
      "MessageIndex": 754,
      "PostDate": "28/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 2, 2016 01:12AM Sam13 wrote: Ok, so day 4 after the second infusion for Emily and she is doing really good. No real SEs thus far, but if it follows the same pattern as last time, she'll get hit with the fatigue and the D within the next couple of days. The steroids have given her some insomnia, but she is tolerating it pretty well. Her hair is so thin now that she says she wants to shave it tomorrow. She is so brave. You all are. You'll all be ok at the end if this though. You have to believe that. I know I do. I cannot imagine my life without Emily. All of you have people around you that feel the same way. You must stay positive and fight for them, but more importantly for yourselves. The odds are very much in your favor. Focus on that when you are feeling down. It will give you strength. This is only one short chapter in your/our lives. There will be many, many more.",
      "MessageIndex": 815,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 27, 2016 05:15AM Sam13 wrote:",
      "MessageIndex": 1107,
      "PostDate": "27/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 27, 2016 08:58AM Sam13 wrote: Sorry to hear that. Your MO has no suggestions?",
      "MessageIndex": 1109,
      "PostDate": "27/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 31, 2016 11:09AM Sam13 wrote: Well, here we are 13 days out from Emily's 3d treatment and everything is going as well as can be expected. She and I spent most of both days in the garden during a beautiful, warm weekend here in NC. She continues to struggle with neuropathy in her hands and feet, but it started getting a little better yesterday. The problem is that the severity of the symptoms is getting worse and lasting longer with each infusion. She has started the L-Glutamine (along with the B6). Hope that helps. I'm massaging her hands and feet at least once a day to keep circulation going as well. It is the same with her taste buds being out of whack too. Starts earlier, lasts longer. She has the eye twitching thing mentioned earlier by a couple of you. We also thought it wasn't an SE from chemo. I guess we were wrong. Our youngest daughter is flying in next week to spend a few months with us to help around the house. She has two daughters, aged 4 and almost 2 months. We are really looking forward to that! Best to all of you!",
      "MessageIndex": 1142,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Dec 3, 2016 02:10AM Sam13 wrote: I should have mentioned earlier, we had Emily's initial consult with her radiologist on Tuesday. She'll be going in 5 days a week for 6 weeks starting on January 9th. Seems like a pretty straight-forward process with few side effects. The treatment sessions only take a few minutes too. It'll be nice to get past this last round of chemo on the 21st. Lynn - sorry to hear about your test results. I haven't heard about that type of test. When we first started this journey, Emily's doctors advised against a mastectomy and said recent studies have shown lumpectomy's are the preferred procedure in many cases, including hers. Perhaps your MO has something else in mind. Please keep us posted on what you find out. Sending positive thoughts your way! Have a great weekend and stay strong everybody!",
      "MessageIndex": 1319,
      "PostDate": "03/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 11, 2016 08:37AM Sam13 wrote: Just a quick update on Emily: today is day 5 since her first chemo infusion. Over the past couple of days she has detected a change in her sense of taste, some mild constipation and dizziness, as well as feeling a bit fatigued this morning. Generally speaking, not too bad. No bone pain, fever, or nausea yet, so that's good. Only taking the Claritin now and keeping up with the SE log to see if the next round follows the same pattern. I neglected to mention in my earlier post that our insurance directed us to a different wig shop than the one we requested. We went to the one they recommended, which turned out to be in a seedy part of town and only sold cheap, low-quality wigs. I'll re-engage with them tomorrow to see if we can make a different arrangement. If not, we'll just pay out of pocket for the one she wants. Welcome Sr2295, you'll find this group is a great source of information and support! Yes, Emily got the Neulasta patch also. kd - Emily is getting Perjeta, Herceptin, Taxotere, & Carboplatin (in that order) during each infusion. She'll get just the Herceptin every 3 weeks after her 6th chemo round. That'll continue for a year. Sorry to hear about all the difficulties with the ports and the infection. It'll smooth out, don't worry! Chin up!",
      "MessageIndex": 439,
      "PostDate": "11/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 13, 2016 10:37AM - edited Sep 14, 2016 04:01PM by Sam13 Good afternoon, I have good news and bad news. Bad news first. Emily was hit with severe fatigue yesterday/today (days 6 & 7), and started experiencing the 'Big D' and stomach pain pretty bad yesterday. Seems like this is a pretty common SE. She has been having scalp pain/itching and a low-grade fever too. She took Imodium for the D last night and is starting to feel better today (less fatigue too). She washed and conditioned her hair this morning and applied some coconut oil to her scalp to relieve the itching, but the pain is still there. She says it feels like a bruise. I can't help but think the hair loss is right around the corner. Speaking of hair, that's the good news. Our insurance company re-referred us to a much nicer wig shop, so we'll be taking a drive up to Raleigh this weekend. Welcome OceanSky! Here's a cookbook tailor-made for this situation that Emily & I will be getting: The Cancer-Fighting Kitchen - \"It features 150 science-based, nutrient-rich recipes that are easy to prepare and designed to give patients a much-needed boost by stimulating appetite and addressing treatment side effects including fatigue, nausea, dehydration, mouth and throat soreness, tastebud changes, and weight loss. A step-by-step guide helps patients nutritionally prepare for all phases of treatment, and a full nutritional analysis accompanies each recipe. This remarkable resource teaches patients and caregivers how to use readily available powerhouse ingredients to build a symptom- and cancer-fighting culinary toolkit. Blending fantastic taste and meticulous science, these recipes for soups, vegetable dishes, proteins, and sweet and savory snacks are rich in the nutrients, minerals, and phytochemicals that help patients thrive during treatment.\" You can find it on Amazon. Welcome back Michelle, we missed you! It's good to hear your SE's weren't too crazy. Angela - Sorry to hear about your SNAFU. Emily didn't get Zofran for nausea/vomiting. They gave her Compazine (thankfully, she hasn't had to use it). Hope you feel better! Lizbeth - Not sure about the WBC count yet. They just told us if Emily's fever gets to 100.5 that it most likely means her WBC levels are too low and that we'd need to go to the hospital if that happens. It appears some of you have reached the bottom and are starting to recover a bit. That's good news too! Stay strong!",
      "MessageIndex": 476,
      "PostDate": "13/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 14, 2016 05:55AM - edited Sep 14, 2016 08:31AM by Sam13 Emily is feeling much better this morning (day 8) and actually has an appetite. Let's hope she has reached the bottom and is coming up the other side. VLH - I think a very high fever might indicate some sort of infection (due to the compromised immune system), so they'd most likely treat with antibiotics. Makeiki3 - I suspect your cocktail varies a bit from Emily's because of your stats maybe? While we were in one of our initial meetings with her MO, he showed us how they determine the chemo regimen (via some onco website). The plan is based on several individual factors. I'm sure all oncologists follow the same protocol and use the same treatment-determination software. It takes all the guesswork out of it. Having said that, it is odd that your stats look very similar to misslil's, but she is getting the Perjeta. There may be another factor at play. I'm curious what you find out from your MO. Lizbeth - Totally agree with all your food comments. Emily is following a very similar diet. Like you, she says watermelon tastes normal to her. Weird, right? Hope everyone has a great day!",
      "MessageIndex": 494,
      "PostDate": "14/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Sep 17, 2016 01:39PM Sam13 wrote: One of the wigs we picked up today. We both really like it! ",
      "MessageIndex": 574,
      "PostDate": "17/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Jan 29, 2017 07:40PM Sam13 wrote: So happy to see you got good news Seq! Smile, your hair looks great! Emily's is starting to come back, but it is very slow. She had her first week of rads last week and all went well. Still struggling with neuropathy, but her MO says to give it time. Really hoping to see some improvement there. In the meantime, lots of foot massages! Best to all!",
      "MessageIndex": 1569,
      "PostDate": "29/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Nov 4, 2017 04:30PM Sam13 wrote:  Good evening, I just had to share a picture of our youngest granddaughter too. This is Emberly, my son's daughter. Have a great weekend! Sam",
      "MessageIndex": 1843,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 9, 2016 08:23AM Sam13 wrote: seq24 - Emily had the same thing happen with her Neulasta pod after her last infusion. Her onc is having her come in for a WBC test to make sure her numbers aren't too low, but we're pretty sure it worked because the gauge indicated empty and there wasn't any leakage.",
      "MessageIndex": 949,
      "PostDate": "09/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 13, 2016 01:52AM Sam13 wrote: HopefulYogi - Emily is on day 15 of 21 after her 2nd infusion and she is doing great. The SE's pretty-much followed the same pattern as the 1st round with the last week before the next chemo treatment being fairly normal. Glad you are feeling good. Keep it going, you got this!",
      "MessageIndex": 984,
      "PostDate": "13/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Oct 21, 2016 09:52PM Sam13 wrote: We spoke to Emily's MO today and he said they increased her carboplatin dosage for this last round because her kidney function lab numbers were a little better than the first two infusions. Some time ago, I remember someone saying that many women do not tolerate all 6 TCHP treatments and end up stopping short of that number. I asked him about that. He said only 1 of his patients didn't finish all 6, and that one was partly due to a pre-existing health condition. He went on to say Emily is a \"Superstar\" among the people he has treated in terms of how well she has tolerated the chemo. Yay! for that. A big hooray for those of you completing your first regimen! Everybody stay strong and have a great weekend! If you're looking for us, we'll be in the garden...",
      "MessageIndex": 1066,
      "PostDate": "21/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Jan 19, 2017 04:53PM Sam13 wrote: Hi all, Just checking in since I haven't posted in awhile. Emily is 1 month out from her last TCHP and she is still having problems with neuropathy in her feet. This last round seems like it was the worst. After the previous 5, she'd get some feeling back just in time for the next treatment, but this time it has not improved. I hope you are right misslil, and she starts getting feeling back soon. It is driving her crazy. Other than that, she is doing pretty well and hoping to see signs of hair regrowth. She had her tumor removed before the chemo, so she is only doing the Herceptin and radiation now. No SEs from the Herceptin after her first infusion post-chemo. It took about a month to heal from the surgery, but her tumor was small (2 cm) and they just did a lumpectomy along with removing 3 nodes. Sorry I haven't been posting regularly, but I have been following your comments. With the holidays, work, and the grandbabies all being here, there doesn't seem to be much free time. Sending healing thoughts your way and hoping you are all feeling better! Congrats to all who are moving to the next phase of your treatments! THINK HAPPY THOUGHTS! Sam",
      "MessageIndex": 1520,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Feb 3, 2017 11:27AM Sam13 wrote: Lyn - I assume they'll flush it on a regular basis, but that is a good question for us to ask. Her herceptin runs until August or September. I'm not sure what the plan is after that. Sharon - Emily hasn't complained about itchiness, but she is way behind you in the hair regrowth department. Seems like that could be a possible SE of hair coming back though. On a side note, Emily went in for a mammo on the opposite side this morning and was told everything looked normal, yay!",
      "MessageIndex": 1595,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Feb 21, 2017 12:50PM - edited Feb 21, 2017 06:00PM by Sam13 Update time. Emily's hair is really starting to grow back in faster, a few of her fingernails are showing signs of lifting, and her neuropathy has improved somewhat. She is 4 weeks into the radiation and is now getting the sunburn effects. She has been using Aquaphor to help counter that. All in all though, she is feeling and looking better with each passing day. Hahlyn - Emily's port experience has been pretty positive. It was installed under twilight sedation, wasn't hard for her to get used to, and has worked like a champ. They are still using it for her Herceptin infusion (no SEs, yay!) every three weeks. It also makes blood draws less painful. She just puts on a little numbing cream about an hour beforehand and they plug her in. Healing thoughts to all. Sam",
      "MessageIndex": 1640,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "Sam13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237882/profile",
      "Content": "Mar 1, 2017 12:19AM Sam13 wrote: That is great news Nayda! Good for you!!",
      "MessageIndex": 1656,
      "PostDate": "01/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    }
  ]
}