{
  "AuthorID": "sam52",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
  "Posts": [
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jan 22, 2010 03:30PM sam52 wrote: Shit shit shit.........that about sums it up. Condolences to Kimmy's family. Sam",
      "MessageIndex": 9,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747176",
      "Title": "Kimmytoo Sachi justjudie"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Aug 1, 2012 10:08AM sam52 wrote: Cindi - add this thread to your favourites and you will always be able to find it!",
      "MessageIndex": 226,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Apr 5, 2009 11:08AM sam52 wrote: I am convinced that long-term stess contributed to, (not caused) my BC; I am a single parent with a son who has Aspergers Syndrome (autistic spectrum disorder) - the stress was there for 18 years...... I also know of many people who were dx with BC  a year or two after a major traumatic event; my next door neighbour, for instance, who was dx 2 years after she lost her husband to pancreatic cancer.  I think that stress is only ONE factor - but enough to tip the balance. Sue - hope you are feeling a little better now........I recognise that knotted stomach feeling; I've had my share of relationship horrors too.I hope you will start to feel your depression lifting soon and feel the support you are getting from the sisters on this site. Sam",
      "MessageIndex": 15,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731801",
      "Title": "depression or progression??? suecco katie11"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Nov 26, 2007 01:42PM sam52 wrote: Erica - does that mean they're 'contact' forms? I would love to wear a regular bra - the mast ones are really not that attractive..... I noticed you joined this site in October 2003, same as me! Sam",
      "MessageIndex": 8,
      "PostDate": "26/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/695480",
      "Title": "Boy was my face Red! yellowrose Mary-Lou"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Aug 19, 2007 07:41AM sam52 wrote:",
      "MessageIndex": 1,
      "PostDate": "19/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/680237",
      "Title": "uterus thickening & tamoxifen waiting on biopsy edwh001 lalisa"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "May 8, 2012 07:50PM sam52 wrote: Yes...me too! I really thought when I saw the title that it was spam and was prepared to report it, lol! With reference to Sommer's comments about 'tossers' (Loved that one about Alex being a tosser!) - I am always careful not to refer to a sleepless night as 'tossing and turning', in case it is misconstrued...... I have also had that dreadful grilling from so-called friends, and the weird looks when a mastectomy is mentioned - a work-colleague even told me she 'couldn't see any difference' - well, thanks for looking at my chest, you perv...... Another friend phoned me and spoke for ages about her holiday, and then remembered my situation and asked 'and how's the cancer?' I was so lost for words ('gob-smacked') that I muttered 'gone, I hope'.",
      "MessageIndex": 108,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786827",
      "Title": "Just Need to Wank sbelizabeth autism_mom"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Nov 9, 2009 05:49PM sam52 wrote: ((((((WATSON)))))) You go girl !!!! Your brilliant humour still shines through and you are doing more than most people going through WBR. You rock. I just hope you get the meds you need and SOON. Hugs, Sam",
      "MessageIndex": 29,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743559",
      "Title": "Waah! I had a meltdown. I don't care who posts! Watson konakat"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jun 5, 2011 04:24PM sam52 wrote: I also cannot understand why you have been told every 5 years.......the NHS guidelines state every 3 years is the recommended interval. I had a yearly mammo for 8 years after dx, at the hospital where I was treated, and will now get them every 2 years there. I am not back on the 'routine' mammo screening at this point. Sounds like you need to challenge the doctor who gave you the wrong information.",
      "MessageIndex": 9,
      "PostDate": "05/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769904",
      "Title": "UK Mammograms every 5 yrs - Unbelievable gillovski hymil"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jan 13, 2010 07:09AM sam52 wrote: I remember Kimmy from way back..and her funny avatar. I wondered why I had not seen any posts from her recently.This news is just crap. I hope hospice can make her comfortable. Sending big hugs from across the pond.  Sam ",
      "MessageIndex": 37,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746636",
      "Title": "kimmytoo Sachi normalcani"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jun 6, 2011 06:20PM sam52 wrote: I cannot see how aromasin can be any better at preventing bone loss - all the AI's work in the same way, by depleting estrogen.",
      "MessageIndex": 22,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769948",
      "Title": "New Drug Prevents Reoccurence by 65%!!!! Pure ktym"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jun 6, 2011 01:36PM sam52 wrote: I think there is some misunderstanding around this topic.... Aromasin is not a 'new' drug - the media often misreports medical issues. I took it for 5 years, from 2005 -2010, actually side effect-free! I was switched from tamoxifen which I took for 2.5 years, as this was the protocol used in a large trial : sequetial tamoxifen then an AI (aromasin). Hymil has got it right - aromasin is now being suggested as being able to prevent IDC/ILC in those who had previously been dx with DCIS/LCIS or ADLH. So trying to prevent pre-cancerous conditions becoming invasive. There is no suggestion that aromasin is superior to either anastrozole (arimidex) or Femara. Sam",
      "MessageIndex": 16,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769948",
      "Title": "New Drug Prevents Reoccurence by 65%!!!! Pure ktym"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jun 15, 2010 06:12AM sam52 wrote: I am in UK and there is no insurance to cover costs; post-surgery stuff is made and sold here.....and exorbitantly priced. I have to pay for bras etc out of my own pocket and it irks me every time that I am shelling out £25 - £30 just because it is a mastectomy bra. Yes, they know they can charge what they like, because there is nowhere else to get the stuff. Sam",
      "MessageIndex": 4,
      "PostDate": "15/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753780",
      "Title": "Why Are Post Surgery Products So Expensive? wifemomx2 wifemomx2"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Nov 3, 2008 06:16AM sam52 wrote: A single parent with a son who has high -functioning Autism.......I had so many years of high-level stress with him that I told myself I would get a heart-attack. Instead I got BC.I truly believe in my case that stress was a contributory factor...along with high levels of estrogen. I don't think stress causes cancer......but i do believe it is a contributory factor. Sam",
      "MessageIndex": 24,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723726",
      "Title": "Does desperation play a role in developing breast cancer? HeatherBLocklear dlb823"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jan 10, 2013 03:57AM sam52 wrote: Athena...well-said. I actually do believe that stress was a CONTRIBUTORY factor in my getting bc. I am a single parent of a boy with an autistic spectrum disorder and have experienced incredibly high levels of stress on a daily basis for years and years. I thought I might get a stroke or heart disease but got bc instead . I believe another contributory factor in my case was my high level of estrogen. Of course not everyone exposed to stress will get bc - it is NOT a causative factor and will be only one variable that could predispose someone to get bc.Obviously plenty of people without any stress still got bc - that is not an argument to say that therefore stress is not implicated for others.",
      "MessageIndex": 25,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/798481",
      "Title": "Did having a stressfull life cause your breast cancer? new2bc Bren-2007"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jan 27, 2009 10:06AM sam52 wrote: I know she wasn't going to be cured......but to be taken now - after all she went through and all the little improvements. Such a shock. Debs you were an inspiration. Blessings to your family. Sam",
      "MessageIndex": 176,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jan 31, 2009 08:13AM sam52 wrote: No religion in particular (maybe agnostic) ....... but I send prayers for Mena. She has been through so much.I pray the rads give her some relief. Sam",
      "MessageIndex": 8,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728203",
      "Title": "Please pray for Mena... Linora sam52"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Oct 16, 2010 02:40PM sam52 wrote: Erica We are so grateful to you for putting together this comprehensive site. Thankyou. Sam",
      "MessageIndex": 81,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/755767",
      "Title": "New Bra jbau Aug242007"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "May 27, 2008 05:30AM sam52 wrote: Sorry.....no words of wisdom from me, either. I have exactly the same feelings as both of you - not really happy with the way I am (unilateral mastectomy end of 2001), but so scared of any reconstruction. Although my b/f is accepting of the situation,(he knew me before the bc),I also always wear something to cover my top half when we are intimate. Only once did he see the mast site, when we had a shower together and he lovingly soaped me all over.That really meant a lot to me, though we have never referred to it and I am still covering up. I am really unhappy that I can't wear certain clothes and that I feel I can't be totally naked in bed.I am worried what another man might think in the future( this relationship is not good at the moment),and want to feel 'whole' again. But the alternatives are SCARY! Implants after rads have a high failure rate ( and seem not to look or feel very natural);and a DIEP is such a big surgery with a very long recovery time, and another massive scar.....and NO guarantees! I am a single parent with a son who has special needs, so there are many implications and complications around this too. I don't know what the answer is; I also only replied because this topic hit a nerve and I wanted to tell you that I feel the same way too. Hugs, Sam",
      "MessageIndex": 2,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/706184",
      "Title": "Unhappy where I am, but too scared to do anything about it. samon OnEaglesWings"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jan 23, 2012 07:38AM sam52 wrote: I am sorry you have jonied the club  I did not have fibromyalgia before dx, but developed it after tx (rads and chemo, which was FEC-T ). I believe taxotere did a number on my musculo-skeletal system, as it really affected my muscles, but that is only my presumption. However, it does not mean you will be affected. I know that is not really very helpful........I hope your results will show you do not need chemo. Have you tried any other stress-relief strategies? I had reiki healing and it helped me to cope when I was waiting for treatment. Best to you, Sam",
      "MessageIndex": 1,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781474",
      "Title": "Chemo/Radiation and Fibromyalgia kingjr66 FLislander"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Sep 8, 2010 08:58AM sam52 wrote: Shana Tova to you all. Thank you, Leah",
      "MessageIndex": 2,
      "PostDate": "08/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/757755",
      "Title": "Rosh Hashana - jewish new Year Leah_S lago"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "May 14, 2012 05:52PM sam52 wrote: It is not only Chinese, but apparently also Japanese women who have a low incidence of breast cancer. A correlation has been made between their high consumption of soy, very little dairy, and rates of bc. When these women move to the West, and consume a wwestern diet, then their rates of bc rise sharply.",
      "MessageIndex": 107,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764313",
      "Title": "Why don't Chinese women get breast cancer? MCTHO"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Jan 24, 2012 06:17AM sam52 wrote: Forgot to mention.......I am on a low dose of amitryptaline taken at night when the flares are bad.Yes, it is also an anti-depressant (but not at that dosage).",
      "MessageIndex": 5,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781474",
      "Title": "Chemo/Radiation and Fibromyalgia kingjr66 FLislander"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Sep 15, 2009 07:24PM sam52 wrote: I am so very sad and sick to hear this news. Mena will live on in the MOJO thread. Sam",
      "MessageIndex": 44,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740382",
      "Title": "mena got her wings... celia088 Irina"
    },
    {
      "AuthorID": "sam52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/4009/profile",
      "Content": "Feb 3, 2011 01:08PM sam52 wrote: Jane Plant (Professor of geology....so not exactly relevant),was all the rage when I was dx in 2001. I bought into some of her hypotheses, considering that dairy products contain something called IGF-1 (insulin-like growth factor), which has been shown to encourage the growth of tumor cells in vitro. But to extrapolate to human situations is not proven or even reliable.  However, it is all far too simplistic, and her methodology is definitely questionable; she does not consider any other variables, such as many of those mentioned above (such as soya consumption, and other dietary factors) and she automatically touts a dairy-free diet as her saviour, when it could have been the chemo regimen.I also find it reprehensible that she 'blames' a friend who got a recurrence because she 'cheated' by eating a bit of cheese! Certainly the Chinese and the Japanese have lower rates of bc than many western countries.But I think there is far more to it than dairy avoidance. Sam",
      "MessageIndex": 32,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764313",
      "Title": "Why don't Chinese women get breast cancer? MCTHO"
    }
  ]
}