{
  "AuthorID": "sammygrey44",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
  "Posts": [
    {
      "AuthorID": "sammygrey44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "sammygrey44 wrote: Tomorrow, I will be a month out of surgery -- had double mastectomy.  Prior to that, I had chemo, which I finished on 02/01/10 -- can I get a shout out!    My path report came back clean -- going in, I had 2 out of 3 postive nodes from an earlier lumpectomy, and during this surgery, my surgeon pulled more nodes in that area and they were all clean -- my path report was clear. . . from what we can tell, the chemo/surgery worked.  NOW, I am faced with whether or not to have radiation.  My surgeon understands my temptation not to, but she's not making a recommendation one way or the other, which is understandable.  She's referred me to a radiation oncologist who isn't known for just saying, \"Yes, you need radiation,\" to everyone who walks in the door.  I'm not sure what he's going to say, but I\"m just trying to think this through a little before seeing him.  Once I see him, I have to decide because radiation should occur within 6 weeks out from surgery, according to my surgeon. I never had a large tumor -- I had ILC in the left breast and she couldn't get clear margins during the lumpectomy.  My cancer was grade 2, which I've heard is average in regards to aggressiveness.  Grrrrrr. . . I'm so tired of all these HEAVY decisions!  I\"m still pondering Tamoxifin, but I'll save that for that board. Take care and hugs to everyone on here. . . side hug for all of us just out of surgery or a procedure. Sammy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/751189",
      "Title": "Radiation -- not sure sammygrey44 mnmom"
    },
    {
      "AuthorID": "sammygrey44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "Apr 14, 2010 08:06PM sammygrey44 wrote: Suepen, Mnmom, Jayne, Vmarie, Sweatyspice, Thanks so much for y'all's responses.  My tumor was close to my left armpit -- don't think it was overly close to my chest wall, but could have been -- I'm sure my rad onc will fill me in on the geography of my chest in regards to my \"past, let's keep it that way\" cancer and why or why not I need rads, which I'm thinkin' he's probably going to say \"yes\" to rads, but he may not.  I'll be seeing my doc a week from this Friday and will let y'all (can you tell I'm from Texas!) know.  Take good care, Sammy",
      "MessageIndex": 9,
      "PostDate": "14/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/751189",
      "Title": "Radiation -- not sure sammygrey44 mnmom"
    },
    {
      "AuthorID": "sammygrey44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "Apr 13, 2010 05:02PM sammygrey44 wrote: Cowgirl and RegulJ, Thanks so much for your responses.  I am still in \"limbo\" about my decision, but I will keep y'all posted, and I will definitely get with my rad onc about the timeline --  I really don't want to be overly rushed -- I'm still sore and would like to recover a little more from surgery before having to do anything.  I'll keep y'all posted. Cowgirl, glad your treaments went well (encouraging:), and RegulJ, I hope your rad treatments go smoothly, which I feel certain that they will.  :) Take good care, Sammy",
      "MessageIndex": 3,
      "PostDate": "13/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/751189",
      "Title": "Radiation -- not sure sammygrey44 mnmom"
    },
    {
      "AuthorID": "sammygrey44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "sammygrey44 wrote: I\"ve completed 2 of the 6 treatments and I have a severe case of the hives.  I'm out of town and went to the doctor, she said it's a reaction.  I\"m also on Ativan, Celexa, and Warfarin.  I'm not sure if I'm allergic to the TC or one of the others.  Have any of y'all ever gotten hives while on chemo? Thanks and have a great weekend! Sammy  or for the time being \"Itchy\" Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/744313",
      "Title": "I\"m on TCx6 and HIVES have hit me! sammygrey44 sammygrey44"
    },
    {
      "AuthorID": "sammygrey44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "Nov 21, 2009 06:19PM sammygrey44 wrote: Thanks so much for the responses!   I'm going to call my onc on Monday.  The doc I saw today called my cancer center and spoke with the onc on call.  They agreed that pregnisone (sp?) for 5 days will probably knock it out.  I just hope this is not a reaction to the T or C in my treatment -- I definitely don't want to have to change treatments at this point.  I only have 4 more to go = yea! Take good care, Sammy",
      "MessageIndex": 5,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/744313",
      "Title": "I\"m on TCx6 and HIVES have hit me! sammygrey44 sammygrey44"
    },
    {
      "AuthorID": "sammygrey44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "Aug 27, 2009 04:46PM sammygrey44 wrote: I'm a total newbie, what is AC?  I'm afraid it's Adriamyocin (spelling?), and I think that's what I'm going to be taking for chemo -- my breast surgeon said that, and we'll know for sure when I meet w/my oncologist on the 17th.  Hope  you are all doing well and okay now -- chemo sounds like an ordeal.  Still processing everything.  Take good care, Sammy.",
      "MessageIndex": 39,
      "PostDate": "27/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "sammygrey44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "Aug 29, 2009 06:11PM sammygrey44 wrote: I'm going to look it up now.  I have ILC and I know that is estrogen and progesterone receptive -- I know that will make a difference, but I want to have other options besides just AC.  Thanks so much! Take good care, Sammy",
      "MessageIndex": 7,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/739693",
      "Title": "options to ac sammygrey44 sammygrey44"
    },
    {
      "AuthorID": "sammygrey44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "sammygrey44 wrote: hello all! i recently had a lumpectomy and a partial lymph node removal.  my margins are not clear and cancer was found in 2 of the 3 nodes pulled.  i will be seeing my oncologist for the first time on the 18th of sept., and my breast surgeon thinks she will start my on chemo right away using ac.  after reading a little about ac, i'm not that sure i want to go that route.  yes, i think i need chemo since it's in my nodes, but ac sounds like it can be brutal to and for the body.  what are some options?  i want to know so that i can discuss this with my oncologist.  i may go to md anderson for a consult after my treatment plan is created. i hope you are all well. . . this is such a sucky thing to go through.  take good care, sammy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/739693",
      "Title": "options to ac sammygrey44 sammygrey44"
    },
    {
      "AuthorID": "sammygrey44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "Aug 29, 2009 04:07PM sammygrey44 wrote: Ruth and Dianne, Thanks so much for your responses.  I'm just still in shock about everything going on, and quite honestly, I'm scared.  I haven't had the petscan (spelling?) yet, so that should be interesting -- hopefully, I'm clear on that.  We'll see. As for A/C, I'm going to really try and opt for something out, but I like the idea of being able to break it down in smaller doses if I end up having to have it.  I\"m trying to learn as much as possible before seeing my onc., and y'all are really helping me. Thank you. Take good care, Sammy",
      "MessageIndex": 3,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/739693",
      "Title": "options to ac sammygrey44 sammygrey44"
    },
    {
      "AuthorID": "sammygrey44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "Aug 29, 2009 05:57PM sammygrey44 wrote: What is CMF?  Thanks for your response. . . I\"m going to look into whatever you're referring to.  :)  I hope you're doing well -- sounds like you are. . . eight years later. Take good care, Sammy",
      "MessageIndex": 5,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/739693",
      "Title": "options to ac sammygrey44 sammygrey44"
    },
    {
      "AuthorID": "sammygrey44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88271/profile",
      "Content": "Nov 14, 2009 06:06PM sammygrey44 wrote: Hi, Cathy, I\"m not sure if this would help, but you might want to start a thread that says \"Abraxane?\"  I\"m hoping that will get you a response -- I know it's nice to hear from folks who have been through what you're about to go through or are going through. Take care and hope the Abraxane goes smoothly. Sammy",
      "MessageIndex": 1,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/743289",
      "Title": "Chemo cathyf1 sammygrey44"
    }
  ]
}