{
  "AuthorID": "sammiryan",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
  "Posts": [
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "sammiryan wrote: Hi All Just found out my CEA is now 56 and I am freaking out and am so scared. I have now got the big C in my liver, lungs, vertebrates, meninges and eye, it is taking over like a damn alien. I am just so stressed about this all. My darling 13 year old needs her mum and I am so frightened that my time is almost up and I really don't want this to be. We have just bought a house that we are renovating and boy do I want to see it. I am getting scan results next Monday but am petrified. I really want to be NED and I am praying as hard as I can buy some more time. Any positive thoughts would be much appreciated. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827561",
      "Title": "Need my breast cancer buddies sammiryan steelrose"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "sammiryan wrote: Hi All Just found out my CEA is now 56 and I am freaking out and am so scared. I have now got the big C in my liver, lungs, vertebrates, meninges and eye, it is taking over like a damn alien. I am just so stressed about this all. My darling 13 year old needs her mum and I am so frightened that my time is almost up and I really don't want this to be. We have just bought a house that we are renovating and boy do I want to see it. I am getting scan results next Monday but am petrified. I really want to be NED and I am praying as hard as I can buy some more time. Any positive thoughts would be much appreciated. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827561",
      "Title": "Need my breast cancer buddies sammiryan steelrose"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Jan 20, 2015 01:14PM sammiryan wrote: Thanks everyone I have had taxol before twice, and it was also good for me, actually looking forward to starting it again, hehehe, how strange but this is our new normal right? Love to you all",
      "MessageIndex": 40,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827561",
      "Title": "Need my breast cancer buddies sammiryan steelrose"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Jan 19, 2015 10:59AM sammiryan wrote: Hi all Had the results today and the cancer is growing and on the move again so off the xeloda and in 2 weeks will start the taxol regime again, weekly and one off etc, I am fine about it and pleased we are trying something else to reduce tumours. Thanks for all your thoughts and prayers. Sam",
      "MessageIndex": 23,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827561",
      "Title": "Need my breast cancer buddies sammiryan steelrose"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Mar 19, 2014 02:25AM sammiryan wrote: Thanks so much for that, well, I am at the gym now, will try as hard as I can while I am fit enough to exercise.",
      "MessageIndex": 2,
      "PostDate": "19/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819269",
      "Title": "Question about zolodex and femara sammiryan Twofer"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Apr 9, 2013 04:23AM sammiryan wrote: 113 Look a lot, is a great comfort to me.",
      "MessageIndex": 131,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "sammiryan wrote: Hi all. I had this on the hormonals page but I thought I would also post here in case you have any thoughts for me. Ta Hi Everyone Hellllllllp I need lots of advise to stop me going completely over the edge. I am Stage 1V with mets to the liver and lungs, I am 47 and I have just lost the 16 kilos that I put on after my last round of chemo and steroids etc, by going to the gym ALOT and eating very healthy food. Well today I was given a zoladex injection becasue my period returned. I was told that weight gain is unavoidable, so I now feel absolutely shattered and so damn fed up with the whole bloody thing. Look, it's not vanity at all, but a 5 foot nothing person weighing over 86 kilos is absolutely so uncomfortable and I can't stand it. I was so depressed and stopped going out, I looked in the mirror and could not stand this bloated whale looking at me, I couldn't walk properly and really, I just hated being inside my skin. I have never been a slim woman, I have always been plump, but that extreme weight gain was really hard and I am just so scared of experiencing that again. So, anyone with advice? Is there any way I can avoid this weight gain happening? Does anyone have experience with this? Thanks and have a lovely day or evening, wherever you may be. Sam Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819269",
      "Title": "Question about zolodex and femara sammiryan Twofer"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Oct 13, 2014 04:54PM sammiryan wrote: 45 Stage 1V",
      "MessageIndex": 1011,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "sammiryan wrote: This Post was deleted by sammiryan. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794735",
      "Title": "Cancer returned sammiryan chrissyb"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Aug 23, 2014 06:44PM sammiryan wrote: Hi, I have lost it completely twice, both times on taxol and then on halaven it went so thin that I ended up shaving it the third time. It's funny, it is now growing back, but is very short and I don't feel like myself and find it difficult to dress up to feel pretty as I always had long, thick hair- it does make me feel a lot less feminine, but I am used to it now. I have started xeloda five days ago so I will wait and see. what happens now. All times my hair grew back afro curly, hehhe.",
      "MessageIndex": 8,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823839",
      "Title": "How many times have you lost your hair? Informal poll. Boo123 usafmom"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Aug 3, 2014 01:37PM sammiryan wrote: Hi all Radiation tomorrow, but I have one question. I have practically no sight left in my right eye because it has gone into the optic nerve, but could it come back? I realise it is pretty unlikely, just wondering what you have all heard. On a good note, had a lovely weekend in Oxford enjoying punting down the river- very cool. Take care everyone Xoxoxo",
      "MessageIndex": 18,
      "PostDate": "03/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823068",
      "Title": "Gone to the eye- aarrhhhhhhhgggggg sammiryan"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Jul 29, 2014 07:04PM sammiryan wrote: Oh thank you, thank you all of you for replying, and Claire so relieved that someone out there knows what I am going through. The mets have gone to my optic nerve, I went and got the results of the MRI and it has gone further than they thought. I start radiation next week and then they will assess the other stuff. I am finally getting into the system and that is a great relief. My sight is very bad in the right eye, I am practically blind now, it is so rapid I can't believe it. Until I read the above I really thought I was a gonner now, so thanks so much ladies. Please keep in touch, you are my lifeline. Thanks so much xoxoxo",
      "MessageIndex": 15,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823068",
      "Title": "Gone to the eye- aarrhhhhhhhgggggg sammiryan"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "sammiryan wrote: Hi everyone I just posted a few days ago, and now I have been dianosed with cancer to the eye. I now have liver, lung and eye mets, does anyone else have this and what are my chances???? Please let me now what you have all experienced. Sam xoxoxoxo Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823068",
      "Title": "Gone to the eye- aarrhhhhhhhgggggg sammiryan"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Aug 5, 2014 03:13PM sammiryan wrote: Hi, I would love to tell you about the symptoms.  About 4 months ago I my vision changed slightly and I had to squint a bit to focus and I also got an extremely sharp pain (only lasting half a second) in the middle of my right eye, I didn't think anything too much of it, I thought it could be a chemo side effect. Then about 8 weeks ago I was reading and realised I coulldn't read clearly out of the eye and that there was black patches in bits of the print and I slowly started to feel a shadow over that side. I had a PET scan in June and none of this came up, my mets in my lungs and liver did, but not the eye or brain mets. I came over here to London and after many many referrals I was sent to Moorefields and they diagnosed cancer mets to the eye. I had a MRI last week and brain mets also found. I had my first radiation therapy today and I feel great. Take care everyone",
      "MessageIndex": 21,
      "PostDate": "05/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823068",
      "Title": "Gone to the eye- aarrhhhhhhhgggggg sammiryan"
    },
    {
      "AuthorID": "sammiryan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162204/profile",
      "Content": "Oct 26, 2014 12:22PM sammiryan wrote: I so understand your panic attacks because I also have had a few nights when I wake up having panic attacks as well. I have just moved to Lodon and am in the process of buying a new house to create a family home, that we have to totally renovate and I am terrified I will only have a couple of years or less to enjoy the house and London town. I am reminded of my cancer now every second as it is in my eye and I no longer am able to see very well. Before that, even though I had progression to my lungs and liver I was not aware physically of having cancer apart from the blood tests and scans that told me I had a problem. Recently, two young teacher colleagues of mine have died suddenly, one of a heart attack (he was 37 with two youn kids) and the other was a beautiful man who died when he was knocked off a train in Thailand, again he was young, he was turning 30. It made me realise that none of us know when our time is up and I do pray that I will be around for a long time, but it is scary and really shitty that we have been given a time line. I do appreciate every moment but can't deny that the BIG C is always hovering around in my mind. I think listening to music is great and please do take any medication to calm you down. I take something my dad gave me and it worked well. Be kind to yourself and feel what you are feeling because what we are going through is truly scary. Take care",
      "MessageIndex": 10,
      "PostDate": "26/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825737",
      "Title": "Anxiety attacks - any advice? reader123 bhd1"
    }
  ]
}