{
  "AuthorID": "SammieKay",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55944/profile",
  "Posts": [
    {
      "AuthorID": "SammieKay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55944/profile",
      "Content": "Nov 23, 2008 08:27PM SammieKay wrote: Mary, My granddaughter knitted me a nightcap.  It was very cozy.  Do you knit or know someone who knits?  The wig caps always hurt my head.  I had a wig before breast cancer and wore the cap to hold my hair in place under the wig.  I am 16 months post chemo with a head full of hair.  Mine came back curly and thicker than before.  Good luck girls.  The hair does come back.  My eyelashes came back first.  I started Taxol in Feb.07 and my hair came out 3 weeks into the 12 weekly doses of Taxol.  Then I had FAC and that really finished it off.  It was cold and my head was cold.  I wore wigs during the day, but at night needed a night cap, no pun intended.  Sammie Kay",
      "MessageIndex": 13,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724806",
      "Title": "Just loosing hair sama710 SammieKay"
    },
    {
      "AuthorID": "SammieKay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55944/profile",
      "Content": "Mar 21, 2010 09:10PM SammieKay wrote: I lost a friend, Pat (WayOver20).  I believe she posted on this thread some.  I wasn't sure you were aware that Pat died on March 12, 2010.  Her daughter posted on the profile page for Pat.  Pat was such a wonderful generous person.  She never complained and she kept her decline to herself.  We on the thread, Anyone having chemo in Feb, shared our experience through chemo in 2007,  Pat was on our board during that time.  When she had the recurrence, she didn't share as much with us as she was afraid that it would bring  us down.  Anyway, we have 2 angels from our group now.  Just wanted to let you guys know.  Love to all my bc sisters,, Sammie Kay",
      "MessageIndex": 100,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "SammieKay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55944/profile",
      "Content": "Jun 1, 2008 02:40AM SammieKay wrote: Is it synthetic?  Have you washed and conditioned it? I had one that was  synthetic and the bangs got all frizzy.  I think I must have opened the oven and got it too hot.  I returned it to the wig shop and they managed to smooth it out with some tools they have.  Good luck.  Sammie Kay",
      "MessageIndex": 1,
      "PostDate": "01/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706561",
      "Title": "ratty looking wig bean4865 Poppy_Spruce"
    },
    {
      "AuthorID": "SammieKay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55944/profile",
      "Content": "Jun 2, 2009 05:13PM SammieKay wrote: Wow Ellen,  Sometimes I understand very well what my  onc at MD Anderson told me early on.....he doesn't do any scans or blood work routinely because he says it causes much unnecessary anxiety.  He said that most of the abnormalities that show up are nothing and if I have a recurrence I am considered incurable.  Now, he didn't mean there was no hope..  I have a sister-in-law who is 10 years post recurrence, doing well on an aromatase inhibitor.  Remember most of the things we fear never materialize.  My onc said to me....\"go, live:.  That is what I am doing.  My Mom used to say, \"Worry is the interest we pay on the trouble we borrow\". I feel for you and your anxiety.  I don't have a lot if experience to offer about scans or lab work.  I am just moving on and living life to the fullest. We are exactly 2 years apart on our diagnosis. I had bil mx and chemo.  I didn't have radiation, my choice.  I had clear nodes and not CA in the breast tissue they removed. I will check back to see how things turn out.  I am on a thread called Anyone starting chem in Feb.  We don't have a year, but it was 2007 and we call ourselves the Feb.ChemoCruisers.  Several of us still keep in touch.  We have lost one and two others have had a recurrence.  Some just don't want to continue as it is too depressing to face.  But I consider the love and support we give each other, regardless of the outcome worthwhile.  Friends forever through the good times and the bad ones. Keep the faith girl.  Hugs, Sammie Kay ",
      "MessageIndex": 4,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735032",
      "Title": "Finished chemo- Tumor markers up? HELP REKoz LakeArrowheadgirl"
    },
    {
      "AuthorID": "SammieKay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55944/profile",
      "Content": "Mar 17, 2010 05:38PM SammieKay wrote: I have sent a PM to Michelle, Pat's daughter, using Pat's WayOver20 address. Hopefully she will check there.  That is where I found the note from Michelle about Pat's angel status.  I hope she will contact me with an address where we can all send cards and letters to her dear daughter.  I will post it here and on Feb. chemo if I hear from her. Pat did so enjoy that time with her family during the holidays.  So great she had that time with her siblings and her daughter.  Pat never talked much about her problems.  Up until Jan. she was still sharing information that she researched about getting  benefits and such for those diabled by this hideous disease we all share.  What a loving, caring person Pat was.  She will be missed so much. Rest in peace dear, Pat.  Sammie Kay",
      "MessageIndex": 10,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749913",
      "Title": "Wayover20 - Pat Alyson Kim_888"
    },
    {
      "AuthorID": "SammieKay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55944/profile",
      "Content": "Feb 11, 2008 04:30PM - edited Feb 11, 2008 04:31PM by SammieKay Hi Feb '08 group, I am Sammie Kay from the Feb.07 group. I always preface any comment I make with \"everyone is different\". My chemo was 5Fu,cytoxen, and adriamycin(red devil).  I was there about 3 hours each time.  You certainly could crochet or knit if you have a port.  Might interfere if you have an IV in your arm.  I didn't get a reaction until about 3 hours after chemo. The steroids made me antsy and I had trouble sleeping for a few days.  The nausea medicine helped some, to make me sleepy.  I took Zofran for nausea and ask for some Phenergan because it has a drowsiness side effect. Glad to hear you girls have your '08 group going.  It is such a comfort to be going through this together.  A real bonding experience. Hugs to everyone, Sammie Kay",
      "MessageIndex": 151,
      "PostDate": "11/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    }
  ]
}