{
  "AuthorID": "SandyinSoCal",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/15527/profile",
  "Posts": [
    {
      "AuthorID": "SandyinSoCal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/15527/profile",
      "Content": "SandyinSoCal wrote: sandy keller01 at aol dot com Thanks! I am wonderfully made to do ExtraOrdinary things! (www.girleo.com) Dx 5/22/2007, IDC, <1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/691899",
      "Title": "Cindiedee-- please contact me! SandyinSoCal SandyinSoCal"
    },
    {
      "AuthorID": "SandyinSoCal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/15527/profile",
      "Content": "SandyinSoCal wrote: Just wanted to post information about a strange thing that happened in the hospital during an overnight stay after my most recent surgery... They gave me a scopolamine patch behind the ear before surgery, because I'd previously woken up with nausea.   I remember taking my hands and massaging my face, and finding the patch.  Since I was leaving the hospital that afternoon, I peeled the patch off.  I must have touched my face again, and in particular, my left eyelid.   After showering later, I looked in the mirror and was shocked to see that my left pupil was fully dilated.  Apparently the scopolamine patch medication is so strong that it will medicate the eye right through the eyelid.   When my surgeon came to check on me, he put a call in to anesthesia, where they figured out what had happened.  I was unable to read anything for the rest of the day, but otherwise no harm was done.    The anesthesiologist said that this happens sometimes, and told me to mention it next month when I have my next surgery, so they can cover the patch for me and prevent this from occurring again. I am wonderfully made to do ExtraOrdinary things! (www.girleo.com) Dx 5/22/2007, IDC, <1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702680",
      "Title": "Accidental Pupil Dilation SandyinSoCal 2bubbas"
    },
    {
      "AuthorID": "SandyinSoCal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/15527/profile",
      "Content": "SandyinSoCal wrote: http://www.medicalnewstoday.com/articles/145459.php I am wonderfully made to do ExtraOrdinary things! (www.girleo.com) Dx 5/22/2007, IDC, <1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732269",
      "Title": "Bilateral Mastectomies on the Increase SandyinSoCal jondy"
    },
    {
      "AuthorID": "SandyinSoCal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/15527/profile",
      "Content": "SandyinSoCal wrote: Our next meeting is August 12th at 3:30 p.m. in Torrance, CA.  Here is a link to the invitation: http://www.breastcenter.com/encourage/2009/aug/ Please PM me if you would like to reserve space.  I may not be able to respond right away as my mother-in-law is dying and is not expected to make it through the night tonight, but I will check in as much as possible. Sandy I am wonderfully made to do ExtraOrdinary things! (www.girleo.com) Dx 5/22/2007, IDC, <1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737944",
      "Title": "EnCourage 8/12 Torrance, CA-Dr. Massey on Lymph Node Transfer SandyinSoCal SandyinSoCal"
    },
    {
      "AuthorID": "SandyinSoCal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/15527/profile",
      "Content": "SandyinSoCal wrote: I have had a bald spot on the back of my head since my DIEP surgery last summer, and my hairdresser told me that sometimes the stress of surgery can cause alopecia.  I don't think she is aware of documented cases of alopecia when the head is not turned frequently during surgery, to avoid pressure point damage. There was an extremely tender area on the back of my head after my surgery, but I didn't know to be concerned at that time.   Some hair around the edges of my bald spot grew back within a few months, but I still have a rather large area that has no hair and now I doubt ever will.   This is just one of a number of complaints I have about my stage I DIEP surgery performed in the Los Angeles area.  The intermittent pressure cuffs were never placed on my legs although I had a 14 hour surgery.   My surgeon burned my chest with the Bovie cautery tool.   There were other issues as well, and he will be receiving a detailed letter from me tomorrow because I feel he was negligent and I want him to know that I know, hopefully so other patients will not be subjected to the same.    Here's a link to an article about alopecia after surgery.  http://www.anesthesia-analgesia.org/cgi/reprint/89/4/1062.pdf  I am wonderfully made to do ExtraOrdinary things! (www.girleo.com) Dx 5/22/2007, IDC, <1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708715",
      "Title": "Postoperative Pressure Alopecia SandyinSoCal SandyinSoCal"
    },
    {
      "AuthorID": "SandyinSoCal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/15527/profile",
      "Content": "SandyinSoCal wrote: Our next meeting is August 12th at 3:30 p.m. in Torrance, CA.  Here is a link to the invitation: http://www.breastcenter.com/encourage/2009/aug/ Please PM me if you would like to reserve space.  You can also attend this meeting in Indianapolis and New Orleans. Sandy I am wonderfully made to do ExtraOrdinary things! (www.girleo.com) Dx 5/22/2007, IDC, <1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/737945",
      "Title": "EnCourage 8/12 Torrance, CA-Dr. Massey on Lymph Node Transfer SandyinSoCal LindaLou53"
    }
  ]
}