{
  "AuthorID": "SandiH",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
  "Posts": [
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 17, 2009 12:21PM SandiH wrote: wbts, Like you I am new at this, Mammo and Ultrasound last week, scheduled for Biopsy this Wed. I trusted my gut to switch to a new GYN doc for my July GYN appt and he is the one who found my lump - breast exam (I had felt it also). Other symptoms for me is, swollen neck sometimes, didn't think it was anything to worry about, since I told my Intern Doc in February (who also did a breast exam), and he said it's nothing. Now, it could very well be nothing, but just having someone feel and say so, isn't good enough. Glad you're seeing someone else. Always trust your gut. Keeping you in my thoughts.",
      "MessageIndex": 18,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738442",
      "Title": "swollen lymph nodes and puffy armpit wbts Troya78"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 17, 2009 07:43PM SandiH wrote: Wbts, I'm glad you went, and even though when you walk through those doors, you feel like you're overreacting. SO WHAT, even if you are overreacting, that is OK. It is your body, and you should expect nothing but the best treatment.Hold your head high girl! Sandi",
      "MessageIndex": 20,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738442",
      "Title": "swollen lymph nodes and puffy armpit wbts Troya78"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 18, 2009 12:06PM - edited Aug 18, 2009 12:06PM by SandiH wbts, I had the Ultrasound after getting the Mammo (by the Radiologist Tech) and the Radiologist did it again after reviewing those. The whole appt. time was about 2 hours. It was the Radiologist that recommended the Biopsy. So I have it tomorrow. When I asked if it was on the last mammo report, she did say, it was detectable with a mammo. So I think it was the Ultrasound that was the main reason for the Biopsy. I would also say to the Radiologist, Peace of Mind is worth more to you than cost and time of doing the Ultrasound, and if it was their mother, wife or daughter would they do the Ultrasound? Good Luck.",
      "MessageIndex": 22,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738442",
      "Title": "swollen lymph nodes and puffy armpit wbts Troya78"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 20, 2009 12:54AM SandiH wrote: Hi Ladies, I had the Biopsy today, and let me be honest with you, it was virtually painless, just a little pressure, but not pain (the Mammo has more pressure). It's been about 4 hours now and it is just a little tender, no worse than a bruise. So for all of you having to have it done, the anticipation is the \"real\" pain. What I will say is, don't take Omega (Fish Oil). I had to wait to have the Biopsy done because I had taken aspirin, but they never asked about my Vitamins. After I had it done, I had a little bleeding (like you poked your finger). She asked if I was taking Omega, and I have been. She said that was why, and also said I will probably bruise a little because of it. So, if you have to have a procedure, discuss your vitamins too. She also told me that it \"feels B9\". I asked if she could really feel the difference and she said \"yes\". I will have results by Friday. AWESOME, don't have to go through the weekend wondering. I'll be over in the waiting for results. Sandi ",
      "MessageIndex": 18,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 13, 2009 04:47PM SandiH wrote: Hi Chariceak, I am really new to the whole posting thing, actually joined this week, after my diagnostic Mammo, Ultrasound, more films and unltrasound with the Radiologist. I am scheduled for my Biopsy on Monday also, so I'll be thinking positive thoughts for you, myself and all the other women out there. What I can say is, the waiting is almost unbearable, and then I think we have to wait some more. Does anyone know how long it takes to get the results back? Keep in touch. Sandi",
      "MessageIndex": 2,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 27, 2009 11:30PM SandiH wrote: Clarice - Go with your gut. If you don't have the confidence in him, look for someone else. I know it is a distance, but PEACE OF MIND, will be worth it. Sandi",
      "MessageIndex": 21,
      "PostDate": "27/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 14, 2009 06:30PM SandiH wrote: Clarice, Crap! Crap! Crap! Thats my favorite word. I just got a call that they needed to change my Biopsy to Wednesday, not Monday. So Clarice, I am still holding your hand and sending you all my thoughts. What time is the appointment and what time zone are you, because I will stop everything and just sit and hold your hand. Take an IPOD with you, listen to some Indie Arie, she's wonderful. We are all in this together. Like you I decided to take a little get away with my daughter and her two little ones to see my other daughter who lives in Phoenix. My thought was being around an 8 year old and three boys under three will keep my mind off things. It has a little. I told my girls yesterday, we believe in honesty and I was feeling I was not being truthful by withholding. Of course, the mommy in me wanted to withhold so that they didn't worry too. But the truth came out, just kept it short, sweet and simple, matter of fact. Kinda like telling them about the birds and the bees, when they were little. I like the idea of two days to find out, but just in case I think I will plan another get away. Ok ladies, I need to say, I find so much comfort in talking to each of you. Talk soon. ",
      "MessageIndex": 6,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 16, 2009 06:58PM SandiH wrote: Hi Clarice and Sheila, Us three holding hands is very, very reassuring to me. OK Sheila, you are our expert here, so I have a question for you. When I had the Mammo and Ultrasound, same day, same office, she was trying to be comforting, saying it is probably nothing to worry about but... I am scheduled for the Needle Biopsy Wed.  Question #1 Is it normal for the Radiologist to do the needle biopsy? You both are scheduled for a Breast Surgeon? She also said, she can't do the spring needle biopsy because it is too close to the rib cage and lung. I kinda got lost in the whole conversation, so didn't ask too many questions, not like me at all, so I will make sure and ask everything that is going through my head next time. #2 Was it painful and if so for how long? Sandi",
      "MessageIndex": 11,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 18, 2009 06:21PM SandiH wrote: Clarice, Well crap! Sorry you didn't have your playlist but if it is any comfort, I was thinking about you most of the day yesterday. A Blind Doctor is so much worse than a Blind Ref. Over 8 attempts, what the .... I have my appointment tomorrow, so she better have her game on, cause the number 8 is not happening. OK, all talk, if it has to be 8 so be it, but I won't be coming out a happy camper. And like you, I am mostly a positive person, but also a realist, and any kind of humor is Ok in my book. I don't think it is in their nature to be optimistic, for fear of having to be wrong. No Doctor wants to be wrong, so they are silent, unless provoked to answer. Hummm, I best come up with some questions. What should I ask? After hearing about your ordeal, I think I will reschedule my Dentist appt. I was scheduled for the Biopsy at 11 and the Dentist appt. at 4:00, to finish my crown. So I will call now to reschedule, the crown. Don't worry, I will follow you to the Waiting For Diagnosis place. We're a team now. Sandi",
      "MessageIndex": 15,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 19, 2009 04:06AM SandiH wrote: HI Clarice! Hi Sheila! and everyone else, Clarice good to hear that you're not too sore. My husband is going with me, I wonder if they will let him in? I'm going to ask. I wonder if I am to have a guided Biopsy like Sheila? I bet it will be with the sono, Sheila. Sheila it will probably happen like Clarice, go in and they do it right then and there. I hope so, the waiting, not fun. I am trying to think of questions to ask, I have so many that she can't answer, so I'll have to think of ones that she will be able to give me honest answers to. Clarice, look for your surgeon, if anything. you will be prepared. If it is good news, it just means you have a good referral for someone else. If you have support in Salinas, I say that would be a great place. I will be thinking of you ladies, and listening to my Indie Arie, don't know which one yet, just will let it shuffle. She makes me feel so at peace, although this will be a big test for her. Ok, we'll meet up in the Waiting for Diagnosis after tomorrow. I am so hoping that I get the results by Friday, I have to go back to work on Monday, and don't need a phone call at work. I'm a Counselor, and I need to keep it together. Talk tomorrow. Sandi",
      "MessageIndex": 17,
      "PostDate": "19/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    },
    {
      "AuthorID": "SandiH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87824/profile",
      "Content": "Aug 17, 2009 06:51PM SandiH wrote: Clarice, Wow! Alaska, I'm in Cali. Are you going to have to travel the 800 miles for the BS appt? Is it next Monday or today? Sheila1951 and I will be holding your hand. I think I have great options for local medical help, but when you are \"Not Diagnosed But Worried\" you do feel like you are on an island. The only thing I can say is, my island has some great people on it, thanks to these discussions. Like you, doing a lot of thinking, and either way, this has changed my life forever. I will fight for every woman out there who is going through this. I have my appointment for the Biopsy on Wed. 11:00, so I am on the countdown. When I had the mammo and ultrasound, the thing that stopped them from doing it sooner is that I took asprin for a headache - CRAP, stinking asprin.  Remember the music - let's come up with a playlist.  Sandi",
      "MessageIndex": 13,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738864",
      "Title": "Lump, worrisome mammo and u/s clariceak SandiH"
    }
  ]
}