{
  "AuthorID": "SandysDaughter",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106085/profile",
  "Posts": [{
    "AuthorID": "SandysDaughter",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106085/profile",
    "Content": "SandysDaughter wrote: I don't even know how to write this or what I'm trying to do here.  My mom, now 62, was diagnosed with breast cancer and had a mastectomy in 1992.  In 2003 we found out it was back in her bones. She'd been responding to her treatments since.  Just recently, February 2010, after a trip to the ER, we found out it has spread to her liver and there was a scary new lesion near her spine. They hit the new lesion with radiation, and she was  placed on Tykerb and Herceptin.  She had her first set of scans, in the spring and we got great news. The liver lesion had disappeared, the mets in her bone continued to stay put, and a lymph node near her lungs didn't look active anymore.  Friday we got results for the most recent body scans and it's not as great. The liver tumor is back and the bone lesions are spreading.  She's having an x-ray on Monday to see if they are going to shrink any with radiation. She's now on Tykerb, and Navelbine.  First dose of Navelbine today.  She's not feeling great.  Everything I'm readying suggests we are in the last areas for treatment.  Does anyone have similar experience that can share a time line with me?  I know nothing is set in stone, be we have grandchildren we have to start preparing and I don't know when that should happen.  I will be speaking at length with her oncologist on Monday but I am curious if anyone has ideas or suggestions I should be exploring as well.  At this point, I'm open to anything.  It's a helpless feeling and mom and I are just pissed right now with this new diagnosis. That's the only way to explain us at this point and time. She has been through SO much and losing her within months is just not ok with any of us. Thank you for your time, Andrea (Sandy's Daughter)  Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "31/07/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756123",
    "Title": "My Mom's at stage IV. SandysDaughter SandiesSoldier"
  }]
}